{"sections": [{"title": "佛朗基", "level": 1, "content": [{"type": "paragraph", "text": "佛朗基是草帽一伙第八位夥伴（8人目），職位是船匠。"}], "images": []}, {"title": "創造來源", "level": 2, "content": [{"type": "list", "elements": [{"text": "作者尾田榮一郎表示，佛朗基是從他小時候最喜歡看的「人造人009」和「假面騎士」（石森章太郎的作品）當中所得到的靈感。", "elements": []}, {"text": "「Franky」這名字可能參考自「科學怪人」的創造者「Frankenstein」。", "elements": []}, {"text": "「Franky」日文發音的後半部份和打噴嚏時的發聲一樣。", "elements": []}, {"text": "「佛朗基」這個名子可能參考自「佛朗機砲」的火砲。", "elements": []}]}], "images": []}, {"title": "人物介紹", "level": 2, "content": [{"type": "paragraph", "text": "特徵是藍色的飛機頭和太陽眼鏡，穿著海灘裝和一件三角泳褲，以及鐵製的鼻子，初登場時則戴著鐵面具和斗蓬（水之七島祭典的打扮服裝）。說話帶點老外腔調，原為水之七島的解體商兼賞金獵人集團佛朗基家族一家之主，同時也是傳說中的船匠湯姆的其中一個徒弟（湯姆只收兩個徒弟，另一個是艾斯巴古）。"}, {"type": "paragraph", "text": "8年前因事故而成為改造人，全身上下都藏著威力強大的武器，可以用身體抵擋各種攻擊，甚至一拳打散騙人布的火藥星，除此之外還擁有驚人的怪力，弱點是沒有改造的背部（因為自己替自己改造的關係），被稱作水之七島的黑社會老大。曾因搶奪草帽一伙的2億貝里和打傷騙人布而跟草帽一伙處於敵對狀態，後來在司法之島事件後，加入草帽一伙，為千陽號的創造者。"}, {"type": "paragraph", "text": "個性熱血重情義，容易因受到感動而大哭甚至拿出烏克麗麗來彈奏，被妮可·羅賓稱為很有趣的男人。總是穿著一條泳褲而被當成變態，喜歡跳自創的「變態之舞」，可是他不但不在意而且還對此引以為傲，曾經把「編隊」聽成「變態」。口頭禪有「嗯……超級－！」（ん～スーパー!）、「這個星期的我很……」（今週のおれ～）、「啊嗚」（アウ）。但普通時候也有身為年長者的常識，從客觀的觀點冷靜說話，最愛的東西就是可樂，身體或船的動力來源都以可樂來代替。擁有高超的建造技術（例如改造娜美的威霸、鬼魂島篇30秒搭建橋樑、以及香波地諸島篇為迪巴魯的坐騎加裝推進設備），騙人布有時也會幫他製作一些應急設備。"}, {"type": "paragraph", "text": "喜歡用化名稱呼熟人，例如對魯夫稱「草帽」，索隆稱「肚兜」，香吉士稱「捲眉」，騙人布稱「長鼻子」，娜美稱「大姐頭、小姑娘」，喬巴稱「鹿猩猩」，布魯克「骷髏」；而對羅賓則直稱「妮可羅賓」，尾田亦曾提到草帽海賊團如果是個大家族，佛朗基就是家中的父親（小混混）。佛朗基在羅賓印象中的花種代表為銀蓮花（秋牡丹）。"}], "images": []}, {"title": "人物經歷", "level": 2, "content": [], "images": []}, {"title": "童年成長", "level": 3, "content": [{"type": "paragraph", "text": "在南海出生的佛朗基原名卡迪·佛拉姆 (カティ・フラム, Cutty Flam)，「佛朗基」則是艾斯巴古'的綽號（因為他認為「佛拉姆」這個名字很奇怪）。他出生自海賊家庭，懂事前就隨著父母越過了偉大航道，10歲時因被父母認定難以管教而被丟棄在水之七島，船匠湯姆看上他小小年紀就擁有用垃圾製造大砲的天份，將他收養並在其手底下工作，佛朗基12歲時，造船功力就足以和水都的船匠匹敵，後期甚至與湯姆、其師兄艾斯巴古花了14年的時間共同完成了海上列車冒煙湯姆，但卻時常為了戰勝海王類而用廢船島的廢鐵製造戰艦，艾斯巴古爲此對他相當厭惡，並且告誡他要負起讓「凶器」存在於這個世界的責任。八年前（26歲那年）所作的35艘戰艦佛朗基戰鬥號（バトルフランキー号）被當時的CP5長官 斯帕達姆利用，讓湯姆吃上了襲擊司法船的罪名，但以製造海上列車的功勞抵消，之後以替「海賊王」哥爾·D·羅傑造船之罪被押送到艾尼艾斯大廳，佛朗基為阻擋帶走湯姆的海上列車被撞成重傷，幸運的是他利用附近一艘廢船上大量的鋼鐵，經過自己改造成為以可樂為燃料的改造人。由於他在水都的戶口名簿登記用上本名，除了湯姆及艾斯巴古外無人知道他有個「佛朗基」這別稱，所以世界政府只知道他叫卡迪·佛蘭姆，當時海軍因找不到他的屍體，於是宣佈佛蘭姆已經死亡。"}, {"type": "paragraph", "text": "四年後以改造人的型態和師兄艾斯巴古見面。艾斯巴古將世界政府一直窺視的古代兵器「冥王」設計圖託付給他，並要求他離開水之七島及捨棄自己的本名；但熱愛水都的他當然拒絕離開，之後便以「佛朗基」這名稱繼續居住在島上。因為自己製造的佛朗基戰鬥號傷害了恩師，致使心中留下無法抹滅的陰影，而製造戰艦的興趣也一度畫下休止符，佛朗基36號（他自己）也是最後的作品。之後他在後街收留了許多差點餓死的流浪漢，開設了以拆船為職業的「佛朗基家族」，職業是解體商，副業是賞金獵人，藉由和海賊戰鬥來贖罪，保護湯姆喜歡的水之七島。"}], "images": []}, {"title": "加入草帽一伙的經過", "level": 3, "content": [{"type": "paragraph", "text": "草帽一伙在水之七島因為「海賊綁架事件」與佛朗基家族擦出仇恨的火花，雙方老大－魯夫和佛朗基更因此在卡雷拉公司大打出手，，後因卡雷拉公司的工頭們亂入才被迫中止。然而，老家被魯夫摧毀的佛朗基仍氣憤難平，於是想利用落單的騙人布當人質引誘草帽一伙出面復仇。與騙人布見面後，因為中意其男子氣慨而想收他當手下，但騙人布卻因不想做「拆船工人」而直接拒絕了他。後得悉騙人布想駕駛已經破爛不堪的黃金梅利號回東海，為了阻止他這「自殺行為」，當下決定解體黃金梅利號。騙人布說自己其實早就知道船的情況，並謂可能黃金梅利號也自知極限將至，所以在空島以精靈狀態妖精現身告訴他們這個事實；佛朗基不但沒有質疑騙人布，還告訴他所見到的就是船的精靈「卡巴達文」，這反映草帽一伙十分珍惜他們的船。就在此時，已得知佛朗基真實身分的世界政府成員CP9來到，欲從佛朗基搶走古代兵器「冥王」的設計圖；儘管佛朗基有打倒海賊的力量，卻仍不敵CP9的「六式」，並被押上海上列車送往司法島。後他和騙人布被趁機上了海上列車的香吉士成功救出來，在得知羅賓為了救同伴而被囚禁一事之後大受感動，決定協助草帽一伙奪回羅賓，甚至不惜在CP9面前燒掉古代兵器設計圖。雖然在猶豫之橋成功救回羅賓，CP9司令官斯帕達姆卻不小心發動了「非常召集」，使羅賓再次陷入恐懼之中。佛朗基在阻止斯帕達姆趁亂攻擊的同時，提到了自己過去的經歷，因為草帽一伙的出現讓他實現幫師父湯姆報仇的願望，此舉讓羅賓突破了幼時的恐懼，決定挺身對抗世界政府。"}, {"type": "paragraph", "text": "「司法島事件」後，佛朗基把從草帽一伙那裡搶來的2億貝里當作造船費，用買到的寶樹亞當的一部份建造了新船「千陽號」。隨後，草帽一伙的懸賞單發佈出來，佛朗基也被懸賞4,400萬貝里。"}, {"type": "paragraph", "text": "佛朗基想跟魯夫一夥人出海當海賊，但卻沒有把這念頭卻告訴他人；他的小弟們和草帽一伙早已看穿他心裡所想，因此合作「強逼」他上船。他們先把佛朗基的三角泳褲搶去，使欲奪回三角泳褲的佛朗基在街道上「裸奔」引發了大騷動；泳褲在混亂中輾轉傳到魯夫手上，而索隆和香吉士則合作把他塞進大砲中，然後射向廢船島。草帽一伙以泳褲為交換條件卻無法牽制佛朗基，面對他如此固執的個性羅賓決定放狠招，以自己的果實能力「狠捏」了佛朗基的下體。即使這招讓佛朗基痛到趴在地上大聲哀嚎，但他仍堅拒魯夫的邀約，並表示這艘千陽號已是他心目中的「夢想之船」。原來，佛朗基仍一直對8年前的事情耿耿於懷，放不下保護水都的使命才不願離開；艾斯巴古瞭解他的心事，出面勸告他不該再為往事壓抑自己，是時候原諒自己了。最終佛朗基也解開了心中的迷惘，在魯夫的邀請與小弟們的護送下，以船匠身份正式加入草帽一伙。"}], "images": []}, {"title": "與草帽一伙的冒險（第一部）", "level": 3, "content": [{"type": "paragraph", "text": "鬼魂島篇魯夫擊敗了「王下七武海」之一的月光·摩利亞，後來同為「王下七武海」的「暴君」巴索羅繆·大熊奉世界政府政府之命要抹殺草帽一伙，因為和夥伴拒絕交出魯夫的人頭，被「熊的衝擊」擊中不省人事。"}, {"type": "paragraph", "text": "在香波地諸島和夥伴合力打倒了和平主義者PX-4，但已無力招架隨後出現的戰桃丸等人，並和香吉士、娜美一組，打算逃出無法地帶，在與和平主義者PX-1的戰鬥中用掉所有可樂發動「風來砲」，最後被「暴君」巴索羅繆·大熊的本尊以神祕能力彈飛。"}], "images": []}, {"title": "與伙伴分散後的冒險", "level": 3, "content": [{"type": "paragraph", "text": "被彈飛的佛朗基掉落到偉大航道冬島「機關島」上的未來國巴爾基摩亞，被當地居民發現。"}, {"type": "paragraph", "text": "在漫畫扉頁連載《佛朗基的這週我真爛》中，佛朗基被一群改造動物追趕，後來停在貝卡帕庫博士以前的住處。動畫版中佛朗基被島上的醫生放入大吉嶺紅茶而變成紳士。島上的小男孩基冬為了讓佛朗基變回原樣，將他放置在mech animal林地與改造動物搏鬥，自己卻遭改造動物襲擊深陷危機，反被佛朗基所救，後來為了取得製作可樂的資源，基冬帶領佛朗基抵達貝卡帕庫的研究所。"}, {"type": "paragraph", "text": "得知魯夫在大事件中的消息後，佛朗基試著在貝卡帕庫的研究所找出碎冰船以便逃出機關島，不慎碰到研究所內的摧毀開關，引發大爆炸。海軍為此對海軍總部提出緊急通報，此事被稱作「未來國巴爾基摩亞的噩夢」。大爆炸後佛朗基因為全身被炸的面目全非，不得已的狀況下以老虎皮套在身上來做遮掩，經過在研究所內的一番探索，佛朗基發現了貝卡帕庫遺留的兵器類發明文獻，委託當地居民讓他寄宿籬下。卻在取暖的時候不小心被爐火燒到身上披戴的老虎皮，驚慌之餘披著燃燒的虎皮竄出研究所，還將追捕他的海軍嚇的落荒而逃，結果意外的創下「未來國巴爾基摩亞的燃燒靈獸傳說」。"}], "images": []}, {"title": "與草帽一伙的冒險（第二部）", "level": 3, "content": [{"type": "paragraph", "text": "兩年後的佛朗基將頭髮剃成和尚頭（按住鼻子3秒可隨意變換髮型），同時從他的頸部兩側延伸至腹部多了兩條疤痕。由於經過肉體改造，雙手變成大型的機械手臂，雙肩的鐵球標上星星與「BF-37」的字樣，就連他的雙腿也加裝了金屬支架。扣掉第一個抵達的索隆，佛朗基比其他夥伴早十天來到香波地諸島，之後並直奔千陽號並見到兩年間一直保護千陽號的「暴君」巴索羅繆·大熊，當他和剛抵達千陽號的羅賓碰面，被羅賓當面吐槽「好像不能把你當人類看待了」，但佛朗基似乎把這句話當作誇讚他是「變態」的意思而高興不已，之後他對回到千陽號上的騙人布和喬巴小小展示了自己身上的新發明，說話時語尾也加上了「邁卡」（音同日文「機械」）。草帽一伙全員集合於千陽號後跟著夥伴們一同下潛「魚人島」。"}, {"type": "paragraph", "text": "尾隨在後的「濕髮」卡理布企圖在海上對草帽一夥發動奇襲，卻因為「海牛」哞逃走的緣故而一個人被拋棄在千陽號上，佛朗基抓住卡理布並企圖將他扔下海，但因為卡理布的求饒，讓騙人布認出卡理布的謊言。雖然佛朗基後來將卡理布扔回甲板，卻對卡理布要用散彈槍攻擊草帽一夥的行徑感到不齒。當襲擊千陽號的「kraken」（挪威海怪）被魯夫、索隆、香吉士擊敗後，由於向下海流的流速過快，導致魯夫、索隆、香吉士和千陽號失散，佛朗基正準備離開千陽號尋找失散的三人時，卻發現卡理布借由果實能力解開綑綁躲到木桶內，還釘住卡理布躲藏的木桶不讓他逃跑。"}], "images": []}, {"title": "技", "level": 2, "content": [{"type": "paragraph", "text": "身為改造人的佛朗基，除了身體藏著各種兵器外，改造後的鋼鐵肉體不怕任何子彈和大砲，但多少還是有點痛楚，而且也會流血。腹部是個小冰箱，因此為冷性體質，普通狀態是裝冰可樂，若裝的是其他飲料會呈現不同效果，連性情都會轉變。（動畫版在巴爾基摩亞的原創情節中，因為送醫急救時沒有可樂，因此用大吉嶺紅茶做為替代能源，沸騰的大吉嶺紅茶和可樂作用相同）。當可樂用完時，飛機頭會下垂。"}], "images": []}, {"title": "雙手", "level": 3, "content": [{"type": "list", "elements": [{"text": "強壯右手（ストロング・右）", "elements": []}]}, {"type": "list", "elements": [{"text": "武器左手（ウエポンズ・左）", "elements": []}]}, {"type": "list", "elements": [{"text": "佛朗基拳擊（フランキー\"BOXING\"）", "elements": []}]}, {"type": "list", "elements": [{"text": "風來砲（風来砲）", "elements": []}]}, {"type": "list", "elements": [{"text": "星星·盾牌（ホシ・シールド）", "elements": []}]}, {"type": "list", "elements": [{"text": "新鮮第一蔬菜拳（新鮮一番!お野菜パンチ ）", "elements": []}]}], "images": []}, {"title": "頭部", "level": 3, "content": [{"type": "list", "elements": [{"text": "佛朗基三角折刀（フランキートライアングルジャッカー）", "elements": []}]}, {"type": "list", "elements": [{"text": "噴射鐵釘（マスターネイル）", "elements": []}]}, {"type": "list", "elements": [{"text": "閃光火焰（フレッシュ・ファイア）", "elements": []}]}], "images": []}, {"title": "其他", "level": 3, "content": [{"type": "list", "elements": [{"text": "佛朗基蝶式（フランキーバタフライ）", "elements": []}]}, {"type": "list", "elements": [{"text": "佛朗基毀滅砲（フランキーデストロイ砲）", "elements": []}]}, {"type": "list", "elements": [{"text": "佛朗基無敵（フランキー無敵）", "elements": []}]}, {"type": "list", "elements": [{"text": "佛朗基人馬（フランキーケンタウロス）", "elements": []}]}, {"type": "list", "elements": [{"text": "佛朗基空中散步（フランキー空中散歩）", "elements": []}]}, {"type": "list", "elements": [{"text": "超重雙節棍（ヘビーヌンチャク）", "elements": []}]}, {"type": "list", "elements": [{"text": "佛朗基火箭砲台（フランキーロケットランチャ）", "elements": []}]}, {"type": "list", "elements": [{"text": "佛朗基乳頭燈（フランキーニップルライト）", "elements": []}]}], "images": []}, {"title": "合體技", "level": 2, "content": [{"type": "list", "elements": [{"text": "6億·B·JACK POT（6億B・JACK POT）", "elements": []}]}, {"type": "list", "elements": [{"text": "海賊6號合體·巨型-大皇帝（パイレーツドッキング6ビッグ皇帝）", "elements": []}]}, {"type": "list", "elements": [{"text": "超級佛朗巴 鐵拳（フラッパーゴング）", "elements": []}]}, {"type": "list", "elements": [{"text": "超巨大火鳥星（スーパーサイズ火の鳥星）", "elements": []}]}, {"type": "list", "elements": [{"text": "必殺鐵人慧星（必殺 鉄人彗星）", "elements": []}]}, {"type": "list", "elements": [{"text": "粉碎膝蓋攻擊（ニー・クラッシュ）", "elements": []}]}, {"type": "list", "elements": [{"text": "海賊3號合體·巨大 (雖然不大) 機器戰士（パイレーツドッキング3巨大(じゃないけど)ロボ戦士）", "elements": []}]}], "images": []}, {"title": "參考資料", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  ONE PIECE漫畫SBS — 44卷。", "elements": []}, {"text": "↑  ONE PIECE漫畫SBS — 43卷。", "elements": []}, {"text": "↑  ONE PIECE漫畫SBS — 48卷。", "elements": []}, {"text": "↑  ONE PIECE漫畫SBS — 60卷。", "elements": []}, {"text": "↑ 此島也是《ONE PIECE》漫畫第448話的扉頁中《艾尼路空間大作戰VOL17》所提到的「機關島」", "elements": []}, {"text": "↑ 《ONE PIECE》漫畫第523話。", "elements": []}, {"text": "↑ 《ONE PIECE》漫畫第548、549話扉頁。", "elements": []}]}], "images": []}]}