{"sections": [{"title": "多尼多尼·喬巴", "level": 1, "content": [{"type": "paragraph", "text": "多尼多尼·喬巴 (トニートニー・チョッパー, Tony Tony Chopper)，又譯作東尼·索柏、托尼托尼·喬巴，草帽海賊團的船員，是個船醫，出生於磁鼓王國，因一出生時長有藍鼻子而被父母及馴鹿族群歧視, 後來更因為誤吃人人果實被馴鹿族群拋棄、及被人類誤以為雪怪而遭受到槍擊, 後來被西爾爾克所救及收養，因西爾爾克因故過世，由Dr. 古雷娃收養、最後加入草帽海賊團。"}], "images": []}, {"title": "人物介紹", "level": 2, "content": [], "images": []}, {"title": "特點", "level": 3, "content": [{"type": "paragraph", "text": "是草帽小子一夥的第六位夥伴，職位是船醫。原為圓鼓屋頂島庫蕾哈醫生（自稱「如花似玉的139歲少女」的魔女醫生）最寵愛的馴鹿兼醫療助手。喬巴的恩人是「庸醫」希魯魯克醫生，他身為野生馴鹿時本來沒有名字，「喬巴」也是由希爾爾克給他命名的，意思是他有一對連樹木都可以輕鬆砍倒的角。雖然喬巴跟希魯魯克醫生生活了一段長時間，但將畢生醫術傳授給喬巴的授業師傅卻是庫蕾哈醫生，因此喬巴稱呼她為「朵麗兒醫娘」。喬巴的特徵是藍色的鼻子和一頂畫有「X」標記的粉紅色帽子，此帽子為希魯魯克醫生送他的禮物(是他們第一次打架過後又重歸和好的代表物)。為目前草帽一夥當中唯一出生地位在偉大航路的船員。本身很怕熱，所以喜歡的島嶼是冬天的冬島。是草帽小子一夥年齡最小的成員。人獸型的姿態下，則是夥伴中身材最矮小的成員。"}, {"type": "paragraph", "text": "以馴鹿的姿態吃下人人果實（ヒトヒトの実）的能力者，除了一般動物系能力者的三段變形（人獸型的馴鹿、獸型的馴鹿及人型的大猩猩）之外，還可以透過自己研發的「藍波球」追加四段變形，不在話下的實力已足以擊倒中上程度的敵人。擁有動物靈敏的嗅覺（因此對香水味很反感），同時也懂得動物的語言，所以常常幫動物翻譯，也因為經常太入戲使眾人惱怒。小時候因為藍鼻子而被同類視為異類，想尋求人類的溫暖卻又被當成怪物，讓他從此對陌生人抱持敵意，一遇到危險就會馬上逃走。以馴鹿的年紀來計算，喬巴現在還是小孩子，因此很天真又愛撒嬌，老是跟騙人布一搭一唱，對於誇張的謊言也會立即相信；但也像孩子一般容易哭泣，看見娜美發脾氣就會嚇得哭出來；在被人稱讚時，則完全無法隱瞞自己的情緒，會出現嘴上罵著渾蛋，手邊卻同時奉茶的矛盾動作。喬巴有個招牌動作，就是想要躲起來卻總是躲相反，反而露出大半個自己。雖然身為海賊，但也堅持醫生的立場，總是給予每個經手的病人週全的治療，也因此痛恨將人命玩弄於股掌間的行為。有時能夠利用自己豐富的醫學常識，為夥伴開啟勝利之路，隨著冒險的持續，也漸漸的培養出海賊為信念而戰的膽識。尾田曾提到草帽海賊團如果是個大家族，那喬巴就是家中的老么。喬巴在羅賓印象中的花種代表為鬱金香"}], "images": []}, {"title": "人物經歷", "level": 2, "content": [], "images": []}, {"title": "童年成長", "level": 3, "content": [{"type": "paragraph", "text": "出生磁鼓島的喬巴因為鼻子是藍色的，不但被一生下來就認為他很噁心的父母遺棄，更遭受馴鹿群歧視，即使他當時還是頭剛出生的幼鹿，卻時常獨自走在群體後面。有一天他誤食了人人果實，因為不是普通的馴鹿而遭同類合力趕走。因為想要夥伴，所以他嘗試以人的樣子來到人類的村莊，可是他的外表始終不像人類，因為他的鼻子還是藍色的。人類對喬巴那不人不鹿的模樣相當恐懼，將他當成「雪男」射殺。此事讓喬巴心中因此產生了極大的創傷，帶著無盡的孤獨和絕望一個人生活。"}, {"type": "paragraph", "text": "六年前的某一天，喬巴身受重傷倒在暴風雪中，遇到了當時被親衛隊追捕的庸醫西爾爾克，當時喬巴已經不相信任何人，又看見西爾爾克的身上有手槍（實為麻醉槍），因此發狂攻擊他。西爾爾克醫生為表清白，遂脫光衣服並說：「我絕對不會對你開槍的！」。喬巴認定西爾爾克醫生沒有要傷害他的意圖，卻因為傷重而暈倒，在希爾爾克的緊急治療下才勉強保住了性命，醒來後的喬巴看到了西爾爾克放在一旁的麵包，一口咬下麵包的同時，他也對第一次有人肯接受他這件事而痛哭流涕，之後喬巴為了養傷在西爾爾克家住了下來。西爾爾克醫生把喬巴當成自己兒子般細心照顧，並將自己的經歷當成故事告訴喬巴。原來，西爾爾克曾經是遙遠西邊國家的大盜，卻得了嚴重的心臟病，某天因為看到滿山遍野盛開的櫻花，深受感動而病癒，於是他捨棄了大盜的身分，決心要用骷髏旗醫治因現任國王瓦波爾的暴政而生病的磁鼓國，同時他也鼓勵喬巴出海到廣大的世界探索。"}, {"type": "paragraph", "text": "和西爾爾克醫生的相遇，讓喬巴第一次感受到人間溫暖。直到一年後，喬巴的傷勢已經完全恢復，西爾爾克醫生卻發現自己罹患絕症，來日已不多，為了不讓喬巴擔心，於是忍痛將他趕走，當西爾爾克求醫於磁鼓島的「魔女」朵麗兒醫娘時，喬巴偷偷聽見了兩人的談話，得知西爾爾克只剩十天壽命，故跋山涉水尋找可以治病的阿密烏菇，途中遇到馴鹿群，喬巴試圖從馴鹿群身邊走過卻反遭馴鹿首領攻擊，在他戰勝馴鹿首領並且想採集阿密烏菇時，再度被馴鹿群圍攻導致左邊的鹿角斷掉，所以有一小塊鐵片包覆（在朵麗兒醫娘治療下應該已經癒合，否則鹿角無法變形，鐵片猜測是為了紀念此事並警惕自己的裝飾）。"}, {"type": "paragraph", "text": "西爾爾克暗中懇求朵麗兒醫娘收留喬巴，朵麗兒醫娘原先以為西爾爾克在開玩笑而將他趕出去，事後她卻發現似乎有些不對勁，並趕到西爾爾克家時，家中只剩下喬巴在修養，西爾爾克為醫治生病的「醫生20」已經動身前往磁鼓國的城堡，喬巴得意洋洋的拿出阿密烏菇，告訴朵麗兒醫娘他用這個治好了西爾爾克的惡疾，反被狠狠訓了一頓，原來喬巴歷經千辛萬苦找到的「阿密烏菇」，其實是一種劇毒菇。西爾爾克明知道喬巴弄錯了，但為了感謝他的心意以及不忍心讓他失望，明知道是劇毒菇仍然喝下了阿密烏菇煮成的湯，因此反而縮短了他的性命，使得原本不到10天的壽命縮短只剩下半天可活。西爾爾克趕到城堡後，發現醫生20生病的消息是磁鼓國國王瓦爾波設下誘捕的陷阱，但他爲此對國家沒發生任何大事感到相當高興，他深信自己就算死了也能夠醫治國家的惡疾，隨後大喊著「我的人生……真是的太美好了」並飲下裝設炸彈的酒自殺身亡，瓦爾波看到這樣的結果，內心不但沒任何慚愧之意，反而將西爾爾克的死視為一個大笑話，令目賭一切的喬巴相當震怒，於是衝向瓦爾波的軍隊打算和他們玉石俱焚，被瓦爾波的幹部之一多爾頓給阻止。多爾頓為瓦波爾的所作所為跟喬巴道歉，也表示不希望再看到任何像西爾爾克一樣為了國家和平而犧牲的人喪命，喬巴才終於打消為西爾爾克報仇的念頭。西爾爾克過世後，喬巴繼承了他的遺志，立志成為能夠醫治所有疾病的萬能藥，並向朵麗兒醫娘學習醫術。"}], "images": []}, {"title": "加入草帽一夥的經過", "level": 3, "content": [{"type": "paragraph", "text": "喬巴的初次登場，是和庫蕾哈醫生一同到磁鼓島的城鎮「凱斯特」尋找病患的時候，後來因協助治療感染病毒的娜美，及身受重傷的魯夫和香吉士而首次接觸草帽一夥。在與病癒的娜美談天時，喬巴流露出對海賊的憧憬，娜美因此邀請他以醫生的身份加入，但他卻以「自己是馴鹿，不能跟人類在一起」的理由推卻了。庫蕾哈醫生聽到他們的對話，將喬巴的身世及想尋找夥伴的心結告訴娜美，並希望他們能治好他長久以來的「心病」。"}, {"type": "paragraph", "text": "魯夫在打倒瓦爾波後，多次邀請喬巴加入成為夥伴（但魯夫並不知道喬巴是醫生，只因覺得他很有趣而已），但喬巴的內心卻一直交戰著，反覆認為自己是馴鹿所以沒資格加入。經歷一整天的「邀請」與「逃避」，魯夫使盡最大的嗓子對喬巴喊叫：「少囉唆，跟我們走就是啦！」，這一喊不但沖走了喬巴的猶豫，也給予他出海的勇氣。在向庫蕾哈醫生道謝以後，喬巴便隨著草帽一夥離開，並正式成為他們第五位夥伴。"}, {"type": "paragraph", "text": "喬巴的成長經過及加入草帽一夥這段故事，曾被改編、重新製作成劇場版《ONE PIECE THE MOVIE 喬巴身世之謎 ：冬季綻放、奇跡的櫻花》。"}], "images": []}, {"title": "與草帽一夥的冒險（第一部）", "level": 3, "content": [{"type": "paragraph", "text": "阿拉巴斯坦篇，喬巴與騙人布聯手擊敗Mr.4與Miss聖誕節雙人組，當魯夫在祭葬殿擊敗了當時的王下七武海之一的沙·克洛克達爾之後，魯夫利用自身的能力特性，將索隆與喬巴一起帶回地表和其他人會合。而妮可·羅賓在黃金梅利號現身時，喬巴雖然一開始對羅賓有著幾分畏懼，但因為羅賓利用「花花果實」的能力對魯夫開玩笑，使得騙人布與喬巴跟著魯夫起鬨大笑之餘，對羅賓也不再像先前那麼顧忌。"}, {"type": "paragraph", "text": "空島篇，喬巴戰勝了四神官的涅盤，卻敗在修羅、歐姆和艾涅爾手上。爾後在長環島與弗克西海賊團舉辦競賽時，喬巴和羅賓一度因為被對方選定為俘虜的船員，使得兩人只得在一旁觀賽，索隆更因為喬巴被對方選走講出的喪氣話出言訓斥他。由於魯夫最後戰勝了弗克西，喬巴和羅賓順利回歸草帽一夥。但後來草帽一夥遇上了三大將之一的「青雉」庫山展開決戰不幸敗北，魯夫、索隆、羅賓、香吉士更因此遭到凍傷，騙人布與娜美協助喬巴將凍傷的四人帶回黃金梅利號，而喬巴也在事後幫助四人處理凍傷的傷勢。"}, {"type": "paragraph", "text": "水都篇，由於騙人布被佛朗基家族毆傷並搶走兩億貝里一事，喬巴跟著魯夫、索隆、香吉士大鬧佛朗基家族的基地為騙人布報仇。他和羅賓逛街的時候，最先警覺到羅賓失蹤的狀況，和香吉士再次遇到羅賓勸她歸隊，但因為羅賓堅持離開只得無功而返。在司法島事件中，索隆和狙擊王（騙人布）的手在戰鬥中不小心被「海樓石手銬」銬在一起而無法戰鬥，兩人要喬巴去找能解開手銬的「2號鑰匙」，喬巴卻在尋找鑰匙的途中意外捲入了娜美與CP9之一的偎取的戰鬥，而在同時，香吉士為了守住自己的騎士之道，被CP9之一的卡莉法擊敗，摔落在娜美與喬巴兩人的面前，喬巴讓娜美去找卡莉法，自己則是留下來和偎取戰鬥，但面對偎取壓倒性的力量，喬巴很快就處於劣勢，為了賭自己的勝算而吞下了第三顆「藍波球」，以暴走型態擊倒了偎取，但卻因此變的敵我不分，開始瘋狂攻擊自己眼前所看到的一切，後來佛朗基聽從娜美的建議，以一發「風來砲」將喬巴打落下海才解除了危機，從夥伴們救回羅賓到全員搭乘黃金梅利號逃走的期間，喬巴的身體一直處於動彈不得的狀態，司法島事件結束後，因為沒有任何海軍目擊到喬巴戰鬥而把他當成寵物，懸賞金只有50貝里，讓他很不能接受。"}, {"type": "paragraph", "text": "鬼魂島篇，喬巴對自己所崇拜的名醫赫古巴庫玩弄生命的行為感到相當憤怒，並以自己的力量，成功讓殭屍辛朵莉身為人類時的心徹底反抗赫古巴庫命令，魯夫擊敗了「王下七武海」之一的月光·摩利亞後，同為「王下七武海」之一的「暴君」巴索羅繆·大熊奉世界政府之命要抹殺草帽一夥，因為和夥伴拒絕交出魯夫的人頭，被「熊的衝擊」擊中不省人事。"}, {"type": "paragraph", "text": "在香波地諸島和夥伴合力打倒了和平主義者PX-4，但已無力招架隨後出現的戰桃丸等人，並和魯夫、羅賓一組，打算逃出無法地帶，眼看夥伴一個個被和平主義者PX-1擊倒而陷入恐慌，再度使用第三顆「藍波球」變成暴走型態，仍然被巴索羅繆·大熊的神祕能力彈飛。"}], "images": []}, {"title": "與夥伴分散後的冒險", "level": 3, "content": [{"type": "paragraph", "text": "被彈飛的喬巴掉落到南海的「鳥類王國」特里諾王國，遭巨鳥從巢中踢走後被當地居民捕獲。在漫畫扉頁連載《喬巴可不是桌上佳餚啊混帳》中，差點被煮熟的喬巴成功脫險，同時目睹了巨鳥與居民的對戰。動畫版則加入了喬巴差點被島民當成火鍋時巨鳥們亂入，以及與巨鳥幼雛逃避當地居民追捕的情節。"}, {"type": "paragraph", "text": "待在特里諾王國期間，喬巴化解了村民與巨鳥之間的誤解，使大家和平共處；後乘騎巨鳥前往香波地諸島與夥伴們會合，途中卻從報紙中得知路飛在「大事件」後的消息。在讀得「只有夥伴才能明白的訊息」後，為了汲取更多知識以獲取更強的力量，折返特里諾王國，向居民請教有關當地草藥的相關知識。"}], "images": []}, {"title": "與草帽一夥的冒險（第二部）", "level": 3, "content": [{"type": "paragraph", "text": "兩年後的喬巴，頭上配戴的粉紅帽子變成有交叉圖案的兜帽，獸型狀態下的體格也變得比以往健壯，毛質也更蓬鬆。他比香吉士、布魯克、魯夫、羅賓早一天抵達了香坡地諸島，並且在香坡地諸島的遊樂園區，遇上假草帽一夥的團員企圖拐騙他，後來因為其他人口販子將假扮羅賓的海賊帶走，喬巴這才意外脫險，他卻誤認真正的羅賓被人口販子綁架而驚慌不已。及後他再次遇見假草帽一夥，誤認他們是真正的草帽一夥並告知羅賓被擄走一事，但喬巴由於假草帽一夥對此不予理會而淚奔離去。和真正的騙人布與娜美相會後，喬巴才驚覺先前遇到的「草帽一夥」是冒牌貨，雖然生氣有人冒充他們，但又對自己似乎已經變出名這件事感到相當開心。當海軍前來捉拿草帽一夥時，先前在特里諾王國受到喬巴幫助的巨鳥，將魯夫、索隆、香吉士、喬巴運回到千陽號上，喬巴感謝巨鳥的協助並向牠道別。草帽一夥全員集合於千陽號後跟著夥伴們一同下潛「魚人島」。"}, {"type": "paragraph", "text": "魚人島篇，喬巴發現香吉士開始容易在見到美女時狂噴鼻血，利用照片協助香吉士作矯正治療。當「kraken」（挪威海怪）襲擊千陽號的時候，喬巴為了保護千陽號，吞下一顆藍波球並使用「毛皮強化」，順利的為千陽號與船上的同伴擋下kraken的強力衝擊。進到魚人島後，一行人被激烈的海流沖散，先前在香坡地諸島認識的人魚海咪救了魯夫、騙人布、香吉士和喬巴。當香吉士因為無法壓抑對人魚的好奇心，噴出超過平常失血量的鼻血時，海咪帶著魯夫等人來到珊瑚之丘，由喬巴為香吉士進行輸血急救。"}], "images": []}, {"title": "技能", "level": 2, "content": [{"type": "paragraph", "text": "喬巴是動物系「人人果實」馴鹿能力者，由於人人果實沒有類似的種類，因此屬於相當稀有的惡魔果實，人吃了只會變成旱鴨子，在動物吃下果實的情況下，能力者會獲得理解人類語言的能力。擁有最基本的三段變形：人型態、人獸型態及獸型態。後來在喬巴花了五年進行的研究下，找到了另外四種型態。"}, {"type": "paragraph", "text": "「藍波球」 (ランブルボール, 「藍波球」)，一種可以擾亂動物系惡魔果實的變形波長的藥物，由喬巴研究出來，不過效力只有三分鐘。可以額外產生4個變形階段。喬巴服用後可以暫時具有重量強化、跳躍強化、毛皮強化、腕力強化、頭腦強化、角強化、腳力強化等能力。但是此藥物是種劇藥，若在六小時內服用第二顆時，則無法控制變形波長，服用第三顆時，會失去意識，惡魔果實會開始暴走，會變成一個巨型「怪物」。雖然擁有強大無比的破壞力，但因為無法控制力量，生命力會急速下降，若不趕緊施打麻藥或將能力者推入海中（用海樓石也可以）使惡魔果實無力化或停止他的行動，將會有生命的危險。"}], "images": []}, {"title": "第一段變形", "level": 3, "content": [{"type": "list", "elements": [{"text": "腳力強化（ウォークポイント）", "elements": []}]}], "images": []}, {"title": "第二段變形", "level": 3, "content": [{"type": "list", "elements": [{"text": "重量強化（ヘビーポイント）", "elements": []}]}], "images": []}, {"title": "第三段變形", "level": 3, "content": [{"type": "list", "elements": [{"text": "頭腦強化（ブレーンポイント）", "elements": []}]}], "images": []}, {"title": "第四段變形", "level": 3, "content": [{"type": "list", "elements": [{"text": "彈力強化（ジャンピングポイント）", "elements": []}]}], "images": []}, {"title": "第五段變形", "level": 3, "content": [{"type": "list", "elements": [{"text": "毛皮強化（ガードポイント）", "elements": []}]}], "images": []}, {"title": "第六段變形", "level": 3, "content": [{"type": "list", "elements": [{"text": "腕力強化（アームポイント）", "elements": []}]}], "images": []}, {"title": "第七段變形", "level": 3, "content": [{"type": "list", "elements": [{"text": "鹿角強化（ホーンポイント）", "elements": []}]}], "images": []}, {"title": "第八段變形", "level": 3, "content": [{"type": "list", "elements": [{"text": "柔力強化（カンフーポイント）", "elements": []}]}], "images": []}, {"title": "藍波球複數使用", "level": 3, "content": [{"type": "paragraph", "text": "「藍波球」原本就是一種「強迫將不可能化為可能變形的劇藥」，六小時之內如果複數使用將無法控制變形波長，要變成想要的變形只有7分之1的機會，而如果服用第三顆，會失去意識，無法控制自我，會一直暴走、破壞，終至體力不支而死亡（喬巴通常只在憤怒到了極點或無計可施的時候使用）。此變形是惡魔果實失控所造成，原因是吃下第三顆「藍波球」，身體會巨大化，為人獸型，雙眼轉為藍色，腳力、重量、頭腦、彈力、毛皮、腕力、角力各部位都會強化，使攻擊無效，擁有超強之實力，弱點就是海水。因為海水會使惡魔果實失效，故變形也隨之消失，但會有一段時間無法移動。喬巴的這種失控狀況目前曾發生過三次："}, {"type": "paragraph", "text": "作者尾田榮一郎曾提到，如果喬巴吃了4顆「藍波球」作者就會暴走；如果吃了5顆「藍波球」就會換讀者暴走了。"}], "images": []}, {"title": "合體技", "level": 2, "content": [{"type": "list", "elements": [{"text": "必殺騙人喬 鐵鎚彗星（必殺ウソッチョハンマー彗星）", "elements": []}]}, {"type": "list", "elements": [{"text": "海賊6號合體·巨型-大皇帝（パイレーツドッキング6ビッグ皇帝）", "elements": []}]}, {"type": "list", "elements": [{"text": "羅賓喬巴背橋摔（ロビ･チョ･スープレックス）", "elements": []}]}, {"type": "list", "elements": [{"text": "超級佛朗巴 鐵拳（フラッパーゴング）", "elements": []}]}, {"type": "list", "elements": [{"text": "空軍櫻花SHOOT（空軍刻蹄桜シュート）", "elements": []}]}], "images": []}]}