{"sections": [{"title": "托拉法爾加·D·瓦特爾·羅", "level": 1, "content": [{"type": "paragraph", "text": "特拉法爾加·D·瓦特爾·羅，更常用的稱呼是托拉法爾加·羅 (トラファルガー·ロー, Torafarugā Rō, Trafalgar Law)，人稱死亡外科醫生，是一名北海出身的海賊，紅心海賊團的船長。最惡的世代（即兩年前的十一位超新星）之一，當時的懸賞金為2億貝里，在11人中排名第5位，兩年後懸賞金提高至4億4千萬貝里。兩年期間成為了王下七武海之一。"}], "images": []}, {"title": "外貌", "level": 2, "content": [{"type": "paragraph", "text": "頭戴有斑點狀圖案的毛帽，眼圈很深，手臂到手背都有龜甲圖案的刺青，每個手指則分別刺有英文字「Death」（死），下巴蓄著一小撮鬍子，使用的長刀，劍鞘外表從上到下都刻有「十」字型的小圖案，主體為黑色，劍鐔上有毛茸茸的護物。"}], "images": []}, {"title": "性格", "level": 2, "content": [{"type": "paragraph", "text": "時常微笑着，笑意中帶有諷刺、輕蔑、挑釁等的意思，為人腹黑、冷漠、冷靜，桀驁不遜，語氣有時帶些散懶與無奈，心思慎密心計強，不喜歡被人命令。對人禮儀不功不過，會無言諷刺對別人比中指（動畫中被修正為對別人看一眼便不理會），稱呼其他船長喜歡加「當家的」為後綴。「海鳴」亞普表示，羅是個以殘忍而聞名的海賊。"}], "images": []}, {"title": "人際關係", "level": 3, "content": [{"type": "list", "elements": [{"text": "父親（名不詳，已歿） 醫生 已於羅10歲那年死於福連伯斯的戰爭。", "elements": []}, {"text": "母親（名不詳，已歿） 醫生 已於羅10歲那年死於福連伯斯的戰爭。", "elements": []}, {"text": "妹妹 菈米（已歿） 無 已於羅10歲那年死於福連伯斯的戰爭。", "elements": []}, {"text": "紅心海賊團", "elements": []}]}], "images": []}, {"title": "能力與技能", "level": 2, "content": [{"type": "list", "elements": [{"text": "能力者，可以在自己製造的圓圈空間里進行物件轉換，將物體在他控制的範圍內組合與分離的能力，被分離的人在當下不會死、不會痛（但是分離的個體受到攻擊仍會感到疼痛）、也不會流血（受到其他人攻擊也會流血），曾把多名海軍分體，重新混亂組裝。", "elements": []}]}, {"type": "list", "elements": [{"text": "ROOM·屠宰場 在製造的圓圈空間里進行物件轉換，將物體在他控制的範圍內組合與分離，被分離的人不會死、不痛、也不流血。", "elements": []}, {"text": "混亂空間 將心臟調亂 使被施術者 意志轉移", "elements": []}, {"text": "手術刀 奪取敵人的心臟", "elements": []}]}], "images": []}, {"title": "經歷", "level": 2, "content": [], "images": []}, {"title": "第一部劇情", "level": 3, "content": [], "images": []}, {"title": "童年時期", "level": 4, "content": [{"type": "paragraph", "text": "童年時代的羅於單行本SBS專欄首度露面，當時的他已經開始配戴斑點毛帽，有著黑眼圈，身穿襯衫和短褲，手邊還拿著解剖用的小刀和青蛙。"}, {"type": "paragraph", "text": "羅出生自名盛產珀鉛而聞名天下的「白色城鎮」福連伯斯，自幼便在從醫的雙親的薰陶下，習得許多醫療方面的知識。原本和雙親及妹妹菈米過著幸福的生活，直至10歲那年，羅翻閱自己的醫療資料，才得知自己僅剩3年兩個月的壽命。其實為世界政府長期刻意隱瞞珀鉛被開發便會散發毒性和長期於接觸者體內累積毒素的特質，以至於包含羅在內的福連伯斯居民皆罹患了會使病患及其後代膚色異常蒼白且縮短壽命，最終乃至於令病患斷絕子嗣的「珀鉛病」，而被蒙在鼓裡的的福連伯斯居民仍持續地開發並拓展珀鉛業，並未意識到珀鉛礦的危險性。"}, {"type": "paragraph", "text": "後來，大半罹患珀鉛病的福連伯斯居民均於此時併發症狀，但由於世界政府刻意置之不理，加上鄰國誤認珀鉛病為可怕的傳染疾病，陸續對福連伯斯實行隔離措施，甚至不分青紅皂白殺害染病的福連伯斯居民，終於令福連伯斯為了自衛而和鄰國爆發戰爭。戰亂中，羅親眼目擊雙親被敵軍持槍射殺，連重病的妹妹和其餘無辜鎮民皆無法倖免於難，絕望悲憤之餘，死命逃離遭戰火摧毀的家鄉，自此認定世界政府是害他家破人亡的元兇，開始仇視任何海軍與世界政府有關聯的人士，並立誓將放眼所及的一切全數摧毀。"}], "images": []}, {"title": "隸屬唐吉訶德家族時期", "level": 4, "content": [{"type": "paragraph", "text": "逃出福連伯斯後，羅將自己的全身綁滿炸彈，親自造訪年輕時的多佛朗明哥，要求對方讓他加入唐吉訶德家族的海賊團。最初，多佛朗明哥對於一個小孩竟明目張膽的闖進他的本營感到詫異，羅即告訴多佛朗明哥，他已經不久於人世，想將放眼所及的一切全數摧毀。多佛朗明哥從羅的身上看見兒時自己的影子，更料到羅會在10年後成為自己的左右手，於是他表示自己正從事黑市貿易，而盜賣惡魔果實是常見之事，遂提出讓羅在3年內尋找可治癒自身疾病的惡魔果實的條件，同意讓羅成為唐吉訶德家族的成員。加入唐吉訶德家族沒多久，羅立誓要在3年內將所有的一切摧毀，卻在首次遇見時任花色幹部之「二代」柯拉遜（Corazon，紅心）暨海軍臥底中校的多佛朗明哥之弟唐吉訶德·羅希南特時被其拋摔出屋外而受挫，繼而對其特立獨行的作為留下深刻印象。羅試圖持刀刺殺羅希南特未遂，未料羅希南特不僅沒有舉報羅的作為，而且還選擇掩護他。其後羅在家族中經過高級幹部帝雅曼鐵、拉歐·G、古拉迪斯的指導，學習精湛的刀術、體術和炮術。"}, {"type": "paragraph", "text": "直至暗殺羅希南特未遂的兩年後，羅於某日向唐吉訶德家族的成員BABY-5和水牛透漏自己的諱名和隱名，被得知消息的羅希南特約去私談，羅希南特神色緊張地告誡羅不應該留在多佛朗明哥的身邊，表示多佛郎明哥性格裡的惡之根源是與生俱來，是個名符其實的「怪物」，還告知羅其實是和天龍人對立，被稱做「神的天敵」的「D的一族」的血脈成員。羅見到羅希南特如此掩護他，有感於對方曾幫忙掩飾他兩年前試圖刺殺其的恩情，遂取消向幹部告密的念頭，羅希南特則冒著觸怒多佛朗明哥的風險，帶著羅出海四處尋求可醫治珀鉛病的名醫。受到福連伯斯戰爭和眾人以訛傳訛的影響，許多國家的醫院紛紛對患病的羅，表現出歧視與畏懼的眼光，羅希南特仍義憤填膺地為羅打抱不平，令因為戰爭喪親的羅再度感受到人性的溫暖，為羅希南特的無私付出感到動容。羅希南特帶著羅出海尋醫的半年後，多佛朗明哥忽然致電給羅希南特，告知兩人海軍已經準備龐大的交易額，欲購得可醫治羅的「手術果實」，而不明其價值的海賊正準備接受這筆交易，並希望由羅希南特親自服用這顆果實。但是羅希南特因為已經服用「寧靜果實」成為惡魔果實能力者，無法再接受第二顆果實的能力，更因此察覺多佛朗明哥已經發現他的臥底身分，欲置他於死地，於是決定協助羅介入這場海軍與海賊的交易。羅希南特透過電話蟲和人在海軍本部的「佛」之戰國聯繫，確認唐吉訶德海賊團成員會在3週後於交易進行的3天前，抵達北海的魯貝克島，而海軍將會在鄰近的斯瓦羅島進行埋伏，藉此機會將包含多佛朗明哥在內的唐吉訶德海賊團成員徹底殲滅。"}, {"type": "paragraph", "text": "然而，羅的病情卻於此時忽然惡化，羅希南特迪為了拯救羅的生命，毅然冒著會和多佛朗明哥、海軍和世界政府為敵的風險，決定搶在多佛朗明哥之前取得「手術果實」，兩人遂搭乘小船挺過暴風雨的襲擊，成功地在交易進行的3天前，抵達欲和海軍交易的海賊暨原海軍將校迪耶斯·巴雷路基駐紮的密尼翁島。羅希南特運用「寧靜果實」的能力趁隙襲擊迪耶斯·巴雷路基所屬的海賊團，成功奪得「手術果實」並讓羅服下，卻在準備和羅會合的途中遭敵方開槍射傷，用盡力氣而無法動彈，遂委託羅將能夠整救多雷斯羅薩的關鍵資料交付給特定海軍，卻沒想到該名特定海軍竟是「初代」柯拉遜暨多佛朗明哥派往海軍擔任間諜的「鬼竹」威爾可，羅希南特眼見自己臥底的身分被揭發，連準備交給海軍的關鍵資料亦被威爾可攔截，自己還被毆成重傷，在多佛朗明哥得知消息後亦指示旗下幹部抵達島上並準備將他滅口，還運用惡魔果實能力形成「鳥籠」將島上所有人困於其中。"}, {"type": "paragraph", "text": "羅希南特意識到自己的生命已經走至盡頭，因此他亦希望留給羅的是自己的笑容，遂指示羅躲藏在某個寶箱裡，還特意使用「寧靜果實」的能力保證羅在這段期間無法發出聲音，並且在關上寶箱前，細聲告訴羅「我愛你」這句話。最終，羅在寶箱裡躲藏的期間，親耳聽見羅希南特為替他爭取自由而遭多佛朗明哥開槍射殺的經過而悲慟不已。待羅希南特斷氣後，羅趁隙離開寶箱準備逃離該座島嶼，為羅希南特的犧牲在島上放聲哭嚎，雖因為「寧靜果實」的能力隨著羅希南特的死去解除，令哭聲傳遍了整座島嶼，但剛好鶴的軍艦正對島上展開炮擊，致使炮擊聲把羅的哭聲給隱蓋住，讓唐吉訶德海賊團的團員並沒有發覺到羅其實還在島上，而羅也順勢脫離家族，其後並成為紅心海賊團的船長。多佛朗明哥稱仍將羅視為自己的弟弟般看待，甚至為了他至今保留著花色幹部之一「三代」柯拉遜的位置，但其實羅已經為羅希南特被多佛朗明哥殺害一事對他懷恨在心，亦埋下日後對多佛朗明哥復仇的伏筆。"}], "images": []}, {"title": "天龍人事件", "level": 4, "content": [{"type": "paragraph", "text": "初次登場的時候，羅和部下正在夏波帝諸島的街上休息，當「赤旗」多雷古挺身阻止「殺戮武士」奇拉和「怪僧」烏魯基的攻勢後，羅以一派輕鬆的態度，詢問多雷古又殺了多少人。[[File:托拉法爾加·羅.png|200px]]"}, {"type": "paragraph", "text": "羅帶著部下到人口販賣場，遇上其後抵達的基德海賊團，以及為解救人魚海咪來到此處的草帽海賊團。他在與尤斯塔斯·基德碰面時露出一副不屑態度，甚至還直接朝對方比中指（動畫版改成回頭看一眼便不理會）"}, {"type": "paragraph", "text": "天龍人事件中，曾與草帽一夥以及基德海賊團聯手對付海軍，其後，魯夫為了替被槍傷的小八出氣，直接出拳揍飛射傷他的天龍人（查爾羅斯），引起附近大量海軍包圍人口販賣場。留在現場的羅與基德被海軍視為魯夫的同夥兼主謀，被迫與草帽海賊團聯手對付海軍、殺出逃生路線。 在與海軍進行大混戰之餘，由於草帽海賊團大鬧人口販賣場並解放奴隸的緣故，被羅茲瓦德買下作為奴隸坐騎的巨人海賊強帕爾也因此獲釋，並成為他旗下的新成員。不料卻在之後碰上海軍的「和平主義者」，頓時陷入苦戰。"}], "images": []}, {"title": "頂點戰爭", "level": 4, "content": [{"type": "paragraph", "text": "「頂點戰爭」事件爆發時，與手下啟航離開夏波帝諸島，前往海軍本部營救魯夫，險遭上將「黃猿」波爾薩利諾襲擊。逃出海軍總部後，羅利用船上的急救設施對魯夫和「海俠」吉貝爾施與治療，因為擔心魯夫安危、而派遣寵物蟒蛇薩洛梅追蹤羅等人的「海賊女帝」波雅·漢考克，利用能力奪得一艘海軍軍艦和羅會合，並建議羅前往女人島暫避風頭讓魯夫休養（漫畫版羅等人僅在岸邊做短暫停留，動畫版護國戰士還曾經親自發放食物給羅等人）。在女人島短暫駐留後便啟程離去。之後，羅及其海賊團並沒有即時進入「新世界」，羅則表示他正等待合適的時機奪回該屬於他的東西。"}], "images": []}, {"title": "第二部劇情", "level": 3, "content": [], "images": []}, {"title": "龐克哈薩特篇", "level": 4, "content": [{"type": "paragraph", "text": "兩年後的羅頭髮略有變長，毛帽改成了貝雷帽，服裝也從原本的帽T輕便穿著變成高領大衣，在「頂點戰爭」結束兩年後的第二部劇情中，藉由奪取100名海賊的心臟，成為新任的「王下七武海」。他在數個月前為了調查世界政府的研究資料來到龐克哈薩特，但凱薩為了預防羅往後可能的叛變，作為協議要收走他的「心臟」，羅則得到凱薩的秘書莫內的心臟。"}, {"type": "paragraph", "text": "羅並以能力替島上那些無法行走的囚犯與海賊分別裝上了動物的腳，讓他們相當感激，龐克哈薩特篇中羅因為收到半人馬團成員的「緊急信號」趕往現場，將鬧事的和之國武士錦衛門砍成3段並分別丟在燃燒島（下半身）、冰凍島（上半身）、實驗所監牢（頭顱），當斯摩格為了追捕魯夫等人而來到龐克哈薩特的冰凍島時，羅出現在建築內，並表示這兒是他的別墅。斯摩格試圖入內調查，但遭羅拒絕；正在此時，草帽海賊團的娜美、喬巴、佛朗基和香吉士為了營救屋子裡面的小孩，從羅的別墅後方衝了出來，令他感到相當無言。之後，達絲琪命令部下追捕草帽海賊團，羅卻率先運用能力令他們的軍艦上下顛倒，阻止斯摩格等人離開此處，並對海軍們動武，運用能力將達絲琪等人剖成兩半；同時，羅又把逃跑中草帽海賊團其中4人的心臟互相對調 其後達絲琪不甘受辱，要求羅直接了結她的性命，反被羅以「弱者沒資格選擇死亡的形式」為由拒絕。斯摩格見到部下紛紛敗在羅的手上，挺身與羅展開決戰，並質問羅的背後是否有任何幕後人士在暗地操作；結果羅不但拒絕回答斯摩格的疑問，更反過來詢問海軍的目的為何，最終還趁著斯摩格不留意的時候，利用果實能力取出斯摩格的心臟，使其不支倒地。"}, {"type": "paragraph", "text": "此時，魯夫抵達羅的所在之處，還因為見到羅而高興不已。羅表示兩年前拯救魯夫的事情只是一時興起，根本不足掛齒；魯夫雖理解羅同樣也是以「ONE PIECE」為目標的競爭對手，仍當面對羅兩年前拯救他和吉貝爾一事表達感激。之後，羅告訴魯夫他們互相都有必須取回的事物，便指引魯夫等人抵達研究所的後方，自己則留在現場將斯摩格與達絲琪的身心對調，並將斯摩格的心臟交給Dr.貝卡帕庫的前同僚兼通緝犯凱薩·克勞恩（但後來透露，羅當時暗地將斯摩格及莫內的心臟對調，故交給凱薩的其實是莫內的心臟）。雖然羅為了能夠在島上自由行動，選擇和凱薩暫時合作，卻對凱薩利用興奮劑控制被囚禁的小孩感到相當不齒，更形容對方和「某個人」同樣卑鄙，隨即在離開研究所的同時，將附近的守衛利用能力大卸八塊，並且趕在雪山兄弟準備對調換到佛朗基身體的娜美下手前，瞬間擊敗雪山兄弟之一的史考基，對魯夫提出將四皇「百獸」海道拖下馬的合作計畫，順勢將佛朗基與喬巴換回原本的身體裡（但由於被轉換到娜美身體裡的香吉士當時不在場，結果娜美反而被換到香吉士的體內，還被草帽海賊團取笑一番）。"}, {"type": "paragraph", "text": "起先羅本來打算專注於引誘凱薩落入陷阱的計畫，但因為草帽海賊團堅持要救出被凱薩誘騙囚禁的孩子們、讓身體被切成3段的錦衛門恢復原狀，轉而和草帽海賊團協商分頭行動，以便於達到雙方分別追求的目標，隨即帶著因為被佛朗基擅自發動「怪物型態」、受到藍波球副作用影響而無法動彈的喬巴先行出發。起先騙人布拿著繩子將喬巴固定在羅的毛帽上，令草帽海賊團當場哄堂大笑；不過羅對此則是感到既錯愕又尷尬，只好將喬巴綁在他的劍鞘上偽裝成吊飾展開行動。魯夫海賊團來到了研究室前，並且遇到了中將斯摩格和凱薩，和他們展開混戰，抓到了凱薩後，魯夫因為凱薩的瓦斯攻擊而昏倒。另一方面，回到研究室的羅，看到凱薩不在研究室，只剩莫內一人。羅對莫內誆稱需要她的協助，把莫內引出去，卻在和莫內行至研究室走廊的途中，突然抓著左邊胸口跪下，在地上不停的喘氣，嘴角不停的流出血。此時，威爾可出現在羅的面前，表示自己因為不信任凱薩，才將莫內安排在凱薩身邊擔任間諜的真相，隨即利用「武裝色霸氣」將羅毆打成傷，並把被凱薩的能力打倒的草帽海賊團3人（魯夫、佛朗基、羅賓）斯摩格和達絲琪一同囚禁在牢裡"}, {"type": "paragraph", "text": "凱薩為了測試惡魔果實的性能，利用史麥利在龐克哈薩特島展開大屠殺，準備將囚禁在牢裡的一行人拋入毒氣範圍內的時候，羅委託佛朗基燒毀附近的海軍軍艦，藉著濃煙掩蓋監視器的視野範圍，利用能力為一行人解除身上的鎖鍊，還讓身心遭到調換的達絲琪和斯摩格恢復原狀，但也對斯摩格提出「不得將關於他和JOKER（多佛朗明哥）的事情公諸於世」的交換條件。隨即接受娜美的請求，將身心遭到調換的香吉士和娜美恢復正常狀態，潛入研究所深處卻再次碰見和多佛朗明哥串通、準備取其性命的威爾可，因自己的心臟受到牽制，不敵對手的攻勢而遭到重創。千鈞一髮之際，斯摩格及時趕到現場，和威爾可一決勝負。在威爾可和斯摩格交戰期間奪回自己的心臟，將威爾可的身體一刀兩段，並大卸八塊棄置在即將爆炸的房間中。"}, {"type": "paragraph", "text": "凱薩、BABY-5和水牛敗北後，羅運用「手術果實」的能力，幫助長期被凱薩當成實驗對象的孩童清除體內的毒素，為了不讓喬巴因為見到孩童們被分離肢體的畫面而受到驚嚇，還堅持不讓喬巴窺看裡面的情況（但是被羅取出體內毒素的孩童們，卻覺得見到自己身體漂浮半空中的體驗相當新鮮有趣）。當斯摩格問及他究竟想利用魯夫做何種計畫時，羅回憶起當初和魯夫協議合作拉下「百獸」海道的時候，魯夫曾做出「要將所有的四皇全數擊倒」的發言，還忍不住笑稱「已經不清楚究竟是誰在利用誰了」。隨即利用能力砍下BABY-5和水牛的首級，將之放置在救生艇，利用電話蟲要與多佛朗明哥做「交易」，在四皇「百獸」海道交惡（會導致多佛朗明哥海賊團覆滅）與放棄「七武海」地位（會導致海軍上將攻擊）做選擇，讓多佛朗明哥怒髮衝冠。"}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/88/Trafalgar_Law_on_Punk_Hazard.png/revision/latest/scale-to-width-down/136?cb=20160826131503&path-prefix=zh", "caption": "龐克哈薩特篇的羅"}]}, {"title": "和之國篇", "level": 3, "content": [{"type": "paragraph", "text": "這時培波卻因為吃了河裡受污染的魚中毒，而路飛在博羅鎮引起的騷亂越來越大，搞得羅一個頭兩個大。 羅特意喬裝到博羅鎮把風，卻撞見了霍金斯。為了不讓身份曝露，打算把霍金斯拿下。"}, {"type": "paragraph", "text": "羅二話不說便使出「ROOM」，但是為了不想要驚動百獸海賊團的幹部們，只打算嚇嚇霍金斯。羅對霍金斯使出屠宰場，卻發現霍金斯的部下們代替他承受攻擊，覺得奇怪，但還是很快就摸清了他的能力，并一口氣把他的部下們都砍成兩半。但是霍金斯已經猜出他的身份，還告訴他路飛的事，令他十分吃驚。兩人的對話被劫持了寶船的路飛和索隆打斷，羅也順道上了寶船和他們會合。上船后他馬上斥責索隆放任路飛大鬧博羅町。過後羅便帶路飛到御田城的遺跡去見見光月家族的墓碑。隨後羅發現龍型態的海道在找魯夫他們，便跟著魯夫一起去破落鎮上。魯夫途中看到大火所在的御田城被毀，想與海道決鬥。羅試圖勸阻，但反被他的質問說不出話。魯夫隨後與海道決鬥卻反被秒殺。羅想救他，卻再度被霍金斯阻止。"}, {"type": "paragraph", "text": "隨後，羅回到惠比壽鎮與娜美等人會合，卻因為洩密的事情被忍猜忌而憤怒並離去。之後羅到了羅剎鎮，見到了培波等人在牢中，又發現阻止他的霍金斯，竟然對他的夥伴們下咒。最後決定以自己為條件，換取船員的人身安全。之後，他在牢中打倒了霍金斯，並盤問出他們的海賊同盟究竟是怎麼一回事。接著發現某人出於某種陰謀而想放走他，決定將計就計。"}], "images": []}, {"title": "瑣事", "level": 2, "content": [{"type": "paragraph", "text": "取自18世紀的英國海賊艾德華·羅（en:Edward Low），全名取自拿破崙戰爭兩場戰場的特拉法加海戰和滑鐵盧戰役。"}, {"type": "list", "elements": [{"text": "同時，「瓦特爾」亦為諱名；「D」則是隱名。", "elements": []}, {"text": "由於姓名前段的「Tra」與日文的老虎（とら）讀音很接近，所以魯夫亦以「托拉男」來稱呼他（動畫版）。", "elements": []}]}], "images": []}, {"title": "來源", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  ONE PIECE漫畫和動畫 — 51 卷 498話 和 392集。", "elements": []}, {"text": "↑  ONE PIECE漫畫SBS — 59卷。", "elements": []}, {"text": "↑", "elements": []}, {"text": "↑  ONE PIECE漫畫 — 91 卷916話 (p. 11, 17)。", "elements": []}, {"text": "↑  ONE PIECE漫畫 — 91 卷917話 (p. 12)。", "elements": []}, {"text": "↑  ONE PIECE漫畫 — 91 卷918話 (p. 6-17)。", "elements": []}, {"text": "↑  ONE PIECE漫畫 — 91 卷921話。", "elements": []}, {"text": "↑  ONE PIECE漫畫 — 92 卷922話。", "elements": []}, {"text": "↑  ONE PIECE漫畫 — 92 卷923話。", "elements": []}, {"text": "↑  ONE PIECE漫畫 — 92 卷924話。", "elements": []}, {"text": "↑  ONE PIECE漫畫 — 954話。", "elements": []}]}], "images": []}]}