{"sections": [{"title": "基爾德·泰佐羅", "level": 1, "content": [{"type": "paragraph", "text": "基爾德·泰佐羅（ギルド・テゾーロ，Gildo Tesoro）是世界最大娛樂城市「Gran Tesoro」掌門人、一流藝人。"}], "images": []}, {"title": "形象特徵", "level": 2, "content": [{"type": "paragraph", "text": "特徵是灰綠色頭髮向後梳，平時穿著粉色衣服和褲子，紫色墨鏡。其背上有一個巨大的五角星狀傷疤，為的是掩蓋曾經天龍人的奴隸印記。接待客人時，泰佐洛會穿的十分豪華。全身金、金項鍊、金耳環、金帽子等。"}, {"type": "paragraph", "text": "人稱「黃金大帝」、「新世界的怪物」。是吃了黃金果實（ゴルゴルの実）的能力者，體質變成金，能夠操作金。除了可以隨意製造黃金首飾之外，還可以控制金屬進行伸縮和變形，甚至變成巨大生命體對敵人進行全體殲滅。是惡魔果實覺醒能力者，能夠將自己周圍的環境全變成金。還可以將金子全部覆蓋到自己身上，以使自己更加強壯。擁有全世界20%的貝里，君臨於賭場的賭場之王，甚至有能動用世界政府的力量。曾說過「沒有錢的傢伙只會一事無成，只有被支配的份」。"}], "images": []}, {"title": "一生經歷", "level": 2, "content": [{"type": "list", "elements": [{"text": "【幼年期】喜歡唱歌，出生在很窮的家庭，因為家裡很窮所以沒什麼朋友。在娛樂表演會場外面看到光鮮亮麗的表演者，對舞台充滿了憧憬。爸爸愛賭博，把家裡的錢都花光了，最後因病而死。如果手術的費用支付得出來就可以痊癒了，因為沒錢爸爸才死的。造成泰佐洛現在覺得錢是萬能的。因為爸爸死了後來家裡變得更窮，母親討厭泰佐羅的歌聲很煩、罵他很吵。", "elements": []}, {"text": "【12歲】泰佐洛離家出走。因為沒錢吃飯所以開始偷錢，但也因此交了酒肉朋友。（給對方錢就變成朋友）開始了賭博、喝酒、打架的生活。", "elements": []}, {"text": "【16歲】某天在賭場大敗，他的朋友立刻就逃走，被揍的很慘，被攻擊後為了保命而逃跑。逃跑後經過了人類販售店，與正在裡面被拍賣的女性四目交接。名叫『史黛拉』（Stella）的女子，她聽到泰佐洛的歌聲覺得他的歌聲很棒，他們很聊得來。泰佐羅決定要讓史黛拉獲得自由，再也不做壞事，從早到晚廢寢忘食的工作的泰佐羅，需要錢來救她。工作休息的時候就會去找史黛拉聊天、唱歌、談論夢想。", "elements": []}, {"text": "【19歲】馬上就要集齊買下史黛拉的金額的時候，天龍人正好出現，輕鬆的就把史黛拉買走了。憤怒的泰佐羅朝著天龍人發火，但被保鑣抓住，史黛拉對泰佐羅說因為泰佐羅的存在，她從心底感覺到幸福。泰佐羅成為大罪犯，被抓去給天龍人當奴隸，沒有得到許可連笑都不行。雖然都在馬力喬亞，但是不知道史黛拉在馬力喬亞的哪個地方。", "elements": []}, {"text": "【21歲】某一天聽到了史黛拉的死訊，泰佐羅非常傷心痛苦，無法止住淚水。「都是因為沒有錢，她才會不幸地死去」憤怒與後悔更加造成泰佐洛之後對錢的執著。但其實史黛拉是幸福著笑地死去的，因為她回想到那3年間她非常的幸福、打從心底的被泰佐洛愛的關係。不過泰佐洛不知道這件事。", "elements": []}, {"text": "【26歲】因為費雪泰格的奴隸解放事件從聖地·馬力喬亞逃走，用更大的星形符號把天龍人的標誌給蓋住，後來隱匿起來做壞事，相當痛恨有錢人和貴族。", "elements": []}, {"text": "【29歲】聽說唐吉訶德家族舉行有金金果實的拍賣會，在會場製造了製造火災獲得果實。多佛朗明哥只是想用這個果實來吸引客人的，其實沒有真的想賣出去的意思。", "elements": []}, {"text": "【32歲】泰佐羅的名氣逐漸上升，多佛朗明哥也終於知道了3年前事件的犯人，但果實早就被吃了。", "elements": []}, {"text": "【33歲】被唐吉訶德家族盯上的泰佐羅已經有了相當的戰鬥力，雙方忘記過去的恨意，成為了商業關係上的夥伴。", "elements": []}, {"text": "【35歲】事業逐漸穩定，部下也充足，建造了巨艦「GRAN TESORO」，所憎恨的「金之力」已經成為了自己的力量。面對有錢人，那就成為更有錢的人，讓他們屈服於自己腳下，總有一天要讓天龍人也跪倒在這力量前。在賭場輸掉錢的時候客人們那絕望的表情，對泰佐羅而言是最棒的表演。表演秀的名字就叫「Gold Stella Show」。表示才是要成為這個世界的神的人。", "elements": []}, {"text": "【41歲】草帽海賊團收到邀請函來到「GRAN TESORO」。", "elements": []}]}], "images": []}]}