{"sections": [{"title": "Risky Brothers", "level": 1, "content": [{"type": "paragraph", "text": "The Risky Brothers are two male pirates working as members of the Rolling Pirates under their captain, Lola. They were members of the Thriller Bark Victim's Association, a group of Gecko Moria's victims who banded together. During the time their shadows were stolen from them, they were placed in two squirrel zombies who were also named the Risky Brothers."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Risky Brothers are a short rotund man, and a tall skinny man."}, {"type": "paragraph", "text": "The rotund one wears a black mask, similar to his zombie counterpart. He has curly black hair and and a bandage over the mask. He has tanned skin and large lips, and a bit of stubble on his chin. He also wears a torn up white shirt and torn up black tie. He has brown pants, and bandages around his wrist. He also has a large sword on his back, with a brown strap holding it across his chest."}, {"type": "paragraph", "text": "The other brother is rather tall and skinny, the opposite of the first. He has curly light brown hair with a few strands hanging down He has thick black circles around his eyes and a bit of stubble on his chin. He sports a torn up long sleeved striped dark blue and light green shirt, and light grey pants."}, {"type": "paragraph", "text": "After the timeskip, the shorter brother was seen with a new cleaner light colored shirt, and light colored pants with dark colored flowers on them. The taller brother was seen in a new shirt, with vertical stripes on it and dark colored pants and shoes."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "The Risky Brothers are somewhat brave, since they protected their fellow shadowless companions during the final conflict. However, they are quite terrified of Gecko Moria and their previous shadowless condition."}, {"type": "paragraph", "text": "The Brothers act very similar, having the same opinions on things like how brave and cool Zoro's sacrifice was and how noble Sanji is. They also mimick people they admire, as they both repeated Sanji's statements that he made when they were going to say what happened to Zoro when Luffy asked about it."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "One of the Risky Brothers carries a sword on his back, and, as one of the more predominant members of the Rolling Pirates, he is probably quite proficient in using it. It is unknown what kind of abilities the other possesses."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Thriller Bark Arc", "level": 3, "content": [{"type": "paragraph", "text": "The duo are the most prominent members of the crew outside Lola as well as of the Thriller Bark Victim's Association, assisting the Straw Hats both in the creation of Nightmare Luffy by stuffing one hundred shadows into the captain as well as protecting those who lost their shadows during the final conflict with Oars and Moria. Though obsessed in getting their shadows back, they are also cowardly, fearing both Moria and getting killed with their shadowless condition. After Moria's defeat, the Risky Brothers, along with Lola and the other Thriller Bark victims, stood by the Straw Hats during their confrontation with Bartholomew Kuma, only to be hit by his bizarre abilities and knocked out by his Ursus Shock attack. However, they regained consciousness in time to witness Zoro's (and Sanji's attempted) sacrifice."}, {"type": "paragraph", "text": "After the crisis ended, the Risky Brothers tried to tell the other puzzled Straw Hats but were stopped by Sanji, after telling him and an eavesdropping Robin what happened after Sanji was knocked out by Zoro. The Risky Brothers gave commentary and advice regarding the path the Straw Hats was headed towards the New World, in particular their astonishment on the beauty of mermaids as they faced Fish-Man Island. They also comment that the mermaids might even surpass Boa Hancock in terms of beauty."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip the Risky Brothers and their captain, Lola, are seen at the bar in Water 7 owned by Mozu and Kiwi."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Rolling_Pirates_Post_Timeskip.png/revision/latest/scale-to-width-down/210?cb=20130422132819", "caption": "Lola and the Risky Brothers at the bar."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The brothers were the first people to mention Boa Hancock.", "elements": []}, {"text": "\"Risu\" is Japanese for \"squirrel\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 49 Chapter 475 and Episode 369.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 49 Chapter 476 and Episode 370, Risky Brothers help Lola create Nightmare Luffy", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 49 Chapter 479 and Episode 372, Risky Brothers save the various victims bodies", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 50 Chapter 484 and Episode 376, Straw Hat Pirates and Thriller Bark Victim's Association vs. Bartholomew Kuma", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 50 Chapter 489 and Episode 381, Risky Brothers speak of Fish-Man Island and mermaids.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 66 Chapter 654, cover story: From the Decks of the World Vol. 36, The Risky Brothers are seen after the timeskip.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 50 Chapter 489 (p. 16) and Episode 381, Hancock is mentioned by the Risky Brothers for the first time.", "elements": []}]}], "images": []}]}