{"sections": [{"title": "Kaido", "level": 1, "content": [{"type": "paragraph", "text": "Kaido of the Beasts, also known as the \"Strongest Creature in the World\", is the Governor-General of the Beasts Pirates and one of the Yonko ruling over the New World. He and his crew currently occupy Wano Country in alliance with its shogun, Kurozumi Orochi, and most recently have entered into another alliance with fellow Yonko Big Mom and her crew, the Big Mom Pirates."}, {"type": "paragraph", "text": "Decades ago before the formation of his own crew, Kaido was part of the legendary Rocks Pirates as an apprentice."}, {"type": "paragraph", "text": "Kaido was first referred to by Monkey D. Garp in the Post-Enies Lobby Arc and then directly mentioned by Gecko Moria in the Thriller Bark Arc, with his Yonko title revealed just after the Straw Hat Pirates defeated Moria. Thus, Kaido is the third Yonkou mentioned by name and the last one to debut."}, {"type": "paragraph", "text": "Due to his actions and role, he is the primary antagonist of the Wano Country Arc and one of the central antagonists of the Yonko Saga."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kaido is a tanned, seemingly middle-aged man who cuts an imposing figure due in equal measures to his extreme height (somewhat comparable to Big Mom's 8.8 m) and muscle bulk, making him easily dwarf normal humans. Overly top-heavy in build, he has an extremely broad, well-muscled torso with wide-set shoulders attaching to strong, thick arms, and legs that are somewhat out of proportion; far less heavily built than his arms yet about the same length (with his feet much tinier than his hands)."}, {"type": "paragraph", "text": "Kaido's head, atop his bulky neck, is disproportionally small as well (smaller than his hands), and has a massive pair of gray, sharp-pointed horns come out of its sides, curving slightly to the front, then upward. He has a longish face with a heavy brow (its ridge hairless) that tops sharp, often bloodshot eyes (parent to small, yellowish irises), plus a hook nose and a large, full-lipped mouth. Kaido is near-always seen wearing a frown, and has moderate wrinkles: lines upon the brow, crow's and tear-trough lines around the eyes, and laugh lines from always sneering. His black hair consists of an unruly, mostly swept-back mane, forming distinctly flat, rectangular locks of which some fall down near the front, over the ears, or jutting upward. His facial hair is neat, done in a wavy, waist-length Fu Manchu mustache that pairs with a spiked goatee across his broad chin. Right of his defined abs is his only scar: a massive, recessed X-shape whose upper points reach to his pectoral. It was given to him by Kozuki Oden using his sword. A tattoo of dim-reddish segments resembling reptilian scales, individually bordered in orange, goes from his left pectoral down the front of his left arm, ending in correspondence to the wrist with a white (dark in the manga), traditionally shaped skull on the lower forearm."}, {"type": "paragraph", "text": "Clothing-wise, Kaido dons a bluish-purple, feathered overcoat draped on his shoulders, without sleeves, and below a lavender, tight-fitting, open shirt that has long sleeves. He has a black bracelet with golden (dark in the manga) spikes above each of his wrists. Upholding said shirt is a thick, off-white belt of laid rope festooned with a pair of white, hanging shide in the front. More outwardly from below the rope hang two additional pieces of fabric: rectangular, hemmed flaps that each have, from two hemmed holes at their bottom, a short, thick, golden torus chain attached to themselves. Further, Kaido has two yellow straw cords below the shimenawa, serving as waistbands to secure a short, hanging row of thin, reddish ribbons. Finally, the rest of his lower wear consists of simple, baggy pants of gray-green color, tucked below the knees into simple, blackish boots."}, {"type": "paragraph", "text": "20 years before the current storyline, Kaido's Fu Manchu was only chest-length, he lacked his current beard, and his scar was also not yet present."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kaido is a merciless, aggressive, and confident warrior who never misses an opportunity to gain an advantage in war, as evidenced by his plan to attack Whitebeard during the latter's attempt to save Portgas D. Ace from execution. Kaido seems to harbor a general sense of unconcern for most things, including the very nature of the world and the lives of himself and his subordinates. He apparently desires excitement and chaos, as he is prepared to start the largest war in the world because he felt it was too mundane. This recklessness, coupled with his apparent inability to die, has caused Kaido to make attempting suicide as his hobby."}, {"type": "paragraph", "text": "However, Kaido seems unusually invested in his goal of creating a formidable all-Zoan crew, to the point where he attempted to drown his sorrows in alcohol after receiving the news that he could no longer buy Zoan Devil Fruits in large quantities. Kaido also has a great interest in Laugh Tale, having taken a Road Poneglyph under his ownership and also went to the brutal extent of threatening Kozuki Oden for his knowledge and ruthlessly hunting down his son Kozuki Momonosuke and three retainers Kin'emon, Raizo, and Kanjuro."}, {"type": "paragraph", "text": "He is also pitiless and not usually open to negotiations or excuses, making it unwise to provoke or underestimate him; this is enforced dramatically when Donquixote Doflamingo, a former Shichibukai and former World Noble known for his fearless attitude, was very afraid of angering Kaido when he became potentially unable to fulfill his end of their business deal due to Trafalgar D. Water Law holding Caesar Clown hostage. One of his crewmates later stated that Kaido would be very angry once he heard the news of the SMILE Factory's destruction. This unreasonable attitude caused a group of Kaido's subordinates including X Drake to attempt to deliver the news of Doflamingo's defeat to the Yonko from a distance rather than approaching him in person. Despite this, he is not completely unreasonable as Hawkins was able to convince him to target Oden's castle after telling him that Luffy and Law were hiding there and Kaido later agreed to ally with Big Mom again despite having threatened and tried to kill her before."}, {"type": "paragraph", "text": "Kaido has also shown to be extremely cruel, even towards children. After he murdered Kozuki Oden, he viciously insulted Oden right in front of his son Momonosuke, adding mockery to Momonosuke's sorrow and hopelessness. Adding to this, he brutally attacked Tama, even though she was no threat to him, and left her for dead. He later smiled and laughed upon seeing Orochi's spiteful execution of Yasuie, being amused by his ally's cruelty."}, {"type": "paragraph", "text": "Kaido is highly confident in his power and considers himself to be far above the likes of Supernovas, referring to their actions as \"little pirate games\", even refusing to take the Straw Hat Pirates and Heart Pirates seriously despite them crippling his SMILE trade; this is reinforced by his belief that defeating a Shichibukai is nothing to be impressed with and his dismissal of Donquixote Doflamingo as being weak. He was also quick to threaten to kill Big Mom when she announced her intention to come to his territory, showing no reservations despite Big Mom possessing power equivalent to his own."}, {"type": "paragraph", "text": "Kaido is a heavy drunkard who loves to drink sake and while drunk, his mood changes erratically, such as when he quickly went from being melancholic over his inability to increase the number of his Gifters and fulfill his dream of having a crew consisting of only Devil Fruit users to becoming angry and violent, brutally beating his subordinates and cursing Luffy and Law. In fact, Kaido is such a habitual drinker that he even dislikes being sober at any given time."}, {"type": "paragraph", "text": "Despite his immense arrogance and confidence in his power, Kaido does acknowledge other individuals of exceptional strength as he sought to recruit powerful individuals into his crew such as Shutenmaru and also Eustass Kid. This extends to enemies who offended him such as Luffy who had caused him to lose his SMILE supply when he intentionally held back when defeating the latter and expressed his intention to recruit Luffy into his crew as he still considered Luffy to be a potentially formidable soldier, and opted to try to break his spirit and recruit him as a subordinate instead of killing him immediately."}, {"type": "paragraph", "text": "He is also still pragmatic enough to avoid some fights that could devastate his forces and territories. When Big Mom attempted to enter Wano, Kaido feared it would become an all-out war and ordered his crew to stop her and her crew. He also wanted to know if Big Mom brought her whole crew with her, being aware of them being very powerful fighters."}, {"type": "paragraph", "text": "While Kaido is extremely ruthless and cruel to his enemies, he does have some form of honor. When he met Big Mom again for the first time in years, he told his men to take her cuffs off before trying to kill her, showing he wants to fight her fairly and honorably. Furthermore, Kaido is also a man of his word, as after warning Linlin that he would kill her if she came to Wano, Kaido kept his word and tried to kill her the moment they met again."}, {"type": "paragraph", "text": "Kaido is also a very bored and grumpy individual who finds little pleasure and excitement in his life outside of drinking and his suicide attempts, and he is frowning most of the time. The rare occasions where Kaido was shown smiling were when he watched Yasui's execution at Orochi's hands and when he held a party to celebrate his renewed alliance with Big Mom during which he was in a rare jolly mood."}, {"type": "paragraph", "text": "Like other people, Kaido has a unique laughing style: \"Worororo\" (ウォロロロ, Worororo). A second one of his has been observed as he was drunk: \"Fuhihihi\" (フヒヒヒ, Fuhihihi)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Kaido_Drunk.png/revision/latest/scale-to-width-down/210?cb=20170226234158", "caption": "A drunken Kaido drowns his sorrows."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Kaido cares somewhat for his subordinates, as Scotch confirmed that Kaido would be angry if he were to be attacked. His subordinates seem to respect him, as Scotch refers to him as \"Kaido-sama\" while Sheepshead calls him as \"His Majesty\". However, Kaido acts callously toward his subordinates when in an angry mood, having once sent two of his subordinates flying out of his fortress with brute force while smashing wanted posters of his enemies. Prior to his supply of SMILEs being cut off, Kaido's dream was to have a crew composed entirely of Devil Fruit users, which he wanted to be the best crew the world had ever seen. Kaido went to extreme lengths to achieve this goal as he is willing to risk his subordinates' well-being by feeding them the Artificial Devil Fruits SMILE, which has only a ten percent chance of success in granting them Zoan powers, causing most of his subordinates to lose the ability to feel sadness and anger, and ranking them as \"Pleasures\"."}, {"type": "paragraph", "text": "Kaido does not tolerate betrayal in his crew, as when Speed betrayed him in favor of Tama, Kaido mercilessly attacked her and left her and Tama for dead."}], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "Jack is an All-Star and one of Kaido's three right-hand men, implying that the Yonko has great trust in him and his powers. However, when learning about Jack's failure to rescue Doflamingo, Kaido appeared to care more about the loss of his SMILEs than the loss of his subordinate. Jack is shown to be afraid of his superior as he trembled when seeing Kaido."}], "images": []}, {"title": "King", "level": 4, "content": [{"type": "paragraph", "text": "King is an All-Star and one of Kaido's three right-hand men, meaning the Yonko has great trust in him and his powers. In turn, King is very loyal to Kaido and willing to execute missions that are given to him. When Big Mom and her children arrive at Wano Country, King attacked and knocked her ship into the sea because of Kaido's orders."}], "images": []}, {"title": "Queen", "level": 4, "content": [{"type": "paragraph", "text": "Queen is an All-Star and one of Kaido's three right-hand men, suggesting the Yonko has great trust in him and his powers. Queen addresses Kaido by his name, rather than by a title, such as 'Sir' or 'Boss'. Any detailed interaction between the two has yet to be seen."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "X Drake", "level": 4, "content": [{"type": "paragraph", "text": "Prior to the timeskip, X Drake seemed to be interested in meeting Kaido, having willingly provoked his subordinate Scotch on the Yonko's favorite winter island in order to gain his attention. He is now apparently subservient to Kaido, being stationed with his subordinates. His allegiance with Kaido was first shown when he squashed a rebellion perpetrated against Kaido's subordinates on the same winter island."}, {"type": "paragraph", "text": "With the reveal of Drake being associated with the Marine organization known as SWORD, it can be believed that Drake's actions were merely an act to get close enough to discover more on Kaido and the Yonko's actions. However, he remains loyal to be able to make more discoveries of the Beast Pirates and Wano."}], "images": []}, {"title": "Donquixote Doflamingo and Caesar Clown", "level": 4, "content": [{"type": "paragraph", "text": "Kaido is a black market customer of Donquixote Doflamingo.Caesar Clown produces and delivers large amounts of the substance SAD to Doflamingo, who uses it to manufacture artificial Devil Fruits called SMILES, which in turn are sold to Kaido to create his army of Artificial Zoan Devil Fruit users. Despite this, they do not seem to be on friendly terms, as Law asserted that Kaido would kill Doflamingo if he were to be rendered unable to supply Kaido with Zoan fruits anymore; Doflamingo himself displayed great fear at the thought of angering Kaido."}, {"type": "paragraph", "text": "However, Kaido does not appear to resent Doflamingo despite his defeat, as he felt sympathetic for Doflamingo not being powerful enough to defeat Luffy and Law; however, this may have been a result of Kaido being drunk at the time."}], "images": []}, {"title": "Scratchmen Apoo", "level": 4, "content": [{"type": "paragraph", "text": "During the timeskip, Scratchmen Apoo joined Kaido's crew. Apoo has referred to the Yonko as \"Kaido-san\". Apoo feigned cooperation with Eustass Kid and Basil Hawkins to force them to become subordinates of Kaido."}], "images": []}, {"title": "Basil Hawkins", "level": 4, "content": [{"type": "paragraph", "text": "Kaido encountered Basil Hawkins along with fellow alliance members Eustass Kid and Scratchmen Apoo when he fell onto their base after jumping from Ballon Terminal. Hawkins and his crew willingly surrendered to Kaido as self-preservation and as a result, he is a subordinate of Kaido, being one of the Headliners."}], "images": []}, {"title": "Kurozumi Orochi", "level": 4, "content": [{"type": "paragraph", "text": "In exchange for monopolizing the immense resources of Wano, Kaido formed an alliance with Kurozumi Orochi, helping the latter to dethrone the Kozuki Family and become the Shogun of Wano Country by executing the daimyō Kozuki Oden who was next in line to be shogun. Kaido also personally thwarted the rebellion of the daimyos who served the Kozuki Family such as Yasuie. With amusement, Kaido considers Orochi \"sick\" for using the SMILE leftovers to make the people of Ebisu Town laugh perpetually despite their sadness."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "In the past, Linlin and Kaido were once in the same pirate crew. She seems to recognize Kaido's strength as after Luffy declared that he would defeat him, Big Mom responded by telling Luffy that he had no hope of accomplishing that feat while referring to Kaido as a \"thing\". Kaido, in turn, does not seem to hold much respect for Big Mom either, referring to her as an \"old hag\". When Big Mom contacted Kaido about letting her be the one to kill Luffy, Kaido refused to cooperate and threatened to kill her if she came to Wano Country. He apparently owed her a debt long ago, which he tried to brush off, but Big Mom held it against him as a lifetime debt. As she arrived at Wano, Kaido furiously ordered his men to sink the Queen Mama Chanter before it could land, wanting to avoid an all-out war against her."}, {"type": "paragraph", "text": "When Big Mom was brought to Onigashima in chains, he furiously ordered his men to release her from her shackles, showing some sort of respect to her and refusal to simply kill Big Mom while she was powerless. After she was released, he reiterated his earlier death threat and immediately clashed with her, where they both caused the sky over Onigashima to split. After their battle, they put aside their differences and agreed to form an alliance until they succeeded in conquering the world. After that, they would go back to trying to kill each other."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Gecko Moria", "level": 4, "content": [{"type": "paragraph", "text": "Kaido once had a rivalry with the former Shichibukai Gecko Moria. The two of them fought in the New World, and eventually, Kaido won after slaughtering Moria's entire crew. This had an adverse effect on Moria's consciousness of subordinates and led him to seek revenge against Kaido by building an army of undead soldiers."}], "images": []}, {"title": "Monkey D. Luffy and Trafalgar Law", "level": 4, "content": [{"type": "paragraph", "text": "When Trafalgar Law offered to form an alliance with Monkey D. Luffy and the Straw Hat Pirates allegedly to dethrone Kaido, Luffy eagerly agreed to the alliance and even declared that he would defeat all four Yonko. Though Law suggested that their chances of success are only 30%, Luffy remained undeterred."}, {"type": "paragraph", "text": "However, it is later revealed by Law himself that he formed an alliance with Luffy not as a means to dethrone Kaido, but instead because he wanted to get Kaido angry at Doflamingo by having the Straw Hats destroy the SMILE Factory. Law also notes that if they kill Doflamingo and destroy the factory, Kaido will transfer his grudge to the pirate alliance."}, {"type": "paragraph", "text": "Kaido knew of the two crews before he heard what they had done at Punk Hazard and Dressrosa, and when he heard about them destroying his source of SMILE, he wept and cursed them. However, he still does not take them seriously, viewing himself as far stronger than they are."}, {"type": "paragraph", "text": "Despite underestimating them, Kaido held murderous hatred towards Luffy and Law, going as far as to brutally smash their wanted posters along with his own subordinates holding them just to vent his anger. Kaido stubbornly refused Linlin's request to allow her to kill Luffy as he wished to kill the Straw Hat captain himself."}, {"type": "paragraph", "text": "Kaido and Luffy finally met in person after the former destroyed Oden Castle while some of Luffy's friends were still there. Luffy attacked Kaido out of anger and he was further enraged after hearing that Kaido attacked Tama. Luffy attempted to defeat Kaido but his attempt ended in failure as Kaido rendered Luffy unconscious with a single blow. To add insult to injury, Kaido mocked the defeated Luffy's statement of being Pirate King."}, {"type": "paragraph", "text": "He was impressed by Luffy using Haoshoku Haki and rather than killing Luffy, Kaido decided to break his spirit and turn him into a subordinate. After he was imprisoned, Luffy promised to make Kaido pay. It seems Kaido is willing to wait, since Queen has given Luffy opportunities at Kaido's behest but Luffy refuses."}], "images": []}, {"title": "Eustass Kid", "level": 4, "content": [{"type": "paragraph", "text": "Kaido defeated Kid during their encounter at Kid's base and threw him in a jail cell. Later, Kaido used Kid as an example when illustrating the difference in power between him and the Supernovas. Kaido recognizes Kid's strength and wishes to turn him into his subordinate. He is trying to achieve that by holding him prisoner, torturing him, and trying to break his spirit. However, Kid only holds resentment towards Kaido and swore revenge against him."}], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "Kaido became the sworn enemy of the Kozuki Family after he executed Kozuki Oden and his wife. To learn the secret that Oden knew, he hunted down Oden's son and his retainers Kin'emon, Kanjuro, and Raizo. He entrusted his right-hand man, Jack, to search for Raizo at Zou. Kaido explained to Momonosuke that his father Oden was a foolish lord."}, {"type": "paragraph", "text": "To fight Kaido and his crew, the Kozuki Family's retainers journeyed to Zou to seek aid from the Mink Tribe and worked to gather allies within Wano Country."}], "images": []}, {"title": "Ashura Doji", "level": 4, "content": [{"type": "paragraph", "text": "Ashura Doji is well known as Shutenmaru to the Beasts Pirates, as well as to Kaido. Kaido seems to recognize Shutenmaru's strength as Kaido wanted him to become his subordinate. Jack claims that this is the only reason why Shutenmaru is still alive. However, Ashura refuses to join Kaido's crew and tries to avoid him as much as possible. The two have fought in the past but Kaido is willing to forgive him if Ashura joins his crew. Ashura ultimately rejoined the Kozuki Family, making him Kaido's enemy."}], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "In the past, they were part of Rocks Pirates. After the incident at God Valley, they went their separate ways."}, {"type": "paragraph", "text": "As they were both Yonko, Kaido and Edward Newgate were not allies. Under normal circumstances, they did not provoke each other; however, Kaido saw the opportunity to engage his rival prior to the impending Battle of Marineford and did not hesitate to attempt to do so. Two years later, Kaido cursed Whitebeard for being able to die while he remained alive."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Not much is known about the relationship between Kaido and Shanks. When Kaido tried to stop Whitebeard from going to Marineford, Shanks interfered with him in order to allow the other Yonko to rescue Ace. It is not known what happened during their encounter, but Shanks arrived at Marineford unharmed."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "As one of the Yonko, Kaido is one of the four strongest pirates alive, renowned as the \"Strongest Creature in the World\". Notably, he has a bounty of 4,611,100,000, which is the highest of any pirate currently alive, surpassed only by the bounties of the late Whitebeard and Gold Roger."}, {"type": "paragraph", "text": "Kaido attempted to take Whitebeard's life, something very few would dare, and subsequently had an encounter with Shanks. When Gecko Moria was in his prime, Kaido fought him and emerged victorious, having killed his entire crew. The Five Elders mentioned Kaido as one of the few people able to stop Blackbeard. His strength was also recognized by his fellow Yonko Big Mom, who could not fathom the idea of Monkey D. Luffy defeating him."}, {"type": "paragraph", "text": "Additionally, Trafalgar Law stated Kaido to be able to easily kill Donquixote Doflamingo, a world-famous and extremely powerful pirate in his own right. Law speculated that even with an alliance with the Straw Hats, their chance of defeating Kaido is only about 30%, although the statement is questionable, seeing as at that time Law was not serious about fighting him. Kaido, in fact, defeated another member of the Worst Generation, Eustass Kid, whose bounty is 470,000,000, with apparent ease, and refused to take Law and Luffy's alliance seriously regardless of what they accomplished, due to viewing the defeat of a Shichibukai as being nothing special."}, {"type": "paragraph", "text": "Kaido then later went on to defeat Luffy himself with no effort, rendering him unconscious with a single hit. Kaido is also able to clash equally with his fellow Yonko Big Mom, as shown by the force of their clash being strong enough to split the sky in two, which is similar to the clash between Whitebeard and Shanks, and to fight her equally for two days without sustaining any injuries."}, {"type": "paragraph", "text": "Similar to the other Yonko, Kaido has many underlings and other pirates allied with him and is able to claim self-governing islands as his own territories. With Caesar and Doflamingo as his associates, Kaido has created an army of over 500 Artificial Zoan-type Devil Fruit users: his Gifters."}, {"type": "paragraph", "text": "Kaido also has a very strong will, as shown when he was completely unaffected by Luffy's Haoshoku Haki."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Befitting his bulk, Kaido is legendary for his immense physical power as the strongest beast in the world. He is capable of swinging his kanabo hard enough to send a normal-sized person flying into the distance in one blow, and also broke past the tremendous defensive power of Luffy's Gear Fourth with great ease. He once sunk nine enormous prison ships singlehandedly. Kaido also clashed equally with Big Mom, with the power of that clash causing the sky itself to split in two."}, {"type": "paragraph", "text": "Kaido also possesses nigh indestructible durability, even without using Busoshoku Haki. He took multiple powerful hits from Monkey D. Luffy's Gear Third while in his dragon form and transformed back into his human form after being pummeled into the ground, and proceeded to receive a barrage of Gear Fourth hits that were even more powerful, yet he felt nothing more than annoyance, received no injuries, and was able to quickly get back up and counterattack without issue. This durability has given Kaido the reputation of being unable to die. He has been caught and tortured 18 times, and people as powerful as the Marines and other Yonko have attempted to execute him 40 times only to fail as Kaido survived every single attempt because every single execution weapon broke when being used on him. Most notably, Kaido has jumped from 10,000 meters from the sky onto the ground, creating a massive shockwave strong enough to sink a large ship nearby, and emerged only with a headache; it has even become a hobby for him to attempt suicide, only for it to fail."}, {"type": "paragraph", "text": "Kaido is extremely fast despite his massive size, as shown when he moves past Luffy in an instant while attacking him."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Kaido has eaten a Mythical Zoan-type Devil Fruit that allows him to transform into a massive, blue-scaled Eastern dragon, notably with a circle of flame around each of his upper arms. In this form, he is capable of moving through the air by creating clouds and using them as footholds. He can also release devastating blasts of fire from his mouth, which can easily blow apart a large area. The anime shows that a simple burp is powerful enough to send a grown man flying away in the gust."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Kaido%27s_Dragon_Form.png/revision/latest/scale-to-width-down/200?cb=20191208070737", "caption": "Kaido's dragon form."}]}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Bolo Breath (, Boro Buresu, literally meaning \"Heat Breath\"): Kaido releases a massive heat blast from his mouth towards a target. It travels very quickly and is extremely powerful, being capable of instantly decimating large structures like the ruins of Oden Castle, and surrounding terrain like mountainscapes are left thoroughly shattered, flattened, and scorched. \"Bolo\" is a term used in Central America and Mexico meaning \"drunk\". This is called Blast Breath in the Viz Manga.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/28/Kaido_Uses_Bolo_Breath.png/revision/latest/scale-to-width-down/200?cb=20191208030538", "caption": "Kaido using Bolo Breath."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Kaido wields a giant metal kanabō covered in spikes as his weapon of choice. Using it in conjunction with his immense physical strength, he can use it to smash adversaries over vast distances, and was able to knock Luffy unconscious with a single blow, breaking past the tremendous defensive power of Luffy's Busoshoku Haki-enhanced Gear Fourth form. Kaido has wielded his Kanabo since he was an apprentice of the Rocks Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2c/Kaido%27s_Mace.png/revision/latest/scale-to-width-down/150?cb=20190305060700", "caption": "Kaido's kanabō mace."}]}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Raimei Hakke (雷鳴八卦, Raimei Hakke, literally meaning \"Thunderclap Eight Trigrams\"): Kaido charges towards his opponent at high speed, swinging his kanabo horizontally to strike them with devastating force. The impact releases several black thunders, similar to that of a Haoshoku Haki clash. It was first used against Luffy in his Gear Fourth form, knocking him unconscious with a single hit. The \"Eight Trigrams\", or Bagua are the eight symbols of Taoist cosmology to represent the fundamental principles of reality. In the VIZ Manga, this is called Thunder Bagua.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At least over 40 years ago, Kaido joined the Rocks Pirates as an apprentice. Sometime since becoming a pirate, he had been defeated seven times and captured eighteen times by the Marines and the other Yonko. During said captures, Kaido was repeatedly tortured and given the death sentence forty times. However, no method of execution was effective on him, and Kaido managed to sink nine massive prison ships that held him."}, {"type": "paragraph", "text": "At some point later, Charlotte Linlin in particular did something that put Kaido in her debt (lifelong according to Linlin)."}, {"type": "paragraph", "text": "At least 38 years ago, the Rocks Pirates clashed with Gol D. Roger and Monkey D. Garp on God Valley and was crushed by them. The incident is later known as God Valley Incident. Not much is known about the battle, but at least Kaido survived the battle."}, {"type": "paragraph", "text": "At least 33 years ago, Kaido started recruiting his crew."}, {"type": "paragraph", "text": "At another unknown point in his life, Kaido fought with Gecko Moria and defeated him in the New World country of Wano. Though the details of the battle are unknown, Moria lost his entire crew."}, {"type": "paragraph", "text": "Eventually, Kaido also managed to gain possession of a Road Poneglyph, one of the four poneglyphs that when deciphered could reveal the location of Laugh Tale."}, {"type": "paragraph", "text": "Kaido was not recognized as one of the top pirates in the world until around the time when Gol D. Roger was executed. He, along with Shanks, then joined Whitebeard and Big Mom among the ranks of the Yonko."}, {"type": "paragraph", "text": "At least 20 years ago,Kurozumi Orochi, now-shogun of Wano Country, and Kaido overthrew the Kozuki Family to take over Wano. During this overthrow, Kozuki Oden, though defeated, was able to injure Kaido using his sword, Enma, giving the latter his only scar. After Oden was executed, Kaido attacked and burned down Oden Castle before Oden's retainers returned. He told Momonosuke that his father was a foolish lord and killed his mother in addition to his father."}, {"type": "paragraph", "text": "At some time 10 years ago, the Kozuki Family's supporters gathered to stage a massive rebellion before the comeback of Oden's retainers, Kaido personally intervened and brutally massacred a majority of the rebels along with their families. At some point after taking over Wano, Kaido additionally faced the thief Shutenmaru."}, {"type": "paragraph", "text": "Sometime within the last four years, Kaido began collaborating with the Shichibukai Donquixote Doflamingo and the rogue Marine scientist Caesar Clown to create an army of artificial Zoan Devil Fruit users, via SMILE."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2a/Oden_Castle_Burning.png/revision/latest/scale-to-width-down/210?cb=20191201183324", "caption": "Kaido burning down Oden Castle."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Whitebeard attempted to save Ace from his execution at Marineford, Kaido tried to attack him. However, Shanks intercepted Kaido before he could reach Whitebeard. It is unknown how their encounter ended, but Shanks arrived unscathed at Marineford by the end of the war."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kaido went up to Ballon Terminal, where he encountered Urouge, who learned of his intention to attempt suicide and allowed him to proceed. Kaido jumped off the sky island and landed 10,000 meters below on the Kid Pirates' base. However, he only received a minor headache and found himself face-to-face with the Kid, On Air, and Hawkins alliance. After cursing Whitebeard for having been able to die, Kaido yelled that Doflamingo needed to make preparations for battle before promising to start a massive war due to the world boring him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Kid_Alliance_facing_Kaido.png/revision/latest/scale-to-width-down/210?cb=20160501075538", "caption": "Kaido appears at the Kid Pirates' hideout."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After their encounter, Kaido badly defeated Eustass Kid and placed him in a cell, while Scratchmen Apoo and Basil Hawkins became his subordinates. After Jack's defeat, Apoo contacted Kaido in his fortress, revealing that they had lost all contact with Jack's fleet after they went to attack Zou for a second time."}, {"type": "paragraph", "text": "After learning that Jack's attempt to rescue Doflamingo failed, Kaido was enraged at not being able to acquire any more SMILEs, which meant he could not gain any more Gifters. As he drowned his sorrows in alcohol, Kaido's despair turned to rage when his subordinates mentioned Monkey D. Luffy and Trafalgar Law, causing him to smash one out of the building with his mace. Kaido angrily stated that the two Supernovas were nowhere near him in power, pointing to the defeated Eustass Kid as an example."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Kaido_Swats_Away_His_Lackeys.png/revision/latest/scale-to-width-down/210?cb=20160425072226", "caption": "Kaido vents his rage on his subordinates."}]}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Kaido read the newspaper and angrily wondered why Luffy was in Big Mom's territory. A few days later, he was contacted by Big Mom, who demanded the right to kill Luffy. He rejected her request since he wished to take care of Luffy himself, but Big Mom was unbending as she reminded him of a debt."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After getting drunk, Kaido flew to Kuri in Wano Country. On the way, he found Speed and Tama and attacked them after hearing a report of the former's treachery. He then went to Okobore Town and called out to Jack to bring Luffy and Law to him. While flying over Okobore Town, he recognized Shutenmaru and asked him to become his subordinate. Kaido was drunk and in a partial stupor, which was a sight that unnerved even the likes of Jack, a subordinate known for his own violent streaks, fearing what Kaido would do in this state."}, {"type": "paragraph", "text": "Basil Hawkins then came and told Kaido that Luffy and Law were hiding in the ruins of Oden Castle, and Kaido immediately flew toward it and shot a heat breath at it, instantly destroying it. However, he was then hit in the head by a giant punch from Luffy."}, {"type": "paragraph", "text": "After Kaido was sent crashing into the ground, Luffy got his attention by yelling at him. Kaido attacked with a fire breath, but Luffy dodged and used Elephant Gatling. Kaido then returned to human form, and Luffy activated Gear Fourth: Boundman and assaulted Kaido with Kong Organ. Luffy's attacks were ineffective, as Kaido then struck Luffy with \"Raimei Hakke\", rendering him unconscious with just one hit. Kaido stood over Luffy, scoffing at the idea his opponent aspired to be Pirate King after bringing him down with such ease."}, {"type": "paragraph", "text": "Though Luffy was unconscious, Kaido noticed that Luffy was still glaring at him. He then ordered his men to imprison Luffy, deciding to break his spirit and turn him into a subordinate. While walking away, Kaido learned that Luffy possessed Haoshoku Haki when the latter instinctively knocked out some of his men. Kaido found that attribute worth some credit, but was equally quick to order Luffy locked up. Deciding to take care of Law later, Kaido departed to go drink again, annoyed that he had sobered up."}, {"type": "paragraph", "text": "When he heard that Big Mom and her crew were attempting to enter Wano, Kaido ordered his subordinates to stop them. He then heard that King knocked Big Mom's ship off the waterfall."}, {"type": "paragraph", "text": "While Queen was at Udon, Kaido informed him through Den Den Mushi about Komurasaki's death. Kaido then watched the broadcast of Shimotsuki Yasuie's execution."}, {"type": "paragraph", "text": "After Big Mom was brought to Onigashima, Kaido ordered his subordinates to release her from her cuffs. The two Yonko then clashed weapons, causing the skies above Onigashima to split in two. The two Yonko continued fighting throughout the night."}, {"type": "paragraph", "text": "Both Kaido and Big Mom later stopped their clash and came to an agreement. Kaido then announced to his subordinates that both Big Mom and himself were forming a pirate alliance to take over the world, shocking many who heard the unexpected news."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/28/Kaido_Uses_Bolo_Breath.png/revision/latest/scale-to-width-down/210?cb=20191208030538", "caption": "Kaido destroys the remnants of Oden Castle."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/32/Kaido_Defeats_Luffy.png/revision/latest/scale-to-width-down/210?cb=20181105031112", "caption": "Kaido defeats Luffy with a single blow."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b0/Big_Mom_vs._Kaido.png/revision/latest/scale-to-width-down/180?cb=20190802125133", "caption": "Kaido and Big Mom clash."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Rocks Pirates vs. Roger Pirates and Marines", "elements": []}, {"text": "Kaido vs. Gecko Moria's first crew (unseen)", "elements": []}, {"text": "Kaido vs. Kozuki Oden (unseen)", "elements": []}, {"text": "Kaido vs. Ashura Doji (unseen)", "elements": []}, {"text": "Kaido vs. Eustass Kid and Killer (unseen)", "elements": []}, {"text": "Kaido vs. Speed", "elements": []}, {"text": "Kaido vs. Monkey D. Luffy", "elements": []}, {"text": "Kaido vs. Charlotte Linlin", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [], "images": []}, {"title": "Name", "level": 3, "content": [{"type": "paragraph", "text": "Kaido's name was officially romanized as \"Kaido\" in One Piece Green: Secret Pieces (the long \"o\" in the name left un-transcribed, matching this wiki's romaji convention of long vowels: a normal o or ō with a macron); however, Kaido's bounty poster has shown his name in-story as \"Kaidou\"."}], "images": []}, {"title": "Epithet", "level": 3, "content": [{"type": "paragraph", "text": "The \"hyakujū\" (百獣, \"hyakujū\") part of Kaido's epithet is an idiomatic noun meaning \"all kinds of beasts/animals\" (referring to the animal kingdom), combining the kanji for \"hundred\" (百, \"hundred\") and \"beast (獣, \"beast); it is usually found in the Japanese title attributed to the lion, \"hyakujū no ō\" (百獣の王, \"hyakujū no ō\"), meaning \"king of beasts\". With Kaido's title an obvious derivation (\"Kaido\" replacing \"king\"), it can be translated as \"Kaido of the Beasts\". In the VIZ manga translation, Kaido is instead called \"Kaido, the King of the Beasts\" to make the connection more obvious."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Unknown Status", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 4", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "As with Big Mom's, Kaido's first-shown silhouette prior to his debut (when the Yonko were first explained by Garp) greatly differed from his actual looks revealed much later: depicting him as having a much wider face, a pointier, beak-like nose, and a huge, evil-looking grin as opposed to a frown.", "elements": []}, {"text": "The anime episode of Kaido's debut first aired on May 1st, which is also Kaido's given birthday.", "elements": []}, {"text": "Kaido's bounty is the highest of the Yonko post-timeskip, and also the highest of all living characters.", "elements": []}, {"text": "Kaido's rank as head of the Beasts Pirates is called \"govenor-general\" (総督, sōtoku). In a Japanese context, such term can refer to certain military commanders that were active in Japan from the Bakumatsu to early Meiji era. Additionally, from 1910 to 1945, Japanese-administered Korea had a governor-general, as did Japanese-administered Taiwan between 1895 and 1945.", "elements": []}, {"text": "Kaido seems to be inspired by oni, ogre-like yōkai who are among the greatest icons of Japanese mythology:", "elements": [{"text": "Oni are usually depicted as having a giant, hulking frame, one or multiple horns on their heads, wild hair, and a fierce visage, traits shared by Kaido.", "elements": []}, {"text": "Like Kaido, oni are said to possess immense body strength. In addition, they are often depicted carrying kanabō as their signature weapon, like Kaido does.", "elements": []}, {"text": "Kaido's residence on Onigashima (literally \"island of oni/ogres\") is based on the tale of Japanese folktale hero Momotarō, who according to said tale, when matured into adolescence, went to defeat a band of oni dwelling on an island of said name.", "elements": []}, {"text": "A Japanese proverb is \"oni no me ni mo namida\" (鬼の目にも涙, \"oni no me ni mo namida\"), which literally means \"a tear in the ogre's eye\", saying that even the hardest of hearts can be moved to tears. This fits Kaido's side as a maudlin drunk prone to weeping.", "elements": []}]}, {"text": "A resemblance of Kaido's character can be also observed to a particular oni of Japanese myth, Shuten-dōji, whose story is one of Japan's most popular oni tales (and whom Ashura Doji is also based on):", "elements": [{"text": "Shuten-dōji was a giant, powerful oni and leader of a bandit gang who lived at Mt. Ōe in his fortress. He was born human, but as a child was referred to as a \"monster child\" (怪童, kaidō) for his supernatural strength and wit (which Kaido's name may derive from, with the word \"kaidō\" also translatable as \"an unusually large or strong youth\").", "elements": []}, {"text": "Since his youth, Shuten-dōji had a matchless thirst for sake (hence his name that means \"sake-drinking boy\") and after becoming an oni would often go on drunken rages, similar to Kaido's own drunk persona (in fact, Kaido's sake gourd has the kanji for \"heaven\"  (天, \"heaven\" ) on it, which is also contained in a variant of the name \"Shuten-dōji\" (酒天童子, \"Shuten-dōji\").", "elements": []}, {"text": "In some versions of Shuten-dōji's legend, he was fathered by the legendary monster serpent/dragon Yamata no Orochi (which Kaido's in-story connection to shogun Orochi may be inspired by). Shuten-dōji's lust for alcohol is shared by the Orochi of legend, and in fact, both said dragon and Shuten-dōji were slain by being incapacitated with alcohol.", "elements": []}]}, {"text": "Kaido's name may further derive from Kintarō, also called Sakata no Kintoki, another folk hero of Japanese myth. Not only is Kintarō connected to the figure of Shuten-dōji (capturing him at one point), one of his other names is \"Sakata Kaidōmaru\" (坂田怪童丸, \"Sakata Kaidōmaru\").", "elements": []}, {"text": "Kaido's belt, a twist of white rope with zigzag paper streamers, is based on the ropes (綱, tsuna) traditionally worn by yokozuna (the highest-ranked sumo wrestlers, hence their name) during their entrance ceremonies so as to denote their rank. Said belts are a variation of the much larger shimenawa used to mark off sacred Shinto spaces like shrines; similar to the shimenawa, the yokozuna belts hold religious meaning as objects of purification.", "elements": []}, {"text": "Kaido's Wano-bound reputation as a \"Wise King\" (明王, Myōō) is based on the Wisdom Kings (their Japanese name), who are Vajrayana Buddhist deities.", "elements": []}, {"text": "Kaido's dragon form is that of a Chinese or generally East Asian dragon (or \"lóng\").", "elements": [{"text": "Just as Kaido is said to be the world's \"Strongest Creature\", Eastern dragons are seen as symbolizing power and so are extremely powerful; either semi-divine or literal gods.", "elements": []}, {"text": "Eastern dragons are associated with water as well as the weather (especially summoning rainfall). This may correlate to how Kaido appears to have limited ability to influence weather (or at least clouds).", "elements": []}, {"text": "Kaido's ability, as a dragon, to fly by generating clouds to use as footholds is based on Chinese dragons' ability to magicially fly via clouds.", "elements": []}, {"text": "Kaido's dragon form is blue: in Chinese culture, the Azure Dragon (also \"Blue Dragon\", \"Green Dragon\" or \"Blue-Green Dragon\") is a Dragon God who (as one of the Four Symbols of the Chinese constellations) represents the East and spring season. In Japanese, the dragon is called \"Seiryū\".", "elements": [{"text": "Corresponding to this may be the fact that Kaido lives on Onigashima, which is to the east of the Wano mainland.", "elements": []}]}, {"text": "Eastern dragons are commonly depicted with hair, including a wild mane, long, tendril-like whiskers appended to each side of their snout, and beard hair. This matches Kaido's wild mane, long and thin mustache, and beard that he retains in his dragon form.", "elements": []}, {"text": "Kaido's dragon form has four claws/toes: four-clawed dragons are customarily depicted in Mongolia and Korea (as opposed to the three claws common for Japanese dragons). With respect to China, since its early days of imperial dynasty, four-toed dragons have been a symbol of imperial aristocracy (such as princes) and denoted imperial ranking below that of the Yonkou himself (who was instead symbolized by five-toed dragons).", "elements": []}, {"text": "Eastern dragons are depicted as chimerically amalgamated from multiple animal parts, and there is a saying of \"9 resemblances\", which are commonly: the antlers of a deer, the head of a camel, the eyes of a demon, the ears of an ox, the neck of snake, the belly of a clam, the scales of a carp, the claws of an eagle, and paws of a tiger, but there are differing accounts. Further, in addition to assuming human form, Eastern dragons oft can transform into other animals too. All this may correspond to how Kaido is called \"Kaido of the Beasts\" and commands an army of pirates with animal-based powers.", "elements": []}, {"text": "However, Eastern dragons do not typically breathe fire. Those who do were said to be sent from the heavens to earth as punishment. Kaido's ability to breath a heat blast (contrary to Eastern dragon's water association) could be more inspired by European conceptions of fire-breathing dragons or \"firedrakes\".", "elements": []}]}, {"text": "Kaido's dragon form is also reminiscent of Shenron, a magical, wish-granting dragon god from the Dragon Ball franchise. Notably, dark, swirling clouds accompany the arrival of either character.", "elements": []}, {"text": "Though Kaido's powers are classified as Mythical Zoan, dragons have notably been a real, natural existence in the One Piece world, namely the dragon killed by Ryuma in Monsters (confirmed in the Thriller Bark Arc to have canonically occurred). However, said dragon more so resembled a Western-style dragon as opposed to the East Asian-style dragon form of Kaido. The other dragons seen so far also were more Western-like, and were artificial lifeforms created by Vegapunk.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Kaido_Silhouette.png/revision/latest?cb=20190603231134", "caption": "Kaido's original silhouette"}]}]}