{"sections": [{"title": "Kakukaku", "level": 1, "content": [{"type": "paragraph", "text": "Kakukaku is resident of Water 7 who was seen among the townspeople discussing about the attempted murder of Iceburg. So far, no connection has been mentioned between Kakukaku and Kaku."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kakukaku is a man with rectangular and square-like features, such as his rectangular head with black hair and his rectangular nose. In the anime, he sports a brown short sleeved shirt over a red button up vest, whereas in the digitally colored manga, he wears a red short sleeved shirt with yellow inner edges over a brown button up long sleeved shirt underneath. He also wears green pants with circular designs on them. Around his neck, there is a small necklace."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kakukaku is an erudite and gets scared very easily, unlike Kaku of CP9. Furthermore, he also seemed worried about Iceburg after he had been shot, showing that Kakukaku has deep concern for the wellbeing of a respected individual such as their mayor."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "The next morning after Iceburg had been shot, Kakukaku was seen in the streets of Water 7 theorizing alongside his fellow citizens who had shot their mayor."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 35 Chapter 334 and Episode 237, On the streets of Water 7, Kakukaku is seen listening to else citizens talk about an incident.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 43 (p. 188), Oda reveals the name of Kakukaku.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 43 (p. 188), Oda narrates Kakukaku's personality.", "elements": []}]}], "images": []}]}