{"sections": [{"title": "Schollzo", "level": 1, "content": [{"type": "paragraph", "text": "Schollzo is a member of the Franky Family."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Schollzo is an average-sized, muscular man, with shoulder length light purple hair. He sports black shoulder pads with large red stars on them, along with blue pants and dark purple gloves. He also has goggles and a rope across his chest."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Zambai_Before_Franky_Family.png/revision/latest/scale-to-width-down/250?cb=20130619221439", "caption": "Schollzo before joining the Franky Family."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When he met Franky, Schollzo came to deeply respect him and called him \"Big Bro\" just like the other Franky Family members."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Schollzo is seen with a sword, but it’s not known how skilled he is in using it. Like the rest of Franky Family he wears armor that can protect him against cannonballs."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At one point joined Zambai's group. Afterwards, Schollzo, along with the rest of Zambai's gang, was given a job by Franky and the whole gang was assimilated into the Franky Family."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Straw Hats arrived at Water 7, the Franky Family mugged Usopp and stole 200,000,000 from him. When Usopp entered their house to take the money back, the Franky Family beat him up and threw him out. Moments later, they fought against Luffy, Zoro, Sanji, and Chopper. Schollzo and the other Franky Family members were badly beaten. After Franky abducts Usopp later that night, the Franky Family tried to lure out the Straw Hats but caught the attention of CP9. CP9 then beat up the Schollzo and the others before heading to Franky's hideout where they abducted Franky and Usopp."}, {"type": "paragraph", "text": "When Luffy and his crew were preparing to board the Rocket Man to rescue Nico Robin, Schollzo and his comrades burst into the warehouse, begging Luffy to take the Franky Family with them, in order to save their boss. Luffy easily forgives the group and tells them to hurry up and board, but they decide to join them using their gigantic King Bulls, Sodom and Gomorrah."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Upon arriving at Enies Lobby, the Franky Family along with the Straw Hats and the Galley-La workers laid down their plan of attack. The Franky Family were supposed to move in and open the main gate. Once they reached the main gate, they were faced against the two giants who guarded it, Oimo and Kashi. Schollzo was on Zambai's team, which entered a fierce combat against the giants, and with the aid of Galley-La, they managed to bring them down, opened the gate and led the way for the incoming Straw Hat pirates. The team, riding the giant King Bulls, advanced towards the inner section of the island defeating foe after foe, until they reached the courthouse. There, they split into two groups in order to find the two separate switches that lower the bridge to the Tower of Justice. Zambai, Paulie and a handful of Franky Family members, including Schollzo, engaged the Three-Headed Chief Justice Baskerville in combat but were eventually subdued and apparently defeated."}, {"type": "paragraph", "text": "Upon the news of the Buster Call's issue reaching them, Schollzo and his comrades are already freed by Paulie and desperately tried to make a move and escape the island. When they reached the coast, the Franky Family come across the warship led by Vice Admiral Strawberry, who ordered his men to attack the criminals. The group got bombed and thrown off a cliff but were all saved at the last minute by Paulie's ropes. With the Straw Hat Pirates drawing the attention of the Marines, Zambai and Paulie lead their men aboard the sea train, thus escaping the burning island."}], "images": []}, {"title": "Post Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Straw Hats party, Schollzo joined in alongside everyone else that participated in the Enies Lobby fight."}, {"type": "paragraph", "text": "Later, after discovering that Franky became a wanted man, the Franky Family tried to convince him to join the Straw Hat crew. Schollzo helped in the plan to use Franky's swim briefs as bait to have him chase them through Water 7. When Franky found them, he managed to defeat them easily, including Schollzo."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 325 and Episode 231, Schollzo makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 433 and Episode 315, The Straw Hats, Franky Family, and Galley-La celebrate by having a pool party.", "elements": []}]}], "images": []}]}