{"sections": [{"title": "Kiev", "level": 1, "content": [{"type": "paragraph", "text": "Kiev is a member of the Franky Family."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kiev wears a normal Franky Family's uniform and has a beard and a hair crest. He has two tattoos of a star on each side of his shoulders. He, like every member, is seen wielding a sword. He is somewhat muscular."}, {"type": "paragraph", "text": "After the timeskip, he now has a full beard and wears his hair in a pompadour style. He kept his goggles, but now wears a Galley-La shirt and roller-skates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/10/Kiev_Post_Timeskip_in_Digital_Manga.png/revision/latest?cb=20131216214440", "caption": "Kiev's appearance post timeskip in the digitally colored manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kiev seems fairly realistic and down to earth, unlike some of the other members, since he was unsure about stealing Franky's swim briefs to make him join the Straw Hat Pirates."}, {"type": "paragraph", "text": "When he met Franky, he came to deeply respect him and called him \"Aniki\" just like the other Franky Family members."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kiev is seen with a sword, its not known how skilled he is. Like the rest of Franky Family he wears armor that can protect him against canonballs."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At one point in his life, Kiev became homeless and was left on the streets. He begged people for food and practically starved. One day, Franky found him and told his men to take anyone who was hungry into the Franky Family."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Straw Hats arrived at Water 7, the Franky Family mugged Usopp and stole 200,000,000 from him. When Usopp entered their house to take the money back, the Franky Family beat him up and threw him out. Moments later, they fought against Luffy, Zoro, Sanji, and Chopper and were badly beaten. After Franky abducts Usopp later that night, the Franky Family tried to lure out the Straw Hats but caught the attention of CP9. CP9 then beat up Kiev and the others before heading to Franky's hideout where they abducted Franky and Usopp."}, {"type": "paragraph", "text": "When Luffy and his crew were preparing to board the Rocket Man to rescue Nico Robin, Kiev and his comrades burst into the warehouse, begging Luffy to take the Franky Family with them, in order to save their boss. Luffy easily forgives the group and tells them to hurry up and board, but they decide to join them using their gigantic King Bulls, Sodom and Gomorrah."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Upon arriving at Enies Lobby, the Franky Family along with the Straw Hats and the Galley-La workers laid down their plan of attack. The Franky Family were supposed to move in and open the main gate. Once they reached the main gate, they were faced against the two giants who guarded it, Oimo and Kashi. Kiev was on Zambai's team, which entered a fierce combat against the giants, and with the aid of Galley-La, they managed to bring them down, opened the gate and led the way for the incoming Straw Hat pirates. The team, riding the giant King Bulls, advanced towards the inner section of the island defeating foe after foe, until they reached the courthouse. There, they split into two groups in order to find the two separate switches that lower the bridge to the Tower of Justice. Zambai, Paulie and a handful of Franky Family members, including Kiev, engaged the Three-Headed Chief Justice Baskerville in combat but were eventually subdued and apparently defeated."}, {"type": "paragraph", "text": "Upon the news of the Buster Call's issue reaching them, Kiev and his comrades are already freed by Paulie and desperately tried to make a move and escape the island. When they reached the coast, the Franky Family come across the warship led by Vice Admiral Strawberry, who ordered his men to attack the criminals. The group got bombed and thrown off a cliff but were all saved at the last minute by Paulie's ropes. With the Straw Hat Pirates drawing the attention of the Marines, Zambai and Paulie lead their men aboard the sea train, thus escaping the burning island."}], "images": []}, {"title": "Post Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Straw Hats party, Kiev joined in alongside everyone else that participated in the Enies Lobby fight."}, {"type": "paragraph", "text": "Later, after discovering that Franky became a wanted man, the Franky Family tried to convince him to join the Straw Hat Pirates. After Tamagon stole his swim briefs, Kiev was, at first, shocked by the idea but soon agreed upon it. They all ran away to Scrap Island so Franky could join the pirate crew waiting there for him. When Franky found them, he managed to defeat them easily, including Kiev, but not before Luffy got a hold on his swim briefs. Luffy and Chopper launched themselves back to Scrap Island as Kiev, Sanji, and Zoro lauched Franky to the island with the \"Everything Cannon\"."}, {"type": "paragraph", "text": "After Franky argued with Luffy about joining, the Franky Family threw a bag packed with clothes and personal belongings and told him he should go. Through some \"convincing\" by Robin, Franky decided to go. Kiev and everyone else cried, remembering their former lives and how Franky bettered them."}], "images": []}, {"title": "Two Years Later", "level": 3, "content": [{"type": "paragraph", "text": "Kiev is seen with the Franky Family apart of Galley-La now. He joined Zambai and Tamagon in forming Zambai's company Union. He is seen standing next to Zambai as he negotiates a deal with Bimine."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Kiev is briefly seen as a member of Zambai's gang along with Zambai himself and Schollzo. He disappears before Zambai and his men is defeated, leaving the gang join the Franky Family. He later appears, falling to the ground from starvation before being taken into the Franky Family with the rest of the hungry."}, {"type": "paragraph", "text": "In the manga, the scene where Kiev is part of Zambai's gang does not occur. Instead, he is only seen lying on the ground starving before being taken into the Franky Family."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kiev is the capital city of Ukraine.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 45 Chapter 437, Kiev almost starves before Franky brings him into the Family.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 433 and Episode 315, The Straw Hats, Franky Family, and Galley-La celebrate by having a pool party.", "elements": []}, {"text": "↑  One Piece Anime — Episode 322, In the anime, Kiev is seen next to Zambai and Schollzo as part of their gang before he is shown starving.", "elements": []}]}], "images": []}]}