{"sections": [{"title": "Taroimo", "level": 1, "content": [{"type": "paragraph", "text": "Taroimo is a cyborg dog from Karakuri Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Taroimo is a light brown dog, with a black nose. He has metal around his neck, with holes, and a disk attached to either front sides, with and orange circle and the number \"28\" on them. Over his eyes, there is a piece of metal with vertical lines on it, and a red light coming out from it. On his back he has a yellow propeller type thing. Around the top part of his backside is another piece of metal. He also has sharp teeth."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Taroimo is quite good at following directions, since he attacked Franky when he thought Franky was prey and listened when told to stop. He also has humanlike characteristics, since he was dancing with Franky and his owners, and panicked when Vegapunk’s lab exploded."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He was shown firing missiles from his mouth, as well as having significant resistance to cold weather."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Straw Hat Separation", "level": 3, "content": [{"type": "paragraph", "text": "He was first seen attacking Franky, who was sent flying to Karakuri by Bartholomew Kuma, because he thought Franky was prey. Taroimo was then told to stop by Kitton and his grandfather after they realized whom he was attacking. He then started dancing along with Franky and his owners."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat, Taroimo, Kitton, Kitton's grandfather, and several cyborg animals read the news of the Straw Hats' new bounties."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Taroimo is numbered, just like the Battle Frankies and the Zombies of Thriller Bark. His number is 28.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 523 (p. 16-17) and Episode 418.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 103), Taroimo's birthday is given", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 819, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 12.", "elements": []}]}], "images": []}]}