{"sections": [{"title": "Heracles", "level": 1, "content": [{"type": "paragraph", "text": "Heracles is a strange warrior that used to reside in the Greenstone forest in the Boin Archipelago. He trained Usopp in the use of Pop Greens for two years."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Heracles is dressed in a beetle-stylized armor that looks like a hero costume with a mask that covers his face, a mantle, and a purple cape. He has a round-shaped body with relatively thin arms and legs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6a/Heracles_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180911003344", "caption": "Heracles's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He has an odd habit of adding \"n\" to people's names (a Japanese quirk often done to show friendship), as well as at the end of sentences (in Japanese). For example, he called Usopp (ウソップ, Usoppu) \"Usoppun\" (ウソップン, Usoppun), and he himself is Heraclesun (ヘラクレスン, Herakuresun). He also has a habit of repeatedly introducing himself. Heracles has a usual laid-back attitude, but is quick to react when he senses dangers. He also seems to be an easy target for flattery and compliments."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Usopp", "level": 3, "content": [{"type": "paragraph", "text": "He seems to care for Usopp's well-being, having saved him from being eaten multiple times."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Heracles' main style of combat involves the usage of a spear and explosives. His attacks are apparently very fast. Though round in appearance, he is fit and strong which is evident from the way he defeated a giant beetle and man-eating plant with a single kick. He also has a great amount of knowledge about the different plants and animals of the island where he lives and his armor gives him additional defense. He keeps a stock of Pop Greens in his belt. He also seems to be able to control giant beetles."}, {"type": "paragraph", "text": "Despite his incredible power and combat prowess, he has a tendency to be uncoordinated (having falling headfirst off a vine he was swinging off) and rather nonchalant about his rather painful methods; a spear he threw to kill a giant beetle almost skewered Usopp in the head, and to save Usopp from a carnivorous sunflower, he punched Usopp to create a projectile that defeated the plant."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Heracles was born in South Blue. At the age of 23, he set out on a voyage as a botanist. After three years, Heracles and his group arrived at the Boin Archipelago. He lost his comrades a year later, but continued his research alone."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Straw Hat's Separation Serial", "level": 4, "content": [{"type": "paragraph", "text": "Usopp encounters Heracles on the Boin Archipelago, where he was sent flying by Bartholomew Kuma. Heracles rescues Usopp from a giant beetle. Usopp, though thankful of Heracles, looks in shock at his proposal to eat the giant beetle. While Usopp is distracted, a giant man-eating plant tries to devour him, but he is saved once again by Heracles. Heracles informs Usopp to be more careful if he wants to keep his life and possessions. Heracles is later seen alongside Usopp eating ramen in a part of the large forest consisting entirely of edible food (such as \"spaghetti plants\", \"ham fruits\", and \"chocolate rocks\") while Usopp hungrily looks at the food around him, which led to the Straw Hat sniper to become fat, with Heracles emitting a gasp and looking at him in shock."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "When a News Coo drops a newspaper down to the Archipelago, Usopp learns about the events of the Whitebeard War and tries desperately to get off the island to help his ailing friend and captain Monkey D. Luffy to get over the trauma of his brother's death. Heracles tries to stop Usopp from fighting a giant beetle, but fails as Usopp attempts to get past it. When Usopp lost, Heracles informs him that more and more dangerous creatures will appear as he tries to go away from the center of the island. But Usopp does not listen and takes off again regardless of Heracles' warnings. Heracles tells Usopp that escaping the island is impossible because of the giant creatures that get attracted to the aroma of the island; he notices that the island is beginning to move and warns Usopp to cling to something as due to the island is actually a large carnivorous plant called the Stomach Baron. The island moves again and Heracles, fortunately, saves Usopp from falling into the island's mouth."}, {"type": "paragraph", "text": "Heracles then question Usopp for his sudden change of behavior since reading the newspaper, to which Usopp answers by saying that Luffy is in pain after losing his brother and that he needs to be there for Luffy. While Usopp was reading the article about Luffy going back to Marineford, Heracles asked him what he was reading now."}, {"type": "paragraph", "text": "Some time later, Heracles and Usopp are escaping from the dangerous creatures on the island as they do everyday. Heracles realizes the hard determination Usopp gained after reading the newspaper, which makes him question what the pirate read. Usopp tells Heracles the message from Luffy and then he asked Heracles to train him, saying that he can learn a lot of things from Heracles, like fighting and sniping abilities calling him \"Amazing Warrior\", \"Sensei\", and then remarking that his name is pretty cool. With all these comments Heracles gets excited and agrees to train Usopp, beginning with the different types of plants there are in the island and their different uses in battle, specifically Pop Green and their energy and growth properties. He trains Usopp in the use of Pop Greens for two years until the time has come for the latter to reunite with his crew mates."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "Heracles and Usopp escape the Boin Archipelago and travel to Sabaody Archipelago. As the Straw Hats prepare to set sail for Fish-Man Island, Heracles is shown commanding a group of giant beetles to hold back the Marines and stop them from pursuing the Straw Hats. He wishes Usopp the best of luck."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Gold", "level": 4, "content": [{"type": "paragraph", "text": "Heracles was in Gran Tesoro's giant casino when the Straw Hat Pirates arrived there."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "As Heracles traveled back to the Boin Archipelago onboard a giant beetle, he received news of the Straw Hats' accomplishments at Dressrosa."}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "The anime expands on Usopp's and Heracles' adventures on the Boin Archipelago, as well as bringing up facts that are not revealed in the manga until much later after the war."}, {"type": "paragraph", "text": "When Usopp and Heracles first met, the method in which Heracles dispatched the man-eating plants were different. In the anime, Heracles threw a ball into the plants mouth, but in the manga, he threw something that wrapped vines around the plant, which was most likely the foreshadowing of the Pop Greens."}, {"type": "paragraph", "text": "The expansion of their escapade starts as Usopp is shown to be running away from a giant sunflower plant with Heracles watching on. Usopp asks Heracles to help him against the giant sunflower plant, which is trying to eat him alive. Heracles manages to save Usopp and tells him to build up stamina as he is weaker than ants and worms on that island. Usopp denies this at first, but later agrees with Heracles when he sees a giant ant and worm. Heracles easily beats both the ant and the worm and asks Usopp if he wants to eat them. Usopp in his traditional fashion looks in utter disbelief at Heracles's proposal. He then informs Heracles that he is hungry and wants to eat something edible. Heracles takes him to a place where items like ramen, spaghetti, ham and chocolates are available in abundance. Usopp starts to gulp down the items and is told by Heracles to also work out to build stamina as eating alone will not do it."}, {"type": "paragraph", "text": "Later, Heracles loses sight of Usopp, who is busy eating out all the delicacies available on the island. When he finds him, Usopp has already become fat. He tells Usopp to lose some calories when all of a sudden the island starts to move and eats everything on it. Both Usopp and Heracles try to escape, with Heracles catching hold of a branch and tries to catch Usopp, but Usopp is too heavy for Heracles to hold on to. He waves his goodbyes to Usopp, believing it is inevitable that Usopp will be eaten, but Usopp catches a ramen branch and eats it to climb up and escape."}, {"type": "paragraph", "text": "Afterward, Heracles finds Usopp and tells him that fat things will definitely be eaten on the Boin Archipelago, which is in truth a group of giant carnivorous plants. He also informs him that it is impossible to escape the island."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece Running Chopper: Chopper and the Island of Bonds", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He bears the same name as the Greek Hero, Heracles, also known as Hercules in Roman mythology.", "elements": []}, {"text": "\"Hercules\" and \"Kabuto\" are both types of beetles and coincidentally represent both Heracles and Usopp respectively (in Usopp's case, it is his weapon).", "elements": []}, {"text": "He can be seen walking around Gran Tesoro at the end of Heart of Gold and at the film.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 524 and Episode 420, Heracles made his debut saving Usopp.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0567), Information about Heracles is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 156), Heracles's birthday is given.", "elements": []}, {"text": "↑  One Piece Anime — Episode 455, Usopp's and Heracles' escapade expanded and earlier facts introduced.", "elements": []}, {"text": "↑ One Piece Manga - Vol. 56 Chapters 550-551 Cover Story: Usopp's \"I'll-Die-If-I'm-On-My-Own Disease\", Usopp and Heracles eating, with Usopp fattening rapidly.", "elements": []}, {"text": "↑  One Piece Movie 13.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 823, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 15.", "elements": []}]}], "images": []}]}