{"sections": [{"title": "Magellan", "level": 1, "content": [{"type": "paragraph", "text": "Magellan is the vice warden of Impel Down. He was formerly the chief warden, but after his failure to stop the jail's one and only mass-breakout, he was replaced by Hannyabal and demoted to vice warden."}, {"type": "paragraph", "text": "He was the main antagonist during the Impel Down Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Magellan is a large man, about three times the height of a normal human. He has a face that resembles a mandrill, with very sharp teeth and a thick beard. His fingers closely resemble those of the Blue Gorillas."}, {"type": "paragraph", "text": "He wears bat wings and horn-like ornaments on his head, the latter of which he can pull out and use as weapons. Underneath those horns, he has short black twintail-styled hair. Overall, Magellan resembles a devil. While most guards wear a white-colored uniform, Magellan wears a black-colored suit with a red shirt underneath. His suit features more buttons than those of his subordinates. Draped over his right shoulder is a piece of rope. He wears what appears to be the standard cap of Impel Down workers."}, {"type": "paragraph", "text": "Twenty years ago, while Magellan was still the vice-chief, he had the same attire as he did today, with the exception of the uniform being tan instead of black, and a green shirt."}, {"type": "paragraph", "text": "After the timeskip, Magellan still wears the same attire as two years ago. He has gained scars on the left side of his face which cover his cheek and eye. Also, his left wing and his left horn are broken and have been repaired with sheet metal. All these scars and new designs on his appearance are very likely from the near death experience he gained from the level 6 inmates escaping."}, {"type": "paragraph", "text": "When he was a young child, he was chubby and his horns were much smaller. He had hairy arms and his fingernails were painted black. He had a light colored long sleeve shirt with a three headed dragon on it along with light colored shorts and black shoes. He is depicted as watering some flowers. However, they died due to the poison oozing off his arm, showing that he already had his Devil Fruit power as a child."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Magellan's biggest quirk is his severe diarrhea brought upon by his frequent consumption of poisoned food. His Devil Fruit ability gives him immunity from actually being poisoned, but it does not spare him from diarrhea. As a result, he spends approximately ten hours each day in the bathroom relieving himself and eight hours sleeping; even after suffering such conditions multiple times, he still insists on eating poisoned food. It has been hinted that he is actually agoraphobic and enjoys dark, enclosed spaces."}, {"type": "paragraph", "text": "Though he only performs roughly four hours of duty per day as Warden of Impel Down, he still takes his role quite seriously and does not tolerate the prisoners' bad behavior. As he has permission to execute any one of them he sees fit, he shows no hesitation to drench them in his Hydra's lethal poison, when insulted by prisoners as seen with what happened on Level 6."}, {"type": "paragraph", "text": "Magellan also takes great pride in keeping Impel Down's reputation of being impenetrable and inescapable, and felt personally insulted when Monkey D. Luffy became the first to stain that record since Shiki 20 years ago. Despite his demotion, he is still considered the most reliable man of Impel Down."}, {"type": "paragraph", "text": "Magellan's pride with Impel Down led him to reject the help of the Marines and any other outsiders, and instead took a risk and released Shiryu to assist, which turned out to be a critical mistake that nearly cost Magellan his life. Even when he was in a near death state, Magellan wanted to take responsibility for the Level 6 convicts to the point he wanted to commit suicide for his failure."}, {"type": "paragraph", "text": "Magellan seems to find it amusing whenever someone he does not particularly like gets poisoned or suffocated by his powers, evident when he was seen chuckling at Hannyabal after he sighed a poisonous mist at the latter's direction. While he also does not tolerate Hannyabal's poisonous (the actual term used is punned with the word distant) comments he himself is prone to use them against himself. It is also shown that he is not as emotionally stern as Hannyabal, as he clearly went head over heels with and easily persuaded by Boa Hancock, while the vice warden remained focused and serious with the crisis they were having. Despite the silly aspects of himself, he is an extremely serious combatant, speaking little and never toying with his opponent. His ruthlessness applies not only to the prisoners, but also to his own men, as seen when he was berating a guard who was accidentally poisoned by his Hydra."}, {"type": "paragraph", "text": "He will also not tolerate any of his own men who abuse their power, as he dismissed Shiryu for killing prisoners for fun and had him jailed in Level 6, this intolerance renders Magellan unable to forgive, as even though he accepted Shiryu's assistance, he only postponed the death sentence, rather than retracting it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Magellan%27s_Toilet_Seat.png/revision/latest/scale-to-width-down/230?cb=20161029215012", "caption": "Magellan's \"special seat\"."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "World Government", "level": 3, "content": [{"type": "paragraph", "text": "Magellan is quite loyal to the World Government. He takes his duties quite seriously and he is proud of the prison’s reputation. Also after the war at Marineford, Magellan left his medical care to take responsibility for the mass breakouts despite his critical condition."}], "images": []}, {"title": "Impel Down Personnel", "level": 3, "content": [{"type": "paragraph", "text": "He shows his ruthlessness by using his poisonous breath to put his subordinates into place, and drench them in the corrosive Hydra when they are in his way of battle, without as much as an apology. Magellan seems to care very little to none for the well beings of his subordinates, especially when it comes to serving his duties as the warden of the place."}, {"type": "paragraph", "text": "He and Hannyabal are often at odds with each other between Hannyabal's ambitiousness and his own negligence for the majority of his duties. Hannyabal cares little for his superior Magellan, whom he simply wishes to see fail or be rid of so he can become the chief warden in his place. Even when not suffering from Freudian Slips, around his superior Hannyabal will also openly state his desire to see his superior fail or die. Often Hannyabal will scold Magellan's behavior as he displays poor qualities as a warden overall, such as falling head over heels for Boa Hancock and her charms. His actions will often invoke Magellan to send poisonous gas in Hannyabal's direction. Out of all his subordinates, Hannyabal is the one most likely to be the target of Magellan's poison. However, despite these conflicts, Magellan recognizes Hannyabal as the only man who would actually be worthy of taking over his place as Chief Warden. After the timeskip, with Hannyabal now warden and Magellan demoted to vice warden, he seems to be displeased that Hannyabal has taken his job due to the break out and how Hannyabal is enjoying it."}, {"type": "paragraph", "text": "He holds a certain respect towards Sadi for her viciousness and tracking skills. Sometime during the time skip, Sadi developed a crush on Magellan."}, {"type": "paragraph", "text": "Shiryu, who murdered many prisoners for fun, had earned Magellan's fury. Seeing that Impel Down is in its greatest hour of need, Magellan was willing to suspend Shiryu's death sentence and reluctantly enlisted his assistance. However, this proved to be a mistake, as Shiryu betrayed the prison, murdered his fellow guards and defected to the Blackbeard Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Magellan_and_Hannyabal_Relationship.png/revision/latest/scale-to-width-down/250?cb=20130504044039", "caption": "A typical moment Magellan has with Hannyabal."}]}, {"title": "Criminals", "level": 3, "content": [{"type": "paragraph", "text": "He has permission to kill any criminal within the walls of Impel Down. He cares little for them and will willingly use extreme measures against them. His tolerance for prisoners runs extremely low. When pushed to react, he covers them in poison and leaves them with no cure. In turn, while most prisoners badmouth Magellan in his presence, they also fear him for his ruthlessness, and in particular, his Hydra technique. When the mass breakout occurred, Magellan let his poison flood the place, not giving the escaping prisoners any mercy. Regardless, Magellan does not abuse his privilege of killing prisoners, and discourages his subordinates from doing so. He jailed Shiryu for killing prisoners for fun."}], "images": []}, {"title": "Shiki", "level": 4, "content": [{"type": "paragraph", "text": "Twenty years ago before the start of the series, Shiki was the first prisoner to escape from the great prison Impel Down, by cutting off his own shackled legs and later replaced them using his own personal swords as prosthetic limbs. Magellan (as a Vice Warden at that time) was seen reporting to his superior about his escape. Shiki's incident hurt the prison's pride along with Magellan's."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Magellan holds a particular grudge against Monkey D. Luffy, the first man to ever break into Impel Down which is not only a tarnish to the Great Jail's perfect record since Shiki, but also a personal insult to himself as the Chief Warden. This hatred only intensified when Luffy led a large amount of prisoners on an attempted mass-breakout, causing the prison to face one of its greatest crises. Magellan swore that he would not allow Luffy to rescue Ace, nor let him step outside of the prison. Unfortunately for him, this vow was not kept, as Luffy successfully led a mass-breakout army out of the prison, leading Magellan to suffer the ultimate humiliation. To this end, Magellan attempted to take revenge on the prisoner who stayed behind to help Luffy's escape, Mr. 2 Bon Kurei."}], "images": []}, {"title": "Bentham", "level": 4, "content": [{"type": "paragraph", "text": "Bentham's actions during the final states of Impel Down Arc made Magellan furious. After a long and arduous battle up through all the floors alongside the rest of the Impel Down breakout crew, Bentham managed to reach Level 1. However, he stayed back to ensure the others' escape. After completing his mission by opening the gates and destroying the mechanism that controls it, Bentham is confronted by the real, and shocked, Magellan. He reverted back to his normal self, ready to take Magellan's judgment. In the end, Bentham fought Magellan, who asked him if he had any last words. He responded by saying that he had no regrets. Magellan was unsuccessful in killing Bentham."}], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Teach's invasion to the great prison caused even more chaos. It is presumed that Teach has dealt a powerful blow to the already weakened Chief Warden Magellan of Impel Down, either in liberating the Level 6 Prisoners, or in another direct conflict. Teach was also able to recruit Magellan's former subordinate Shiryu into his pirate crew after Magellan freed Shiryu to help with the mass breakout. Either way, Magellan was reported having suffered near-fatal injuries, but Magellan claimed that worse was done to his pride."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the former warden of Impel Down, Magellan had full control of the prison. However, after the timeskip, with Hannyabal now the warden and Magellan having been demoted to vice warden, his control of the prison is second to Hannyabal. According to Mr. 2 Bon Kurei, Magellan is known to silence even the most ultimate of prisoners. Indeed that all the prisoners are afraid of him. Even two former Shichibukai, Crocodile and Jinbe, were concerned of Magellan's upcoming arrival."}, {"type": "paragraph", "text": "He has both the authority and the ability to execute any of the prisoners within Impel Down as he sees fit. Despite being occupied by intense diarrhea for 10 hours per day, sleeping for another 8 and recessing for another 2, Magellan is still capable of easily coordinating the defense squads of Impel Down in case of a potential break-in or break-out, as well as being fully aware of all the mechanics of the prison's traps. However, since Magellan's work hours are limited by his diarrhea, Shiryu was considered more dangerous."}, {"type": "paragraph", "text": "He also easily dispatched Blackbeard and his crew when they first met. However, according to Shiryu, this happened because they underestimated Magellan's strength. Magellan was later badly beaten by the Blackbeard Pirates."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Even without his Devil Fruit powers, Magellan is far stronger than normal humans, as he easily blocked a wax-covered Gomu Gomu no Champion Stamp with one arm, as well as pillars of stone hurled at him by Inazuma with both of his forearms. He also pinned down Ace with just one arm when the young pirate attempted to get away."}, {"type": "paragraph", "text": "He is also incredibly resilient, as he took many of Monkey D. Luffy's Gear Second attacks straight on (an impressive feat as Luffy's Gear Second attacks are capable of breaking through strong defenses quite easily) and managed to stand back up to continue fighting with no lasting injuries, as well as receiving multiple shots of cannon fire without any resulting injuries."}, {"type": "paragraph", "text": "Magellan is relatively unfazed by the boiling temperatures of Levels 3 and 4 or the sub-zero temperatures of Level 5 in Impel Down."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Magellan has eaten the Doku Doku no Mi, a very powerful Paramecia-type Devil Fruit that allows him to generate and manipulate poison. Magellan can produce these poisons in different strengths and forms, such as breathing simple and minor toxic gas to put subordinates in place, blowing tear gas-bubbles to stun the opponents, or create an extremely fatal liquid poison. His most infamous technique, one that is well-known to most prisoners within the walls of Impel Down, is a three-headed dragon called the Hydra; the attack is composed of corrosive liquid poison that causes lethal nerve-paralysis and melts the victims at the same time. His Hydra also had the power to easily defeat the Blackbeard Pirates with little to no effort, although Shiryu stated that the crew had severely underestimated Magellan."}, {"type": "paragraph", "text": "Magellan usually creates a thick layer of liquid poison around him as armor, and including his high endurance, he has an advantage against close-quarter combatants who rely on physical contact. Because of the fruit's powers, Magellan is immune to all types of poison. Poison gives food flavor for him, but while he is immune to the poison, the food instead afflicts him with diarrhea. This is a big problem for him since he loves to eat poisoned food. The effects of the Doru Doru no Mi seem to neutralize Magellan's poison, as seen when Mr. 3 blocked an attack with his Candle Wall. Another example is when Mr. 3 fashioned wax armor for Luffy, allowing Luffy to attack Magellan without poisoning himself."}, {"type": "paragraph", "text": "This proved to be short-lived, however, as a more powerful version of Magellan's poison, Kinjite, which forms the Venom Demon: Hell's Judgment, was used and dissolved the wax armor Luffy was wearing. Venom Demon: Hell's Judgment appears as a gigantic, skeletal-looking demonic beast, and Magellan has stated that the poison used is powerful enough to \"destroy Impel Down itself.\" Not only is the poison more lethal and caustic than Hydra, but it also spreads out from any surface it touches, literally \"infecting\" everything, including stone. It is unknown whether there is any antidote for this poison, but seeing that it instantly kills the afflicted once the infection completely covers the victim, no such antidote may exist."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/21/Doku_Doku_no_Mi_Infobox.png/revision/latest/scale-to-width-down/230?cb=20160129102538", "caption": "Magellan covering himself with poison"}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "The ends of Magellan's horns are detachable, and can be worn like boxing gloves over four fingers (his thumbs stick out). The sharp points allow for the weapons to slash and pierce. Magellan can also transmit his poison abilities through the horns and dissolve anything they touch."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early Life", "level": 4, "content": [{"type": "paragraph", "text": "Sometime during his childhood, Magellan ate the Doku Doku no Mi. This had a rather adverse effect, as a flower he was caring for died from the poison dripping from his body."}], "images": []}, {"title": "Shiki's Breakout", "level": 4, "content": [{"type": "paragraph", "text": "Twenty-two years ago, when Shiki escaped from his cell and from the great prison, Magellan (who was still Vice-Warden at the time) went to his cell and was shocked to find that Shiki had severed his own shackled legs to make the breakout possible."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Magellan_as_Vice_Warden_22_Years_Ago.png/revision/latest/scale-to-width-down/190?cb=20100521032216", "caption": "Magellan as a Vice-Warden reporting Shiki's escape."}]}, {"title": "Shiryu's Incarceration", "level": 4, "content": [{"type": "paragraph", "text": "Another incident in the past, Magellan was seen confronting his colleague, Chief Jailer Shiryu of the Rain, who was murdering prisoners of Impel Down for sheer pleasure. After Shiryu displayed his apathy towards Magellan's objections and went on a rampage, the Warden decided to strip Shiryu of his position as Chief Guard and sentence him to Level 6 of the very prison that they both guarded until his death sentence."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Vice Admiral Momonga arrived at Impel Down with Boa Hancock to visit Portgas D. Ace, Magellan introduced himself and commented about the toilet, saying it was a \"vicious struggle\". Magellan also said that it was too bright, saying he wanted to be in a closed off space, while wanting to close his heart off to the world."}, {"type": "paragraph", "text": "Magellan apologized for being late as he was relieving himself. Hannyabal suggested that it might be all the poison that Magellan was eating. With this, Magellan said that he loves poison saying \"poison should be fought with poison\". Hannyabal told Magellan to hurry and slip from his seat accidentally, when he was supposed to mean for Magellan to quickly take the visitors to see Ace. Magellan said that he had been cursed with such subordinates. He sighed and let out a breath of poison. Hannyabal was overcomed for a short time, while Hancock, Domino, and Momonga were wearing gas masks. Outraged, Hancock jumped on Magellan's chest and looked up, saying that the air was foul with his poison. Magellan then commented about Hancock's beauty while Hannyabal was sitting on the Chief Warden's seat, with Domino pointing that out."}, {"type": "paragraph", "text": "Magellan and Hannyabal then escorted Boa Hancock to Ace's cell. After arriving at level 6, Magellan became irritated with the screams of the prisoners catcalling to Boa Hancock. He used his special attack, Hydra, and attacked one of the prisoners, stating he had the power and authority to execute all of them on the spot. After Hancock left, Magellan received news about Luffy's infiltration, and Magellan ordered all forces to report to Level 4 to prepare for interception. Just as Luffy and Mr. 2 Bon Kurei were near the kitchen, Magellan suddenly dropped from out of nowhere in front of them, with his powers already activated and ready to fight."}, {"type": "paragraph", "text": "Seeing this, the guards quickly tried to get out of the way, begging Magellan to wait before he began fighting so they would not get swept up in his poison. Bon Kurei yelled at Luffy not to fight him, telling him of his poison powers and that they should forget finding food and escape. Magellan then informed them that he had the guards and staff blocking the exits, effectively trapping the group on the level. He also revealed his intention to make Luffy tell him how he got into Impel Down. However Luffy refused to tell even if he dies. Thus, the fighting began, with Magellan using his poison hydra and sending it after the two, forcing Luffy and Bon to run away while a few lingering guards are caught in the wave."}, {"type": "paragraph", "text": "As the guards cried in pain and begged for the antidote, Magellan scolded them for getting into his combat range, while Luffy jumped off the bridge and grabbed onto a hanging spike platform, swinging himself onto it, and burning himself in the process since he swung over flames. However, he did manage to destroy one of the Hydras which plunged into the Pool of Blood, while the rest were out of range to attack Luffy. Magellan countered this by blowing a poison bubble called Chloro Ball towards Luffy, which exploded once it reached the platform. Luffy managed to jump to another one to avoid the explosion, but gas suddenly produced from it. The guards quickly put on masks, commenting that it was the sneezing tear gas, causing Luffy's (and the unfortunate inmates on the level) eyes to water and sneeze uncontrollably."}, {"type": "paragraph", "text": "Magellan then had the Hydra stretch to Luffy's location and used it to \"swim\" to the Straw Hat, dubbing the move Venom Road. The warden then took off his horns, fitted them over his hands, and tried to stab Luffy with them. The horns were also coated with poison, evident when Luffy dodged a strike and saw the rocks it hit instantly melted (similar to Crocodile's poison hook). Magellan attacked again but Luffy redirected the attack with his foot onto the platform causing it to break and sending him falling toward the flames. Though, Luffy saved himself by using his Gomu Gomu no Stamp, knocking himself back onto the main bridge, Luffy found himself fatigued as Magellan stood over him, asking him if he still wanted to continue to fight. Luffy however stated his determination on saving his brother and that if he could not win by not hitting Magellan, he would have to make a sacrifice in order to do so. Luffy instantly activated Gear Second and proceeded to hit Magellan head on with a Jet Bazooka, hurting the warden but at the same time, getting poison on his hands as well."}, {"type": "paragraph", "text": "Magellan was surprised he actually took a hit from Luffy, but Luffy was in worse condition as the poison corroded his hands. Regardless, he struck at the warden with a Jet Gun, just as the warden puffed up and shot out multiple Chloro Balls. Luffy dodged and went for a Jet Pistol, but Magellan countered with his hydra, nullifying the attack and dripping Luffy with more poison. Luffy tried to get some distance but Magellan breathed out a mist into the air which the warden called Poison Cloud, making Luffy's vision hazy and causing him to lose his hearing."}, {"type": "paragraph", "text": "Magellan stated that not even Luffy's hands would respond to him as the cloud would eventually rob him of everything, to which Luffy started to double over. Luffy tried to attack Magellan again but the attack did not even come close to hitting the warden as the poison continued to affect him. Magellan was astonished by his mental strength. Luffy tried again, but kicked into the flames of the bridge, burning himself once more. Magellan finally decided to end the battle and completely covered Luffy with his Hydra. Luffy was defeated, covered from head to toe in poison as it melted away at him. Magellan cited it as a punishment for invading Impel Down explaining that in 24 hours, Luffy would go to the real hell. Magellan ordered the guards to throw Luffy into Level 5, despite the fact that he would die anyway."}, {"type": "paragraph", "text": "Back on Level 4, Magellan found all the guards knocked out and the Level 3 door open. After waking up Hannyabal, Magellan was informed that Bon Kurei plowed through and headed back up to Level 3. Magellan ordered the guards to capture him and had the Jailer Beasts disperse, ordering the others to clean everything up as he went to his sealed place (the bathroom). When asked what to do with the captured Buggy and Mr. 3, he left Hannyabal to do as he wished to them. Hannyabal told the guards to go help capture Bon Kurei, which they complied."}, {"type": "paragraph", "text": "In a lift leading to Level Six, Domino scolded Magellan for his delay and informed him that they would hand Ace over to the transport at 9 AM sharp and failure for an important assignment would mean having a huge stain on their record. Magellan later arrived at Ace's cell, preparing to transfer him to Onigumo and his marine squad. After reaching topside, Magellan heard about Luffy arriving at Level 6 and expressed surprise that Luffy survived his poison. Magellan slammed Ace, who was trying to make an escape to the elevator back to Level 6 after hearing the report as well, to the ground."}, {"type": "paragraph", "text": "After handing Ace over to the marines, Magellan traveled down to Level 2 after hearing about another riot to deal with it himself by poisoning nearly all the prisoners, unleashing his powerful Poison Cloud on the whole floor to kill the remaining prisoners and blocking all the exits with poison to prevent them from escaping. He was seen using a Den Den Mushi to tell Hannyabal to hold on at Level Four and that he would be there himself shortly, and then switching communication over to Shiryu, accepting his offer for assistance under the condition that it was a mere postponing of the death sentence that was hanging over the former Head Jailer's head."}, {"type": "paragraph", "text": "Magellan soon came across a tied up Sadi-chan, who lost her fight against Iva. Magellan ordered her to be released as he prepared to take the Blackbeard Pirates head on. Magellan identified Blackbeard and used his Hydra move on the Blackbeard Pirates, incapacitating them. After finding a beaten and unconscious Hannyabal, the warden complimented him on holding out as long as he did before ordering him not to die, stating that Hannyabal was the only successor that Magellan would ever accept to replace him. Magellan then yelled out to Luffy, saying that he would not let the Straw Hat escape alive."}, {"type": "paragraph", "text": "Buggy, Mr. 3, and their bunch soon reached Level One, continuing the riot from there while Luffy's breakout has reached Level 3. However, Magellan was closing in fast, taking out most of the rioters that were escaping with them and quickly reducing their numbers. He later reached the stairway to Level 2 and confronted Iva and Inazuma. After Inazuma cut the stairway into pieces and blocking the exit, Magellan began fighting Iva. Iva was later seen kneeling on the ground screaming about his face. Magellan simply looked on when Iva stood back up, with a normal face, tossing a mask of 'heavy make-up' away. Magellan stated that Iva was boring him and Iva responded with Newkama Kenpo. He used a move called Dream-Strike-Condemn-Reverse-Fist, which Magellan prepared to retaliate."}, {"type": "paragraph", "text": "After incapacitating Iva by soaking him in poison, Magellan proceeded up to Level One using Venom Road and confronted Inazuma. A shocked Inazuma prepared to battle and cut more floor out of the ground and used them as a defensive stance as Magellan continued forward. At the exact time, Magellan used Hydra, forcing all the prisoners to keep running. As he was about to attack Luffy's group, his Hydra was stopped by Mr. 3's Candle Wall."}, {"type": "paragraph", "text": "After Mr. 3 fitted Luffy's hands and feet with wax boxing gloves and shoes, the warden attacked them with another Hydra, forcing Mr. 3 to create another Candle Wall. Luffy then jumped out and hit Magellan with a Gomu Gomu no Champion Rifle. The attack knocked Magellan back with no effect on Luffy, effectively allowing the Straw Hat to fight one-on-one without getting poisoned. The other prisoners managed to find cannons, which they stick through the candle wall and fire upon Magellan, hitting him further."}, {"type": "paragraph", "text": "Magellan suddenly shifted to a new type of poison called Kinjite which he explained could destroy Impel Down itself. Magellan closed in on the small force holding out against him. Luffy attempted to fight Magellan even more, but Magellan simply shrugged a Gomu Gomu no Stamp off. The poison crawled up Luffy's wax leg armor, at which Mr. 3 used Doru Doru Cancel. Magellan proceeded and used Venom Demon: Hell's Judgement, forcing Mr. 3 and Luffy to flee as he continued his approach, unable to be stopped."}, {"type": "paragraph", "text": "Magellan later cornered the escaped prisoners near the prison entrance. At that moment, Iva used Hell Wink to launch himself and Inazuma to the top of the prison. As Magellan and his Venom Demon surged forward, Luffy activated Gear Third. In the midst of that, Mr. 3 created a gigantic wax wall with spikes on one side. Luffy used Gomu Gomu no Giganto Stamp and pushed the wax wall into the Venom Demon, pushing it back momentarily. However, the poison began to eat through the wall. Luffy urged Iva to wake up and told everyone to grab onto Iva's face. Determined, Magellan stated that their plan would fail and that they would not escape. However, Iva used his hell wink and flied in to the ocean, holding everyone on him."}, {"type": "paragraph", "text": "After the prisoners were picked up by a large school of whale sharks that were summoned by Jinbe, Magellan looked at the pack of rescuers with shock and fury as he suffered the ultimate humiliation of letting the first mass-breakout to ever occur in the history of Impel Down. Quickly taking action to make sure that the prisoners would not escape alive, Magellan ordered the Marine battleships stationed outside to open fire at the one housing the escapees and that he would board one to eliminate them himself. Magellan assured himself that, with the sealed Gates of Justice, there was nowhere for the prisoners to run. However, to his shock as well as the Marines', the Gates began to open, supposedly commanded to do so by Magellan himself. Magellan and the other gaolers were shocked to find Mr. 2 standing there, doing his traditional okama dance."}, {"type": "paragraph", "text": "Shaking with fury, Magellan prepared to take his rage out on Mr. 2, who stated that he had no regrets. Mr. 2 survived the onslaught and the warden was stained with the disgrace of allowing 241 prisoners to escape his grasp. The Blackbeard Pirates, who have been saved by Shiryu, managed to free four prisoners from Level 6 to increase their crew strength before leaving Impel Down, meaning that they too managed to elude, or even defeat, Magellan."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Luffy_vs._Magellan.png/revision/latest/scale-to-width-down/250?cb=20140801110433", "caption": "Luffy hits Magellan with Jet Bazooka."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/Luffy_Defeated_by_Magellan.png/revision/latest/scale-to-width-down/250?cb=20130330195519", "caption": "Magellan poisons Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Magellan_vs._Blackbeard_Pirates.png/revision/latest/scale-to-width-down/260?cb=20160129102810", "caption": "Magellan poisons the Blackbeard Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2a/Newkama_Kenpo_Infobox.png/revision/latest/scale-to-width-down/250?cb=20130224091837", "caption": "Magellan battles Ivankov."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Venom_Demon_Jigoku_no_Shinpan.png/revision/latest/scale-to-width-down/260?cb=20130916152418", "caption": "Magellan's last resort, Venom Demon: Jigoku no Shinpan."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/Magellan_vs._Bentham.png/revision/latest/scale-to-width-down/250?cb=20130622044709", "caption": "Magellan takes his anger out on Mr. 2."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the end of the war at Marineford, Sengoku was informed that Magellan gained consciousness in an infirmary bed after receiving a severe beating. In spite of being in such bad shape, Magellan claimed to want to take the responsibility, even going as far as to wanting to commit suicide for his failure."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "After the time skip, the once feared Magellan has been demoted to vice warden while his former subordinate, Hannyabal, became the warden of Impel Down. Also, Sadi has recently fallen in love with Magellan."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was assigned to guard Donquixote Doflamingo and remained out of sight as the Ex-Shichibukai talked to him from within his cell."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Magellan vs. Shiryu (past battle, unseen)", "elements": []}, {"text": "Magellan vs. Monkey D. Luffy (Level 4)", "elements": []}, {"text": "Magellan vs. Prisoners rioting in Level 2", "elements": []}, {"text": "Magellan vs. Blackbeard Pirates (Level 4)", "elements": []}, {"text": "Magellan vs. Emporio Ivankov (Level 3)", "elements": []}, {"text": "Magellan vs. Inazuma (Level 2)", "elements": []}, {"text": "Magellan vs. Monkey D. Luffy, Mr. 3 and prisoners of Impel Down (Level 1)", "elements": []}, {"text": "Magellan vs. Mr. 2 Bon Kurei (unseen)", "elements": []}, {"text": "Magellan vs. Blackbeard Pirates (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In episode 446, Hannyabal had a flashback concerning his past. Olive was the first prisoner he dealt with and she successfully had the new jailer lower his guard, knocked him out and stole his clothes. Unfortunately for her, almost right after she donned the uniform and remarked on Hannyabal's naïvety, she was caught by Vice-Warden Magellan, who appeared behind her. Olive was then taken into custody by two guards while she struggled pointlessly."}, {"type": "paragraph", "text": "In the manga, Shiryu wanted to help Magellan and told the jailers to contact Magellan because he wanted to help him. But in the anime, Magellan decided to ask Shiryu to help them. In the manga it does not show Bon Kurei blocking Luffy from attacking Magellan, and does not show Bon Kurei trying to confuse Magellan with the Mane Mane no mi."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, an early concept of Magellan was shown, in which Oda imagined Magellan as more of a guardian of hell rather than the chief warden of a prison."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Early_Magellan.png/revision/latest/scale-to-width-down/150?cb=20110301120134", "caption": "Early concept of Magellan from One Piece Green."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name resembles the name of a famous Portuguese maritime explorer Ferdinand Magellan who is said to have died from a poison arrow.", "elements": []}, {"text": "In the anime, the prisoners on Level 6 like to call Magellan \"geri yaro\" (下痢野郎, geri yarō, literally translated as \"diarrhea rascal\" or, more colloquially, \"shitty bastard\"); the FUNimation translation for this term is Shit Man. In the actual FUNimation dub, the prisoners call Magellan, Diarrhea Man. Each is a reference to Magellan's penchant for eating poisoned food and thus suffering from diarrhea for ten hours every day.", "elements": []}, {"text": "Like Caesar Clown, Magellan's sinister face and goat horns makes him resemble a stereotypical image of a demon; particularly Baphomet, a pagan deity famously depicted as a winged humanoid goat.", "elements": []}, {"text": "In addition to the above, his appearance and diarrhea may be a reference to Belphegor, a prince of hell associated with the sin of sloth who is commonly depicted as a horned, bearded man sitting on a toilet.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Diarrhea – Wikipedia article about the condition that Magellan suffers from.", "elements": []}, {"text": "Devil – Wikipedia article about the Devil.", "elements": []}]}], "images": []}]}