{"sections": [{"title": "Hannyabal", "level": 1, "content": [{"type": "paragraph", "text": "Hannyabal is the warden of Impel Down. He was introduced in the Impel Down Arc as the Vice Warden and secondary antagonist, but during the two year timeskip, was promoted to Magellan's former position and is now in charge of Impel Down."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hannyabal is a large pot bellied man that resembles a cross between a devil and an Egyptian pharaoh. His brow ridge is shaped like horns, his chin is shaped like a pharaoh's false beard and he wears a nemes with yellow and green stripes, the striped head cloth worn by pharaohs, with his hair coming from inside the nemes. His face in particular is designed in such a way that it looks like a Hannya mask. He wears demon-like wings on his back and also carries a pitch fork around, another common symbol linked to the devil."}, {"type": "paragraph", "text": "20 years ago, when Shiki escaped the prison, Hannyabal was seen wearing the standard militaristic white uniform that normal guards wear. He still wore the nemes and the bat-like wings, but he also wore a cap over the former. Now, he goes bare-chested in reference to his great endurance."}, {"type": "paragraph", "text": "After his original nemes had been stolen by Mr. 2 Bon Kurei, his new one has a fox figurehead attachment on top that resembles the Egyptian jackal God of Death Anubis and has blue stripes instead of the green stripes. Overall, his appearance is an allegory to the underworld."}, {"type": "paragraph", "text": "After the timeskip, he now wears an outfit similar to Magellan, but without the horns that Magellan wears. He also appears to have gained a significant amount of weight."}, {"type": "paragraph", "text": "As child Hannyabal was rather chubby. He wore nothing but a leaf-skirt and a pair of black sandals. He's depicted as a fire-dancer."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He has a habit of saying he owns everything and then having to apologize afterwards for getting ahead of himself. He does this because he is an ambitious person. He also seems to be prone to \"Freudian Slips\", which often give insight to his previously mentioned, ambitious qualities and his somewhat dark brand of humor. Hannyabal usually tries to show off how tough he really is to the prisoners by going into the Freezing Hell of Level 5 without weapons and almost completely naked, a reason he is admired amongst the guards."}, {"type": "paragraph", "text": "He is emotionally more stern than most characters and can maintain a clear mind even in the presence of Boa Hancock, remaining unaffected by her charms. Despite this, he seems to be easily infatuated with beautiful women, as he let slip of his true ambitions towards Hancock. This might have been because \"she wasn't his kind of woman\" as later he was easily seduced by Nami (who was really Bentham in disguise) and by Olive in the anime."}, {"type": "paragraph", "text": "Hannyabal's desire to become Warden by eliminating Magellan causes him to willingly jeopardize the security of Impel Down, such as letting prisoners run away, if it means for a chance to pin the blame on his superior. In short, Hannyabal cares more about his own position than the security and welfare of the prison, however he seems only willing to let prisoners escape if they are relatively harmless (ex. Buggy and Mr. 3) and shows genuine concern when powerful prisoners escape, like Crocodile and Jinbe."}, {"type": "paragraph", "text": "Despite his seemingly lack of seriousness most of the time, due to his desire to get Magellan fired, Hannyabal may get serious when the situation gets to the extreme, especially if he risks getting fired too. When this sudden change occurs, it can surprise even people who know him."}, {"type": "paragraph", "text": "Even though his ambition gets the better of him most of the time, those selfish aspects of his disappear completely when he feels the safety of civilians are on the line, such as dangerous prisoners escaping. It turns out that he is a considerate person who became a gaoler to protect the lives of innocents by keeping criminals in prison. Furthermore, he was the only high ranking gaoler who was never shown torturing the inmates or to enjoy doing so."}, {"type": "paragraph", "text": "This other side of his personality is the reason he became a gaoler in the first place, and the level of willpower he displays in this mindset is reminiscent to Luffy himself. Even when completely overwhelmed and near the brink of death, he will force himself to stay conscious and keep dangerous prisoners from escaping even when he barely has any strength left. Almost paralleling Luffy in many of his fights, he will grab onto his opponent limbs while on the ground and nearly beaten, to just barely hold them back before getting up and continuing to fight."}, {"type": "paragraph", "text": "His ideology towards pirates capable of great destruction like Luffy, Jinbe, or Crocodile is very different from most marines who believe in Absolute Justice. To him, he doesn't damn pirates and revolutionaries as evil or enemies of the World Government. He damns them because most committed grand crimes, and regardless of what those crimes were, they have enough power to create great alarm to the normal citizens of this world. He loathes the glorification of piracy, as those reputations were all created by breaking the law and becoming criminals, including Ace and Luffy. And thus, if powerful criminals are able to escape, the citizens of the world would fall into panic knowing dangerous criminals remained unchecked in the world and can even escape from Impel Down. He is willing to lay down his life even in a losing battle for this belief."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Impel Down Staff", "level": 3, "content": [{"type": "paragraph", "text": "Hannyabal cares little for his superior Magellan, whom he simply wishes to see fail or be rid of so he can become the chief warden in his place. Even when not suffering from Freudian Slips, around his superior Hannyabal will also openly state his desire to see his superior fail or die. Sometimes he will even begin shouting or speaking out his words within Magellan's hearing range, causing Hannyabal to reword his sentence to sound better when he realizes he has stepped out of line too much. This often leads him to be conflicted with the warden Magellan, who shuts him up with his poisonous breath. However, every time he is poisoned by Magellan he seems to comically act as though he is dying yet make a full recovery mere moments later."}, {"type": "paragraph", "text": "Hannyabal's main grudge against his superior is over his apparent \"lack\" of leadership skills and he will often scold Magellan for things like neglecting the intruder call on Luffy because he was distracted by Hancock's charms. However, Magellan fully trusts him and states he is the only one beside himself who is able to run Impel Down."}, {"type": "paragraph", "text": "After being tricked by Mr. 2 Bon Kurei (disguised as Nami) and was tied up in the weapon storage room, Hannyabal seems to have developed a grudge against the okama, as he claimed to hate being tricked like this."}, {"type": "paragraph", "text": "He seems to have a good reputation amongst the personnel and his courage during serious situations is admired by the gaolers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Magellan_and_Hannyabal_Relationship.png/revision/latest/scale-to-width-down/210?cb=20130504044039", "caption": "A typical relationship between Magellan and Hannyabal."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the current warden of Impel Down, Hannyabal has full control over Impel Down."}, {"type": "paragraph", "text": "Unlike Magellan or the Four Jailer Beasts, Hannyabal seems to lack a feared reputation for the prisoners to acknowledge, as Buggy and Mr. 3 stated that they had not heard anything about him. However, this was misleading, as he is one of the most powerful enforcers in Impel Down, being more powerful than any of the four Jailer Beasts and second only to Magellan himself. A possible explanation is that he will not fight unless it's an extreme emergency, such as a prisoner from Level 5 or Level 6 trying to escape. If not, he will not move a finger and leave the job to the Jailer Beasts or Magellan. He easily defeated both Buggy and Mr. 3 without a single scratch on him, even after taking a direct hit from Buggy's Muggy Ball (which was enough to severely harm the Jailer Beast Minotaurus and annihilate the entire platoon of gaolers guarding the door to Level 3 ). On the other hand, the guards seem to know him to be a powerful fighter and enforcer. Magellan himself claimed that Hannyabal is the only person worthy to be his successor as Chief Warden of Impel Down, and this is later proven when after the two year time-skip Hannyabal was shown to have indeed succeeded Magellan as Chief Warden."}, {"type": "paragraph", "text": "Hannyabal also seems to have a resistance to extreme temperatures, as he is known to walk through the Freezing Hell with nothing more than his loincloth and nemes, as well as tolerating the extreme heat in Level 4 in the very same attire. He is also very resilient to physical strikes, and is capable of withstanding some of Luffy's Gear Second attacks and get back up on his feet."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Weapon-wise, Hannyabal was seen wielding a pitchfork, like many of his subordinates, but has not been seen using that in battle (except in the anime). Instead, his signature weapon is a polearm based on a double-bladed naginata (a Japanese halberd) called Kessui (血吸, Kessui literally \"Blood Sucker\"), which he is quite skilled in wielding. With a katana on each side, he is capable of performing a variety of attacks with it, and, most surprisingly, is also able to spin it wildly and create flames to deter any opponent. The fact that he's capable of using with such skill a weapon with two blades, which could potentially injure an inexperienced user, as well as the enemy, is a testament to his swordsmanship."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Kessui_Infobox.png/revision/latest/scale-to-width-down/210?cb=20100705081329", "caption": "Hannyabal wielding his double-bladed naginata, Kessui."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Shiki's Escape", "level": 4, "content": [{"type": "paragraph", "text": "20 years prior to the start of the current story Shiki made his escape from his holding cell by cutting off his legs. Hannyabal found Shiki sitting on the rafters of Level 6 asking him if he had seen Shiki's swords. A shocked Hannyabal then shouted for help from Magellan (then only the vice-warden), but not before shouting he wanted a promotion."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Hannyabal_at_Shiki%27s_Breakout.png/revision/latest/scale-to-width-down/210?cb=20130121003308", "caption": "Hannyabal, 22 years ago as an Impel Down guard, surprised by Shiki."}]}, {"title": "Impel Down Arc", "level": 3, "content": [{"type": "paragraph", "text": "Upon Boa Hancock's and Momonga's arrival at Impel Down, he comes to greet them and orders Domino to do a body search on Hancock. As Hancock petrifies her and the Surveillance Den Den Mushi, his subordinates report that they have no image from the room and he goes on and meets them as they exit the room. Then he takes Hancock and Momonga to a lift to go to the fourth floor to meet the prison warden Magellan. While in the warden's room he shows many obvious signs that he wants to be warden someday."}, {"type": "paragraph", "text": "He then continues down to Level 6, and introduces Ace to Hancock. He also quickly runs away when Magellan uses Hydra on a prisoner. He comments that if he meets the escapees (Bentham, Luffy, Buggy and Galdino), he will let them escape so Magellan would be fired and he would take his position. Magellan assigned him to keep the stairway who led to Level 3, and Buggy and Galdino conspired to beat him to escape, thinking he is the weakest point within the escape routes of Level 4."}, {"type": "paragraph", "text": "However, due to their miscalculations, he easily defeated both of them off screen. But when Magellan arrived at the scene later, the person assuming Hannyabal's role was in fact Bentham, who had distracted him by seducing him while transformed into Nami, then knocked him out and tied him up in a weapons storage room. After being tied up for a few hours, a couple of guards find him, and he tries to ask them to untie him through his gag."}, {"type": "paragraph", "text": "After he has been released, the guards tell him that Buggy, Galdino and Bentham, the latter having been disguised as Hannyabal, have descended down to Level 5. The only thing they found was Hannyabal's stolen nemes, which was covered in blood. Under the report of the guards, Hannyabal found that if the four intruders were not eaten by the wolves, but instead escaped, then not only Magellan, but also Hannyabal himself, would risk losing their officer positions, much to Hannyabal's shock."}, {"type": "paragraph", "text": "He is then later seen in the monitor room, surprised to see Luffy, Iva and Inazuma heading down to Level 6. He then tells a guard to inform the jailers of Level 6 to prepare for combat while Sadi-chan gets there with the Jailer Beasts. He also tells the guard to inform Magellan and all floors of this discovery and to activate all the traps in the passage that lead to Level 6. This sudden turn of seriousness makes the guard question whether Hannyabal is an impostor."}, {"type": "paragraph", "text": "As Magellan was busy with Ace's transfer, Hannyabal was in charge of the prison. During his leadership, he learns Luffy, Inazuma and Ivankov has freed both Jinbe and Crocodile for allies. Hannyabal orders all jailers to gather at Level 4, intending to face the escaped prisoners himself, fearing the incident could cost him his position, but is informed about another riot going on on Level 2 started by Buggy and Galdino as well as an army led by Iva, Inazuma, and Bentham consisting of prisoners that were thought lost forever and is unsure what he should do."}, {"type": "paragraph", "text": "Still undecided about how to deal with the current situation, Hannyabal learns that Blackbeard and his crew are invading Impel Down. Now with 2 situations on his hands he struggles to make a decision and casually asks the other jailers if they should lock themselves in the monitor room and have snacks, much to the shock of the jailers. He then gets a Den Den Mushi call from Magellan, having told him that the riot on Level 2 is over, and with Magellan giving him an order to hold out on Level 4 until he gets there. In an ironic sense of relief, Hannyabal cheers the warden on."}, {"type": "paragraph", "text": "Hannyabal finally faces Luffy and the rest of the rioting prisoners on the door that connects Level 3 and Level 4. He is backed by the Bazooka Unit and tells the freed prisoners that they do not have chance, bringing out his Naginata \"Kessui.\" Luffy simply orders him to get out of the way. Hannyabal refuses and attempts to fight him with his Hanya Carnival move Shounetsu Jigoku-Guruma. However, Luffy uses Gear Second, and beats him back with the Gomu Gomu no Jet Gatling."}, {"type": "paragraph", "text": "Even so, Hannyabal refuses to give in and attempts to stop Luffy even when beaten and bloody as the gaolers beg him to stop for his own sake. Hannyabal proceeds to give a speech about why \"scum\" like Luffy have no right to be free."}, {"type": "paragraph", "text": "He goes on to say that because innocent people are threatened and frightened by the very existence of pirates, Impel Down exists to keep evildoers locked up and protect the weak people outside. He claims that its destruction would result in more fear, and therefore he would not let Luffy pass and thereby escape. Luffy once again refuses, saying that Ace was precious to him. Hannyabal bitterly reflects that some people refuse to listen. Then the Bazooka Unit begins to vanish into Blackbeard's darkness as Blackbeard crushes Hannyabal under his feet and mocks his beliefs, stating that he could search the world and still there is no answer."}, {"type": "paragraph", "text": "After Blackbeard and his crew attempt to deal with Magellan, Magellan quickly douses them with poison and disposes of them. He then acknowledges the battered and bloody Hannyabal and thanks him for holding out for so long. Magellan leaves Impel Down to Hannyabal and tells him not to die, admitting that Hannyabal is his only worthy successor. However, Hannyabal was not conscious to hear that praise. Then, Magellan orders the guards to give Hannyabal the medical attention he needs for the wounds inflicted by Luffy and Teach."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Hannyabal_About_to_Fight_Luffy.png/revision/latest/scale-to-width-down/210?cb=20100411102428", "caption": "Hannyabal vs. Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/19/Blackbeard_Defeats_Hannyabal.png/revision/latest/scale-to-width-down/210?cb=20130209010003", "caption": "Blackbeard defeats Hannyabal."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Hannyabal_Is_Defeated.png/revision/latest/scale-to-width-down/210?cb=20150308230705", "caption": "Magellan approaches the fallen Hannyabal."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, it is shown that Hannyabal has finally achieved his dream of becoming the warden of Impel Down, though he appears to have gained some weight."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hannyabal and Impel Down Guards vs. Buggy and Galdino", "elements": []}, {"text": "Hannyabal and Impel Down Guards vs. Bentham", "elements": []}, {"text": "Hannyabal vs. Monkey D. Luffy (interrupted by Marshall D. Teach)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Hannyabal vs. Bentham (disguised as Nami)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In an anime flashback, it was stated that twenty years ago was about the time Hannyabal joined the prison, and the first prisoner he had to deal with was Olive, who seduced him to lower his guard, and then tied him up and stole his clothing, for escape, and would have succeeded if not for Magellan interfering. Magellan then gave him a speech on how every single guard is important for the security of the prison."}, {"type": "paragraph", "text": "In the anime, when he adorned his new fox-headed nemes he commented that this one was supposed to be for when he became warden."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "While some translations may use \"Hannibal\" as the English spelling for his name, this is wrong. The name Hannibal in Japanese would be written like this: ハンニバル (hannibaru), while Hannyabal's name appears in the manga as ハンニャバル (hannyabaru), a clear combination of both Hannibal and Hannya which is ハンニャ."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The fox on his fox-head nemes is drawn in a style that resembles the jackal head of Anubis, an Egyptian god associated with the dead.", "elements": []}, {"text": "His appearance might be based off the Amarna style in Ancient Egyptian art. It's also a reference, as is his name, to Japanese Hannya masks.", "elements": []}, {"text": "In the 5th fan poll, Hannyabal ranked 69th making him the most popular of the Impel Down staff.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hannya – Wikipedia article about Hannya masks in general for which Hannyabal's face resembles.", "elements": []}, {"text": "Hannya - Japanese Architecture and Art Net Users System article about Hannya masks in general for which Hannyabal's face resembles.", "elements": []}, {"text": "Masks of Japan - Article about Japanese masks which include Hannya masks for which Hannyabal's face resembles.", "elements": []}, {"text": "Pharaoh – Wikipedia article about pharaohs.", "elements": []}, {"text": "Devil – Wikipedia article about the Devil.", "elements": []}, {"text": "Naginata – Wikipedia article about Naginata, which is the weapon Hannyabal wields.", "elements": []}]}], "images": []}]}