{"sections": [{"title": "Domino", "level": 1, "content": [{"type": "paragraph", "text": "Domino is the Head Jailer of Impel Down serving under Warden Hannyabal."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Domino is one of the high-ranking officers of Impel Down, as well as the most professional-seeming. She is a slim woman with long, wavy blonde hair, with a tuft always covering her right eye, the left being obscured by a pair of sunglasses. She wears a modified version of the militaristic style uniform of many of the staff, consisting of a short pale brown double-breasted jacket worn like a dress over a white shirt with a black tie, all paired with brown boots and dark gloves far longer than the ones worn by the other members of the staff. On her head, she wears a standard Impel Down hat."}, {"type": "paragraph", "text": "Two years later, she does not wear the white shirt under the jacket anymore and now bares more skin despite her cleavage being disguised by her tie. Her hair is also shorter now, and she appears to wear a white coat over her uniform."}, {"type": "paragraph", "text": "As a little girl, she had short hair, but sported the same hairstyle covering one eye. She wore a light colored sleeveless top, and polka dotted shorts with light colored shoes. She is depicted as playing soccer."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Domino is very strict and serious, as she scolded Magellan for taking too much time in the washroom. Despite this, she, like many others, fell for Hancock's beauty, and did not remember that she did not conduct a full body search on Hancock."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the current Head Jailer, Domino has command over lower ranking employees of Impel Down."}, {"type": "paragraph", "text": "She was seen carrying a whip but it is as of yet unknown how proficient she is in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 3, "content": [{"type": "paragraph", "text": "Domino first appeared to conduct a body search on Boa Hancock, who petrified her with her Mero Mero no Mi powers, so Monkey D. Luffy (who was hiding by clinging to her back underneath her large robe) would not be detected. After that, Domino was turned back to normal (and was also a bit confused, being unable to remember what happened to her during the body search) and accompanied Boa Hancock to Chief Magellan's office in Level Four."}, {"type": "paragraph", "text": "About three hours before Portgas D. Ace's execution, Domino appeared outside of Magellan's washroom to inform him to prepare for Ace's transfer to Marineford. She scolded Magellan for taking so much time in the washroom, and that it would be tainting their record if they were late. She was last seen holding a Den Den Mushi for Magellan during the breakout's second wave."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "During the timeskip, Domino was promoted to Head Jailer of Impel Down after the former incumbent defected to join the Blackbeard Pirates."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Domino is derived from dominus in Latin, referring to a person that has control over others.", "elements": []}, {"text": "Domino was the only high-ranked Impel Down officer who didn't confront any of the escapees.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 526 and Episode 442, Domino is introduced by Hannyabal.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 67 Chapter 661, cover story: From the Decks of the World Vol. 42.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 114), Domino's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 55 Chapter 539 and Episode 440, Domino berates Magellan for spending too long in the washroom.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 526 and Episode 423, Domino is petrified by Hancock.", "elements": []}]}], "images": []}]}