{"sections": [{"title": "Shiki", "level": 1, "content": [{"type": "paragraph", "text": "Shiki the Golden Lion, also known as the \"Flying Pirate\", is the admiral of the Golden Lion Pirates, the first known prisoner ever to escape from Impel Down and a former member of the Rocks Pirates."}, {"type": "paragraph", "text": "He wreaked havoc on the seas during Roger's time and is the main antagonist of the tenth One Piece movie."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Shiki is a massive pirate dressed in traditional Japanese clothes consisting of an orange trimmed, red and a black robe tied together with a dark green sash, and a golden chain around his waist; he also wears a yellow striped tattered coat draped over his shoulders. He has golden mane-like hair, reaching down to the ground, and on the top of his head is part of a steering wheel that got lodged into his head after his battle with Roger. The doctor has noted that trying to remove it could result in death, as it is lodged too deep. Shiki himself thought he looked like a rooster without realizing that it was himself when looking into a mirror."}, {"type": "paragraph", "text": "As for his facial features, he sports a golden bushy tuft of hair for a beard at the bottom of his chin, and a black goatee with pointed edges surrounding his mouth. His eyebrows are dark and pointed as well, and he has some purple spots on the left side of his face right around his right eye that indicates his age. He is usually seen smoking a cigar."}, {"type": "paragraph", "text": "Twenty years ago, his hair covered the now bald top part of his head, and the coat on his shoulders had a different pattern, with big flower-like motifs on it."}, {"type": "paragraph", "text": "Instead of using more conventional prosthesis after cutting off his own legs to escape Impel Down, he uses his own swords as prosthetic legs, which he openly shows."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shiki comes off as very light-hearted and comical. He takes most things with a cheerful smile and even getting a steering wheel stuck in his head, losing half his Pirate fleet to Roger, or cutting off his feet did not bring him down much. The only thing Shiki has ever shown fear of are storms, possibly due to the fact that his fleet was once devastated by one when battling the Roger Pirates, but more likely due to the fact that not even he has full control of his flying masses when in the midst of one."}, {"type": "paragraph", "text": "He also seems to be a little bit absent-minded, as he often mistakes things for other things, such as a giant stormy cloud for a perm, or Scarlet for a relative of his. He apparently likes to dance, as when first introduced to Nami he was seen performing a dance with Indigo and Scarlet. The three of them often act as a comical trio."}, {"type": "paragraph", "text": "He also seems to have a knack for planning, often coming up with grandiose ones (which he once attempted to invite Roger to take part of) that can be incredibly long-term, and even Whitebeard seems to warily view him in this regard. He is also usually a calm person at most times and upon being notified by Doctor Indigo that the development of the SIQ formula on the fauna of all sixteen floating islands would require a period of twenty years to accomplish, Shiki was completely happy to wait that long, indicating a high degree of patience and devotion to maintaining his plans."}, {"type": "paragraph", "text": "Occasionally though, his anger and wrath would cause him to perform reckless maneuvers that contradicted his cunning mentality (such as his single-handed assault of Marineford which resulted in his imprisonment within Impel Down and the loss of his legs). Shiki was also shown to be a very charismatic and capable leader, managing to develop pirate armadas on at least two occasions in his career (the first was commented as being an exceptionally large fleet even in the New World; the Whitebeard Pirates division total is 1,600 pirates as a comparison, and the second looked to be nearly as large had Shiki not been stopped prematurely); he also treated his direct crew with compassion and respect, as if they were his own family, though he was not above killing lesser subordinates for the most superficial of reasons."}, {"type": "paragraph", "text": "According to Garp, he is not the type of person who could tolerate a peaceful era for long, but also added that Shiki would not instigate something big without extensive planning and preparation beforehand. This strongly implies that Shiki had the drive and mindset of a warmonger. He possesses an extreme amount of patience as shown by the fact he was not upset at all about having to wait for twenty years before he could complete his plan."}, {"type": "paragraph", "text": "He has shown that, when the time calls for it, he can be absolutely ruthless, such as when he slaughtered dozens of Marines at Marineford, shot one of his subordinates in annoyance, destroyed the only village on Merveille just to prove the strength of his mutated animals to his allies, and tried to destroy the entire East Blue, a sea which he refers as the weakest and which during the years he has started hating, because of the man who defeated him coming from there and having died there."}, {"type": "paragraph", "text": "Like other characters in One Piece, Shiki has a distinct laugh: \"Jihahahaha\" (ジハハハハ, \"Jihahahaha\")."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "By Shiki's own admission, he values his crewmates very much. This respect, however, does not seem to extend to the lower members of his fleet and will not hesitate to injure them if they do not live up to his expectations, as he was seen shooting one of them in a leg simply because he informed him of Roger's capture; he also shot one of his navigators for his incapability in forecasting weather conditions."}, {"type": "paragraph", "text": "Dr. Indigo has spent over twenty years at Shiki's service, and the two now seem to share some sort of friendship relationship, as Shiki does not mind being slapped by the Doctor whenever he mistakes something for another thing, and he stands the noises of Indigo's shoes, despite them irritating him. The two also dance together, with Scarlet as the third one. He (along with everyone else) become completely surprised when they realize he can talk, despite the fact he spoke to them before. Whenever Shiki says or does something stupid, Indigo slaps him. Indigo also has a habit of trying to explain something to Shiki through odd movements and gestures until Shiki tells him to just come out and say it (though at one point in the movie, Shiki understood what he was trying to say much to Indigo's surprise)."}, {"type": "paragraph", "text": "Shiki seems to be fond of Scarlet, since the gorilla is almost always seen at his side, and he even takes part in his and Indigo's \"dance shows\". He often mistakes Scarlet as a relative. Shiki admires both Nami's forecasting capabilities, having enlisted her as his crew's navigator, and her beauty, for which he refers to her as \"Baby.\" After she betrayed him, however, he showed no hesitation in leaving her to die."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/Scarlet%2C_Shiki%2C_and_Indigo.png/revision/latest/scale-to-width-down/210?cb=20141206182713", "caption": "Scarlet, Shiki, and Indigo doing a skit."}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Gol D. Roger", "level": 4, "content": [{"type": "paragraph", "text": "Shiki is one of the many Pirates whose utmost respect had been gained by Roger. In fact, during their youth, the two Pirates flew into several skirmishes against each other due to their separate ideals (Shiki wanted to control it all, while Roger simply wanted to remain free), but in their last battle, Shiki was shown to be willing to treat the past as letting bygones be bygones, if Roger would just agree to form an alliance with him, and was even ready to work together with the Pirate King for his grand dream of conquest, offering to have the known world as spoils. However, Roger may not have regarded him likewise, apparently having refused Shiki's hand of friendship many times in the past; the fact that Roger did not bother to at least talk with Shiki prior to his execution, as he had done with both Whitebeard and Garp, suggests that he did not think much of Shiki as a rival."}, {"type": "paragraph", "text": "When Roger was \"captured\" by Marines, Shiki angrily invaded Marineford, saying that he should have killed him himself, and when in Impel Down, he thought of his old rival, showing sadness because of all the new rookies wanting to invade the Grand Line, and veterans like Roger dying."}], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Shiki is also a firm opposer of both the World Government and the Marines: he tried to conquer the former with an army of mutated animals, as seen in Strong World, and in Chapter 0 deemed the Marines of being too weak to capture a man like Roger. He was however defeated by Sengoku and Garp, and this may have caused him to hate the two as well. The first time he resurfaced to the world after 20 years he once again attacked the Marine Headquarters, \"as a warning\"."}, {"type": "paragraph", "text": "Sengoku viewed Shiki as his main enemy twenty years ago in the same sense that Garp viewed Gol. D. Roger. Shiki was also the \"first\" prisoner to escape from the great prison Impel Down, by cutting off his own shackled legs and later replaced them using his own personal swords as prosthetic limbs. Shiki's incident hurt the prison's pride as well as Magellan's, who was a vice warden at that time."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Twenty years after Indigo began creating his monstrous army, one of them, Boss, escaped, and Shiki attempted to recapture him by making an offer with the captain of the Amigo Pirates; if Largo could recapture Boss, he would be invited to become the commander of the Golden Lion Pirates' 51st division. Ultimately, Largo was defeated by Monkey D. Luffy and the entire Amigo Pirates were arrested at Little East Blue. Shiki, not knowing that Luffy was the one who defeated Largo, merely stated that this one setback would not upset his ultimate plan."}, {"type": "paragraph", "text": "Continuing with his plans, Shiki continued to recruit powerful allies to accompany him in world domination, as well as to destroy East Blue, due to Shiki bearing a grudge to the sea for being Roger's death place. When he came across Nami, he noted on her exceptional navigational skills and beauty, and forced her to become a member of his crew by holding her comrades as hostage. Eventually, the rest of the Straw Hat Pirates attacked Shiki to retrieve Nami and to stop the Golden Lion Pirates from attacking East Blue. "}, {"type": "paragraph", "text": "Tony Tony Chopper and Nico Robin went to destroy Indigo's laboratory where the SIQ drug was, to prevent anymore mutant animals from being created, while the rest of the crew attacked Shiki's allies and palace. Nami tricked Shiki into guiding Merveille, now converted into a floating island fortress with Shiki's levitation powers, into a lightning storm, and with that, Monkey D. Luffy crashed a lightning-enhanced giant leg down onto Shiki and the floating island, defeating the Flying Pirate and sending the mutants plummeting into the sea. "}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "Before Roger’s era, they used to be part of the Rocks Pirates. After the incident at God Valley, they went their separate ways to form their own respective crew."}, {"type": "paragraph", "text": "Despite not apparently being an ally of him, Shiki did not have a bad relationship with Whitebeard. He thought of him as a strong man, able to take over Roger in the dominion of the sea, as he said when they were drinking together on the Moby Dick and speaking about old times. Whitebeard was apparently knowledgeable about Shiki's penchant for planning."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/Shiki_and_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20130525043754", "caption": "Shiki and Whitebeard discuss Shiki's plans after his escape."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Shiki commands a large pirate crew, of at least 51 divisions,  somewhat similar to the Krieg Pirates and the Whitebeard Pirates. It is unknown how strong his crew is, but what is known is that the largest pirate fleet was under his control at that time."}, {"type": "paragraph", "text": "Shiki was also shown to be a very charismatic and capable leader, managing to develop pirate armadas on at least two occasions in his career (the first was commented as being an exceptionally large fleet even in the New World; the Whitebeard Pirates division total is 1,600 pirates as a comparison, and the second looked to be nearly as large had Shiki not been stopped prematurely)."}, {"type": "paragraph", "text": "During Roger's era, he was one of the most powerful figures of the time, being on par with Sengoku, Garp, Whitebeard, and Roger. Before that era, Shiki was a member of the Rocks Pirates, a powerful crew whose members included three future Yonko."}, {"type": "paragraph", "text": "Shiki was also able to remain hidden from the World Government for 20 years while putting his plan into action."}, {"type": "paragraph", "text": "Shiki had a communication network set across his chain of floating islands to monitor general surface activity, and had established a base of operations within Merveille to accommodate his vast armada. Shiki also had access to the SIQ formula developed by his crewmate Doctor Indigo, with an entire laboratory located on Merveille dedicated to its further research."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Alongside Roger and Whitebeard, Shiki is one of the most powerful pirates of his generation. He has tremendous physical strength supplemented with his supreme sword skills, allowing him to slay an army of Marines at Marineford, and it took the combined efforts of both Garp and Sengoku to subdue him with the conclusion of their fight leaving half of Marineford destroyed. After capture, he was imprisoned in Level 6 of Impel Down. He has massive endurance as he could survive having parts of a steering wheel embedded deep into his head, a feat that impressed Indigo. He also has immense tolerance to pain. After he amputated his own legs to break free of Sea Stone Shackles, Shiki was completely unfazed by the pain, even casually smoking a cigar as he joked around with Hannyabal. Without any medical treatment with profuse and heavy bleeding, he successfully broke out of the impenetrable security defenses of Impel Down single-handedly. Later in a crude form of emergency treatment, Shiki forcefully grafted his swords into the inner stumps of his amputated legs. Despite shedding even more blood, Shiki simply shrugged it off."}, {"type": "paragraph", "text": "Even in old age, Shiki remained extremely powerful. He could block Sanji's kicks with one hand and negated Zoro's powerful slashes with his legs and sent him crashing to the ground with one crushing blow. He could fight on par with Luffy in his Gear Second mode. He also withstood Chopper's Kokutei Roseo Metel with almost no damage at all."}], "images": []}, {"title": "Swordsmanship", "level": 4, "content": [{"type": "paragraph", "text": "Shiki possesses great skills in swordsmanship as he dual-wielded Oto and Kogarashi to single-handedly massacre an entire army of Marines before getting subdued by Garp and Sengoku."}, {"type": "paragraph", "text": "After the two swords became his prosthetic legs, not only he has little difficulty in standing or walking while using them, he is also capable of attacking from a distance with them by sending slashes from his sword legs in a Rankyaku like fashion. These air-blades have a light-yellow/gold color-scheme, matching his epithet."}, {"type": "paragraph", "text": "He also combines his sword skills with his Fuwa Fuwa no Mi, such as slashing open a body of water and then levitating it to drown his opponents. He fended off all the slashes from Zoro's Nanajuni Pound Ho with great speed and reflexes, and later another attack from Zoro's was countered in mid-air and he knocked Zoro back down to the ground with great force. He was also able to fight on par against Roger, and later, it took both Garp and Sengoku in their prime to capture him alive."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b6/Shiki%27s_Combine_Use_of_His_Devil_Fruit_Abilities_and_Swordsmanship.png/revision/latest/scale-to-width-down/210?cb=20130325124731", "caption": "Shiki using his swordsmanship skills in conjunction with his Devil Fruit powers."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Shiki ate the Fuwa Fuwa no Mi, a Paramecia type Devil Fruit which allows him to make surrounding non-living matter levitate once he has come in contact with it. Shiki states that once he makes something float it will stay that way until he himself undoes it or he loses consciousness. He has been shown to make several Marine vessels and even vast island areas float."}, {"type": "paragraph", "text": "He seems to have mastered the use of this fruit, as he has shown a variety of skills which manipulates the surrounding non-living environment in complicated ways, even manipulating it from its simplest components, such as earth's fragments and snowflakes being used to build up gigantic, elaborate structures that are then used to attack for a variety of purposes."}, {"type": "paragraph", "text": "When attacking, Shiki uses the surrounding environment against his enemies, shaping earth or snow into giant lion heads and launching them towards his foes, or even making water float to drown his opponents in it. As stated, his powers are unable to be used on any living matter other than himself, meaning he cannot touch another person, animal, or plant and make them levitate."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8e/Fuwa_Fuwa_no_Mi_in_Use.gif/revision/latest?cb=20120723104158", "caption": "Shiki demonstrates his ability."}]}, {"title": "Island Ship", "level": 3, "content": [{"type": "paragraph", "text": "In the beginning segments of \"Strong World\", Shiki is revealed to have converted a small island into his personal flagship with the \"Fuwa Fuwa no Mi\"'s powers. Because of this, apart from serving as the crew's captain, Shiki also acts as their helmsman and as such, any change in course of trajectory that must occur first has to be relayed by the crew to Shiki to conduct the change of direction."}], "images": []}, {"title": "Weapons", "level": 3, "content": [], "images": []}, {"title": "Swords", "level": 4, "content": [{"type": "paragraph", "text": "Shiki possesses two double-edged swords by the names of Oto and Kogarashi, which according to him were famous. In the past he used them like regular swords but after escaping Impel Down replaced his missing legs with them. Despite the cumbersome appearance, Shiki has no trouble with his balance or walking capacity."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/83/Oto_and_Kogarashi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20160207161652", "caption": "Shiki's sword-legs."}]}, {"title": "Flintlock", "level": 4, "content": [{"type": "paragraph", "text": "He was also seen using a flintlock pistol in various occasions, and seems to be quite accurate with it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early History", "level": 4, "content": [{"type": "paragraph", "text": "Very little is known of Shiki's past, aside from the fact that he was a member of the legendary Rocks Pirates, along with future Yonko Whitebeard, Kaido, and Big Mom. 33 years ago, after the Rocks Pirates disbanded, Shiki formed his own crew, the Golden Lion Pirates."}], "images": []}, {"title": "The Edd War", "level": 4, "content": [{"type": "paragraph", "text": "Twenty seven years ago, two years before Gol D. Roger and his crew reached Laugh Tale, Shiki had learned that Roger had located an ancient weapon. Seeing the opportunity, he asked Roger if they could join forces. With his large pirate fleet and Roger's knowledge of an ancient weapon, Shiki believed that together they could take over the whole world and asked Roger to become his right hand. Roger however refused Shiki's offer saying that there was no point in being a pirate if he could not do as he wished."}, {"type": "paragraph", "text": "A great sea battle soon ensued between their crews at Edd War. Due to a storm that happened during their fight, Shiki unfortunately lost and half of his fleet sunk. Despite this and getting a piece of a steering wheel lodged into his head that almost killed him, Shiki came to have great respect for Roger."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Edd_War_Infobox.png/revision/latest/scale-to-width-down/210?cb=20130323210621", "caption": "Golden Lion Pirates vs. Roger Pirates."}]}, {"title": "Imprisonment and Escape", "level": 4, "content": [{"type": "paragraph", "text": "After hearing that Roger had been captured, Shiki shot the man who had informed him and went to Marineford on his own where he beat up several Marine soldiers. He yelled out how he could not believe how such \"wimps\" could have captured Roger and told them to bring him out if they had him so that he could kill him with his own hands. Shiki was suddenly approached by Sengoku who went on to explain that he would never have another fight with Roger as he could win and then be able to escape. Sengoku goes on to explain that Roger was scheduled to be executed in Loguetown, \"The Town of Beginnings\", within a week and that the execution was meant to break the heart of every pirate. As Shiki lamented on the fact that the \"Legend of the Pirate King, Roger\" would end in the weakest sea and how it would be the greatest insult to him, Monkey D. Garp appears and tells him that East Blue was a symbol of peace while Sengoku explains that they will not let him interfere in the execution. Both Garp and Sengoku prepare to fight and an unseen battle began between the three that destroyed half of Marineford, but in the end Shiki lost and was imprisoned in Impel Down."}, {"type": "paragraph", "text": "Shiki laid broken in his cell and heard about how everyone was setting out to find Roger's treasure. He thought to himself that he would prove to the world how pirates were the rulers of the world. Twenty years ago, Shiki was considered the \"first\" prisoner to escape from the great prison Impel Down, by cutting off his own shackled legs and later replaced them using his own personal swords as prosthetic limbs. Because of this event, Sengoku stated it was a serious mistake on their part to let him escape."}, {"type": "paragraph", "text": "He later sought out Whitebeard and offered him to be a part of his plan although he was cut short as Whitebeard threatened to throw him overboard if he did not shut up. Shiki then revealed to Whitebeard that he would disappear for a while and that he would show the real fear of pirates to the rookie pirates. Shiki was then seen at a mountain on an unexplored Grand Line island. He asked Dr. Indigo how the experiment was coming and was told by Dr. Indigo that he made a discovery that there was a balance between the plants and animals on the island. He also explained that many plants and animals could not be found elsewhere to which Shiki interrupted him. Shiki ordered him to get straight to the point, and asked Dr. Indigo how long would his plan take, and was told that it would take twenty years at least. Accepting this, Shiki said that he would then carry out his plan in 20 years, and then he would show \"them\" hell on Earth by releasing tons of mutated animals in the world similar to Boss, declaring war with the world."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/Shiki_and_Sengoku_and_Garp.png/revision/latest/scale-to-width-down/210?cb=20130525044135", "caption": "Shiki about to fight Admiral Sengoku and Vice-Admiral Garp."}]}, {"title": "Little East Blue Arc", "level": 3, "content": [{"type": "paragraph", "text": "After 20 years had passed, Shiki was set to put his plan in motion. However, one of his animals, a large horned beetle, escaped from his base of operations. He contacted the Amigo Pirates and their leaders, Largo and Corto, and offered to let them join his conference provided they retrieve the beetle for him. However, they failed thanks to the Straw Hats (though Shiki was unaware of this) and Shiki ultimately dismissed the escaped beetle, citing one escapee would not stop his plans."}], "images": []}, {"title": "One Piece Film: Strong World", "level": 3, "content": [{"type": "paragraph", "text": "During the years spent in Merveille, Indigo managed to develop from a local plant, the IQ, a serum called SIQ, that if injected into animals, it enhances their evolutionary process, granting them the ability to adapt to their natural environment better. Using this incredible drug, Shiki started creating his own army of mutated animals in order to defeat the World Government. After gathering a large amount of these animals as well as old and new allies, Shiki sent some of them to attack East Blue, causing incredible damage. He then resurfaced to the world at Marineford, flying over the island with his ship and destroying several Marine battleships by levitating them and then crushing them to the ground, as a warning for his old enemies."}, {"type": "paragraph", "text": "After that, he came across the Straw Hat Pirates by chance. Nami felt the weather changing and warned everyone of a coming storm. Luffy called out to Shiki's ship, attempting to warn them, gaining Shiki's attention. Shiki sent down a tone dial to record the warning. His own navigators initially disagreed that a storm was approaching, but it did appeared and with Nami's direction, both ships successfully escaped it. Afterwards, Shiki shot his navigator and came down to the Sunny to meet Nami. There, he revealed that he has a Devil Fruit power that lets him make any inanimate object he touches ignore gravity and float. After learning it was Nami that delivered the warning and that they were heading to East Blue, Shiki offered to take them there and used his power on Sunny. However, it was all a deception: the Flying Pirate brought the Straw Hats up in the sky to his base, Merveille. There, he kidnapped Nami, wanting her as his navigator, and sent the others flying to the nearby islands levitated by his powers, as he prayed for his mutated animals."}, {"type": "paragraph", "text": "Shiki asked Nami to become his navigator but she refused. Dr. Indigo appeared with an 'evolved' bird called Billy that can generate electricity to show it to Shiki, but after being shocked by it, Shiki tossed it aside. It was explained that a plant called IQ can cause animals to evolve very rapidly, making them very strong. Dr. Indigo revealed that he enhanced the drug, dubbing it SIQ, which Shiki had used on the island's animals, causing them to mutated to large proportions as well as increasing their intellect and aggression. Nami protected Billy, and the bird was left with her as Shiki and his men left."}, {"type": "paragraph", "text": "After Nami escaped with Billy, Shiki chased her to the only village on the island, where she had taken refuge with some other members of the Straw Hats. The Golden Lion effortlessly defeated Luffy, Zoro, Usopp, Sanji, and Chopper, trapping them in a giant pillar of earth with his powers, and eventually convinced Nami to join his crew, with the promise of sparing her former crewmates and East Blue. Usopp, the only remaining crew member conscious tried to stop her, but Shiki knocked him out."}, {"type": "paragraph", "text": "He gave Nami a Tone Dial in order to leave a last farewell to her friends before bringing her up again to his base. He had his allies witness the destruction of the village at the hands of his mutated animals as proof of their strength. After that, he was informed of something by Indigo which was revealed to be Nami's attempt to destroy the trees protecting his palace from the wild animals, in order for the place to be destroyed by his own bestial minions. Having seemingly foiled her plan, he had his subordinates immobilize her with long spears and left her to die from the Daft disease she contracted during her attempt to blow away the trees."}, {"type": "paragraph", "text": "He summoned the pirates under his command to drink with him, explaining his plan. While preparing a toast to the commencement of the operation, the Straw Hats burst into the palace using the Sunny and then marched into the main meeting room brandishing various firearms. After a short confrontation where Shiki called them simply a suicide squad and revealed hundreds of men around them, Luffy said that Nami was simply the vanguard and that they were the main force. The Straw Hats unloaded their firearms in the room, defeating most of those gathered before splitting up to defeat the rest."}, {"type": "paragraph", "text": "Luffy punched Shiki in the face and Shiki fled the room with Luffy chasing after him. After Nami and Billy destroyed the Daft Green, animals from outside stormed the palace, adding to the chaos within. Shiki was enraged and attempted to kill Nami, Usopp, and Chopper. However, Luffy appeared in Gear Second and started fighting him with the help of Billy. Luffy, still battling Shiki, was overwhelmed when Shiki surrounded him with water. Shiki then received a Den Den Mushi call warning of the storm and asking him to redirect the island which he did. Unknown to him, the call was in fact coerced by Usopp and Chopper and that Nami had lead them directly into the storm. The various remaining pirates realized this and retreated, while the Straw Hats rigged the palace with explosives. Shiki returned to the palace and confronted them, but Luffy also reappeared, having recovered."}, {"type": "paragraph", "text": "Once more using Gear Third, Luffy placed his giant foot into the clouds, gaining an electric charge and used this to enhance his giant axe. Shiki at first thought that the lighting would kill Luffy, not realizing Luffy's rubber body would protect him. By the time Shiki realized his mistake, Luffy hit him with the attack, both smashing and electrifying him to the ground, defeating him and destroying an entire island in the process."}, {"type": "paragraph", "text": "As he was beaten, Shiki questioned whether he was meant to be defeated once again by a man from East Blue before yelling Roger's name. With his defeat, the control his power held over the flying islands disappeared, forcing them to crash into the sea. Shiki was last seen falling unconscious into the sea as well, followed shortly by his subordinates Indigo and Scarlet. Apparently, the Marines spotted him and were hurrying to capture him, but it is unknown if they managed to."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b4/Straw_Hat_Pirates_Meet_Shiki.png/revision/latest/scale-to-width-down/210?cb=20141206183227", "caption": "Shiki and the Straw Hats first meet."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/99/Straw_Hats_vs._Shiki.png/revision/latest/scale-to-width-down/210?cb=20130116014224", "caption": "Shiki confronting the Straw Hats."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Luffy_vs._Shiki.png/revision/latest/scale-to-width-down/210?cb=20121118103125", "caption": "Luffy versus Shiki."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6a/Gomu_Gomu_no_Gigant_Thor_Axe.png/revision/latest/scale-to-width-down/210?cb=20130302113054", "caption": "Shiki is defeated by Luffy."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Shiki vs. Gol D. Roger (unseen, several times)", "elements": []}, {"text": "Golden Lion Pirates vs. Roger Pirates (Battle of the Edd War)", "elements": []}, {"text": "Shiki vs. Sengoku and Monkey D. Garp", "elements": []}]}], "images": []}, {"title": "Movie Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Shiki vs. Monkey D. Luffy, Roronoa Zoro, Usopp, Sanji, and Tony Tony Chopper", "elements": []}, {"text": "Golden Lion Pirates vs. Straw Hat Pirates", "elements": []}, {"text": "Shiki vs. Monkey D. Luffy and Billy", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In the early design sketches of Shiki, Oda originally drew Shiki as bald and with more lion-like facial features. In a later draft of Shiki, Oda drew him with the steering wheel but embedded in his head in a different position."}, {"type": "paragraph", "text": "In an interview about Strong World, Oda also revealed that he originally intended this concept of Shiki to be used for Bartholomew Kuma. However he turned down the idea but later decided to use it for Shiki."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3c/Early_Shiki.PNG/revision/latest/scale-to-width-down/210?cb=20091218104954", "caption": "Early Shiki sketches."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "A notable difference between the anime and manga versions of episode 0 is that during the scene Shiki escapes Impel Down, his severed feet are barefooted in the manga, while in the anime, they keep the traditional Impel Down's shoes."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A fan noticed Shiki being mentioned in the manga and asked Oda if the character was one and the same with the character in the movie. Oda confirmed that the two characters were one and the same, and explained more about him. Originally, Oda wanted to have Shiki be mentioned during the meeting between Shanks and Whitebeard. He however held back because he thought it might be too much info for readers and confuse them. At that time, he did not know that the story about the pirate who caused havoc during Roger's time would be made into a movie.", "elements": []}, {"text": "His overall design resembles a typical shogun.", "elements": []}, {"text": "In an early trailer for the movie Strong World, Shiki was seen wearing different attire than what he wore in the actual movie. Shiki was seen wearing a white suit with red marks on the sleeves. He also seemed much skinnier and carried a red sword.", "elements": []}, {"text": "Like his named crewmates, Shiki may be themed on a color, which in his case is gold.", "elements": []}, {"text": "The lion is traditionally referred to as the 'King of Beasts', fitting Shiki's control over numerous animals.", "elements": []}, {"text": "Shiki commanding a bestial crew is similar to Kaido of the Yonko. Coincidentally, they were once crewmates on the same ship.", "elements": []}, {"text": "Shiki shares his birthday, March 20th, with Sabo.", "elements": []}]}], "images": []}]}