{"sections": [{"title": "Sadi", "level": 1, "content": [{"type": "paragraph", "text": "Sadi is a chief guard of Impel Down. She always wants to be addressed as Little Sadi (サディちゃん, Sadi-chan)."}, {"type": "paragraph", "text": "Due to her actions, she is a major antagonist in the Impel Down Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sadi is a relatively slim and tall woman with long unkempt orange hair and bangs that covers her eyes. She resembles a dominatrix in design."}, {"type": "paragraph", "text": "She dresses in a very skimpy red (hot pink in the anime) devil-themed outfit. Her outfit covers only the top half of her exposed breasts with fringe, which is also featured around her waist. She has long sleeves that slope into stylized rips. She has a yellow ring on the center of her stomach connecting one strap from above and two from below."}, {"type": "paragraph", "text": "Around her neck, she wears a scarf-like cape that is white on the outside and pale pink on the inside. She wears candle-shaped earrings and high-heeled shoes that come to a curved tip decorated with spikes. She carries around a pitchfork and wears a headpiece that resembles horns."}, {"type": "paragraph", "text": "As a child, she wore a black headband and dress. She also had black shoes, and hair that covered her eyes. She is depicted as standing next to a small make-shift grave, mourning over a hamster."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sadi is a sadistic woman who enjoys bringing pain and torture to others, including Marine allies, and can not seem to get enough of their screams, getting sexually excited hearing them. However, her over the top reactions and flamboyant behaviour cause her to be more of a comical character rather than a sexual one. She also seems to have extreme pride in the virtually perfect defenses of Impel Down, and refused the assistance offered by the Marines."}, {"type": "paragraph", "text": "She also tends to put \"mmmmm--!?\" in the middle of her sentences, and insists on being addressed as Little Sadi (, Sadi-chan), much as a dominatrix would insist on being addressed as \"Mistress\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Sadi is a chief guard of Impel Down with some authority over lower ranking subordinates. Being in command over the Four Jailer Beasts, she is considered \"stronger than four of them combined\", much that they cower in fear whenever the sadist gets angry. During her fight with Ivankov, she was shown to have amazing evasive abilities and was able to keep up with the okama's speed."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "The pitchfork she carries around conceals a custom-designed whip which she can use adeptly. With it, she took out a section of the thick stone bridge over the Pool of Blood during Luffy's and Iva's mass breakout."}], "images": []}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Kofun no Geki: Akamamuchi (興奮の檄 赤魔鞭, Kōfun no Geki: Akamamuchi, literally translated as \"Arousal Manifesto: Red Demon Whip\"): Sadi whips at her opponents with her pitchfork-concealed whip. This attack is strong enough to smash the stone bridge in Impel Down's Level Four. Its name is a pun on Akamamushi, meaning Red Viper. In the Viz Manga and FUNimation subs and dubs, this is called Manifesto of Excitement - Red Viper Whip.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "During her childhood, she appeared to have a pet that she was very fond of but which died for unknown reasons. The death of her pet seemed to have affected her quite emotionally at the time. She then buried it."}], "images": []}, {"title": "Impel Down Arc", "level": 3, "content": [{"type": "paragraph", "text": "Sadi was first seen standing outside the gates of Impel Down, refusing the assistance of the Marines in capturing Monkey D. Luffy, and ordered them to fortify Impel Down's outer defense instead. When Impel Down's forces were gathered in Level 4, she was shocked after hearing the Minotaurus' defeat, and was later assigned to guard the entrance to Level 5, where Magellan deduced Luffy will head, with the assistance of three remaining Jailer Beasts. She was then seen serving sake to them while waiting."}, {"type": "paragraph", "text": "After Luffy's capture, she went to Level 3 and ordered the Jailer Beasts, as well as her other subordinates, to hunt for Bon Kurei, who slipped to Level 5 with them unaware. Sadi became very angry over the Jailer Beasts' failure to locate him, violently whipping them as a punishment."}, {"type": "paragraph", "text": "After Luffy, Emporio Ivankov, Inazuma, Jinbe and Crocodile escaped from Level 6, she was ordered by Hannyabal to go down to level 4 to confront them herself. She is seen with the other guards showing shock after Luffy, Jinbe and Crocodile effortlessly defeated three of the Jailer Beasts. Angered over this, she goes on the attack herself, using her whip to knock out a huge amount of prisoners, taking out a chunk of the bridge over the Pool of Blood in the process. Luffy nearly attacks her, but Iva throws him over the Chief Guard and battles Sadi herself."}, {"type": "paragraph", "text": "In their battle, Sadi further demonstrates her abilities, capable of dodging most of Ivankov's attacks with extreme agility while destroying the environment around her, whipping with formidable strength. Despite her efforts, Ivankov managed to steal her whip and she was revealed to have lost the fight and, among other injuries, has had her back hurt. Having been tied up with her own whip hanging from the ceiling, Magellan ordered his subordinates to untie her."}, {"type": "paragraph", "text": "Later, after her recovery, she wakes up the Jailer Beasts by lashing them and orders them to go up to Level 1 to stop the riot on that floor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Iva_vs_Sadi-chan.png/revision/latest/scale-to-width-down/240?cb=20130224090319", "caption": "Sadi battles the female Ivankov."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Sadichan_defeated.png/revision/latest/scale-to-width-down/250?cb=20100418100758", "caption": "Sadi is defeated by Ivankov."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Sadi has recently fallen in love with Magellan who was demoted to vice warden."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sadi vs. Impel Down Prisoners", "elements": []}, {"text": "Sadi vs. Emporio Ivankov", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, an early concept of Sadi was revealed. Instead of her current outfit, she had a so called \"witch-like theme\" along with a cape, and a strange mask that covered half of her face."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Early_Magellan.png/revision/latest/scale-to-width-down/100?cb=20110301120134", "caption": "An early concept of Sadi (bottom left corner)"}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Like Boa Hancock, Sadi has also received edits to her clothing so that the bottom of her chest is no longer visible in Viz's Shonen Jump. Her top instead fully covers her chest and the frills are removed. This edit was discontinued in later serialized chapters."}, {"type": "paragraph", "text": "In the FUNimation English dub of the anime, Sadi demands that others refer to her as \"Mistress Sadie\" rather than \"Little Sadi\"."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name may come from the word sadism. As such, her entire character motif is based on sadomasochism.", "elements": []}, {"text": "She shares her birthday (March 5) with her subordinate, Minokoala.", "elements": []}, {"text": "Sadi's “favorite food” is the screams of agony from her prisoners.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sadism – Wikipedia article about Sadism.", "elements": []}]}], "images": []}]}