{"sections": [{"title": "Dracule Mihawk", "level": 1, "content": [{"type": "paragraph", "text": "The subject of this article is sometimes called \"Juraquille Mihawk\" or \"Juracule Mihawk\"."}, {"type": "paragraph", "text": "Dracule \"Hawk Eyes\" Mihawk is a world-famous pirate who currently holds the title of \"Strongest Swordsman in the World\". He was one of the Shichibukai — the first revealed and formally introduced — until the organization's dissolution.​​​​​​​​​​​​​​"}, {"type": "paragraph", "text": "His place of residence is Kuraigana Island on which he served during the two-year timeskip as Roronoa Zoro's master in his swordsmanship training."}, {"type": "paragraph", "text": "Mihawk can be considered a supporting antagonist of the Baratie Arc and one of the major antagonists in the Marineford Arc, where he took part in the Battle of Marineford on the side of the Marines, along with most of the other Shichibukai."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mihawk is a tall lean man with black hair, a short beard, mustache and sideburns that point upwards. His nickname comes from his strangely colored red eyes (yellow in the anime), which resemble a hawk's eyes."}, {"type": "paragraph", "text": "He wears black and red ornate clothing with a crucifix pendant that hides a little dagger, which gives him the appearance of a Spanish swordsman. His attire consists of a wide-brimmed black hat decorated with a large plume, and a long, open black coat with no shirt underneath, with red, flower-patterned sleeves and collar. He wears white (light purple in the anime) pants held up by a decorated belt and tucked inside overly large boots in comparison to his leg size."}, {"type": "paragraph", "text": "He wears a kogatana around his neck, appearing as a golden cross-shaped necklace, and carries his sword Yoru on his back when he is not using it."}, {"type": "paragraph", "text": "At his home in Kuraigana Island's castle, he sports different pants and an open white shirt with a ruffled neck. When he met up with Zoro outside, he had a plain dark cloak draped over his shoulders."}, {"type": "paragraph", "text": "After the timeskip, he shows some more wrinkles near the eyes. While reading about the Straw Hats' actions on Dressrosa and resulting new bounties, he was seen in his casual outfit along with a dark scarf draped over his shoulders and a wide brimmed straw hat."}, {"type": "paragraph", "text": "Twenty four years ago, during Gol D. Roger's execution, Mihawk did not have his beard, nor did he wear his hat, and his hair was scruffier and shorter. He already had his crucifix pendant, and sported what looked like a flower-patterned jacket. Although it cannot be directly seen, he did not seem to be in possession of Yoru at that time."}, {"type": "paragraph", "text": "In SBS Volume 63, Oda drew the Shichibukai as children. Mihawk is shown with many scratches and bruises from training. He used a bokken as his weapon. He dressed in a dark-colored open jacket, short pants, shoes and a light-colored belt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mihawk is mostly very serious. He rarely smiles, and he has only been seen laughing twice so far. He took the revelation about Luffy being Dragon's son in stride, despite the surprise of those around him. He never unnecessarily reveals emotions on the battlefield, even when something unexpected happens (such as Jozu intercepting his flying slash aimed at Whitebeard, or Luffy surviving his onslaught)."}, {"type": "paragraph", "text": "He displays a sense of honor as he recognizes and respects the swordsman's code and he even permitted Roronoa Zoro the luxury of training at his hand for his dedication and selflessness. He is also unafraid to reference his title of \"Strongest Swordsman in the World\" in relation to himself, indicating a high level of confidence in his own abilities. He takes pride in his swordsmanship, believing that a nick on his sword is a blemish to his pride."}, {"type": "paragraph", "text": "Though he is confident in his strength, Mihawk remains grounded. While he has become jaded regarding the abilities of other swordsmen, due to facing numerous weaker opponents, he is able to recognize talent. In fact, he has a desire to see Zoro surpass him after having witnessed Zoro's incredible will and determination after their battle. When he speaks to Zoro, he states he will wait for Zoro, no matter how long it takes and notes that he will continue to be the world's strongest swordsman, showing great confidence in his own skills and abilities. Despite having grown bored with being challenged by inferior foes, Mihawk showed excitement at being chased as a pirate once more due to the dissolution of the Shichibukai system."}, {"type": "paragraph", "text": "Mihawk is selective and whimsical when it comes to fulfilling his duties as a Shichibukai, as evidenced by his history of poor attendance at Shichibukai summons, as well as his decision to hunt and harass some pirates over others. Zeff speculated that the reason Mihawk attacked Don Krieg and his men might have simply been because they disturbed his nap. Mihawk admitted that the only reason he followed them all the way back to East Blue from the Grand Line was to kill time."}, {"type": "paragraph", "text": "Although Mihawk is normally passive when dealing with others, he can come off as rather blunt and cold at times. When Perona was crying over Moria's presumed death, Mihawk coldly told her to leave, saying her crying was annoying him. This was also shown again when he did not tell her that he found out about Moria being alive while stating he had no reason to do so."}, {"type": "paragraph", "text": "Although Mihawk spends most of his time alone, he is fine with making company with people, such as Shanks and Perona. He also appears to have a sense of hospitality, having (somewhat) tolerated Perona and Zoro's presence upon his return to Kuraigana Island right after the Whitebeard War; he even went as far as relay to Zoro the events that occurred concerning his captain, Luffy. In addition, he offered a boat to help the Straw Hat's swordsman leave the island. He also told Perona to be safe when she decided to leave the castle."}, {"type": "paragraph", "text": "In spite of his apathetic behavior, Mihawk is capable of showing care and compassion to others. When Perona learned that Moria was alive, she immediately went to reunite with him and Mihawk wished for her to be safe, causing Perona to tearfully thank him for letting her stay with him for the last two years. It is later shown that he personally let her go out of concern for her well being due to him anticipating the Shichibukai system being abolished so she would not be in harms way when the Marines would be sent after him."}, {"type": "paragraph", "text": "Mihawk also shows curiosity for the people he decides to attack. He attempted to strike Whitebeard just to see what the power distance between himself and Whitebeard was.  He also attacked Luffy just to see if fate is on Luffy's side or not. As a result, Mihawk is very analytical about others' abilities, and can recognize strengths that others may not, such as when he understood that Luffy's natural charisma and quick amassing of comrades is his most dangerous attribute."}, {"type": "paragraph", "text": "Despite his serious demeanor, he is shown to be capable of engaging in peaceful activities such as tilling the land of Kuraigana Island."}, {"type": "paragraph", "text": "Like many other characters he has a unique laugh, unusually bearing two: \"Wahhahhahha/Kukukuku\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/13/Mihawk_Laughing.png/revision/latest/scale-to-width-down/200?cb=20140516221455", "caption": "Mihawk laughing instead of keeping his normal straight face."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [{"type": "paragraph", "text": "Although he spends most of his time alone, Mihawk appears to build a level of respect for those he finds interesting enough to battle with, and those who survive. Such an example is when Zoro challenged him to fight at Baratie, and even though he lost, Mihawk was impressed enough to spare him and declare his respect (although indirectly). Despite that, however, he does not seem to have anyone whom he is particularly fond of."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "In the past, Mihawk was a rival to one of the most powerful pirates in the world, Shanks. However, Mihawk lost interest in him after Shanks lost his left arm. He retains a neutral, though somewhat friendly relationship with Shanks, and is able to track him down if the need arises. He and Shanks do manage to get along, regardless of the fact that the two are opposites in personalities. Shanks was also able to get Mihawk to join in when he threw a party to celebrate Luffy's upcoming pirate status, even when moments beforehand Mihawk had scorned how laid-back Shanks was."}, {"type": "paragraph", "text": "Mihawk even mused out an apology to Shanks during the battle at Marineford, where he declares that he will not be holding anything back against Luffy right before going after him. When Shanks showed up during the Whitebeard War, Mihawk left the battle, stating that battling Shanks was beyond the scope of the World Government's agreement."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Shanks_Convinces_Mihawk_to_Celebrate.png/revision/latest/scale-to-width-down/210?cb=20121222203105", "caption": "Mihawk and Shanks"}]}, {"title": "Perona", "level": 4, "content": [{"type": "paragraph", "text": "Perona stayed on Kuraigana Island with Mihawk and Zoro during the latter's two year long training. After accompanying Zoro to the Sabaody Archipelago and going back to Thriller Bark to pick up Kumashi's body, she went back to Kuraigana and is now living with Mihawk, suggesting a good status between them. When she learned of her old master's survival, she was upset that Mihawk did not tell her while he paid her no mind and only told her to be safe as she tearfully thanked him for letting her stay with him. It also appears Mihawk was aware of the impending dissolution of the Shichibukai and had Perona leave for her own safety."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "Mihawk seems to have made lots of enemies in the past. Especially most of the swordsmen of the world want to have a chance to challenge him, like the Fifth Division Commander of the Whitebeard Pirates, Flower Sword Vista, who was thrilled to see Mihawk in the battle. He challenged him to battle with pleasure. Also, two okamas from Impel Down attacked him saying that they dueled him in the past. However, Mihawk replied that he doesn’t remember the name of every insect that he crushes. Vista expressed a desire to fight Mihawk and was happy that he got to cross blades with him, calling him the strongest swordsman in the world. In return, Mihawk showed him respect by being aware of his reputation."}], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Having lost one rival in Shanks, he now shares a rivalry with Zoro, and is prepared to wait as long as it takes for Zoro to become strong enough to beat him. To this end, Mihawk watches Zoro's progression and is delighted when Zoro gains his first bounty. After the war at Marineford, Zoro bowed before Mihawk, requesting training from the Shichibukai. Mihawk initially dismissed this request as Zoro reacting to an inability to defeat the Humandrills and escape the island. He chided Zoro and expressed regret for \"over-estimating\" the swordsman. When Zoro explained that he had defeated the Humandrills and required training from Mihawk to defeat him, Mihawk commented that Zoro must have found something more valuable than his ambition in order to make the request. He agreed to the request and ordered Perona to patch up Zoro so that the training can begin. Mihawk was a strict teacher when he was Zoro's swordmaster during the two-year timeskip. When teaching Zoro how to use Haki, he forbid Zoro from drinking alcohol until he fully mastered infusing his swords with Busoshoku Haki."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk sees and recognizes Luffy's potential. During the battle at Marineford, he expresses to himself that Luffy has the most dangerous ability on the seas, which is turning anyone around him into his allies, including former enemies. He was one of the few people not to be surprised that Luffy is the son of the world's most dangerous criminal and even challenges Luffy to a duel. Even though he easily gains the upper hand, he compliments on how Luffy is clear headed in battle and not as reckless as he thought. The two continued their fight until Luffy escapes after having been saved by the Whitebeard Pirates Fifth Division Commander, Vista. However, Mihawk seems amused when he hears about his progress throughout the series and acknowledges him as a true warrior rather than a foolish boy. He even accepted Zoro’s request for training when he surmised that he wanted to become stronger for Luffy’s sake."}], "images": []}, {"title": "Krieg", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk also made an enemy of Don Krieg, destroying Krieg's entire fleet when he attempted to conquer the Grand Line. Mihawk, for his part, did not even consider Krieg a threat. Upon sighting Mihawk, Krieg's anger led him to attack Mihawk, despite having witnessed Zoro's defeat and his own ship having been sliced apart. Mihawk did not even bother to retaliate, instead merely slashing Krieg's ship again and departing during the distraction."}], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Being a Shichibukai, Mihawk was an ally of the World Government. However, he does not care about their goals. From his discussion with Sengoku, it is stated that Mihawk rarely attends the meetings at Mary Geoise. Despite those facts, the marines display an amount of respect and fear towards him. Even Fleet Admiral Sakazuki (being an Admiral at that certain time) referred to Mihawk’s strength, by focusing on his eyes. He also answered the call of the Marines to summon for the upcoming war. The only occasion that Mihawk is shown to be obedient to the World Government is when he went to Marineford to fight against Whitebeard (although he left when Shanks arrived)."}, {"type": "paragraph", "text": "Due to the Shichibukai system being obsolete, he is now once again an enemy to the government as the Marine waste no time trying to arrest him. Mihawk, however, does muse the fact as he is eager to fight against them."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "Mihawk is one of the most powerful pirates to appear so far, possessing an immense amount of skill in battle. He defeated all but one of Don Krieg's fleet of 50 ships and 5,000 men by himself just before a storm struck. Mihawk's strength is so great that Don Krieg accuses him of having the power of a Devil Fruit. So far, it has only been indicated that his abilities are from pure skill and power. This makes Mihawk one of the few known Shichibukai whose strength is based solely on natural abilities."}, {"type": "paragraph", "text": "He has also remained unharmed thus far throughout the entire series, despite participating in the Battle of Marineford, in which many of the world's most powerful people suffered injuries. He was also a rival to one of the Yonko, further demonstrating his abilities."}, {"type": "paragraph", "text": "True to his epithet, \"Hawk Eyes\", Mihawk has exceptional eyesight, able to easily track Luffy's high-speed Gear Second movements, and strike with extreme precision, releasing a long-range slash at him while there was a chaotic battlefront of New World pirates and Marine officers between them."}, {"type": "paragraph", "text": "In addition, he is also a talented teacher: after training Zoro for two years, he accomplished more than the dojo had achieved in the many years Zoro had trained there (though it helped that Zoro's skills were already greatly developed by the time he became Mihawk's disciple). Zoro himself even admitted that even after training with Mihawk during the entirety of the (time-skip), while talking down to Pica, an elite officer of the former Donquixote Pirates, that he (Zoro) is still not anywhere near Mihawk's level of skill with swordsmanship, further attesting to Mihawk's combat and fighting prowess."}, {"type": "paragraph", "text": "He is shown to have a strong will as he was able to resist Luffy's Haoshoku Haki and be one of the few to still be able fight despite others around him falling unconscious. He also has great mental strength, having not fallen for the charms of Boa Hancock while most men easily fall for the pirate empress' beauty."}, {"type": "paragraph", "text": "Mihawk travels around in a coffin-shaped raft with two green-flamed candles, a single black sail, and a single seat. The fact that he can traverse the unforgiving oceans, as well as the Grand Line itself, in such a meager craft is yet another testament to his abilities."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f7/Mihawk%27s_Eyesight.png/revision/latest/scale-to-width-down/210?cb=20110321200729", "caption": "Mihawk's eyesight tracks Luffy's Gear Second through the commotion."}]}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Part of Mihawk's abilities as the most powerful master swordsman in the world is due to his tremendous superhuman strength, which he supplements in his mastery of swordsmanship. Mihawk's sword strikes are executed with tremendous power, able to easily create immensely powerful compressed air slashes with a massive range, enough to split large battleships and a mountain of ice with ease. He was also able to stop Zoro, a formidable swordsman with enormous strength, with only a single dagger that he held with one hand."}, {"type": "paragraph", "text": "Mihawk has extraordinary agility, being able to jump and leap enormous heights and distances. He is quick enough to counter Luffy's Gear Second enhanced speed."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Mihawk is the strongest swordsman in the world, whose swordsmanship is perfectly balanced in both Strong Blade (豪剣, Gōken) and Gentle Blade (柔剣, Jūken). This is proven by his absolute mastery of swordsmanship as he defeated Zoro, a swordmaster who is renowned all over the East Blue, two years prior effortlessly with a single dagger, which he uses as a dinner knife. He has been known to have frequently dueled with the Yonko Shanks when they were younger."}, {"type": "paragraph", "text": "Mihawk demonstrates tremendous dexterity and supreme skill in swordsmanship, especially when using his main sword, Yoru. His swordsmanship is extremely versatile, from destroying entire fleets of ships and giant icebergs with immense power using the Strong Blade swordsmanship to being able to deflect the course of bullets with masterful and graceful precision using Gentle Blade swordsmanship. He is also able to cut through steel with immense ease and swiftness, as demonstrated with the steel-bodied Mr. 1, whom even Zoro struggled to defeat."}, {"type": "paragraph", "text": "When Admiral Fujitora summoned a meteor during the battle at the Pirate Festival, Zoro used his most powerful attack but only managed to cut the meteor in two, after which Mihawk effortlessly sliced it to pieces in a casual manner, further testament to his skill and power."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Mihawk_slash.png/revision/latest/scale-to-width-down/210?cb=20101004031515", "caption": "Mihawk cuts through a massive iceberg."}]}, {"title": "Weapons", "level": 3, "content": [], "images": []}, {"title": "Kogatana", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk has a pendant cross knife worn on his neck. He is shown using it as a tool to eat with, but combined with his supreme sword skills, it is also a deadly weapon capable of defeating any minor or moderately skilled swordsmen, even Zoro, a swordsman who wielded three blades during their duel."}], "images": []}, {"title": "Yoru", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk wields the Black Sword Yoru as his main weapon. Yoru is a curved black blade in the shape of a latin cross, with a golden crossguard decorated by red cabochons (which are blue and green in the anime), and a hilt wrapped in bandages, with a particularly big cabochon at its extremity. When he accepts challenges for his title, he only draws this blade for those with enough spirit to earn Mihawk's respect, or enough power to present a threat; otherwise his Kogatana is sufficient. Yoru is an ornately-decorated, single-edged, human-sized sword (about 7 feet) shaped like a latin cross with a shiny black blade, which is curved at the end."}], "images": []}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk possesses the ability to use Busoshoku Haki. He taught Zoro how to use Busoshoku Haki to protect his swords from any damage."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Mihawk became famous even before the start of the Great Age of Pirates 24 years ago. He challenged increasingly powerful opponents until no one could challenge him, thus earning the title of \"World's Strongest Swordsman\". He attended Gol D. Roger's execution, and sometime after Roger's death, he joined the ranks of the Shichibukai."}, {"type": "paragraph", "text": "Mihawk once saw a strong rival in Shanks. Their battles were said to shake the whole of the Grand Line and Mihawk often sought Shanks out for duels. After Shanks lost his arm twelve years ago, Mihawk ceased seeking him out for duels. However, they remained on good terms, with Shanks telling Mihawk about a unique boy he met."}, {"type": "paragraph", "text": "Mihawk had been responsible for single-handedly destroying Don Krieg's entire fleet, excluding Krieg's flagship, during Krieg's failed attempt at entering and conquering the Grand Line. The destruction of Krieg's fleet drove the pirate from the Grand Line. He then followed Don Krieg to East Blue to the Baratie."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Baratie Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the Krieg Pirates docked their flagship at the Baratie, Mihawk shortly caught up to them and cut their flagship in three places. One of the Krieg Pirates shot at him with two flintlocks, but Mihawk deflected the bullets with Yoru. He was then confronted by Roronoa Zoro, who challenged him to a duel. Mihawk did not think much of Zoro and said he could display the difference in strength between them without crossing blades. Zoro did not back down, and Mihawk pulled out his Kogatana to duel the East Blue swordsman, noting he did not have a smaller sword. Zoro charged, and Mihawk easily blocked all three of his swords with Kogatana. He fended off Zoro's wild sword slashes, and wondered what Zoro's purpose was as he repelled the pirate. Zoro then unleashed an attack, but Mihawk stabbed him in the chest before Zoro's swords could reach him."}, {"type": "paragraph", "text": "Mihawk asked why Zoro did not step back, and Zoro replied that he wished to fulfill an oath he made, and wished to die otherwise. Out of respect for Zoro's passion, Mihawk decided to end the battle with Yoru. Zoro charged toward Mihawk and performed his strongest attack, and Mihawk responded by shattering two of his swords and cutting him in the chest. Zoro turned around to face Mihawk's blow, impressing Mihawk by stating that a wound on the back is a swordsman's shame, and Mihawk finished the duel by cutting him diagonally across the chest, holding back just enough to allow Zoro to live."}, {"type": "paragraph", "text": "Zoro's captain Monkey D. Luffy pulled himself toward the Krieg Pirates' ship to attack Mihawk in anger, but Mihawk dodged his punch. He then said that he allowed Zoro to live, and called out to his defeated opponent to drive on and meet him at the top so that he might one day surpass him. Mihawk listened to Luffy share his dream to become the Pirate King, and smiled as a barely conscious Zoro promised to Luffy to never lose again. He told the two he would look forward to meeting them again, but was then confronted by a vengeful Don Krieg. Mihawk no longer had any interest in pursuing Krieg's crew anymore, and as Krieg attacked him, Mihawk unleashed a final blow on the ship and departed before the chaos could settle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/52/Mihawk_Defeats_Zoro.png/revision/latest/scale-to-width-down/210?cb=20130116230329", "caption": "Mihawk gives Zoro a near-fatal strike."}]}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Luffy received his first bounty, Mihawk came to Shanks' island to tell him about it. When he reached the island, he encountered some members of the Red Hair Pirates and asked them about their superior's whereabouts. He found Shanks and showed him Luffy’s first wanted poster. Shanks responds by throwing another party, while inviting Mihawk to join in despite recovering from drinking too much alcohol shortly before."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ea/Mihawk_with_Luffy%27s_Bounty_Poster.png/revision/latest/scale-to-width-down/205?cb=20130409004014", "caption": "Mihawk tracks down Shanks to inform him of Luffy's first bounty."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk answered a summons to attend a meeting on Mary Geoise to discuss replacing Crocodile's Shichibukai position. Shortly after he arrived, Laffitte came into the room to nominate his captain, Marshall D. Teach, as Crocodile's replacement."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk answered the call to the Shichibukai to aid in the oncoming war against the Whitebeard Pirates, and dined with the other Shichibukai, except for Jinbe and Boa Hancock, on Mary Geoise."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace began, Mihawk stood alongside Bartholomew Kuma, Donquixote Doflamingo, Gecko Moria and Boa Hancock, ready for the battle ahead."}, {"type": "paragraph", "text": "When Aokiji froze the two tsunamis that Whitebeard caused, Mihawk was one of the first Shichibukai to attack, wishing to measure his strength against Whitebeard. He unleashed what was referred to as \"the strongest slash in the world,\" but his attack was stopped by Jozu. When Luffy arrived at Marineford with Impel Down prisoners, Mihawk was amused and remarked that the Straw Hat never failed to make things interesting. When Sengoku revealed the fact that Dragon is Luffy's father, Mihawk only commented that such a revelation is not really surprising."}, {"type": "paragraph", "text": "When Luffy managed to break through the horde of fighting men, Mihawk met him head on, not intending to hold back despite Luffy's connection to Shanks. Luffy tried dodging Mihawk with extreme speed, but Mihawk spotted him and hit him from far off, since Luffy was still within his sword's range. After attacking Luffy again, Mihawk was confronted by two Impel Down escapees who had fought him before. Not caring to remember them, Mihawk took them out in a single blow before turning his attention back to Luffy. He unleashed a massive slash that cut through the frozen tsunami a great distance away, but Luffy managed to duck the attack. Mihawk then attacked Luffy with whirlwind slashes, driving him further from Ace. However, his blade suddenly sliced the body of the pirate Buggy after Luffy pulled him down to act as a shield. Buggy was thrown at Mihawk, who cut him into tiny pieces. Thanks to his Devil Fruit, Buggy was alive and attacked Mihawk with an explosive Muggy Ball, but Mihawk deflected it back at him. Luffy had managed to run far away from Mihawk, but the swordsman could continue the fight; however, he was suddenly met by Vista of the Whitebeard Pirates, and as he looked at Luffy, he reflected that the Straw Hat's ability to gain allies was his most dangerous strength."}, {"type": "paragraph", "text": "After the army of Pacifista appeared, Mihawk commented to Vista that it was time to finish their battle while the latter stated they both had a point in their favor. After Whitebeard got stabbed by Squard, Mihawk was the only one to ignore the event and did not even gaze at him. He later fought in the Oriz Plaza after the pirates managed to get through the siege wall."}, {"type": "paragraph", "text": "When Luffy and Ivankov tried to reach Ace, Mihawk again arrived to stop them, but he was stopped by Daz Bonez. He easily defeated Daz Bonez, but Crocodile intervened and engaged in combat with Mihawk. After this clash, Mihawk witnessed Whitebeard die standing up alongside Gecko Moria. When Shanks arrived to end the war, Mihawk immediately departed, saying he had agreed to help fight Whitebeard but not Shanks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/Sekai_Ichi_no_Zangeki.png/revision/latest/scale-to-width-down/210?cb=20130429004505", "caption": "\"The strongest slash in the world\"."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d0/Mihawk_Attacks_Luffy.png/revision/latest/scale-to-width-down/210?cb=20120107100006", "caption": "Mihawk vs. Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/15/Mihawk_vs._Vista.png/revision/latest/scale-to-width-down/210?cb=20141206162103", "caption": "Mihawk vs. Vista."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ea/Crocodile_Protects_Luffy_from_Mihawk.png/revision/latest/scale-to-width-down/210?cb=20130204210223", "caption": "Mihawk vs. Crocodile."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk returned to his home on Kuraigana Island, where he encountered Zoro and Perona, who had come to the island in his absence. After telling Zoro about what happened to Luffy on Marineford, he gave Zoro a boat to depart from the island. Inside his castle, he was exasperated about Perona weeping over the newspaper's report of Moria's death, but told her he was unsure if the report was true. He went outside, where he saw Zoro struggling against several humandrills, with his boat being destroyed. Mihawk explained how the humandrills were violent because of a war that raged on the island in the past, and offered to let Zoro come back to his castle, but Zoro refused."}, {"type": "paragraph", "text": "Later, Zoro came to the castle and begged Mihawk to teach him the way of the sword. Mihawk was initially disdainful, believing that Zoro had retreated after failing to beat the humandrills and get off the island. However, Zoro revealed that he had beaten the humandrills. Mihawk was amused that Zoro wanted to train under him in order to eventually take his head and laughed. He agreed to Zoro's request, though not before Perona helped heal the pirate's wounds."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Mihawk_at_Home.png/revision/latest/scale-to-width-down/210?cb=20141206163646", "caption": "Mihawk talking to Perona at his home."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "While training Zoro, Mihawk taught him how to imbue his swords with Haki, forbidding him from having any alcohol until he had mastered doing so, much to Zoro's chagrin. After two years, Zoro's training finished and the young swordsman left for the Sabaody Archipelago."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events at Dressrosa, Mihawk and Perona read the news of the Straw Hats' new bounties while tilling the land of Kuraigana Island with the humandrills."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk was sitting in his castle as Perona learned from a newspaper that Moria was alive. As Perona was leaving, Mihawk mentioned an interesting topic that was brought up at the Levely."}, {"type": "paragraph", "text": "After the World Government voted to dissolve the Shichibukai, Mihawk found himself under siege by a Marine fleet, and he grew excited at becoming a wanted criminal again."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dracule Mihawk vs. Shanks (numerous times, unseen)", "elements": []}, {"text": "Dracule Mihawk vs. Krieg Pirates", "elements": []}, {"text": "Dracule Mihawk vs. Roronoa Zoro", "elements": []}, {"text": "Shichibukai and the Marines vs. Whitebeard Pirates and their allies", "elements": [{"text": "Dracule Mihawk vs. Monkey D. Luffy", "elements": []}, {"text": "Dracule Mihawk vs. Vista", "elements": []}, {"text": "Dracule Mihawk vs. Daz Bonez", "elements": []}, {"text": "Dracule Mihawk vs. Crocodile (unseen)", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Dracule Mihawk vs. Jinbe", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Mont Blanc Cricket's decision to help the Straw Hat Pirates reach sky island, Mihawk is seen carrying Luffy's second bounty poster as well as Zoro's first poster on his small ship traveling towards Mary Geoise. Mihawk is seen again after Luffy defeated Bellamy. He is surprised to discover their new bounty since he does not anticipate on Luffy and Zoro's accomplishment under such a short time."}], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the war at Marineford, Jinbe comes to Luffy's aid and challenges the swordsman. He uses his Fish-Man Karate to slow the oncoming cannon balls shot at him that Mihawk then cuts. The two then engage in a short clash, sending Jinbe flying back as he continues to pursue Luffy."}, {"type": "paragraph", "text": "When Sengoku revealed Luffy's relationship with Dragon in the manga, Mihawk commented that he was not surprised. In the anime, Mihawk remained silent."}], "images": []}, {"title": "Post-War Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Luffy's message is revealed, Mihawk and Zoro went outside the castle and Mihawk tells Zoro that the Humandrills are divided in ranks and that there is a leader among them, who has imitated his (Mihawk) swordsmanship style."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [], "images": []}, {"title": "Censorship", "level": 3, "content": [{"type": "paragraph", "text": "In the 4Kids dub, the bloody slash he gave Zoro was erased to him just ripping his shirt, plus the drinking scene with Shanks was edited out, too. He was also given a French-Caribbean accent, possibly linked to \"Dracule\" being a variation on \"Dracula\", though this is a mismatch against a Transylvanian accent used in popular fiction for vampires."}, {"type": "paragraph", "text": "All of the crosses on Mihawk are edited out in the 4Kids English dub, changing his necklace to an \"I,\" and shortening the \"arms\" of his sword. This is mainly due to their religious references. In One Piece Grand Battle!, amongst the unlockable art content are unedited artworks from the anime showing pictures of Mihawk without these edits. In the FUNimation dub, his sword and necklace remain unedited. However, in the English version of the game Unlimited Adventure, these previous edits were continued even though the right had already passed to FUNimation, who had decided not to continue this edit."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Shanks_Convinces_Mihawk_to_Celebrate.png/revision/latest/scale-to-width-down/210?cb=20121222203105", "caption": "Shanks and Mihawk in a scene cut from the 4Kids dub."}]}, {"title": "Etymology", "level": 3, "content": [{"type": "paragraph", "text": "There was some dispute as to Mihawk's name. Many fans argue that his name was \"Dracule\" or \"Juraquille\". Viz, 4Kids, and FUNimation chose to use \"Dracule\" for his name."}, {"type": "paragraph", "text": "His name seems to be formed from \"Dracula\" (ドラキュラ)."}, {"type": "paragraph", "text": "It can be speculated that it is because of Dracula's name being partly in Mihawk's family name and partly because his Japanese Voice Actor does not pronounce the \"u\". \"U\" is often silent in Japanese and Japanese voice actors will often not speak the \"u\" in words even when required to do so. There is currently no explanation as to why \"Dracule\" exists in the English version although a theory by fans is that it is because of the noted similarity to the name \"Dracula\" in the first place and a generally acceptance amongst fans is that it is what Oda is aiming for. However, for the name to be \"Dracule\" correctly, the beginning in Japanese would be \"ド\" instead of \"ジュ\". One note is that \"ジュ\" can be read as \"Du\" as well as \"Ju\" which can give the variation \"Duracule\" and because of interchangeable \"l\" sound also \"Duracure\", \"Joucurare\" and \"Jucurares\" can exist are possible variation names. Other arguments included that the name \"Dracule\" stems from a Latin text to Japanese error on Oda's part (also seen with Rob Lucci's name and the word \"Luce\"), or that it is intended to be an unusual translation in the first place."}, {"type": "paragraph", "text": "On merchandise, it had been reported that \"Dracule\" existed before; however, there are many problems with relying on merchandise as there have been many mistakes made in the past when a mangaka does not supply a name for a character (such as with Chew and Mr. 2 being referred to as \"Chu\" and \"Bon Clay\" until Oda provided the corrected names). \"Juraquille\", the other popular fan name, did not transfer back into Japanese well. Its romanization in itself is \"Jurakuyrure\", which is a mismatch against the romanization of Mihawk's name (\"Jurakyūru\")."}, {"type": "paragraph", "text": "Fans often avoided the argument over his name by using just \"Mihawk\" and miss out his surname completely as without confirmation from Oda, it was considered the most neutral take on his name. To this end, with the question on Mihawk's Latin name open for debate, he was subject to many variable degrees of false etymology."}, {"type": "paragraph", "text": "The One Piece Green: Secret Pieces databook confirmed his name to be \"Dracule\" finally ending this dispute after years of fan debate."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His design seems to be based on the typical Spanish swordsman of the Spanish Golden Age.", "elements": []}, {"text": "He is the first Shichibukai shown in the series.", "elements": []}, {"text": "He is the only Shichibukai with no known bounty.", "elements": []}, {"text": "He and Jinbe are currently the only known Shichibukai who do not have Devil Fruit powers.", "elements": []}, {"text": "He and Edward Weevil are the only Shichibukai who do not belong or have not belonged to a known pirate crew or organization.", "elements": []}, {"text": "While it was stated he clashed against Shanks several times, their only duel that was actually seen so far is in the game One Piece: Unlimited Cruise 2. It was used as an intro for both of them as bosses.", "elements": []}, {"text": "On his character poster for Grand Battle! that appears when he is unlocked, his name is spelled \"Mihark\".", "elements": []}, {"text": "In the 5th Japanese fan poll, Mihawk ranked as the 23rd most popular character, making this the first poll where he was not ranked as the most popular Shichibukai, overthrown by Boa Hancock, Crocodile, and Donquixote Doflamingo.", "elements": [{"text": "In the 6th Japanese fan poll results announcement, he was mistakenly omitted from his 22nd place, making every character that followed him (23rd onward) rank one place higher.", "elements": []}]}, {"text": "In the FUNimation dub, when he makes his speech to Zoro, he uses his epithet instead of his real surname.", "elements": []}, {"text": "Mihawk's favorite drink is red wine.", "elements": []}]}], "images": []}, {"title": "Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hawk – Wikipedia article about the animal reference in Mihawk's name", "elements": []}]}], "images": []}]}