{"sections": [{"title": "Emporio Ivankov", "level": 1, "content": [{"type": "paragraph", "text": "Emporio Ivankov, or Iva for short, is the \"Queen\" of the Kamabakka Kingdom, known as \"Okama King\" and a \"Miracle Person\", and is a commander of the Revolutionary Army, commanding the G Army which covers the Grand Line."}, {"type": "paragraph", "text": "He was formerly a prisoner of Impel Down kept in Level 5, living in a secret \"Okama Paradise\" in level 5.5, but has since returned to his post as Queen of Kamabakka Kingdom. He challenged Sanji to defeat his 99 masters of Newkama Kenpo for the secret of the \"attack cuisine\" and a boat, during the two year timeskip."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ivankov is a large man with an afro of indigo hair, and has long eyelashes, he also has a noticeably-odd shaped chin resembling an arrowhead. His afro is large enough to hold people inside it. He has a personal Jolly Roger tattooed just below his chest."}, {"type": "paragraph", "text": "As an okama, he dresses in reddish-purple woman's garments with heavy makeup. To signify his queen-ship of New Kama Land, he wears a queen's crown with a king's crown on top."}, {"type": "paragraph", "text": "Using his Emporio Female Hormones on himself, Ivankov can become a large-sized, relatively curvy woman. This form is more realistically proportioned (relatively speaking) than his male form, and is rather well endowed. Because of the clothes he wears as an okama, this form is also scantily dressed. Despite the changes brought on by the hormones however, he is still incredibly tall and is at least twice, if not three times the size of the Impel Down officer Sadi. While in a flashback as a Revolutionary, Iva has been seen wearing a cloak, and without the crown."}, {"type": "paragraph", "text": "In the anime, when Iva turns into a woman, he keeps his male voice, unlike the other characters who are changed by his powers, although his voice sounds slightly different between male and female."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As an okama, Iva is an effeminate cross dressing man. He also has a tendency to put \"buru\" at the end of a sentence as well as pronounce \"watashi\" and \"anata\" with a v (vatashi and vanata). He also tends to sometimes proclaim the exact opposite of a statement he has just said, with people believing this is his sense of humor, such as saying that he would not mind being called \"Crap\", before hastily announcing that he would not be referred to as such. He is noted for not being picky on what Japanese honorific someone can use when addressing him."}, {"type": "paragraph", "text": "Being one who follows the way of the Okama, Iva strongly values friendship and bonds above all else. He seems to find great motivation at helping both friends and subordinates, and is ready to put his life on the line for their sake, as seen when he flew into a rage against Kuma when the latter attacked his \"candies\". Due to this trait, Ivankov willingly saved Luffy and Bentham when they were on the verge of death after being touched by Luffy's selflessness and pleading to save Bentham."}, {"type": "paragraph", "text": "He also believes that people should be what they want to be whether it be a man, woman, or okama. He is very loud and open, even perverse, about his ideals as well. He does not care about other people's objections to his views, he even turned a man who tries to kill him into a woman, after the man (now woman) was embarrassed by his ordeal and had previously stated he objected to Ivankov's views. He states that as a prisoner of Impel Down he is not such a good person as he would not save someone's life. However, when touched by the words of friendship and hope, he considers their life worth saving."}, {"type": "paragraph", "text": "He thinks that \"miracles\" only come to those who never give up and therefore should not be taken lightly of and nor should those who can muster within themselves to produce such also be looked down upon. He also dislikes people who rely on others to save them, and believes they are not worth being saved. According to him, he always questions the \"Will to Live\" of nations he saved. Additionally, he also seems to be perceptive, being able to tell a person's physical health condition after observing them for a short while; Ivankov's intelligence also extends to being able to estimate what \"toll\" his Devil Fruit power upon those he uses it on. This as well as noticing Dragon's habit of looking towards the East Blue when the wind blows, and correctly assumed it was because his family was there."}, {"type": "paragraph", "text": "Before his meeting with Luffy, he did not express interest in breaking out of prison. He stated that he will escape when Dragon and the revolutionaries would take down the World Government. However, when Ivankov learned that Luffy was Dragon's son, he decided to help Luffy rescue Ace, considering his duty to his \"personal compatriot\", Dragon. He has a hatred towards anyone who has forgotten him, claiming that no one could possibly forget his face."}, {"type": "paragraph", "text": "He also tends to call people by their name or nickname (or part of it) followed with \"boy\" (ボーイ, bōi), like calling Mr 2 Bon Kurei \"Bon-boy\", Luffy as \"Straw Hat-boy\", and Crocodile \"Croco-boy\". Iva often shouts \"Hee-Haw!\" (ヒーハー, Hīhā); in the Shonen Jump translation, he shouts \"Woo-Hoo!\". Like other characters in One Piece, Ivankov has his own laughter style: Mmmfufufu (ンフフフ, nfufufu)."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Revolutionary Army", "level": 3, "content": [{"type": "paragraph", "text": "Ivankov's relationship with the other members of the Revolutionary Army is positive as some of them do care for him by showing concern on whether Ivankov survived the Whitebeard War or not. Ivankov later allows the Revolutionary Army to use Momoiro Island as their new primary headquarters after the destruction of Baltigo."}], "images": []}, {"title": "Monkey D. Dragon", "level": 4, "content": [{"type": "paragraph", "text": "Ivankov seems to have a close relationship with his leader, Monkey D. Dragon, and is a loyal follower within the Revolutionary group. In fact, Iva picked up on Dragon's habit of staring at the direction of East Blue when the wind blows, stating that Dragon may be homesick. However, while he knew this much, he seems to know little to nothing about Dragon's family, until his son Luffy speaks out and was shocked Dragon had family. Even when they rescued the people from the Grey Terminal, Iva had no idea that Dragon was born in Goa Kingdom."}, {"type": "paragraph", "text": "Ivankov's sense of camaraderie covers to the point where despite being a prisoner of Impel Down, his loyalty remains to the degree where he appeared to be under no belief that Dragon abandoned him. Ivankov even stated that the only reason why he remained within the Great Prison was because he was merely biding his time, waiting for the right moment when Dragon will strike again, and only then would he break out of Impel Down and join Dragon by his side, a notion that got accelerated upon learning that Luffy was Dragon's son, and the assumption that Ace was as well."}, {"type": "paragraph", "text": "Following the end of the Battle of Marineford, Ivankov is contacted by Dragon and they caught up. Ivankov remarked on Dragon's family ties being revealed while Dragon expressed surprise that Ivankov protected his son and sounded grateful to him."}, {"type": "paragraph", "text": "After the time-skip, Ivankov allowed Dragon and the other revolutionaries to relocate to Momoiro Island after the Blackbeard Pirates destroyed the main base. They are still on good terms with Ivankov remarking on Luffy's raise in infamy and comparing him to his father."}], "images": []}, {"title": "Inazuma", "level": 4, "content": [{"type": "paragraph", "text": "As a fellow comrade and okama, Ivankov broke Inazuma out of his cell in Level 5 of Impel Down. They plotted to escape when the time is right. They are shown to be well-acquainted as Inazuma loyally assisted Ivankov during the escape from Impel Down and while helping Luffy reach Ace at the Battle of Marineford."}], "images": []}, {"title": "Bartholomew Kuma", "level": 4, "content": [{"type": "paragraph", "text": "Ivankov was an old friend of Bartholomew Kuma, as both were among the Revolutionaries inner circle. Ivankov seems to know Kuma very well, one clue of this is Ivankov's comment about how Kuma hated the World Government. Moreover, Ivankov is well aware of the Nikyu Nikyu no Mi."}, {"type": "paragraph", "text": "He expressed absolute shock when Doflamingo informed him that Kuma allowed the World Government to turn him into a cyborg and strip him of his memories, emotions, and free will."}], "images": []}, {"title": "Friends and Allies", "level": 3, "content": [], "images": []}, {"title": "New Kama Land", "level": 4, "content": [{"type": "paragraph", "text": "The party of New Kama Land seem to worship and respect Ivankov like a \"queen\", due to him helping them escape from their hellish cells and giving them a better place to live. They gladly followed him when he decided to break out and entered into the fray at Marineford without hesitation. After the war, they continued to follow him as they went to Kamabakka Kingdom."}], "images": []}, {"title": "Bon Kurei", "level": 4, "content": [{"type": "paragraph", "text": "Mr. 2 Bon Kurei, in particular, worships Ivankov for being the greatest okama, as well as saving his and Luffy's lives. Iva, in return, was moved by Luffy's and Bon Kurei's strong friendship and was among the many prisoners who were crying after learning of Bon Kurei's sacrifice to get the Gates of Justice open for them."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "When Monkey D. Luffy begged for Ivankov to save Mr. 2 Bon Kurei from his injuries over his own fatally poisoned body, Ivankov was touched by this selfless bond and formed a respect for Luffy. Upon witnessing Luffy's astonishing recovery and discovering that Luffy is the son of his leader, Dragon, Iva's respect grew even deeper, and he felt a duty to assist Luffy in breaking Ace out of prison."}, {"type": "paragraph", "text": "When Luffy declared venturing to Marineford to save Ace, Ivankov comments on how facing Luffy is like facing Dragon. Later, during the Battle of Marineford, when Luffy was on his last stand after taking a severe beating from admirals and vice-admirals, he begged Iva to once again inject himself with the tension hormones, to which the Okama was greatly reluctant, saying the boy could lose his life, and if he does, then he will not be able to ever face Dragon again. Ivankov was amazed by Luffy using Haoshoku Haki and noted he truly is Dragon's son with his great power. Ivankov later protected Luffy from the ruthless Admiral Akainu after the latter had killed Ace. Before splitting away from Luffy, he said that he would like to meet Luffy again someday. After reading a newspaper article about an incident involving Luffy, Ivankov comments on the traits Luffy inherited from Dragon, just as he had been doing ever since learning of their relationship."}, {"type": "paragraph", "text": "After the time-skip, he is shown to still be impressed by Luffy's actions as he read the newspaper detailing the Straw Hats' activities in Totto Land. He was very impressed with Luffy's growing reputation and remarked that he truly is his father's son with his ongoing success."}], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Ivankov has met Sanji, whom he distrusts owing to his drawn wanted poster, claiming he could be a spy for the government. He also enjoys tormenting him by implying that he will lend him a ship and then saying he will not. He did, however, give Sanji a challenge so that he could get the recipes for the Attack Cuisine and offered to give him a ship should he succeed. After the two-year timeskip, Sanji was given a ride so Iva did keep his word."}, {"type": "paragraph", "text": "It seems he is now aware Sanji really is a member of Luffy's crew, after he read the newspaper detailing the Straw Hats' activities in Totto Land. He was also surprised that Sanji never told him that he was a former prince of Germa. He even called him \"Sanji-boy\", suggesting he became fond of the latter."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Currently, Ivankov has also seemed to have formed a bond with the former Shichibukai, Jinbe, in their attempt to aid their liberator, Monkey D. Luffy in his effort to rescue Ace in the middle of the war occurring in Marineford. After Ace's death, both Ivankov and Jinbe protected Luffy from Admiral Akainu. After leaving Marineford, Ivankov entrusted Jinbe to watch over Luffy."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "There was one prisoner in Level 5.5 who did not like Ivankov. Bellett bore a grudge for Iva because he turned his father into an okama, which led to the downfall of his family and kingdom, and the man went from prince to pirate. The man swore revenge, only to be turned into a woman due to Ivankov's powers."}], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "As a member of the revolutionary army, Ivankov is an enemy of the World Government."}], "images": []}, {"title": "Magellan", "level": 4, "content": [{"type": "paragraph", "text": "Ivankov had a brief fight where Magellan poisoned him, due to leading an uprising in Impel Down."}], "images": []}, {"title": "Sakazuki", "level": 4, "content": [{"type": "paragraph", "text": "While their respective statuses were enough to make them enemies, their antagonism became stronger when the then Admiral Akainu killed Ace and attempted to kill Luffy and Jinbe. Ivankov intervened on the two's behalf and confronted the admiral. The two briefly fought and Akainu defeated Ivankov."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Crocodile", "level": 4, "content": [{"type": "paragraph", "text": "He and Crocodile apparently met before, when Crocodile was still a rookie. Ivankov even found out a precious weakness of Crocodile's, which he used to blackmail Crocodile to ensure that he would not try to betray the escape party."}], "images": []}, {"title": "Boa Hancock", "level": 4, "content": [{"type": "paragraph", "text": "He and Boa Hancock seem to have an understanding. Hancock appears to be fine with Ivankov sneaking aboard the Marine ship she used to follow Luffy because of his concern for young pirate. They both expressed worry for him due to witnessing the death of his brother."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "He and Law seem to be neutral to each other. Ivankov questioned if Law was a friend of Luffy but the latter responded he was not. Law states he had no reason to save Luffy and offers to make up reason for doing so. Ivankov declined the offer and noted instincts can drive people to commit unusual actions."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He is considered the greatest okama in the world. As queen of Kamabakka Kingdom, Iva controls an island of male transvestites, which gives him a similar status on par with Boa Hancock, who rules over Amazon Lily. In Impel Down, he set up his new kingdom (or queendom) called New Kama Land and commanded a small army of \"New Kama Okama\" followers, all of whom were former prisoners. Following the war, he returned to Kamabakka Kingdom along with his New Kama Land followers, uniting his 2 king/queendoms."}, {"type": "paragraph", "text": "As a commander of the Revolutionaries, Iva has control over the lower ranking members of the army. He appears to have considerable skills as a leader, evident by his ability to unite the rag-tag group of unruly inmates that strayed away and eventually found themselves in New Kama Land under his command."}, {"type": "paragraph", "text": "In contrast to his rather comical appearance, Ivankov is a powerful fighter should the need arise. His strength is great enough to allow him to fight on equal terms with the completely transformed Pacifista, Shichibukai Bartholomew Kuma. He was able to easily defeat (without any visible damage) Sanji, one of the Straw Hats' top fighters. Upon encountering Crocodile in Impel Down, he also mentioned that he could defeat the former Shichibukai if necessary."}, {"type": "paragraph", "text": "Another helpful, if comical, asset Ivankov has is that he wears a great deal of make-up, enough to essentially create a \"mask\" which was able to completely shield his face from Magellan's corrosive poison and Akainu's magma in the anime, though in the latter case, it did not prevent him from getting hurt as he fainted soon afterwards."}, {"type": "paragraph", "text": "Ivankov also appears to have some knowledge regarding Haki, having asked Luffy about it at the final stages of the battle at Marineford, and the fact that he was able to retain his consciousness after Luffy unleashed a surge of Haoshoku Haki throughout Marineford (that incapacitated both Marine and pirate alike) despite being so close to the boy while running side by side with him suggests remarkable willpower on Ivankov's part."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Ivankov has massive physical strength befitting his size. He can easily carry a normal sized prison guard with only one hand while searching for Ace in Level 6 prison of Impel Down. With a single kick, he could knock Bartholomew Kuma away with great force despite the latter's cybernetic reinforced durability as a Pacifista without any strain on his leg whereas Sanji, who has fearsome kicking power ended up damaging his own leg when he attacked Kuma back at Thriller Bark. Despite his size, Ivankov is extremely fast with incredible agility. In the anime, Ivankov can effortlessly evade Magellan's poison attacks while playing around and also dodged Kuma's lasers while rotating at high speed. Even with an enlarged head, he can maneuver fast enough to create multiple afterimages of himself to use his Galaxy Wink technique. His agility can be further enhanced by transforming himself into a woman. As a woman, Ivankov has outstanding acrobatic prowess, able to perform extraordinary feats of somersaults, handsprings, and flips. He easily overwhelms Sadi in terms of speed, able to attack and evade with fluid mobility. Ivankov is also an extremely skilled and versatile martial artist. In addition to Newkama Kenpo, he is also an expert wrestler. He employed Newkama Kenpo techniques as a man and kicks and wrestling techniques as a woman. He easily defeated Chief Guard Sadi, one of the strongest among the staff of Impel Down, without any injuries. He also successfully injured Magellan before succumbing to his poison. He easily defeated Sanji, who is powerful enough to defeat monsters and dangerous enemies such as Jabra, an extremely powerful Rokushiki master."}, {"type": "paragraph", "text": "Ivankov has immense endurance, as he could stand in Level 5, also known as the Freezing Hell, without showing any signs of discomfort even though the temperature was so low that prisoners were losing their limbs from extreme frostbite. Enhanced with his hormones, he could survive exposure to Magellan's deadly poison and muster enough strength to launch himself to Level 2 while carrying Inazuma. He also recovered shortly after escaping from Impel Down. In the anime, he can defend against the full force of Sanji's Diable Jambe enhanced kicks with his arms crossed without any effort."}, {"type": "paragraph", "text": "Ivankov has incredible strength in his facial muscles, as he could easily create powerful shock waves with simple winks."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Ivankov ate the Horu Horu no Mi, a Paramecia-type Devil Fruit which allows him to control the hormones of the human body, and is one of the very few known powers coming from a Devil Fruit that can affect other people's bodies as well as his/her own. This power led him to be known as the \"Miracle Person\"."}, {"type": "paragraph", "text": "He can remodel a human from the inside, which allows them to change all physical aspects, including: sex, growth, skin pigment, and many other things."}, {"type": "paragraph", "text": "This also allows him to boost a person's chances of survival from conditions that would otherwise mean certain death. However, it is only a slight increase, so only those with a strong enough will can recover. Also, the process apparently shortens a person's potential lifespan."}], "images": []}, {"title": "Newkama Kenpo", "level": 3, "content": [{"type": "paragraph", "text": "Ivankov is an extremely powerful grandmaster of a martial art called the Newkama Kenpo. Ivankov could injure Chief Warden Magellan before losing to his poison ability and during the Marineford War, Ivankov was practically the first (and probably the only one) to actually harm Kuma throughout the extent of the battle. In the anime, he easily overpowered and defeated Sanji, a powerful master of the Black Leg Style. Ivankov's trademark technique is the Death Wink. This ridiculous but powerful attack creates a massive shockwave simply by winking. He demonstrated this wink on a man who swore revenge on him because Ivankov had turned his father, who was a king, into a woman. The man fired with his bazooka and Ivankov used the Death Wink to repel the blast. His Death Wink is powerful enough to shatter steel traps. This attack is often powered up by Ivankov's Devil Fruit, using it to increase the size of his own head, creating the more powerful Hell Wink."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Ivankov apparently was responsible for many \"miracles\" people would seek out his help for many things, including making them become an Okama. At some time in his past, Ivankov knew Crocodile when he was a rookie, and found out a precious weakness Crocodile has along with him."}, {"type": "paragraph", "text": "At some time, he became a commander of the Revolutionaries, and had a close relationship with the leader Monkey D. Dragon. In fact, twelve years before the current timeline, he was on a crew with Monkey D. Dragon and Bartholomew Kuma. He witnessed the destruction of Gray Terminal, and helped the survivors board Dragon's ship."}, {"type": "paragraph", "text": "Later, for his membership in the Revolutionaries, he was sent to Level 5 of Impel Down. However, it seems that his membership was not widely known, as Mr. 2 Bon Kurei claimed he was captured \"without rhyme nor reason\"."}, {"type": "paragraph", "text": "He was also at one point the Queen of the Kamabakka Kingdom, but retired (possibly because of his imprisonment)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Dragon_and_Ivankov.png/revision/latest/scale-to-width-down/210?cb=20130224085632", "caption": "Ivankov talking to Dragon at the Headquarters."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Some time after he was captured, Ivankov somehow completely disappeared from his cell without a trace. Since then however, there have been sightings of a man roaming around a forest near an abandoned guard's office. It turns out he and all the other people who were thought disappeared were actually under the sewers of Level 5, where he ruled a kingdom of okamas which he calls The New Kama Land. After Ivankov and Inazuma found Mr. 2 Bon Kurei and Luffy, Luffy begged for the two to save Bon Kurei, while he himself was in worse shape."}, {"type": "paragraph", "text": "While Ivankov was making an entrance, Bellett came seeking revenge against Iva for his father becoming an okama after visiting Kamabakka Kingdom 15 years ago. He shot a cannonball at Iva, who, pretending to be scared, winked at the cannonball and launched it back. Then he transformed his attacker with female hormones into a woman. Afterwards, he informed Bon Kurei that Luffy was in the healing process from the poison and would be finished in two days though it would cost Luffy 10 years of his lifepsan."}, {"type": "paragraph", "text": "After injecting Luffy with his Healing Hormones, he had a talk with Bon Kurei about Impel Down and the New Kama Land, explaining that it actually exists between Level 5 and Level 6, having been dug out long ago by a former prisoner possessing a digging Devil Fruit power. After explaining to Bon Kurei the mechanics of Level 6, he asked him to go rest, which he refused, as he would rather spend his time cheering on Luffy to not give up. After seeing Bon Kurei's efforts, he and everyone in New Kama Land started cheering for Luffy as well. He was last seen completely astounded by the fact that Luffy had managed to heal in just 20 hours, instead of the over 48 he had predicted it would take."}, {"type": "paragraph", "text": "Iva showed great (albeit delayed) surprise after Luffy told him Dragon was his father, which led Iva to understand Luffy's incredible willpower and Dragon's past habits. He then assumed that Ace was also Dragon's son and came to the conclusion that the Government did not know this \"fact\". He then went with Luffy and Inazuma to save Ace (and possibly keep the Government from making a big mistake which, he believes, could lead to invoking Dragon's wrath). He also advised Luffy to be careful about who he tells his parentage to. He left New Kama Land with Inazuma and Luffy, believing that as Dragon's comrade it is his duty to help Luffy in his task."}, {"type": "paragraph", "text": "When the trio managed to enter Level 6, they found that Ace has already been transferred to the custody of the Marines. Worse yet, both the lift and the stairs out of Level 6 was blocked all of a sudden. With seemingly no possible way to save Ace, Iva told Luffy to just leave the rest to Whitebeard, as perhaps the more veteran pirate would have better luck at succeeding where the three of them had failed, and that they would try to get Luffy out of Impel Down. Luffy, however, stated he would rescue Ace or he would regret it for life, and decided to go to Marineford to do so. Iva claimed that is beyond dangerous, with so many powerful opponents there, but also sensed a powerful sensation when Luffy spoke, much like in the presence of Dragon. When some of the rowdy prisoners made snide remarks and told them to release them from their cells, Iva used his Death Wink to silence them. When Crocodile spoke up and offered them assistance, Iva persuaded Luffy to agree, and decided to use a \"precious weakness\" of Crocodile to hold him in control. Also, Jinbe requested for the chance to participate in the battle as well. With that, the five of them are in the process of breaking out."}, {"type": "paragraph", "text": "When they arrived back in Level 5, he called up all his faithful Okama to join him in the battle, and instructed them to free as many prisoners they can on the way from Level 5 upwards. While there, he injected Mr. 2 with Tension Hormones to be able to fight alongside with them. He then chased after Luffy and made his way up to Level 4 to fight the jailers there. Having used Face Growth Hormones on himself, Ivankov defeated a group of Blugori with a single Hell Wink. As the prisoners got closer to the stairs to Level 3, he changed into a woman and fought Sadi. Ivankov managed to dispatch Sadi easily by restraining the Chief Guard with her own whip."}, {"type": "paragraph", "text": "After finishing with Blackbeard, Magellan came after Luffy himself, refusing to allow him to tarnish Impel Down's reputation. In order to buy them time, Emporio and Inazuma decided to stay and battle Magellan himself, though both efforts ultimately proved to be futile against the Chief Warden, ending in Iva's prompt defeat."}, {"type": "paragraph", "text": "After reviving himself with Tension Hormones and Healing Hormones, Ivankov took the unconscious Inazuma with him and used Face Growth Hormone and Hell Wink to reach the Main Entrance of Impel Down, where Luffy and the other prisoners were escaping Magellan. Thanks to his Hell Wink technique, the whole group managed to reach the sea, where Jinbe's whale sharks saved them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Ivankov%27s_Entrance.png/revision/latest/scale-to-width-down/210?cb=20100908035810", "caption": "Ivankov's grand entrance."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Iva_vs_Sadi-chan.png/revision/latest/scale-to-width-down/210?cb=20130224090319", "caption": "Sadi-chan battles the female Ivankov."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2a/Newkama_Kenpo_Infobox.png/revision/latest/scale-to-width-down/210?cb=20130224091837", "caption": "Emporio Ivankov hits Magellan with \"44 - Aesthetic Technique! Hair Removal Fist\"."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Once they reached the ship, Ivankov told some of the prisoners to fetch medical supplies for Inazuma. Ivankov revealed he used Healing Hormones and Tension Hormones to save himself from the poison, but he did not want to put Inazuma through the same thing."}, {"type": "paragraph", "text": "After going through the Gates of Justice, Luffy told Ivankov that Ace was actually the son of Gol D. Roger, which shocked him. Regardless, Ivankov was willing to continue to support Luffy, and at Luffy's request, used the Hell Wink to launch the entire ship into the air and into Marineford."}, {"type": "paragraph", "text": "He and the other Impel Down fugitives fell from the sky down upon Marineford, in order to support Luffy in his rescue of Ace. Upon splashing down in the bay of Marineford, and after being rescued by Jinbe, Ivankov mused aloud that a battle of the great powers is certainly a force to be reckoned with."}, {"type": "paragraph", "text": "Ivankov was stunned to see Luffy speaking so cavalierly with Whitebeard, even going so far as to compete with him to save Ace. Ivankov later used a Death Wink to propel Luffy, who was charging towards the platform that Ace was on, away from a laser fired at him by Admiral Kizaru. When Luffy yelled his gratitude, Ivankov's only reply was that he sees it as his duty to not let Luffy die while in his presence."}, {"type": "paragraph", "text": "Ivankov was then attacked by another laser, only this time, it came from Bartholomew Kuma, which Ivankov managed to evade with an acrobatic rolling move. He was panting and thinking to himself that while he could tolerate it if it is Kuma's desire to retain his Shichibukai status, to fire directly at an old acquaintance like himself is quite another matter."}, {"type": "paragraph", "text": "He later fought with Kuma, trying to talk some sense into him and saying that if Kuma does not stop attacking, he will be forced to fight back. Doflamingo said that it is no use talking to Kuma as his modification into a full Pacifista was recently completed, erasing all of Kuma's memories and making him a heartless killing machine. Ivankov, outraged, said he would hold back no longer. When the army of Pacifista was unveiled, with Sentomaru apparently commanding them, a stunned Ivankov could only sputter Kuma's name repeatedly."}, {"type": "paragraph", "text": "Ivankov was shocked when Squard stabbed Whitebeard and when Crocodile called the Yonko weak. After Whitebeard entered the battle himself, Ivankov and Jinbe discussed the proceeding of the battle and realized that the Marines were planning something big. After the Marines raised the steel walls in order to surround all the pirates, Akainu rained down magma fists on the pirates, and Ivankov leaped out of the way."}, {"type": "paragraph", "text": "As the pirates rush toward Little Oars Jr., whose body held down part of the seige wall, Ivankov asked Jinbe about Luffy's location, and the fish-man pointed toward the fallen giant. An explosion then caught and launched Luffy back toward Ivankov and Jinbe, both of whom scolded him over such a reckless plan."}, {"type": "paragraph", "text": "Ivankov enlarged his face and looked over the siege wall. Seeing the barely conscious Luffy in Whitebeard's hand, Ivankov scolded the young pirate about joining the war and Luffy' role in it. Whitebeard then threw Luffy to the side and had a doctor look after him. Luffy begged for another shot of tension hormones so that he could continue fighting, and worried about having to face Dragon should Luffy die, Ivankov begrudgingly did so and then followed Luffy into the fight again, reminding him about the risks of the hormones. Two Pacifista confronted them and prepared to fire at them, but Hancock stood in the way, causing the cyborgs to stand down and Ivankov to wonder how Luffy made such an ally. When the Marines prepared to excute Ace, Luffy used Haoshoku Haki, shocking Ivankov."}, {"type": "paragraph", "text": "As Ivankov and Luffy continued running to the platform, Ivankov asked Luffy where he got that kind of power. Luffy was unaware of it, and Ivankov realized it is no wonder he attracts people. Ivankov and Luffy pummeled through the Marines, and he asked Luffy if he has what it takes to live up to the expectations of Whitebeard's faith in him, but Luffy said that he has never known Whitebeard and stated that he is only there for one reason, to save Ace. Once they neared the platform, Ivankov asked Inazuma to use his power to build a path fo Luffy to reach Ace, and kept the Marines from getting closer to Luffy as he ran to the top. Monkey D. Garp jumped down on the bridge and broke it, and as it fell, Ivankov yelled at Luffy to do something."}, {"type": "paragraph", "text": "After Luffy freed Ace, Ivankov cried with joy that Luffy is the man that can get the job done. When Whitebeard called for his forces to retreat, Ivankov asked why Luffy had not moved."}, {"type": "paragraph", "text": "Later, after Akainu killed Ace, Luffy went into shock, alarming Ivankov. Jinbe grabbed Luffy and ran with Ivankov back to the ships as Whitebeard died and declared that One Piece is real. Akainu appeared in front of Jinbe and once again told him to give Straw Hat to him, but Jinbe replied back that he would rather die than giving up on Luffy. As Akainu prepared himself to attack, Ivankov appeared overhead with an enlarged head, refused to let the boy come to harm, and attacked the admiral with his signature Hell Wink, causing a massive explosion. After a brief battle, Akainu took down Ivankov and Inazuma and continued his pursuit of Jinbe and Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/02/Impel_Down_Alliance_Arrives.png/revision/latest/scale-to-width-down/210?cb=20141206162620", "caption": "The escapees finally arrive in Marineford."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Kuma_and_Ivankov_confrontation.png/revision/latest/scale-to-width-down/210?cb=20141206162352", "caption": "Ivankov confronts Kuma."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Having managed to survive his ordeal against Akainu, Ivankov and his men sneaked onboard the Hancock's commandeered battleship. He then boarded Law's submarine, commented on the strength and will Luffy displayed since Impel Down, and lamented about the pain Luffy accumulated during his ordeal. He then asked Law if he is a friend of Luffy's. When Law told him they are not allies, and offered to make up an excuse for treating him, Iva said he does not need one, as Law was simply following his instincts. Once Hancock's crew arrived to take Luffy to Amazon Lily, Ivankov declared that his duty to protect Luffy was now complete and decided to leave everything else to Jinbe, Hancock, and Law. Ivankov departed on the battleship and hoped to meet Luffy again."}, {"type": "paragraph", "text": "Returning to Momoiro Island, Ivankov encountered Sanji, who had been forced to endure time with the other okama thanks to being sent there by Kuma. Sanji tried to convince him of his connection to Luffy, but because of the badly-drawn wanted poster, Ivankov did not believe a word Sanji said . Ivankov declared that he would refuse to tell Sanji anything about Luffy since there was the slightest chance of Sanji being a spy for the Marines and the government."}, {"type": "paragraph", "text": "Sanji attempted to win a boat off Ivankov by defeating him in combat but failed. Later, Ivankov decided to tell Sanji about Luffy since the news of the Straw Hat captain had been made public, and handed Sanji the newspaper. When Sanji started reading the newspaper, Ivankov went to a communication room with Inazuma and spoke with Revolutionary Dragon through Den Den Mushi. Ivankov informed Dragon about the newspaper article concerning Luffy and commented on how much he is like his father. Ivankov then asked Dragon about what happened to Kuma as he is no longer the Kuma that Ivankov once knew, and added that Kuma even tried to kill him."}, {"type": "paragraph", "text": "Later, when Sanji was reading the article about Luffy going back to Marineford, Ivankov was looking over his shoulder inquiring what he was reading about. While eating in the dining hall, Ivankov once again asked Sanji about the article. Sanji would not answer much to the okama's annoyance. When Sanji inquired about the food they were eating, Ivankov proceeded to tell Sanji the enhancing properties of the \"Attack Cuisine\". Sanji then told Ivankov to give him the recipe, but the okama bluntly refused and said that Sanji needed to learn Newkama Kenpo in order to learn the recipe. Since Sanji refused to become an okama, Ivankov then gave Sanji a challenge to earn the recipe, to defeat the 99 masters of Newkama Kenpo while evading the island's inhabitants. If Sanji won, Ivankov would grant his wishes including a boat, but if he lost, there was no guarantee that Sanji would keep his manhood."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cd/Sanji_Argues_with_Ivankov.png/revision/latest/scale-to-width-down/210?cb=20131018152248", "caption": "Ivankov arguing with Sanji."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Saboady Arc", "level": 4, "content": [{"type": "paragraph", "text": "After two years passed and Sanji succeeded in conquering Ivankov's challenge, Ivankov gave Sanji a boat for him to return to Sabaody Archipelago."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Ivankov read about the Straw Hats' reunion in a newspaper."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Ivankov_Post_TS.png/revision/latest/scale-to-width-down/150?cb=20120914235222", "caption": "Ivankov after the timeskip."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "Ivankov and the other okamas prepared Kamabakka Kingdom for the upcoming meeting with the leaders of the Revolutionary Army."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Baltigo was destroyed by the Blackbeard Pirates, the Revolutionary Army moved their base of operations to Momoiro Island. While waiting for all the revolutionary commanders to arrive, Ivankov spoke with Dragon about the news of Luffy's exploits at Totto Land and was surprised that Sanji was a prince of the Germa Kingdom."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, the revolutionaries read some distressing news concerning Sabo and Ivankov refused to believe it."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Emporio Ivankov vs. Bellett", "elements": []}, {"text": "Emporio Ivankov, Luffy, and Inazuma vs. Impel Down Guards and Wolf Unit", "elements": []}, {"text": "Emporio Ivankov vs. Blue Gorillas", "elements": []}, {"text": "Emporio Ivankov vs. Sadi", "elements": []}, {"text": "Emporio Ivankov vs. Magellan", "elements": []}, {"text": "Emporio Ivankov, Luffy, and Jinbe vs. Marines", "elements": []}, {"text": "Emporio Ivankov vs. Bartholomew Kuma", "elements": []}, {"text": "Emporio Ivankov and Inazuma vs. Admiral Akainu", "elements": []}, {"text": "Emporio Ivankov vs. Sanji", "elements": []}]}], "images": []}, {"title": "Anime and Manga Influences", "level": 2, "content": [{"type": "paragraph", "text": "The inspiration for Ivankov and most of the Okama in Impel Down came from The Rocky Horror Picture Show. Specifically, Ivankov's look is based on Tim Curry's Dr. Frank-N-Furter role. His tendency to call people \"candies\" could be a reference to a line from the Rocky Horror song 'Sweet Transvestite', \"...he thought you were the candy man\"."}, {"type": "paragraph", "text": "Ivankov is also notably based on Norio Imamura, a real life Okama and a member of Mayumi Tanaka's acting troupe whom Oda met. In relation to Ivankov's large head and name, when Oda met with Imamura, he noted that Imamura had a face that looked like a boulder (iwa) and even mistook Imamura's name for Iwamura. When Imamura heard that there was a character based on him, he immediately auditioned for the voice role of Ivankov in the anime and got the part. Imamura was arrested on July 2010 for posting indecent pictures of himself on the internet. Because of this, he stepped down from voicing Ivankov, who is now voiced by Mitsuo Iwata.[1]"}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Tim_Curry_Ivankov.png/revision/latest/scale-to-width-down/210?cb=20130308145609", "caption": "Tim Curry from \"The Rocky Horror Picture Show\"."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Hell Wink", "level": 3, "content": [{"type": "paragraph", "text": "While in the manga, it was mentioned (Crocodile was blaming Ivankov for using his wink move while they fell from the sky) that Ivankov's Hell Wink was responsible for launching the entire Marine battleship from the frozen wave, while in the anime Luffy, with Jinbe, Buggy, Ivankov, and Crocodile himself did the act (however, in the anime Crocodile blames just Ivankov as in the manga)."}], "images": []}, {"title": "Meeting Sanji", "level": 3, "content": [{"type": "paragraph", "text": "In the anime Emporio Ivankov is seen returning to his kingdom, meeting Sanji. Sanji instantly falls in love with his female form, despite knowing \"she\" would not be interested in men. He attempts to ask about Luffy through gestures of romance. He snaps out of it when Ivankov turns back into a man, angering Sanji and crushing his hopes of meeting a real woman."}, {"type": "paragraph", "text": "Their fight is shown, with Sanji attacking Ivankov with Diable Jambe. Ivankov pretends to be defeated by this but then effortlessly overpowers Sanji, surprising his Okama followers. Iva then unleashes a barrage of Newkama Kenpo: 44 no Aesthe Ogi - Mudage Shori Ken, Death Wink, Hell Wink, and Galaxy Wink, leaving Sanji on the ground bloodied and beaten to an inch of his life. Ivankov then hands Sanji a newspaper since the news of Luffy has already been made public."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7a/Sanji_vs_ivankov.png/revision/latest/scale-to-width-down/210?cb=20130224084948", "caption": "Anime scene of Sanji vs Ivankov."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8e/SanjiVsNewKamaLand.png/revision/latest/scale-to-width-down/210?cb=20121006055053", "caption": "Iva watching over Sanji's trials."}]}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, an early concept of Ivankov is shown. In Oda's sketchbook, a drawing of Ivankov with a more realistic-looking face was found. He had a much thinner, longer face and black hair, but his facial make-up does not seem to have changed much."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Ivankov_Early_Concept.png/revision/latest/scale-to-width-down/210?cb=20130308150102", "caption": "Early Sketches of Ivankov."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "His surname could be derived from Italian, where the word Emporio roughly translates to \"store\" or \"general store\", or from Russian, \"Ivankov\" resembles Russian surname Ivanov. His given name, \"Ivankov\" is actually derived from Japanese. According to the SBS for volume 58, \"Ivankov\" (Which is written \"Iwankofu\") is derived from the Japanese word Iwa which means a \"boulder\" or \"stone\". The name comes from a nickname given to an actual crossdresser and friend of Oda, Norio Imamura."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise SP", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His jolly roger, a skull with two curved arrow-headed swords behind resembling horns, reveals on further inspection both the male and female sex symbol twice on it (the female sex symbol consists of the skull's eye socket and the sword's hilt while the male symbol is the arrow shaped sword blade and the same eye socket).", "elements": []}, {"text": "Iva refers to himself as a \"Newkama\", as opposed to an \"Okama\". This is a double pun made by mixing words. It basically goes \"Newhalf\" (Transsexual) + Okama (Crossdresser) = Newkama (Newcomer).", "elements": []}, {"text": "His appearance is heavily influenced by Tim Curry as, \"Dr. Frank N. Furter\" In the 1975 motion picture, \"The Rocky Horror Picture Show.\" The make-up is so thick on his face that it was able to withstand a direct attack from Magellan's Hydra.", "elements": []}, {"text": "In an SBS, Oda jokingly stated that Ivankov will rent out his hair to up to three people for 5000 a night. When he is moving and the people in his hair see an ocean, they are charged extra for an \"ocean view\". He also has a very comfortable room in his crown. There is also a \"Face Growth Hormone\" service for up to thirty people.", "elements": []}, {"text": "His prisoner number in Impel Down was 6582, which is the scientific gene identification number (Gene ID) for Homo sapiens, a.k.a. Humans.", "elements": []}, {"text": "In the 5th fan poll, Ivankov ranked 64th.", "elements": []}, {"text": "Iva is probably partially inspired from the character \"Emporio\" met in the 6th part of JoJo's Bizarre Adventure, Stone Ocean: Emporio is a boy born in prison, living in a hidden room unknown by the guards of said prison. He also helps the main character escape, as does Iva.", "elements": []}, {"text": "Due to the controversy involving his original voice actor, Norio Imamura, Ivankov's lines were re-recorded in the Blu-ray release with his second voice actor, Mitsuo Iwata.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7b/Emporio_Ivankov%27s_Jolly_Roger.png/revision/latest/scale-to-width-down/210?cb=20130307130508", "caption": "Ivankov's Jolly Roger."}]}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Transvestism – Wikipedia article about transvestism.", "elements": []}, {"text": "Okama – Wikipedia article about the term okama.", "elements": []}, {"text": "Drag Queen – Wikipedia article about drag queens.", "elements": []}, {"text": "The Rocky Horror Picture Show – Wikipedia article about the movie that inspired Ivankov and the New Kama.", "elements": []}]}], "images": []}]}