{"sections": [{"title": "Maria Napole", "level": 1, "content": [{"type": "paragraph", "text": "Maria Napole is a singer and is considered the pride of Fish-Man Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Napole is a mermaid with a rubenesque figure. She has large lips, curly dark hair, and a very long eel-like tail. She wears hoop earrings and a pearl necklace. She is seen singing in a dark colored dress, with thick tassels on the arms and bottom, that accentuates her cleavage."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/da/Maria_Napole_Full_Body.png/revision/latest/scale-to-width-down/130?cb=20150326223318", "caption": "Full-view of Maria."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Her personality is not known at this time."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "She is an extremely skilled and talented singer, being hailed as the number one diva on Fish-Man Island. Usopp and Nami were quickly entranced upon hearing her voice. Even Luffy was temporarily distracted by her voice and did not seem to mind waiting quietly for the food to arrive."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "She first appeared at Ryugu Palace, serenading the Straw Hat Pirates and royal family during the feast as they eat."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In her first appearance, Maria sang \"Dancing of Breams and Plaices\", which is a Japanese phrase that refers to extremely extravagant hospitality or feasts. The phrase stems from the legend of Urashima Tarō, who is rewarded with a visit to Ryugu Palace for rescuing a turtle. He is welcomed with a feast of very expensive and delicious fish such as sea bream and flounder.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 and Episode 569, Maria is introduced.", "elements": []}]}], "images": []}]}