{"sections": [{"title": "Kop", "level": 1, "content": [{"type": "paragraph", "text": "Kop is a member of the Franky Family."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kop is a very tall and thin man. He has a rectangular shaped face and a triangle shaped nose. He has a piece of orange cloth tied around his head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When he met Franky, Kop came to deeply respect him and called him \"Big Bro\" just like the other Franky Family members."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kop is seen with a sword, its not known how skilled he is. Like the rest of Franky Family he wears armor that can protect him against cannonballs."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He joined Zambai's group during some point of his life. Afterwards, Kop, along with the rest of Zambai's gang, was given a job by Franky and the whole gang was assimilated into the Franky Family."}], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Straw Hats arrived at Water 7, the Franky Family mugged Usopp and stole 200,000,000 from him. When Usopp entered their house to take the money back, the Franky Family beat him up and threw him out. Moments later, they fought against Luffy, Zoro, Sanji, and Chopper. Kop and the other Franky Family members were badly beaten. After Franky abducts Usopp later that night, the Franky Family tried to lure out the Straw Hats but caught the attention of CP9. CP9 then beat up Kop and the others before heading to Franky's hideout where they abducted Franky and Usopp. After CP9 left Water 7, Kop and the others turn to the Straw Hats for help."}], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Upon arriving at Enies Lobby, the Franky Family along with the Straw Hats and the Galley-La workers laid down their plan of attack. The Franky Family were supposed to move in and open the main gate. Once they reached the main gate, they were faced against the two giants who guarded it, Oimo and Kashi. Kop was on Zambai's team, which entered a fierce combat against the giants, and with the aid of Galley-La, they managed to bring them down, opened the gate and led the way for the incoming Straw Hat pirates. The team, riding the giant King Bulls, advanced towards the inner section of the island defeating foe after foe, until they reached the courthouse. There, they split into two groups in order to find the two separate switches that lower the bridge to the Tower of Justice. Zambai, Paulie and a handful of Franky Family members, including Kop, engaged the Three-Headed Chief Justice Baskerville in combat but were eventually subdued and apparently defeated."}, {"type": "paragraph", "text": "Upon the news of the Buster Call's issue reaching them, Kop and his comrades are already freed by Paulie and desperately tried to make a move and escape the island. When they reached the coast, the Franky Family come across the warship led by Vice Admiral Strawberry, who ordered his men to attack the criminals. The group got bombed and thrown off a cliff but were all saved at the last minute by Paulie's ropes. With the Straw Hat Pirates drawing the attention of the Marines, Zambai and Paulie lead their men aboard the sea train, thus escaping the burning island."}], "images": []}, {"title": "Post Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the Straw Hats party, Kop joined in alongside everyone else that participated in the Enies Lobby fight."}, {"type": "paragraph", "text": "Later, after discovering that Franky became a wanted man, the Franky Family tried to convince him to join the Straw Hat crew. When he would not listen to them, they stole his swim briefs and ran away. When Franky found them, he managed to defeat them all easily, including Kop."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is revealed in One Piece Yellow: Grand Elements.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 325 and Episode 231, Kop makes his debut.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements, Kop's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 433 and Episode 315, The Straw Hats, Franky Family, and Galley-La celebrate by having a pool party.", "elements": []}]}], "images": []}]}