{"sections": [{"title": "Kasagoba", "level": 1, "content": [{"type": "paragraph", "text": "Kasagoba is a marbled rockfish fish-man and was a member of the now disbanded New Fish-Man Pirates prior to their downfall. In the anime, he is named Kasagon (カサゴン, Kasagon)."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a stocky, beige fish-man with brown spots on his thick neck. He has pink trailings with yellow on the tips on his head and neck. He also appears to wear a white tank top and vertically striped pants. He also has a very large grin."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the New Fish-Man Pirates, Kasagoba most likely has a strong hatred for humans."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a fish-man, he was born with natural strength ten times that of a normal human, which is doubled underwater. However he is easily knocked out by Luffy's single punch."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wields a pike, although he was not shown using it in combat."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kasagoba first appeared alongside Hammond and Hyouzou, riding on sea beasts right outside of Fish-Man Island. They intercepted the Straw Hat Pirates and gave the crew two choices; join the New Fish-Man Pirates or be crushed before being able to enter the island. After Luffy rejected the invitation, the Straw Hats used the their ship's Coup de Burst to launch themselves into the island. Kasagoba was surprised by the ship's unexpected maneuver. After wondering what to do next, they returned to the Fish-Man District to report to their captain."}, {"type": "paragraph", "text": "Kasagoba, alongside Hammond and Hyouzou, later went to Mermaid Cove in another attempt to capture Luffy, but they were easily repelled. The attack knocked out Hammond and Kasagoba, but Hyouzou was able to block it and remained uninjured. After the Straw Hats left the cove, Hyouzou carried his two unconscious companions away."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Kasagon_Defeated_By_Luffy.png/revision/latest/scale-to-width-down/210?cb=20111211153951", "caption": "Kasagoba is defeated by Luffy"}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kasagoba, Hammond and Hyouzou vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name comes from kasago (カサゴ, kasago), the Japanese name for Scorpaeniformes.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 607 and Episode 527, Kasagoba makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 216), His name is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 527, His name and position are revealed.", "elements": []}]}], "images": []}]}