{"sections": [{"title": "Mizuta Madaisuki", "level": 1, "content": [{"type": "paragraph", "text": "Mizuta Madaisuki was the older of the two Mizuta Twins, identical twin brothers of the Rumbar Pirates. He and his brother, Mawaritosuki, were identified by Oda in a SBS question. A fan asked why one of the Rumbar Pirates that died singing had a sword in his skull. Oda explained that this was because they were two identical pirates who died two separate ways."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Madaisuki wears polka-dot shirt with blue dots, blue pants, and sandals. He carries around a sword on his back. He also has brown hair with a front part that is long, goes up, and hangs down. As an identical twin, he and Mawaritosuki share all of the same physical characteristics, except for differences in clothing. Madaisuki has more dots on his shirt than Mawaritosuki."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/Mizuta_Madaisuki_Full_Body.png/revision/latest/scale-to-width-down/120?cb=20131207010040", "caption": "Full-body view of Mizuta Madaisuki."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like the rest of their crew, Madaisuki was quite fun-loving and jolly. He enjoyed playing music and, in particular, playing for Laboon. He was also quite enthusiastic and willing to learn, since he was a big fan of Brook and his fighting style."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Rumbar Pirates, Madaisuki was a skilled musician and fighter. It is unknown what specific musical talent Madaisuki possessed. Both he and his brother were also skilled swordsmen. Madaisuki admired Brook’s fencing style and wished to learn it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Entering the Grand Line", "level": 3, "content": [{"type": "paragraph", "text": "A long time ago, the Mizuta Twins joined the Rumbar Pirates. They, along with the rest of their crew, met Laboon, a young whale who got separated from the rest of his pod and followed the ship due to loneliness. The twins journeyed through the West Blue with their ship mates, fighting other pirates and singing music. Eventually, the crew came upon Reverse Mountain, where they met Crocus. After staying at the crossing for three months and having fun, they decided to venture out into the Grand Line, leaving Laboon behind with Crocus."}], "images": []}, {"title": "A Sad End", "level": 3, "content": [{"type": "paragraph", "text": "After visiting a forested island, the captain, Yorki, became very ill. Madaisuki, with the rest of the crew, then witnessed their captain leave to prevent the disease from spreading."}, {"type": "paragraph", "text": "At some point, the Rumbar Pirates engaged in a fierce battle with another pirate crew that left them devastated. Madaisuki was killed by being stabbed in the skull by a sword after sustaining multiple injuries to the abdomen. His surviving brother, Mawaritosuki, eventually succumbed to poison with the rest of the surviving crew members while singing Binks' Sake."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, the skeletal remains of the older of the two brothers had a sword piercing his skull along with the another blade sticking out of his back. Also in the manga, his shirt is torn and his ribcage is exposed."}, {"type": "paragraph", "text": "In the anime, his remains only have swords sticking out of his body, and his clothes remain intact enough to cover his ribcage. This was all done to censor the gruesome wound, which would be deemed inappropriate for younger audience."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "As shown above, Madaisuki seemed to have strong hair roots like Brook, for his hair remained even after turning into a skeleton.", "elements": []}, {"text": "His name is a pun as mizutama daisuki means \"I love dots\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 50 Chapter 487 and Episode 380, The skeletal remains polka dotted shirt wearing Rumbar pirate is seen with sword in his skull.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 50 Chapter 488 and Episode 380, A polka dotted shirt wearing Rumbar pirate is seen singing before succumbing to poison.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 53, Fan question: Why does the pirate who died singing have a sword in his skull?", "elements": []}, {"text": "↑  One Piece Anime — Episode 380, The skeletal remains of Mizuta Madaisuki has only swords sticking out of his back.", "elements": []}]}], "images": []}]}