{"sections": [{"title": "Pekoms", "level": 1, "content": [{"type": "paragraph", "text": "Pekoms is a combatant of the Big Mom Pirates and a lion mink. He is partnered with Tamago, and both are responsible for collecting the monthly payment of sweets from Fish-Man Island in exchange for Big Mom's protection."}, {"type": "paragraph", "text": "Pekoms originally sailed the seas under Pedro as a member of the Nox Pirates before he and some of the crew joined the Big Mom Pirates. During the Whole Cake Island Arc, he betrayed the crew in an attempt to help Monkey D. Luffy escape Totto Land and honor Pedro's self-sacrifice."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pekoms is a mink resembling a humanoid maned lion. He is relatively tall, as he appears about one head taller than the 5'11 Sanji. Because of his beady eyes, people often consider him to be cute when he removes his sunglasses, even when threatening someone. He often holds his fists up in a confrontational manner and hangs his tongue out of the side of his mouth. Despite having large paws for hands, his feet are evidently small enough to fit into the small boots he wears."}, {"type": "paragraph", "text": "He wears a pink suit, black sunglasses, a silver earring on his left ear, a sword on his right hip, and wears black high-heeled boots with white ruffled brims. He also wears a salmon-colored dress shirt underneath his suit jacket."}, {"type": "paragraph", "text": "Five years ago, he wore the same outfit as his current appearance but with a white inner shirt."}, {"type": "paragraph", "text": "When disguising himself as \"Nazoms\", he donned a dark version of his outfit and wore a luchador mask over his head, which has a star between two small horns depicted at the front."}, {"type": "paragraph", "text": "When in his Sulong form, Pekoms' mane and tail tassel grow tremendously in size, and his body grows thicker and more muscular to give him a more feral appearance."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pekoms has a short temper, as seen as when he was in a fit of rage when he was first introduced. He lifts up his sunglasses while threatening people, but because of his \"cute\" beady eyes, he does not look frightening. Like many other members of the crew, he seems terrified of Big Mom. He also has a liking for chocolate, and is willing to admit that to people."}, {"type": "paragraph", "text": "He carries around a list of bounties on wanted people such as pirates and takes note of the people he has seen on bounty posters, as seen when he took the time to look up Caribou even when the latter was about to fire at him with a Gatling gun. He acknowledges that merely possessing a Logia-type Devil Fruit does not make the user invincible, commenting that anyone who thinks so will have a swift downfall. He has some level of pride in his own Devil Fruit abilities, as he expressed mild disappointment that Luffy did not react to his fruit's defensive capabilities being likened to diamond."}, {"type": "paragraph", "text": "He also has a strong attachment to his former home as shown when he offered to let the Straw Hats go when he found out they saved the Mink Tribe from Jack. He was even willing to lie to Big Mom to help them. He was also willing to capture his own crewmate Charlotte Brûlée in order to honor Pedro's sacrifice for the Straw Hats. According to Wanda, he used to be known as a delinquent on Zou. According to Jinbe, he has a strong sense of duty, as he refused to aid Bege in his scheme to kill Big Mom."}, {"type": "paragraph", "text": "While grumpy with a ferocious temper, Pekoms genuinely cares for the people he is close to, as shown when he broke down crying when Pedro was almost killed by Big Mom's life span absorption powers."}, {"type": "paragraph", "text": "Like several members of the Mink Tribe, Pekoms has a quirk related to the behavior of the animal he resembles. In his case, he adds a roar (\"gao\") to the end of most of his sentences."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Pekoms is deeply afraid of Big Mom, and fears her so much that he hesitated in answering a phone call from her. However, when the Yonko was about to take Pedro's life, Pekoms begged her to spare his friend, and so she did."}, {"type": "paragraph", "text": "Pekoms apparently respects Tamago as his crewmate and partner, as the two of them get along relatively well. They are tasked with collecting the monthly candy tribute from Fish-Man Island for Big Mom. Despite their partnership, Tamago has no regrets over abandoning Pekoms on Zou, saying Capone Bege did the right thing. However, after learning that Pekoms survived, Tamago hoped that he could get a pardon for him."}, {"type": "paragraph", "text": "Because of his devotion to the Big Mom Pirates, Pekoms refused Bege's offer to take part in his scheme to assassinate Big Mom."}, {"type": "paragraph", "text": "He also did not disclose Big Mom's scheme to assassinate the Vinsmoke Family including Sanji to the Straw Hats because of his loyalty."}, {"type": "paragraph", "text": "However, after Pedro sacrificed himself for the Straw Hats, Pekoms decided to betray the Big Mom Pirates in order to assist Luffy. The crew showed no mercy to Pekoms for his betrayal and attempted to brutally gouge out his eyes to disable his Sulong form."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Capone Bege", "level": 4, "content": [{"type": "paragraph", "text": "Pekoms addressed Bege as a newcomer when the two were sent together on Zou. It seems like Bege does not care much about Pekoms as he shot him in the back after seeing that Pekoms is willing to let his personal feelings get in the way of their mission. Bege also told him that they no longer need someone like him, leaving him behind without a second thought. While recovering from his wounds, Pekoms told the Straw Hats that he intends to settle things with Bege once he fully recovered. Upon returning to Whole Cake Island, he was captured by Bege's crew where Bege offered Pekoms to join him in his schemes to assassinate Big Mom. Pekoms refused the offer and, to prevent his plans being leaked, Bege ordered his men to put Pekoms in chains and took him to a cliff over shark infested waters, where he was shot over the edge by Bege."}], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "Due to Jack destroying his hometown, Pekoms holds deep resentment for the pirate."}], "images": []}, {"title": "Mink Tribe", "level": 3, "content": [{"type": "paragraph", "text": "Pekoms has an amiable relationship with his fellow minks as he was terribly shocked when he found his homeland in ruins and overjoyed when he found his fellow minks alive and well. The minks, in turn, welcomed him back with open arms and took care of him after Capone Bege wounded him. "}], "images": []}, {"title": "Sworn Brothers", "level": 4, "content": [{"type": "paragraph", "text": "He was extremely close with his sworn brothers Pedro and Zepo, having once traveled together with them in search for the poneglyphs. After their defeat in Totto Land, Pekoms was devastated when Zepo was killed by Big Mom and tearfully begged the Yonko for Pedro to be spared, allowing him to leave with his life. As the Sanji Retrieval Team was departing Zou, Nekomamushi said that Pedro was the only one who could keep Pekoms in line and Pekoms seemed rather uneasy of Pedro tagging along. However, Pekoms still cared a great deal about Pedro, as after Pedro seemingly sacrificed himself to give the Straw Hats a chance to escape, Pekoms was crying non-stop as he grieved over his presumed death. Pekoms' respect for Pedro is so great that he is willing to betray the Big Mom Pirates by helping Luffy escape from Totto Land to honor Pedro's sacrifice. His bond with Pedro was so strong that Pedro was the only person who could calm Pekoms' rampage in his Sulong Form."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/82/Sulong_Pekoms_and_Pedro.png/revision/latest/scale-to-width-down/210?cb=20190210035219", "caption": "Pedro was the only person who could calm Pekoms in his Sulong form."}]}, {"title": "Family", "level": 4, "content": [{"type": "paragraph", "text": "Pekom's greatly cares about the safety of his family members, in particular, his parents. His father is a monkey mink and his mother is a bear mink. When he arrived back on Zou and saw the city in ruins, he exclaimed that his heart nearly stopped."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island", "level": 4, "content": [{"type": "paragraph", "text": "In spite of Pekoms' tendency to issue obvious threats, the citizens of Fish-Man Island consider him to be \"cute\" rather than intimidating. Pekoms did not show any concern with the civil war that Fish-Man Island had to contend with. When the Minister of the Left explained to him about how the Candy Factory was damaged during the coup of the New Fish-Man Pirates, Pekoms just states that the Big Mom Pirates are not responsible for the civil war and expects the citizens to fulfill their payment. In spite of Pekoms' coldness towards Fish-Man Island, the citizens showed genuine concern for him when he was gunned by Caribou only to realize that his status as a fighter for one of the Yonko is well-deserved once he retaliated and quickly defeated Caribou."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "When meeting Luffy, Zoro, and Sanji on Fish-Man Island, he was angered by the Straw Hats eating his captain's candy. Later, when he encountered them near Dressrosa, he and the rest of his crew attacked them in an effort to capture Caesar Clown. During the failed attack, the Straw Hats escaped, but the Big Mom Pirates heard of their destination and followed them to Zou."}, {"type": "paragraph", "text": "When he saw the results of Jack and the Beasts Pirates' attack, he suspected the Straw Hats. However, after hearing the full story, he thanked them and offered to lie to Big Mom to let them escape in exchange for Caesar Clown, despite Bege's protests. Upon meeting Luffy again, Pekoms did not hesitate to explain the circumstances of Sanji's arranged marriage."}, {"type": "paragraph", "text": "Despite his gratitude towards the Straw Hats, he still considers them enemies due to Luffy challenging Big Mom, and did not take it kindly when Luffy said that he felt Big Mom should be his underling, not the other way around. He was also annoyed that Luffy ignored his objections to taking him with him back to Big Mom's base. His annoyance with Luffy was shown further when Luffy was not impressed with his diamond-like defense and when Luffy ridiculously carried him like a backpack, calling him the 'Worst Savior Ever'."}, {"type": "paragraph", "text": "Nevertheless, Luffy considers Pekoms a friend, going so far as wanting to punch Bege for attempting to kill him. After Pedro sacrificed himself to help the Straw Hats, Pekoms chose to honor his wishes by assisting them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Pekoms_Thanks_the_Straw_Hats.png/revision/latest/scale-to-width-down/210?cb=20161120004035", "caption": "Pekoms shows his gratitude towards the Straw Hats for helping the Mink Tribe."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He, along with Tamago, is responsible for collecting the candy payments Big Mom demands from the islands under her protection."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Pekoms has proven himself to be extremely agile as shown when he dodged the slash of Caribou's scythe. Pekoms instantly disappeared like a Soru user and retaliated just as quickly. He has extreme superhuman strength as he knocked out Caribou, who is a new super rookie with a bounty of 210,000,000, with a single Haki enhanced punch, breaking the latter's weapon in the same instant. The tremendous force of his punch sent Caribou flying back in the process."}, {"type": "paragraph", "text": "As a member of the Mink Tribe, Pekoms is a born warrior who can use Electro."}], "images": []}, {"title": "Sulong Form", "level": 4, "content": [{"type": "paragraph", "text": "As a mink, Pekoms is capable of transforming into a Sulong form by gazing at the full moon. In his Sulong form, his natural fighting abilities are significantly increased. However, this increase in power did not prevent Pekoms from being overwhelmed by an army of several thousand Big Mom Pirates. He also has difficulty controlling his Sulong form, with only the words of Pedro being able to break him out of his mindless ferocious state."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Pekoms%27_Sulong_Transformation.png/revision/latest/scale-to-width-down/210?cb=20190210034701", "caption": "Pekoms' mid-transformation."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Pekoms ate the Kame Kame no Mi, a Zoan-type fruit which grants him the ability to turn into a turtle, revealed when he transformed and hid within the shell in order to block an attack by Caribou. The shell is very resilient, allegedly hard as diamond, as it took many bullets from a Gatling gun and did not show any signs of damage afterwards. It also allowed him to survive the majority of Bege's assault to his back, showing his quick reflexes to transform in time. As a side effect of retreating into his shell, Pekoms' clothes slide out his shell because there are no limbs holding them in; he has to manually slip his limbs back out and readjust his clothes when reverting to his natural form."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Kame_Kame_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20160120235204", "caption": "Pekoms' defensive turtle shell."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Pekoms is skilled in Busoshoku Haki, which he used to strike Caribou, a Logia user, incapacitating him in one hit."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Pekoms possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries a sword, although he has not been seen using it. When he betrayed his crew in order to help Luffy escape from Cacao Island, he briefly wielded a flintlock but did not fire it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Pekoms was born on Zou. During his younger years, he was an infamous delinquent."}, {"type": "paragraph", "text": "He once sailed the seas as a member of the Nox Pirates under Pedro 13 years before the start of the series. They were initially explorers in search of a poneglyph, but their activities gained the attention of the World Government and earned them bounties. The crew became more injured and discouraged as the years went on, and Pekoms led everyone except Pedro and Zepo in a withdrawal from the crew, as they could no longer continue on. Pekoms' group arrived at Big Mom's territory, where they were saved, and they joined the Big Mom Pirates."}, {"type": "paragraph", "text": "Ten years after they had first started sailing, Pekoms reunited with Pedro and Zepo after they infiltrated Totto Land. Pekoms later watched as Big Mom passed judgement on Pedro and Zepo after the pair were defeated and captured. Zepo was forced to spin a roulette wheel to determine how much lifespan they would lose, which resulted in Zepo's death. With a considerable amount of lifespan left to be taken from Pedro, Pekoms tearfully begged Big Mom for mercy, and she obliged by cutting ten years off Pedro's sentence, allowing Pekoms' former captain to survive."}, {"type": "paragraph", "text": "As a member of the Big Mom Pirates, he was partners with Tamago for many years."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "On Fish-Man Island, Pekoms threatened the citizens about their candy tribute, but seemingly failed to realize that the citizens were more enamored than frightened due to his cute beady eyes."}, {"type": "paragraph", "text": "After hearing about Monkey D. Luffy eating the candy, he called Bobbin and told him about the situation. Pekoms then talked to Luffy about the candy, but Tamago interrupted him. When Big Mom called Fish-Man Island, Pekoms was too scared to answer the Den Den Mushi and was deeply shocked that Luffy answered the call himself and deliberately infuriated Big Mom."}, {"type": "paragraph", "text": "Before leaving Fish-Man Island with the island's treasure, he was attacked by Caribou who wanted his treasure back, as he stole it first. Caribou first attacked with a gatling gun from his swamp body, but Pekoms turned into a turtle and used his natural shield to protect himself. After Pekoms reverted to his normal form, Caribou tried to slice him with a scythe, but Pekoms defeated him with a single punch, breaking the scythe and hitting Caribou. After commenting that a Logia Devil Fruit user's belief in their own invincibility is also their downfall, he left the island with Tamago."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Pekoms_Hits_Caribou.png/revision/latest/scale-to-width-down/210?cb=20171109160746", "caption": "Pekoms strikes Caribou with a Busoshoku Haki empowered punch."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "Pekoms and Tamago watched Caesar Clown's broadcast from Punk Hazard via video Den Den Mushi about his weapon of mass destruction. Pekoms was surprised that Law, Luffy, Nico Robin, and Smoker were captured by Caesar. After watching Caesar's defeat, he roared as Tamago told him to report the incident to Big Mom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Brokers_Tamago_and_Pekoms.png/revision/latest/scale-to-width-down/210?cb=20131010013714", "caption": "Tamago and Pekoms watching Caesar's broadcast of his weapon."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later on, Pekoms, Tamago, and other members of Big Mom Pirates pursued the Thousand Sunny while those on board (Sanji, Nami, Tony Tony Chopper, Brook, and Kozuki Momonosuke) were attempting to return to Dressrosa. Pekoms revealed that their target was Caesar, and when he confirmed Caesar was aboard the Sunny, he was prepared to attack in order to claim him."}, {"type": "paragraph", "text": "During the pursuit, Pekoms, Tamago, and Capone Bege were surprised that the \"Curly Hat Pirates\" (those on board the Sunny, under Sanji's de facto captaincy) were able to successfully fight back and escape."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Two days before Luffy's group reached Zou, Big Mom's ship arrived at Zou after following the Curly Hat Pirates. Nami revealed that the Big Mom Pirates overheard the name of the Curly Hat Pirates' destination after they left Dressrosa. Following this, Pekoms informed Big Mom that he would pursue them and retrieve Caesar, because Zou is his homeland and he knew how to reach the island."}, {"type": "paragraph", "text": "When Pekoms, accompanied by Capone Bege, disembarked, he was shocked to find his homeland in ruins in the aftermath of Jack's attack. However, he was overjoyed to find that his fellow minks were safe, and he was informed that the Straw Hats were the ones who treated them and thereby saved their lives. In gratitude, Pekoms agreed to forego an unnamed mission which would have proved disastrous for the Straw Hat crew, as long as the Curly Hat Pirates agreed to hand over Caesar. Annoyed that Pekoms was letting his emotions overrule their mission, Bege shot Pekoms in the back. Although Bege severely wounded the unsuspecting Pekoms, Pekoms was still able to activate his Devil Fruit and block about half of the attack's damage."}, {"type": "paragraph", "text": "When Nekomamushi arrived and questioned why Pekoms was injured, Bege was forced to retreat, leaving Pekoms behind. Pekoms was then taken in by Nekomamushi."}, {"type": "paragraph", "text": "When Luffy and his group arrived on Zou, Luffy went to see him to question him about Sanji's arranged marriage to Charlotte Pudding. Sharing his knowledge of the Underworld, Pekoms revealed to Luffy and Nami that the marriage was arranged by Big Mom and Sanji's father, and that the Vinsmoke Family is a family of notorious Underworld killers."}, {"type": "paragraph", "text": "Pekoms further proceeded to tell them of the organization known as Germa 66, revealing that it was run by the Vinsmokes, much to Nami's disbelief. Luffy then interjected, stating that while he did not care whether or not Sanji got married, he would not allow the marriage to force the Straw Hats into becoming Big Mom's underlings. He proposed that the Big Mom Pirates work under him instead. Outraged at this statement, Pekoms reminded Luffy of Big Mom's power and status, explaining why Sanji could not refuse the wedding invitation. If he did, he would be sent a box containing the decapitated head of someone close to him. Pekoms went on to explain that the Straw Hats would not have to become Big Mom's subordinates, because the wedding's purpose was political, designed to bring together the Vinsmoke and Charlotte bloodlines. However, once the marriage was finalized, Sanji would automatically cease to be a member of the Straw Hat Pirates. Pekoms finally revealed that he would return to the Big Mom Pirates once he had sufficiently recovered. Luffy then told Pekoms to bring him to Sanji, ignoring Pekoms' objections to bringing someone intent on undermining the wedding."}, {"type": "paragraph", "text": "During Jack's second attack on Zou, the house Pekoms was resting in collapsed. When Luffy checked up on him, Pekoms revealed that he used his Devil Fruit powers to save himself from further injury. Luffy then carried Pekoms on his back and departed Zou with the Sanji Retrieval Team. Pekoms was deeply shocked when Luffy jumped off the giant elephant with his party in tow."}, {"type": "paragraph", "text": "Pekoms rested on the Thousand Sunny's deck after the fall as they sailed towards Whole Cake Island while Carrot revealed herself, having sneaked onboard the ship."}, {"type": "paragraph", "text": "The Sanji Retrieval Team learned from a newspaper about the Blackbeard Pirates' attack on the Revolutionary Army's headquarters on Baltigo, surprising everyone on board. After passing through a storm, Luffy presented his cooking, which the group did not enjoy in the least. Luffy then admitted that he used up all the food they had and the group found themselves in a food shortage crisis."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Bege_Shoots_Pekoms.png/revision/latest/scale-to-width-down/210?cb=20161120004425", "caption": "Pekoms is shot in the back by Bege."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a1/Luffy_Throttles_Pekoms.png/revision/latest/scale-to-width-down/210?cb=20161127203949", "caption": "Luffy forces Pekoms to bring him to Big Mom's tea party."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/89/Sanji_Rescue_Team_Heads_Out.png/revision/latest/scale-to-width-down/210?cb=20170529031615", "caption": "Pekoms is tied to Luffy's back as the Sanji retrieval mission begins."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Random_Curry.png/revision/latest/scale-to-width-down/210?cb=20170305182728", "caption": "The Sanji Retrieval Team is forced to eat Luffy's \"Random Curry.\""}]}, {"title": "Marine Rookie Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the team ran out of food, they began to get very hungry. They spotted Fron Island in the distance and prepared to look for food there, but Pekoms warned them that it was home to a Marine base. He and Pedro stayed behind to guard the Thousand Sunny while the others traveled to the island on the Shark Submerge III."}, {"type": "paragraph", "text": "A few hours later, the others returned to the Sunny with a massive food stockpile, but Pekoms and Pedro ate most of it in 10 minutes due to being left starving on the ship."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "A few days later, the group was famished from the lack of food and overheated as they passed through boiling waters. They were saved from starvation when Luffy managed to catch a gigantic fish. As they entered Big Mom's territory, Pekoms informed the group about warning waves that are sent to ships entering Big Mom's waters. When a ship approached the Sunny, Pekoms and the Sanji Retrieval Team were shocked to find that the ship belonged to Germa 66."}, {"type": "paragraph", "text": "The crew met Sanji's youngest brother, and tensions grew between them until Sanji's sister arrived and healed Luffy. Pekoms told the group that the reason Big Mom wanted Germa 66 as her allies were because of their advanced technologies. When Yonji asked Pekoms why he was with the Straw Hats, Pekoms replied that he had his own reasons. The two groups then parted ways."}, {"type": "paragraph", "text": "The group later docked at Cacao Island, an island with buildings made of chocolate. While speaking to a guard, Pekoms claimed to have captured the Thousand Sunny and told him not to report to Big Mom, also claiming to have a surprise for her. Pekoms then told the crew that it would take a day to reach Whole Cake Island. When Carrot noticed people from different races living on the island, Pekoms explained Big Mom's dream of creating a nation where people from all races can live together. He also revealed that Cacao Island is one of 34 islands that surround Whole Cake Island and they are collectively known as Totto Land. He decided to remain with the ship because he would be easily recognized but asked for a chocolate souvenir. After hearing that Luffy and Chopper went ahead to explore the island, Pekoms was furious when they quickly got themselves in trouble."}, {"type": "paragraph", "text": "Before the Sanji Retrieval Team returned to the ship, Pekoms was abducted by the Fire Tank Pirates, but left behind a message telling Luffy's team to turn back. Bege offered Pekoms a chance to become an accomplice in his scheme to assasinate Big Mom, but Pekoms refused. At the northeastern coast of Whole Cake Island, Pekoms was chained and taken to the edge of a cliff by Bege and his crew. Right after Pekoms warned Bege that underestimating Big Mom would be his downfall, Bege shot Pekoms, causing him to fall into the shark-infested waters below. However, before Pekoms met his demise, he was rescued by one of Sun Pirates and informed Jinbe of Bege's treachery."}, {"type": "paragraph", "text": "At the eastern side of Whole Cake Island, Pekoms was being watched by Charlotte Praline and the Sun Pirates. Pekoms asked if Jinbe reported Bege's treachery to Big Mom and Aladine responded by saying he did. However, Pekoms was suspicious with how they were acting, but Jinbe's crew insisted that he rest."}, {"type": "paragraph", "text": "When the wedding started, the Sun Pirates tied up Pekoms to a rock as they prepared to depart Whole Cake Island. He later escaped from his restraints and returned to Sweet City. After the Whole Cake Chateau collapsed, Pekoms informed the Charlotte Family about the Sun Pirates' departure before being informed by them about the events that transpired at the wedding. After hearing about how Pedro saved the Straw Hats, Pekoms grieved over Pedro's presumed death. Pekoms was later surprised to hear that the territorial sea slugs went missing."}, {"type": "paragraph", "text": "Wanting to honor Pedro's wishes, Pekoms decided to aid the Straw Hats in their escape, and so he found and captured Charlotte Brûlée in order to help Luffy escape from the Mirro-World. Disguising himself as \"Nazoms\", he approached Luffy after the Straw Hat captain defeated Charlotte Katakuri and told him of his intentions. Pekoms took Luffy and Brûlée to the mirror leading to Cacao Island, saying he would go on a rampage in his Sulong form even though he would not have Pedro to get him out of it. Pekoms carried Brûlée in front of him, and sandwiched Luffy between himself and Brûlée in order to hide the Straw Hat. He came out to Cacao Island and held Brûlée hostage with a flintlock as he activated his Sulong form. However, Charlotte Oven heated up the flintlock, taking Pekoms aback and causing him to expose Luffy. Despite his increased abilities, Pekoms was quickly overwhelmed by his crewmates, who decided to gouge out his eyes to deactivate his Sulong form. However, the skirmish was then interrupted when Germa 66 arrived at Cacao Island and attacked the Big Mom Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Reiju_Visits_the_Straw_Hats.png/revision/latest/scale-to-width-down/210?cb=20170502061014", "caption": "The Sanji Retrieval Team encounters Sanji's sister, Reiju."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Bege_Shoots_Pekoms_Off_a_Cliff.png/revision/latest/scale-to-width-down/210?cb=20170702022533", "caption": "Bege shoots Pekoms into the ocean."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Sun_Pirates_Tend_to_Pekoms.png/revision/latest/scale-to-width-down/210?cb=20180304020838", "caption": "Pekoms' injuries are treated by the Sun Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3c/Pekoms%27_Cacao_Island_Offensive.png/revision/latest/scale-to-width-down/210?cb=20190210034804", "caption": "Pekoms goes against his own crewmates to help Luffy escape from Cacao Island."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Pekoms vs. Caribou", "elements": []}, {"text": "Pekoms, Monkey D. Luffy, and Sanji vs. Oven's army", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Pekoms vs. Charlotte Decuplets", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "As Sanji and Luffy were fleeing through the air in the manga during their escape from Cacao Island, Pekoms was subdued when the Big Mom Pirates restrained him and attacked him while he was down. In the anime, the Big Mom Pirates do not pin Pekoms to the ground and he fights the male decuplets as they were attacking Sanji in the air. After he fends off the males, the female decuplets attack him but are beaten back as well. However, Pekoms loses control and slams Sanji into the roof of a building, but manages to regain control of himself afterwards and tells Sanji to flee with Luffy. Pekoms continues attacking his former allies until Raisin strikes him. Pekoms then loses consciousness after the Big Mom Pirates pierce him with spears."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name may come from pekopeko (ペコペコ, pekopeko), which means to \"be very hungry\" in Japanese, which follows the eating/food themed names of the Big Mom Pirates.", "elements": []}, {"text": "Pekoms' turtle Zoan combined with his appearance makes him resemble a tarasque, a French mythical creature with a leonine face and a turtle shell among other animal features.", "elements": []}, {"text": "Pekoms references the Mock Turtle from Lewis Carroll's most famous novel Alice's Adventures in Wonderland.", "elements": []}, {"text": "He is the only mink confirmed to have eaten a Devil Fruit.", "elements": []}, {"text": "Prior to arriving in Totto Land, Luffy tended to say Pekoms' name wrong, calling him Pekomamushi, possibly due to Nekomamushi's similar sounding name.", "elements": []}, {"text": "Pekoms is the first Zoan-type introduced after the time-skip.", "elements": []}, {"text": "So far, Pekoms is the only character who has two animal themes (lion and turtle).", "elements": []}]}], "images": []}]}