{"sections": [{"title": "Bobbin", "level": 1, "content": [{"type": "paragraph", "text": "\"Sweeper\" Bobbin is a bishop-ranked combatant of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bobbin is a rather short yet broad individual with a wide grin and thick, red lips who wears a white mask covering a portion of his face. He has rather strange body proportions, as his shoulders appears to be higher than his chin and his arms are twice the length of his legs. His mask also features dark glasses, which obscure his eyes. He carries a sword larger than himself which is slung over his back and a black hat with a big white tuft sticking out of it. He also sports purple and black pinstriped pants with a large brown belt holding them up, a pink shirt, brown gloves, dark boots, and a long light blue cape which is also bigger than Bobbin himself."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bobbin seems to be quite ruthless, as shown when he reported to Big Mom after burning down an entire country and seemed pleased with himself for doing so. Furthermore, he is very loyal to his captain and shows absolutely no concern for islands that cannot pay her tribute. He even asked Linlin if she also wanted to burn Fish-Man Island when he heard that they could not deliver her any candy for quite a while."}, {"type": "paragraph", "text": "He also seems to be very confident in his strength, choosing to pursue Sanji on his own without the aid of his crewmates."}, {"type": "paragraph", "text": "He also seems to be gluttonous and disrespectful of other people's property, as seen when he took a piece of meat from a basket that Sanji was carrying."}, {"type": "paragraph", "text": "Bobbin has a habit of bobbing his head side to side when talking. Bobbin also has a signature laugh, starting with \"Bo\", continuing with \"yoyo\", and ending with an \"n\" (\"Boyoyon\")."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Unlike most of the other members of the crew, Bobbin does not seem to fear his captain in the slightest as shown when he came up to her upon his return and had a friendly chat with her. He is very considerate to Big Mom as he gladly delivers sweets to her from other islands."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Sanji Retrieval Team", "level": 4, "content": [{"type": "paragraph", "text": "Bobbin became an enemy of the Straw Hats when Luffy defeated Charlotte Cracker. Bobbin gathered with the rest of his crewmates and attacked Luffy before capturing him and Nami. He later tried to steal food from Sanji only to be viciously attacked by the latter. Bobbin was angered by Sanji's actions and attempted to pursue him before he was ambushed by Vito."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Bobbin was sent to burn down an island that failed to make its monthly tribute, a task in which he succeeded alongside several comrades. He has a great reputation, as Germa Kingdom princes Vinsmoke Niji and Vinsmoke Yonji recognized him as a heavyweight within the Big Mom Pirates, which is notable considering the vast size and strength of the crew. Bobbin was able to help bring down Luffy (while in his Gear Second form) during the Big Mom Pirates' attack on him and Nami."}, {"type": "paragraph", "text": "However, Bobbin can let his guard down easily, like when he took the meat out of Sanji's bento box, the cook was able to swiftly smash Bobbin into a wall with one kick, leaving Bobbin shocked and injured on the floor. This was seen again after Bobbin left the castle to chase Sanji. During the pursuit, he was ambushed and shot by Vito."}], "images": []}, {"title": "Hypnosis", "level": 3, "content": [{"type": "paragraph", "text": "Bobbin has an ability that allows him to emanate rays that put people to sleep by bobbing his head."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/Bobbin%27s_Hypnotic_Powers.png/revision/latest/scale-to-width-down/210?cb=20171022184444", "caption": "Bobbin putting someone to sleep."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wields a sword that is about twice his size. It is unknown how skilled he is with it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Bobbin returned to Whole Cake Island after burning down a country that had failed to pay its candy tribute. He informed Big Mom that islands that cannot pay must be destroyed and offered to burn down Fish-Man Island, which had not paid its tribute either."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Monkey D. Luffy defeated Charlotte Cracker, Bobbin and an army marched towards Luffy's location and started battling him."}, {"type": "paragraph", "text": "Once Luffy and Nami were overwhelmed, Big Mom's army learned that the Vivre Card Nami had in her possession came from Lola, which surprised them. The army then headed back to Sweet City with the captured Straw Hat Pirates."}, {"type": "paragraph", "text": "In the Prisoner Library, Bobbin and some of the Charlotte Family sat and listened as Big Mom spoke to the captive Luffy and Nami through a Den Den Mushi. After Anglais brought word of an intruder in the castle, all but Charlotte Opera left the library."}, {"type": "paragraph", "text": "As he later wandered in Whole Cake Château, he encountered Sanji and tried to eat the meat from the bento box next to him. Sanji, out of rage that someone tried to eat the dish meant for his captain, violently kicked him into a wall before running away, much to Bobbin's shock."}, {"type": "paragraph", "text": "Some of Bobbin's crewmates raced to the scene to find out what happened, but Bobbin put them to sleep, intent on fixing the situation himself. He then broke off into a sprint, saying that even demons would attend Big Mom's tea parties. Sometime after leaving the castle, Bobbin was ambushed and shot by Vito and collapsed from his wounds shortly afterwards. Vito later told Bege that he had disposed of Bobbin."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Enraged_Army.png/revision/latest/scale-to-width-down/210?cb=20180205013939", "caption": "Bobbin leads an army to take down Luffy and Nami."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Sanji_Attacks_Bobbin.png/revision/latest/scale-to-width-down/210?cb=20180121031638", "caption": "Bobbin is attacked by Sanji."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Big Mom's army vs. Monkey D. Luffy, Nami, and Kingbaum", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The anime adds a scene of Mont-d'Or and Galette talking to a group of Chess Soldiers who discovered Bobbin's body in the alley and explicitly states that Bobbin was killed. However, in the manga, he is not seen afterwards and his final status remains unverified aside from Vito's claim that he was \"disposed of\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/67/Bobbin_Found_Dead.png/revision/latest/scale-to-width-down/210?cb=20180325080013", "caption": "Bobbin's body at the scene of the crime."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Bobbin's epithet, Shimatsu-ya (始末屋, Shimatsu-ya), has brought into the community some translation and dub issues due to the word's multiple meanings. In Japanese, shimatsu (始末, shimatsu) means \"to get rid of\". It also can mean \"assassinate\", depending on the context. Adding -ya (屋, -ya \"store\") implies that a Shimatsu-ya is somebody who gets rid of things for a living or as a business. Despite this, the dictionary definition for 始末屋 is \"a thrifty person\", hence the term is used as a pun in Bobbin's epithet to mean a \"thrifty killer\". This would explain the use of \"Disposer\" as a translation for his epithet as combines aspects of \"getting rid of something\" and \"assassin/hitman.\" On the other hand, Bobbin's epithet may be a reference to Ryo Saeba from CITY HUNTER who was a \"始末屋\" or \"Sweeper\" (スイーパー)."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bobbin's name and appearance when he is asking for snacks may be references to \"bobbing head dolls\" (more commonly known as \"bobbleheads\") or \"bobbing for apples\" (a game often played on Halloween).", "elements": [{"text": "It also refers to the \"head tremor syndrome\" which is to move the head with fast, rhythmic and repetitive vertical or horizontal movements. Half of all cases occur when sleeping or resting and it refers to Bobbin's hypnotic power and Bobbin's head movement.", "elements": []}, {"text": "Bobbin's appearance has a resemblance an owl with long arms, the size of his belly and his head movements. Owls also do a \"Bobbing head\" to move their head like Bobbin. The owl can also refer to fairy tales.", "elements": []}]}, {"text": "His laugh seems to refer to the Japanese word \"boyoyon\" (ボヨヨーン, ぼよよーん) , which translates to a rebound sound and this is also a Japanese sweet shop.", "elements": []}, {"text": "Bobbin's name may also come from nursery rhyme, \"Robbin, A Bobbin, The Big-Bellied Ben\". The rhyme is of a man who devours everything including: a whole cow, the butcher, the church and all its people, which fits with Big Mom's gluttony.", "elements": []}, {"text": "Along with the rest of the Big Mom Pirates fairy tale theme:", "elements": [{"text": "Bobbin's smile may be a reference to the Cheshire Cat's famous grin from Lewis Carroll's most well-known novel, \"Alice's Adventures in Wonderland\".", "elements": []}, {"text": "Bobbin's name, which he shares with a common part of a sewing machine, and his ability to make people fall asleep, might be a reference to the tale of the Sleeping Beauty by the Brothers Grimm.", "elements": []}, {"text": "Bobbin's name might be a reference to Betsy Bobbin, a character from L. Frank Baum's book series about the fictional Land of Oz.", "elements": []}]}, {"text": "Bobbin's ability is similar to that of the non-canon Nemu Nemu no Mi, as both can put people to sleep.", "elements": []}, {"text": "Bobbin's epithet of \"Sweeper\" may be a reference to Ryo Saeba from CITY HUNTER who was also called a \"始末屋\" or \"Sweeper\" (スイーパー).", "elements": []}]}], "images": []}]}