{"sections": [{"title": "Tamago", "level": 1, "content": [{"type": "paragraph", "text": "Baron Tamago (also known as Viscount Hiyoko and Count Niwatori in his second and third form respectively) is a knight-ranked combatant of the Big Mom Pirates, who originates from the Longleg Tribe. He and his partner Pekoms are responsible for collecting the monthly payment of sweets from Fish-Man Island in exchange for Big Mom's protection."}, {"type": "paragraph", "text": "Due to his actions and role, he is a supporting antagonist during the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Baron Tamago is tall due to his long and lanky thin legs. He has many wrinkles on his forehead and a big mustache that curls upwards. He also wears sunglasses and has a scar over his left eye which he lost during a previous fight with Pedro five years ago."}, {"type": "paragraph", "text": "On top of his head, he sports a magenta cup full of hot tea and saucer which he drinks from at times."}, {"type": "paragraph", "text": "As Baron Tamago, he appears to wear magenta pants with an egg shell like shape that goes up to his belly. He wears a formal magenta tuxedo as well, along with a pink shirt underneath, and a yellow bowtie. He carries a long wooden cane with him. Tamago's rather strange appearance caused Zoro to comically mistake him for a compass."}, {"type": "paragraph", "text": "As Viscount Hiyoko, he has a yellow skin color, and his arms and hands have transformed into wings. His attire changed and he has a yellow suit with white pants."}, {"type": "paragraph", "text": "As Count Niwatori, he resemble a large rooster wearing a pale pink suit."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Tamago always uses French words like \"bon\" at the beginning of his sentences and \"soir\" and \"s'il vous plaît\" at the end of his sentences. He uses \"bon\" as a suffix and prefix, but mostly a suffix."}, {"type": "paragraph", "text": "In reference to his egg-theme, he refers to inexperienced people as \"half boiled\" and when people surprise him with their ignorance, he even calls them \"raw\". When he says \"you\" he uses the kanji for \"egg yolk\" (黄味, \"egg yolk\"), as both are pronounced kimi."}, {"type": "paragraph", "text": "He is polite and negotiable, as well as rather intelligent, as he saw exchanging the treasure for some extra time to make more candy to be perfectly acceptable. Tamago even offered to give the citizens more time until they could accomplish the task (although the time he gave them was clearly insufficient compared to the situation explained). He even fully elaborated the protection Big Mom lent to Fish-Man Island in exchange for candy to the Straw Hats' \"Monster Trio\", along with the consequences of them failing to fulfill their end of the bargain. Like most of Big Mom's subordinates, Tamago is afraid of her."}, {"type": "paragraph", "text": "Tamago seems to dislike arrogance as shown when he admitted to be disgusted by Caribou after Pekoms noted that Logia users who thought themselves to be invincible did not tend to live long. Ironically, he himself is subjected to displays of boasting as during his second fight against Pedro, he bragged about his superior speed compared to the mink's. After the misfortunes the Big Mom Pirates suffered since the Straw Hats arrived at Whole Cake Island, Niwatori became concerned of how they underestimated the Straw Hats and even warned Mont-d'Or that arrogance could lead to negative consequences."}, {"type": "paragraph", "text": "Tamago follows his missions to the letter, even at the expense of his partners, as he condoned Capone Bege's decision to shoot Pekoms because Pekoms was willing to let the Straw Hats go as thanks for their protection of Zou. Despite that when finding out Pekoms survived and was on Whole Cake island, Tamago stated he intended to bring him before Big Mom and have the latter beg her for forgiveness while mentioning their past as comrades."}, {"type": "paragraph", "text": "Tamago also does not follow the popular trend of exposing and decorating his longlegs like other members of his tribe do."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Big Mom Pirates", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Like a lot of people of her crew, Tamago is scared of Big Mom and wishes to avoid bringing her bad news, as he does not want to be the target of her resulting rage. However, he still dares to disagree and try to correct her when she is angry, such as when he suggested accepting the Straw Hats' offer of treasure instead of candy to repair ships that were destroyed by Eustass Kid."}, {"type": "paragraph", "text": "Big Mom does seem to value Tamago to a certain degree. She was angry at Pedro for scarring Tamago's left eye, though her indignant mood subsided when Pedro took out his own left eye."}, {"type": "paragraph", "text": "Despite being terrified of Big Mom, Tamago held undying loyalty towards his captain as he was enraged to learn that Bege had been plotting to assassinate her. He also urged Mont-d'Or to take extreme measures to prevent Big Mom's name from getting tarnished."}], "images": []}, {"title": "Pekoms", "level": 4, "content": [{"type": "paragraph", "text": "Tamago and Pekoms get along quite well. They are colleagues who collect the candy payment for Big Mom together. Tamago calms Pekoms down when he gets angry and negotiates with their customers on his behalf."}, {"type": "paragraph", "text": "When Capone Bege tried to kill Pekoms due to him abandoning the mission, Tamago approved Bege's decision, showing that he puts his missions over his allies. However, in spite of that, when he heard of Pekoms' survival and arrival on the island, he intended to beg Big Mom to forgive Pekoms to honor their long history together. Hearing that Pekoms went with the Straw Hats seems to have made the situation more troubling for him."}, {"type": "paragraph", "text": "After the destruction of the Whole Cake Chateau, the two were reunited and went back to serving the crew. However, he was shocked to learn that Pekoms betrayed his crew to assist Luffy."}], "images": []}, {"title": "Charlotte Smoothie", "level": 4, "content": [{"type": "paragraph", "text": "He appears to be well respected by Sweet Commander Smoothie as she was willing to heed his advice despite her outranking him. Smoothie even apologized to him after realizing he was right about Pedro having an accomplice who broke into the treasure room."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Tamago was initially quite compliant with the Straw Hat Pirates, wanting to accept their offer of treasure and conversing with them politely. However while their first encounter was on positive terms, it did not leave any impression on Tamago. When they met again, it was Tamago's mission to retrieve Caesar Clown. Tamago wanted just to kill all the Straw Hats by sinking their ship and then to retrieve Caesar from the wreckage. Later on, Tamago attempted to recruit Sanji into the Big Mom Pirates due to the latter's impending wedding to Pudding only for Sanji to reject the offer. He also had Big Mom's troops watch the Sanji Retrieval Team's movements while they were in the Seducing Woods. Niwatori appears to have recognized the luck that the crew has due to them being people Pedro was willing to sacrifice himself for. He tried to implore his crew not to underestimate them because of the recent events that have occurred since their invasion but his warnings were ignored."}], "images": []}, {"title": "Pedro", "level": 4, "content": [{"type": "paragraph", "text": "Tamago knows Pedro since the latter once attempted to steal Big Mom's poneglyphs. It seems that he is extra-cautious around the mink, as he would even need the assistance of a Sweet Commander just to make sure Pedro fails in his quest to acquire the poneglyphs in their possession. He also respects the mink well enough that he would always correct his soldiers in calling Pedro a \"Jaguar\" mink, whenever they would misidentify him as some other species of cat. When Pedro was cornered in Big Mom's courtyard, Tamago stepped out to confront him and mocked him for his futile effort. It is also revealed that Pedro was the one who took Tamago's left eye."}, {"type": "paragraph", "text": "Tamago also seemed to be sad at Pedro's assumed sacrifice due to his respect for the man's noble intentions. Furthermore, Pedro's self sacrifice gave Niwatori a new perspective of the Straw Hats."}], "images": []}, {"title": "Capone Bege", "level": 4, "content": [{"type": "paragraph", "text": "Tamago had utmost respect and trust for Bege as a Rook of the Big Mom Pirates and was extremely furious to learn that he had betrayed the crew by attempting to assassinate Big Mom."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Tamago, like many others in the crew, is responsible for collecting candy payments from the various islands under Big Mom's protection. He is in fact a very powerful man, given his bounty, and was able to survive a battle against Pedro, the leader of the minks' Guardians with a bounty of 382,000,000, with only a scar on his left eye to show for it."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Tamago is extremely strong, in contrast to his disproportionate build. He was able to easily lift, with each of his thin arms, a sack larger than his own torso of gold and jewelry. He has enough physical power to clash with Pedro, an extremely powerful mink."}, {"type": "paragraph", "text": "As one of the Longleg Tribe, his legs are considered the main point of his combat strength and, at the same time, his weakness. He is capable of performing rapid kick attacks, horizontally spinning his legs in a whirlwind motion akin to a rolling cartwheel. Due to his legs' length, his kicks have great range (superior, by his own word, to that of Pedro's sword strokes), and he is capable of clashing his legs directly against a blade with no apparent repercussions. He wears special tights that can protect him from electric attacks, particularly Electro."}, {"type": "paragraph", "text": "He is also quite agile, as he kept up with Pedro's own very impressive speed (all the while preventing the cup atop his head from spilling)."}], "images": []}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Leg Benedict (レッグ・ベネディクト, Reggu Benedikuto): After performing a whirlwind of kicks, Tamago kicks his opponent horizontally across their face, sending them flying back. It was first seen in his second battle with Pedro. This attack's name is a pun on \"leg\" and the breakfast dish \"Eggs Benedict\".", "elements": []}, {"text": "Sunny-Side Legs (サニーサイド レッグ, Sanīsaido Reggu): An anime-only technique. Tamago flips upside-down and spins rapidly like a top, delivering a flurry of kicks. This attack's name is a pun on “leg” and the breakfast dish sunny-side eggs.", "elements": []}]}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Tamago ate the Tama Tama no Mi, an unclassified Devil Fruit that turns his body composition into that of an egg. When his body is broken, Tamago evolves into a stronger form that gradually loses his human appearance and gives him the appearance of a chicken each time he does so. He has three forms, Baron Tamago being his base form, Viscount Hiyoko, and Count Niwatori. He is stated to become stronger in combat each time he evolves, and is a \"true knight\" once he reaches his third form. Should his strongest form be destroyed, he reverts to his weakest base form. This endless cycle effectively prevents him from dying in battle as long as he is not killed in the midst of an evolution."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Viscount_Hiyoko.png/revision/latest/scale-to-width-down/210?cb=20190118125046", "caption": "Tamago evolves into a chicken."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Tamago possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "He is highly skilled and experienced in swordsmanship as he is able to hold his own against Pedro, a powerful mink swordsman. Tamago uses his swordsmanship in conjunction with his leg attacks, providing a multifaceted offense."}, {"type": "paragraph", "text": "In the anime, Tamago's swordsmanship can be improved by evolving with his Devil Fruit powers. As Viscount Hiyoko, he has shown extreme proficiency and speed in dual wielding knives, able to corner Pedro and even disarm him of his sword. "}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is seen carrying a pistol on his right hip, and a shikomizue (cane sword) similar to Brook's.."}, {"type": "paragraph", "text": "When he becomes Viscount Hiyoko, he wields two knives."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Five years prior to the beginning of the series, Pedro and the Nox Pirates entered Big Mom's territory to search for poneglyphs. Tamago clashed with Pedro and lost his left eye in the process. After Pedro was driven out of Totto Land, his crewmate Pekoms ended up joining the Big Mom Pirates, becoming Tamago's partner in collecting Big Mom's candy tributes."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Tamago appears on Fish-Man Island, in front of the Candy Factory. He scolded Pekoms for threatening the citizens, stating that doing so would not help them collect the monthly candy offering any time soon, and warned the inhabitants of Fish-Man Island that Big Mom would destroy them if they did not pay up the sweets. When Monkey D. Luffy tried to barter, offering money instead of candy to Big Mom, Tamago tried to reason with Big Mom, stating that Eustass Kid had recently sunk two of their pirate ships, and that they needed money. Big Mom harshly scolded Tamago, calling him brain-dead for trying to make a compromise, and demanded that Luffy meet her in the New World. Regardless, Fish-Man Island was given this one pardon thanks to Luffy's intervention, and the two envoys were given the large amounts of treasure in compensation, including the Tamatebako."}, {"type": "paragraph", "text": "After taking all the treasure that Luffy offered, they were attacked by Caribou, who had stolen the treasure first. Pekoms easily defeated Caribou and Big Mom's two messengers left the island."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "Tamago and Pekoms watched Caesar Clown's broadcast about his weapon of mass destruction from Punk Hazard via video Den Den Mushi. After seeing Caesar's defeat by Luffy, Tamago suggested that they call Big Mom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Brokers_Tamago_and_Pekoms.png/revision/latest/scale-to-width-down/210?cb=20131010013714", "caption": "Tamago and Pekoms watching Caesar's broadcast of his weapon."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later on, Tamago, along with Pekoms and the Fire Tank Pirates, were part of the group of Big Mom Pirates which pursued the Curly Hat Pirates off Dressrosa, in order to claim Caesar Clown. During the pursuit, the group was surprised that the Curly Hats were able to fight back and escape."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "A few days after retrieving Sanji from Zou, Tamago conversed with Sanji aboard Big Mom's ship, attempting to convince Sanji to accept Big Mom's invitation to join her crew."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime afterward, Tamago gave a pair of exploding wristlets to Vinsmoke Judge to put on Sanji should the Vinsmoke patriarch have problems with his son."}, {"type": "paragraph", "text": "A few days later on Whole Cake Island, Tamago was in Sweet City when Big Mom developed a craving for croquembouche and went on a rampage. He noted that croquembouche tourists were staying in the city, but was told that they had already checked out. He and the other residents of Sweet City began panicking as Big Mom arrived and started eating everything in her path, although she was later stopped by Jinbe."}, {"type": "paragraph", "text": "The next day, Tamago took Charlotte Pudding to try on wedding dresses, despite her insistence that she has matters to attend to elsewhere. Tamago was then brought outside by soldiers as they told him that Pekoms was nowhere to be found, and that they had located all but two of the Sanji Retrieval Team in the Seducing Woods. Tamago stated that the mink they had yet to locate was Pedro. Since the two were acquainted, Tamago thought he knew where the mink may be. However, Tamago told the soldiers to search for Pekoms, as he had wanted to bring his partner back in good standing but was in a pinch because of his disappearance."}, {"type": "paragraph", "text": "Tamago later increased security at the Room of Treasure, where the three poneglyphs in Big Mom's possession were stored. Aware of Pedro's goal, he guarded the poneglyphs alongside the Sweet Commander, Charlotte Smoothie. After hearing that Pedro was spotted, Tamago and some soldiers immediately pursued the intruder. As he was chasing after Pedro, he told some guards to corner him at the garden. He was then contacted by Smoothie via Den Den Mushi. She informed him of a second intruder, who managed to enter the Room of Treasure and locked Smoothie outside. Tamago told Smoothie to capture Brook alive so Big Mom could add him to her collection."}, {"type": "paragraph", "text": "Right after Pedro ran into the courtyard, Tamago and his men confronted him. Tamago then reminisced of their previous encounter five years ago and reminded Pedro on how Big Mom stole 50 years of his lifespan. Pedro replied that he had no intention of leaving Whole Cake Island alive."}, {"type": "paragraph", "text": "As Tamago and Pedro clashed, Tamago demanded to know why Pedro had returned despite his shortened lifespan. Pedro explained that he had done so for the Straw Hats, whom he believed would one day surpass him and Tamago while causing the world to transition into its \"dawn\", but clarified that he had no intention of dying until they had achieved their goals as he cut Tamago in half, causing a giant yolk to fly out of his body. Using his Devil Fruit power, Tamago evolved into Viscount Hiyoko, gaining a chicken beak and wings, and attacked Pedro with two knives. However, Pedro quickly cut apart Hiyoko, who began to evolve into his next form, Count Niwatori. Pedro then set off a large collection of explosives in his jacket, causing a massive explosion that engulfed Niwatori and his soldiers."}, {"type": "paragraph", "text": "However, Niwatori survived the explosion and attended a meeting with the other Big Mom Pirates, where they discussed the status of the Sanji Retrieval Team and the Vinsmoke Family. He mistakenly assured Mont-d'Or's assertion that Pedro had blown himself up in the courtyard."}, {"type": "paragraph", "text": "The next day, Niwatori was on the third floor of the Whole Cake Chateau during the wedding ceremony. The Tamatebako dropped to the base of the Chateau and exploded, causing the structure to topple over. As the castle collapsed, Niwatori panicked as he realized what was happening. He later made it outside the castle ruins and gathered with his crewmates, hearing about what had happened during the ceremony and becoming furious at Bege's treachery. He then revealed that the Sun Pirates had run away, but that he had been unable to relay this information due to communications being cut off. Pekoms then appeared confirming this revelation as the rest of the crew prepared to go after their enemies."}, {"type": "paragraph", "text": "Niwatori was later seen with Mont-d'Or as the latter was giving instructions to the Big Mom Pirates throughout Totto Land to keep the Straw Hats and the Fire Tank Pirates from escaping. As Pekoms grieved over Pedro's presumed death, Niwatori expressed his condolences for Pekoms' loss and surprise for Pedro's self sacrifice before pointing out on how they underestimated the Straw Hats and that unexpected incidents had been occurring since their arrival. He then warned Mont-d'Or that they could not allow the smallest chance for Big Mom's name to be tarnished. Niwatori was later surprised to hear that the territorial sea slugs went missing. As night fell, Stussy and Morgans met with Niwatori and Mont-d'Or. Niwatori remarked on how long Katakuri's fight with Luffy was taking, and Stussy then revealed that the explosion that toppled the Chateau was caused by the Tamatebako. As the Straw Hats' promised rendezvous time on Cacao Island drew near, Niwatori listened as Mont-d'Or promised Morgans that the Big Mom Pirates' forces would crush the Straw Hats."}, {"type": "paragraph", "text": "When he heard that Germa 66 appeared and attacked the Big Mom Pirates' forces on Cacao Island, Niwatori began to panic. Niwatori was later excited to hear that Big Mom's craving was satisfied."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c8/Tamago_Gives_Judge_Handcuffs.png/revision/latest/scale-to-width-down/210?cb=20170806194212", "caption": "Tamago gives Judge exploding wristlets to put on Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Room_of_Treasure.png/revision/latest/scale-to-width-down/210?cb=20171112073401", "caption": "Tamago at the Room of Treasure."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a5/Pedro_Cuts_Tamago_in_Half.png/revision/latest/scale-to-width-down/210?cb=20171203031658", "caption": "Tamago is cut in half by Pedro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Mont-d%27Or_Commands_the_Pursuit.png/revision/latest/scale-to-width-down/210?cb=20180715034052", "caption": "Niwatori assists Mont-d'Or in coordinating the pursuit of the Straw Hats."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tamago vs. Pedro", "elements": []}, {"text": "Hiyoko vs. Pedro (Whole Cake Chateau)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tamago (卵, Tamago) means \"egg\" in Japanese, referring to his egg-like features, and his Devil Fruit is the Tama Tama no Mi, both of those facts corresponds with the food-themed names of the Big Mom Pirates and Charlotte Family.", "elements": []}, {"text": "Likewise, Hiyoko (雛) means \"chick/young bird\" in Japanese, while Niwatori (鶏) means \"chicken\", both referring to the respective appearances of his evolutions.", "elements": []}, {"text": "He is the first member of the Longleg Tribe to appear in the series.", "elements": []}, {"text": "In association with the fairy tale theme of the Big Mom Pirates, Tamago resembles a combination of Humpty Dumpty and the Jubjub bird From Lewis Carroll's novel Through the Looking-Glass, and What Alice Found There.", "elements": [{"text": "However, unlike Humpty Dumpty's nursery rhyme, Tamago's Devil Fruit abilities allows him to reassemble himself.", "elements": []}]}]}], "images": []}]}