{"sections": [{"title": "Cyrano", "level": 1, "content": [{"type": "paragraph", "text": "Cyrano is a character in Oda's one-shot, Monsters, and was a swordsman from Ryuma's past."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He has a long, thin mustache that curves at the end. He also has a long sword which he carries on his belt. He also wears a musketeer hat over his side-combed brown hair. With his wide hat and mustache Cyrano bears a resemblance to Dracule Mihawk, fitting considering Ryuma's similar appearance to Zoro."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "At first, Cyrano seemed like a fully dignified man. He appeared to be a friendly, kind, and helpful person who lived for honor and was ready to sacrifice himself to protect others."}, {"type": "paragraph", "text": "Later, this was all proven to be a facade. In reality, Cyrano was an unscrupulous and dishonest criminal. Manipulative and immoral, he would murder others if it served his self-interest, and even sacrifice his own comrades to achieve his goals. Along with his partner, D.R., they both put up a false front of honorable individuals in order to earn trust of others before they commit criminal activities."}, {"type": "paragraph", "text": "Cyrano was also very overconfident and arrogant, believing his status as a first-class swordsman and his fraudulent honor made him superior to Ryuma, and mocked the samurai constantly during their confrontation, which led Cyrano to a swift death."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Weapons and Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Cyrano was noted to be a first-class swordsman, and the fact that Ryuma was able to slay him in one simple strike made D.R. question in fear what happened. Cyrano's choice of weapon was a zweihänder."}], "images": []}, {"title": "Intelligence", "level": 3, "content": [{"type": "paragraph", "text": "Cyrano proved himself to be quite manipulative and cunning, as he pretended to rescue Flare in order to build some prestige for himself, so he could later rob a town without being suspected. He even had Ryuma framed to have him become a scapegoat, furthering his own securities. However, his heavy underestimation of the samurai led to his downfall."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Many years ago, Cyrano killed his subordinates and stole the Dragon Horn from them. He and his partner, D.R., used it to summon a dragon to attack and rob Flare's hometown. He killed Flare's father while she was unconscious when the man begged Cyrano to save his daughter, and decided to use her to earn prestige for his own name by claiming he tried to rescue the townspeople but could only save her."}], "images": []}, {"title": "Monsters", "level": 3, "content": [{"type": "paragraph", "text": "Seven years later, Ryuma had arrived to the town where Cyrano and Flare were staying. Cyrano and D.R. decided to use Ryuma as a decoy and scapegoat while they attack the village. Cyrano staged a fight where his and Ryuma's sword sheathes touch, provoking Ryuma to challenge him to a duel in order to make the samurai appear as a villain. During this duel, D.R. appeared and used a fake Dragon Horn to scare the town's civilians away as they planned to loot the town. While the rest of the town evacuated, Ryuma and Flare stayed behind. They witnessed Cyrano's true colors and learned the true story behind Flare's past tragedy."}, {"type": "paragraph", "text": "Ryuma then confronted Cyrano, who mocked him. Ryuma dodged Cyrano's strike and killed him in one stroke. After Ryuma killed D.R. and the dragon as well, the townspeople came to see Cyrano as the fraud he was, and grew angry at him for his deception."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/Ryuma_kills_Cyrano.png/revision/latest/scale-to-width-down/210?cb=20130226172618", "caption": "Cyrano's death at Ryuma's blade."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cyrano vs. Ryuma (1st battle)", "elements": []}, {"text": "Cyrano vs. Ryuma (2nd battle)", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Monsters — Cyrano attacks Flare's village, loots the town, and dies by Ryuma's blade.", "elements": []}]}], "images": []}]}