{"sections": [{"title": "Inazuma", "level": 1, "content": [{"type": "paragraph", "text": "Inazuma is a newkama and the deputy commander of the G Army in the Revolutionary Army who serves under Emporio Ivankov."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "While Inazuma's appearance is different depending on his current gender, Inazuma's basic appearance is the same for both genders. Inazuma has clothes and hair that is orange on one side and white on the other. On top of Inazuma's forehead, there is a distinct lightning bolt shaped scar that goes over Inazuma's right eye. Usually Inazuma is seen with a glass of wine being held in his left hand, and sporting a particular pose, even while fighting, and even continues to hold the wine glass while using his Devil Fruit ability."}, {"type": "paragraph", "text": "As a man, Inazuma has his glasses on regularly. His jaw and body are also quite rectangular in shape. As a woman, Inazuma wears her glasses on top of her forehead, her jaw and body are also more rounded in shape, and the scar seems to move more towards the right side of her head."}, {"type": "paragraph", "text": "He also has a noticeable habit of keeping his free hand out and flat besides him despite gender. It should also be noted that Inazuma is one of the few (if not the only) okama to be depicted in a relatively normal manner without any of the excessively flamboyant characteristics or Drag Queen dressing and make up (or actually, no make-up at all), prevalent amongst okamas in One Piece."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a man, Inazuma is mostly serious, calm and level-headed, almost emotionless. He only shows emotions during critical moments, such as relief when he thought that Ivankov survived his battle against Magellan, and panic moments later when he realized that Ivankov had been defeated by Magellan."}, {"type": "paragraph", "text": "As a woman, Inazuma is warm and cheerful, in sharp contrast with her male persona. Also, regardless of gender, Inazuma seems to lack the general flamboyant disposition of an okama unlike most of the other okamas depicted in One Piece."}, {"type": "paragraph", "text": "As either personality he is very loyal to Ivankov, he will usually do nothing until given an order."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Emporio Ivankov", "level": 3, "content": [{"type": "paragraph", "text": "Inazuma is Ivankov's right-hand man and extremely loyal to him, as seen when he chose to stay behind the escaping prisoners to await Iva's return, and when he showed panic when he learned that he had been defeated by Magellan. He also did not attack until Ivankov gave him the command during the Whitebeard War, staying protected in his large afro."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Inazuma is an accomplished fighter who is capable of fighting while still maintaining his somewhat jaunty pose and holding his glass of wine."}, {"type": "paragraph", "text": "Though he appears to primarily fight with his Devil Fruit powers, he is also a proficient physical fighter, proven when he sent a wolf from the ferocious Wolf Unit flying with a kick. Even the Level 6 prisoners compliment his skills."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Inazuma ate the Choki Choki no Mi, a Paramecia-type Devil Fruit which allows him to transform parts of his body into scissors and manipulate whatever he cuts as though it were paper. It was also demonstrated that after cutting an object, it remains as if it was paper (as shown when fighting with Magellan making him able to move it at ease as if a paper itself). It was first seen in Level 6 of Impel Down where he cut the floor, flipping it as it was paper and laid it over the staircase, so the sleeping gas could not enter the area."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Choki_Choki_no_Mi_Infobox.png/revision/latest/scale-to-width-down/230?cb=20130224140928", "caption": "The Choki Choki no Mi in action."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He was a Revolutionary from the South Blue. For his membership, he was incarcerated into Level 5 of Impel Down, but his comrade, Emporio Ivankov, freed him and led him to Level 5.5, \"Newkama Land\"."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Luffy and his companions started causing a ruckus in Impel Down, Inazuma and the rest of Newkama Land witnessed their exploits on the monitors they hacked into. After Luffy was transferred to Level 5, Inazuma, as a man, roamed the forest of Level 5 of and witnessed Luffy and Mr. 2's bloody encounter with some wolves. After witnessing the encounter and Luffy's use of Haki, Inazuma took them before Ivankov. Before his leader, they were asked by the deeply-poisoned Luffy to help Mr. 2, despite his own condition. Deeply moved by this, Inazuma and Iva decided to help them. Ten hours, and a sex change courtesy of Iva later, Inazuma greeted an awakened Mr. 2 in Newkama Land. There she explained things to the ballet dancer alongside her leader. Among the explanations, she told Mr. 2 of Luffy undergoing a painful treatment to cure himself of Magellan's poisons via the aid of Iva's Devil Fruit powers."}, {"type": "paragraph", "text": "After ten more hours of intense recovery by Luffy and another sex change, Inazuma and the rest of Newkama Land were surprised to find the young pirate was able to endure such a painful treatment in such a short amount of time. When Luffy came out of his treatment, the young pirate accidentally revealed that he is the son of their leader, Monkey D. Dragon and Iva assumed that the soon-to-be executed Portgas D. Ace was also the son of Dragon. Because of this misunderstanding, they both decided the time to escape from Impel Down had arrived, and decided to assist Luffy in rescuing Ace from Level 6."}, {"type": "paragraph", "text": "After fighting their way to Level 6, and passing through all the traps along the way, Inazuma and the rest found that they were too late; Ace had already been taken from his cell."}, {"type": "paragraph", "text": "Desperate to get to the first floor of Impel Down, they tried using the express elevator that would lead directly there. The elevator however was too far beyond and then its shaft was blocked. The stairway they came down was no good either as it was suddenly closed behind bars. To make matters worse, sleeping gas was pouring through it. Fortunately, Inazuma blocked the sleeping gas by cutting up slabs of the floor and blocking the opening with them. Though the situation now seemed that just getting Luffy out of Impel Down was the only thing to do as Ace was then too far away, spurred on by Luffy's determination, Inazuma and the rest of the group decided to continue the rescue even if it lead them directly Marineford. As they were planning to do so, they decided to take two prisoners from Level 6 along with them to help, Crocodile and Jinbe. With Iva blackmailing Crocodile to make sure the former Shichibukai does not betray them, and Jinbe freely joining them, Inazuma picked the locks to their cells and freed them."}, {"type": "paragraph", "text": "After cutting up some more of the floor and making a pathway, Inazuma and the others escaped with the help of Crocodile's Devil Fruit powers on the ceiling. Upon escaping to the level above, Inazuma rallied with the rest of the residents of Newkama Land and began a riot in the prison as they aided Luffy and his allies in escaping. As they traveled up Impel Down and freed more prisoners to add to their numbers, Inazuma and the rest were able to fend off the prison's staff and steadily progress. Not even when the Blugori and the Demon Beasts of Impel Down were dispatched, were they not deterred. However, just as they were about to get through to Level 3 with Luffy about to defeat Hannyabal, a new development arose. All of the sudden, Inazuma and the rest came face to face with Marshall D. Teach and his men. The Blackbeard Pirates apparently decided to attack Impel Down for some reason at the same time that Inazuma and the rest started to riot, and at that very moment, the two forces had crossed paths with each other."}, {"type": "paragraph", "text": "After a brief fight between Luffy and Blackbeard, Inazuma and the others managed to reach Level 3: here, he cut the stairs to level 2, following the instructions of Ivankov, who stayed to battle Magellan. Refusing to follow the other prisoners to Level 1, Inazuma stayed in front of the stairs waiting for Iva, but he was reached instead by Magellan, who easily defeated him with poison."}, {"type": "paragraph", "text": "Fortunately, Inazuma was picked up by Ivankov. Though both of them were barely alive after being defeated by Magellan's poison, they quickly caught up with the rest of their allies on the top of Impel Down using Iva's Hell Wink to propel them up the prison. Having caught up with the rest of their allies, Inazuma and the rest were not given a moment's rest as Magellan came at them with his most powerful technique. Heeding the advice from Jinbe over the Den Den Mushi, they all hung on to Iva's huge head and using another Hell Wink, blasted their way into the ocean just as Magellan cornered them all at the pier. Though this move seemed foolish due to the waters surrounding Impel Down being a Sea King's nest, they were fortunately saved by a school of whale sharks that Jinbe called for aid."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b1/Inazuma_Finds_Mr._2_and_Luffy.png/revision/latest/scale-to-width-down/190?cb=20100215005214", "caption": "Inazuma finds Mr. 2 and Luffy in Level 5."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/de/Inazuma_Recovers.png/revision/latest/scale-to-width-down/230?cb=20130401231529", "caption": "Inazuma recovers on the escape ship."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Inazuma was treated for his poisons on the escape ship to Marineford. Ivankov decides not to use his healing and tension hormones, claiming that Inazuma is a very important revolutionary and this process shortens the lifespan and may cause various after-effects. Iva decides just to wait until Inazuma is recovered."}, {"type": "paragraph", "text": "Near the end of the battle at Marineford, Inazuma emerged from Ivankov's hair, having been hiding in it all of the time since the boat crashed into the battle. He then used his Devil Fruit powers to create a walkway to Ace's Execution platform for Luffy."}, {"type": "paragraph", "text": "He allowed Luffy to pass and stayed behind with Ivankov to fend off anyone who tried to approach the passage. Luffy advanced forward on the passage and encountered Garp who destroyed a part of the bridge, panicking Inazuma."}, {"type": "paragraph", "text": "Later, when Ivankov used Hell Wink on Akainu, the admiral took revenge and attacked Inazuma and Ivankov, knocking both to the ground."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Inazuma_Creates_a_Bridge.png/revision/latest/scale-to-width-down/240?cb=20130513043913", "caption": "Inazuma creates a bridge for Luffy to reach Ace."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Once the war was over, Ivankov and the other okamas were able to escape on Boa Hancock's captured Marine ship. Inazuma made it to Momoiro Island with Ivankov. As a woman, she alerted Ivankov that a call had just come from Baltigo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Inazuma_in_the_Kamabakka_Kingdom.png/revision/latest/scale-to-width-down/240?cb=20141206174519", "caption": "Inazuma in Kamabakka Kingdom."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Blackbeard Pirates destroyed Baltigo, the Revolutionary Army moved their base of operations to Momoiro Island. At the meeting table, Inazuma sat next to Ivankov, waiting for all the revolutionary commanders to arrive."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Inazuma, Luffy, and Emporio Ivankov vs. Impel Down Guards and Wolf Unit", "elements": []}, {"text": "Inazuma vs. Magellan", "elements": []}, {"text": "Inazuma and Emporio Ivankov vs. Admiral Akainu", "elements": []}]}], "images": []}, {"title": "Anime and Manga Influences", "level": 2, "content": [{"type": "paragraph", "text": "The inspirations for Ivankov and most of the Okama in Impel Down were derived from characters and situations in the stage play The Rocky Horror Show, and it's film adaptation, The Rocky Horror Picture Show. Specifically, Inazuma's outfit (sunglasses, tuxedo shirt, coat) and hairstyle are strikingly similar to those of the dancers in the \"Time Warp\" dance number in the film."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "One Piece Green: Secret Pieces revealed an early concept of Inazuma. He was originally planned to have the powers of a Crab-Zoan fruit."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/86/Early_Inazuma.png/revision/latest/scale-to-width-down/200?cb=20150404101707", "caption": "Early concept of Inazuma from One Piece Green."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Inazuma (稲妻, Inazuma) is Japanese for \"lightning bolt\", a reference to the lightning bolt-shaped scar on his forehead and eye."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}]}