{"sections": [{"title": "Shiryu", "level": 1, "content": [{"type": "paragraph", "text": "Shiryu of the Rain was the Head Jailer of Impel Down until he himself was imprisoned on Level 6 death row for his excessive, murderous violence against prisoners. When temporarily released to help Magellan quell the prison riot caused by Monkey D. Luffy and Marshall D. Teach coming to Impel Down, he chose to go against what he was ordered and instead assist the Blackbeard Pirates, ultimately deciding to join them."}, {"type": "paragraph", "text": "Currently, he is one of the Ten Titanic Captains of the Blackbeard Pirates as captain of the Second Ship."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "In a flashback, Shiryu was seen to have strap on devil-like wings similar to Magellan's and Hannyabal's, along with a black officer's hat with a red stripe that has white ear-flaps on the sides, and maroon gloves. He usually has the bill of his hat rather low. The strap-on wings are not present by the time he was released from his cell, in all likelihood stripped from him to indicate his rank and privileges were revoked for his excessive cruelty. He is a rather large man, as tall as Blackbeard. He also possesses a prominent chin."}, {"type": "paragraph", "text": "While imprisoned, he was allowed to keep his uniform (though without the wings) rather than wearing the prisoners' striped shirt. He also wears a long white, yellow, and black jacket over it, draped over like a cape. The kanji on the back of his jacket reads Goku (獄, Goku), which means \"prison\". Shiryu is usually seen smoking a cigar."}, {"type": "paragraph", "text": "The sword that Shiryu wields has a long blade with a square guard. Half of its sheath is white, while the other half is red."}, {"type": "paragraph", "text": "After becoming the captain of the 2nd fleet, Shiryu remains in his Head Jailer uniform, but exchanged his white jacket for a dark colored one (white in the anime). The Impel Down symbols on his hat, collar and belt have also been exchanged for jolly roger skulls."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shiryu is extremely bloodthirsty who enjoyed killing people any time he can. He massacred numerous prisoners within the walls of Impel Down to the point that Magellan could no longer overlook his murderous behavior. He also struck down his subordinates right after being released from prison, while giving a sarcastic apology. He is fond of his blade and enjoyed testing it against others, even if they are far below his level of power. He would take personal care in maintaining his sword as shown after the timeskip. He is also completely calm and cool-headed, even in tense and unexpected situations. He is also cautious, because he warns Blackbeard Pirates not to underestimate Magellan  and he lectures them that they should have prepared themselves properly for the New World."}, {"type": "paragraph", "text": "Shiryu is apparently very deceitful and treasonous by nature, as he offered to help Magellan fight for the prison if released, but instead betrayed his former superior and wreaked havoc, killing many subordinates; however, Magellan did refuse to retract Shiryu's death penalty no matter what, giving him very little choice outside of betrayal to escape it. He has since become a loyal member of the Blackbeard Pirates.. Despite this, he once voiced (in a joking manner) an intent to leave the crew if Blackbeard failed to obtain Whitebeard's power but after Blackbeard's success, he remarked that he made a good decision in joining them."}, {"type": "paragraph", "text": "Shiryu also believes that the Shichibukai are just pirates, claiming \"once a pirate, always a pirate\" when the Impel Down staff referred to Blackbeard as a traitor. Despite this, he was willing to aid the Blackbeard Pirates and even became a member himself. Shiryu believes in fate; believing that it was fate that brought Blackbeard to him, and that fate told him to join the crew. He has shown that he does not care much about personal details; when asked by Fleet Admiral Sengoku about what happened to Magellan; he told him to find out for himself. He appears to have a very strict disposition towards those around him, be they jailers or pirates, and has also shown himself to be very irritated and aggravated by the Blackbeard Pirates for not preparing themselves properly for the New World."}, {"type": "paragraph", "text": "Though Shiryu is one of Blackbeard's men, he is distrustful towards anyone who hasn't earned his respect. He expressed skepticism in his captain once he initially joined the group, thinking himself and the new recruits from Level 6 of Impel Down should disband from the Blackbeard Pirates if Blackbeard failed to acquire the powers of the Gura Gura no Mi. He is also a very shady individual, and Blackbeard compared him in that regard to Kuzan; however, Jesus Burgess considered Kuzan untrustworthy due to his former background as a Marine, but not Shiryu, who acts the way he does because he's truly cruel-hearted."}, {"type": "paragraph", "text": "Shiryu seems to like smoking, as when he got out of prison to help Magellan, the first thing he wanted was a lighter to smoke his cigar. He does have a perverted side, with Oda stating that he would use his Devil Fruit powers to spy on women's baths."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the former Chief Guard of Impel Down, Shiryu had command over lower ranking employees of the fortress. However, due to him abusing the power of his station, he was stripped of his rank and privileges."}, {"type": "paragraph", "text": "After the time-skip, he has become one of the Ten Titanic Captains of the Blackbeard Pirates that personally guard the Yonko, Blackbeard, and has gained great authority in the crew as captain of its second fleet."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "His strength is said to be equal to the Chief Warden Magellan. However, since Magellan's work hours are limited due to his diarrhea, Shiryu was considered more dangerous. Ivankov noted that Impel Down was completely impenetrable due to the prison being under the protection of both Shiryu and Magellan, and even claimed that if Shiryu was still on duty as the Chief Guard instead of being imprisoned, Luffy and Bentham would never have survived in their mission to break Ace out of Impel Down. In fact, Magellan himself deemed Shiryu to be such a powerful menace that he had Shiryu imprisoned in Level 6 where only the most powerful and dangerous criminals are placed.. Despite his strength, Magellan was still able to overpower and imprison Shiryu."}, {"type": "paragraph", "text": "He has extremely formidable speed, being able to cut down several Impel Down officers in a split second. He has shown himself to possess incredible superhuman endurance. This is best demonstrated when he took a Gura Gura no Mi shock wave from Whitebeard (albeit not a direct hit), and later a direct hit from Sengoku's shock wave in his Daibutsu form, being sent back a great distance and then getting up with only a small amount of trouble."}], "images": []}, {"title": "Stealth Master", "level": 3, "content": [{"type": "paragraph", "text": "Shiryu has proven to have exceptional capabilities in stealth. When he planned to defect to the Blackbeard Pirates, Shiryu would infiltrate Impel Down's monitor room completely undetected where he'd sneak past the extremely high security of Impel Down and destroyed all the communication devices. He even snuck up on a security guard who was reporting to Magellan and killed him without being noticed."}, {"type": "paragraph", "text": "After eating the Suke Suke no Mi, his stealth prowess increased, enabling him to perform several sneak attacks on Gecko Moria and his zombies without being noticed."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Shiryu is extremely proficient in wielding his nodachi, having used it to kill numerous prisoners of Impel Down, all who were noted to be powerful and dangerous criminals. When his sword was returned to him after a long term imprisonment, Shiryu killed several of his fellow Impel Down officers in a split second, demonstrating extraordinary precision and dexterity in his swordsmanship."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Shiryu has eaten the Suke Suke no Mi, a Paramecia-class Devil Fruit which gives him the ability to turn himself and whatever he is holding invisible. He acquired this fruit soon after his crew murdered its previous user, Absalom. With this fruit, he is able to cut opponents without being spotted, taking them by surprise. He held this ability in high regard in terms of usefulness."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Suke_Suke_no_Mi_Infobox.png/revision/latest/scale-to-width-down/180?cb=20190111063001", "caption": "Shiryu uses the Suke Suke no Mi."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Shiryu's weapon of choice is a nodachi called Raiu, qualified as a Meito. It was confiscated from him after Shiryu was imprisoned as a condemned criminal in Level 6. After Magellan released Shiryu to deal with Blackbeard, Raiu was returned to him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Shiryu%27s_Katana.png/revision/latest/scale-to-width-down/300?cb=20130113214506", "caption": "Shiryu's sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Though the guards of Impel Down have permission to kill prisoners for security reasons, Shiryu heavily abused that privilege by killing many prisoners for his own pleasure. When confronted by Magellan, Shiryu's abuse of his privilege was revealed and he was deemed to be a menace. For that, he was sentenced to death and put on death row in Level 6. As Level 6 prisoners' crimes are deemed too dangerous or embarrassing to be made public, Shiryu's crimes were not heard of by most prisoners, despite their brutality."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the jailers reached Level 6 after their failed attempt to flood the floor with knock out gas to capture Monkey D. Luffy, Emporio Ivankov, and Inazuma, Shiryu informed them that they had escaped, along with Jinbe and Crocodile, stating that Impel Down had gone downhill without him. He told the jailers to pass word to Magellan that he would be willing to lend him a hand fighting against the escapees. Magellan, after hearing about the Blackbeard Pirates' intrusion into Impel Down, reluctantly agreed to release Shiryu to fight against the unwelcome Shichibukai, adding that Shiryu's sentence had merely been postponed and that he would not receive anymore chances. However, the moment he was given back his sword, he attacked the jailers who were sent to release him."}, {"type": "paragraph", "text": "He was later seen at Level 1, speaking to Teach and his crew, much to the shock of the guards who were defending against the intruding crew. Blackbeard invited him to join his crew, but Shiryu apparently left the Blackbeard Pirates to their own devices."}, {"type": "paragraph", "text": "Later, Shiryu, was seen slaughtering the guards, destroying the monitor room, disabling the giant Den Den Mushi that was responsible for visual reception, and severing all contact lines to the outside of the prison, while stating that he did not want Magellan to come down to where he was."}, {"type": "paragraph", "text": "A while after the Blackbeard Pirates' encounter with Magellan, Shiryu came and saved them with an antidote, stating that they would have died if he had not helped them. Blackbeard once again invited Shiryu into his crew. Shiryu accepted the offer, saying that he was waiting for a man of Blackbeard's stature and the alternative was being sentenced to death. With Shiryu on their side, the Blackbeard Pirates made their way to Level 6 where Blackbeard had the inmates fight each other and later took the survivors to join his crew before leaving the prison."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Shiryu_Betrays_Impel_Down.png/revision/latest/scale-to-width-down/230?cb=20130209005727", "caption": "After being released, Shiryu slices through the guards."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/05/Blackbeard_and_Shiryu.png/revision/latest/scale-to-width-down/230?cb=20130303154043", "caption": "Teach asks Shiryu to join his crew."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Shiryu was seen again when he came with Blackbeard to Marineford. He was spotted along with the other members of the Blackbeard Pirates on the execution platform where they were watching the events unfold on the battlefield. He and the others came to Marineford because they wanted to witness Whitebeard's death. When Sengoku demanded to know what happened to Magellan and Impel Down, Shiryu replied by telling him to find out himself as he had joined Blackbeard. Their conversation was cut short when Whitebeard attacked, but the entire crew escaped unscathed."}, {"type": "paragraph", "text": "When Whitebeard managed to injure Blackbeard, despite the latter canceling out the Devil Fruit power of the former, Shiryu participated in attacking Whitebeard along with the rest of the Blackbeard Pirates, slashing him with his sword. After Whitebeard died, he and the rest of the crew proceeded to aid Teach in assimilating Whitebeard's Devil Fruit power by covering the two pirates in a dark blanket. Despite Teach emerging successful, Shiryu vocally stated beforehand that there was a chance that Blackbeard could fail, musing whether or not the crew would go on or go about their separate ways if that happened. As Blackbeard took control over the former powers of Whitebeard, he wanted to shake Marineford to its core, making it sink."}, {"type": "paragraph", "text": "As Sengoku would not allow this to happen, he angrily transformed into his Buddha form and attacked the Blackbeard Pirates with a giant shock wave. He blasted away all the Blackbeard Pirates, except for the captain. It seemed that he did not receive too much damage, as he was able stand up quite easily. He left with the rest of the crew when the Red Hair Pirates came to Marineford to end the war."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Whitebeard_vs_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/250?cb=20151018201408", "caption": "Shilew and the Blackbeard Pirates attack Whitebeard"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/54/Sengoku_Attacks_the_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/220?cb=20130914170940", "caption": "Sengoku attacks the Blackbeard Pirates."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Blackbeard made his move in the New World, taking out Jewelry Bonney in the process. While the crew was seen bickering amongst each other, Shiryu scolded the crew for being unprepared for the hardships of the New World. The Blackbeard Pirates' raft was brought close to the point of destruction, due to Sanjuan Wolf's size, and they seemingly got in contact with the Marines to trade Bonney for a battleship. Van Augur alerted Teach that the battleship had arrived but not for trade because Akainu was on board. Knowing that the deal would not happen, the Blackbeard Pirates fled, leaving Bonney behind to be arrested."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fd/Shiryu_Fire_Island.png/revision/latest/scale-to-width-down/210?cb=20130223001648", "caption": "Shiryu with the Blackbeard Pirates waiting for the delivery of a Marine ship."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "The Blackbeard Pirates used their captain's knowledge of Whitebeard's former territory to conquer it. After Blackbeard became a Yonko, the Blackbeard Pirates started hunting down powerful Devil Fruit users in order to absorb their abilities."}, {"type": "paragraph", "text": "Shiryu was assigned to be the captain of the Blackbeard Pirates 2nd Fleet, while his fellows Jesus Burgess and Lafitte were also promoted to be captains of their own divisions."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat, the Blackbeard Pirates stopped by Dressrosa but were unable to find Burgess. At a certain sea in the New World, Shiryu and Lafitte were contacted by Burgess via Den Den Mushi. Burgess informed them that he stowed away on a ship that led him to the revolutionaries' base on Baltigo, and had fallen unconscious because of severe injuries inflicted by Sabo. He then told them to inform Teach and get the Blackbeard Pirates to attack the island. The Blackbeard Pirates later attacked Baltigo, and the island was destroyed by the time the Marines and Cipher Pol arrived, but the Revolutionary Army was able to escape. However, the Blackbeard Pirates fled after briefly clashing with Cipher Pol and the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Shiryu_and_Laffitte_on_a_Blackbeard_Pirates_Ship.png/revision/latest/scale-to-width-down/210?cb=20160910194644", "caption": "Shiryu and Laffitte receive a call from Burgess."}]}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events at Totto Land, he was seen listening to his admiral's comments about Luffy being too soon to be called a Yonko."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime after Absalom arrived at Blackbeard's island, Shiryu gained his Suke Suke no Mi. When Moria and his zombie army went on a rampage on the island a few days later, Shiryu struck Moria from behind before revealing himself."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Shiryu vs. Magellan (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Magellan (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Fleet Admiral Sengoku", "elements": []}, {"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco) (unseen, during timeskip)", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol & Marines (unseen)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/POPNeoDX-Shiryu.png/revision/latest/scale-to-width-down/180?cb=20150311023037", "caption": "Shiryu in Portrait of Pirates."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In Chapter 595, Shiryu's name was romanized as \"Shiliew\". However, in Chapter 925, it was romanized as \"Shiryu\"."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The sarcastic apology Shiryu gave to the guards he cut down, \"Kiri-sute gomen\" (斬捨て御免, \"Kiri-sute gomen\" literally meaning \"authorization to cut and leave [the body of the victim]\"), is an old Japanese expression for a samurai's right to strike down an individual of lower class who compromised their honor. In modern days, the term is still used as an advance apology of sorts, with the subtle humor in offering what amounts to an unsympathetic apology.", "elements": []}, {"text": "Shiryu's favorite food is rare beef steak.", "elements": []}]}], "images": []}]}