{"sections": [{"title": "Catarina Devon", "level": 1, "content": [{"type": "paragraph", "text": "Catarina Devon, known as the \"Crescent Moon Hunter\", was the most dangerous female pirate ever to be imprisoned in Impel Down within the entire age of pirates. She was freed by Marshall D. Teach and is currently the only known female member of his crew."}, {"type": "paragraph", "text": "She is currently one of the Ten Titanic Captains, and the captain of the Sixth Ship of the Blackbeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Devon is an extremely tall, pale-skinned, and well-endowed woman (shown to stand a similar height to her captain, who is 344cm) with her hair in a set of girlish pigtails. Her face has wrinkles, a sloping forehead, a long witch-like nose, a devilish grin, and a square jaw."}, {"type": "paragraph", "text": "Before the timeskip, she wore a striped Impel Down uniform with a V-neckline. She also wore a large magenta cape, a blue pearl necklace, and a purple sash around her waist over lavender cargo-pants and black shoes."}, {"type": "paragraph", "text": "After the timeskip, Devon now sports a new outfit that makes her resemble more a classical pirate. She wears a bicorn hat decorated with a single rose and feathers on one side and a plume on the other, as well as the Blackbeard Pirates' Jolly Roger printed on the front, a corset that's longer on the back and extends all the way down to her knee area, a striped dress shirt, a cravat and heels that are slightly different from her previous ones. Her pants now have a pair of belts closing its hems. She also carries a sword on her right hip."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Catarina_Devon_Anime_Concept_Art.png/revision/latest/scale-to-width-down/180?cb=20180909234104", "caption": "Devon's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When the Marines recognized her for the first time, she mentioned that she \"likes them too\" which suggests that she is a somewhat sarcastic person. She also preferred to receive new clothes in exchange of the prisoners' uniform that she dislikes wearing. She is obsessed with collecting beautiful women's heads. Devon also seems loyal to Blackbeard after he freed her from Impel Down."}, {"type": "paragraph", "text": "She has a sadistic side, as seen when she mocked Gecko Moria over the death of his subordinate Absalom who she masqueraded as to give Moria a false sense of hope."}, {"type": "paragraph", "text": "Like other characters in One Piece, she has a distinct laughter which is \"Murunfuffuffu\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Catarina Devon is stated to be the most dangerous female pirate in history. Another testament to her power is the fact that when Blackbeard recruited the Level 6 prisoners, he only chose the strongest ones that could survive when pitted against everyone else in a free-for-all battle. Thus, Catarina Devon is one of the strongest Level 6 prisoners. Having been promoted to the Captain of the Sixth Ship is a testament of Teach's trust in her powers, and granting her the authority over the lower-ranking members."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Catarina Devon is one of the most powerful female pirates to have ever lived. She is one of the four to survive the battle royale Blackbeard held among the Level 6 prisoners of Impel Down who themselves were the strongest criminals to be imprisoned. She is strong enough to injure even Whitebeard using her spear. She has been also shown to have great superhuman endurance, taking both a Gura Gura no Mi shock wave from Whitebeard (albeit not a direct hit) and Sengoku's shock wave in his Buddha form and getting up rather easily."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Devon ate the Inu Inu no Mi, Model: Kyubi no Kitsune, a Mythical Zoan-type Devil Fruit that allows her to transform into a nine-tailed fox. With this power, she can transform into clones of people similar to the Mane Mane no Mi."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Inu_Inu_no_Mi%2C_Model_Kyubi_no_Kitsune_Infobox.png/revision/latest/scale-to-width-down/210?cb=20181201065656", "caption": "Devon transforming into a nine-tailed fox."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "She is proficient with using a whip. She is seen wielding a spear or a staff when attacking Whitebeard with her crew as it was the weapon available at the time. While unclear in the manga, the anime shows it is a spear."}, {"type": "paragraph", "text": "After the timeskip, she has obtained a sword and wears it on her right side. It is unknown how proficient she is with it, as her skill has yet to be seen."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Catarina_Devon_Fights_at_Marineford.png/revision/latest/scale-to-width-down/210?cb=20151021065822", "caption": "Devon using a spear against Whitebeard."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Catarina Devon was once the worst female criminal within the Golden Age of Piracy, but was eventually caught by the World Government and sentenced to life in Impel Down, Level 6, where she was effectively erased from history."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Devon was mentioned briefly by Emporio Ivankov as part of an explanation of Level 6's true horror to Mr. 2 Bon Kurei. Later, under Marshall D. Teach's orders, Devon fought to the death with the inmates of her cell, and being victorious, was given freedom and was recruited into the Blackbeard Pirates."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "She was seen alongside the Blackbeard Pirates and fellow criminals, all of whom have been recruited into the crew, at Marineford to watch Whitebeard die. She then joined her crew in striking Whitebeard, she in particular stabbing with a staff or spear."}, {"type": "paragraph", "text": "Whitebeard then dies and Blackbeard starts to absorb the power of the Gura Gura no Mi. Devon starts to get excited. When Blackbeard decides to sink Marineford, the Blackbeard Pirates are scattered. And as Sengoku causes a shockwave by attacking the Blackbeard Pirates, she is seen flying away. She leaves with her crew when Shanks arrives on the scene."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Whitebeard_vs_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/210?cb=20151018201408", "caption": "The Blackbeard Pirates dealing the death blow to Edward Newgate."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "She is seen again on a flaming island somewhere in the New World. She says that she wants the next island they arrive at to have a town since she is tired of her prison clothes and wants new clothes. She then leaves with her crew when Akainu arrives, leaving Jewelry Bonney to be captured by the admiral."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fd/Shiryu_Fire_Island.png/revision/latest/scale-to-width-down/210?cb=20130223001648", "caption": "Devon with the Blackbeard Pirates waiting for the delivery of a Marine ship."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "The Blackbeard Pirates used their captain's knowledge of Whitebeard's former territory to conquer it. Now that Blackbeard has become a Yonko, the Blackbeard Pirates are hunting down powerful Devil Fruit users in order to absorb their abilities. She also became one of the Ten Titanic Captains, the captain of the Sixth Ship of the Blackbeard Pirates."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates later attacked Baltigo, the Revolutionary Army's headquarters. Baltigo was destroyed by the time the Marines and Cipher Pol arrived, but the Revolutionary Army was able to escape. However, the Blackbeard Pirates fled after briefly clashing with Cipher Pol."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Gecko Moria was attacking Beehive to find Absalom, whom the Blackbeard Pirates had recently killed, Devon used her Devil Fruit powers to pose as Absalom. When Moria discovered Shiryu using Absalom's Suke Suke no Mi abilities, Devon transformed back to her human form as Blackbeard called out to Moria."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Blackbeard Pirates vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Fleet Admiral Sengoku", "elements": []}, {"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco, unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol (unseen)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, it was revealed an early concept of Catarina Devon. She was originally a far younger and more attractive swordswoman of Blackbeard's crew."}, {"type": "paragraph", "text": "In an SBS, Oda stated that he took out the beauty because the Blackbeard Pirates have a \"more pirate-like\" theme: huge, rough, and vulgar. A beauty would just ruin the mood if she existed (although Oda also stated that he likes doing such things)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7a/Early_Devon.png/revision/latest/scale-to-width-down/150?cb=20110301115239", "caption": "Early concepts of Catarina Devon from One Piece Green."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She is Impel Down's only named female prisoner who appears in the manga. However, another female prisoner named Olive appears in the anime.", "elements": []}, {"text": "Devon is the first known female Mythical Zoan user.", "elements": []}, {"text": "According to the One Piece Green: Secret Pieces databook, the Blackbeard Pirates were originally supposed to have a fox-woman crewmate known as Kitsune (キツネ, Kitsune). Part of this concept might have been salvaged by Devon having the Inu Inu no Mi, Model: Kyubi no Kitsune, which turns her into a literal kitsune.", "elements": []}, {"text": "Devon's favorite food is broiler sasami.", "elements": []}]}], "images": []}]}