{"sections": [{"title": "Sanjuan Wolf", "level": 1, "content": [{"type": "paragraph", "text": "Sanjuan Wolf is an enormous giant, known as \"Colossal Battleship\" for his size, and was originally one of the legendary criminals who was given a life sentence in Level 6 of Impel Down, as his crimes were so atrocious they had to effectively be erased from history itself. He was initially mentioned briefly by Emporio Ivankov."}, {"type": "paragraph", "text": "He was eventually freed from prison by Marshall D. Teach, and since then has become a member of the Blackbeard Pirates. He is currently one of the Ten Titanic Captains, and the captain of the Seventh Ship of the Blackbeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Thanks at least in part to his Devil Fruit, Wolf is a giant of extraordinary size, towering over even the largest beings known to date like Oars or Little Oars Jr., as well as being so big that he appears to be roughly the same size as the Marine Headquarters at Marineford. His head is shaped like an onigiri, and his facial features include round eyes with dark lines around them, along with eyelash-like marks, similar to those found on Franky's face, that point downward. He wears his prison uniform from Impel Down and he is barefooted. He also has light-brown hair, and a black beard covering the sides of his face."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Although known for committing crimes that caused his existence to be erased from history, he seems to have a playful attitude, as seen when commenting that he was found when he was trying to hide behind Marine Headquarters. He is also quite shy, as he acts scared when people realize who he is and continued hiding while the rest of the crew fought Whitebeard. In fact, he was the only person there who did not fight in the war. He is also prone to complaining, as shown when the Blackbeard Pirates headed to the New World. Despite his complaining and lack of participation, he is shown to be very loyal to Blackbeard."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Wolf's abilities have not yet been shown, but he was powerful enough to be contained in Level 6 of Impel Down when caught by the World Government. As a giant, he shares their attributes, including immense strength, though to what degree is unknown. Another testament to his power is the fact that when Blackbeard recruited the Level 6 prisoners, he was one of the people that survived the battle royale, making him one of the strongest prisoners. As one of the Ten Titanic Captains of the Blackbeard Pirates, Wolf has authority over their Seventh Ship and everyone on it."}, {"type": "paragraph", "text": "Despite his tremendous size, he was somehow able to reach Marineford without being detected until he was right behind the Marine Headquarters building."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Wolf has eaten a Paramecia Devil Fruit that makes him bigger than normal giants. Despite being weak against water, he was tall enough to stand in the ocean."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Imprisonment in Impel Down", "level": 4, "content": [{"type": "paragraph", "text": "Wolf was born in the West Blue. At some time, he ate a Devil Fruit that gave him the size he is known for. He became one of the most feared criminals in the world, and is noted to be the only known giant of his size, but was eventually caught by the World Government and sentenced to life in Impel Down, Level 6, where he was effectively erased from history. Only a few people such as Emporio Ivankov knew who he was."}, {"type": "paragraph", "text": "When Blackbeard and his crew came to Impel Down, he was liberated from his prison cell by them along with Catarina Devon, Vasco Shot, and Avalo Pizarro after fighting to the death in their own cells and emerging victorious. He and his fellow prisoners were then recruited into the Blackbeard Pirates and went to Marineford."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates arrived to the Battle of Marineford. Wolf hid behind the Marine Headquarters, and was amused when the Marines spotted him and recognized him. Wolf did not participate in his crew's murdering of Whitebeard, and departed with them after Shanks arrived to end the war."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/The_New_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/210?cb=20160322173214", "caption": "Wolf with his new crew at Marineford."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates went on to the New World, but thanks at least in part to Wolf, their log raft was damaged. They defeated Jewelry Bonney and her crew on a burning island, intending to trade Bonney to the Marines for a Marine battleship. Wolf stood in the ocean near its coast and complained about losing strength, but Blackbeard told him to stop complaining. The Blackbeard Pirates then had to flee the island after spotting Admiral Akainu on the oncoming Marine battleship, believing he would not make the deal with them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/San_Juan_Rests.png/revision/latest/scale-to-width-down/220?cb=20130223001322", "caption": "Sanjuan Wolf resting in the ocean near the island's bay."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "The Blackbeard Pirates used their captain's knowledge of Whitebeard's former territory to conquer it. With Blackbeard now a Yonko, the crew began hunting powerful Devil Fruit users for their fruits."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates later attacked Baltigo, the Revolutionary Army's headquarters. Baltigo was destroyed by the time the Marines and Cipher Pol arrived, but the Revolutionary Army was able to escape. However, the Blackbeard Pirates fled after briefly clashing with Cipher Pol."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco, unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol (unseen)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He is the first canon giant to be confirmed to have eaten a Devil Fruit.", "elements": []}, {"text": "His unnamed Devil Fruit is the inverse of two non-canon Devil Fruits: the Mini Mini no Mi and Moa Moa no Mi.", "elements": [{"text": "The Mini Mini no Mi turns the user smaller, while Wolf's Devil Fruit makes him bigger.", "elements": []}, {"text": "The Moa Moa no Mi turns other objects bigger, while Wolf's fruit makes himself bigger.", "elements": []}]}, {"text": "His Devil Fruit is similar to Urouge's unnamed Devil Fruit, as both can make the users bigger.", "elements": []}, {"text": "Wolf's favorite food is salt-grilled Sea King.", "elements": []}, {"text": "His name might be based on the Spanish Warship, San Juan Nepomuceno. This inspiration has not been confirmed yet.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 575 (p. 13-15) and Episode 484, Wolf is seen alongside Blackbeard in Marineford.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 72), Sanjuan Wolf's birthday is given.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Information about Sanjuan Wolf is revealed", "elements": []}, {"text": "↑  Eternal Log", "elements": []}, {"text": "↑  One Piece Manga — Vol. 61 Chapter 595 (p. 6), Sanjuan Wolf's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 55 Chapter 538 (p. 11) and Episode 440, Sanjuan Wolf is mentioned by Emporio Ivankov.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 575 (p. 13) and Episode 484, Sanjuan Wolf's face is seen for the first time.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 576 (p. 2) and Episode 484, Sanjuan Wolf is recognized by the Marines.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 595 and Episode 513.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 580 and Episode 489.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 824.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904.", "elements": []}]}], "images": []}]}