{"sections": [{"title": "Seira", "level": 1, "content": [{"type": "paragraph", "text": "Seira is a bluestriped angelfish mermaid and a dancer in the Mermaid Cafe."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Seira is a mermaid with brunette hair tied in a ponytail and a pink tail with purple marks."}, {"type": "paragraph", "text": "She wears a pair of shell headphones, a yellow bikini with blue flowery straps, a red pearl necklace and red lipstick."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Seira_without_Headphones.png/revision/latest?cb=20150523035851", "caption": "Seira without her headphones"}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like all other mermaids, Seira is kind and caring, and is apparently fun loving. When meeting Luffy, Usopp, Sanji and Chopper for the first time she comments approvingly on their boldness of having entered Fish-Man Island illegally, stating that she loves pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being a mermaid, Seira has several abilities unique to her race. It is not yet shown but she may have the ability to talk to fish and call out to them using sonar waves, which is one of the basic abilities found in all mermaids and some Fish-Men. Apart from the ability to breathe underwater, as a mermaid she also has the ability to swim very quickly at speeds much faster than the flying fish used by the Flying Fish Riders. However, like any mermaid, she is vulnerable on land."}, {"type": "paragraph", "text": "She also appears to be a skilled dancer."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c5/Seira_Dancing.png/revision/latest/scale-to-width-down/120?cb=20120203081251", "caption": "Seira dancing at the banquet."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Seira and her friends first appeared in Mermaid Cove, welcoming the Straw Hat Pirates when Camie brought them there for a visit. When the three princes arrived to inquire the crew's illegal entry into Fish-Man Island, the mermaids denied the crew was there, hiding them. However, when the crew's presence were made known anyways by Sanji's nosebleed and Hammond's attack, the princes made it clear that they were simply trying to deliver Jinbe's message to Monkey D. Luffy."}, {"type": "paragraph", "text": "After the civil war between the Straw Hats and the New Fish-Man Pirates ended, Seira and her friends danced at the Ryugu Palace banquet in honor of the Straw Hats' victory and saw them off when they departed to the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Lulis_and_Seira_Say_Goodbye.png/revision/latest/scale-to-width-down/190?cb=20121118013410", "caption": "Seira and her friends bidding the Straw Hats goodbye."}]}, {"title": "Caribou's Kehihihihi in the New World", "level": 3, "content": [{"type": "paragraph", "text": "Some time after the Straw Hats left, Seira and her friends witness Caribou attempting to kidnap a helpless mermaid."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 (p. 15) and Episode 527, Seira makes her debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 65, Seira's name, employment, and type of fish revealed by Oda.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 609 and Episode 528, Sanji enjoying his time with the mermaids of Mermaid Cove.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 and Episode 569, Seira dances at the banquet in Ryugu Palace.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 and Episode 527.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 609 and Episode 528.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 66 Chapter 653, Seira and her friends went to see the Straw Hat Pirates depart for the New World.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 68 Chapter 674, cover story: Caribou's Kehihihihi in the New World Vol. 1.", "elements": []}]}], "images": []}]}