{"sections": [{"title": "Hiramera", "level": 1, "content": [{"type": "paragraph", "text": "Hiramera is an olive flounder mermaid and a dancer in the Mermaid Cafe."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hiramera is a mermaid with light pink hair that has been tied into flowing pigtails and a yellow tail with darker yellow spots. She wears a purple shirt with pearls with her cleavage revealed, and lipstick. In the manga, she is shown to have a long fin frill on either side of her tail. This is absent in the anime."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like all other mermaids, Hiramera is kind and caring, and is apparently fun loving."}, {"type": "paragraph", "text": "When the Straw Hat Pirates were accused of kidnapping mermaids, Hiramera was the one to defend them, saying they seemed like nice people and are Camie's friends after all."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a mermaid, Hiramera can breathe underwater, speak to fish via sonar waves, and they are generally considered the fastest swimmers in the world. She also appears to be a skilled dancer."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Hiramera and her friends first appeared in Mermaid Cove, welcoming the Straw Hat Pirates when Camie brought them there for a visit. When the three princes arrived to inquire about the crew's illegal entry into Fish-Man Island, the mermaids denied that the crew was there, hiding them. However, when the crew's presence was made known anyways by Sanji's nosebleed and Hammond's attack, the princes made it clear that they were simply trying to deliver Jinbe's message to Monkey D. Luffy."}, {"type": "paragraph", "text": "After Ishilly, Fillonce and another mermaid were kidnapped by Caribou and the Straw Hats were made suspects, Hiramera tried to vouch for them, telling some Ammo Knights that the Straw Hats are good people. Later, Hiramera and the other citizens heard the news that the Straw Hats \"took over\" Ryugu Palace. Hiramera looked confused since she never believed the Straw Hats to be bad people."}, {"type": "paragraph", "text": "After the civil war between the Straw Hats and the New Fish-Man Pirates ended and the Straw Hats were cleared of all crimes, Hiramera and her friends danced at the Ryugu Palace banquet in honor of the Straw Hats' victory and saw them off when they departed to the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Hiramera_Dancing.png/revision/latest/scale-to-width-down/210?cb=20130626054526", "caption": "Hiramera dancing at the banquet."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Mermaids_Say_Goodbye.png/revision/latest/scale-to-width-down/190?cb=20130112080756", "caption": "Hiramera and her friends bidding the Straw Hats goodbye."}]}, {"title": "Caribou's Kahihihihi in the New World", "level": 3, "content": [{"type": "paragraph", "text": "Some time after the Straw Hats left, Hiramera and her friends witness Caribou attempting to kidnap a helpless mermaid."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name comes from hirame (ヒラメ, hirame), the Japanese name for olive flounder.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 (p. 15) and Episode 527, Hiramera makes her debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 65, Hiramera's name, employment and type of fish revealed by Oda.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 and Episode 569, Hiramera dances at the banquet in Ryugu Palace.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 609 and Episode 528, Sanji enjoying his time with the mermaids of Mermaid Cove.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 66 Chapter 653, Hiramera and her friends went to see the Straw Hat Pirates depart for the New World.", "elements": []}]}], "images": []}]}