{"sections": [{"title": "Mero", "level": 1, "content": [{"type": "paragraph", "text": "Mero is a smelt-whiting mermaid and an employee of the Mermaid Cafe."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mero is a young mermaid with long, flowing blue hair, with a yellow flower attached to the right side and blue eyes. She wears a revealing purple flower pattern bikini. Her fishtail has the color of pearl blue."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like all other mermaids, Mero is kind and caring, and is apparently fun loving."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a mermaid, Mero can breathe underwater, speak to fish via sonar waves, and they are generally considered the fastest swimmers in the world. She also appears to be a skilled dancer."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Mero and her friends first appeared in Mermaid Cove, welcoming the Straw Hat Pirates when Camie brought them there for a visit. Seeing them, Mero commented that they didn't appear very frightening. When the three princes arrived to inquire about the crew's illegal entry into Fish-Man Island, the mermaids denied the crew was there, hiding them. However, when the crew's presence were made known anyways by Sanji's nosebleed and Hammond's attack, the princes made it clear that they were simply trying to deliver Jinbe's message to Monkey D. Luffy."}, {"type": "paragraph", "text": "After Ishilly, Fillonce, and another mermaid were kidnapped by Caribou, Mero and the others wondered where they went off to and they had no clue of what happened to them. The only thing they did know was that Ishilly was opening a barrel."}, {"type": "paragraph", "text": "After the civil war between the Straw Hats and the New Fish-Man Pirates ended, Mero and her friends danced at the Ryugu Palace banquet in honor of the Straw Hats' victory and saw them off when they departed to the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/96/Mero_Dancing.png/revision/latest/scale-to-width-down/185?cb=20121022035244", "caption": "Mero dancing at the banquet."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Mermaids_Say_Goodbye.png/revision/latest/scale-to-width-down/190?cb=20130112080756", "caption": "Mero and her friends bidding the Straw Hats goodbye."}]}, {"title": "Caribou's Kehihihihi in the New World", "level": 3, "content": [{"type": "paragraph", "text": "Some time after the Straw Hats left, Mero and her friends witness Caribou attempting to kidnap a helpless mermaid."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She is the same type of mermaid as Shirahoshi.", "elements": []}, {"text": "Her name sounds similar to Merrow, the Scottish and Irish Gaelic equivalent of the mermaid and mermen of other cultures.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 (p. 15) and Episode 527, Mero makes her debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 65, Mero's name, employment and type of fish revealed by Oda.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 609 and Episode 528, Sanji enjoying his time with the mermaids of Mermaid Cove.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 and Episode 569, Mero dances at the banquet in Ryugu Palace.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 and Episode 527, Mero appears to greet everyone.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 609 and Episode 528, Mero finds out what the princes want with the pirates.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 610 and Episode 529, Mero wondering where the missing mermaids are.", "elements": []}, {"text": "↑  One Piece Anime — Episode 573, Mero says goodbye to the pirates.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 68 Chapter 675, cover story: Caribou's Kehihihihi in the New World Vol. 2, Mero sees Caribou kidnapping a mermaid.", "elements": []}]}], "images": []}]}