{"sections": [{"title": "Bastille", "level": 1, "content": [{"type": "paragraph", "text": "\"Shark Cutter\" Bastille is a Marine vice admiral who took part in the Summit War of Marineford. He later appeared in Dressrosa under the command of Admiral Fujitora."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bastille is a tall man, around twice the height of an ordinary human. He wears a gray metal mask with fourteen (ten in the anime before the timeskip) eye-holes and two long, curved bull horns and his face has never been fully exposed. His long orange hair falls to the front of his chest and the rest of his hair can be seen going down his back. As with many high-ranking officers, he wears a double-breasted suit with a blue shirt and black tie, and the military overcoat draped over his shoulders, and a chain around the neck area."}, {"type": "paragraph", "text": "In his youth, his hair was much shorter. He also wore a different mask with equally shorter horns and only twelve eye-holes on the mask, unlike the more imposing one he now uses."}, {"type": "paragraph", "text": "Bastille's first present-day mask was destroyed after Sabo used Ryusoken to initially crack it, then plucked it from Bastille's face upon defeating him and crushed it in a display of power before other Marines. He replaced it with a similar mask that had a different pair of horns which are more angular and have ridges."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, he likely holds a strong belief in justice. Whether he believes in moral justice or absolute justice, however, is not known as of yet. He is also rather displeased with junior colleagues who he believes to act rashly. He also has a tendency to end his sentences with \"-dara\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine vice admiral, Bastille has authority over lower-ranking subordinates."}, {"type": "paragraph", "text": "He has strength that surpasses an average human, showcased when he could wield his gigantic sword with one hand."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Bastille carries a large sword with a Japanese hilt wrapped in a pink material, similar to Vice Admiral Strawberry's. It has an elongated hand-guard decorated by a red jewel, like the pommels, and a blade with a rounder curve than those of katanas. However, he has not been seen using it."}, {"type": "paragraph", "text": "After the time skip, in Dressrosa, he carries a large zanbato, with a design similar to a cleaver, called the Same-kiri Bocho. It was broken by Sabo."}, {"type": "paragraph", "text": "While confronting Franky at the Toy House in the anime, he was shown using a Flying Slash Attack against him, although the cyborg easily blocked it. Then before he was defeated by Sabo, he attempted to strike him and his sword swings alone easily sliced through nearby buildings."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Bastille possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Bastille reported to the summoning of the Marines to reinforce Marineford. Later, he was seen with his fellow vice admirals lined up and ready to fight the Whitebeard Pirates."}, {"type": "paragraph", "text": "When the Blackbeard Pirates arrived, Bastille was seen behind Strawberry, shocked to see Marshall D. Teach's new crewmates, the prisoners from level 6 of Impel Down."}, {"type": "paragraph", "text": "After Shanks arrived and called for a ceasefire, Bastille stood down along with the other Marines."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Bastille and a large assembly of Marines gathered outside Corrida Colosseum, waiting to ambush and arrest criminals as they leave. He was confused as to why none of the losers from blocks A and B had left yet. When a Marine told him that Vice Admiral Maynard was undercover as a fighter inside but cannot be contacted, Bastille criticized the junior vice admiral for acting on his own and concluded that something strange is probably going on in the Colosseum."}, {"type": "paragraph", "text": "A Marine reported that a suspicious looking man they had seen before was indeed \"Pirate Hunter\" Zoro and the other man with him was most likely \"Straw Hat\" Luffy. Bastille concluded that the reason the fighter Lucy is so powerful is because he is in fact Monkey D. Luffy, realizing the pirate is in the country after all. Rather than go after them, Bastille decided to leave them alone for the time being, saying that if they make a move now, all the other criminals in the colosseum will make a mad dash for the door, and they could lose their target amidst the chaos. Having apparently forgotten about the criminals, Bastille wondered who they were there to arrest."}, {"type": "paragraph", "text": "A destructive fight nearby caught Bastille's attention and he and his subordinates watched in shock as Donquixote Doflamingo shot Trafalgar Law multiple times in the chest."}, {"type": "paragraph", "text": "He then watched as Zoro and Kin'emon rushed Doflamingo to save Law. He was about to take action, but Issho arrived on the scene. Once Issho and Doflamingo left with an unconscious Law, the Marines began pursuing Luffy, Zoro, and Kin'emon."}, {"type": "paragraph", "text": "When Block D reached its conclusion, Bastille told his troops about the story of the Kamaitachi of Rommel, which is Hakuba, Cavendish's alter-ego that surfaces whenever Cavendish falls asleep. He also informed them that Hakuba would be chased out to sea after committing his crimes, but Cavendish was the one who became a pirate himself. Bastille told them not to pity him since Cavendish enjoys all the fame he received. He commented that Hakuba is even stronger than Cavendish, but his predisposition to fall back asleep was quite unsuitable for a contest-style match."}, {"type": "paragraph", "text": "While Franky was battling against Senor Pink and Machvise, Bastille and his men surround the toy house in an attempt to arrest Franky."}, {"type": "paragraph", "text": "Bastille was later seen with Issho as all the toys transformed back into their original forms, causing a widespread panic."}, {"type": "paragraph", "text": "As his Marine troops panicked about being unable to contact headquarters, Bastille watched as Doflamingo trapped Dressrosa in his \"bird cage\"."}, {"type": "paragraph", "text": "After Doflamingo forced everyone into a survival game, Issho ordered Bastille to not capture Doflamingo and to tell all squads to focus on stopping the civilians from hurting each other. Issho clarified that the Straw Hats and Law are their main targets."}, {"type": "paragraph", "text": "When Maynard left the colosseum to report to his colleagues, Bastille scolded him for acting on his own before Maynard explained about discovering Doflamingo's connection with the underworld."}, {"type": "paragraph", "text": "Bastille, Issho, and an army of Marines were later stationed at the base of the new King's Plateau apparently to hinder the Straw Hats from reaching Doflamingo. However, while Luffy and his allies from the colosseum were charging up the new King's Plateau, the Marines were confronted by Sabo."}, {"type": "paragraph", "text": "As Sabo fought and overpowered more Marines, Bastille ordered them not to attack Sabo head on. Bastille then charged at Sabo himself, but the revolutionary effortlessly shattered his sword right before dealing the finishing blow to the vice admiral, grabbing his mask and then crunching his skull with his Ryusoken. Sabo claimed Bastille's mask and then shattered it in his grip."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. By then, Bastille had been healed of his injuries and had a new mask. After hearing that the Straw Hats were heading for the eastern port, Bastille ordered reinforcements to be sent there. Bastille tried to contact the surveillance squads stationed at all the ports the ports of Dressrosa, ordering them to converge on the eastern port where the pirates were heading. However, when he tried to speak with the eastern port squad itself, he was given a bogus report from Abdullah and Jeet pretending to be Marines, who had already beaten up several weakened Marines with Ideo and stolen one of their Den Den Mushi. Once they said that nothing was out of order when the pirates were clearly descending upon the port and even denied the need for reinforcements, Bastille grew suspicious and angrily demanded a Marine code and name. When Jeet was unable to respond, Bastille realized the port had been taken and had the pursuit squad sent to the east."}, {"type": "paragraph", "text": "To Bastille's frustration, he received word of how the Marines were unable to send reinforcements due to complications such as stolen weapons, ships stitched together, and troops collapsing.  Bastille then witnessed Issho using his gravity ability to lift all the rubble from Dressrosa in preparation to attack Luffy's allies at the eastern port. Seeing this turn of events, Bastille called off reinforcements."}, {"type": "paragraph", "text": "Bastille was later displeased to hear that Issho decided to drop the rubble but not on Luffy and his allies."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4b/Bastille_Defeated_by_Sabo.png/revision/latest/scale-to-width-down/210?cb=20150405232958", "caption": "Bastille after his defeat at the hands of Sabo, who crushes his mask."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Marines and Shichibukai vs. Whitebeard Pirates and their allies", "elements": []}, {"text": "Marines and Diamante Army vs. Franky", "elements": []}, {"text": "Bastille vs. Sabo", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bastille vs. Franky", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bastille was a fortress in Paris, known formally as the Bastille Saint-Antoine. It played an important role in the internal conflicts of France and for most of its history was used as a state prison by the kings of France.", "elements": [{"text": "One of the prisoners at Bastille famously wore an iron mask.", "elements": []}, {"text": "Bastille's birthday, July 14, is the anniversary of the Storming of the Bastille and is known as Bastille Day.", "elements": []}]}, {"text": "Bastille was erroneously stated to be a giant in the One Piece Blue Deep databook. He is never referred to as one in the series itself, and his size is inconsistent with all giants shown thus far, being no larger than tall humans such as the Kairiki Destroyers. Oda later confirmed in an SBS that the minimum height for giants is 12 meters.", "elements": []}]}], "images": []}]}