{"sections": [{"title": "Scopper Gaban", "level": 1, "content": [{"type": "paragraph", "text": "Scopper Gaban was a former crew member of the Roger Pirates. His current whereabouts and status are unknown."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a tall, well built man with long black hair, tan skin and a narrow chin. He wears a large blue shirt with rolled-up sleeves and is always seen wearing a pair of round, black sunglasses. He also has two long and blue-striped tattoos going down from both of his shoulders down to his chest."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appears to be rather jolly and he used to enjoy teasing the crew's pirate apprentices, Buggy and Shanks."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Gaban's strength or abilities."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/db/Gaban%27s_Axe.png/revision/latest/scale-to-width-down/210?cb=20130425233927", "caption": "Gaban wielding his axe."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During Buggy's flashback, Gaban was shown wielding an axe in his right hand and another weapon in his left hand, during a raid on a ship."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Battle at Edd War", "level": 3, "content": [{"type": "paragraph", "text": "Twenty-seven years ago, Gaban was present with the rest of the Roger Pirates in the sea known as Edd War, where they were confronted by Shiki, the captain of the Golden Lion Pirates. Shiki demanded to form an alliance with the Roger Pirates in hopes of taking over the world and if they did not agree, Shiki would destroy them with his armada. While this event occurred, Gaban tried his best to calm down Buggy, who was hoping to surrender to Shiki, but in the end Roger refused the alliance thus resulting in an epic battle where the entire crew, including Gaban fought it out. Luckily, fate was on the Roger Pirates' side as during the battle, a massive storm formed and sunk half of Shiki's armada, resulting in the Roger Pirates' victory. This event was forever known as the Battle of Edd War."}], "images": []}, {"title": "The Pirate King's Execution", "level": 3, "content": [{"type": "paragraph", "text": "It is unknown whether or not he attended his captain's execution at Loguetown, but a year before their captain's death the entire crew disbanded and went their own separate ways. What became of Gaban is unknown."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The name \"Scopper\" may be a reference to copper, a component of bronze, continuing the metal naming theme among some of the members of the Roger Pirates.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 19 (p. 10) and Episode 0.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 212), His name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 0 Chapter 0 and Episode 0.", "elements": []}]}], "images": []}]}