{"sections": [{"title": "Heat", "level": 1, "content": [{"type": "paragraph", "text": "Heat is a member of the Kid Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Heat has long light blue, shaggy hair. His mouth stretches to the sides of his face like a Glasgow smile. He has black sunken eyes and visible bone ridges on his forehead. There are stitched scars at his chin, mouth-line, and the high point of his cheeks. Thorn tattoos run along his shoulders, arms, and neck."}, {"type": "paragraph", "text": "He wears a dark blue corset laced with red string, red pants with an armored pad over his right leg, and long brown boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He holds high respect for his captain, Eustass Kid. This is seen when he exclaimed \"Master Kid!\" out of shock, when his captain was shot in the leg by a Pacifista."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Heat has the ability to breathe fire; how he does it has yet to be explained. Like the rest of the crew, he possesses a strong will, being resistant to Rayleigh's Haoshoku Haki."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Heat_Firebreath.png/revision/latest/scale-to-width-down/210?cb=20120814132532", "caption": "Heat breathing fire at a Pacifista."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Heat wielded two swords when he stood against a Pacifista."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Heat first appears along with the rest of the Kid Pirates at the Human Auctioning House. They came hoping to bid on a certain slave, but it was not up for auction at that time. He was surprised when Luffy attacked a World Noble. Later, he and the rest of the Kid Pirates were confronted by a Pacifista, which Heat attacked by breathing fire on it."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Heat, along with the rest of his crew, stays behind on Sabaody to watch the war at Marineford unfold on a big screen. Later, they all went closer to Marineford in their ship to see the war put to an end by Red-Haired Shanks."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After entering the New World, the Kid Pirates docked on an island where Heat and his crew mates captured a group of pirates trying to escape back to Paradise."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Heat and his crew were seen celebrating along with crew members from the Hawkins Pirates and On Air Pirates after forming an alliance with them. When Kaido landed on their island after jumping from a sky island, Heat was blown back by the force of the collision along with other crew members."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kid Pirates, Heart Pirates, and Straw Hat Pirates vs. Marines", "elements": []}, {"text": "Kid Pirates and Heart Pirates vs. Pacifista", "elements": []}, {"text": "Kid Pirates vs. Haritsu Kendiyo and crew", "elements": []}, {"text": "Kid Pirates vs. Big Mom Pirates' allies (unseen)", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 500 and Episode 394, Heat makes his debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), His name is revealed.", "elements": []}]}], "images": []}]}