{"sections": [{"title": "Mozambia", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Mozambia is a high ranking Marine Officer who attended the meeting with the Shichibukai to discuss the issue with Crocodile's replacement."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mozambia is a dark-skinned man with short dark gray hair and a scar on the left side of his face, which he had since his early days as a marine. He wears a brown suit with a blue shirt and tie, with the standard Marine coat draped over his shoulders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Mozambia_as_a_Young_Marine.png/revision/latest?cb=20130703185929", "caption": "A younger Mozambia in the marines."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When his body was manipulated by Shichibukai Doflamingo, Mozambia panicked because he did not know the cause of the manipulation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine vice admiral, Mozambia is capable of commanding a Buster Call alongside other vice admirals. He also has authority over lower-ranking subordinates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Mozambia was seen carrying a katana during the meeting at Mary Geoise and at the Battle of Marineford."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Mozambia can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mozambia was first seen in the Crocodile's Shichibukai replacement meeting held at Mariejois. To kill his boredom, Shichibukai Doflamingo used his body manipulation ability to make Mozambia and Stainless fight each other. Soon the fight was stopped when Fleet Admiral Sengoku told Doflamingo to stop messing around."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e0/Stainless_Being_Strangled.png/revision/latest/scale-to-width-down/200?cb=20130420054301", "caption": "Mozambia unwillingly strangling Stainless and struggling against Doflamingo's puppet ability."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Mozambia reported to the summoning of the Marines to reinforce Marineford. Later, he was seen with his fellow vice admirals lined up and ready to fight the Whitebeard Pirates. When the Whitebeard Pirates advanced into the plaza, he ordered his underlings to attack Edward Newgate. When Luffy was trying to get to the execution platform, he ordered Marines to stop him. Upon Shanks' arrival, when truce was declared, he stood down under Sengoku's orders."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mozambia vs. Vice Admiral Stainless (Controlled by Donquixote Doflamingo)", "elements": []}, {"text": "The Marines and Shichibukai vs. Whitebeard Pirates and Allies", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 234 and Episode 151, Mozambia is seen in Crocodile's replacement meeting.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 212), His name and marine rank are revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 234 and Episode 151.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 462.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 and Episode 511, Dr. Fishbonen states Haki is a power all the vice admirals use.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 462, Mozambia is seen next to Comil and Tsuru.", "elements": []}]}], "images": []}]}