{"sections": [{"title": "Cancer", "level": 1, "content": [{"type": "paragraph", "text": "Cancer is a Marine vice admiral."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cancer is a middle-aged man with slicked-back hair, sunglasses, and is often seen with a cigar in his mouth. He has a scar running straight down from his left eye. His hair has been shown to be blonde in the anime, but it has been shown in a variety of colors, ranging from blonde to gray, in the digitally colored manga. Cancer also wears a suit and tie under his Marine coat."}, {"type": "paragraph", "text": "In the anime, during the Marineford Arc, Cancer was shown with black hair, although the manga itself shows that his hair is light-colored."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bc/Cancer_as_a_Young_Marine.png/revision/latest?cb=20190124101231", "caption": "Cancer as a young Marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Cancer strongly believes in Justice, though whether he believes in moral justice or absolute justice is not known yet."}, {"type": "paragraph", "text": "Cancer was shocked to see the Whitebeard Pirates' paddle ship surface after it was hidden under the bay at Marineford."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Cancer has authority over lower-ranking subordinates. His physical abilities are unknown."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During the Battle of Marineford, Cancer wielded a sword."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Cancer can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "Cancer was first seen sitting next to Vice Admiral Stainless at the meeting about Luffy's first bounty."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Stainless_Beside_Cancer.png/revision/latest?cb=20120307195350", "caption": "Cancer next to Stainless."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Cancer attended the meeting held at Mary Geoise to discuss Crocodile's Shichibukai replacement. Doflamingo used his body manipulation ability to make Vice Admiral Mozambia and Vice Admiral Stainless fight each other. Cancer wanted to stop Mozambia, but Doflamingo's manipulation was too strong."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Cancer was seen behind Vice Admiral Stainless and Vice Admiral Doberman, along with his fellow vice admirals, lined up and ready to fight the Whitebeard Pirates. When Oars Jr. joined the battle, Cancer, Doberman, Momonga, and Onigumo stood before him. Later, he was seen alongside Vice Admiral Tsuru, and was shocked when it was revealed that the Whitebeard Pirates had hidden another ship below the bay."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Z", "level": 3, "content": [{"type": "paragraph", "text": "Cancer was seen at the new Marine Headquarters, attending a meeting alongside other strong Marines about former Admiral Zephyr destroying the first Endpoint in the New World."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Marines and Shichibukai vs. Whitebeard Pirates and Allies", "elements": []}]}], "images": []}, {"title": "Anime and Manga Difference", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Cancer did not appear next to Stainless in the meeting about Luffy's first bounty. In Episode 151, he does not have his scar."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cancer's name may refer to the Cancer constellation or genus of Cancer crabs.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 11 Chapter 96 (p. 5), Cancer is briefly seen during the meeting about Luffy's first bounty.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 234 (p. 2-3) and Episode 151, Cancer attends Crocodile's replacement meeting.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 212), His name and marine rank are revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 566 (p. 11) and Episode 475, Cancer is surprised at the appearance of the Whitebeard Pirates' hidden ship.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 554 (p. 14), Cancer and the other vice admirals stand before Oars Jr. as the giant joins the battle.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 and Episode 511, a doctor states that all the vice admirals can use Haki.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 553 (p. 11), Cancer is seen behind Stainless and Doberman at Marineford.", "elements": []}, {"text": "↑  One Piece Movie 12, Cancer attends a meeting about Zephyr.", "elements": []}]}], "images": []}]}