{"sections": [{"title": "Wire", "level": 1, "content": [{"type": "paragraph", "text": "Wire is a member of the Kid Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is the tallest member of the Kid Pirates, being about one meter taller than Kid and Killer. He wears a dark brown headdress like a cloak, a wire shirt, black shorts, and black fishnet stockings. He has the crew's Jolly Roger over his chest and a necklace with small ax blades on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Wire is not very talkative and usually, he does not show any type of emotion, as he is often seen standing in the background with a mopish expression in his face. He did, however, express shock when Kid was attacked by a Pacifista."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "His weapon of choice is a dark red trident, and he is strong enough to withstand the blast of Haki that Silvers Rayleigh used at the Human Auctioning House on Sabaody Archipelago."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Wire%27s_Trident.png/revision/latest/scale-to-width-down/100?cb=20131011025611", "caption": "Wire and his trident."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Along with the rest of the Kid Pirates, Wire was at Sabaody Archipelago at the same time as the other supernovas. He was able to escape the attack of Admiral Kizaru."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Wire and the rest of his crew were present at Sabaody Archipelago to watch the war at Marineford via a visual broadcast. Later, they all went closer to Marineford in their ship to see the conclusion of the war."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Wire was later seen in the New World with the rest of his crew, torturing a small crew who had just entered the New World and wanted to go back to Paradise."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Wire and his crew were seen celebrating along with crew members from the Hawkins Pirates and On Air Pirates after forming an alliance with them. When Kaido landed on their island after jumping from a sky island, Wire was standing over the crater to see what landed."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kid Pirates, Heart Pirates, and Straw Hat Pirates vs. Marines", "elements": []}, {"text": "Kid Pirates and Heart Pirates vs. Pacifista", "elements": []}, {"text": "Kid Pirates vs. Haritsu Kendiyo and crew", "elements": []}, {"text": "Kid Pirates vs. Big Mom Pirates' allies (unseen)", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 500 and Episode 394, Wire makes his debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), His name is revealed.", "elements": []}]}], "images": []}]}