{"sections": [{"title": "Sicily", "level": 1, "content": [{"type": "paragraph", "text": "Sicily is a Marine Rear Admiral."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sicily is a man with a thin black mustache, brown colored hair and beard, and a scar below his left eye. He wears a classical Marine officer uniform, with the hat provided with plume."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like many marines, he fights for Justice, although whether he believes in moral justice or absolute justice is not known."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine rear admiral, he has power over lower-ranking subordinates. He is not shown fighting."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "When Luffy attacked Charlos at the Human Auctioning House, Sicily reported the incident to Sengoku, citing all parties involved, which included the Kid Pirates and Heart Pirates. He told him that they had thirteen bounties confirmed, and of those thirteen, five of them were over 100,000,000. He pinned Monkey D. Luffy as the primary offender, since he started the incident. He is about to say it was at the Human Auctioning House, but corrects himself and calls it the public employment security office. He goes on to say this this is a high priority incident since three World Nobles are being held hostage. He finished his report by telling Sengoku that the pirates had not made any demands yet."}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Sicily was replaced with an unnamed Marine with dark-brown beard and hair, without the plume, the mustaches, the scar on his face and with a leaner body."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/64/Anonymous_Marine_Replacing_Sicily.png/revision/latest/scale-to-width-down/150?cb=20131012003735", "caption": "The Marine replacing Sicily."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He shares his name with Sicily, an island in the Mediterranean Sea.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 52 Chapter 504, Sicily reporting to Sengoku on Luffy's attack on Charlos.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Sicily's birthday is given.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), Sicily's name and position are revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 398, Sicily replaced with an unnamed Marine in the anime.", "elements": []}]}], "images": []}]}