{"sections": [{"title": "Scotch", "level": 1, "content": [{"type": "paragraph", "text": "\"Iron Boy\" Scotch is a member of the Beasts Pirates working as the guardian of one of the Yonko Kaido's favorite islands."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Scotch is a large man of great height. He is also a cyborg with modified body parts. His shoulders and head are covered in metal plating and his face is completely white and also appears to be made out of metal. He has a triple-barrel gun in place of his right hand."}, {"type": "paragraph", "text": "He wears a large maroon winter jacket with gray pauldrons on its shoulders with the number \"18\" on each of them, a black cavalier hat with a long and wild red plume, pink trousers with purple stripes, and black boots on his small feet."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Scotch appears to be a rather passive individual. While determined to protect the island, he seems to prefer to not fight and casually warns people that the island belongs to Kaido and tells them to leave. He clarified to X Drake that he is not threatening him but that he is simply warning him."}, {"type": "paragraph", "text": "However, when he notices that a battle is about to start and cannot be avoided anymore, he will attack. When duty calls and his services are needed, Scotch seems to have a ruthless streak of sorts, evidenced when he crushed Gaburu's rebellion in cold blood to teach the revolutionaries a lesson. He has no qualms against attacking an old woman."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Yonko Kaido entrusted him as a guardian of one of his favorite islands, Scotch is undoubtedly a powerful fighter. Indeed, he single-handedly overwhelmed Gaburu's rebellion, while surviving an encounter with Super Rookie X Drake invading the island."}, {"type": "paragraph", "text": "However, despite being a trusted subordinate of Kaido, he is apparently powerless against a Logia as Caribou was able to defeat him without much problem."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Scotch wields a large sword on his back so it's safe to presume that he is proficient in using it. His right hand has also been outfitted with a large triple barrel gun, and most of his body is covered in protective metal plating."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Upon X Drake's arrival to the New World, he came upon a winter island which was guarded by Scotch and a few henchmen. Scotch proceeded to tell Drake that the island is a favorite of Kaido's and is under his protection. Drake then asked if attacking Scotch would gain the Yonko's attention, to which he replied with a \"yes\". Drake then activated his Devil Fruit and prepared to engage the cyborg in battle."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Caribou's Kehihihihi in the New World", "level": 4, "content": [{"type": "paragraph", "text": "It is unknown how his battle with Drake ended, though both survived. He was first seen after the timeskip attacking and eventually wiping out a band of revolutionaries that had recently mistaken Caribou as their leader, Gaburu."}, {"type": "paragraph", "text": "He later attacked Gaburu's granny's house and ran into Caribou while knocking the old woman away, shocking Caribou. The old woman then prepares to fight Scotch while Caribou runs away. Scotch subdues the old woman and plans to use her as an example for Gaburu's army."}, {"type": "paragraph", "text": "He then sees a Marine ship approaching with Caribou (while posing as Gaburu) and his crew on it. To free the old woman and the defeated revolutionaries, the Caribou Pirates battle Scotch. Scotch tries to attack Caribou, but his weapon is useless due to Caribou's Logia intangibility. Caribou gets the upper hand in his fight against Scotch, using his swamp form to defeat Scotch."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Scotch_Attacks_Revolutionaries.png/revision/latest/scale-to-width-down/210?cb=20170318220958", "caption": "Scotch attacking Gaburu's revolutionaries."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Caribou_Defeats_Scotch.png/revision/latest/scale-to-width-down/210?cb=20150322022803", "caption": "Caribou defeats Scotch."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Scotch vs. X Drake (unseen)", "elements": []}, {"text": "Scotch vs. Gaburu's revolutionist group (without Gaburu)", "elements": []}, {"text": "Scotch vs. Caribou Pirates", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Following the card game motif of Kaido's subordinates, Scotch's name is an allusion to \"Scotch Whist\", another name for the card game Catch the Ten. This may also be an indirect way of having the ten, a playing card rank, denote Scotch, similar to \"Jack\" and \"Joker\".", "elements": []}, {"text": "Scotch is also the name of one of the Yeti Cool Brothers.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 595 and Episode 513, X Drake and his crew meet a cyborg serving under Kaido's orders.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 216), Scotch's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 71 Chapter 711, cover story: Caribou's Kehihihihi in the New World Vol. 29.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 71 Chapter 705, cover story: Caribou's Kehihihihi in the New World Vol. 25.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 71 Chapter 704, cover story: Caribou's Kehihihihi in the New World Vol. 24.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 72 Chapter 719, cover story: Caribou's Kehihihihi in the New World Vol. 36.", "elements": []}]}], "images": []}]}