{"sections": [{"title": "Terry Gilteo", "level": 1, "content": [{"type": "paragraph", "text": "Terry Gilteo is an officer of the Revolutionary Army, serving as the intelligence controller (情報管制官 Jōhō kansei-kan) for the Revolutionary Army Headquarters on Baltigo."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Terry Gilteo is a man with brown-black hair and a short beard and mustache. He wears a blueish gray cloak over a green jacket and has what appears to be a yellow kangaroo hat with headphones. He also wears black-spotted red pants with a pair of brown shoes and a pair of brown gloves. On the left side of his face, he has a scar. His eyes are also shadowed by his hat and he was seen smoking as well."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Revolutionary Army, Terry Gilteo has made an enemy of the World Government, and as such, he is a bold individual that is willing to risk his life to stand up to one of the world's most powerful forces. Furthermore, he is also a trustworthy individual as he was given the responsibility of being in charge of the Revolutionary Army Headquarters' intelligence and information network."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Monkey D. Dragon", "level": 3, "content": [{"type": "paragraph", "text": "Terry Gilteo is loyal to Monkey D. Dragon, as the latter is the Supreme Commander of the Revolutionary Army. Furthermore, the fact that Dragon keeps Terry Gilteo close to him and entrusts him with gathering intelligence suggests that Dragon considers him a trustworthy individual."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Nothing is known about Terry Gilteo's combat abilities."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "While the Revolutionary Army's officers were discussing their recent victory in Centaurea, Dragon walked up to Terry Gilteo who was sorting through bounty posters and taking down notes on the Straw Hats. When Dragon asked him who was on the bounty posters, Terry Gilteo replied that it was Monkey D. Luffy and explained to his leader of the pirate's actions since taking down Crocodile and then causing trouble at Enies Lobby. As he talked about their threat to the World Government, he was unaware of the fact that Luffy was actually Dragon's son, and so when he was about to discuss the pirate's relation to Garp, Dragon had already walked away. Terry Gilteo then asked where he was going, to which Dragon replied that he was going to get some fresh air."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, he does not have a scar on the left side of his face."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 440 (p. 9) and Episode 324, Terry Gilteo makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 214), Terry Gilteo's name and position is revealed.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements (p. 206), Those gathered at the meeting are revealed to be officers of the Revolutionary Army.", "elements": []}]}], "images": []}]}