{"sections": [{"title": "Seagull", "level": 1, "content": [{"type": "paragraph", "text": "Seagull is a former member of the Roger Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Seagull is a very tall and muscular man, being significantly larger than the rest of his crew. He is bald and has a dark mark that reaches from his nose to the top of his head. It is unknown if this is hair, a tattoo, or some other marking. He appears to have a similar marking on his left forearm. He has bags under his eyes, a round nose, large lips, and a square chin. His neck is very thick, making his head look slightly lower on his body than normal. He wears a sleeveless shirt. In the anime, the mark on his head is colored the same as his brown skin tone and his shirt is dark grey."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Seagull appears to take combat seriously, as he was seen with an angry expression before the battle with the Golden Lion Pirates. However, during calmer moments, Seagull can be seen partying and having a good time with the rest of the Roger Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Roger Pirates, Seagull is likely a formidable fighter and pirate."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Seagull was first seen on the Oro Jackson prior to the battle with Shiki at Edd War. He was later seen entering the fight."}, {"type": "paragraph", "text": "Seagull is seen partying with the Roger Pirates one year before the start of the Great Age of Pirates."}, {"type": "paragraph", "text": "His whereabouts after his captain disbanded the crew are unknown."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 0 Chapter 0 and Episode 0, Seagull makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 212), His name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 958 (p. 4), Seagull is seen partying with the crew.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Seagull - Article about the animal that Seagull is named after.", "elements": []}]}], "images": []}]}