{"sections": [{"title": "Stansen", "level": 1, "content": [{"type": "paragraph", "text": "Stansen is a giant from Elbaf, who is a shipwright. After being imprisoned in the Auction House, he was freed alongside other slaves by Silvers Rayleigh during the Straw Hat Pirates' assault on the business."}, {"type": "paragraph", "text": "Afterwards, Stansen became a member and the shipwright of the New Giant Warrior Pirates, and the crew became S-Class soldiers within the mercenary group Buggy's Delivery. Upon his captain Hajrudin pledging his loyalty to Monkey D. Luffy, the crew left the organization."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As a giant, Stansen is much larger than a human. He is rather portly, though has muscular arms, a black beard, a thin mustache, and a crescent scar under his right eye. He wears a hat with flaps on the sides, a leather armband on each arm, and jeans."}, {"type": "paragraph", "text": "Two years after being freed from slavery, Stansen's beard and mustache grew larger. He wears an open fur vest, a fur cape with skulls on the shoulders, a large spotted belt with a skull-shaped buckle, and light baggy pants. He also wears a viking helmet."}, {"type": "paragraph", "text": "While he was still a child on Elbaf, he wore a similar-looking outfit (albeit smaller for the size of his age), with an addition of a light-colored fur vest, and a sword buckled to his back."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f0/Stansen_as_a_Child.png/revision/latest?cb=20170529035240", "caption": "Stansen as a child."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Befitting a warrior of Elbaf, Stansen is an honorable person, as he thanked Rayleigh for helping him and the other slaves escape. He also offered to help the other slaves get off the island after their collars had been removed. While he was in captivity, he remained calm and sociable."}, {"type": "paragraph", "text": "During his childhood, he appeared to be cheerful, as he sat watching Hajrudin training with Raideen while happily eating snacks."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Due to his massive size, Stansen possesses very powerful physical strength. He was able to crash through the walls of the auction house using his bare hands and with little effort. The only reason he was caught into slavery was because he dropped his guard while sleeping, as his captors noted the impossibility of taking him in otherwise. Alongside his fellow members of the New Giant Warrior Pirates, he was an S Class member in Buggy Pirate Dispatch Society whom Buggy noted to be their best soldiers. As the shipwright of the New Giant Warrior Pirates, he has sufficient carpentry skills to maintain and repair their ship Naglfar."}, {"type": "paragraph", "text": "He also has knowledge of Haki, as he knew that it was Rayleigh who knocked out Disco with it, although it is unknown if he can use it himself."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "While as a child, Stansen carried a sword strapped to his back."}, {"type": "paragraph", "text": "As a member of the New Giant Warrior Pirates, he is equipped with a giant hammer."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sixty-three years ago, Stansen, as a child, was on Elbaf watching Hajrudin's training to become a warrior. Afterwards, he became a pirate and left Elbaf. At an unspecific place at some point, Stansen was captured by the Coffee Monkeys group when he was asleep with his guard down."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Eventually, Stansen was transported to the Human Auction House in Sabaody Archipelago, which was a pain for the Coffee Monkeys. There, he was equipped with a bomb collar and imprisoned, before waiting alongside Rayleigh to be auctioned off as a slave at the upcoming slave auction."}, {"type": "paragraph", "text": "Later, with help from Rayleigh, Stansen got his bomb collar off and escaped the auction house along with other slaves. He was grateful to the Straw Hats and Rayleigh for liberating them."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After being freed, Stansen and three other giants joined Hajrudin in his goal to revive the Giant Warrior Pirates. The crew became mercenaries for the pirate dispatch organization, Buggy's Delivery. During the duration of their service, the crew became the five top earners of the organization, as well as earning the rank of S-Class soldiers."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "Hajrudin pledged his crew's allegiance to the Straw Hat Pirates, and when he returned to Karai Bari Island, the New Giant Warrior Pirates informed Mohji of their resignation from the Pirate Dispatch Organization, before setting out to sea in the Naglfar as members of the Straw Hat Grand Fleet."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He is possibly named after the former professional wrestler Stan Hansen.", "elements": []}, {"text": "He is the only member of the New Giant Warrior Pirates that was introduced before the timeskip.", "elements": []}, {"text": "Stansen's design after the timeskip could be an homage to the viking Sven from the series Vicky the Viking.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 500 (p. 17-19) and Episode 394, Stansen witnesses Rayleigh's usage of Haoshoku Haki.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 897, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 29, Stansen is revealed to have become the New Giant Warrior Pirates' shipwright.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 (p. 11) and Episode 836, A young Stansen watching Hajrudin training with Raideen.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), Stansen's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 504 (p. 16) and Episode 398, Stansen leaving the Auction House.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 503 (p. 15) and Episode 397, Stansen easily smashing through a wall.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 501 (p. 8) and Episode 395, The Coffee Monkeys revealed how they captured Stansen.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 803 (p. 11) and Episode 752, The New Giant Warrior Pirates' rank in Buggy's Delivery is revealed.", "elements": []}]}], "images": []}]}