{"sections": [{"title": "Kozuki Momonosuke", "level": 1, "content": [{"type": "paragraph", "text": "Kozuki Momonosuke is an inhabitant of Wano Country and the son of the late daimyo of the Kuri region and patriarch of the Kozuki Family, Kozuki Oden. He was born 28 years before the present day, but traveled 20 years forward in time when he was 8 years old."}, {"type": "paragraph", "text": "He was first mentioned when Kin'emon told Sanji that he came to Punk Hazard to rescue his \"son\". His given name was revealed when the samurai was asking if the captive children in the Biscuits Room had seen him, and his clan name was revealed when Kin'emon spoke of his true heritage."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "In his first appearance, Momonosuke was seen in his full animal form, an Eastern dragon with a long, pink, slender body. This form has yellow eyes, horns, and scales along his back."}, {"type": "paragraph", "text": "In his human form, his appearance matches the stereotype of all samurai found in ancient Japan, with a topknot and the top of his head shaven. As a child, Momonosuke is quite short. Kin'emon used his Devil Fruit ability to give him a pink kimono with peach designs on it, matching his name (\"momo\" means \"peach\" in Japanese.) He also wears a red scarf, a purple obi, and a pair of geta."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Due to his upbringing as a samurai, Momonosuke has a prideful and stubborn personality, as he was unwilling to communicate with the other kidnapped children. He also refused to eat any of the food or candy they offered him. Ironically, this attitude is what prevented him from getting poisoned by NHC10. Despite his pride, he also cried when he thought Kin'emon had died. Despite his tender age, Momonosuke is extremely dedicated to the samurai code of Bushido such as benevolence, courage, righteousness, and honor. After learning of Caesar's evil intentions to sacrifice his test subjects, he wanted to warn his fellow captive children about it despite the dangers as he stated it will be shame as a samurai to simply run away. Momonosuke also aided the Straw Hats in treating the brutalized mink citizens of Zou."}, {"type": "paragraph", "text": "Momonosuke is proud of his family as he claims that he is the man who will become the Shogun of Wano Country. He also claims that he is not afraid of anything and even threw a fit when Luffy asked him if he is afraid of heights. However, he is terrified of Doflamingo after having witnessed his cruelty. Despite his pride and stubbornness, Momonosuke did not deny his fear of him."}, {"type": "paragraph", "text": "Momonosuke loves his parents dearly and bears immense hatred and resentment towards Kaido for murdering them. Momonosuke was also utterly frustrated at his powerlessness for not being able to avenge his parents or protecting his retainers. His immaturity and emotional outbursts initially prevented him from assuming authority, but after being spurred on by Luffy, Momonosuke has begun learning to take charge and fulfill his role as the Kozuki Family's leader. Momonosuke is also very sharp for his age as despite desiring to reunite with his sister, he understands the danger of Orochi learning of her whereabouts and thus opted to search for Hiyori after Orochi's defeat."}, {"type": "paragraph", "text": "Despite his pride, Momonosuke also has a humble and modest side as he willingly acknowledged his lack of strength and abilities to avenged his parents. Thus, Momonosuke became dedicated to trained relentlessly in order to be strong and overcome his weakness. He is also deeply impressed with Luffy for being able to convince the Udon prisoners to rise up and fight the Beast Pirates oppression, noted that he could never do the same, though was greatly enraged when Luffy agreed with harsh insults. When the Udon Prisoners bowed before him being elated for his safety, Momonosuke had already realised it was because they saw his father's image in him rather himself as a person. Momonosuke also refused to accept his father's heirloom Ame no Habakiri due to believeing he is still not capable enough to inherit it and thus asked Hitetsu to continue to hold on to it."}, {"type": "paragraph", "text": "Despite his age, he seems quite interested in older women such as Robin and Nami, and has used a combination of fake innocence and flattery to get the women to treat him maternally, allowing him to get away with things for which grown men would be considered perverted. While it initially appears he really is just innocent, the look that he gives Kin'emon, Brook, and Sanji makes it clear that he knows what he is doing, clearly showing an extremely perverted nature on his part. His perverted nature is a trait that he inherited from his father."}, {"type": "paragraph", "text": "Since acquiring his Devil Fruit powers, he has a peculiar habit of transforming into his dragon form whenever he is afraid, such as when Doflamingo was approaching the Thousand Sunny or being presented his father's sword Ame no Habakiri."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/22/Momonosuke%27s_Perverted_Side.png/revision/latest/scale-to-width-down/210?cb=20170131201109", "caption": "Momonosuke revealing his perverted side."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family and Retainers", "level": 3, "content": [], "images": []}, {"title": "Parents", "level": 4, "content": [{"type": "paragraph", "text": "Momonosuke loves his parents and could barely speak of their deaths by Kaido and the Shogun of Wano Country. He is extremely respectful of his father both as a samurai and the benevolent daimyo of Kuri to the point where he stopped the fight between Nekomamushi and Inuarashi in the name of his happiness. Oden also loved his son as he would encourage Momonosuke to travel overseas to learn more about the world as he had, and upon his death, bequeathed to Momonosuke one of his swords, the Ame no Habakiri. After their deaths, Momonosuke formed an alliance with the Straw Hat Pirates and Heart Pirates in order to avenge them."}], "images": []}, {"title": "Kozuki Hiyori", "level": 4, "content": [{"type": "paragraph", "text": "As siblings, Momonosuke cares deeply for his younger sister. While Momonosuke suspects that his sister is alive, he said he could not meet her until after Orochi is overthrown or Hiyori could become a target. He was greatly relieved to hear from Zoro and Kawamatsu that his sister is still alive."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Momonosuke_and_Hiyori_Childhood.png/revision/latest/scale-to-width-down/180?cb=20190912065223", "caption": "Momonosuke and Hiyori playing."}]}, {"title": "Kin'emon", "level": 4, "content": [{"type": "paragraph", "text": "As one of the retainers of the Kozuki Family, Kin'emon swore to protect Momonosuke with his life and pretended to be his father on their journey for the sake of his safety. When Momonosuke was taken by Caesar, he went after him, and even fought one of the Shichibukai in order to save him. Despite his samurai honor, after Kin'emon confirmed that the meal Sanji made on Punk Hazard was fine, he listened and joined the feast. Upon his arrival to Zou, the first thing Kin'emon wanted to do was to make sure that Momonosuke arrived there safely. When his true identity was revealed, Kin'emon was shown to carry Momonosuke several times, and even lift him in order to complete his alliance with Luffy, Law, and the Mink Tribe. Despite the father-son ruse, the two do genuinely care for each other almost like family and share an unshakeable bond of trust. Momonosuke even cried heavily when he thought Kin'emon had been killed by the Shinokuni poison gas. Momonosuke also likes to flaunt his success with women in front of Kin'emon and others, which causes his retainer to become bitter and jealous to the point of even speaking ill of his young lord."}, {"type": "paragraph", "text": "Despite the two not being related, the Straw Hats noted that they look alike and share the same perverted traits."}], "images": []}, {"title": "Kanjuro and Raizo", "level": 4, "content": [{"type": "paragraph", "text": "As retainers of the Kozuki Family, they swore to protect Momonosuke with their life. Momonosuke was shown to worry about Kanjuro on Dressrosa, and demanded to see Raizo despite the hard climb of the Whale Tree."}], "images": []}, {"title": "Inuarashi and Nekomamushi", "level": 4, "content": [{"type": "paragraph", "text": "As retainers of the Kozuki Family, they swore to protect Momonosuke with their life. Despite their mutual antagonistic behavior, when Momonosuke told them to stop fighting, they immediately stop and went back to being friends, worked together, and reminisce about their past."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Ginko", "level": 4, "content": [{"type": "paragraph", "text": "Ginko was one of the children that was experimented on by Caesar Clown, and a fellow captive on Punk Hazard. She was the first person to talk to Momonosuke after he was taken by Caesar Clown's men, and tried to convince him to eat something. She witnessed him eating Vegapunk's Artificial Devil Fruit and transforming into a dragon, and showed concern for his whereabouts afterwards."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "When they first met in the garbage storage room of Caesar Clown's lab, the two began talking and tried to figure how to get out. Upon their arrival at the surface, Momonosuke was exhausted and Luffy carried him until he met Caesar and began their fight. Momonosuke was amazed by Luffy's strength after the latter defeated the mad scientist. When the Straw Hats and their companions arrived at Dressrosa, Luffy tried to convince Momonosuke to fly as a way to go around the island. However, this idea angered Momonosuke and the two began to fight with Luffy calling him weak and a crybaby. After Donquixote Doflamingo's attack on the Thousand Sunny, Luffy learned that Momonosuke was a target and ordered the crew to flee Dressrosa in order to protect him. On Zou, upon the revelation of Momonosuke's true identity, Luffy showed no regard for Momonosuke's title and another fight broke out. After the revelation of the fate of Momonosuke's parents, it was Luffy's words that cause him to act as the leader he claimed to be and to declare his wish of vengeance. Luffy was also the one to recognize Momonosuke's ability to communicate with Zunesha."}, {"type": "paragraph", "text": "At the Prisoner Mines in Udon, Momonosuke was amazed of Luffy after seeing his ordeal, but Luffy only made Momonosuke angry by saying negative comments about him."}], "images": []}, {"title": "Nami and Robin", "level": 4, "content": [{"type": "paragraph", "text": "Due to his perverted personality, Momonosuke immediately connected with the women of the Straw Hat Pirates. During their journey to Dressrosa, he slept in their bed and bathed with them, much to the annoyances of his \"father\", Sanji, and Brook."}], "images": []}, {"title": "Sanji and Brook", "level": 4, "content": [{"type": "paragraph", "text": "Due to his connection with the women of the Straw Hat Pirates, Momonosuke woke the jealousy of his \"father\", Sanji and Brook. Despite their anger, they still fought to keep him safe from the Donquixote Pirates."}], "images": []}, {"title": "Tony Tony Chopper", "level": 4, "content": [{"type": "paragraph", "text": "While protecting the Thousand Sunny, Chopper did his best to keep Momonosuke happy. He agreed to be the food taster in Momonosuke's game and coerced Brook into playing along as well."}], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Due to their affinity for bushido, Momonosuke has mutual respect for Zoro and was deeply grateful to him for saving his sister. Zoro also gave Momonosuke some advice in training his swordsmanship including the old Kuri dialect Sunachi."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Caesar Clown", "level": 4, "content": [{"type": "paragraph", "text": "While on Punk Hazard, Momonosuke was able to get away from the guards into a secret room where he heard of Caesar's plans for the kidnapped kids."}], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "The captain of the Donquixote Pirates and an ally of Kaido, Doflamingo tried to capture Momonosuke but failed due to Trafalgar Law's interference. At some point in the past, Momonosuke witnessed Doflamingo's brutality, with the event leaving him traumatized. Momonosuke also did not hesitate to admit his fear of the pirate. He was also worried when Doflamingo nearly killed Sanji until the latter was saved by Law."}], "images": []}, {"title": "Giolla", "level": 4, "content": [{"type": "paragraph", "text": "Giolla, an officer of the Donquixote Pirates, attacked the Thousand Sunny and tried to capture Momonosuke. With the help of Nami, Chopper, and Brook, Momonosuke was saved from Giolla's power."}], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "Kaido was the one who orchestrated the attack on Wano resulting in the execution of Kozuki Oden. Upon the revelation of his true identity and the deaths of his parents at the hands of Kaido, Momonosuke vowed to exact his revenge upon Kaido with Luffy's assistance. "}], "images": []}, {"title": "Kurozumi Orochi", "level": 4, "content": [{"type": "paragraph", "text": "Being in alliance with Kaido, and participating in the execution of Kozuki Oden, earned Kurozumi Orochi Momonosuke's hatred and anger."}], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "During Jack's second attack on Zou, Zunesha asked for permission to attack his fleet. Momonosuke, being the only one able to communicate with the elephant, ordered him to push Jack back."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Zunesha", "level": 4, "content": [{"type": "paragraph", "text": "With the ability to hear the voice of all things, Momonosuke was able to hear Zunesha's cry for help during Jack's attack. They share a special connection, which enabled Momonosuke to share Zunesha's sight and to have the ability to make the elephant hear him as well. Under Momonosuke's order, Zunesha defeated Jack and his fleet instantly."}], "images": []}, {"title": "Ashura Doji", "level": 4, "content": [{"type": "paragraph", "text": "Ashura Doji followed Momonosuke's father Oden due to the enormous respect he had for the man. However, unlike the other followers of the late daimyo of Kuri, Ashura held no such loyalty for the rest of the Kozuki Family. As such, he turned down the rallying of a revolution against Orochi and Kaido, and even refused to address Momonosuke with any honorifics. Originally, he was loyal to the rest of the Kozuki Family but became bitter after the deaths of his comrades ten years ago. Having decided to rejoin the Scabbards, Ashura also aids Momonosuke."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the heir of the Kozuki Family, Momonosuke has authority over its six retainers. Due to this, he is one of the main leaders of the Ninja-Pirate-Mink-Samurai Alliance, which would not have formed without him requesting Luffy and Law's assistance as their equal. As two of his retainers are the mink rulers Inuarashi and Nekomamushi, Momonosuke also has sway over the Mink Tribe, a race of powerful warriors who are very loyal to his clan to the point that they would die for any member or retainer."}, {"type": "paragraph", "text": "He has the ability to communicate with the giant elephant Zunesha, being capable of seeing through its eyes and giving it orders, which is the only way it can do anything but walk. Should Momonosuke order it to attack, he is in command of a powerful weapon capable of wiping out fleets in a single blow. Like his father, Momonosuke also has the ability to hear the \"Voice of All Things\"."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Momonosuke possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When he was in his human form, before consuming his Devil Fruit, he was seen wearing a short sword that suited his size, although it is unknown how skilled he is at using it. After returning to Wano, Momonosuke was equipped with a Wakizashi and opted to continued using it in preparation for the upcoming revolution against the Beast Pirates due to believeing he is still not worthy enough to wield his father's Meito Ame no Habakiri."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Momonosuke ate Vegapunk's man-made Mythical Zoan-type Devil Fruit that was considered a failure. It transformed him into a serpentine dragon which allows him to seemingly fly, when in actuality he somehow produced clouds that he was able to grab onto and climbed up that way."}, {"type": "paragraph", "text": "However, as he has only eaten this fruit recently, he does not seem to have much control over it yet, and in fact transformed unwillingly into his full animal form shortly after consuming the fruit. He did not know that he could produce and climb clouds, as he told Luffy he was stuck in the garbage dump when they met there."}, {"type": "paragraph", "text": "When he was frightened by a hunger-induced hallucination, he unconsciously used his cloud ability to escape with Luffy clinging to him."}, {"type": "paragraph", "text": "He also did not know he could switch forms until Luffy told him. It is also possible, though, that he has no conscious control over his power because the fruit was artificial and a failure. He showed the ability to revert back to his human form when he reunited with Kin'emon. However, Momonosuke is shown to switch forms from time to time."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Momonosuke was born 28 years ago, to then-daimyo of the Kuri region of Wano and patriarch of the Kozuki Family, Kozuki Oden, and his wife, Kozuki Toki, during Oden's second year with the Whitebeard Pirates onboard the Moby Dick. He spent the first two years of his life sailing with the Whitebeard Pirates. According to himself, he met the pirate Gol D. Roger at some point."}, {"type": "paragraph", "text": "At the age of eight, his family was removed from power by the shogun of Wano Kurozumi Orochi as well as Kaido of the Yonko. After Oden was executed in the Flower Capital, Momonosuke was with his sister and mother inside Oden Castle when it was set ablazed by Kaido. When the retainers returned, Toki sent Momonosuke and the retainers 20 years into the future. After arriving in the future, they went around Wano Country and discovered how much it changed over the years. However, they discovered allies they could still count on and began forming a plan to take back Wano Country. Momonosuke and his retainers also decided to travel to Zou to enlist the aid of the Mink Tribe, but when they left Wano Country, they were spotted by the Beasts Pirates."}, {"type": "paragraph", "text": "While sailing to Zou, but ended up shipwrecked, in which they got separated from Raizo and drifted ashore to Dressrosa. While in the country, Momonosuke witnessed Doflamingo's brutality as he tortured a gladiator for putting an unsatisfying show at the colosseum. The samurai were later pursued by Doflamingo's men. Momonosuke hid himself in a ship and the ship set sail before Kin'emon could reach him."}, {"type": "paragraph", "text": "Momonosuke was taken to Punk Hazard where he was placed in the Biscuits Room with the rest of the children. Despite the other children's kindness to him by offering him food and candy, he refused to take \"another's charity\" and told no one his name."}, {"type": "paragraph", "text": "Sometime after sneaking out of the Biscuits Room, he wandered into a \"secret room,\" which in reality was Vegapunk's former office. There, he saw the scientist's man-made Devil Fruit inside of a glass display case. Due to his hunger, he smashed open the case and ate the fruit. Soon after, a little girl found him inside the room and talked to him upon entering. Momonosuke told her that he needed to escape and that he had something he needed to accomplish. He listened to her as she talked until they heard the guards coming. She ran away to hide after telling Momonosuke to do the same."}, {"type": "paragraph", "text": "By the time the guards got there, Momonosuke underwent an unconscious transformation into his dragon form. After escaping the guards, he saw his reflection and, upon realizing that he was the dragon, screamed in shock and continued to run away. Running past Caesar Clown's office, Momonosuke overheard the deranged scientist talking about the newest batch of children and how they were only good for about five years of experiments, after which they would die. He was going to warn the other children, but he thought to wait in the garbage dump where he ended up becoming trapped."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/25/Momonosuke_Captured.png/revision/latest/scale-to-width-down/210?cb=20141206213129", "caption": "Momonosuke and the other children sailing to Punk Hazard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/be/Momonosuke_Eats_Artificial_Devil_Fruit.png/revision/latest/scale-to-width-down/210?cb=20151003065442", "caption": "Momonosuke eating Vegapunk's Artificial Devil Fruit out of hunger."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "He later encountered Monkey D. Luffy after he also fell into the garbage dump. Despite the pirate appearing to recognize his name, Momonosuke believed that Luffy must have been asking for someone else as they had never met before. He also told Luffy to stop drooling, as he seemed to want to eat him. He then told Luffy that he would rather eat him himself. His stomach growled and he admitted that he has been fasting for ten days."}, {"type": "paragraph", "text": "After Momonosuke told him what was happening on Punk Hazard, a visibly angry Luffy asked Momonosuke to grab onto him as he planned on getting out of the garbage dump. He was relieved with what Luffy said and thought that it meant Luffy was not a pirate. However, Momonosuke suddenly had a hallucination involving Donquixote Doflamingo and started to fly. Luffy grabbed onto him as he flew upward."}, {"type": "paragraph", "text": "After Luffy was informed of Caesar's location, they went to Building R. Momonosuke then watched the confrontation between Luffy and Caesar Clown, and felt angry once he saw the face of the man who condemned his captives to death with his experiments. He later expressed shock at Luffy's monstrous strength after observing his initial assault on the deranged scientist."}, {"type": "paragraph", "text": "Caesar's subordinates then opened the air vents to allow the gas to flow in. After Caesar absorbed his weapon, Shinokuni, Luffy requested that Momonosuke look after Brownbeard before preparing to launch a devastating Gear Third attack. Once Caesar was out of the way, Momonosuke and Luffy then joined up with the other Straw Hats, the kidnapped children, and the G-5 Marines. After everyone boarded the rail car in the escape route, he expressed sorrow when he saw that Kin'emon had been petrified by the poisonous H2S gas."}, {"type": "paragraph", "text": "Sometime after Caesar's downfall, Kin'emon broke out of his shell and returned to his normal state. Momonosuke transformed back into his human form and was given clothes by Kin'emon after the two embraced each other. The two then ate Sanji's food, though Momonosuke was hesitant at first."}, {"type": "paragraph", "text": "Everyone then had a feast together. He and Kin'emon then boarded the Thousand Sunny with the Straw Hats and Trafalgar Law. He listened as Law explained Doflamingo's connection to the underworld and the fact that his biggest client is Kaido. He looked shocked when Law mentioned Kaido's name and subconsciously turned into a dragon again, surprising Kin'emon."}, {"type": "paragraph", "text": "Later that night, he had a bath with Robin due to not having one in days. As he was carried out by Robin while the latter is only in a towel and Momonosuke is snuggled in her breast, Brook, Sanji, and Kin'emon become enraged at him for using his innocent nature to get flattery from Robin and attempted to gang up on him until Nami beat them up for scaring him. He thanked Nami and called her a princess, which caused Nami to be flattered and state how cute Momonosuke is and hug him, allowing him to sleep with her and Robin. Momonosuke was then hugged in Nami's breasts and was seen grinning wickedly at the three, showing that he was doing this on purpose for pleasure. He was then seen sleeping in the women's bed with Nami's arm over his head as he snored. The next morning, everyone read about Doflamingo's resignation as a Shichibukai and the alliance between Luffy and Law as well as the alliance between Kid, Apoo, and Hawkins in the newspaper."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Luffy_Meets_a_Dragon.png/revision/latest/scale-to-width-down/210?cb=20160227013723", "caption": "Momonosuke encountering Luffy in the garbage dump."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ec/Straw_Hat_Pirates_and_Allies_Read_Newspaper.png/revision/latest/scale-to-width-down/210?cb=20140113035402", "caption": "Momonosuke, along with the crew, sees the newspaper."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Robin_Bath_Towel.png/revision/latest/scale-to-width-down/120?cb=20141206213006", "caption": "Momonosuke clinging on to Robin's towel."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Law told Doflamingo to pick up Caesar at Green Bit, Momonosuke had a meal with Kin'emon and the crew. Momonosuke and the samurai told the crew about how they were shipwrecked and drifted to Dressrosa as well as how Momonosuke was separated from the samurai. The Thousand Sunny then approached Dressrosa."}, {"type": "paragraph", "text": "After disembarking, the group began the next phase of their operation. Luffy thought of using Momonosuke, in his dragon form, to fly. However, Momonosuke refused to do so as he remembered a person reaching for him and asking his name. When Luffy asked him if he is afraid of heights, the two got into a small fight until Kin'emon broke them up. The group then split into three teams and Momonosuke was put into the team to guard the Sunny. Momonosuke then prayed for Kanjuro's safety."}, {"type": "paragraph", "text": "Momonosuke later played Shogun with Nami, Chopper, and Brook. When Brook started singing a song, they heard strange noises and a voice coming from the men's room."}, {"type": "paragraph", "text": "The voice belonged to Giolla of the Donquixote Pirates, who had invaded the ship along with several of her subordinates. Using her Devil Fruit power, she turned the men's room into abstract art and did the same to Nami, Chopper, Brook, and Momonosuke. Hoping to lure Giolla away from the ship, they escaped, but Giolla transformed the ship into art anyway, rendering it unable to sail."}, {"type": "paragraph", "text": "As Giolla attacked the group, Momonosuke told Brook that they were there for him. Then, when Law called the group, Momonosuke refused to admit that they were in trouble and stated that he was fine."}, {"type": "paragraph", "text": "Giolla later trapped Chopper, Momonosuke, and Nami in a deadly painting that would slowly suffocate them in ten minutes. Brook acted nonchalant, seemingly caring more about the art that was being created than his friends' lives. The skeleton asked Giolla to turn his violin and cane back to normal so that he could add accompaniment to their death. Once Giolla complied, Brook then slashed her using 'Drawing Song Hitoyogiri', defeating her and causing her power to wear off, turning everyone back to normal."}, {"type": "paragraph", "text": "Afterwards, the entire crew attacked Giolla to ensure she was completely incapacitated, something that left Momonosuke proud of his strength. Nami's group then started discussing about what to do with Giolla and wondered why Law was not handing Caesar back to Doflamingo. Giolla proudly told them the truth behind Doflamingo's status, leaving them shocked. As the Sunny approached Green Bit, Nami's group was horrified to see fighting fish attacking the ship. When they saw Doflamingo approaching, they cried in terror but were overjoyed and relieved when Sanji intercepted him."}, {"type": "paragraph", "text": "When Sanji was overwhelmed and immobilized by Doflamingo's strings, Nami's group panicked. Doflamingo was about to deal a lethal blow to Sanji, but Law intervened by using Shambles and teleported Sanji, Caesar, and himself to the Thousand Sunny. Law then instructed Nami's group to head for Zou. Nami's group was reluctant to leave behind the other Straw Hats, but they complied when they realized that the ship was facing threats from both Doflamingo and Issho. After blocking an attack from Doflamingo, Law informed the Straw Hats about Doflamingo's Devil Fruit powers and instructed them to go to a place without clouds. Law then took Giolla hostage, giving Nami's group enough time to escape using Coup de Burst."}, {"type": "paragraph", "text": "After sailing far away from Dressrosa, Momonosuke recounted the first time he saw Doflamingo which left a terrifying impression on him. When Zoro finally made contact with Luffy, the group on the Sunny engage in a conference call with both Luffy and Franky's group. After everyone was brought up to speed and learned about the true situation on Dressrosa, Sanji decided to sail back to Dressrosa to carry out their assault on Doflamingo."}, {"type": "paragraph", "text": "Through the Den Den Mushi, the group on the Sunny heard the skirmish occurring at the Corrida Colosseum and was shocked to hear that an Admiral was also present in Dressrosa. The return trip was cut short by the appearance of the Big Mom Pirates, who were after Caesar Clown. Momonosuke was deemed by Nami to be one of the three \"cards\" at stake and she suggested to change course once again in order to keep him safe from Doflamingo. Luffy agreed and gave the order for the group on the Sunny to head to Zou."}, {"type": "paragraph", "text": "Momonosuke and the others managed to barely elude the Big Mom Pirates and arrived at Zou the next day. After forcing Caesar to take them to the top of the giant elephant, they came across Sheepshead chasing after Tristan. After saving Tristan and running from Sheepshead, they found Zou's ruined city covered in poison gas and the devastated Mink Tribe."}, {"type": "paragraph", "text": "During the conflict with the Beast Pirates left behind at Zou, Momonosuke, Nami, and Brook ran through unstable terrain when they were suddenly confronted by Sheepshead and his comrades. Right then, a rain eruption from the elephant's trunk occurred, causing them to be swept away by a flood. Momonosuke and Brook had to be saved by Nami due to being Devil Fruit users, and she carried them to a log. Sheepshead attacked the three of them, but Brook blocked him and Momonosuke cheered for Brook. They were then saved when Sanji arrived and kicked Sheepshead away. Later, Momonosuke heard Chopper calling out to them."}, {"type": "paragraph", "text": "After Caesar neutralized the poison gas, Momonosuke's group then got to work on treating the injured minks, saving them from certain death."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/66/Brook%2C_Nami%2C_Chopper_and_Momonosuke_transformed.png/revision/latest/scale-to-width-down/210?cb=20140512015436", "caption": "Momonosuke, Nami, Brook, and Chopper transformed into art."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Giolla_Defeated.png/revision/latest/scale-to-width-down/210?cb=20140302153451", "caption": "Nami's group incapacitating Giolla."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "While the Straw Hats got along amiably with the minks, Momonosuke remained in his room, avoiding any contact with the minks."}, {"type": "paragraph", "text": "When Kin'emon and Kanjuro finally arrived, Momonosuke reunited with them while they were going to the Mokomo Dukedom. Once they arrived at Kurau City, they were quickly intercepted by the Straw Hats, who tried desperately to keep them hidden. However, when they saw Inuarashi and Nekomamushi fighting with each other, the samurais revealed themselves, much to the Straw Hats' horror. Contrary to what the Straw Hats expected, the Mink Tribe welcomed them and revealed that Raizo is safe as well as having a friendship with Kin'emon's clan."}, {"type": "paragraph", "text": "While conversing with Kin'emon, Inuarashi and Nekomamushi began arguing again. Momonosuke stepped up and begged them to cease their quarreling. Not wanting to disappoint Momonosuke, whom they recognize as their lord, the two rulers complied. Kin'emon then revealed that he is not really Momonosuke's father and that his real father is the lord of the Kozuki Family. After Inuarashi and Nekomamushi called a truce, they took the samurais and the Straw Hats to a secret area in the Whale Forest where Raizo was hidden."}, {"type": "paragraph", "text": "After Robin deciphered the red poneglyph that Raizo was tied to, Momonosuke allowed Nekomamushi to reveal the history of the Kozuki Family and their creation of the poneglyphs. However, Momonosuke's retainers explained that Momonosuke never inherited his family's knowledge of the poneglyphs and they welled up in tears as Kin'emon revealed that Oden was executed by Kaido to save them."}, {"type": "paragraph", "text": "Right after the samurais revealed Oden's will to open the country of Wano to the world and to defeat Kaido and the shogun of Wano Kurozumi Orochi, Kin'emon asked Luffy to assist them. Luffy declined, saying that Momonosuke should make the request himself. Momonosuke then declared his will to fight Kaido and protect those dear to him. While prostrating, Momonosuke humbly asked for Luffy's help. Seeing his resolve, Luffy accepted his request."}, {"type": "paragraph", "text": "They later left the secret room and the samurai explained that they never went with Oden during his travels as leaving the borders of Wano is a crime. While discussing their plans to defeat Kaido, the alliance decided to split up and meet up again at Wano Country. Law agreed to take the samurais back to Wano Country in his submarine. Right after they left the Whale Tree, they felt Zou shaking and heard Zunesha crying."}, {"type": "paragraph", "text": "As everything shook around them, Momonosuke saw Jack and his fleet through Zunesha's vision. He heard the elephant's voice, which told him to give it an order. Luffy then urged Momonosuke to give a command to Zunesha, saying that his voice should reach the elephant. Hearing this, Momonosuke ordered Zunesha to drive Jack away. After Jack's fleet was sunk, Momonosuke fell asleep."}, {"type": "paragraph", "text": "After Zunesha has calmed down, Momonosuke chose to stay on Zou to find out why only he can speak to Zunesha and to see if Zunesha knows anything about the Kozuki clan. Inuarashi promised to bring Momonosuke back to Wano when the time comes. As the Sanji retrieval team departed from Zou, everyone, except for the Straw Hat members left behind, were shocked when Luffy jumped off Zunesha with his party."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/83/Momonosuke_Hides_in_His_Room.png/revision/latest/scale-to-width-down/210?cb=20161120001536", "caption": "Momonosuke hides from the Mink Tribe."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Luffy_and_Momonosuke_Hear_Zunesha.png/revision/latest/scale-to-width-down/210?cb=20160404115456", "caption": "Zunesha speaks to Momonosuke and Luffy as it comes under attack."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Eventually, Momonosuke left Zou for Wano Country and managed to successfully reunite with his retainers. While at Wano, he practiced his swordsmanship with a wooden sword. Sometime later, he reunited with Luffy's group after Law brought them to the ruins of Oden Castle."}, {"type": "paragraph", "text": "Inside the castle, Momonosuke listened as Kin'emon explained more about the story of Oden, how Momonosuke's group traveled to the future, and what they did right after arriving at present time. After Kin'emon explained about the Fire Festival, gave Luffy's group new clothes and tasks to do, and summoned Shinobu, Law alerted everyone in the castle to Kaido's sudden arrival at Kuri. The group was surprised to see Kaido and Momonosuke was terrified. After Luffy rushed off with Law following him and Kin'emon and Kikunojo left to rescue Tsuru, the rest tried to escape as Kaido approached the castle and destroyed it with a fire breath. Momonosuke and the other males in the group were saved by the kunoichi Shinobu's jutsu which sunk them into the ground."}, {"type": "paragraph", "text": "At Mt. Mt. Atama, Momonosuke witnessed Ashura and Inuarashi's clash as well as Kin'emon's declaration to make Ashura an ally. While Momonosuke was practicing swordsmanship in Amigasa Village, Tama asked him about his sister. Momonosuke believed that his sister is still alive but could not reunite with her until the shogun and Kaido's defeat."}, {"type": "paragraph", "text": "Momonosuke, Tama, Chopper, and Kikunojo then went to Kuri Beach, where they encountered an amnesiac Big Mom. Momonosuke was shocked to learn from Chopper on who she was and worried about what might happen if she regain her memories. On the following morning, Momonosuke's group took Big Mom to Okobore Town. After Tsuru fed her, the group planned to take her to Udon."}, {"type": "paragraph", "text": "The group then traveled to Udon, with Big Mom having tamed a Wanizame to carry them there. While practicing swordsmanship on the way there, Momonosuke used a certain shout that he learned from Zoro. Kikunojo was alarmed and she advised him not to use it. After night fell, the group eventually arrived at Udon."}, {"type": "paragraph", "text": "On the next day, Momonosuke's group arrived at the Prisoner Mines after Big Mom broke through the front gate. Kikunojo told Momonosuke and Tama to hide before proceeding with Chopper. When the emergency gates were closing, Momonosuke and Tama entered the Prisoner Mines."}, {"type": "paragraph", "text": "While hiding, Momonosuke and Tama witnessed Luffy persuading the prisoners to rebel against the Beasts Pirates. Momonosuke noticed that Luffy appeared sick."}, {"type": "paragraph", "text": "After the prison takeover, Momonosuke reunited with Luffy though the latter was in a serious condition due to being infected with the Mummy virus. Momonosuke commented on how incredible Luffy was but got angry when Luffy called him useless. Chopper then chased Momonosuke out of the room, saying that there were people who needed to see him. As the prisoners bowed to him, Momonosuke felt the weight on his shoulders but maintained his composure and began telling them about what happened during the fall of Oden Castle. He later joined a meeting with several key alliance members at Amigasa Village."}, {"type": "paragraph", "text": "Momonosuke was then surprised to hear that Hiyori is alive and he thanked Zoro for saving her. Tenguyama Hitetsu then presented to the group Oden's two swords, Enma and Ame no Habakiri. Hitetsu offered Ame no Habakiri to Momonosuke but he decided to leave the sword in Hitetsu's hands. Momonosuke was shocked to see Enma's destructive power when Zoro gave it a test run. On the day for the raid on Onigashima, Momonosuke marched to the rebel meeting place with Kin'emon, Kanjuro, Raizo, Shinobu, Kikunojo, Inuarashi, Kawamatsu, and Ashura."}, {"type": "paragraph", "text": "The group eventually arrived at the meeting place, but found none of their ships and allies. Because of this major setback, Momonosuke tried to stop the Scabbards from going through with the raid."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In Episode 611, Momonosuke, trying to escape from Caesar's men in the forbidden room, took flight without producing and using clouds. This scene was never shown in the manga."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Momonosuke, Nami, Brook, and Chopper vs. Giolla", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oden gave him the name Momonosuke because it means \"unrivaled\".", "elements": []}, {"text": "When Momonosuke was born, the Whitebeard Pirates suggested names for him that included Tamago, Konbu, Chikuwa, and Tsukune. These names are all based on food, which would have fit with the food-based names of his father Oden and grandfather Sukiyaki.", "elements": []}, {"text": "Momonosuke is possibly based on Momotarō, a famous character in Japanese folklore. He, along with a monkey, a dog, and a pheasant, headed to Onigashima to defeat ogres. The three animals correspond with the aliases of former marine admirals or Tama's animal friends.", "elements": []}, {"text": "The design on Momonosuke's kimono may be a nod to the \"momo\" (桃, peach) in his name. His coloration as a dragon may also be a nod towards his name since the Japanese word for pink is momo-iro (桃色, peach color). When Giolla used her powers on him, his head gains the shape of a peach.", "elements": []}, {"text": "His name and Kin'emon's come from Japanese actor Nakamura Kinnosuke. Oda is a fan of Kinnosuke.", "elements": []}, {"text": "When Momonosuke was first introduced in his human form, his introduction box looked like a normal one, unlike his fellow samurai who were introduced by scroll-shaped boxes. It was not until he was revealed to be the son of a daimyo when he received a scroll-shaped introduction box.", "elements": []}, {"text": "Unlike other Zoan Devil Fruit users, his clothes disappear when he transforms to beast form.", "elements": []}, {"text": "Momonosuke's form as a serpentine dragon is very similar to Kaido's Devil Fruit power, which seems to be a natural Mythical Zoan-type that also allows him to transform into a dragon. This was noted when Momonosuke inadvertently transformed into his form in the presence of his vassals.", "elements": []}]}], "images": []}]}