{"sections": [{"title": "Sora", "level": 1, "content": [{"type": "paragraph", "text": "Sora is a mermaid and an employee at the Mermaid Cafe."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sora is a mermaid who possesses long blond hair, with one strand of hair separate from the rest falling down the side of her face, her bangs curling up to the left."}, {"type": "paragraph", "text": "She wears a bikini made of clams, and a cylindrical hat that is lavender in color and bears a strange purple design. Her fish-like tail is bright blue and pale green."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like all other mermaids, Sora is kind and caring, and is apparently fun-loving."}], "images": []}, {"title": "Abilities", "level": 2, "content": [{"type": "paragraph", "text": "Being a mermaid, Sora has several abilities unique to her race. It is not yet shown but she may have the ability to talk to fish and call out to them using sonar waves, which is one of the basic abilities found in all mermaids and some Fish-Men. Apart from the ability to breathe underwater, as a mermaid she also has the ability to swim very quickly at speeds much faster than the flying fish used by the Flying Fish Riders. However like any mermaid, she is vulnerable on land."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Sora and her friends first appeared in Mermaid Cove, welcoming the Straw Hat Pirates when Camie brought them there for a visit. When the three princes arrived to inquire the crew's illegal entry into Fish-Man Island, the mermaids denied the crew was there, hiding them. However, when the crew's presence was made known anyways by Sanji's nosebleed and Hammond's attack, the princes made it clear that they were simply trying to deliver Jinbe's message to Monkey D. Luffy."}, {"type": "paragraph", "text": "After Ishilly, Fillonce, and another mermaid were kidnapped by Caribou, Sora and the others wondered where they went off to and they had no clue of what happened to them. The only thing they did know was that Ishilly was opening a barrel."}, {"type": "paragraph", "text": "After the civil war between the Straw Hats and the New Fish-Man Pirates ended, Sora and her friends danced at the Ryugu Palace banquet in honor of the Straw Hats' victory, and later saw them off when they departed to the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Mermaids_Say_Goodbye.png/revision/latest/scale-to-width-down/200?cb=20130112080756", "caption": "Sora and her friends bidding the Straw Hats goodbye."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 (p. 15) and Episode 527, Sora makes her debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 216), her name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 609 and Episode 528.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 610 and Episode 529.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 and Episode 569.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 653 and Episode 573.", "elements": []}]}], "images": []}]}