{"sections": [{"title": "Lulis", "level": 1, "content": [{"type": "paragraph", "text": "Lulis is a mermaid and is an employee at Mermaid Cafe."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lulis is a mermaid with an orange-red tail that has lighter zig-zag like straps along it. Her orange wavy long hair is relatively straight until it curls in the ends."}, {"type": "paragraph", "text": "She wears a golden-border red bikini top. She also wears a diving mask with a snorkel as a headband. Since mermaids can breathe underwater, they're most likely just accessories."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c1/Lulis_without_Snorkel.png/revision/latest?cb=20150523040536", "caption": "Lulis without her diving mask."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like all other mermaids, Lulis is kind and caring, and is apparently fun loving. She was amazed when Luffy using Haoshoku Haki made the Sea Bear give up without putting a fight."}], "images": []}, {"title": "Abilities", "level": 2, "content": [{"type": "paragraph", "text": "Being a mermaid, Lulis has several abilities unique to her race. It is not yet shown but she may have the ability to talk to fish and call out to them using sonar waves, which is one of the basic abilities found in all mermaids and some Fish-Men. Apart from the ability to breathe underwater, as a mermaid she also has the ability to swim very quickly at speeds much faster than the flying fish used by the Flying Fish Riders. However like any mermaid, she is vulnerable on land."}, {"type": "paragraph", "text": "She also appears to be a skilled dancer, as she is dancing during the banquet for the Straw Hat Pirates."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Lulis and her friends first appeared in Mermaid Cove, welcoming the Straw Hat Pirates when Camie brought them there for a visit. When the three princes arrived to inquire the crew's illegal entry into Fish-Man Island, the mermaids denied the crew was there, hiding them. However, when the crew's presence were made known anyways by Sanji's nosebleed and Hammond's attack, the princes made it clear that they were simply trying to deliver Jinbe's message to Monkey D. Luffy."}, {"type": "paragraph", "text": "After Ishilly, Fillonce and another mermaid were kidnapped by Caribou, Lulis and the others wondered where they went off to and they had no clue of what happened to them. The only thing they did know was that Ishilly was opening a barrel."}, {"type": "paragraph", "text": "After the civil war between the Straw Hats and the New Fish-Man Pirates ended, Lulis and her friends danced at the Ryugu Palace banquet in honor of the Straw Hats' victory, and saw them off when they departed to the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Lulis_and_Seira_Say_Goodbye.png/revision/latest/scale-to-width-down/210?cb=20121118013410", "caption": "Lulis and her friends bidding the Straw Hats goodbye."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 (p. 15) and Episode 527, Lulis makes her debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 216), Her name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 and Episode 569, Lulis is dancing during the banquet.", "elements": []}]}], "images": []}]}