{"sections": [{"title": "Bunny Joe", "level": 1, "content": [{"type": "paragraph", "text": "Bunny Joe is a member of the Revolutionary Army and the leader of the group that rescued people of Tequila Wolf from slavery along with Nico Robin."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bunny Joe is a tall man with light brown curly hair, reaching down to the tip of his shoulders."}, {"type": "paragraph", "text": "He wears a tan cloak and a bowler hat with a teal feather on it. Under his cloak he wears a black shirt, with white buttons. He has light red pants, with a brown belt holding it up. He also carries a flintlock in his pants."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/41/Bunny_Joe_Portrait.png/revision/latest/scale-to-width-down/105?cb=20190404035152", "caption": "Close-up of Bunny Joe's face."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like the other revolutionaries, he is loyal to Dragon. He seems to be a generous man as he escorted Robin to meet Dragon by her own choosing and did anything to accommodate Robin while on the way to Baltigo."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Since he was the leader of the group that liberated the inhabitants of Tequila Wolf and Nico Robin, he must have had authority over a number of subordinates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During the liberation of Tequila Wolf, Joe is seen using a flintlock."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He led the revolutionary forces that liberated Tequila Wolf. Later, he explained to Nico Robin about how the Revolutionaries had been looking for her and assured her that they are on her side. He then asked Robin to meet the revolutionary leader, Dragon. Robin declined but changed her mind after receiving Luffy's secret message. While on the way to Baltigo, Bunny Joe ordered his men to bring some food, blankets, and a couch out onto the deck of their ship in order to accommodate Robin."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bunny Joe and Revolutionaries vs. Tequila Wolf guards", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 546 and Episode 455, Bunny Joe makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 216), His name is revealed.", "elements": []}]}], "images": []}]}