{"sections": [{"title": "Adele", "level": 1, "content": [{"type": "paragraph", "text": "Adele is a mermaid and an employee at the Mermaid Café."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Adele is a youthful mermaid with wild curly hair that reaches past her shoulders, and has dark skin and pink lipstick. She wears a bikini top with a leopard skin pattern, and her tail is red in color with several zig-zag patterns all of which is being different hues of red themselves."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f6/Adele_in_Digitally_Colored_Manga.png/revision/latest?cb=20181201151201", "caption": "Adele in the Digitally Colored Manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much of her personality is known, but from what has been shown of her so far, she is apparently fun loving."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being a mermaid, Adele has several abilities unique to her race. It is not yet shown but she may have the ability to talk to fish and call out to them using sonar waves, which is one of the basic abilities found in all mermaids and some Fish-Men. Apart from the ability to breathe underwater, as a mermaid she also has the ability to swim very quickly at speeds much faster than the flying fish used by the Rosy Life Riders. However, like any mermaid, she is vulnerable on land."}, {"type": "paragraph", "text": "She also appears to be a skilled dancer, as she was dancing during the banquet for the Straw Hat Pirates."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Adele and her friends first appeared in Mermaid Cove, welcoming the Straw Hat Pirates when Camie brought them there for a visit. When the three princes arrived to inquire the crew's illegal entry into Fish-Man Island, the mermaids denied the crew was there, hiding them. However, when the crew's presence were made known anyways by Sanji's nosebleed and Hammond's attack, the princes made it clear that they were simply trying to deliver Jinbe's message to Monkey D. Luffy."}, {"type": "paragraph", "text": "After Ishilly, Fillonce and another mermaid were kidnapped by Caribou, Adele and the others wondered where they went off to, but they had no clue of what happened to them whatsoever. The only thing they did know was that Ishilly had been seen opening a barrel the moment before she disappeared."}, {"type": "paragraph", "text": "After the civil war between the Straw Hats and the New Fish-Man Pirates ended, Adele and her friends was seen dancing at the Ryugu Palace banquet in honor of the Straw Hats' victory and saw them off when they departed to the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Mermaids_Say_Goodbye.png/revision/latest/scale-to-width-down/210?cb=20130112080756", "caption": "Adele and her friends bidding the Straw Hats goodbye."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Caribou's Kehihihihi in the New World", "level": 4, "content": [{"type": "paragraph", "text": "Some time after the Straw Hats left, Adele and her friends witnessed Caribou attempting to kidnap two helpless mermaids."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 and Episode 527, Adele makes her debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 and Episode 569, Adele is dancing during the banquet.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 216), Her name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 62 Chapter 608.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 609 and Episode 528.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 610 and Episode 529.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 653 and Episode 573, Adele bids the Straw Hats' farewell.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 68 Chapter 674, cover story: Caribou's Kehihihihi in the New World Vol. 1, Adele and her friends see Caribou trying to kidnap two mermaids.", "elements": []}]}], "images": []}]}