{"sections": [{"title": "Bellett", "level": 1, "content": [{"type": "paragraph", "text": "Bellett is the prince of an unnamed kingdom who was imprisoned in Impel Down, and whose gender was unwillingly inverted."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bellett was a bulky, heavyweight man with tan skin, blonde hair, and a black beard. His most distinctive feature is his large scar running from his left shoulder down to his chest. He wore green pants with a camouflage pattern (plain green in the anime)."}, {"type": "paragraph", "text": "After being turned into a woman by Emporio Ivankov's Emporio Onna Hormone, Bellett's appearance changed completely except for her scar and blonde hair. As a woman, she is much more slender than her male form, and is also well-endowed. In the anime, Bellett's skin tone also changes drastically between her forms for some reason."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He was very loyal to his family but also a little vengeful, as he tried to avenge them after his father became an okama, which in turn forced him to become a pirate. After his transformation, she became quite shy and embarrassed of her new gender."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Bellett's fighting ability, although he is resilient enough to survive being shot by a cannonball that had been deflected by Iva's Death Wink."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wielded a bazooka when he tried to attack Iva, although the shot was repelled back at him by Iva's Death Wink."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Fifteen years ago his father went to Kamabakka Kingdom and returned as a okama. His family and their kingdom suffered great loss from this sudden change in their king, which forced him in to become a pirate."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Bellett came to Newkama Land seeking revenge against Ivankov for his father fifteen years ago. He shot a cannonball at Ivankov, but pretending to be scared, Ivankov winked at the cannonball and launched it back at Bellett. Ivankov transformed Bellett with Emporio Onna Hormone, turning him into a blonde girl, before offering her the chance to join him and his followers in Newkama Land; however, she ran off in embarrassment."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Bellet_Confronts_Ivankov.png/revision/latest/scale-to-width-down/210?cb=20130510045401", "caption": "Bellett barging in on Ivankov."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bellett vs. Emporio Ivankov", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 55 Chapter 537 and Episode 439, Bellett is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), His name is revealed.", "elements": []}]}], "images": []}]}