{"sections": [{"title": "Cosmo", "level": 1, "content": [{"type": "paragraph", "text": "Sergeant Cosmo is one of the automata created on Karakuri Island by Dr. Tsukimi. Sergeant Cosmo was first introduced in cover story of Enel's Great Space Operations."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cosmo wears a green military outfit and a black hat. Like all automata, he has a bushy brown mustache."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Cosmo_Digital_Colored_Manga.png/revision/latest?cb=20130811033055", "caption": "Cosmo in the digital colored manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He loved his master, Tsukimi, and was very appreciative of Enel beating the Space Pirates. He seems to be loyal to Enel now."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Despite his robotic build as an automaton, Cosmo was no match for the Space Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wields a rifle, but it is not known how proficient he is in using it."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Tsukimi", "level": 3, "content": [{"type": "paragraph", "text": "As his master and creator, Tsukimi loved and cared for Cosmo and the other automata until Tsukimi choked to death."}], "images": []}, {"title": "Other Automata", "level": 3, "content": [{"type": "paragraph", "text": "He seems to get along with the other automata, and went along with them to the moon."}], "images": []}, {"title": "Enel", "level": 3, "content": [{"type": "paragraph", "text": "After the Space Pirates were defeated, Cosmo along with the other automata and the ones on the moon become loyal soldiers to Enel."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "One day Cosmo along with other automata and Dr. Tsukimi were watching the moon and eating snacks when suddenly a huge explosion happened on the moon. The explosion was of unknown origin. Tsukimi, shocked, swallowed his dumpling without chewing, resulting in him suffocating to death. After burying the professor, the four automata along with Cosmo traveled to the moon (each one with a balloon) to take revenge on the one who caused the explosion that resulted in the accidental death of their creator."}, {"type": "paragraph", "text": "Upon reaching the moon, they find the same Space Pirates that destroyed Maxim, and despite overwhelming odds, they fought the captain of the Space Pirates. In the end, however, Cosmo, along with three other automata, were defeated."}, {"type": "paragraph", "text": "When Spacey tries to thank Enel for defeating the Space Pirates, Enel strikes the automata with lightning. After Enel recharges the lunar city, the automata thank him for reviving them. They then join his army."}], "images": []}]}