{"sections": [{"title": "Papaneel", "level": 1, "content": [{"type": "paragraph", "text": "Papaneel is a Fish-Man who lived on Fish-Man Island at the same time as Otohime."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Papaneel is a rather rotund Fish-Man with relatively thin legs and gray skin. His short, black hair is arranged in pattern of having seven thin stripes sticking out, while six spiked stripes inward. He had a relatively square face with a thin five-o'-clock stubble around his mouth. After being slapped hard by Otohime, one of his upper molars have been knocked out of his mouth."}, {"type": "paragraph", "text": "He wore a ringed shirt with a green sweater underneath, black pants and a red mask with yellow spots and a white streak around the bridge of the nose, that covered the upper half of his face."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a5/Papaneel_Portrait.png/revision/latest/scale-to-width-down/140?cb=20130912154230", "caption": "Papaneel unmasked."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When he was first shown, he was so desperate that he committed robbery and took another citizen hostage. After Otohime confronted him about the error of his ways, he became determined to change into a better person."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Fish-Man, he is at least ten times stronger than a normal human."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wielded a flintlock pistol during his robbery."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Papaneel was first shown robbing to get money for his family of ten children. When Otohime stood in his way, Papaneel tried to shoot her. Otohime dodged his shots and slapped him. After knocking him down, Otohime lectured him about the errors of his ways. Touched by Otohime's concern, he swore to change his ways and rectify his life, and thanked her for everything when he was taken away by the authorities for the robbery attempt."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 621 and Episode 540, Papaneel makes his debut in Jinbe's flashback.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 216), Papaneel's name is revealed.", "elements": []}]}], "images": []}]}