{"sections": [{"title": "Sancrin", "level": 1, "content": [{"type": "paragraph", "text": "Sancrin the Thief is a member of the Longarm Tribe and Brook's former manager."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sancrin has a mustache which he shaved off as Brook's manager and black hair. As a longarm, he has double-jointed elbowed arms. While still a kidnapper, he wore an orange Chinese garb with the kanji 盗 (tō, to steal) on it. As Brook's manager he wore a yellow suit with a red shirt underneath, and a black bow tie. He also wore red sunglasses with blue lenses. "}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is greedy and opportunistic, kidnapping humans in order to exhibit them, and then taking advantage of Brook's mercy to kidnap him for the same reasons. Sancrin shows that he did not believe in devils and occult, as he was not afraid of Brook of being a skeleton, despite not knowing he was a Devil Fruit user at the time. When Brook was planning to retire from the rock band industry to return to his crew, Sancrin was fully willing to betray him to the Marines to gain some last minute benefit (the bounty on Brook's head) and revenge, and even held him at gunpoint to prevent him from escaping, proving himself to be a very treacherous man."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "During the timeskip, Sancrin managed to make Brook a world-class star, proving himself to be a good manager."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During raids on Namakura, Sancrin wielded a sword, but it is unknown how proficient he is in using it. He also wielded a gun at Sabaody."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Straw Hat Separation", "level": 3, "content": [{"type": "paragraph", "text": "He first appeared on Namakura Island along with two other longarms in order to kidnap some of the villagers. Brook was able to rally the citizens to fight them. However, the villagers lost and Brook had to defeat the longarms on his own. They tied up the longarms and put them in a cage. Brook later decided to let them go free. Upon their release, Sancrin and the two other longarms kidnapped Brook and put him on display back at their home island. When it was discovered how musically talented Brook was, Sancrin became one of his managers."}], "images": []}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "Before Brook's concert on Sabaody, he told Sancrin that this would be his final show. Sancrin at first seemed more shocked than annoyed. He later called the Marines during the concert to inform them that the music star Brook was actually a pirate. He was very angry when Brook escaped."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat at Dressrosa, Sancrin and his longarm partners were furious at Brook's new bounty."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "At one point in both the manga and the anime, Sancrin mistakenly loses his mustache. Coincidentally, both medias made this mistake during the same scene.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 216), Sancrin's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 557, cover story: Straw Hat's Separation Serial #7 Vol. 1 and Episode 456, Sancrin makes his debut in kidnapping humans.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 600 and Episode 520, Sancrin betrays Brook.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 822, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 14.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 517, Sancrin's mustache is missing when he speaks to Brook.", "elements": []}]}], "images": []}]}