{"sections": [{"title": "Judy", "level": 1, "content": [{"type": "paragraph", "text": "Judy is Marie's fiancé. He was shot by Charlos when he tried to rescue her."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Judy is a young man with shaggy light brown hair. He wore a blue shirt along with a white apron with the kanji for \"alcohol\" written on it. He also wore a pair of yellow pants with square patterns."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Judy is somewhat brave as he was willing to stand up in front of Saint Charlos to save his fiancé. Even though he knew that standing in front of a World Noble would have great consequences, he did not have second thoughts and immediately tried to stop Charlos."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marie", "level": 3, "content": [{"type": "paragraph", "text": "Judy loved his fiancé Marie so much so that he courageously attempted to protest the Charlos's decision to steal her away. As a result, he nearly died trying to save her, showing that he loved her greatly."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Saint Charlos saw Marie and decided to make her his thirteenth wife, Judy stood up and rushed over to them while pleading with him and explaining that she was his fiancé. However, angered that Judy would dare stand up before his presence, Charlos immediately shot him in the chest, causing Judy to collapse on the ground in a pile of blood. Marie then called out for help, but no one dared to challenge a World Noble. However, Roronoa Zoro then passed by and, after a brief confrontation with Charlos, picked Judy up and took him to a hospital. Upon being picked up, Judy continued to call out Marie's name."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Later, when Zoro arrived at the hospital with an unconscious Judy, the doctor there checked to see if Judy had a collar around his neck. When Zoro questioned why it mattered, the doctor responded that the medical fees of slaves cost 50% more, so it would be better to just buy a new one. In response, Zoro angrily emphasized that all that mattered was that he was hurt and asked if they were going to treat him or not. Upon hearing that they would treat him right away, Zoro then handed Judy over to them."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Zoro_Takes_Judy_to_the_Hospital.png/revision/latest/scale-to-width-down/150?cb=20150828210633", "caption": "An injured Judy is taken to a hospital by Roronoa Zoro."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, a scene is added where Zoro arrives at the hospital with Judy and asks for him to be treated."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 499 (p. 13) and Episode 393.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0525), Judy's birthday is given.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), Judy's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 499 (p. 12-17) and Episode 393.", "elements": []}, {"text": "↑  One Piece Anime — Episode 394, Zoro arrives at the hospital with Judy.", "elements": []}]}], "images": []}]}