{"sections": [{"title": "Kairiken", "level": 1, "content": [{"type": "paragraph", "text": "Kairiken is a bounty hunter at Sabaody Archipelago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kairiken is a large, tanned man with a prominent brow who wears a striped purple sweater and has a small afro perched at the top of his head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a bounty hunter, Kairiken is likely quite merciless. He was desperate enough to attack the Straw Hat Pirates but ended up losing miserably to them."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Kairiken's abilities, but as a bounty hunter he likely possesses some combat skill. However, he was easily defeated by Luffy."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Kairiken wields a large sword in combat. It was broken when he was defeated by Luffy's Gomu Gomu no Bazooka."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Kairiken was first seen on Sabaody Archipelago with Minoruba and other bounty hunters. The group attacked the Straw Hat Pirates in an attempt to claim their bounties, but were defeated."}, {"type": "paragraph", "text": "He and Minoruba later visited Peterman, the leader of a kidnapping gang. After they informed him of Camie being a mermaid, Peterman offered the two a 10% cut of her final selling price."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 51 Chapter 498 (p. 2-4), Kairiken debuts.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Kairiken's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), his name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 499 (p. 3) and Episode 393, Minoruba and Kairiken visit Peterman.", "elements": []}]}], "images": []}]}