{"sections": [{"title": "Shanba", "level": 1, "content": [{"type": "paragraph", "text": "Shanba is an inhabitant of Torino Kingdom. He was first seen at the time of Chopper's arrival."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As an inhabitant of Torino Kingdom, Shanba is rather short and fat, and has black hair and a black mustache. He also has a distinctive eye tattoo on his right arm."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shanba originally thought Chopper was a tanuki and tried to hunt him. Along with the rest of his tribe, he was revealed to be quite intelligent."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Shanba’s intelligence allows him to use advanced weapons, such as the rocket spears that he and his tribe mates are seen using. He seems to be quite proficient in using them."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Straw Hat Separation", "level": 3, "content": [{"type": "paragraph", "text": "When Chopper landed on Torino Kingdom, Shanba was one of the inhabitants who suggested making the reindeer into stew and was seen chasing him. Afterward, he, along with a few others, engaged in a fight with the Torino birds. Later, Shanba and the other natives befriended Chopper, who eventually resolved the conflict between them and the Torino birds. They bid Chopper farewell when he left to return to Luffy. Shanba was seen again with the rest of his tribe when Chopper returned, and said that his disguise wasn't working."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat at Dressrosa, Shanba, his tribe, and the giant birds receive Chopper's new wanted poster."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 524 and Episode 419, Shanba is introduced and wants to make \"tanuki stew.\"", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Shanba's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), his name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 552, cover story: Straw Hat's Separation Serial #5 Vol. 1 and Episode 454, Shanba and his tribe chase Chopper.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 595 and Episode 513, Shanba and his tribe reveal that they are actually very intelligent.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 554, cover story: Straw Hat's Separation Serial #5 Vol. 2 and Episode 454, Shanba and his tribe fight against the Torino birds.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 60 Chapter 591.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 13.", "elements": []}]}], "images": []}]}