{"sections": [{"title": "Kanezenny", "level": 1, "content": [{"type": "paragraph", "text": "Kanezenny is an elderly farm woman from Nico Robin's flashback."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kanezenny is an elderly woman with large eyes, small ears, a crooked nose, wide chin, lumpy cheeks, and a wide smile. She tied her long hair into a ponytail, and wore a light purple dress with dark purple spots and a brown jacket over it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kanezenny is a deceptive and cruel old woman, appearing to be kind and understanding towards Robin at first, only to sell her out to the World Government for the bounty on her head. She is also very short-tempered and argumentative, as when Robin escaped, Kanezenny demanded her reward regardless for simply giving information on Robin's whereabouts, and even reacted violently toward the agents who refused to pay her."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "When an eight year old Robin was looking for refuge from the World Government after escaping from the Ohara Incident, Kanezenny took the child in. Robin worked hard for the elderly woman, with Kanezenny acting kind and loving in return. Robin thought she had found her place to stay. However, one evening, when Robin entered the house for dinner, she saw that Kanezenny had led World Government agents into the house to ambush Robin. Robin managed to escape, and this was the first betrayal she ever suffered. Regardless, Kanezenny demanded that the agents pay the bounty for providing information on Robin's whereabouts, and was last seen angrily grabbing the collar of one of the agents she had brought in, screaming at them."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The two parts that composed of her name, \"kane\" (金, \"kane\") and \"zenny\" (銭, zeni), means \"gold\" and \"money\", respectively, possibly referring to her greedy nature.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 214), Kanezenny's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 398 and Episode 278, Kanezenny is shown in Robin's flashback.", "elements": []}]}], "images": []}]}