{"sections": [{"title": "Ahho Zurako", "level": 1, "content": [{"type": "paragraph", "text": "Ahho Zurako is a noble from the Goa Kingdom and the daughter of Ahho Desunen IX."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Zurako is a girl with a rather ugly face, reddish-brown hair with a yellow bow, and a light blue dress with white bows."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a noble raised by a corrupted and spoiled parent, Zurako considers all people who are not nobles trash. She states that being burnt is their fault for not being born nobles."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Ahho Desunen IX", "level": 3, "content": [{"type": "paragraph", "text": "Zurako had an amiable relationship with her father, Desunen. She full-heartedly agreed with him when he stated that the people who lived in the trash dumps of Gray Terminal deserve to die for not being born nobles."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Zurako was seen on the night Gray Terminal was burned. Her father told her that the people who are being incinerated deserved it because they were not born into nobility and she completely agreed with him."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is an allusion to the Japanese word \"ahozura\", which means \"idiotic face\". The \"ko\" at the end of her name is a common way to end a Japanese girl's name.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  https://twitter.com/translatosaurus/status/1180550283736178689", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 587 and Episode 501, Zurako agreeing with her father on how the people of Gray Terminal deserve to suffer for not being nobles.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), Her name is revealed.", "elements": []}]}], "images": []}]}