{"sections": [{"title": "Jobo", "level": 1, "content": [{"type": "paragraph", "text": "Jobo is a citizen of Mock Town."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a normal sized man, with stubble on his chin and upper lip. He has a large nose, and longish black hair. He wears a hat with a bandana underneath, and has a small scar under his right eye. Evidently a drunkard, his face is often flushed and lethargic-looking."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appears to respect Bellamy and his crew, because he warned them about the bounties on Luffy and Zoro. He is apparently a heavy drinker, saying he must have had too much to drink after seeing the high amounts on the wanted posters."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "Jobo was first formally seen urinating by the port and thanking the \"god of Booze\", but was actually among those who joined in with the Bellamy Pirates when they taunted Luffy, Zoro, and Nami in the bar."}, {"type": "paragraph", "text": "He later receives a bundle of wanted posters delivered by a sea gull flying overhead. After initially mistaking it for newspapers, he realized what they actually were and started to inspect them, eventually coming across Luffy and Zoro's new bounties. At first, he thought that he had drunken too much when he tried to count Luffy's bounty, but eventually realized it was no mistake and his bounty was indeed 100,000,000. Shaken to the core, he immediately ran back to Bellamy to report this recent development."}, {"type": "paragraph", "text": "And though Bellamy concluded that the new bounties were fakes, Jobo remained cautious of the possibility that they were not. His conjectures were later proven to be true when Luffy beat the over confident captain to the ground with a single punch. Jobo's location now is unknown."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jobo is the Japanese sound effect of pouring liquid.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 232 and Episode 150, Jobo makes his first appearance.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 212), his name is revealed.", "elements": []}]}], "images": []}]}