{"sections": [{"title": "Stevie", "level": 1, "content": [{"type": "paragraph", "text": "Stevie is one of the two sea train organizers in Water 7, along with Bushon."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Stevie wears a black conductor's hat, along with a black suit with epaulets on it, and a dark tie. He's got brown hair and a mustache of the same color, along with standard-shaped glasses."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Stevie is very strict about the rules, as he was unwilling to let Sanji aboard Puffing Tom. He appears to have great respect for Paulie. In the anime, he is known to eavesdrop and gossip, as he tried to see who was boarding the Sea Train for Enies Lobby, but was stopped by World Government officials. He also tends to come to the wrong conclusions about events in Water 7 because of the nature of gossiping itself. He believed a group of thugs in the backstreets was responsible for the destruction of Galley-La headquarters, mistook Sanji's letter for Nami in Blue Station as a failed love confession from Paulie in the midst of a love triangle, and thought that when Nami had them go collect food and drinks for the crew, it was all for her and she had a big appetite as a growing woman."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "Stevie was first seen at the Water 7 station, seeing off the train chartered by the World Government. He was then hit in the face by one of Paulie's ropes. He then asked about Paulie's wounds. When Nami declared that she would save Robin, Stevie, Paulie, and Bushon were surprised by her fury, since she appeared sad only moments before. He, Nami, and Bushon were then saved by Paulie from the incoming tide caused by the Aqua Laguna."}, {"type": "paragraph", "text": "Later, Stevie and Bushon were sent on a quest to find meat and sake, thinking that the food was for Nami. Right before Rocket Man took off, Nami brought Bushon and Stevie to its location. Bushon and Stevie commented on how they were surprised by the existence of another sea train. They were last seen watching Rocket Man leave with Iceburg."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "They watched the Rocket Man got onto the railway from the distance. They ended up fighting over a pair of binoculars and challenged each other to Rock, Paper, Scissors for who would keep the binoculars and who must go tell Iceburg that Kokoro made it onto the tracks safely."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Bushon and Stevie later rushed to join the Straw Hats' party after Blue Station closed and went off-duty for the night. Stevie noticed the whole town was gone and must be partying without them. Bushon, being out of shape, collapsed for a moment and remarked he was getting too old. Stevie got the idea that Water 7 was partying because Paulie and Nami were getting married, still having the wrong idea about the \"love letter\" from Sanji. The employees believed they had a part in the grand scheme of this \"marriage\" because they witnessed the tragic event at Blue Station where Nami was actually upset that Robin had boarded the Sea Train."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "His and Bushon's attempt to discover the real identities of the CP9 Agents only to be stopped by World Government officials did not occur in the manga.", "elements": []}, {"text": "Stevie and Bushon's gossip based nature and misconceptions is more stretched out in the anime. One example is their misconception of Nami's letter from Sanji and thinking it was an actual love letter, causing them to think Nami was in a love triangle and later in the Post-Enies Lobby arc mistakenly thought the Straw Hat's party was for Nami getting married to Paulie.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 38 Chapter 361 and Episode 251, Stevie makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 213), Bushon's and Stevie's names are revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 251.", "elements": []}, {"text": "↑  One Piece Anime — Episode 253.", "elements": []}, {"text": "↑  One Piece Anime — Episode 316.", "elements": []}]}], "images": []}]}