{"sections": [{"title": "Haritsu Kendiyo", "level": 1, "content": [{"type": "paragraph", "text": "Haritsu Kendiyo is a New World pirate who was captured by the Kid Pirates prior to the timeskip."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kendiyo is a large man, bigger than Kid, and slightly fat as well. He has bushy brown hair and a scraggly beard, and wore a red captain's coat over a white shirt and brown pants. He has a sword over his back."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kendiyo is shown to be a weak-hearted pirate. After his defeat and capture by the Kid Pirates, he wanted to run away and return to Paradise with his crew."}, {"type": "paragraph", "text": "He seems to be very caring toward his crew as he begged Kid to let him and his crew escape alive from the New World and return to Paradise."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Judging by the fact that he was able to make it all the way to the New World, it can be assumed he has some strength. However, he was no match for the harsh conditions of the New World or Eustass Kid, and was eventually captured by the latter. He has a sword, which he is presumably competent in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Post-War Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was on an island in the New World at the same time as the Kid Pirates. He and his crew were captured. As Kid and Killer were talking about Luffy, he begged Kid to let them return to Paradise alive. Kid then crucified him and his whole crew for not having the resolve to deal with the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6c/Eustass_Kid_in_the_New_World.png/revision/latest/scale-to-width-down/250?cb=20141206070009", "caption": "Haritsu Kendiyo and his crew crucified by Eustass Kid."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Haritsu Kendiyo and crew vs. Kid Pirates (unseen)", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  https://twitter.com/translatosaurus/status/1180550838684512256", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 and Episode 511, Haritsu Kendiyo is captured and crucified by Kid.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 216), Haritsu Kendiyo's name is revealed.", "elements": []}]}], "images": []}]}