{"sections": [{"title": "Reuder", "level": 1, "content": [{"type": "paragraph", "text": "Reuder is a reporter who first made an appearance at the Sabaody Archipelago, during the Battle of Marineford."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Reuder is a middle-aged man. He has black hair and a goatee of the same color. He sports a beige newsboy cap. He wears a grey jacket with a white dress shirt underneath with a loose red tie. He also wears matching grey slacks and a brown belt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Reuder, like most people, was very terrified that Ace was Roger’s son and of the power that was present at the Battle of Marineford."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Marineford, where most of the Marines' families live, is empty as everyone had been evacuated to Sabaody Archipelago. On the archipelago, the families as well as many reporters watched giant monitors that were broadcasted from Marineford, monitoring the situation. Reuder, a journalist, and other reporters were also present, ready to deliver the news as soon as possible."}, {"type": "paragraph", "text": "Reuder is the first among the crowd to proclaim that Ace has arrived on the gallows. Later, when Sengoku announces that Ace is Roger's son, Reuder and the rest of the crowd are shocked and horrified. He then watches the rest of the war unfold with the rest of the crowd."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 550 and Episode 459, Reuder is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), His name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 551 and Episode 459, Reuder and the world are shocked that Ace is Gol D. Roger's son.", "elements": []}]}], "images": []}]}