{"sections": [{"title": "Monkey D. Luffy", "level": 1, "content": [{"type": "paragraph", "text": "Monkey D. Luffy, also known as \"Straw Hat Luffy\" and commonly as \"Straw Hat\", is the main protagonist of the manga and anime, One Piece. He is the founder and captain of the increasingly infamous and powerful Straw Hat Pirates, as well as one of its top three fighters. His lifelong dream is to become the Pirate King by finding the legendary treasure left behind by the late Pirate King, Gol D. Roger. He believes that being Pirate King means having the most freedom in the world."}, {"type": "paragraph", "text": "He is the son of the Revolutionary leader Monkey D. Dragon, the grandson of the Marine hero Monkey D. Garp, the sworn brother of late \"Fire Fist\" Portgas D. Ace and Revolutionary Chief-of-Staff Sabo, and the foster son of Curly Dadan."}, {"type": "paragraph", "text": "By the time Luffy and his crew left the East Blue for the Grand Line, they had defeated all the strongest pirate crews of the eastern seas, with Luffy himself defeating all their captains. This earned him the highest bounty of the East Blue at 30,000,000. He has since gained a worldwide reputation for causing trouble, challenging the Shichibukai, the Marines, and the Yonko, additionally committing felonies and actions which were deemed threatening by the World Government. Furthermore, in the majority of these confrontations, he has emerged as the victor. He has gained a reputation for being \"reckless\" and, in some cases, \"insane\", after causing an incident in Enies Lobby, assaulting a World Noble at Sabaody Archipelago, entering and escaping from Impel Down (while indirectly causing a large-scale riot in the process), and joining the Battle of Marineford. He is, therefore, infamous for being the only known pirate to not only deliberately attack the three most important government facilities, but also escape from all of them alive after facing incredibly powerful opponents in each one. The additional fact that he punched a World Noble with full knowledge of the consequences, as well as his heritage, has caused Luffy to be labeled as a \"Dangerous Future Element\", earning the wrath of Fleet Admiral Sakazuki and Marine Headquarters."}, {"type": "paragraph", "text": "At the beginning of the Levely Arc, Luffy's achievements were compiled, greatly inflating his infamy, which was already immense to begin with. This includes his relationship as a sworn brother to both the late commander of the second division of the Whitebeard Pirates and the son of Gol D. Roger, Portgas D. Ace, and the Revolutionary Army Chief-of-staff, Sabo; the fleet that unofficially formed under him; the infiltration operation of Big Mom's territory, Totto Land, where he defeated the Sweet Commanders Charlotte Cracker and Charlotte Katakuri, attempted an assassination on Charlotte Linlin herself, while destroying her castle (unintentionally), and created a prompt alliance with Germa 66, the Sun Pirates, and the Fire Tank Pirates before escaping after the assassination failed. Though his capabilities were slightly exaggerated by the press, his achievements were great enough for him to be officially titled the \"Fifth Emperor of the Sea\"."}, {"type": "paragraph", "text": "These acts, among other things, have given him his current bounty of 1,500,000,000. Having had a bounty of 300,000,000 prior to his arrival at the Sabaody Archipelago, Luffy is one of eleven rookie pirates who simultaneously reached the Red Line with bounties over 100,000,000, a group which would go on to be referred to as the \"Worst Generation\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Luffy has black shaggy hair, round black eyes, and a slim muscular build. He is renowned for his trademark straw hat (from which he gets his nickname \"Straw Hat Luffy\"), which was lent to him when he was young by the legendary pirate captain, \"Red-Haired\" Shanks, who in turn received it from Gol D. Roger. He wears short, blue trousers with cuffs, sandals, and a sleeveless red vest. Luffy also has a scar with two stitches underneath his left eye (which he earned by stabbing a knife under his eye to show Shanks that he was tough and not afraid of pain) and short, messy black hair. He was severely wounded by Akainu in the Battle of Marineford, leaving a large X-shaped scar on his chest. Appearing to be scrawny underneath his shirt, he has a surprisingly well-built physique. He is quite short since he appears dwarfed by most individuals in the series (though it must be noted that characters in One Piece are often very tall by real-life standards)."}], "images": []}, {"title": "Before the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Similar to most of his male crewmates, Luffy has the same outfit throughout most of the series, as opposed to the rest of the crew (especially Nami and Nico Robin), who change frequently. Luffy may wear a different outfit to suit the climate of an island (like a hooded parka on Drum Island or desert robes in Alabasta) but will switch back to his trademark red vest and blue shorts after the adventures on that island are over. Despite this, he will wear his usual outfit in different colors and has been known to sport other miscellaneous items on his person from time to time like in Thriller Bark and Sabaody Archipelago. According to Eiichiro Oda in 37 Volume SBS, Luffy does not know how to dress stylishly so sometimes he is advised on how to dress by more fashionable team members, Nami, Usopp, Sanji and Robin."}, {"type": "list", "elements": [{"text": "During the Drum Island Arc, he wore two parkas, the first being a dark red parka with fur on the cuffs, hood, and hem, and then a checkered, hooded parka with the colors white, orange and bright yellow, which Nami wore in the beginning.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Alabasta Arc, he wore desert robes consisting of a dark red robe with three white rings decorated along both of the sleeves and a light blue wrap over his head.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Skypiea Arc, he wore a black wristband around his left wrist with a white bangle over it. In 37 Volume SBS, Oda said that two members of his crew lent him accessories: a black wristband by Usopp and a white bracelet by Sanji.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Long Ring Long Land Arc, Luffy wore an afro on his head, dark red shorts, and red bandages on his feet, getting an image of a blue flaming skull and crossbones painted on his chest as well, when he was fighting Foxy.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Enies Lobby Arc, he wore black shorts which had more pockets than his blue shorts (However, Luffy noted that he couldn't fit his meat in them.).", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Post-Enies Lobby Arc, Luffy wore a white T-shirt with the Galley-La Company emblem on it in red; red liners around the top, shoulders, and collar; and navy blue shorts.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Thriller Bark Arc, he wore an orange vest and red shorts. After the battle against Moria in Thriller Bark, Luffy wore a dark decorated, jeweled armband around his left bicep, given to him by Nami. This armband was later revealed to be a map that leads to Captain John's lost treasure, which Buggy sought for some time - leading to Luffy handing the armband in for Buggy in exchange for his services at helping him navigate through Impel Down.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Sabaody Archipelago Arc, in the manga, he wore a blue vest and red shorts (which can be seen on the cover of volume 52). In the anime, he wore the same blue vest, but with dark blue shorts.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Amazon Lily Arc, Luffy wore a light blue vest with red shorts.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Impel Down Arc, Luffy wore his outfit from his stay on Amazon Lily until after his fight with Magellan, at which point he replaced his light blue vest with a bright yellow vest given to him by Inazuma.", "elements": []}]}, {"type": "paragraph", "text": "No matter where he is, Luffy wears his Straw Hat through absolutely everything, though at the start, the hat was prone to get knocked off his head easily, forcing Luffy to either put it aside or have someone hold onto it during fights. From the Alabasta Arc onward, he has gotten a string strap for it, which was sewn on by Nami, allowing the hat to hang from his neck during fights."}, {"type": "paragraph", "text": "During his return to Marineford to give a silent prayer, Luffy was briefly shown with four characters written on his right arm spelling 2Y, with the 3D crossed out to symbolize that the Straw Hat Pirates should meet up in 2 years (2Y) rather than the 3 days (3D) as planned after fleeing from Bartholomew Kuma."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After those two years, a few things have changed. Luffy wears an open, long-sleeved red cardigan with four buttons (which shows the X-shaped scar covering most of his chest he received by then-Admiral Akainu), with a yellow sash tied around his waist, somewhat reminiscent of Gol D. Roger's outfit. He has grown slightly taller and is shown to be significantly more muscular due to his training. This can be seen in his slightly thicker neck, more pronounced deltoids, and better-defined chest. During his fight with Sanji, Luffy loses one of his top teeth after being struck by a Diable Jambe Joue Shot directly into his face. However, it grew back after he drank a bottle of milk."}, {"type": "list", "elements": [{"text": "During the Punk Hazard Arc, Luffy wore a long winter coat with red and white horizontal strips, along with yellow ear muffs, which he stole from one of Brownbeard's Centaur Patrol Unit.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Dressrosa Arc, Luffy wore an open, short-sleeved shirt with a sunflower pattern, along with his standard blue shorts and yellow sash. He also wore a fake beard. Upon entering the tournament for the Mera Mera no Mi in the Corrida Colosseum, he wore Viking-style armor, complete with a sword and shield, until it was stripped from him due to a violation of the weight restriction. Upon revision to the weight restriction, he added a cape and wore the same Viking style helmet he wore previously. Along with his registration number '0556' on the back of his shirt, obscured by his cape. When he recovered after his battle against Doflamingo, Luffy wore a red tank top along with his standard shorts in brown.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Whole Cake Island Arc, Luffy wore an open, fancy white cardigan with puffy sleeves along with his standard shorts in red. He also had a decorative scarf wrapped around his straw hat after landing at the Seducing Woods, though he appears to have lost it during his battle with Charlotte Cracker. These clothes were eventually torn to shreds after several battles and he later dons a new outfit to meet with Capone Bege; a red suit jacket with a brown shirt and a red ascot along with red formal shorts. He also fitted a black fedora to the top of his straw hat.", "elements": []}]}, {"type": "list", "elements": [{"text": "During the Wano Country Arc, Luffy wore a red yukata with patchwork mon of a blue rounded sun on a cyan background and a yellow obi. He also had a topknot on top of his hair. He also had the Nidai Kitetsu he borrowed from Tenguyama Hitetsu. Before beginning the assault on Onigashima, Luffy received a set of samurai armor from Hitetsu.", "elements": []}]}], "images": []}, {"title": "Non-canon", "level": 3, "content": [{"type": "paragraph", "text": "In the Movie 3, he wears a red shirt with the number \"01\" in black in the middle. You also momentarily saw a deer costume consisting of a fur coat and two branches as antlers."}, {"type": "paragraph", "text": "In the G-8 Arc, he infiltrates as a Marine cook, wearing a white cook uniform, a blue scarf on his neck, and a white cook hat covering his straw hat."}], "images": []}]}