{"sections": [{"title": "Monet", "level": 1, "content": [{"type": "paragraph", "text": "Monet was a scout and assistant for Caesar Clown and his underlings in the research facility on Punk Hazard. She had her original human arms and legs replaced with bird limbs, giving her an appearance resembling a harpy. She was, in truth, a member and officer of the Donquixote Pirates and was sent as a deep cover agent by Doflamingo. Due to her mission and actions, she could be regarded as the tertiary antagonist of the Punk Hazard Arc. She was also the older sister of Sugar."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As a harpy, she had white feathered wings instead of arms that fade to light green at the edges, talons instead of feet, and a tail. She had the build of an average human, but her long legs made her somewhat taller than average. She had long, wavy, light green hair and brown eyes. In the anime, her eyes are amber. She was also considered very attractive as several Marines commented on her appearance."}, {"type": "paragraph", "text": "She wore a green cropped tank top with \"HAPPY\" written in dark green on the chest and yellow cut-off pants with orange stripes. She had a Baby Den Den Mushi strapped to her belt."}, {"type": "paragraph", "text": "She was usually seen wearing glasses while reading, implying she was farsighted. The glasses have circles in a ripple pattern on the lenses, giving the appearance of thick spectacles."}, {"type": "paragraph", "text": "In a flashback, she was seen with human limbs, wearing a blue and white striped shirt and blue bloomers, as well as a set of blue heels."}, {"type": "paragraph", "text": "When enraged, Monet could transform her body into a large demonic entity with sharp teeth and berserk-like eyes."}, {"type": "paragraph", "text": "In the manga, Monet's legs had human skin below the cutoff of her pants until the first joint, while in the anime, her legs had all bird skin below the cutoff of her pants."}, {"type": "paragraph", "text": "As a child, Monet wore a white tank top, black pants that went down to her knees, and standard glasses."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Monet appeared to have a very flippant personality, choosing to only inform Caesar about the disaster unfolding on Punk Hazard, after finding out that the intruders were the Straw Hat Pirates. Despite all of the uproar, she maintained the thrilled smile on her face, implying she found it amusing."}, {"type": "paragraph", "text": "Monet was also shown examples of being quite diligent, like how she explained to Caesar how the Straw Hat Pirates' real strength might be above their current bounties, being unsurprised by Luffy breaking through her barrier noting an ordinary pirate could not do so, recognizing that she couldn't defeat Luffy in battle, knowing how to delay him effectively, she also did not believe that she could beat Zoro in a sword fight and instead tried to aim for the weaker targets: Nami, Chopper and Robin. Zoro commented on this, stating it was pitiful she attacked people who could not even defend themselves, due to their lack of Haki."}, {"type": "paragraph", "text": "Monet was also a very calm and level-headed individual, as she rarely got surprised or angry in regards to either situation and always maintained a relaxed demeanor even in the heat of battle. Also, unlike Caesar, she was a much more skillful liar, such as all the children believing her about Caesar's treatments on them to cure illnesses. Despite knowing of Caesar's cruel treatment towards the children and his own underlings, Monet continued to follow him without hesitation (likely due to her mission to watch over him from Doflamingo's order)."}, {"type": "paragraph", "text": "She could also be rather flirtatious, such as flirting with Law when he returned to the lab and even thinking about a date when he said he needed her. When commented on her looks and being told of her beauty, she bashfully blushed despite the serious situation. She also tried to cover herself with her wings and her knees buckled as well, suggesting she was rather shy to compliments."}, {"type": "paragraph", "text": "Monet has been shown to be rather sadistic, seemingly enjoyed the suffering of others such as chuckling at Law's pain from encountering Vergo. She, like Caesar, gave the children the terrible drug, NHC10, with a smile, showing that she was just as ruthless as her master while even knowing of how they will die within five years yet she showed no concern whatsoever. When Mocha was in danger and being chased by the drug enhanced children, Monet showed no concern and even derided her situation when her life was on the line. She expressed no remorse for what was happening to either Mocha or the berserk children, and even mockingly stated that she and Caesar had raised them, giving them a carefree life, despite using them as test subjects. Like Doflamingo, she had a habit of sticking her tongue out in a sadistic manner when she was amused about a predicament or when she attempted to kill someone."}, {"type": "paragraph", "text": "Monet could also be terrifying when enraged such as when the Straw Hat Pirates and the Marines tried to stop the kids, Monet was furious at them for attempting to ruin her long, hard work and even justified her actions against the children by claiming that she gave the kids a happy and carefree life."}, {"type": "paragraph", "text": "Monet has a habit of licking her lips, usually when she gets excited, like when she is about to fight Luffy, or hears something interesting, such as Luffy being able to use Haoshoku Haki in the anime."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f5/Monet_Blushing.png/revision/latest/scale-to-width-down/210?cb=20141206081603", "caption": "Monet blushing when the G-5 compliment her."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Sugar", "level": 4, "content": [{"type": "paragraph", "text": "Monet and Sugar are sisters, whom Doflamingo saved from a terrible environment when Monet was 17 years old and Sugar was 9 years old. Sugar and Monet were never shown interacting with each other and it is unknown if Sugar heard about Monet's death."}], "images": []}, {"title": "Crew and Allies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "As Donquixote Doflamingo is her captain and young master who rescued Monet and Sugar from the harsh environment that they had to endure, they are incredibly loyal to him, willing to lay down their lives for his purposes. She also believes that he is the one destined to become the Pirate King."}, {"type": "paragraph", "text": "While by Monet's passing comment that Doflamingo would kill her if she allowed anything bad to happen to Caesar, which shows how Doflamingo considers her expendable, he still placed enough value in her abilities to insert her as a deep-cover agent on Punk Hazard to monitor the deranged scientist's actions. As with all members of his \"family\" whom he cherishes, Doflamingo showed remorse for making her sacrifice herself and when she suddenly stopped talking, he personally headed there to see what was wrong."}], "images": []}, {"title": "Caesar Clown", "level": 4, "content": [{"type": "paragraph", "text": "Monet was very close to Caesar and unlike the centaurs, she was not ignorant of his true nature. However, it is revealed that Doflamingo assigned Monet to infiltrate Caesar's organization on Punk Hazard, due to mistrust for the deranged scientist, as well as to protect Caesar from any threats to his life. Despite this, she was fully willing to give her heart to Law per Caesar's orders without hesitation. Monet did take her job in protecting Caesar and his test subjects very seriously as she kept Luffy from capturing Caesar  and hindered the Straw Hats and the G-5 Marines from rescuing the children."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Kidnapped Children", "level": 4, "content": [{"type": "paragraph", "text": "Monet appeared to be very kind to the children kidnapped and used for experiments. Her rewarding of the children and her friendly attitude makes some of the children view her as a mother. Mocha is the one exception to this, as she realized that they are all being deceived and eventually turns against Monet. In reality, Monet was working with Caesar and saw the children as nothing more than mere test subjects for experiments."}], "images": []}, {"title": "Viola", "level": 4, "content": [{"type": "paragraph", "text": "Despite being crewmates, Viola holds the snow Woman with nothing short of contempt due to her role as a spy as well as the betrayer of her trust that led to her family's dethronement and her servitude as an assassin."}], "images": []}, {"title": "Trafalgar Law", "level": 4, "content": [{"type": "paragraph", "text": "Monet appeared to have a playful attitude toward Trafalgar Law, as when he asked her to come with him because her abilities were useful, she questioned if he was asking her out on a date. When Law was in pain, she showed mild concern, but when Vergo revealed himself she chuckled instead. Ultimately, due to Law having returned her heart to Caesar where he believed it was Smoker's, Law is indirectly responsible for Monet's death, which he viewed as his 'reward' for doing 'good' in returning Monet's heart to Caesar."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a harpy, she had the ability to fly. Her feathers were prehensile enough for her wings to double as hands, as she was seen holding a newspaper with them. Although they make rather large hands, she was able to do delicate things with them such as turning pages and writing. She could also use her talons to slash foes."}, {"type": "paragraph", "text": "She seemed to be a good researcher as she was able to look up information about the Straw Hats in a short amount of time, and later inform Caesar about Law's involvements with Luffy from two years ago. She was also quite perceptive, noting that the true strength of the Straw Hat Pirates might be more than what their bounties suggest since they have been inactive for two years. She was also cunning enough to be able to delay Luffy effectively even though he outclassed her."}, {"type": "paragraph", "text": "In direct combat, Monet was a capable fighter, being able to fight against Luffy and later Zoro without much difficulty (though she did admit she would not be able to defeat them and was only able to hold them off). With her powers, she was able to overwhelm both Nami and Robin with little effort and even clash with a powerful swordsman such as Zoro (when he was holding back). Her skills were great enough to overwhelm Tashigi, a Marine Captain, with little effort and would have defeated her had Zoro not interfered."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Monet ate the Yuki Yuki no Mi, a Logia-classDevil Fruit which allowed her to become and control the element of snow."}, {"type": "paragraph", "text": "She could produce and manipulate snow, forming solid snow barriers. These barriers are quite hard, making it difficult to destroy them, but she could easily pass through her snow barriers. She also had the ability to make someone fall asleep by hugging them with her icy body which causes their body temperature to lower and leaving them weakened."}, {"type": "paragraph", "text": "By covering a room in snow and creating a snowstorm, she could also gain an advantage in battle, as she was able to move much faster, and hide in the snow to deliver sneak attacks. She could also trap her enemies in snow and transform herself into a huge snow monster. In this form, her bite was not only strong, but cold enough to freeze and break the afflicted body part. She was also able to use her snow to make sharp objects such as turning her wings into sharp blades that were strong enough to clash with Zoro's swords. She can also change parts of the wing into snowballs that hit the ground with tremendous force and create a blizzard to create a smokescreen for a surprise attack."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Yuki_Yuki_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20170805155559", "caption": "Monet becoming snow, allowing bullets to pass through her harmlessly."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Monet_Dodges_Busoshoku_Haki.png/revision/latest/scale-to-width-down/210?cb=20160219063036", "caption": "Monet using her ability to dodge Tashigi's Haki-imbued attack"}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Monet wielded a pair of gigantic ice picks, which she used by holding them with her clawed feet, and was capable of clashing with Zoro, who was an accomplished swordsman. In the anime, they were composed of snow and reverted back into snow when she was defeated."}, {"type": "paragraph", "text": "She could also use her wings as a sword with her \"Snow Sword\" ability against him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Monet%27s_Ice_Pick.png/revision/latest/scale-to-width-down/200?cb=20150529085439", "caption": "Monet's ice pick weapons."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Joining the Donquixote Family", "level": 4, "content": [{"type": "paragraph", "text": "Monet and her sister Sugar used to live in a terrible environment. When Monet was 17 years old and Sugar was 9 years old, Donquixote Doflamingo saved them from that environment. They decided to give up their former lives for the Donquixote Family and the sisters were given their Devil Fruits."}, {"type": "paragraph", "text": "Sometime before Doflamingo's arrival at Dressrosa, Monet worked at the royal palace. During the takeover, Monet captured Viola and opened the gates to the royal palace, allowing the officers of the Donquixote Pirates to invade."}, {"type": "paragraph", "text": "At a later point in time, Monet was sent to Punk Hazard by Doflamingo to monitor Caesar Clown."}, {"type": "paragraph", "text": "Monet was present when the children first arrived on Punk Hazard and when Caesar deceived them about their treatment for a supposedly fatal disease. While they are held in Caesar's facility, Monet acted like a maternal figure towards the children and gave them NHC10 candy as rewards."}], "images": []}, {"title": "Law's Arrival in Punk Hazard", "level": 4, "content": [{"type": "paragraph", "text": "Monet was taking down notes about Trafalgar Law when he first arrived on the island. After realizing that Law is a doctor, she asked him to help the people on the island who lost their legs as a result of the poisonous gas on the island two years earlier. At some point, Law removed her heart on Caesar's orders and gave Caesar his own as an insurance policy so neither side betrays the other. She also had Law use his Devil Fruit powers to replace her arms and legs with bird limbs."}], "images": []}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "Monet was first noticed by Usopp after Luffy and Zoro fought a dragon, which she had been observing. Disappearing before the others could see her, she reappeared later flying across the island to the ice side and communicating with someone via Den Den Mushi. She was informed about the four intruders inside the research facility."}, {"type": "paragraph", "text": "She later appeared inside the facility, reporting to Caesar about the Straw Hat Pirates while reading a newspaper article about their return. She was later seen as Caesar got permission from Joker to eliminate the Straw Hats, the G-5 Marines, and Kin'emon. When Monet pointed out to him that since the Straw Hat crew suddenly became inactive two years ago, their current bounties might not be good indications of their threat level, Caesar commented on her diligence. She then witnessed Caesar conducting one of his experiments, and when she asked if it was a failure, Caesar replied that he never fails."}, {"type": "paragraph", "text": "While Law and Caesar were having a conversation concerning the Straw Hats, Monet informed Caesar of Law's association with Luffy at Sabaody Archipelago and Marineford. Later, when a Den Den Mushi was ringing, Caesar told Monet to ignore it as he felt that there was no need to answer it. Caesar proceeded to tell her about a creature called Slime."}, {"type": "paragraph", "text": "After Caesar left and Law entered the building, Monet told Law ahead that Caesar was not present anymore, guessing that he was probably out to watch the battle. When Law told her that he would leave, Monet simply stated that it would get lonely without him. As Law told Monet that he needed her powers for something, Monet teasingly asked him if it was a date and gladly accepted, since she was bored anyway. While walking down a hallway, Law suddenly started to feel strong pain, which Monet seemingly responded with worry and asked him whether he was okay. However, as the shady person, who was apparently responsible for it, walked down the hallway, Monet started to chuckle."}, {"type": "paragraph", "text": "Monet watched as Vergo, who incapacitated Law, explained to Law about not trusting Caesar, which was the reason why Monet was sent undercover to Punk Hazard. She continued to watch and chuckle as Vergo used his powers to knock out Law."}, {"type": "paragraph", "text": "Monet spoke with Vergo, who was questioning Caesar's motives, and suggested that he might be starting another big experiment. She noticed something on Vergo's cheek and asked him whether he had eaten a burger that morning, which he replied yes to. Later on, she watched as Luffy and the others were locked in a Seastone cage inside the research facility. She later told Caesar that all of the orders he gave had been completed. She then, upon his order, connected the receiver from his balloon to the broadcast Den Den Mushi. She and Vergo then listened to his broadcast to the underworld brokers."}, {"type": "paragraph", "text": "After the Straw Hats, Brownbeard, Kin'emon, Law, and the G-5 Marines reunited and formed an alliance, Monet was seen while Caesar was being informed that the Straw Hats and their allies were in the base. Monet looked over and seemed to observe Chopper making a quick escape after finding a sedative and a cure. After everyone but some unfortunate Marines escaped Caesar's plan to let the poison gas in, Caesar ordered Monet to let the gas inside another door. Monet told him that he would be petrifying Vergo, but Caesar did not care whether Vergo died or not."}, {"type": "paragraph", "text": "She later observed the rematch between Caesar and Luffy. When the Straw Hat captain prepared to launch an assault to end the battle, Monet blocked him using her Devil Fruit ability to create a wall to protect Caesar and advised him to abandon the battle. Caesar complied and left but before Luffy could pursue him, Monet got in his way, claiming \"Joker\" would dispose of her if something happened to Caesar, prompting Luffy to question Doflamingo's motivations. After hearing the broadcast of Law's actions in the room where the SAD was manufactured, she figured out his true agenda. She was later contacted by Doflamingo and told to return to Dressrosa once Baby 5 and Buffalo arrived and took care of things."}, {"type": "paragraph", "text": "Monet then sealed Luffy in a ten-layered snow hut. Luffy said that Monet could not defeat him in a fight, to which she agreed but stated that there are other ways to win without having to rely on her fighting powers. She then suddenly hugged him and began to weaken him with her powers, attempting to coax him into unconsciousness. Luffy, however, simply blasted through the floor with a Jet Spear and fell into the basement. Taken by surprise, Monet told him that unless he can fly, there was no way out of the basement."}, {"type": "paragraph", "text": "Soon afterwards, Monet suddenly appeared in the Biscuits Room, blocking the exit with a snow barrier which prevented Mocha from running out of the room with the candy. Monet then told Mocha not to keep the candy all to herself and that she should share the candy with the other children. While Usopp, Kin'emon, and Brook went to search for Seastone handcuffs and Momonosuke, Monet confronted Nami, Chopper, Robin, and Zoro. She then created a snowstorm to incapacitate Nami and Chopper and stabbed Robin to prevent her from stopping the berserk children. She then began fighting Zoro after he realized she was a Logia user."}, {"type": "paragraph", "text": "Monet tried to attack Robin, Nami, and Chopper when they attempted to go after the children, but Zoro quickly blocked her and Nami attacked with Heat Egg to repel her. Monet then dove into the snow and stopped Nami, Chopper, and Robin from leaving by creating a wall to block their path. An enraged Monet transformed into a demonic snow body and ensnared Nami and Chopper in her body while preparing to bite Chopper. Nami swiftly moved Chopper out of harm's way and Robin managed to shatter her. Zoro then cut down the snow barrier, allowing Nami, Chopper, and Robin to leave the Biscuits Room. After transforming back into her normal form, Monet continued her fight with Zoro, and she commented that Zoro was not attacking her at all during their fight before it was interrupted."}, {"type": "paragraph", "text": "Sanji, Tashigi, and the G-5 Marines suddenly arrived at the Biscuits Room while Monet and Zoro were dueling. The Marines complimented on Monet's beauty, causing her to blush, and hiding her blush with her wings while buckling her legs, despite the serious situation. After realizing that they were also attempting to get the children, Monet transformed into her demonic form again and attacked the Marines out of fury, biting off a Marine's shoulder. Tashigi then sliced her with a Haki-imbued attack, injuring her. She then declared that she would stay and fight Monet."}, {"type": "paragraph", "text": "While Tashigi and Zoro argued, Monet tried to use a sneak attack on Tashigi and got the upper hand due to her speed. After Tashigi easily dodged her \"Snow Rabbits\" attack using Soru, Monet opted to blind her with her blizzard and then sank her teeth into Tashigi's shoulder, trying to tear it off as she did to one of the Marines. However, Tashigi got a hold of her, making her unable to tear her shoulder off. As Monet started to bite harder on Tashigi's shoulder, Zoro cut her in the cheek, making her let go of Tashigi. She was surprised at first because she assumed Zoro would never attack women, but got outright frozen in fear as she saw the swordsman rushed towards her. Monet was then sliced vertically in half by Zoro."}, {"type": "paragraph", "text": "However, Zoro did not imbue Haki into his attack, allowing Monet to survive. Due to realizing what would have happened had he used Haki, she was left terrified to the point where she could hardly put her body back together. As Zoro walked away, Monet managed to partially reform and attempted to stab him in the back with her ice picks, but Tashigi quickly dealt the finishing blow. Monet then fell to the ground, defeated. When the poisonous gas started flowing into the Biscuits Room, Zoro and Tashigi fled and Monet was left behind."}, {"type": "paragraph", "text": "Regaining consciousness, she managed to escape to a different section of the facility. While amongst the crumbling rubble of the lab, she contacted Joker and apologized for her failure and came to the decision to set off the remaining weapon to destroy the entire island and kill everyone on it, a decision that Joker himself was planning to order Monet to do from the beginning. With a determined and obedient look, Monet bid her young master farewell as she prepared to hit the switch."}, {"type": "paragraph", "text": "Later on, Monet noticed an explosion which came from the SAD room. She prepared to sacrifice herself bidding farewell to Doflamingo saying he would become the Pirate King. However, before she could do anything, she was killed when Caesar stabbed her heart, believing it was Smoker's since Law covertly returned Monet's heart to Caesar instead of giving him Smoker's."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4c/Monet_Observing_the_Straw_Hats.png/revision/latest/scale-to-width-down/200?cb=20131010151101", "caption": "Monet observing the Straw Hats from a distance."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/73/Monet_Shows_Concern_Over_Law%27s_Condition.png/revision/latest/scale-to-width-down/210?cb=20141206075254", "caption": "Monet showing \"concern\" over Law's condition."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Monet_Blocks_Luffy.png/revision/latest/scale-to-width-down/200?cb=20141206191354", "caption": "Monet blocking Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f1/Monet_Hugs_Luffy.png/revision/latest/scale-to-width-down/200?cb=20130311215710", "caption": "Monet hugging Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d5/Monster_Monet_Attacks_Nami_and_Chopper.png/revision/latest/scale-to-width-down/210?cb=20141022213427", "caption": "Monet ensnaring Nami and Chopper with her demonic snow body."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Zoro_Slices_Monet_in_Half.png/revision/latest/scale-to-width-down/200?cb=20170922073903", "caption": "Zoro slices Monet in half."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/15/Tashigi_Defeats_Monet.png/revision/latest/scale-to-width-down/210?cb=20141022222621", "caption": "Monet is defeated by Tashigi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Caesar_Stabs_Monet%27s_Heart.png/revision/latest/scale-to-width-down/210?cb=20141206075456", "caption": "Caesar stabs Monet's heart."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Monet vs. Monkey D. Luffy", "elements": []}, {"text": "Monet vs. Roronoa Zoro, Nami, and Nico Robin", "elements": []}, {"text": "Monet vs. G-5 Marines", "elements": []}, {"text": "Monet vs. Roronoa Zoro and Tashigi", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The \"HAPPY\" on her shirt may be a play on her species, as \"happy\" (ハッピー, \"happy\") and \"harpy\" (ハーピー, \"harpy\") are near-homonyms with only slight differences in spelling and pronunciation in both English and Japanese.", "elements": []}, {"text": "Monet is the first canonical female Logia user.", "elements": [{"text": "The first female Logia user overall was Honey Queen, who appeared in Clockwork Island Adventure.", "elements": []}]}, {"text": "She is the first female character to die in the time of the current story and also the first female Logia to die in the story.", "elements": []}, {"text": "Her snow monster form, as well as her epithet, is based on a yuki-onna, a monster from Japanese folklore that was literally a snow woman who would bewitch men before freezing them to death. Likewise, her harpy appearance comes from Greek mythology for a half bird, half woman who was said to have abducted people.", "elements": []}, {"text": "Monet's favorite food is matcha green tea ice cream.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Harpy – Wikipedia article about the harpy.", "elements": []}, {"text": "Yuki-Onna – Wikipedia article about the yuki-onna, or snow woman.", "elements": []}]}], "images": []}]}