{"sections": [{"title": "Gina", "level": 1, "content": [{"type": "paragraph", "text": "Gina is the female carpenter of the Foxy Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gina is a normal sized, attractive woman with short, wavy red hair reaching down to her neck. She also wears the same mask as other Foxy Pirates and a dark colored shirt with straps over the shoulders and short short with a belt, and long gloves, like some of the other Foxy Pirates. She wears a string abound her forehead with a green jewel on it and two red bands with a heart on her forearms. She has a thigh holster with a hammer in it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fd/Gina_Full_Body.png/revision/latest?cb=20131122141420", "caption": "A full body view of Gina."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "It is unknown how loyal she is to Foxy or the Foxy Pirates, as she was most likely just won in a Davy Back Fight."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "In the anime filler, Gina's personality is revealed to be conniving and flirtatious, since she enticed Sanji during the Hit and Deadball game."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "She was a shipwright on the Foxy Pirates, and she is presumably good at building and fixing things."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "At some point in her life, she either joined, or was won in a Davy Back Fight by the Foxy Pirates. She acted as one of the many shipwrights on the crew. After Luffy defeated Foxy, Gina was one of the three shipwrights, along with Donovan and Sonieh, introduced as potential crewmembers for the Straw Hat Pirates to choose. Sanji asked if Luffy could take her as the prize, but Luffy ended up taking the crew's flag instead."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Gina appears during the Davy Back Fight filler game Hit and Deadball, distracting Sanji with Porche and other girls. As Sanji is partaking in the match, the girls call him over and ask for the ball. He gives it to them and they knock him out of the game. Despite this, the Straw Hat Pirates still won the match. Foxy also disguised himself as her at one point during the Foxy's Return filler arc."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 318 and Episode 215, Gina is introduced.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 34 Chapter 318, Gina is proposed as a potential shipwright for the Straw Hat Pirates.", "elements": []}, {"text": "↑  One Piece Anime — Episode 215, Gina and the other female Foxy Pirates distract Sanji.", "elements": []}, {"text": "↑  One Piece Anime — Episode 225.", "elements": []}]}], "images": []}]}