{"sections": [{"title": "Caesar Clown", "level": 1, "content": [{"type": "paragraph", "text": "Caesar Clown, who was referred to as \"Master\" by his subordinates, is a scientist, a former colleague of Vegapunk, the primary antagonist of the Punk Hazard Arc, and the first main antagonist the Straw Hats face in the New World. He is the leading expert on chemical weapons of mass destruction and has a bounty of 300,000,000 on his head."}, {"type": "paragraph", "text": "During the Dressrosa Arc, Donquixote Doflamingo declared Caesar to be his direct subordinate, and thus protected from the law. Upon Doflamingo's defeat and arrest, this protection was lost, and Caesar's criminal status was once again operational in full. After a period as a hostage of the Straw Hat-Heart Pirate Alliance, he fell into the custody of Big Mom after Capone Bege retrieved and escorted both him and Sanji to Whole Cake Island. He was later liberated by the Fire Tank Pirates and took part in the assassination attempt against Big Mom. Following the plan's failure and disbandment of the alliance, he was finally given back his heart and parted ways with his former captors."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Caesar has a very gaseous look due to his Devil Fruit ability. He has very long, spiky, black hair, brown eyes (yellow in the anime), and two curly horns growing from the back of his head. He is rather tall (shown to be about the same height as Brook when standing next to him with his gas powers deactivated), and wears purple lipstick and dark makeup on his eyes. He has a small flat nose and long thin eyebrows. His arms are very thin in comparison with to rest of his body."}, {"type": "paragraph", "text": "Caesar wears a big light blue colored coat with \"GAS\" printed in pink on each side (in his first appearances this was not present). Under his coat, he wears a pair of diagonally striped yellow overalls which are striped cross with orange lines. The overall is cut off right under his knees, exposing his hairy legs. He also wears dark purple gloves with the initials \"CC\" in white on them. Due to his constant gaseous form, he seems to not use shoes, remaining barefoot, though only when his powers were disabled, his feet solidified with the rest of his body along with a simple pair of shoes."}, {"type": "paragraph", "text": "Four years before his debut, Caesar had shorter hair that was more rounded, and wore a polka dot patterned shirt beneath his coat."}, {"type": "paragraph", "text": "During his third fight with Luffy, Luffy greatly damaged Caesar's face, which knocked some of his teeth out and bent his facial structure inwards, and seemingly breaking his nose. As result, his pronunciation became a bit hard to understand."}, {"type": "paragraph", "text": "After absorbing the Shinokuni, Caesar's entire body structure changed to a darker gas color matching that of the gas, becoming as comparably large as a giant, with his hair growing completely wild and overly long. He also grows a coral-shaped crown behind his horns. The word in kanji \"Land of Death\" (死国, \"Land of Death\") is written on the front of his chest. Upon his defeat, he returns to normal."}, {"type": "paragraph", "text": "When under the service of Capone Bege, he disguised himself by wearing a blue shirt with an aqua scarf and suspenders while donning a spiky hairstyle that covered his horns. While part of the Sanji Retrieval Team-Fire Tank Pirates Alliance, he wore a yellow suit."}, {"type": "paragraph", "text": "In the anime, Caesar's skin tone is shown to be a pale white, while in the manga it is shown as a more natural tone."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Caesar is, in Smoker's words, \"one very crazy bastard\", and his actions on Punk Hazard validate the Marine vice-admiral's claim. A very cruel, arrogant, scheming, sinister, and overall very evil person, Caesar takes great delight in causing harm and destruction to anything and anybody around him. His psychopathic nature is displayed many times, such as when he set off a chemical weapon on Punk Hazard, killing or crippling most of its inhabitants and destroying its environment, selling or creating weapons of mass destruction for similarly unscrupulous individuals such as Doflamingo, performing sick experiments on children and drugging them with a lethal, addictive drug to ensure that they do not run away, and trying to murder everyone on Punk Hazard (Trafalgar Law, the Straw Hats, Smoker's Marines, the children, and his own blindly following minions) so he could test out his new poisonous gas weapon-pet, Smiley—all of which he does without a shred of remorse or empathy for his potential victims."}, {"type": "paragraph", "text": "He also demonstrates tendencies of egomania when Luffy mentioned his Gasu Gasu no Mi had no effect on his immune system due to Magellan's Doku Doku no Mi, both being poisonous Devil Fruits of differentiating class, causing Caesar to become rapidly aggravated from the fact that Luffy compared his Logia powers to that of a \"mere\" Paramecia user. He was very surprised that his poisons did not affect Luffy due to the latter's immunity to poison given to him from his near-death poisoning by Magellan. Caesar takes utmost pride in the biological weapons he created. Proud of the unexpected power of his Koro gas weapon, he was rather unhappy when the Straw Hat Pirates forced him to counter it to save the poisoned Mink Tribe. He was extremely excited when the Fire Tank Pirates used his KX Launchers in their attempt to assassinate Big Mom and was frustrated when the Yonko easily destroyed his weapons simply by screaming."}, {"type": "paragraph", "text": "He has shown to have maniacal tendencies due to his sedulous research on weapons of mass destruction and his absence of emotion at the time of murdering people or provoking any type of suffering such as giving drugs to the children so they would suffer severe withdrawal and return to his research facility for more \"candies\" filled with the stimulant, and showing no regret or sorrow for his actions."}, {"type": "paragraph", "text": "He is also very sadistic, as he exploited the blind trust of his wounded subordinates to test a newly developed gas and ordered the Yeti Cool Brothers to assassinate Brownbeard when he thought he was no use to him anymore: he further provoked a partially-paralyzed Brownbeard by revealing the truth about the gas explosion four years ago, in order to create an opportunity to have his subordinates shoot him down. He also used the restricted drug NHC10 to maintain his control of the children he kidnapped, knowing that they will be unable to escape due to the agonizing withdrawal symptoms, and that by his own calculations, they will die in five years after he started his experiments with them, which he deems a necessary sacrifice for his science. Law found this aspect of Caesar disgusting. Caesar also seems to enjoy cocktails, as he is often seen holding a cocktail glass."}, {"type": "paragraph", "text": "He appears to have a grudge against Vegapunk, as well as a cautious disposition, as shown when he hid from the Marines instead of trying to engage them immediately, as well as trusting Monet's deduction that the Straw Hats might be more powerful than their bounties claim, and waiting for Joker's approval to make his actions look like accidents, before starting attacks. Caesar is also a rather economizing person, as he did not want to waste the poison by clearing it off, but rather, collected, saved and compressed it into Smiley."}, {"type": "paragraph", "text": "He also appears to be able to act or lie on several occasions, often being seen feigning emotions when lying to his subordinates and to the children, a trait that was quickly noted by Monet when he attempted to show false concern for his subordinates facing Smiley. However, with the blind trust of his subordinates and some crocodile tears, he was able to deceive them easily, leading them to believe that Vegapunk was responsible for the Punk Hazard explosion four years ago. Caesar also is very ill-tempered and quick to anger when things do not go his way, such as yelling at his subordinates to let the gas come in to kill the intruders and his own men and again when Monet pointed out that Vergo would die and Caesar just yelled, unconcerned about his potential disloyalty. Upon losing the upper hand against Luffy during their last fight, Caesar lost his composure and ordered his subordinates to let in the Shinokuni gas, while outwardly exclaiming that they can easily be replaced. He then goes as far as personally killing the ones present simply to test out his newly acquired power, revealing his true colors in the process."}, {"type": "paragraph", "text": "He is a very prideful person, going as far to say that his work four years ago on the weapon that caused the Punk Hazard incident was not a failure, but instead was a great success, implying a superiority complex. Due to his pride in his own work, he tends to blush when his work is praised, even by the enemy, but turned to indignity when that praise turned towards Vegapunk. He was also shocked to see Smiley not listening to him and eat the candy despite Caesar saying to wait and Caesar said it was alright while Monet noted he was not listening to him. Despite his pride, Caesar is capable of knowing when a task is beyond his capabilities, as when Big Mom commissioned him to turn her family into giants, Caesar knew that the task was impossible despite his own view of himself. He also does not take kindly to insults, as when Law called him stupid, Caesar lashes out by punching Law's heart. Similarly, when Bege called him an idiot, Caesar angrily corrected Bege by saying he is a genius. Unlike most Logia users, Caesar keeps his Devil Fruit ability activated all the time and is either completely or partly turned into gas."}, {"type": "paragraph", "text": "Caesar has an odd habit of being easily shocked by things that leave him dumbfounded, often doing a comical face-fault, such as when Luffy survived his second Gastanet attack and appeared behind him unharmed. He did so again when Luffy was about to attack him from behind in their second fight together, which seems to be a running gag on his part. Upon Luffy declaring that he does not want to see Caesar's face anymore out of anger, the scientist cried in fear right before he was sent flying by Luffy's Gear Third attack."}, {"type": "paragraph", "text": "Caesar is also very cowardly when his life is threatened in any way. When he was about to lose to Luffy he attempted to beg the Straw Hat captain to spare him and even make him his subordinate. He also repeatedly begged Doflamingo to save him and even later begged the Straw Hats to protect him from Big Mom on more than one occasion."}, {"type": "paragraph", "text": "While Caesar does at least attempt to fulfill commissions made by other people, he is not averse to giving up on them and will abuse his money and privileges on a hedonistic lifestyle of women and alcohol instead, especially if the projects given to him are proven to be too difficult, if not impossible, to accomplish (i.e. gigantification). He would even continue to lie to his investor in order to embezzle more money for such purposes. When he was under Doflamingo's protection, Caesar did not care about what he did to other people because he viewed himself as safe from them, even from that of a Yonko. Upon losing Doflamingo to the Marines, however, Caesar came to fear the consequences, especially since one of his clienteles is none other than Charlotte Linlin, one of the Yonko, and he became desperate with lies and thoughts of escaping, even admitting (to himself) that the given project was outright beyond his own limits (which he normally was so arrogant about)."}, {"type": "paragraph", "text": "However, Caesar's prideful and arrogant attitude can at the very least be scratched, as he started crying in anger when Nami and Chopper referred to him as \"human scum\" and \"the worst\" during the operation to ruin Big Mom's Tea Party."}, {"type": "paragraph", "text": "He has a distinct laugh of \"Shurororororo\" (Shuhohoho in Viz media translation)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Caesar_Clown_Blushes.png/revision/latest/scale-to-width-down/180?cb=20141206073542", "caption": "Caesar blushes after Chopper praises his creation of SAD."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/Caesar_Clown%27s_Fault_Face.png/revision/latest/scale-to-width-down/210?cb=20131016013729", "caption": "One of Caesar's many face faults."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Caesar%27s_Frivolity.png/revision/latest/scale-to-width-down/210?cb=20170702021541", "caption": "Caesar puts his own pleasure ahead of helping others."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Monet", "level": 4, "content": [{"type": "paragraph", "text": "Since Monet and Caesar work under the same leader, she is very close to Caesar and is not ignorant of Caesar's true nature."}, {"type": "paragraph", "text": "However, it is revealed that Vergo assigned Monet to infiltrate Caesar Clown's organization on Punk Hazard, due to a mistrust for the deranged scientist. Despite this, Monet agreed to give her heart to Law when Caesar ordered her to in exchange for Law's heart. Monet does take her assignment in protecting Caesar and his test subjects very seriously as she kept Luffy from capturing Caesar and hindered the Straw Hats and the G-5 Marines from taking the kidnapped children away."}, {"type": "paragraph", "text": "Unknowingly, Caesar is responsible for killing Monet due to him stabbing her heart where he believed he stabbed Smoker's."}], "images": []}, {"title": "Vergo", "level": 4, "content": [{"type": "paragraph", "text": "Caesar also has an association with Vergo due to the latter being a subordinate of Joker. Vergo and Joker's distrust towards Caesar led them to place Monet in Caesar’s organization to monitor his actions."}, {"type": "paragraph", "text": "In return, Caesar seems to place some trust in Vergo as demonstrated by him giving the Marine Law's heart, who was later able to use it to incapacitate Law when the Shichibukai had begun to move against them, showing that despite the lack of trust on Vergo's behalf between them, Caesar is still willing to cooperate with him. Caesar values him as a strong shield, as Vergo is responsible for providing him with test subjects and kidnapping the children for Caesar to experiment on."}, {"type": "paragraph", "text": "However, Caesar has no regard about Vergo, as when Caesar is about to eradicate the G-5 Marines together with Vergo, he said he does not care about Vergo, while calling him an idiot when Caesar was warned by Monet."}], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Caesar is an associate of Donquixote Doflamingo, who operates under the alias, \"Joker\". Caesar respected his authority as he had to ask him for permission to exterminate the Straw Hat Pirates and G-5 Marines."}, {"type": "paragraph", "text": "In turn, Doflamingo does not trust Caesar and orders Vergo to place Monet as a deep cover agent to observe his activities. Despite this, Doflamingo still valued Caesar for being the only scientist able to produce SAD, which would allow the former Shichibukai to create the Smiles in collaboration with the Yonko, Kaido. For this, Doflamingo threatened Monet with death if she let anything happen to Caesar, and made it priority to retrieve Caesar upon his defeat."}, {"type": "paragraph", "text": "Though Caesar is unaware of Doflamingo's distrust of him, he knows his own value for the former Shichibukai, which makes him delude himself into thinking that the protection granted to him makes him untouchable. To this end, Caesar spoke highly about Doflamingo, using his name and infamy and labeling him the most dangerous of the Shichibukai in an attempt to scare Luffy from hurting him, all of which ended in failure as the young pirate brutally defeated the scientist. Because Doflamingo does consider Caesar a valuable asset, he claimed to accept Law's demands to publicly resigned from the Shichibukai in order to ensure no harm comes to Caesar. In turn, Caesar was extremely grateful and even apologized to Doflamingo for supposedly being forced to resign from the Shichibukai."}, {"type": "paragraph", "text": "Upon revealing that Doflamingo has falsified his resignation, Law tried to stop Caesar from being returned, but Doflamingo immediately declared the rogue scientist as his subordinate, thus turning him into a member of the Donquixote Pirates and releasing him from his status as a wanted criminal. Unfortunately for them, when Doflamingo was defeated by Luffy and arrested by Admiral Issho for crimes that could not be ignored, Caesar lost not just his primary source to convert SAD to SMILE, but his diplomatic immunity was also void, rendering him a criminal once again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Caesar_Speaking_Highly_of_Doflamingo.png/revision/latest/scale-to-width-down/210?cb=20130311231602", "caption": "Caesar speaking highly of Doflamingo."}]}, {"title": "Baby 5 and Buffalo", "level": 4, "content": [{"type": "paragraph", "text": "Caesar knows Baby 5 and Buffalo, and seems to have enough faith in them, believing himself to be saved the moment he saw them battling in the air. Baby 5 seems to know a few things about Caesar's research, as she knows that Caesar is not interested in human weapons. Despite his confidence in them he decides to abandon them to return to Dressrosa alone after they are defeated, while deriding Buffalo for being unable to protect him."}], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "Caesar is responsible for the business Doflamingo has with Yonko Kaido. It is due to Caesar's ability to create SMILES that Kaido is able to make a Devil Fruit army of over 500 Zoan users. Caesar is aware of his importance in Kaido's Zoan army, knowing he is the only one to use the SAD substance and that Kaido will be very angry should anything happen to his SMILE production being halted. It is this very reason that Doflamingo places Caesar to the highest value."}], "images": []}, {"title": "Smiley", "level": 4, "content": [{"type": "paragraph", "text": "Smiley is Caesar's pet. Caesar treats Smiley like a pet and seems to be emotionally attached to it. Caesar told Smiley that he missed it and even started to tear up while talking to him and wanted to tell him many things, even though it does not appear to be capable of understanding it. He apparently does not consider the Smilies to be the real Smiley as he showed little reaction when they appeared during his battle with Luffy. It also seems like he only considers the sentience of the Sara Sara no Mi, Model: Axolotl to be his pet, as he had no problem to destroy Smiley's \"body\" and told him that they will meet again."}, {"type": "paragraph", "text": "While around other people, he talks about Smiley rather professionally, referring to him as a weapon."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Vegapunk", "level": 4, "content": [{"type": "paragraph", "text": "It is stated by Smoker that Caesar was Vegapunk's former colleague and used to have a rivalry with him but Caesar was always considered second best, which might be the main reason for his holding a grudge against him. As all of Caesar's research and inventions include inhumane motives and illegal procedures, Vegapunk eventually dismissed him, which led Caesar to hate Vegapunk even more. Despite this, he showed interest in acquiring Vegapunk's laser system, to the point of wanting to capture Franky for that sole purpose. His production of SAD is also a practical application on the \"lineage factor\" Vegapunk devised. He also did not enjoy it when Chopper turned his praise of him to Vegapunk."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8b/Vegapunk_Dismisses_Caesar.png/revision/latest/scale-to-width-down/210?cb=20170309171245", "caption": "Vegapunk tells Caesar that he is dismissed."}]}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "Caesar has a deep grudge against the Marines. Even though he was arrested and imprisoned, he managed to escape. He also carries a bounty. When Caesar is informed about the G-5 Marines' arrival, he appears to be quite angered and he smiles out of joy when Law gives him Smoker's heart. Later, he also mentions that he has a machination which involves Smoker and his G-5 subordinates. During his tenure under the organization's employment, Caesar's inhumane experiments already aroused much resentment from his colleagues, while Caesar claimed Sengoku was too soft for fearing his weapons of mass destruction, but believed Sakazuki would desire them."}, {"type": "paragraph", "text": "Upon realizing that Caesar is working directly under Doflamingo, a Shichibukai, Admiral Issho pardoned all of Caesar's crimes, therefore they can no longer arrest him. However, with Doflamingo's defeat and arrest, he has lost his protection and is a wanted criminal once more."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After the Straw Hat Pirates stumbled upon Punk Hazard, Caesar wanted them eliminated at all costs as evident when he sent the Yeti Cool Brothers after them. Franky once struck Caesar's interest, as he wanted the laser system installed in the cyborg's body. After the Straw Hats learned of the sinister experiments that Caesar has been doing, they aimed to capture him with Law's assistance. Luffy and Chopper have gained a deep hatred towards Caesar's cruel treatment towards the children and his men and Chopper dismissed him as a scientist. Despite this, Chopper did heal Caesar's wounds and prohibited Sanji from hurting him further (though Chopper stated he was free to kick him after he was done healing him)."}, {"type": "paragraph", "text": "The Straw Hats protected him from the Big Mom Pirates due to him being a key instrument in Doflamingo's defeat, but after Doflamingo was defeated, Sanji had no problems with turning the scientist over after finding out what he did to Big Mom. Sanji and Chopper got very angry at Caesar when he revealed that his weapon destroyed Zou. Sanji has frequently ordered Caesar to assist them in various things, threatening to destroy the scientist's heart if he does not comply. Caesar frequently threatens them with retribution, but knows he is at their mercy as long as they possess his heart. He was very angry when Sanji held him hostage to prevent Bege from going after his friends. Caesar was frustrated when Sanji nonchalantly gave his heart to the Fire Tank Pirates. When Caesar was forced into Bege's service, he met with the Straw Hats again and Luffy immediately recognize him (through his disguise) and was angry at seeing Caesar once more. In return, Caesar got angry with Luffy for all the suffering he's been through and they nearly came to blows but stopped after it was pointed out that they share a common enemy, forcing them to put aside their differences."}, {"type": "paragraph", "text": "After escaping the Whole Cake Chateau, Caesar immediately left them when he was given his heart back, happy to finally get away from them."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "While they were partners, the two of them do not appear to be very open with each other. Caesar has always been cautious towards Law. When Law asked Caesar to allow him to stay on Punk Hazard, Caesar only agreed if Law weakened himself by giving him his heart. After learning about his association with Luffy, Caesar quickly thought Law betrayed him by calling the Straw Hats. He wanted to shoot Law at first, but then decided that Law probably was not responsible for the Straw Hats appearing on the island. He also seems to be unnerved by Law as he was trembling when he pointed a gun at him."}, {"type": "paragraph", "text": "Law, on the other hand, finds some of Caesar's methods to be disgusting, especially his deeds to the children that he kidnapped. Law later betrays Caesar by plotting to capture him with the Straw Hats. Caesar seems to be partially aware of this as he mentions that the Yeti Cool Brothers failed due to Luffy's and Law's strength."}, {"type": "paragraph", "text": "After Law's capture by Vergo, Caesar expressed his disappointment, stating that he was hoping that he and Law would become great friends, before he found out about his betrayal. After his capture, Caesar then mocked Law over his plan to take out the Smile production factory at Dressrosa, calling him and the Straw Hats idiots for opposing Doflamingo."}, {"type": "paragraph", "text": "While being used by the Fire Tank Pirates, Caesar states that he will kill Law if given the chance."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Caesar was asked to do some research on gigantification for Big Mom in the past. However, due to the limitations and complexity of the process Caesar could not create any desirable results, but took payment from her anyways. He repeatedly asked her for more money under the guise of needing extra funding for progress, only to spend the excess on fine alcohol and women. He was originally flippant about it due to being under Doflamingo's protection, but fears retribution from the Yonko after being captured. Due to his fears towards Big Mom and not wanting to suffer her wrath, Caesar begged the Straw Hats not to let her crew capture him. Upon capture, Caesar lied to Big Mom that Luffy and Law's attack on Punk Hazard wrecked his hard-achieved results and the proper facility to reproduce everything, only to be terrified to know that Big Mom has built an exact replica of the lab for him to recreate everything, and given him a fortnight to bring out the nonexistence fruits of his so-called success. Caesar's extreme fear combined with a strong dislike of Big Mom was enough for him to temporarily let go of his grudge against Luffy and Bege if their alliance meant taking her down. When Bege and his crewmates fired the KX Launchers at Big Mom, Caesar showed great excitement, but when the KX Launcher was destroyed, Caesar lamented the plot's failure while cursing Big Mom."}], "images": []}, {"title": "Big Mom Pirates", "level": 4, "content": [{"type": "paragraph", "text": "When the Curly Hat group onboard the Thousand Sunny encountered the Big Mom Pirates (who were intent on taking out the Sunny's group and capturing Caesar) near Dressrosa, Caesar became terrified to see them and even begged the Straw Hats to protect him from them."}, {"type": "paragraph", "text": "On Zou, Caesar was very afraid of Bege and Pekoms since they both serve Big Mom, who he was trying to evade. When Caesar was captured by Bege and his crew, he was worried he would die if he was turned over to Big Mom, and even more so after Sanji told Bege to take him and leave."}, {"type": "paragraph", "text": "Caesar was later forced to work in the lab on Whole Cake Island as Charlotte Perospero tormented him by squeezing his heart and threatened to turn him into candy if he failed to complete his research on Gigantification."}, {"type": "paragraph", "text": "After being recruited by Bege, Caesar participated in the alliance's plan to assassinate Big Mom and provided Bege the weapons that he would use in the operation. After retreating into Bege's fortress, the Big Mom Pirates surrounded Caesar and his allies with some promising to ensure that he does not leave the island alive. When Bege returned to normal, the Big Mom Pirates opened fire on him as Caesar carried him away to safety, but Brûlée stood in his way. However, he was able to escape due to the collapse of the Whole Cake Chateau."}], "images": []}, {"title": "Capone Bege", "level": 4, "content": [{"type": "paragraph", "text": "On Zou, Caesar was very afraid of Bege and Pekoms since they both serve Big Mom, who he was trying to evade. When Bege threatened to shoot Caesar down, the latter immediately surrendered and was enraged to find out Bege was bluffing before he was captured by Bege and his crew. As he sat, he was worried he would die if he was turned over to Big Mom, and even more so after Sanji told him to take him and leave. He was later forced into serving Bege's crew when the latter came into possession of his heart. Although Caesar made his dislike of the arrangement clear, he is forced to cooperate with him as the latter plans to take down Big Mom. During the meeting with the Straw Hats, Caesar was quick to remind Bege to release his heart and allow him to go free when his plan to kill Big Mom succeeds or else he'd kill Bege's son."}, {"type": "paragraph", "text": "At the wedding ceremony, Bege threatened to crush Caesar's heart if he attempted to betray him, showing his mistrust in the latter. Caesar assured him that he wouldn't betray him since he has his heart. After the assassination attempt on Big Mom failed, Bege used Caesar as a means to escape, despite the latter's protests. After successfully escaping the Whole Cake Chateau, Bege gave Caesar his heart back and set him free."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Former Subordinates", "level": 4, "content": [{"type": "paragraph", "text": "Brownbeard and the other centaurs once thought of him as a kindhearted savior and trusted him blindly. Brownbeard was extremely grateful to Caesar for taking him in after he lost the use of his legs. He compared Vegapunk to the Devil and Caesar to God and believed that Caesar continues his research for the good of humankind."}, {"type": "paragraph", "text": "However, Caesar does not care about his subordinates, as he exploited their blind trust to test a new gas on some of his subordinates. After Brownbeard was captured by the Straw Hats, Caesar deemed him a useless idiot and ordered him to be killed. After Scotch played a recording of Caesar's orders, Brownbeard was crushed when he learned that the man he believed in so much had betrayed him. Before Scotch shot him, Brownbeard's last thought was when Caesar once called him a good leader, and upon reawakening, Brownbeard attempted revenge against Caesar in order to rescue his crew; Caesar, in turn, sadistically insulted Brownbeard, and secretly revealed to him the truth of the chemical weapon incident four years ago, which led Brownbeard to see Caesar as the devil. Even when his subordinates offered to help him during his battle against Luffy, Caesar refused while calling them small-fries."}, {"type": "paragraph", "text": "His cruelty goes as far as to telling his subordinates to take off their protective suits under the lie that it would not protect them from the H2S gas released by Smiley and that it would only weigh them down, in order to fully expose them to the lethal poison as a worldwide demonstration, while secretly sabotaging their escape sled. Upon losing to Luffy and getting desperate, Caesar forgoes all lies and manipulation, and outright ordered his subordinates to release the Shinokuni gas into the building while expressing that they are trash that are easily replaceable; though shocked at first, the subordinates swiftly deluded themselves into thinking that Caesar was putting up a ruse to get at Luffy, and did as ordered, only to see, to their horror, Caesar would turn his gas weapon on them as a testament of his new powers."}, {"type": "paragraph", "text": "Caesar seems to recognize the Yeti Cool Brothers’ strength as he ordered them to eliminate the Straw Hats. The Yeti Cool Brothers were loyal to Caesar, as they followed his orders without question. Despite their value, Caesar was not too upset about their defeat and even excused their failure by saying that fighting against Law and Luffy was too much."}], "images": []}, {"title": "Kidnapped Children", "level": 4, "content": [{"type": "paragraph", "text": "Caesar has several kidnapped children he had sent to Punk Hazard via Vergo and manipulates them all into thinking he's experimenting on them to save the world and how he \"lost\" a son of his to convince them. The children all have a high respect for Caesar and decided to stay for his work."}, {"type": "paragraph", "text": "However, in truth, Caesar is using them as guinea pigs and has no remorse in them going to die within five years, stating it is a necessary sacrifice for humankind. Mocha was distraught from when Chopper told her of his betrayal and how he was never planning to let her or the others go home and Momonosuke (who was too proud to accept Caesar's feigned hospitality to begin with) became enraged at the scientist for using the children's feelings against them."}], "images": []}, {"title": "Vinsmoke Judge", "level": 4, "content": [{"type": "paragraph", "text": "Caesar is familiar with Judge and in his past experienced Judge's, as Caesar called it, overbearing attitude."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Caesar has authority over all the former test subjects on the island as he saved them from the gas, and he uses their blind-trust to manipulate them. However, after Caesar revealed that he does not care about his subordinates, he lost their faith."}, {"type": "paragraph", "text": "Caesar is also shown to be highly crafty and cunning, easily facilitating an escape from a Marine battleship escort after he was arrested and then returning to Punk Hazard, as well as ensuring that his affiliate Trafalgar Law would not renege on their partnership by having him use his own \"Ope Ope no Mi\" to remove his heart and place it in Caesar's safekeeping in exchange for allowing him to stay on Punk Hazard (while also demonstrating an act of goodwill by allowing Law to take the heart of Caesar's secretary Monet himself). This reveals the level of caution Caesar has around other individuals of comparable or greater power than himself. He is also very aware of the consequences of murdering Vice-Admiral Smoker and his G-5 Marines on site. He also was able to escape when he was captured and kept himself hidden for a long while. He also purposely enraged a partially paralyzed Brownbeard in order to prevent the subordinates present from suspecting him, and have them shoot down Brownbeard without being the wiser."}, {"type": "paragraph", "text": "Despite Caesar's cowardly behavior, he has a strong will being able to withstand a burst of Big Mom's Haoshoku Haki."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "In direct combat, Caesar has also proven to be a fairly powerful fighter, using his Devil Fruit abilities to quickly maneuver out of dangerous situations and being durable enough to take several Haki-imbued Gear Second strikes from Luffy, only to emerge relatively unharmed. His durability extends to being seemingly unfazed by either the boiling hot or the sub-zero temperatures which compose the \"Burning Lands\" and the \"Ice Lands\" zones on Punk Hazard respectively. He withstood a blow from Luffy that left a big dent in his face and still retained consciousness. He is also very stealthy, being able to administer a muscle relaxant to Brownbeard without the latter noticing. Caesar is also physically strong, able to easily carry around a large and tall mirror which the Straw Hats and the Fire Tank Pirates would use to escape. Caesar also assured his confidence in carrying Brûlée, who is a very tall woman while bringing along the mirror."}], "images": []}, {"title": "Scientific Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Caesar has immense scientific and chemical expertise, as he was Vegapunk's second-in-command and particularly specialize in creating dangerous biological and chemical weapons that the Marine's Science Division including Vegapunk greatly feared. Caesar was able to cause a chemical weapon explosion from one of his experimental weapons that rendered Punk Hazard a barren wasteland. He was able to turn normal humans into giants, a feat that even Vegapunk could not accomplish, though Caesar has resorted to illegal and inhumane methods that Vegapunk considers unacceptable (by forcing vast amounts of dangerous drugs down their systems), and the fact that the children used would expire within five years from the continuous experiments, which led the Marines to refuse to acknowledge him to be superior to the head scientist. He also uses the highly restricted drug NHC10, though his authorization on its usage is illegal, as he is a criminal, and he used it as for its addictive means instead of medicinal purposes. He is also in the possession of another unnamed drug, that relaxes muscles and makes it unable for the person, who the drug has been injected into, to talk or stand. All this earned him recognition as the world's leading expert on mass murdering weapons for biological warfare. His expertise in creating and designing weapons for biological warfare is so great that Capone Bege recruited him in his plot to assassinate Big Mom. Caesar was able to create the KX Launcher, a weapon with poison strong enough that could potentially kill a Yonko, and managed to prepare three for the Fire Tank Pirates to use within a fairly short period of time."}, {"type": "paragraph", "text": "Derived from his scientific expertise, he invented massively destructive weapons, the most prominent one being a pet slime named Smiley, a mountain-sized lump monster that constantly emits some kind of smoke or vapor and has been \"fed\" the Sara Sara no Mi, Model: Axolotl (which gave the once inanimate lump life and form), which Caesar would unleash when trespassers become too much of a threat. He can control Smiley by using verbal commands, demonstrated when he ordered the Smilies to attach themselves to Luffy, and they obeyed."}, {"type": "paragraph", "text": "Caesar is also the only person who knows how to produce a substance called SAD, a rare and valuable substance that is an essential ingredient for the creation of Artificial Zoan Devil Fruits called SMILE, another feat that Vegapunk has failed in. Because of this, Doflamingo values Caesar's work greatly, as he apparently employs the scientist's expertise to cater the military expansion demands of one of the Yonko. However, his SMILE Artificial Devil Fruits are extremely unstable as they only have a ten percent chance of success in granting Zoan Devil Fruit enhancements while most people who consume the SMILE will not receive a power, and on top of losing the ability to swim, they become unable to express negative emotions and they are forced to smile and laugh all of the time."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Caesar has eaten the Gasu Gasu no Mi, a Logia-type Devil Fruit that grants him the ability to change into a vaporous form, allowing him to float and go inside places that no normal solid being can. He was seen demonstrating this ability when hiding inside some beakers when he was informed that the Marines were nearby. Even in his intangible gaseous form, he can become dense enough to hold objects, like his cocktail glass. It is unknown if this is because he can control the density of his gaseous form. He seems to prefer keeping his Devil Fruit ability active, as he is always either completely or partly gaseous. Caesar can absorb other gases, and he merged completely with the Shinokuni gas to greatly enhance his size and powers, while gaining Shinokuni's petrification properties, able to petrify anyone he touches"}, {"type": "paragraph", "text": "He can generate a destructive gas beam that can incinerate metal and even the fearsome Fighting Fish while on the way to Green Bit. Caesar stated that he has done numerous experiments on his power, thus granting his gases poisonous and explosive qualities. He can also remove oxygen in a certain area around himself to nullify fire-based attacks or asphyxiate his opponents."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/66/Caesar%27s_Gas_Form.png/revision/latest/scale-to-width-down/200?cb=20141206065408", "caption": "Caesar's gas form."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was seen using a dual-barreled flintlock to threaten Law when he learned of his past associations with Luffy. He was also shown using various weapons in conjunction with his Devil Fruit abilities; like explosive red and blue castanets filled with volatile gas called \"Gastanets\" which he claps together to create a massive explosion, using matches to ignite a gas he calls \"Miok Gas\" to cause an explosion in the immediate area, and a sword hilt, bearing some similarity to a Bunsen burner, that he concentrates oxygen in to use a technique called \"Blue Sword\". He also used a syringe to inject a muscle relaxant into Brownbeard stealthily to prevent his subordinates' trust from being compromised. In One Piece: Pirate Warriors 3, he throws out large pieces of candy that cause random status effects on enemies during one of his combos."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Chemical Weapon Incident on Punk Hazard", "level": 4, "content": [{"type": "paragraph", "text": "Caesar worked alongside Vegapunk on Punk Hazard, testing weapons and drugs on prisoners that were brought to the island as test subjects, and the two of them were bitter rivals. Caesar worked on developing a powerful mass murder gas weapon, but four years ago was ordered to cease his work due to a weapon of that nature being illegal. He refused, and when Vegapunk removed him from his team as a result, Caesar ended up setting off the weapon. This caused an explosion that demolished two of the laboratories and covered the entire island in poisonous gas, forcing the scientists to evacuate and seal off the island, abandoning the prisoners inside it. Caesar was caught and arrested, but escaped from the prison ship, never to be seen by the World Government again."}], "images": []}, {"title": "Caesar's Return to Punk Hazard", "level": 4, "content": [{"type": "paragraph", "text": "A year after the incident, Caesar Clown returned to the island and used his Devil Fruit ability to purify the gas (though unbeknownst to most, he compressed the gas into a sentient weapon). He also created rudimentary artificial prostheses for those who could not walk and accepted them as his subordinates. All of the prisoners that Caesar 'rescued' were unaware that he was the one truly responsible for the incident on the island, which he deemed a resounding success, and came to follow him blindly. Brownbeard arrived on the island a year after Caesar did. There was still poisonous gas, which made him incredibly sick. Just before giving up on life, Caesar and his subordinates appeared and saved him."}, {"type": "paragraph", "text": "While working on Punk Hazard, Caesar experimented on kidnapped children with plans on turning them into giant soldiers. He told the children that they are ill and that their disease can infect their parents if they do not let Caesar treat it. Afterwards he also told the children, while in tears, that he had a son once, who died from the same disease, which is the reason why he wants to cure it to successfully earn their trust. He also collaborated with the Donquixote Pirates and Kaido of the Yonko to produce SAD, a substance used to create specialized artificial Devil Fruits, which the mighty pirates used to create an army of artificial Zoan-class Devil Fruit users.Charlotte Linlin, another Yonko, commissioned him for research on gigantification so she could turn her family into giants. Although it ended fruitless, since he only focused on taking advantage of the children's growth period and cannot eliminate the lethal side-effects, Caesar gave false reports to Big Mom in order to embezzled the payment from her to fund his own research, each time saying he just needed more money to reach the breakthrough, and instead spending the excess on the finest alcohol and flirting with beautiful women. While he thought Doflamingo would be a buffer in protecting him, he continued to embezzle money from the Yonko, lying to her each time she asked him on the progress and results."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cb/Caesar_Clown_Return.png/revision/latest/scale-to-width-down/210?cb=20141206065551", "caption": "Caesar Clown \"helping\" the former prisoners."}]}, {"title": "Law's Arrival", "level": 4, "content": [{"type": "paragraph", "text": "When Trafalgar Law came to the island, Caesar formed an alliance with him. He and Caesar had a conversation within the facility with Law stating that he wanted to stay on the island. All he asked for was free roam of the island, and that neither of them ask the other too many personal questions. Law also made it a point that no one was to know that he is staying on the island. Caesar said that he saw no harm in trusting Law, and asked Monet if she agreed. She follows by asking Law if he could heal the prisoners on the island who were paralyzed by the poisonous gas."}, {"type": "paragraph", "text": "Caesar finally agreed to let Law stay on the condition he forms a contract with him to exchange his heart for Monet's heart in order to make it hard for both of them to betray each other should one of them attempt a duplicitous action. He also stated he is the boss of the island and Law should be weaker than him if he wished to stay on the island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Caesar_and_Law_Meet.png/revision/latest/scale-to-width-down/210?cb=20141206072640", "caption": "Law tells Caesar he wants to stay at Punk Hazard."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "Caesar was first seen after Franky and his group broke out of their cell. As he examined the hole that Franky made, he commented that only Vegapunk's laser was capable of such a feat. When he heard Trafalgar Law was fighting the Marines from G-5, Caesar was displeased since the plan was to chase them away. He was then shocked to be informed that the Marines saw the kidnapped children and feared that his secret activities would be exposed. Monet then arrives and informs him that Vegapunk's dragon and Brownbeard's centaur patrol unit were defeated. He then learned of the Straw Hat Pirates' presence on the island."}, {"type": "paragraph", "text": "After Law dealt with the G-5 Marines and returned to the facility, Caesar berated the Shichibukai and demanded an explanation for his actions. Law replied that he is the one who should be complaining."}, {"type": "paragraph", "text": "He soon contacted a person named Joker who gave him permission to exterminate the Straw Hats, the G-5 Marines, and Kin'emon while Joker will make it look like an accident at sea. One of the centaurs defeated by Luffy's group then comes to Caesar, telling him that Brownbeard has been captured and begs him to help. Caesar told him that he has a medicine ready and that he will heal him and the other centaurs. However, instead, he locked the centaur in a chamber and exposed him to a seemingly new gas he developed. Caesar asked him for certain symptoms, like nausea and hallucinations, and the centaur appears to have them. Caesar pressed a button, and an explosion is heard as he purged the chamber along with the loyal centaur inside, with smoke coming out from a shaking exhaust pipe."}, {"type": "paragraph", "text": "When Monet asked whether his experiment failed, he claimed none of his experiments ever fail, even during the \"failed\" experiment four years ago where his weapon of mass destruction killed a massive amount of people. He added that he had even followed up and did surveillance on all the victims of that experiment, documenting the effects as proof of his scientific mastery. He euphorically asked the World Government (though not directly) where the failure is and told them that he will show them who the number one scientist is."}, {"type": "paragraph", "text": "Law later gave a heart to Caesar, which supposedly belongs to Smoker. Caesar held the heart in his hand, while Law looked on silently with a displeased look in his eyes and a frown. Caesar was in good spirits thanks to the capture of Smoker's heart and said that he already sent soldiers to deal with the Marines and that he knows what the outcome will be. Law asked what happened to Straw Hat, and Caesar revealed that having taken Monet's warning about the Straw Hats' possible increase in strength seriously, he sent two powerful people after them: the Hitmen of the Snowy Mountain, the Yeti Cool Brothers. It was later revealed that he also told them to kill Brownbeard and capture Franky because he possessed the technology of Vegapunk's laser."}, {"type": "paragraph", "text": "When Monet informed Caesar about Law's association with Luffy at Sabaody Archipelago and Marineford, Caesar pulled a pistol on Law and questioned him about his relationship to the notable pirate. Law denied having anything to do with the Straw Hats' presence on the island. Caesar then realized that Law would not betray him, as he would not make things more complicated for them, after becoming a Shichibukai and coming to Punk Hazard. As Caesar is about to leave, Law asked him why the kids would come back, even when left alone. Caesar then proudly presents a candy laced with NHC10 and tells Law that he gave them to the kids, much to Law's disgust. As Law is leaving, Caesar points out that people who think too much are hard to handle."}, {"type": "paragraph", "text": "He then picked up Franky's wanted poster, and expressed his desire to capture him in order to acquire Vegapunk's laser system, which Franky has installed into his own body. Caesar then responded to his subordinates when they asked about the G-5 Marines, allowing his subordinates to take refuge for now while Caesar himself made preparations, and threatened his subordinates with death if they fail to leave Smoker's brigade alone."}, {"type": "paragraph", "text": "During the fight between his men and the G-5 Marines, his men tried to contact him. Caesar predicted that it was just a report that they opened the doors on the Fire Lands and that something came out, as well as pleas for help since the Marines defeat them, so he chose to ignore the call. Since so many people appeared on Punk Hazard, Caesar decided to stop gathering their bodies for his experiments and instead wanted to release his pet, while declaring that he will not let them leave this island. He is later seen telling Monet about the accident four years ago, and how the slime is the accident itself. He explains that he simply compressed the expelled gas into the creature known as Slime."}, {"type": "paragraph", "text": "Caesar is later seen outside the research facility on top of a warship, apologizing for keeping Slime locked up for three years. Smoker then asked him if he is Caesar Clown and Luffy asked him if he is the master, so Caesar answered yes to both questions. He began to explain that the Slime is throwing itself over the lake and what it is. Before he finished, he is interrupted by Luffy suddenly grabbing him."}, {"type": "paragraph", "text": "As Luffy attacked Caesar with his Gomu Gomu no Kane, Caesar manages to evade his attack by turning into gas. Caesar responded with his Gas Robe attack, daring Luffy to inhale it. Luffy  inhales it and blew it out of his ears, which surprises Caesar. Luffy stated that poison attacks do not work on him since his encounter with Magellan, and Caesar becomes enraged that Luffy compares him to a Paramecia. Luffy quickly struck Caesar with Jet Mace."}, {"type": "paragraph", "text": "As Caesar's men went to help Caesar, he told them to back off and called them trash. He then stopped Luffy from using another attack by using his Gastanet attack, blowing Luffy up. Delighted by the success of his attack, Caesar ordered slime-chunks to attach themselves to Luffy to cause an even bigger explosion. Caesar is then visibly baffled when he sees that Luffy evaded his attack and standing behind him. Before he can react, Luffy slammed Caesar onto the ground with a Jet Stamp. As Luffy mounted Caesar and grabs him, he suddenly fainted. Caesar emerged victoriously from the battle, stating that Luffy underestimated him."}, {"type": "paragraph", "text": "Caesar is later seen holding an unconscious Smoker. He also defeated Franky, Robin, and Tashigi through an unseen method. The G-5 Marines note that Caesar did not even touch them. Caesar ordered his soldiers to restrain the prisoners and to be sure to use Seastone chains for the Devil Fruit users. He also told his men that he will provide shelter from the Slime. As he left, Caesar laughed at the fact that Law and Luffy were too much for the Yeti Cool Brothers, thus revealing that he knew of Law's treachery."}, {"type": "paragraph", "text": "Caesar later appeared at the Straw Hat Pirates' hiding spot, where Usopp and Nami are having trouble keeping the children under control. Caesar lured the children to him by offering them candy. Usopp and Nami attempt to resist, but Caesar suffocated both of them. A wounded Brownbeard woke up and tried to get revenge against Caesar for betraying him. Caesar quickly defeated Brownbeard and then returned to the facility with the children. On the way, he contacted all of the underworld dealers to inform them about an upcoming experiment for his chemical mass destruction weapon. Once he returned to the facility, he ordered his subordinates to take the children to the biscuits room and make sure that they do not leave again."}, {"type": "paragraph", "text": "Caesar then confronted Law about his treachery. He reminded Law that when he arrived, they made a promise that Caesar would let Law have Monet's heart if Law gave up his heart. So Caesar gave the heart to Vergo, and if Law tries to do anything against Caesar, he could just squeeze Law's heart. Vergo then gave his heart a tiny squeeze, and Law is seen in massive pain. While Caesar mocked Law about the deal he forced him to make when he came to the island, Law just mocked him stating he should have been more cautious of Monet rather than him and called Caesar stupid which results in Caesar squeezing Law's heart and Law passed out from the agony."}, {"type": "paragraph", "text": "Caesar is then seen, still making the video Den Den Mushi broadcast to the brokers, telling his subordinates to set up a giant piece of candy for Smiley to eat. Caesar told the brokers on the broadcast about the poisonous gas that appeared four years ago after his experiment. He then said he has made a new weapon out of it, and calls it \"Shinokuni\". When Smiley finally made it to the food, Caesar is overjoyed on Smiley's arrival, and says he has so much to tell him. When Caesar ordered Smiley to wait, Smiley ignored him and quickly ate the bait. Regardless, Caesar is pleased that Smiley is showing some reaction to the candy. Smiley then transformed into a giant cloud of poison. Caesar watched in glee as his fleeing subordinates succumb to the effects of the gas and explains to his captives the power of his weapon of mass destruction. When he saw Zoro's group keeping themselves away from the gas, Caesar commented that they are tough but will eventually get caught."}, {"type": "paragraph", "text": "He then proceeded to send Law, Smoker, Tashigi, and Luffy's group outside of the facility to die. Caesar later realized his prisoners nor the G-5 Marines were caught in the gas and one of his subordinates reported their escape. Caesar discerned the group is heading for Gate #66 in Building R. He ordered the passage between Buildings A and B be sealed off, then to blow hole in the sealed part to let the gas in though wishes for the Den Den Mushi to continue running to show the brokers his scientific work. He is angered when he observed that he did not petrify his intended targets and swears no one will escape. He orders Monet to let gas into the other chamber, saying he is willing to kill Vergo when Monet comments that the gas would petrify Vergo as well."}, {"type": "paragraph", "text": "Suddenly, Luffy and Smoker entered the room Caesar is broadcasting from and Luffy immediately punched Caesar in the stomach, taking Caesar by surprise. Caesar reels from the punch and Luffy initiated the second round of their battle. Caesar demanded to know why Luffy is trying to capture him and Luffy explained his role in Law's plan. Caesar admonished him, warning Law cannot be trusted but Luffy retorted that is for him to decide. The two continue to clash with Luffy landing a few solid hits. Caesar tried to suck the oxygen out of him but Luffy managed to get out of range of the vacuum and attacks from a distance injuring him. Caesar revealed he has other methods of attack such as a flaming blue sword. Luffy managed to avoid the blade and prepares to finish him with a Jet Gatling. However Monet used her Devil Fruit ability to construct a wall and protect Caesar. On her suggestion, Caesar abandoned the battle and departed to try to locate Law, though promised he has a way to make guinea pigs out of Luffy and his allies."}, {"type": "paragraph", "text": "An emergency broadcast is heard from the D Building that Law is in the SAD manufacture room much to Caesar's panic alleging that Law's actions will cause difficulty for the Shichibukai himself. He is later contacted by Donquixote Doflamingo and instructed to return to Dressrosa once Baby 5 and Buffalo arrive as support. Doflamingo also revealed that Caesar is the only person in the world that can create SAD."}, {"type": "paragraph", "text": "Caesar is then seen in the secret room, monitoring the situation inside the facility. He surveyed the gas is pouring into Building B due to an explosion caused by the fire created by Vegapunk's smaller dragon. He ordered his subordinates to seal the gates to Building C and D to ensure that the intruders go to Building R. Caesar's subordinates ask him to give them permission to fight, but Caesar told them that it is not necessary and informs them of his strategy to kill their enemies. Caesar goes on feeding lies to his subordinates, telling them that Vegapunk is the one fully responsible for the incident four years ago. While his subordinates cheer for him, he reminisced back to the time he triggered the explosion that caused the disaster."}, {"type": "paragraph", "text": "Brownbeard later arrived to the first floor of Building R. As Caesar watched him on the monitor, Brownbeard is about to reveal to the soldiers of Punk Hazard about Caesar's true colors. Before he can speak any further, Caesar and his subordinates go down to the first floor to meet him. Upon seeing Caesar, Brownbeard demanded him to tell him what happened to his men outside on the island before Shinokuni was released. Caesar merely shrugged and says he did not receive their distress call when in truth he did received it be left them to die outside. Angered by the callous disregard of the lives of his men, Brownbeard tried to reveal Caesar's true nature to the rest of the men protecting their 'generous' master, but Caesar managed to inject a muscle relaxant in Brownbeard making him spurt out gibberish and unable to stand. Now in control of the situation, Caesar whispered to Brownbeard that the poison gas incident was his doing. Brownbeard then furiously tried to attack Caesar, only to be shot down by the subordinates he swore to save. Feeling victorious, Caesar prepared to finish off Brownbeard when Luffy knocked him away with a giant Haki-infused fist."}, {"type": "paragraph", "text": "As Luffy prepared for a third confrontation, Caesar exhorted  him that if he attacks him, Joker (i.e. Doflamingo) and a Yonko will hunt him down and gloated that Luffy will never defeat all of them. Luffy, remembering all the horrible things Caesar Clown has done, channeled all his rage into a single punch on the depraved scientist's face, shouting that he has already faced powerful enemies. Caesar warned Luffy again about just who he is dealing with before trying to attack Luffy again with Gastille, a gas burner attack. However, Luffy dodged the beam and punched Caesar in the face again."}, {"type": "paragraph", "text": "Caesar observed the damage to his base due to Law's attack and is quite upset over it. He ordered his troops in the control room to flood the room so the Shinokuni will power him. When they protest that over 100 of his minions are still on the first floor, Caesar finally dropped the façade, yelling how they are all his guinea pigs and he does not care how many of them have to perish. The men are aghast at this outburst while Usopp, who was hiding, watches from one of the monitors."}, {"type": "paragraph", "text": "However a few of Caesar's men still remain in denial about Caesar's declaration, thinking it was part of his plan against Luffy and open the vents. When the gas floods in, Caesar absorbed it and grows, ranting manically how a success his experiment was since two \"peaceful\" countries want to procure his weapon and how he will become the king of the land of death. He then attacked his own men with the Shinokuni, angering Luffy further. Luffy then ran into a hallway, making Caesar think he is running away in cowardice. He chased after the Straw Hat captain and prepared for a final assault as Luffy charges at him with a Gear Third attack."}, {"type": "paragraph", "text": "The attack not only sent Caesar through the gate to the escape passage but also sent him crashing into a tanker outside of the lab. Caesar has been knocked out and his unconscious body is soon found by Buffalo and Baby 5."}, {"type": "paragraph", "text": "During their battle with Franky, Caesar is awoken by Baby 5's explosion. Caesar believes himself to be close to death but remembers that Law gave him Smoker's heart and decides to take Smoker down with him. While he considers to kill Smoker, he sees Baby 5 and Buffalo fighting in the sky, which relieves him, knowing that they will rescue him. He then stabs the heart, but unknowingly kills Monet instead, as Law had covertly returned her heart to Caesar instead of Smoker's."}, {"type": "paragraph", "text": "After Franky repels Buffalo and Baby 5 with General Cannon, the other Straw Hats, the G-5 Marines, and the children reach the outside via a rail car. When Usopp and Nami help finish off Buffalo and Baby 5, Caesar attempts to escape but Usopp catches him with seastone handcuffs."}, {"type": "paragraph", "text": "While everyone was having a party and a feast, the G-5 Marines forced Caesar to explain how to neutralize the gas. As he was brought before Smoker, Caesar was surprised to see the vice admiral alive. The alliance of the Straw Hat Pirates and Heart Pirates then took him as a hostage. During Law's negotiation with Doflamingo via a Den Den Mushi, Caesar was heard begging Doflamingo to save him."}, {"type": "paragraph", "text": "As the Straw Hats and Law discuss on their next plan, Caesar taunts them by saying that their actions will cause them to become targets for all of the big shots in the New World and exclaimed that he never met a large group of idiots in his life like them. Sanji interrupted him by beating him up. Chopper comically got angry at Sanji for beating Caesar up while he is still taking care of Caesar's injuries."}, {"type": "paragraph", "text": "When the Straw Hats discovered that Caesar is the man responsible for the SMILE production, he blushed at Chopper's awe but then became angry when they realized Vegapunk originally discovered it, causing Caesar to lash out that they cannot manufacture SAD like he can. Later that night, Caesar was seen sleeping on the ship."}, {"type": "paragraph", "text": "The next morning, when the morning paper indicated that Doflamingo gave in to Law's demands and resigned from the Shichibukai, he burst into tears, seeing how far Doflamingo would go for his sake."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Luffy_Grabs_Caesar_Clown.png/revision/latest/scale-to-width-down/210?cb=20141206192043", "caption": "Luffy grabs Caesar upon meeting him."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Caesar_Clown_Defeats_The_Straw_Hats_and_The_Marines.png/revision/latest/scale-to-width-down/210?cb=20131010151107", "caption": "Caesar stands triumphantly over Smoker, Tashigi, and three of the Straw Hat Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Luffy_Attacks_Caesar.png/revision/latest/scale-to-width-down/210?cb=20141206191351", "caption": "Luffy attacks Caesar in their second confrontation."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Luffy_Breaks_Caesar%27s_Face.png/revision/latest/scale-to-width-down/210?cb=20140304005048", "caption": "Luffy giving Caesar a devastating punch to the face."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Luffy_Defeats_Caesar_Clown.png/revision/latest/scale-to-width-down/210?cb=20141206190827", "caption": "Caesar Clown is defeated by Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Caesar_Stabs_Monet%27s_Heart.png/revision/latest/scale-to-width-down/210?cb=20141206075456", "caption": "Caesar stabs Monet's heart, believing it to be Smoker's."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ec/Straw_Hat_Pirates_and_Allies_Read_Newspaper.png/revision/latest/scale-to-width-down/210?cb=20140113035402", "caption": "Caesar, The Straw Hats, Kin'emon, Momonosuke, and Law read the newspaper regarding Doflamingo's resignation."}]}, {"title": "Caesar Retrieval Arc", "level": 4, "content": [{"type": "paragraph", "text": "While Caesar was sleeping, the Thousand Sunny was attacked by Breed and his army of animals. Breed grabbed Caesar during the confusion. Thinking that Breed was working for Doflamingo, Caesar happily taunted the Straw Hats. However, after Breed took him to his ship and imprisoned him, Caesar realized that Breed wanted to capture him so he can help make Breed's \"dream world\" become true with his scientific experience. When Caesar refused to follow his orders, Breed used his Peto Peto no Mi powers on him."}, {"type": "paragraph", "text": "Later on, he (being treated as a dog) and Breed were watching Law and Luffy's fight against each other, but Law managed to set Caesar free thanks to Luffy's punches. The scientist ran all the way through Breed's ship until he finds the Shark Submerge III, but before he could get away, both Law and Luffy were teleported to his location and got Caesar back in their hands. After Breed's defeat, Caesar was taken back to the Thousand Sunny and the News Coo finally brought the journal mentioning Doflamingo's resignation from the Shichibukai."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Caesar_Retrieval_Arc.png/revision/latest/scale-to-width-down/210?cb=20140621042927", "caption": "Caesar being held captive by Breed."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Law then contacted Doflamingo to discuss the next part of the negotiation. Law started off with allowing Caesar to speak with Doflamingo in order to confirm his safety. Caesar deeply apologized to Doflamingo for getting captured and being used as leverage."}, {"type": "paragraph", "text": "After arriving at Dressrosa, the crew split into three teams. The group responsible for delivering Caesar to Green Bit, consisting of Law, Usopp, and Robin, immediately headed out. Law's group and Caesar stopped by at a northeastern cafe wearing disguises like Luffy's group. While getting information on how to get to Green Bit, they learned that the bridge connecting to that island is surrounded by fighting fish, rumored to be able to destroy iron. The man they were talking to warned them of the fact that no one who has crossed the bridge to Green Bit has ever returned. Caesar and Usopp then became worried, knowing that they would have to go through a dangerous passage. They then spotted CP-0 walking by and were instantly alarmed by their presence."}, {"type": "paragraph", "text": "As Law's group crossed the bridge, the fighting fish began attacking. Law, realizing the danger, released Caesar from his handcuffs to help protect the bridge. Law revealed that he held Caesar's heart as an insurance. Despite the efforts of Caesar, Usopp, and Robin, the bridge was eventually destroyed. A fighting fish attacked them from the front, but was then captured by some unknown people. The group then used Caesar's ability to fly in order to get to the other side. After reaching Green Bit, they discovered a Marine ship stranded on the island. Caesar started to panic, worrying that the Marines knew of the exchange and was after the group and himself."}, {"type": "paragraph", "text": "While Usopp and Robin scout the island, Caesar and Law proceed to head towards the southern beach. Two minutes before the exchange time, Law was contacted by Sanji, who informed him that Doflamingo never quit the Shichibukai. When a copy of Robin's upper body appeared above ground, Caesar was surprised to hear that the negotiations have already failed. Once Issho and Doflamingo arrived at the exchange site, Caesar became elated to see Doflamingo."}, {"type": "paragraph", "text": "Since Doflamingo never kept his end of the bargain, Law refused to release Caesar. After Law declared to Issho that he and Luffy were indeed in an alliance, which confirmed his hostility to the government, Caesar then watched in shock as Issho used his gravitation ability to drag a meteor down towards them. Law, Issho, and Doflamingo used their respective abilities against the meteor, ultimately emerging unscathed. Caesar, still shocked, watched them come face-to-face in a three-way confrontation."}, {"type": "paragraph", "text": "After Law was overwhelmed, Doflamingo was seen holding what appeared to be Caesar's heart in his hand. As Caesar ran towards Doflamingo, begging him to return his heart, Law suddenly stated that he never said that the heart belonged to Caesar. Doflamingo, testing Law's words, squeezed the heart only to hear a scream coming from a nearby Marine, confirming Caesar's heart to be still in Law's possession. While Issho was distracted, Law escaped using Room and fled after grabbing Caesar. Law then planned on handing Caesar over to Nami's group as soon as the Thousand Sunny arrived at Green Bit."}, {"type": "paragraph", "text": "Once the Sunny came into view, Doflamingo realized Law's plan and targeted the ship, only to be intercepted by Sanji. Before Doflamingo could deal a lethal blow to Sanji after immobilizing him, Law intervened using Shambles and teleported Sanji, Caesar, and himself to the Thousand Sunny. Law then revealed that he had Caesar's heart inside himself all along. After returning the heart to Caesar, Law instructed Nami's group to head for Zou. Nami's group was initially hesitant to leave behind the other Straw Hats, but complied after realizing that the ship was facing threats from both Doflamingo and Issho. Law then took Giolla hostage, halting Doflamingo's attack long enough for Nami's group to escape with Caesar in their possession. While Law stayed behind to hold back Doflamingo, the Sunny flew away with a Coup de Burst."}, {"type": "paragraph", "text": "After sailing far away from Dressrosa, Sanji's group engaged in a conference call with both Luffy and Franky's group while Caesar listened in on their conversation. Caesar was then overjoyed when Sanji decided to sail back to Dressrosa after everyone was brought up to speed on the events conspiring in Dressrosa."}, {"type": "paragraph", "text": "The return trip was cut short by the appearance of the Big Mom Pirates. After they revealed that their objective was to capture Caesar Clown, the terrified scientist revealed to Sanji's group that he made shifty dealings with Big Mom in the past that left him in trouble and begged them not to let her crew capture him. Since returning to Dressrosa was out of the question, the group then continued to sail towards Zou, before preparing to fire back at the Big Mom Pirates."}, {"type": "paragraph", "text": "On board the Queen Mama Chanter were Pekoms and Tamago, as well as the Supernova Capone Bege, who had his own reasons for going after Caesar. When the Sunny was about to be struck with cannon fire, Brook slashed the cannonballs with Soul Solid and froze them. Thinking fast, Sanji used Caesar as a net to catch the cannonballs launched from Big Mom's ship that Brook had frozen, igniting them with a Diable Jambe kick and Caesar's own combustible gas body. The flaming cannonballs damaged the enemy ship, giving Nami enough time to use a Weather Egg to shroud the Thousand Sunny in fog, as nobody on board knew how to operate the Coup de Burst to get away because they lacked the crew who usually manned those features. The group succeeded in escaping the Big Mom Pirates."}, {"type": "paragraph", "text": "After escaping the Big Mom Pirates, the group on the Thousand Sunny arrived at Zou the next day. Caesar was forced to take Sanji's group to the top of the giant elephant by serving as their transport, using himself as a gas balloon while they rode in a basket below, cursing the group for making him go to the island against his wishes. After reaching Zou, they came across Sheepshead chasing after Tristan. After Sanji's group saved Tristan and ran from Sheepshead, they found Zou's ruined city and the devastated Mink Tribe."}, {"type": "paragraph", "text": "Seeing the devastation as the work of his Koro weapon, Caesar was gleeful to see how it worked better than expected, only to be beaten up by Chopper. Caesar then warned Sanji's group about the Mink Tribe's rumored hatred for humans and berated them for exploring Zou and throwing themselves into this mess. However, Sanji and Chopper ordered Caesar to neutralize the gas, with the former using his heart at leverage. Caesar reluctantly did so, and later assisted Chopper with treating the poisoned minks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Law%2C_Caesar%2C_and_Straw_Hats_in_Disguise.png/revision/latest/scale-to-width-down/210?cb=20141206074854", "caption": "Caesar and his captors incognito."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c8/Green_Bit_Confrontation.png/revision/latest/scale-to-width-down/210?cb=20141206215631", "caption": "Caesar and Law meeting Doflamingo and the Marines."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3d/Caesar_Brought_onto_Thousand_Sunny.png/revision/latest/scale-to-width-down/210?cb=20160118221537", "caption": "Law brings Caesar onto the Thousand Sunny."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Chopper_uses_Caesar_as_a_net.png/revision/latest/scale-to-width-down/210?cb=20160911163754", "caption": "Chopper uses Caesar as a net while battling the Big Mom Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/13/Creating_Koro_Antidote.png/revision/latest/scale-to-width-down/210?cb=20161119235110", "caption": "Caesar being forced to create an antidote for the Mink Tribe to counter Koro."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "While living with the Mink Tribe, Caesar continued making medicine for the minks. He was then horrified to learn that the Big Mom Pirates tracked him down after seeing Pekoms and Capone Bege. Caesar then explained to Sanji that he was asked to do some research for Big Mom but never completed his task and ran off with the money Big Mom gave him. Sanji and Brook then spoke with the Big Mom Pirates members in private. After Bege shot Pekoms in the back for agreeing to let the Straw Hats go, he summoned his men from his body and captured Caesar and Sanji's group. Bege then took them inside his body to continue the conversation with the Straw Hats. While chained up, Caesar feared the end."}, {"type": "paragraph", "text": "When Bege gave Sanji an invitation to a wedding Tea Party held by Big Mom while identifying him as the third son of the Vinsmoke Family and indicated that he would be marrying Charlotte Pudding, the 35th daughter of the Charlotte Family, Caesar and the other Straw Hats reacted with great shock. Caesar pointed out that Charlotte is Big Mom's last name, and that if Sanji were indeed to marry into her family, the Straw Hats would become underlings of her crew by default. After throwing Nami, Chopper, and Brook out of Bege's body, Sanji snatched a rifle from one of the Fire Tank Pirates and (much to Caesar's dismay) held Caesar hostage at gunpoint. Knowing that both he and Caesar were too valuable, he stated he would go to the wedding to prevent Bege's crew from going after his comrades. When confronted by Nekomamushi, Bege quickly fled with both Caesar and Sanji."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/96/Sanji_Holds_Caesar_Hostage.png/revision/latest/scale-to-width-down/210?cb=20161120010442", "caption": "Caesar being held hostage by Sanji."}]}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "On Big Mom's ship, Caesar was locked in a cage in Sanji's quarters. Caesar angrily asked his captors why Sanji received special treatment, reminding them of his reputation as a genius scientist. Unconcerned with Caesar's complaints, Vito told him that they had orders to take him prisoner."}, {"type": "paragraph", "text": "After disembarking on Whole Cake Island, Caesar asked Sanji to give him back his heart, but Sanji gave it to Vito instead, much to Caesar's chagrin. Caesar was later taken to Big Mom's castle and while speaking to Big Mom herself, Caesar lied that his research was progressing but was hindered by Luffy, Law, and the destruction of his lab at Punk Hazard. To his shock and horror, Big Mom revealed that she created a new lab for him to continue his research and gave him two weeks to complete it. At the lab, Big Mom's eldest son, Charlotte Perospero, watched over him and threatened to turn him into candy if he does not complete his research in two weeks."}, {"type": "paragraph", "text": "Sometime afterwards, Bege guarded the lab and approached Caesar with his heart, offering the chance to let him escape if the scientist lent him his power in his plot to take down Big Mom. Caesar protested against the thought of continued servitude but complied, and he was taken to the Fire Tank Pirates' base. On the day of the wedding, he was not happy to find out that the Fire Tank Pirates were meeting with the Straw Hats, and before the Straw Hats came, Caesar spiked his hair and poorly disguised himself as \"Gangster\" Gastino. When Luffy came to the base, he recognized Caesar immediately, and Caesar swore revenge on him and Law for his current situation. Bege then silenced Caesar by squeezing his heart, but when negotiations quickly went sour and Luffy tried attacking Bege, Caesar leapt into action. However, Jinbe reminded them that they all had the common goal of taking down Big Mom, and Caesar, Bege, and Luffy began discussing the plan to take her down."}, {"type": "paragraph", "text": "As Bege began explaining his assassination plan, Caesar warned Bege to keep his word of returning his heart or else he would harm Capone Pez. While Bege explained his plan, Caesar proudly showed three KX Launchers, the weapons that would be used on Big Mom, and bragged about how lethal they were. Caesar also volunteered to be the one to provide the alliance an escape route once they carried out their plan. Caesar, Luffy, and Bege agreed that their alliance would come to an end once Big Mom was dead and all groups had made their escape."}, {"type": "paragraph", "text": "Caesar then hid inside Bege's body as the Fire Tank Pirates went to guard the wedding. Outside the wedding venue, Bege told Caesar to come out of his body with the escape mirror. After Caesar emerged from Bege's body, Bege instructed him to hide the mirror before reviewing his role in the alliance's escape after the assassination plan was carried out. After checking on the Straw Hats, Bege told Caesar to get back inside his body before he entered the wedding venue. After the wedding ceremony began, the team initially encountered a problem when Jinbe had a hard time waking Luffy up. After they finally woke Luffy with meat, the team went inside the Mirro-World, preparing to attack the venue. Once they heard the signal, they unleashed the Luffy duplicates into the venue. Once all the Luffy duplicates were released, Caesar was left alone with Charlotte Brûlée."}, {"type": "paragraph", "text": "During the ensuing conflict at the wedding venue, Caesar raced through the Mirro-World while carrying Brûlée, who pleaded with her captor. Caesar snapped at her to shut up, stating that his heart was on the line. Right after exiting the Mirro-World, Caesar set up the escape mirror in front of the venue. He then took a peek inside, wondering why Big Mom did not start screaming after the cake and Mother Carmel's photo were destroyed."}, {"type": "paragraph", "text": "Luffy later caused Big Mom to start screaming and Caesar watched in anticipation as Bege, Vito, and Gotti fired their KX Launchers at her. However, Big Mom's scream caused the rockets to detonate before they reached her. With the assassination attempt a failure, Caesar quickly grabbed the escape mirror and flew into the venue while expressing dismay that Big Mom destroyed his weapons. However, before the alliance could escape into the mirror, Big Mom's scream shattered it. With nowhere to run, Caesar and his allies found themselves surrounded by the Big Mom Pirates, who were given earplugs by Charlotte Katakuri."}, {"type": "paragraph", "text": "Bege then transformed into a fortress and instructed the alliance members to get inside. As Caesar fled towards the fortress, Katakuri grabbed Brûlée off his back. After all the alliance members and the Vinsmoke Family successfully retreated inside the fortress, Bege went on to explain about the dire situation they were in. Caesar replied that the failure of the KX Launchers were not his fault, but he was interrupted when the fortress was under attack by a furious Big Mom."}, {"type": "paragraph", "text": "As Big Mom continued her onslaught, Bege decided to try turning back into human form and having Caesar fly him away from the venue. Caesar heavily disagreed, and the two argued, before the Vinsmoke Family decided to fight Big Mom in order to provide an opening for them to escape. Bege then squeezed Caesar's heart to get him to go with the plan, and he turned back into his human form as Caesar flew him away from the venue. As Caesar fled with Bege, Perospero blocked his path with a candy wall. Ichiji, Niji, and Yonji combined their attacks to destroy the candy wall, allowing Caesar to path through. When Caesar was close to escaping the venue, Katakuri stood in his way, but Ichiji attacked the Sweet Commander, enabling Caesar to continue. However, Caesar's escape was hindered once again by Brûlée, who was eager to pay the alliance back for using her. As Caesar looked back, he fell into despair upon seeing Luffy, Sanji, and the Vinsmoke Family overwhelmed. However, the Tamatebako dropped to the base of the Whole Cake Chateau and the bomb inside the chest exploded, causing the castle to collapse."}, {"type": "paragraph", "text": "While the castle fell, Caesar carried Bege far away from the chateau to the northwestern part of Whole Cake Island. After Bege ended his alliance with Luffy's group, he gave Caesar his heart back. With his heart back in his possession, Caesar happily left them behind."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Big_Mom_Commissions_Caesar.png/revision/latest/scale-to-width-down/210?cb=20170625082524", "caption": "Big Mom forces Caesar to complete his research within two weeks."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Caesar_Being_Rescued.png/revision/latest/scale-to-width-down/210?cb=20180318055218", "caption": "Caesar being \"rescued\" from his enslavement by the Fire Tank Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ef/Bege_and_Caesar_Strategize.png/revision/latest/scale-to-width-down/210?cb=20180408041628", "caption": "Caesar and Bege go over his role in the wedding crashing plan."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/20/Caesar%27s_Mirror_Breaks.png/revision/latest/scale-to-width-down/210?cb=20180527091437", "caption": "Caesar's mirror breaks as he flies it into the wedding venue."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a5/Caesar_Gets_His_Heart_Back.png/revision/latest/scale-to-width-down/210?cb=20180701032815", "caption": "Caesar finally gets his heart back after the alliance escapes."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Caesar vs. Monkey D. Luffy (Outside the research facility)", "elements": []}, {"text": "Caesar vs. Smoker (in Tashigi's body), Tashigi (in Smoker's body), Nico Robin, and Franky", "elements": []}, {"text": "Caesar vs. Nami (in Sanji's body), Usopp, and Brownbeard", "elements": []}, {"text": "Caesar vs. Monkey D. Luffy (in Caesar's office)", "elements": []}, {"text": "Caesar and Subordinates vs. Brownbeard", "elements": []}, {"text": "Caesar vs. Monkey D. Luffy (R Block 1st Floor)", "elements": []}, {"text": "Caesar, Usopp, and Robin vs. Fighting Fish", "elements": []}, {"text": "Caesar vs. Charlotte Brûlée", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In Chapter 663, his name is spelled as \"Caesar Clown\" which takes the place of the hiragana, as seen in Smoker's monologue. However, in the volumes' character introduction, it is spelled as \"Caesar Crown\"."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece: Burning Blood (DLC)", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited World Red", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Caesar seems to have a king theme, as:", "elements": [{"text": "Caesar was the title for the Roman emperors, derived from the cognomen of Julius Caesar.", "elements": []}, {"text": "Clown can be romanized both as Clown and Crown.", "elements": []}, {"text": "He is the self-proclaimed King of Shinokuni (Land of Death).", "elements": []}, {"text": "In his Shinokuni form, he obtains a crown.", "elements": []}, {"text": "Him being captured by Law and Luffy mirrors what happened to the real-life Julius Caesar, as they both were held for ransom and the pirates' negotiations did not go as planned.", "elements": []}]}, {"text": "He also shares his name with real-life pirates Black Caesar and Henri Caesar.", "elements": []}, {"text": "Like Magellan, Caesar's sinister face, wild hair and horns make him resemble a stereotypical image of a demon; particularly Baphomet, a pagan deity-turned-devil most commonly depicted as a humanoid goat.", "elements": []}, {"text": "In his first appearances, his coat did not show \"GAS\" written twice on the front as it does from Chapter 666 on.", "elements": []}, {"text": "He shares some similarities with Indigo, such as the scientist profession, clown connotations, and sharing a voice actor.", "elements": []}, {"text": "Caesar is the first antagonist to have his own signature soundtrack in the anime, called \"Master's Laughter\" (Mの冷笑, \"Master's Laughter\").", "elements": []}, {"text": "In the 6th fan poll, Caesar ranked 54th.", "elements": []}, {"text": "Caesar may be based in part off of the infamous Josef Mengele, a member of a team of doctors who conducted deadly and inhumane experiments on prisoners of Auschwitz in Nazi Germany. Mengele created a kindergarten and play area for his child test subjects and treated them far better than others in the camp, providing better food and living conditions. He gave the children sweets and referred to them kindly, yet was known for his sadistic tendencies and complete lack of empathy towards all test subjects.", "elements": []}]}], "images": []}]}