{"sections": [{"title": "Kin'emon", "level": 1, "content": [{"type": "paragraph", "text": "\"Foxfire Kin'emon\" is a samurai from Wano Country, a retainer of the Kozuki Family, the leader of the Nine Red Scabbards, the husband of Tsuru, and a former thug. He posed as Momonosuke's father during the journey to Zou. He was born 56 years before the present day, but traveled 20 years forward in time when he was 36 years old. He is one of the central allies of the Straw Hat Pirates during the Dressrosa and Yonko Sagas."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kin'emon's appearance matches the stereotype of samurai found in ancient Japan, with a black topknot and goatee. At 295 cm (9'8\"), he's slightly taller than Brook who stands at 277 cm (9'1\"). He is also quite muscular, but not overly so, even during his teen days. His eyes are asymmetrical, with his right eye opening more than his left."}, {"type": "paragraph", "text": "His attire consists of a samurai gi that is black and white striped on the left side and orange on the right. Kept on the left side of his torso is a pair of katana with identical flame-patterned sheaths. For footwear, he wears simple geta sandals."}, {"type": "paragraph", "text": "He has the crest of the Kozuki Family tattooed to his back."}, {"type": "paragraph", "text": "Over 25 years ago, he had light-colored hair and did not wear it in a top-knot."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kin'emon seems to follow the code of bushido, claiming he would commit suicide if he could, for the disgrace of being dismembered without dying. He still tried to maintain his pride, even after being completely dismembered. Like Momonosuke, Kin'emon is very stubborn, constantly refusing the help of others and claiming he does not need it. Only after nearly freezing to death did he finally forsake his pride and ask for help. He is also greatly honorable, as shown when he bowed before Sanji (in Nami's body) for saving his torso and thanked him for helping him, stating he was indebted to him."}, {"type": "paragraph", "text": "As shown by his constant refusal to accept help from Sanji and own claims, he holds a strong dislike for all pirates. This is most likely due to his master Oden's death in the hands of the Beast Pirates. He also stated that he cannot stand the sight of dragons. He also seems to be very quick to judge things, believing Zoro to be the one who robbed Ryuma's grave after seeing his sword Shusui sheathed at his waist, and refused to listen until he was distracted by Sanji."}, {"type": "paragraph", "text": "During his youth, Kin'emon was rather brash and rude. He was also irresponsible as he would get into debts and try to take money from his childhood friend, Tsuru. He even ignored Tsuru's advice to leave the yakuza and find a normal job. He took any opportunity to get rich quick, such as stealing a valuable white boar from the men who captured it. He did felt guilty for bringing the Mountain God's child to the Flower Capital, resulting in the chaos and destruction the gigantic beast caused. He was going to confess until Oden stopped him."}, {"type": "paragraph", "text": "After being encouraged by Yasuie to reform himself for Oden's sake, Kinemon adopted a proper samurai etiquette and a very old fashioned manner of speech. Due to his reformed outlook, Kinemon expects women to walk three steps behind men and talk gracefully and quietly. He, on many occasions, referred to Nami as a shameless, violent and obscene woman due to her careless behavior. He felt disgraced when he got hit by Nami on his head. Kin'emon talks in a very old fashioned way, probably a result of his shut-in samurai life in Wano Country."}, {"type": "paragraph", "text": "He has a tendency to be quite perverted in spite of his sexist ideals. Though he seemed to be outraged at Nami's sense of fashion, he still greatly enjoyed ogling at her cleavage. He also showed his anger and jealousy at Momonosuke bathing with Robin and sleeping in the same bed with Nami and Robin. He also has a strange special ability of talking with his farts."}, {"type": "paragraph", "text": "He cares deeply for Momonosuke, as he traveled to the dangerous Punk Hazard island and challenged one of the Shichibukai in order to find him. Even after being chopped to pieces, his torso and legs still attempted to look for him and attacked anything that got in the way. He cares enough about him to the point that when he thought that Momonosuke was the small dragon he had cut down earlier he rushed back to save him, despite the incoming gas."}, {"type": "paragraph", "text": "By his own admittance, Kin'emon is the type of person who does not give up on certain matter, as he was adamant in making Ashura Doji their ally once again, despite Ashura's initial refusal to join Kin'emon's cause. To this end, Kin'emon was not above framing him for stealing from the Beasts Pirates. However, after being confronted by Ashura, Kin'emon realized this error and that he was ignorant at the suffering he had endured for the last 20 years. Thankfully, this also allowed Ashura to finally join them again."}, {"type": "paragraph", "text": "He seems to have no knowledge of Devil Fruits, as he said he ate a strange fruit, instead of stating the correct name. Also he seems to be unaware of some stranger abilities, because he classifies everything unusual as ninjutsu or sorcery. He also seems to be unaware of other modern things, including dishes like pizza."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Kin%27emon%27s_Perverted_Personality.png/revision/latest/scale-to-width-down/210?cb=20140916075657", "caption": "Kin'emon's reaction to Nami's cleavage."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Tsuru", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon is married to a woman from Wano Country called Tsuru. They have known each other since childhood. During their younger years, Tsuru would threaten Kin'emon if he tried taking her money, but she did it to make him change his ways. When he thought that she was devoured by the Mountain God, Kin'emon furiously attacked the beast. Even after being separated for 20 years, Kin'emon is still loyal to her and is relieved to hear she is alright but notes that he cannot meet her at this time. In return, Tsuru is apparently faithful to Kin'emon as well because she never remarried though she must have been aware of his survival through time travel. Kin'emon is also concerned for her well-being as he went to rescue her after seeing Kaido in Kuri. Kin'emon was happy to see her again from afar, though restrained himself from reuniting with her because it was not the appropriate time. He also expressed sorrow for her after learning that Okobore Town was attacked."}], "images": []}, {"title": "Kozuki Family", "level": 3, "content": [], "images": []}, {"title": "Kozuki Oden", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon held absolute admiration and respect for Kozuki Oden, the daimyo of Kuri. It began with the incident when the Mountain God was causing destruction at the Flower Capital. When Oden defeated it, he saved Kin'emon's childhood friend Tsuru and also took the blame for the beast's rampage and that made Kin’emon wanted to join Oden as a retainer. His loyalty to the latter was so immense that he and the other retainers attempted to steal money from Shimotsuki Yasuie in order to support Oden."}, {"type": "paragraph", "text": "Kin'emon also cares dearly for his master as he was deeply saddened when Oden was brutally executed by the Beasts Pirates and constantly driven to tears when he recalled his demise, despite his pride as a samurai. Alongside his fellow retainers, Kin'emon is willing to risk his life to avenge Oden and fulfill his last wish, to open the borders of Wano Country."}], "images": []}, {"title": "Kozuki Momonosuke", "level": 4, "content": [{"type": "paragraph", "text": "Momonosuke is his master's son and the heir of the Kozuki Family. As a loyal retainer of the Kozuki Family, Kin'emon cares deeply for him as shown when he traveled to Punk Hazard, he challenged Trafalgar Law, a Shichibukai, to get him back. They pretend to be father and son in order to protect Momonosuke from his enemies, the Donquixote Pirates and the Beasts Pirates. Despite stating that he detests dragons, his staunchness for his young lord was greater, as he did not reject him for being able to turn into a dragon. On Zou, Kin'emon starts to realize that he, Kanjuro, and Raizo need to stop treating Momonosuke as a child and treat him as a leader."}, {"type": "paragraph", "text": "However, Kin'emon can be angered and jealous at Momonosuke. When Kin'emon found out that Momonosuke was bathing with Nico Robin, he became enraged towards the young lord, telling him to cut off his topknot to repent, proclaiming him as the worst kid, and cursing him out in his thoughts when Momonosuke was sleeping in Nami and Robin's room."}, {"type": "paragraph", "text": "Despite the two not being related, the Straw Hat Pirates noted that they looked alike and shared the same perverted traits."}], "images": []}, {"title": "Friends and Allies", "level": 3, "content": [], "images": []}, {"title": "Denjiro", "level": 4, "content": [{"type": "paragraph", "text": "Out of the fellow members of the Nine Red Scabbards, Kin'emon has known Denjiro the longest, having been close friends even before meeting Oden. When Kin'emon recklessly attacked the Mountain God for swallowing Tsuru, Denjiro expressed great worries, telling him to stop endangering his life. Like Denjiro, Kin'emon shared his immense admiration for Oden and pledged to serve him together. Kin'emon also had utmost respect for Denjiro's strength, believing him to be a powerful ally for the Kozuki Family's revolution to overthrow Orochi."}], "images": []}, {"title": "Kanjuro", "level": 4, "content": [{"type": "paragraph", "text": "Kanjuro is Kin'emon's close friend, who intended to travel with him and Momonosuke to Zou. However, when Momonosuke was captured and sent to Punk Hazard, Kanjuro allowed himself to be captured in order for Kin'emon to search for Momonosuke."}], "images": []}, {"title": "Raizo", "level": 4, "content": [{"type": "paragraph", "text": "Raizo is a ninja and Kin'emon's comrade. He accompanied Kin'emon, Momonosuke, and Kanjuro on their journey to Zou, but got shipwrecked and separated. He and Kanjuro were relieved when the Minks told them that Raizo was safe and later happily reunited with the ninja."}], "images": []}, {"title": "Inuarashi and Nekomamushi", "level": 4, "content": [{"type": "paragraph", "text": "When Oden first brought Inuarashi, Nekomamushi, and Kawamatsu to Kuri Castle, Kin'emon was shocked and surprised at the sight of talking animals, and even questioned his lord on why he would let what considered to be monsters to enter their domain. However, as fellow retainers for Oden, Kin'emon sees the two minks as trustworthy and great comrades. In fact, when Kin'emon's group first left Wano, their first move was to head to Zou, the homeland of Inuarashi and Nekomamushi, in hopes of finding help in their revolution. While Kin'emon was forced to abandon the two minks when they were bickering and captured by Orochi's forces in favor of saving Momonosuke twenty years ago, he commented how happy he was to see them alive in the present."}], "images": []}, {"title": "Kikunojo", "level": 4, "content": [{"type": "paragraph", "text": "They appear to be on good terms, as Kikunojo respectfully refers to him as Kin-Sama. After a long period of separation, he was so overjoyed at seeing him that he tightly hugged him on sight and blushed in his presence, making Kin'emon uncomfortable."}], "images": []}, {"title": "Ashura Doji", "level": 4, "content": [{"type": "paragraph", "text": "As fellow followers of Oden, Kin'emon has tremendous respect for Ashura Doji's strength, believing he is equivalent to that of one hundred men, and that he would be an invaluable asset in their revolution against Orochi and Kaido. However, when Ashura (under the alias Shutenmaru) reunited with Kin'emon, Ashura rejected rejoining their campaign to overthrow Kaido and Orochi. Ashura said that he did not share the same loyalty as his fellow retainers to the Kozuki Family as he only admired Oden. He was angry at Kin'emon and the others for vanishing for twenty years (because he lost some of his comrades ten years ago). Regardless, Kin'emon refused to give up and tried to force Ashura to become their ally and had no qualms for framing him for theft. However, Ashura became even more angry after founding about it, but he was still lenient enough to listen to Kin'emon's apology and pleas. Ashura then showed Kin'emon and Inuarashi the graves of fallen comrades and explained what happened to their allies after they had lost the patience in waiting for their return. Ashura then decided to rejoin his team and become friendly with his comrades once again."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Despite his strong dislike for pirates, and even though he initially scorned them when he found out that they were pirates, he is starting to see that the Straw Hat Pirates are different from most. However, despite knowing this, he was not at first willing to break his pride and ask for their help."}, {"type": "paragraph", "text": "After nearly freezing to death when his torso fell into the frozen lake, he finally forsook his pride and gratefully accepted their help. When Sanji saved his torso from being eaten by sharks and from freezing, he bowed before him and thanked him stating he is indebted to him. He has since come to greatly respect and trust them, immediately choosing to eat the food Sanji prepared for everyone and telling his \"son\" they can be trusted."}, {"type": "paragraph", "text": "Zoro and Brook have developed a respect towards the samurai, as they all are warriors of honor, and for his skills and way of fighting. Their respect for Kin'emon is great enough to offer to help save his \"son\" and they wish to learn about Kin'emon's foxfire sword style. The three of them work quite well together in combat, evidenced when they easily defeated a number of Caesar Clown's subordinates."}, {"type": "paragraph", "text": "After the Punk Hazard incident, Kin'emon developed some hostility towards Zoro after seeing that he holds the sword Shusui, rashly believing Zoro was the one who desecrated Ryuma's grave years ago, and intends to challenge Zoro to a duel after their mission is complete so the blade can be returned to Wano Country. However, he did praise him after the pirate successfully defeated Pica, showing that he is willing to give credit where credit is due. Likewise, Kin'emon agreed to Hiyori's decision to give up one of Oden's Meito heirlooms Enma to Zoro in exchange for Shusui, but not before warning Zoro about accepting Enma due to how dangerously difficult it is to wield."}, {"type": "paragraph", "text": "Kin'emon has a somewhat sexist opinion on women. Having been raised in the country of Wano, he expects women to be modest and speak gracefully and quietly. Nami's behavior, being the complete opposite of what he is used to, comes as a shock to him. Kin'emon looked down on the females around him, referring to Nami and Robin as \"Breast-banded lady\" and \"Courtesan\" respectively. However, it has yet to be shown whether or not he still considers them to be inferior. Due to Kin'emon's perversion, he attempts to give the women promiscuous outfits when disguises were needed, such as claiming that women in Dressrosa go around naked, and claiming (unconvincingly) that Nami's revealing kunoichi outfit is the standard. Nami often beats up Kin'emon for his lecherous attempts."}, {"type": "paragraph", "text": "Upon realizing they too desire to defeat Kaido, Kin'emon requested Luffy to allow the samurai to join their alliance, showing that their trust for the crew has increased."}], "images": []}, {"title": "Trafalgar Law", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon seemed to curse the Shichibukai for separating his body parts when he came to Punk Hazard to rescue his \"son\" Momonosuke. However, he apparently decided to forget his grudge and temporarily cooperated with him to defeat Caesar Clown. Afterwards, he seems to have completely gotten over this grudge, as he was on the same ship with Law but did not attack him. Kin'emon even showed concern for Law when he was shot by Donquixote Doflamingo as well as attempting to save him from the clutches of both Issho and Doflamingo."}], "images": []}, {"title": "Shimotsuki Yasuie", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon held immense respect for Yasuie, not only for being one of Oden's greatest allies but also for his past generosity in the sponsorship of grooming him and his fellow members of the Nine Red Scabbards into full fledged samurais. Kin'emon took to heart Yasuie's advice and completely changed his brash and vulgar ways. Even after twenty years, Yasuie still had complete trust in Kin'emon and his friends. When he came across the secret message from Kin'emon, he showed his willingness to join him. After he was captured, Yasuie claimed that the Kozuki Family and all its allies had truly died out and that he himself was responsible for the secret message as a prank in order to save Kin'emon's allies and give them a chance to continue with their revolution. Kin'emon was shocked to learn that Yasuie was still alive and tearfully expressed his gratitude for Yasuie's final generous sacrifice and after seeing Yasuie being shot to death, Kin'emon heavily cried, heartbroken by the death of his second benefactor after Oden. After learning that Yasuie had prepared a second rendevous point for his allies to set sail for Onigashima in Tokage port, Kinemon became even more determined to succeed in the Kozuki Family's revolution, regretful that he had caused trouble for Yasuie once again, believeing that it would be a major shame as a samurai for not living up to Yasuie's last expectations."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "Because of his role in the Kozuki Family's downfall, Kaido is Kin'emon's enemy. When hearing that Luffy and Law's alliance were after him, Kin'emon was horrified but withheld his knowledge of him. Kin'emon later showed disdain for the Yonko when talking to the Straw Hats about Kaido killing Kozuki Oden and his crew hunting him and his comrades."}], "images": []}, {"title": "Kurozumi Orochi", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon harbors great hatred for Orochi due to the latter collaborating with Kaido to execute Kozuki Oden and bringing ruination to Wano Country and its citizens by setting up countless weapon factories for the Beasts Pirates, causing immense industrial pollution to its regions, and monopolizing food supply for himself and the Beasts Pirates. Kin'emon vows to overthrow the shogun to avenge Oden and fulfill his dream of opening Wano."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Ryuma", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon has great respect and admiration towards the great samurai Ryuma. He stated that he is the hero of the Wano Country and that when his body was stolen from his grave, it caused the country to be in peril. When he saw Shusui, Ryuma's sword, he immediately attacked Zoro, believing he was the one who stole the body, and refused to listen to Zoro's explanation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Kin'emon has extreme amount of superhuman strength as the force he applies in his sword strikes are able to easily cut through a thick steel door. With his Haki-imbued swords, Kin'emon could slow down the contraction speed of Doflamingo's Birdcage. He also possesses an immense endurance to pain and cold. His head alone was capable of withstanding Sanji's powerful kicks, and his torso can withstand extremely cold temperatures that a normal person would typically die from and even withstand being viciously bitten by a Shark. He could survive and withstand the Mountain God's violent thrashing, which had enough force to destroy buildings. He was also able to survive being petrified by Caesar's gas, whereas others were presumed finished. Even at the age of fifteen, he was stated to be stronger than the subordinates of the Hyogoro Family, the most prominent Yakuza syndicate of the Flower Capital. In a fit of rage, Kin'emon was able to injure the Mountain God with his katana, causing it to bleed."}], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Noted by Orochi for his tactical intellect, Kin'emon is an extremely clever tactician, having been the one to formulate most of the strategies behind the alliance against the Yonko Kaido.  While in Dressrossa, Kin'emon came up with an idea of disguising Zoro, Luffy, and himself as toys with animal costumes to get away from the Marines without drawing attention and also disguising himself as Doflamingo while searching for Kanjuro in the the royal castle, allowing him to trick Gladius without the latter noticing him as an intruder. In a plan to recruit Shutenmaru, he successfully framed him for stealing supplies from the Beasts Pirates in order to provoke conflict between them."}], "images": []}, {"title": "Communicating Through Flatulence", "level": 3, "content": [{"type": "paragraph", "text": "After being dismembered, his legs were found by Luffy, Zoro, Usopp, and Robin. During this time, his legs seemed to possess the ability to speak autonomously, but after his legs are reattached to his head, it is revealed that he can speak from his legs by using his farts, which disgusted Usopp upon the revelation."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "As the leader of the Nine Red Scabbards of Kozuki Oden, Kin'emon is one of the most powerful samurai of Wano, noted by Orochi himself to be an incredibly strong master in swordsmanship. His skills has great versatility, able to wield either one or dual wield both his swords with incredible power and precision. Even after being dismembered, Kin'emon was capable of putting up a fight with his legs, recklessly attacking Luffy's party when they encountered him. His torso alone was able to match Brook in swordsmanship, utilizing a two-sword style.  Alongside Zoro and Brook, Kin'emon was able to cut down multiple G-5 Marines with great ease. During his youth, Kin'emon's skills were acknowledged by Hyogoro, who stated that his subordinates would never stand a chance against him. He was shown being able to fight on par with Ashura Doji when they sparred during their youth."}, {"type": "paragraph", "text": "He also proved that he is able to easily cut through steel, slicing apart the emergency shutters to Caesar's lab at the request of Zoro."}, {"type": "paragraph", "text": "Kin'emon specializes in a sword style he calls Kitsunebi-ryu (狐火流, Kitsunebi-ryū, literally \"Fox-Fire Style\")."}, {"type": "paragraph", "text": "He is somehow capable of generating, attacking with, and cutting fire with one of his swords. He was able to use this technique to clear the way off the Slime and even cut through the subsequent explosion caused by its detonation after being ignited. His fire enhanced sword slashes are powerful enough to seriously injure a dragon, despite its scales being stronger than steel."}, {"type": "paragraph", "text": "He also has a small dagger with him, although it appears that he only carries it around to commit seppuku if a situation calls for it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/50/Kitsunebi-ryu_Infobox.png/revision/latest/scale-to-width-down/210?cb=20191102094851", "caption": "Kin'emon burns some of Smiley by cutting it."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Kin'emon ate the Fuku Fuku no Mi, a Paramecia-type Devil Fruit that allows him to transform objects placed on a person's heads into various kinds of clothing, which disappear once removed. Furthermore he must first visualize the appearance of the clothes, otherwise his creations would be limited. However, he was not aware that what he ate was a Devil Fruit, but he does know about the weaknesses involved with it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Fuku_Fuku_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20181020010802", "caption": "Kin'emon making coats appear on the Straw Hats and the children."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon has shown the ability to use Kenbunshoku Haki, as even after being dismembered by Law, his legs and his torso were able to fight, and even defeat people without being attached to his head. When Kin'emon's disembodied legs first \"spoke\", it said it could feel the \"aura\" of other people and accurately attacked his opponents. Furthermore, his separated body parts navigated by 'sensing' their surroundings (though his legs still managed to somehow get stuck to a dragon)."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon displayed the ability to use Busoshoku Haki, known in Wano as \"Ryuo\", when he hardened his sword to slow down Doflamingo's Birdcage. His Busoshoku Haki is strong enough to withstand the Birdcage's razor sharp threads that can slice cannon balls with ease."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/49/Kin%27emon_Using_Haki.png/revision/latest/scale-to-width-down/210?cb=20160221230932", "caption": "Kin'emon using Haki on his swords."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early Life", "level": 4, "content": [{"type": "paragraph", "text": "In his youth, Kin'emon was an infamous thug who was addicted to gambling. Despite being a childhood friend with Tsuru, he often tried to take her money to pay off his gambling debt. On one occasion, she caught him red-handed and reprimanded him. He later stole a white boar from three men who went to Tsuru's tea house, having overheard how valuable the boar was. In the capital, he also stole money from Hyogoro. Before he could deliver the white boar to the Kurokoma boss, he was chased by some thugs. After meeting up with Denjiro, Kin'emon realized the grave consequences of bringing the white boar to the capital as it was the offspring of the Mountain God. When the Mountain God attacked the capital, Kin'emon feared that he would be responsible for the capital's destruction. Kozuki Oden, having overheard Kin'emon and Denjiro, approached them and asked to give him the white boar."}, {"type": "paragraph", "text": "Kin'emon initially refused to hand the boar over, still wanting to use it to pay off his debts. One of the men whom Kin'emon stole the boar from arrived and said that his comrades and Tsuru were devoured by the Mountain God. Kin'emon then let the white boar go and tried to attack the Mountain God, only to be overpowered by the beast. After Oden struck down the giant boar, Kin'emon discovered that Tsuru survived and embraced her. He was going to take responsibility for the Mountain God's rampage, but Oden knocked him out and took the blame himself. As Oden left the capital in exile, Kin'emon decided to become his retainer. He and Denjiro then followed Oden to Shimotsuki Yasuie's residence at Hakumai. They later followed Oden on his journey to Kuri. After Oden became daimyo of Kuri, Kin'emon became one of his retainers."}, {"type": "paragraph", "text": "After Inuarashi, Nekomamushi, and Kawamatsu joined Oden, they were running low on funds. Therefore, he and the other retainers attempted to steal money from Yasuie, but they were caught. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Oden and Wano Country. Following Yasuie's advice, they educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "After meeting the Whitebeard Pirates, Oden and his retainers were having a feast with them. Oden said that he wanted to join the crew, but Kin'emon, Kanjuro, Raizo, and Denjiro voiced out against it. Kin'emon and Whitebeard both agreed that Oden should not leave the country. After the Whitebeard Pirates left Wano two weeks later, the retainers discovered Oden, Izo, Inuarashi, and Nekomamushi to be missing."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/Kinemon_Studying.png/revision/latest?cb=20191125140801", "caption": "Kinemon studying to develope his knowledge."}]}, {"title": "Fall of the Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "Twenty years ago, after Oden was executed in the Flower Capital by the shogun of Wano Kurozumi Orochi, Kin'emon, Kanjuro, Raizo, Kiku, Inuarashi, and Nekomamushi escaped the execution site and fled back to Oden Castle, but Inuarashi and Nekomamushi were captured by the shogun's forces and were left behind. By the time Kin'emon's group reached Oden Castle, it was set ablaze by Kaido. The retainers went inside the castle and found Momonosuke as well as his sister and mother. Toki then sent Momonosuke and the retainers twenty years into the future. After arriving at the future, they traveled around Wano and discovered how much it had changed over the years. However, they discovered allies they could still count on and began forming a plan to take back Wano. Kiku remained in Wano while Momonosuke and the three retainers went on a journey to Zou to enlist the aid of the Mink Tribe. Kin'emon posed as Momonosuke's father in order to avoid any unwanted attention, but when they were leaving Wano, they were spotted by the Beasts Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2a/Oden_Castle_Burning.png/revision/latest/scale-to-width-down/210?cb=20191201183324", "caption": "Kin'emon and the other retainers during the destruction of Oden Castle."}]}, {"title": "Journey to Zou", "level": 4, "content": [{"type": "paragraph", "text": "While sailing to Zou, they were shipwrecked, and Raizo got separated. They drifted to Dressrosa where they were pursued by subordinates of Donquixote Doflamingo. Momonosuke hid himself in a ship, which set sail before Kin'emon could reach him. Kanjuro held their pursuers at bay to allow Kin'emon to escape."}, {"type": "paragraph", "text": "Kin'emon went to Punk Hazard to search for Momonosuke. During the journey, he encountered Shichibukai Trafalgar Law, who dismembered the samurai and scattered his body parts all over the island. His legs wandered into the burning side of the island and got stuck on a dragon. His head was sliced into eight pieces and locked in a cell in Vegapunk's former research facility. His torso and arms ended up wandering around the frozen side of the island, cutting down anyone that approached it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Kanjuro_Gets_Captured.png/revision/latest/scale-to-width-down/180?cb=20151011174734", "caption": "Kin'emon leaves Kanjuro to be captured in order to find his \"son\"."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the Straw Hat Pirates encountered the dragon that Kin'emon legs are stuck to, Kin'emon questioned them, asking if they were with the Shichibukai. After the dragon was defeated, Monkey D. Luffy pulled the samurai's legs off the dragon. Initially surprised that the person was only a pair of legs (and blaming it on Roronoa Zoro, thinking that he was the one who sliced the samurai), they were further surprised when the legs tried to attack them and then run away. Luffy ran after them, saying he wanted them to be part of his crew. When the pirates captured them, Luffy attached them to his back, called it \"Ashimaro\", and claimed that he was now a centaur. Together with the pair of legs, the Straw Hats traveled to the frozen side to find their friends."}, {"type": "paragraph", "text": "In the meantime, Kin'emon's head encountered the kidnapped group of the Straw Hats, who were placed in the same cell as he was. He requested that they reassemble the pieces of his head. At first the Straw Hats fooled around with the pieces, but then put him together in the correct order, with the exception of putting his chin on top of his head, and the top of his head where the chin should be. After realizing that he was a severed human head, they were shocked. When Nami started talking to him, he scolded her for her personality and sense of fashion, though after he admitted that he actually liked it, and the samurai got a trashing by Sanji."}, {"type": "paragraph", "text": "After finding out that they were pirates, he expressed his deep dislike for such people, saying that he would have been willing to escape with them if they were not. He was greatly surprised when Franky blew down the door. As the Straw Hats escaped, Sanji picked up the head and rearranged it into its proper self, revealing him to be a samurai from Wano Country. Sanji explained that they came to this island because they had picked up a distress call from one of the samurai's victims. The head claimed that he would never hurt somebody without purpose and that he was there to find his own missing \"son\". Hearing this, Sanji chose to bring the head along, claiming responsibility."}, {"type": "paragraph", "text": "While escaping pursuers, the Straw Hats and Kin'emon's head entered a room full of children. After the samurai got over his initial shock, he asked the children if they know a boy by the name of Momonosuke, scaring the kids while doing so. He continued to scream for his \"son\", causing Nami to hit him, which started him yelling at the shame of being hit by a woman. As Sanji and Franky fought their pursuers, Kin'emon's head felt the strain of his torso, which happened to be fighting Brook, who put up a good fight but was eventually scared away by the headless and legless torso."}, {"type": "paragraph", "text": "After Sanji and Franky defeated the satyrs, the samurai wished to stay and look for his \"son\". Sanji started to get frustrated with the head's pride and wished to smash it, but was held back by Franky. Kin'emon said that he refuses to be indebted to pirates by asking for their help, though he has no objection if they wish to find his body for him. The samurai further taunted Sanji, reminding him that the cook chose to be responsible for the head. Sanji then threw a tantrum and beat up the head before taking it with him."}, {"type": "paragraph", "text": "When Kin'emon, Sanji, and Franky caught up with the children, he was forced to go along with Franky's dance routine, stunning the Marines and Law. Once the Straw Hats was who is in front of them, they ran back into the building. Kin'emon wished to stay back since he recognized Law as the one that cut him up, but was rebuffed once they saw that the Shichibukai did not have his other body parts."}, {"type": "paragraph", "text": "As they ran to the back entrance, the children started suffering due to the cold. Kin'emon told everyone to put a stone or leaf on their heads, and after they did, he managed to clothe them in warm jackets and boots. He explained that he ate an \"unusual fruit\" which gave him those magical powers. When asked why he did not do this before, the Samurai stated that he was enjoying Nami's body in just a breast band, earning a beating from Nami (who was in Franky's body)."}, {"type": "paragraph", "text": "The remaining Straw Hats, with the samurai's legs attached to Luffy's back, joined their kidnapped comrades, after crossing the length of the island to find them. Kin'emon's head was finally reunited with his legs (much to Luffy's dismay) and he was introduced to the rest. Kin'emon still wished to go back into the facility to find his \"son\", and explained how he had come to be in his current predicament, revealing his special skill of talking with farts. Brook then mentioned that he had encountered the samurai's torso, much to the head's shock. Kin'emon then left the group on his own to find his torso."}, {"type": "paragraph", "text": "While looking for his torso, it ended up in the island's central lake, causing his Devil Fruit weakness to flare up leaving him paralyzed and at the mercy of the Ice Lands. Sanji (in Nami's body), Zoro, and Brook managed to stumble across his half-frozen head and legs while looking for him. The samurai explained that his torso felt like it is submerged in water, so the group figured out that the torso was in the lake and they agreed to help him get his torso back."}, {"type": "paragraph", "text": "Kin'emon was shocked that they would brave the freezing waters just to help him when they are just pirates who he believed would never help anyone. Sanji merely stated that the samurai became their responsibility since they rescued him from the prison and once his body was back together, Sanji would beat him to a pulp. Moved by this sense of selflessness, Kin'emon swallowed his pride and deeply thanked him for the pirates' assistance, which is the first time he admits needing help."}, {"type": "paragraph", "text": "Kin'emon and the three Straw Hats then met a group of centaurs running away from the lake. Instead of stopping, the centaurs chose to run away to their master. Kin'emon and the Straw Hats see a mountain in the distance, which confused them, as there should be no mountain between them and the lake. Kin'emon and the others present watched the Slime as it shot itself across the lake. Brook claimed that he once read a book about the Slime and that it melts away women's clothes, much to Kin'emon's and Sanji's interest."}, {"type": "paragraph", "text": "He then watched with frustration as Sanji remained persistent in reclaiming the samurai's torso, jumping into the lake despite the severe cold and the toxins present in the water due to the Slime. Kin'emon then suddenly started screaming. Apparently, a shark grabbed his torso in his mouth. He continued screaming and even coughed up blood but said that it did not hurt. Sanji rescued his torso and got out of the lake."}, {"type": "paragraph", "text": "After his body is complete again, Kin'emon started crying and said that he was never as happy before having his body. After Brook commented on how tall he is, Kin'emon finally introduced himself to the group. His name is Kin'emon and his birthplace is Kuri, in the Wano Country. Kin'emon wanted to gratefully thank Sanji but he yelled at him not be so nice to have his body back since he should not forget how he abused the fact he could not do anything and being suspicious of him. Kin'emon then said he will never forget and bowed to Sanji saying he will never forget his kindness in his life and that he is very grateful. He then asked for forgiveness for being suspicious. Sanji then got angry, yelling at him that men do not get on their knees, but Brook interrupted him."}, {"type": "paragraph", "text": "They were surrounded by Slime. Kin'emon then suggested to burn it down and said that people call him Kin'emon of Foxfire and that he can burn through things by cutting with fire. He cut one of the Slimes, which then exploded due to being burnt. The group were, however, surprised to find themselves entirely unharmed. Kin'emon then stated that he cut the explosion and that there is no flame he cannot cut. Zoro then told him he would help him to find his \"son\" because the samurai's fighting style sparked his interest."}, {"type": "paragraph", "text": "After cutting some parts of the Slime, Kin'emon fled from it along with Zoro, Sanji, and Brook. Slime began to transform its shape and attack the group again. Kin'emon questioned Slime's powers with Sanji and Brook and decided that cutting it again is not an option as it is too large. He ran for the research facility in search of his \"son\" with the others. While running from the Slime, they came across the giant candy left by Caesar for Smiley, and a small dragon made by Vegapunk. They then saw a screen appear with Caesar on it and decided to run again."}, {"type": "paragraph", "text": "After witnessing the Slime explode, Kin'emon, Brook, Sanji, and Zoro rapidly ran away from the gas cloud. They saw the small dragon flying away from the poisonous cloud, and Zoro proposed the idea to ride on its back and fly away. Struggling to catch up to it, Sanji was able to rush ahead after feeding his perverse nature. He caught the dragon, allowing the group to finally ride it. Eventually meeting up with Nami, Usopp, and Brownbeard, the two groups turned their attention to Caesar's lab where Zoro and Kin'emon were able to cut down the iron shutter, allowing them to enter."}, {"type": "paragraph", "text": "Since cutting the iron shutter would allow the poisonous gas cloud into the base, the G-5 Marines plugged the hole with boards and blamed Kin'emon and Zoro for putting everyone in danger. Law told everyone present about a way off the island but they would have two hours to escape. Everyone broke up into three teams. Kin'emon went with Nami, Usopp, Zoro, Sanji, and Brook to save Momonosuke as well as the other abducted children."}, {"type": "paragraph", "text": "The G-5 Marines attempted to capture the Straw Hats, but Zoro, Brook, and Kin'emon repelled them. One of Caesar's underlings fired a cannon at the wall of Building A, allowing the poison gas to enter. As the exit gate of Building A was closing, Kin'emon and the others made a dash for it and managed to escape to the passageway to Building B before the gate sealed completely."}, {"type": "paragraph", "text": "Kin'emon and the Straw Hats rode on Brownbeard while they were going through Building B. The small dragon appeared and attacked them while laying waste to Building B with fire. Kin'emon and Brook debated on who should fight the dragon, but after it was damaged by Nami's Thunder Trap, Usopp's Rafflesia, and Robin's Quarento Fleur Quatro Mano, Brook and Kin'emon finished it off together. After the dragon was defeated, Kin'emon repeatedly kicked the dragon even though the dragon could not fight anymore, which made Brook astounded. He was forced to stop after being called out."}, {"type": "paragraph", "text": "Kin'emon and the group later found Chopper (in Monster Point) trying to prevent the children from getting their candy. Regardless of his efforts, the children beat him down and went past him when the Rumble Ball wore off. Kin'emon, Zoro, Nami, Robin, and Brook quickly came to Chopper's aid and ran after the children to the Biscuits Room. Once they reached there, they encountered Monet."}, {"type": "paragraph", "text": "Kin'emon went with Brook and Usopp to find his \"son\", and a pair of Seastone handcuffs, which Robin has asked for. Brook used his Devil Fruit abilities to separate his soul from his body so he could find the handcuffs, and Kin'emon had to carry Brook's body. While Usopp went to the secret room, Kin'emon and Brook freed some of the captive children. Kin'emon then learned from a little girl that his \"son\" had been transformed into a dragon. Filled with regret, he rushed back to find the dragon he fought with earlier believing that one to be Momonosuke. Despite Brook's protests, he ran back towards the direction of the gas and was eventually petrified. Brook then carried his body and fled to Building R with Chopper, Mocha, and the G-5 with them."}, {"type": "paragraph", "text": "They managed to reach Building R safely, and after Brook boarded the rail car with Kin'emon in tow, the still-petrified samurai reunited with his \"son\"."}, {"type": "paragraph", "text": "During the aftermath, Brook shouted out that he broke Kin'emon, feeling remorse despite the samurai already being \"dead\". Kin'emon's shell began to crack, and the samurai returned to his normal state. Luffy, Sanji, and Brook all screamed at him in shock, and Kin'emon screamed right back at them. Sanji kicked him angrily, asking how he could possibly be alive."}, {"type": "paragraph", "text": "When Brook called Sanji's actions uncalled for, the chef responded that the samurai deserved for not being dead like he was supposed to be. Momonosuke, having returned to his human form, then jumped into his father's arms and the two embraced. Momonosuke was not wearing his clothes, but shortly was given an outfit much like his father's. Shortly after their reunion, Momonosuke fainted, apparently from starvation. He later regained consciousness and the two then ate Sanji's food and party with the others."}, {"type": "paragraph", "text": "He and Momonosuke accompanied Law and the Straw Hat Pirates on the Thousand Sunny as they left Punk Hazard. As Nami informed the group that they were heading to Dressrosa, Kin'emon was surprised, saying that was where he wished to go. He was also shocked when hearing that the target of the alliance was Kaido, and yet again when he saw Momonosuke after he suddenly reverted to his dragon form. When Luffy asked him if he had any business on Dressrosa, Kin'emon revealed that he has a comrade being held prisoner there. Later that night, Kin'emon demanded a duel from Zoro after realizing the sword at the Straw Hat's hip belonged to his country's legendary hero Ryuma. Zoro denied having anything to do with the removal of Ryuma's body, but Kin'emon was soon distracted when he learned that his \"son\" was taking a bath with Robin. He, Brook, and Sanji berated Momonosuke for using his youth to his advantage, and Kin'emon demanded that his \"son\" cut off his top knot to repent. The trio were then chastised by Nami, who took Momonosuke to sleep with her and Robin for the night. Kin'emon then watched in envy as his \"son\" was carried off to bed."}, {"type": "paragraph", "text": "When the morning newspaper came, everyone read the news about Doflamingo's resignation from the Shichibukai. They also saw that the paper mentioned Luffy and Law's alliance and the alliance among Eustass Kid, Basil Hawkins, and Scratchmen Apoo."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Kin%27emon%27s_Legs_Running_Away_from_Luffy.png/revision/latest/scale-to-width-down/210?cb=20130524000128", "caption": "Kin'emon's legs running away from Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3d/Kin%27emon%27s_Torso_Fights_Brook.png/revision/latest/scale-to-width-down/210?cb=20160214005818", "caption": "Kin'emon's torso fighting Brook."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Sanji_Rescues_Kin%27emon%27s_Torso.png/revision/latest/scale-to-width-down/210?cb=20130629080802", "caption": "Sanji (in Nami's body) rescuing Kin'emon's torso."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Kin%27emon_bowing.png/revision/latest/scale-to-width-down/210?cb=20130602033858", "caption": "Kin'emon swallows his pride and thanks Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Smiley_Chases_Zoro%2C_Sanji%2C_Brook%2C_and_Kin%27emon.png/revision/latest/scale-to-width-down/210?cb=20130625220208", "caption": "Smiley chasing the Straw Hats and Kin'emon."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/82/Brownbeard_and_Others_Entering_Lab.png/revision/latest/scale-to-width-down/210?cb=20151213134251", "caption": "Brownbeard and the others crashing into Caesar's lab."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9f/Brook_and_Kin%27emon_Defeat_Vegapunk%27s_Second_Dragon.png/revision/latest/scale-to-width-down/210?cb=20130818094010", "caption": "Kin'emon and Brook cutting down a dragon."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6b/Brook_Carrying_Poisoned_Kin%27emon.png/revision/latest/scale-to-width-down/210?cb=20140916102451", "caption": "Brook carrying Kin'emon's body petrified by the poisoned gas."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ec/Straw_Hat_Pirates_and_Allies_Read_Newspaper.png/revision/latest/scale-to-width-down/180?cb=20140113035402", "caption": "Kin'emon, along with the crew, sees the newspaper."}]}, {"title": "Caesar Retrieval Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon was present on the ship when Breed attacked the Thousand Sunny. He fought against the invaders, and wondered who they were. After the animals escaped back into the water, Kin'emon listened as Breed talked to everybody on the ship. While the ship began to jump into the air due to the attack, Kin'emon squatted onto the ground, in order to keep his foothold on the ship."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Law told Doflamingo to pick up Caesar at Green Bit, Kin'emon had a meal with his \"son\" and the crew. Kin'emon and his \"son\" tell the story about how they were shipwrecked and drifted to Dressrosa, how Kin'emon was separated from his \"son\", and how Kanjuro was captured. The Thousand Sunny soon approached Dressrosa."}, {"type": "paragraph", "text": "After disembarking, the group split into three teams. Kin'emon went with Luffy, Zoro, Sanji, and Franky to destroy the factory and rescue Kanjuro. While exploring, they saw that the country is unique because the citizens reside alongside living toys. After getting disguises, they stopped at a restaurant to get something to eat. There, they found some thugs taking advantage of a blind man and taking away his money in roulette. After Luffy called the thugs' bluff, they witnessed the blind man use an ability to crush the thugs."}, {"type": "paragraph", "text": "After the man left without saying who he was, people in the casino noticed that their possessions had been mysteriously stolen. A bystander claimed that it was the work of fairies. Zoro noticed that one of his swords, Shusui, was missing, causing him and Kin'emon to lose their temper. Zoro managed to spot the thief and immediately gave chase. Kin'emon followed him to ensure that Shusui would not be misused. Kin'emon also declared that once they catch the thief, he would duel Zoro for the sword."}, {"type": "paragraph", "text": "Kin'emon got lost along the way and found himself surrounded by Doflamingo's men, who warned him that something bad would happen to Kanjuro if he attempted to fight back. The samurai then fled with Doflamingo's men in hot pursuit. He eventually ran into Sanji, who proceeded to defeat Kin'emon's pursuers. Having learned that Kanjuro was held at a \"toy house\", Kin'emon asked Sanji to accompany him."}, {"type": "paragraph", "text": "Kin'emon and Sanji then witnessed Luffy's clash with Chinjao on the video broadcast. Kin'emon wanted to save Kanjuro as soon as possible, but Sanji told him to wait as there are Marines surrounding the Corrida Colosseum. As Luffy's fight with Chinjao went on, Kin'emon cheered Luffy on. When Sanji scolded Kin'emon, the samurai replied with his belief that once a man enters a competition, he must aim for the top to be acknowledged as a real man."}, {"type": "paragraph", "text": "They later ran into Zoro, who was running back to the Thousand Sunny with a dwarf named Wicca, and then learned that Nami's group back at the Sunny was in trouble."}, {"type": "paragraph", "text": "Sanji decided to go save Nami's group while Kin'emon and Zoro stayed behind at the Corrida Colosseum, wondering how to get in. Bartolomeo then spoke to them and offered to help them find Luffy while asking for Zoro's autograph. With Bartolomeo's guidance, Luffy came to them."}, {"type": "paragraph", "text": "Kin'emon took out a Den Den Mushi and the group engaged in a conference call with Sanji and Franky's group. Everyone was then brought up to speed as they learned the true situation in Dressrosa. The three then witnessed the dramatic conclusion of the battle between Law and Doflamingo which raged across Dressrosa and ended right outside the colosseum. They were shocked to see Doflamingo standing above his opponent and then shooting Law three times at close range."}, {"type": "paragraph", "text": "Zoro quickly charged at Doflamingo, intent on rescuing their ally, while the samurai quickly informed everyone of what was happening, when Issho suddenly intercepted Zoro. Kin'emon managed to reach Law, but before the samurai could recover him, Doflamingo kicked him back. Luffy tried to help his friends, but realized that the bars in the windows of the colosseum are made of Seastone. The entire crew is shocked to be told by Kin'emon that the blind gambler was actually an Admiral."}, {"type": "paragraph", "text": "Both Doflamingo and Issho float above their opponents using their abilities, taking Law with them and head towards the palace. After the Marines started pursuing Zoro and Kin'emon, they were informed that the Sunny is under attack by the Big Mom Pirates who are after Caesar Clown. As Sanji's group continued on to Zou and Franky's group was left in charge of destroying the SMILE Factory, Luffy decided to head to the palace with Kin'emon and Zoro in order to defeat Doflamingo and recover their ally."}, {"type": "paragraph", "text": "After Luffy finally escaped the colosseum, the trio eluded the Marines by wearing disguises provided by Kin'emon's ability."}, {"type": "paragraph", "text": "Kin'emon, Luffy, and Zoro later arrived at the lift that leads to the royal palace alongside the dwarf, Wicca. They then encountered Viola, who offered to guide them to the palace. After getting acquainted with her and learning about her ties with the Riku Family, Kin'emon's group was then led to a secret passage. Once inside the passage, Zoro suggested that they use a basket used for lifting supplies and that Luffy should climb up carrying a rock and hang from the chain to act as a counterweight for the basket to move up. Kin'emon and Zoro then sat in the basket before Luffy reached the top. Kin'emon suggested to Viola that she should step in the basket too."}, {"type": "paragraph", "text": "They later arrived at the palace rampart tower. Viola was about to sneak them in, but Luffy went ahead and smashed his way through the gate. Having alerted the guards, they decided to charge in. Kin'emon apparently separated from the group along the way."}, {"type": "paragraph", "text": "Kin'emon moved through the palace disguised as Doflamingo and with Wicca hiding in his pocket. He ran into Gladius while going to the basement to find Kanjuro. Gladius, who was deceived by the disguise, informed him that Kanjuro had disappeared from the scrap house. Kine'mon later left the palace with Wicca and the dwarves who had attacked the palace with Kyros."}, {"type": "paragraph", "text": "Sometime after Doflamingo trapped Dressrosa in his Birdcage, Kin'emon discarded his Doflamingo disguise and reached the underground trade port. He met up with Robin and Usopp and brought Wicca and Kyros' dwarf group to Leo's group. Doflamingo forced everyone on Dressrosa into a survival game and coaxed them into going after some certain people by putting a price on their heads. Kin'emon is included in Doflamingo's hit list. While Usopp and Robin's group fled to the surface, Kin'emon jumped down into a hole that leads to the scrap heap, hoping to find Kanjuro there."}, {"type": "paragraph", "text": "Kin'emon found Kanjuro and rejoiced tearfully, happy to see him again. The two samurais prepared to leave the scrap heap on a bird Kanjuro brought to life from a drawing he just painted, but the trapped citizens and Dressrosa soldiers begged to be taken along."}, {"type": "paragraph", "text": "The two samurais then assisted the people in escaping the scrap heap. After leaving the scrap heap, Kin'emon and Kanjuro climbed from the colosseum to the old King's Plateau and met up with Usopp, Viola, and Riku Doldo III. Usopp then reprimanded the two samurai for leaving behind the net for the citizens to climb."}, {"type": "paragraph", "text": "After learning that Sugar was in the palace, Usopp informed Kin'emon of the seriousness of the situation. Kin'emon was then surprised that Usopp planned to snipe at Sugar from an incredible distance, saying that would be impossible. When the Dressrosa citizens reached the top of the plateau, Kin'emon and the others held them back long enough for Usopp to launch his attack. Though Kin'emon and Kanjuro were tied up, Usopp was successful in his efforts."}, {"type": "paragraph", "text": "The Dressrosa citizens then released the samurai and the others, realizing that they were merely playing into Doflamingo's hands if they had continued. Kin'emon was then surprised to see Admiral Fujitora, who decided to put faith in Luffy, like Riku Doldo III had."}, {"type": "paragraph", "text": "After most of the Donquixote Pirates' officers were defeated, Kin'emon, Kanjuro, and Usopp screamed in terror as Pica headed towards the old King's Plateau to crush everyone. Kin'emon was awestruck when Zoro destroyed the Pica statue and defeated Pica."}, {"type": "paragraph", "text": "After Pica's defeat, Zoro was pulled up from a ledge by Usopp. Kin'emon and Usopp then praised him on his display of strength, but Zoro told them to save it for later as Doflamingo was still standing."}, {"type": "paragraph", "text": "As Doldo, Tank Lepanto, and the citizens were leaving the old King's Plateau, Kin'emon heard about Law's defeat from Viola."}, {"type": "paragraph", "text": "When Doflamingo's Birdcage started to shrink, Kin'emon placed his hopes in Luffy. While leaving the old King's Plateau with Kanjuro and Zoro, Kin'emon was informed by Zoro about his intention to stop the Birdcage."}, {"type": "paragraph", "text": "Once they reached the Birdcage, Kin'emon and Kanjuro were surprised that Zoro made an attempt to push back the Birdcage. The samurais tried to tell Zoro that it would be impossible, but Zoro angrily told them to help instead of doing nothing. The two samurais complied and they were soon aided by Issho. They kept pushing the Birdcage back just long enough for Luffy to deal one decisive blow to Doflamingo. Once Doflamingo had been defeated, they witnessed the collapse of the Birdcage. They rejoiced as Doflamingo's downfall was announced to Dressrosa."}, {"type": "paragraph", "text": "Three days after Doflamingo's downfall, Kin'emon and Kanjuro traveled through the central streets, watching the citizens rebuild the country. They later appeared at Kyros' house, eating a meal with the Straw Hats. They prepared to leave when the Marines were mobilized to pursue Luffy and all those affiliated with him. They fled when the Marines were about to storm Kyros' house. After Luffy separated from the group to take care of unfinished business, Kin'emon's group went to the eastern port. While waiting for Luffy, they saw Issho approaching. When Issho prepared to attack them with all the rubble from Dressrosa, they quickly fled to the escape ship. At that moment, Luffy arrived and attacked Issho."}, {"type": "paragraph", "text": "During the clash, Issho used his gravity ability to blow away Luffy, who was then caught by Hajrudin. They quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after the pirates. They eventually reached Orlumbus' flagship, the Yonta Maria. After the Straw Hat Grand Fleet was formed, the Straw Hats and company held a feast to celebrate their victory over Doflamingo. After the feast, each of the leading allies received Luffy's Vivre Card and parted ways. Bartolomeo then brought the Straw Hats, the samurais, and Law to his ship, the Going Luffy-senpai."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c3/Straw_Hats_In_Disguise.png/revision/latest/scale-to-width-down/210?cb=20181019170212", "caption": "Kin'emon and the crew incognito."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/57/Doflamingo_Attacks_Kin%27emon.png/revision/latest/scale-to-width-down/215?cb=20150420015757", "caption": "Doflamingo attacks Kin'emon."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3c/Kin%27emon_as_Doflamingo.png/revision/latest/scale-to-width-down/150?cb=20141215212703", "caption": "Kin'emon disguises himself as Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Kanjuro_Frees_Prisoners.png/revision/latest/scale-to-width-down/210?cb=20151124142553", "caption": "Kin'emon and Kanjuro help the prisoners escape."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/04/Zoro_and_Samurai_Push_Birdcage.png/revision/latest/scale-to-width-down/210?cb=20160228091728", "caption": "Kin'emon and Kanjuro help Zoro stop the Birdcage."}]}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Silver Mine Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Straw Hats and Barto Club were sleeping for the night, members of the Silver Pirate Alliance suddenly arrived and captured Luffy and Bartolomeo. The Straw Hats and Barto Club attempted to fight back, but were immobilized by a very sticky substance from the cannonballs."}, {"type": "paragraph", "text": "The next day, the Going Luffy-senpai arrived at Silver Mine, and Kin'emon was transported by Law into the underground mine where Luffy and Bartolomeo were. The escapees of the mine were being attacked by a deluge of molten ore, but Kin'emon cut through the ore as he helped Luffy, Bartolomeo, and their allies to escape. After Zoro defeated Peseta, the Straw Hats and Barto Club prepared to head back to the ship, but Luffy and Bartolomeo stayed behind to confront Bill after he cut off their path."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "During a hail storm, Luffy's group learned that the Barto Club does not have a navigator, lacks experience in sailing, and usually call Gambia's grandmother who gives them useless advice. Therefore, the Straw Hats, the samurais, and Law needed to protect the ship. After one week of traversing through the dangers of the New World, the ship finally arrived at Zou. Kin'emon was amazed at the sight of the island, which is on the back of a giant elephant."}, {"type": "paragraph", "text": "After finding the Thousand Sunny, the Barto Club bid Luffy's group farewell. Proceeding to search for Sanji's group, they climbed the giant elephant's left hind leg with a dragon that Kanjuro conjured. After the samurais explained that they were also searching for their ninja comrade, Raizo, the group saw something dropping towards them."}, {"type": "paragraph", "text": "The thing that was falling towards them happened to be a monkey mink. While Kin'emon and Kanjuro were fooling around, the mink hit them, causing them to fall off the dragon. Despite being separated from the group, the samurai assured the Straw Hats that they were alright and will catch up to them eventually."}, {"type": "paragraph", "text": "Kanjuro later conjured a cat, which he, Kin'emon, and Bariete used to climb the elephant's leg. As they saw the eruption rain, they panicked as the cat would melt if it made contact with water. Having failed to reach Zou, Kin'emon and Kanjuro returned to the Thousand Sunny and decided to wait until the next day."}, {"type": "paragraph", "text": "On the next morning, they finally reached Zou. Kin'emon asked Bariete about Raizo, but he quickly ran away. The samurais chased after him, not noticing a sleeping Franky, Robin, and Brook."}, {"type": "paragraph", "text": "On the way to the Mokomo Dukedom, Kin'emon and Kanjuro reunited with Momonosuke. When they arrived at Kurau City, they were quickly intercepted by the Straw Hats, who tried desperately to keep them hidden. However, when they saw Inuarashi and Nekomamushi fighting with each other, the samurais revealed themselves, much to the Straw Hats' horror. Kin'emon explained that he is a retainer of the Kozuki Family and asked about Raizo. Contrary to what the Straw Hats expected, the Mink Tribe welcomed them and revealed that Raizo is safe as well as having a friendship with Kin'emon's clan."}, {"type": "paragraph", "text": "Kin'emon then revealed the crest of the Kozuki Family on his back to confirm his allegiance. After Momonosuke pleaded for Inuarashi and Nekomamushi to stop their quarreling, Kin'emon revealed that he is not his father and that his true father is the lord of the Kozuki Family. After Inuarashi and Nekomamushi called a truce, they took the samurais and the Straw Hats to a secret area in the Whale Forest where Raizo was hidden."}, {"type": "paragraph", "text": "After making their reacquaintance, Kin'emon, Kanjuro, and Raizo were saddened to see the state Zou was in after Jack's invasion. They then went back inside the whale tree once Robin finished deciphering the red poneglyph hidden there. After explaining the history of the Kozuki Family and their connection to the poneglyphs, the samurais and Raizo expressed sorrow in explaining Lord Oden's execution at the hands of Kaido and the shogun of Wano Country Kurozumi Orochi. Kin'emon revealed that Lord Oden was once part of the Roger Pirates and had been to Laugh Tale with Roger. He also revealed that the Beasts Pirates' are also stationed at Wano Country."}, {"type": "paragraph", "text": "The samurais and the two rulers of Zou revealed Oden's will to open the country of Wano to the world and to defeat Kaido and Orochi. Kin'emon also explained that they needed allies which was the reason why they journeyed to Zou. Kin'emon then asked for Luffy's help, but Luffy declined, saying that Momonosuke should make the request himself. When Momonosuke humbly did so himself, Luffy accepted and they formed an alliance."}, {"type": "paragraph", "text": "They later left the secret room and the samurais explained that they never went with Oden during his travels as leaving the borders of Wano is a crime. While discussing their plans to defeat Kaido, the alliance decided to split up and meet up again at Wano Country. Law agreed to take the samurais back to Wano Country in his submarine. Right after they left the Whale Tree, they felt Zou shaking and heard Zunesha crying."}, {"type": "paragraph", "text": "As everything shook around them, they witnessed Luffy and Momonosuke's ability to hear Zunesha's voice. They then heard from Momonosuke that Jack returned to Zou and started attacking Zunesha. On Momonosuke's orders, Zunesha sank Jack's fleet with one blow. With the threat of Jack ended, everyone became calm again. Kin'emon was surprised of Momonosuke's ability to command Zunesha."}, {"type": "paragraph", "text": "After Momonosuke decided to stay on Zou in order to communicate more with Zunesha, Kin'emon and his fellow samurais prepare to go back to Wano with Law and Zoro accompanying them. As the Sanji Retrieval Team departed from Zou, everyone, except for the Straw Hat members left behind, was shocked when Luffy jumped off Zunesha with his party."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Samurai_Ride_Nekozaemon.png/revision/latest/scale-to-width-down/210?cb=20160904110313", "caption": "Kin'emon, Kanjuro, and a monkey ride Nekozaemon up Zou's leg."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Raizo_is_Safe.png/revision/latest/scale-to-width-down/210?cb=20161204162210", "caption": "The minks reveal that they protected Raizo from Jack."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/Reunion_with_Raizo.png/revision/latest/scale-to-width-down/210?cb=20161218151655", "caption": "Kin'emon frees Raizo from his chains."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/50/Ninja-Pirate-Mink-Samurai_Alliance.png/revision/latest/scale-to-width-down/210?cb=20181004070045", "caption": "The samurai and minks form an alliance with the Straw Hat and Heart Pirates."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kin'emon and his group later infiltrated Wano Country. Kin'emon informed Usopp, Franky, Robin, and Zoro that Wano's government officials were associated with Kaido and warned them to avoid trouble until they were ready to strike. Some time after this, Kin'emon resided at the ruins of Oden Castle where he suffered from bouts of diarrhea. After one such bout, he was reunited with Luffy's group, and revealed to them about his group traveling through time."}, {"type": "paragraph", "text": "Kin'emon then went on to explain more about the past, such as Oden's accomplishments in Kuri, the time of his execution, the rumor about Toki, and what Kin'emon's group did after arriving at present time. He then went over a plan to attack Onigashima, the island where Kaido resided, in two weeks. He explained about the Fire Festival and how the decisive battle would play out. When Sanji explained his intention to compete with Kin'emon for Kiku's affection, Kin'emon explained that he already had a wife and was surprised to hear that Kiku met her. Kin'emon then gave the group new clothes and specific tasks to do and summoned Shinobu to guide them. He also mentioned three allies that they needed to find as soon as possible: Kawamatsu, Denjiro, and Ashura Doji. When Kaido arrived at the Kuri region, Law alerted Kin'emon and the group."}, {"type": "paragraph", "text": "Kin'emon was surprised to see Kaido appearing in Kuri so suddenly and he was shocked to hear that Luffy, Zoro, and Law were already exposed. After Luffy ran off to face Kaido and Law followed him, Kin'emon rushed to Okobore Town to rescue Tsuru. After Kaido destroyed Oden Castle, Kin'emon went to Okobore Town alone. He then found Tsuru and watched her from afar before noticing Shutenmaru, whom he recognized as Ashura Doji, passing by."}, {"type": "paragraph", "text": "At Mt. Atama, Kin'emon interrupted a fight between Ashura and Inuarashi. Ashura stated that while he admired Oden, he never swore loyalty to his family. However, Kin'emon was determined to make Ashura an ally. At an abandoned village in Kuri, Kin'emon was contacted by Franky, who informed him that the blueprints of Kaido's mansion were somewhere in Kuri. He then asked Franky to help out with other missions in the capital and wondered who could have the blueprints. Sometime later, the Beasts Pirates found out about Kin'emon's secret message and his supporters, causing Kin'emon great distress as his allies in the capital were getting arrested."}, {"type": "paragraph", "text": "After Mt. Atama was set on fire, Kin'emon and Inuarashi heard that Ashura was going to Bakura Town to confront the Beasts Pirates there and the two went after him. They later entered Bakura Town with Inuarashi and caught up to Ashura. After witnessing Yasuie's execution, Kin'emon mourned his death. After the execution, Ashura asked him and Inuarashi if they knew about the SMILE fruits."}, {"type": "paragraph", "text": "Outside Bakura Town, Ashura learned that Kin'emon framed him for theft. He got angry and knocked Kin'emon to the ground. Kin'emon and Inuarashi apologized and once again asked Ashura to join them. Ashura then told Kin'emon and Inuarashi to follow him, wanting to show them something. Later, Ashura showed them the graves of their dead comrades and explained what had happened to their allies ten years ago. He recounted how they had all lost patience and had tried to fight Kaido, but were all killed in battle. Afterwards, Ashura decided to rejoin his comrades. Inuarashi and Ashura then rejoiced and bragged to Kin'emon about how they had twenty years more fighting experience than him now. In response, Kin'emon called them a duo of geezers and the three began arguing."}, {"type": "paragraph", "text": "Ashura later took Kin'emon and Inuarashi to an abandoned port and showed them ships that could carry their troops to Onigashima. Ashura also gave Kin'emon the blueprints of Kaido's residence. Kin'emon was then contacted by Raizo, who informed him of the events that occurred in Udon and Kin'emon was shocked after hearing about the number of allies Raizo's group had gained there. They also discussed about the shortage of weapons and Kin'emon departed for Amigasa Village."}, {"type": "paragraph", "text": "Through a Smart Tanishi, Kin'emon spoke to Kawamatsu for the first time in years. During their conversation, Kawamatsu informed him that he had the weapons needed for the alliance. At Amigasa Village, Kin'emon contacted the yakuza bosses and informed them of Yasuie's last message after receiving it from Nami. After explaining how to read the message, Kin'emon began a strategy meeting with the allies gathered in the village."}, {"type": "paragraph", "text": "Kin'emon was then happy to hear from Kawamatsu and Zoro that Hiyori is alive. After Enma was given to Zoro, Kin'emon witnessed him giving the sword a test run. Three days before the raid on Onigashima, Robin informed Kin'emon about the number of enemies they would be facing. Two days before the raid, Kin'emon tallied the number of warriors on the alliance's side. He was disappointed to hear that those imprisoned in the Flower Capital could not be recruited. He then contacted everyone in the alliance and told them to use the remaining time for preparations. On the day before the raid, Kin'emon spoke to Luffy before heading out. Later, Kin'emon marched to the rebel meeting place with Momonosuke, Kanjuro, Raizo, Kikunojo, Inuarashi, Shinobu, Kawamatsu, and Ashura."}, {"type": "paragraph", "text": "The group eventually arrived at the meeting place, but found none of their ships and allies. In spite of this major setback, the Scabbards were still determined to go through with the raid, knowing that they would not get another chance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Nine_Red_Scabbards_Mourn_Yasuie.png/revision/latest/scale-to-width-down/215?cb=20190605192512", "caption": "The witnessing members of the Nine Red Scabbards mourn Yasuie's death."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kin'emon vs. Mountain God", "elements": []}, {"text": "Kin'emon vs. Trafalgar Law (unseen)", "elements": []}, {"text": "Kin'emon (torso) vs. Centaur Patrol Unit (unseen)", "elements": []}, {"text": "Kin'emon (torso) vs. Brook", "elements": []}, {"text": "Kin'emon vs. pieces of Smiley", "elements": []}, {"text": "Kin'emon, Roronoa Zoro, and Brook vs. G-5 Marines", "elements": []}, {"text": "Kin'emon, Nami, Usopp, Nico Robin, and Brook vs. Vegapunk's small dragon", "elements": []}, {"text": "Kin'emon and Roronoa Zoro vs. Donquixote Doflamingo and Fujitora", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kin'emon seems to have a fox theme, as his epithet \"Foxfire\" (狐火, kitsune-bi), fighting style and Devil Fruit ability to disguise himself and others are associated with the kitsune of Japanese folklore.", "elements": []}, {"text": "His favorite food is O-Tsuru's O-Shiruko.", "elements": []}, {"text": "For his official introduction, the regular information box was replaced by a Japanese scroll with his details on it. Since then, every member of his party had the same information box variant except Momonosuke's initial, fake introduction.", "elements": [{"text": "His introduction as \"Donquixote Doflaemon\" (ドンキホーテ・ドフラえもん, Donkihōte Dofuraemon), his Doflamingo disguise, also had the regular information box.", "elements": []}]}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Kin'emon's name was taken from Oda's favorite Japanese actor Nakamura Kinnosuke.", "elements": []}]}], "images": []}]}