{"sections": [{"title": "Z", "level": 1, "content": [{"type": "paragraph", "text": "Z, real name Zephyr also known as \"Black Arm\", was the leader and founder of the Neo Marines as well as a former Marine admiral and instructor before his resignation."}, {"type": "paragraph", "text": "He served as the main antagonist of One Piece Film: Z."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Z is a large, muscular, tan-skinned man, standing around twice the height of a typical man such as Luffy, with short purple hair and a large mechanical right arm connected to the left hip with converted mast rigging. Underneath that mechanical arm is a regular-sized and pitch black prosthetic arm. He dressed in a Marine-like coat with his Jolly Roger impressed on it, baggy trousers tucked into his boots, and a pair of triangular sunglasses."}, {"type": "paragraph", "text": "He suffered from breathing problems due to his age, requiring the need of an aerosol."}, {"type": "paragraph", "text": "As a Marine admiral, his standard outfit consisted of a purple suit with a Marine coat draped over his shoulders like a cape, his arms not in its sleeves. Z also wore a pink shirt with a polka-dotted tie under his purple suit. Like Garp and Tsuru, his coat has uniquely colored epaulletes with his own being blue."}, {"type": "paragraph", "text": "At age 28, Z kept his marine coat draped over his shoulders and wore a white V-neck shirt with the marine logo printed on it."}, {"type": "paragraph", "text": "During his time as a young man at the G-5 unit, Z was smaller and less muscular and wore a standard low ranking marine's uniform, consisting of a white short-sleeved shirt emblazoned with the Marine emblem, a simplified seagull with \"MARINE\" underneath it, on the back; a blue neckerchief; dark blue trousers; and a baseball cap with \"MARINE\" across the front. He was seen carrying a rifle and a backpack."}, {"type": "paragraph", "text": "When he was a child, Z played the role of his hero, Z. He wore a red helmet on his head with the \"Z\" letter placed in front, as well as big glasses. He wore a sleeveless yellow shirt, light blue shorts, brown boots and white gloves. He also carried a wooden sword and he had a wooden prosthesis attached on his right arm."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Z believed deeply in justice and heroism, having joined the Marines simply to fulfill both desires, and resigning eventually when he realized the organization was not as just as he had hoped. According to Garp, Z was the strongest believer of justice."}, {"type": "paragraph", "text": "Originally a happy person, being popular among his subordinates and having created a loving family, his life changed for the worse when his wife and son were murdered by a pirate, and later all but two of his cadets killed and his right arm severed by another, the latter who would become a Shichibukai. Such loss and injustice led to a deep hatred towards pirates, and after he left the marines he formed a group to take matters into his own hands and annihilate them all, even if it also meant opposing the World Government and the Marines. His hatred led to irrational acts such as plotting to destroy the New World to eradicate his enemies at the cost of countless innocent lives."}, {"type": "paragraph", "text": "He believed that pirates must be eliminated on sight, and that merely imprisoning them was ridiculous. His loathing was so strong that he would go to the extremes to achieve his agenda, whether physical, like stealing a powerful weapon from the Marines, or moralistic, like raising a jolly roger himself. He also claimed that even if Monkey D. Luffy defeated him, no-one would recognize him because he is a pirate, so firm is his belief in the worthlessness of pirates."}, {"type": "paragraph", "text": "Z heavily believed in the power of dreams. His ultimate ambition was to end the Great Age of Piracy, which he planned to achieve by destroying the three geographic Endpoints of the New World with the Dyna Stones and releasing enough magma to utterly destroy the fabled One Piece, a plan he called the Grand Reboot. Despite his claims, he appeared to be aware that his plan would fail, and he told Luffy that he was simply happy that his plan went that far."}, {"type": "paragraph", "text": "Z exhibited bravery to the point of fearlessness throughout his life. Even at his old age, he faced a whole elite marine platoon led by admiral Kizaru without hesitation or concern. During his earlier battle against Kizaru at Firs Island, he admonished Kizaru as having become overconfident since he became an admiral, a rare attitude to take against such a formidable opponent."}, {"type": "paragraph", "text": "Despite his loathing for pirates, Z had a great sense of honor, loyalty and respect to everyone, even his enemies, and was noble in character to the bitter end; his last act, after having fought evenly with Luffy to a standstill, was to give up his life to buy time for his Neo Marines and the Straw Hat Pirates to escape from Kizaru, having come to respect the latter after their final battle.  "}, {"type": "paragraph", "text": "Lastly, Z also loved alcohol, as shown during his encounter with Kuzan. His favorite drink is Jerez, of which he drank a bottle prior to his last fight with Luffy."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "At age 38, Z got married, and one year later his son was born. He loved his wife and son very dearly, and after they were killed at the hands of a pirate, he wished to resign his position as an admiral out of grief. However, he was persuaded to stay as an instructor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/Zephyr%27s_Family.png/revision/latest/scale-to-width-down/210?cb=20130706054101", "caption": "A photo of Z's wife and son before they were murdered by a pirate."}]}, {"title": "Organizations", "level": 3, "content": [], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "During his time as a Marine, he was very popular with and well regarded by his subordinates."}, {"type": "paragraph", "text": "Z left a legacy behind him when he finally quit the marines, as many younger marines, and a good number of veteran and elite officers of vice admiral rank and higher, looked up to him. Many of these men regretted having to fight their former instructor as they confronted him for his final fight. Doberman, a notably grim and stoic officer, even shed tears as he partook in Z's death."}, {"type": "paragraph", "text": "Sakazuki, Borsalino, Kuzan, Momonga, Doberman, Onigumo, Comil, Yamakaji, Strawberry, Hina, Smoker, Ain, and Binz were all trained by Z in his capacity as an instructor. Some of them refer to him as \"Sensei\", showing respect for him, and Ain, Binz and Shuzo, closest among his students, resigned from the Marines with him to support his cause."}, {"type": "paragraph", "text": "Z had a great impact on the future admiral Aokiji during his training. Kuzan deeply respected him as a result and although he opposed his former teacher's plan to destroy the New World, he never once attacked him. Aokiji also claimed that he drank Z's favorite drink, trying to be as cool as he was. In the end, Kuzan helps him protect Ain from the wrath of the marines by erecting an ice wall between her and Z, and consoles her and Binz in the wake of his death, speaking of his greatness. However, he claimed without doubt that Z's actions were crazy."}, {"type": "paragraph", "text": "Notably among his students, Z harbored disdain for Borsalino, from their days as instructor and recruit right up to their opposition as terrorist and admiral, and stated emphatically that he never could get along with him. Borsalino had high respect and admiration for Z nonetheless, who taught him valuable lessons in his early years, and continued to respect him even after his defection. Borsalino enjoyed testing his strength against Zephyr in training, and whether in spite of or because of the tension between them, he showed no regrets as Admiral Kizaru seriously fought him and killed him during the last encounter of his life. Borsalino bid Z a final respectful farewell before mortally wounding him."}, {"type": "paragraph", "text": "Fleet Admiral Sakazuki had great respect for his former mentor and quietly wished that he didn't have to kill him once Z became a threat. However, during the meeting of the marine top brass concerning his defection, he stated without remorse that Z is now an enemy and sanctioned his elimination as necessary."}, {"type": "paragraph", "text": "Monkey D. Garp and Sengoku, marines who were not young enough to be instructed by Z but who did follow him in their careers and looked up to him as an example of bravery and justice, shared positive feelings about Zephyr regardless of his betrayal, though they both also showed concern for his wrathful will to destroy the New World. "}], "images": []}, {"title": "Neo Marines", "level": 4, "content": [{"type": "paragraph", "text": "Despite feeling the Government and Marines betrayed his beliefs by siding with pirates, Z was caring, trusting, and loyal to his subordinates and ultimately gave his life in battle with Kizaru to give the Neo Marines time to escape. He showed no concern that Shuzo might give away information to the marines after he was captured."}, {"type": "paragraph", "text": "Ain, as his right-hand woman, greatly respected Z, showing no pause in quitting the Marines to join his cause, even as it meant becoming criminals in the eyes of the World Government. She referred to him exclusively as \"Z-Sensei\". She attempted to aid Z when he chose to stay back and buy time for the Neo Marines and the Straw Hats to escape, but was prevented from doing so by a wall of ice created by Kuzan. Ain cried, though showing great emotional restraint all the while, as she paid her respect to Z's grave afterwards."}, {"type": "paragraph", "text": "Binz, Z's other greatest student, shared in his hatred toward pirates, and showed just as much respect towards him as Ain, referring to him as \"Z-Sensei\". "}, {"type": "paragraph", "text": "At his last stand, Z apologized to Ain and Binz for asking so much of their time and effort, whether they gave it willingly or not."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Having his beloved family killed by pirates and a score of his students slaughtered and his arm severed by another, the latter of whom was (in Z's opinion, unjustly) promoted to the ranks of Shichibukai left Z emotionally traumatized and embittered towards piracy, developing a deep-seated loathing and a wish to exterminate them all."}, {"type": "paragraph", "text": "Adjacent to this, Z thought of the Yonko as fools who held no true power over the New World, and aimed to destroy them and their empires along with all other pirates. He especially referred to his desire to kill Shanks during his second fight against Luffy, as the pirate who inspired Luffy to lead a life of piracy and is in some way responsible for his dangerous actions."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Over the course of One Piece Film: Z's events, Z and his Neo Marines fought against the Straw Hat Pirates several times. The crew first encountered him when he was drifting badly injured on the sea. Z was grateful to the group for treating his wounds and praised Chopper's medical skills. However, his friendliness towards them immediately curdled and turned to furious hostility when he realized they were pirates. Once his men arrived to collect him, Z attempted there and then to obliterate the Straw Hats."}, {"type": "paragraph", "text": "Initially, Z judged Luffy unworthy of the title of Pirate King after easily defeating him. Z remarked that Luffy's straw hat was getting really old when he noticed it, showing an awareness of its history, and also mentioned Shanks when Luffy tried to reclaim it during their second meeting. At the end of his final battle with Luffy, Z changed his judgement and he declared Luffy a worthy opponent and allowed the Straw Hats to escape alongside his subordinates in his last stand against the Marines."}], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Z resigned his position as a marine instructor in the wake of the Government offering to the pirate who cut off his arm a seat among the Shichibukai. Although he was still respectful of some of his students and former subordinates, Z regarded the World Government on the whole as spiritually weak, and their actions a betrayal to the notion of Justice."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the leader of the Neo Marines, Z had complete authority over the crew; an armada of several hundred warships, with three Devil Fruit users and a Pacifista army as part of the crew. He also managed to steal the Dyna Stones from the Marines, explosives capable of destroying an entire island and said to have power to rival the Ancient Weapons, increasing his group's lethality."}, {"type": "paragraph", "text": "In the past he was a Marine admiral, which meant his command over the soldiers within the organization was once the second highest, just underneath the fleet admiral, and he was once crowned as the World Government's greatest military power, being among the strongest individual fighters within the government and Marine organizations of his time. He also had the authority to issue a Buster Call on any island he deemed a threat, and could give that authority to any World Government agent. With his resignation, he forfeited such privileges."}, {"type": "paragraph", "text": "After his resignation and prior to becoming an extremist, he was requested to stay in the military as an instructor, and he trained many powerful cadets who would become high ranking officers, and even after defection his legacy left many of his former disciples showing genuine remorse at having to fight their instructor, indicating he was an excellent and charismatic teacher."}, {"type": "paragraph", "text": "Despite lacking a Devil Fruit power, he had a vast knowledge about them. Similar to Lucci before him, he was able to quickly understand the mechanics behind Luffy's Gear Second and advised Borsalino to not rely on the powers of the Pika Pika no Mi so much."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Alongside Garp, Sengoku, and Tsuru, Z was one of the most powerful Marines of his generation. Despite his old age, Zephyr had tremendous physical prowess. He could charge at his opponents with great speed despite his size and the extremely heavy Battle Smasher prosthetic arm he carried. He was also capable of countering Luffy, Zoro, and Sanji's attacks despite fighting them inside of a small cabin, with none of the three strongest Straw Hats actually being able to land a direct hit."}, {"type": "paragraph", "text": "He had tremendous skills in hand to hand combat, using his physical prowess and Haki, to fight equivalently against Luffy's while in Gear Second, and able to follow Borsalino's movements despite his breathing problems. Even as a child, he was skilled enough to defeat bullies while playing as a hero. His strength was so immense that he was able to create large shock waves and craters simply by striking the ground, even without the aid of his Battle Smasher. His fighting skills also included the Rokushiki martial arts, which he mastered at age 28."}, {"type": "paragraph", "text": "Zephyr had tremendous endurance, able to survive an enormous explosion from a Dyna Stone that destroyed the island he was fighting on despite the blast rendering him comatose, and endure an onslaught of light attacks from Borsalino which left dozens of burning holes in his body before continuing to fight. He was able go toe to toe with Admiral Kizaru several times, and later showed extraordinary stamina by stalling Kizaru, several vice admirals and an entire battalion by himself—all without the Battle Smasher—before ultimately dying in the battle."}, {"type": "paragraph", "text": "He was aware of his age though, and after his final battle against Luffy he admitted that he has grown old and weak."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all Marines with a rank of vice admiral and above can use Haki, so Z could also use this ability. He mastered Busoshoku Haki at the age of 34, allowing him to coat himself with it and turn his arms black for much more devastating strikes and defenses, which earned him the nickname \"Black Arm\", and used it quite commandingly in a battle with Luffy. He could easily create a large crater on the ground with his fists."}, {"type": "paragraph", "text": "He was also easily able to break Kibin's Tekkai with a Haki-enhanced punch."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/80/Zephyr_at_Age_34.png/revision/latest/scale-to-width-down/210?cb=20140622025902", "caption": "Z (34 years old) gains his \"Black Arm\" epithet by using Busoshoku Haki."}]}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Like several other high-ranking Marines, Z had mastered the Rokushiki martial arts style, at the age of 28, Though tarnished by old age, Zephyr still retained a significantly high mastery of the Rokushiki. With the use of Tekkai and the Battle Smasher, Z could survive the massive detonation of a Dyna Stone despite being considerably close within the range of the explosion which was powerful enough to wipe out an entire island and was simply rendered unconsciousness from the impact. With his skill in Soru, Z could keep up with Kizaru's light enhanced speed and Luffy's Gear Second enhanced speed."}], "images": []}, {"title": "Weapons", "level": 3, "content": [], "images": []}, {"title": "Battle Smasher", "level": 4, "content": [{"type": "paragraph", "text": "He had a mechanical arm named the Battle Smasher, which he used as a powerful bludgeoning weapon. The weapon was constructed by Marine scientists after Z lost his right arm and was embedded with Seastone in order to effectively combat Devil Fruit users such as Logia-type users like Borsalino. Inside the Battle Smasher there was a destructive cannon as well as a machine gun turret. Beneath the Battle Smasher is a black, advanced prosthetic that is almost indistinguishable from the real arm that he had lost."}], "images": []}, {"title": "Dyna Stone", "level": 4, "content": [{"type": "paragraph", "text": "Z also stole the Dyna Stones, which are weapons of mass destruction. Each of them has power said to rival the Ancient Weapons in terms of mass destruction, and as the Marines' trump card they are considered extremely valuable to them. "}], "images": []}, {"title": "Flintlock", "level": 4, "content": [{"type": "paragraph", "text": "He also used a simple handgun which shot Seastone bullets."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Childhood", "level": 4, "content": [{"type": "paragraph", "text": "As a child, Z played the role of a hero of his own creation named \"Z\", as he defeated bullies while protecting a little girl and her doll."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dd/Zephyr_as_a_Child.png/revision/latest/scale-to-width-down/210?cb=20181025125705", "caption": "Z as a child playing the role of \"Hero of Justice Z\"."}]}, {"title": "Marine Service", "level": 4, "content": [{"type": "paragraph", "text": "Sixty years ago, a 14 year old Z enlisted in the Marines, desiring to become a hero. He eventually participated in his first battle four years later, in the G-5 Division. At age 28, Z realized that the Marines are not always heroes. Six years later, Z had mastered Busoshoku Haki. For this reason, he received the epithet \"Black Arm\"."}, {"type": "paragraph", "text": "Z became an admiral at age 38, during Gol D. Roger and Edward Newgate's golden age. By this time, he had become very popular with his subordinates. He got married, and a year later, his son was born."}, {"type": "paragraph", "text": "Z's happiness was ended prematurely when a pirate murdered his wife and son three years later. Z wanted to resign from the Marines, but he was eventually persuaded to stay as an instructor. He trained many cadets, most of whom would ascend the Marines bureaucracy in both power and status."}, {"type": "paragraph", "text": "Twenty-three years after the death of his loved ones, Z's arm was cut off by a pirate who had a Devil Fruit power, and his entire division was massacred with only Ain and Binz surviving."}, {"type": "paragraph", "text": "At age 70, Z received his mechanical arm from a government scientist and began hunting down pirates with Devil Fruit powers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/11/Zephyr_Loses_his_Arm.png/revision/latest/scale-to-width-down/210?cb=20130706054326", "caption": "Z screams after losing his arm and almost all of his division."}]}, {"title": "During the Timeskip", "level": 3, "content": [], "images": []}, {"title": "Forming Neo Marines", "level": 4, "content": [{"type": "paragraph", "text": "One year ago, the same pirate who severed Z's arm became a Shichibukai, prompting the instructor and former admiral to renounce the Marines in order to create his own group, the Neo Marines. With his new group they plotted to destroy all pirates."}, {"type": "paragraph", "text": "Sometime after the Neo Marines were formed, Ain and Shuzo dueled each other for the position of Z's right hand. Ain became the victor and Z appointed her as his second-in-command."}], "images": []}, {"title": "Z's Ambition Arc", "level": 3, "content": [{"type": "paragraph", "text": "Ain and Z learned Shuzo's fate from the newspapers. Ain told Z that she should have made herself clearer to him, apologizing. She then wondered if the Marines found out what they were up to. Z told her not to worry, that no amount of torture will make him or his men talk. Confident in his subordinate's loyalty, this setback did not bother him in the least. He then got a call on his Den Den Mushi, announcing they would be arriving at an island soon. Z promised the end of the New World was near, and he would kill every last single pirate in it. "}, {"type": "paragraph", "text": "Z and the rest of the Neo Marines arrived at Firs Island, and he was prepared to eradicate all the pirates in the New World."}], "images": []}, {"title": "One Piece Film: Z", "level": 3, "content": [], "images": []}, {"title": "Attack on Firs Island", "level": 4, "content": [{"type": "paragraph", "text": "Z was first seen singing a requiem, as he prepared for battle. His fleet of Neo Marines pushed past the defenses of Marine ships and invaded Firs Island. He made an open vow he would destroy all pirates before storming the beach, attacking waves of Marine soldiers that are flung aside. His subordinate, Ain, was shown fighting as well. She effortlessly dodged the soldiers' attacks and used two daggers to fight them. She gracefully defeated all the soldiers attacking her, and she then vowed to follow Z wherever he went. Binz was shown using his Devil Fruit abilities summoning large vines shielding himself from the barrage of artillery fire from Marine soldiers. He broke through their attacks, also stating he would follow Z."}, {"type": "paragraph", "text": "As Z pushed through the defenses, two members of the Giant Squad intercepted him. With his Battle Smasher arm, he easily overpowered both of them and took them down. Him and his solders then broke into the Marine base, and acquired the Dyna Stones. As his men began loading the weapons aboard their ships, Admiral Kizaru appeared and began a deadly onslaught, destroying their ships and blowing away the Neo Marine soldiers. Z rushed to their aid and clashed with Kizaru."}, {"type": "paragraph", "text": "Kizaru outmaneuvered him, sending a deadly array of explosive blasts at him but were deflected. As the two fight, Ain and Binz evacuated the Neo Marines onto the remaining boats. Kizaru asked how long it has been since the two last met, wondering what brings him to the island. Z warned that he relied too much on his Pika Pika no Mi power. Kizaru responded that he was still stubborn like a rock, addressing him as Master Zephyr. Z responded that he abandoned that name. The two clash fiercely, as Z told Kizaru he had become overconfident ever since he was promoted to admiral rank."}, {"type": "paragraph", "text": "Kizaru stated he did not come to dwell on the past, firing a light beam at him. He blocked it, charging forward and blows Kizaru to pieces with a powerful blast from his Battle Smasher. Z collapsed from the stress of the battle, using an inhaler to get his second wind. Kizaru teleported and attacked with his light sword, as Z pushed back showing signs of struggle. Kizaru confidently stated he could not match his speed with that heavy weapon. He began questioning what he wanted the Dyna Stones for, with Z remarking that even in the old days, he never liked him."}, {"type": "paragraph", "text": "Kizaru politely asked him to return what he took, with Z remarking that the Dyna Stones rival the power of the Ancient Weapons as he picked up a stray one and shattered it. Terrified, Kizaru tried to teleport away to safety, as Z hurled the exploding stone in his face the moment he reformed. The blast engulfed the entire island, destroying everything. Kizaru survived the explosion, while Z was blown far away."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b0/Zephyr_Fighting_Marines.png/revision/latest/scale-to-width-down/210?cb=20130706042803", "caption": "Z fighting Marine soldiers."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Borsalino_vs._Zephyr.png/revision/latest/scale-to-width-down/210?cb=20140722070942", "caption": "Kizaru versus Z."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/78/Firs_Island_Explosion.png/revision/latest/scale-to-width-down/210?cb=20140722071642", "caption": "The destruction of Firs Island."}]}, {"title": "Meeting the Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Elsewhere, the Straw Hats were acting silly and celebrating the sakura blooming on the Thousand Sunny. They entered a cloud of raining ash, caused by the explosion. Luffy spotted the battered body of Z clinging to life on a piece of wood out at sea, and tried to rescue him. When he grabbed a hold of his mechanical arm he becomes weak, so Sanji and Usopp pulled him aboard. Chopper examined him, but found out that he should be fine."}, {"type": "paragraph", "text": "Nami showed signs of suspicion, worrying that they picked up someone problematic. Robin noticed his arm was built out of Seastone, the reason why Luffy became weak when he touched him. Nami found it to be a dangerous thing, but Luffy and the others were in awe over it. Sanji reminded them all that Seastone was used against Devil Fruit users with him and Zoro debating whether to throw him overboard. Chopper defended him, with Luffy ordering him to save his life and that he would deal with him if he was an enemy. Z awakened later in Chopper's infirmary, with Zoro and Sanji standing guard outside."}, {"type": "paragraph", "text": "Z thanked Chopper for his care, calling him a great medic. Z met Luffy and immediately identified him as the ship's captain. Luffy asked him what he planned to do next, as Z told him he was carrying a Vivre Card and his comrades should find him soon. Luffy began asking questions about his mechanical arm, asking where he bought it."}, {"type": "paragraph", "text": "He told them about how he lost his arm to a pirate, and how Marine scientists helped build the new arm for him. He told Luffy its use against Devil Fruit users, able to weaken any foe once he gets a grip on them. He did comment that due to its heavy weight, it would be hard to survive if he fell into the ocean and only a special key can take it off him. Luffy asked if he was a Marine, to which he responded he had left them for being too old and was pursuing a different goal. Luffy commented it would be bad if he was a Marine, telling him they were pirates."}, {"type": "paragraph", "text": "Z was angered by this, and threw Luffy through the wall. He asked Luffy why he was a pirate, and Luffy proudly responded he would be the Pirate King. This comment infuriated Z, as he madly swung his Battle Smasher around. Luffy, Zoro, and Sanji all began fighting him with Z able to hold them all off with relative ease. Ain and Binz then arrived with a fleet of ships and board the Sunny, announcing that they would be confiscating it."}, {"type": "paragraph", "text": "Z overpowered the Monster Trio, as he held Luffy in his grip, helpless against him. He chastised Luffy's dream, telling him he would never be Pirate King with his strength. Curiosity piqued, he asked Luffy his name. When he told him, Z connected him as Garp's grandson and spared his life. He revealed to the Straw Hats he would destroy all pirates, as the Neo Marines began to attack the Sunny. With the ship being damaged and most of the crew unable to fight back, Luffy had them retreat. He freed Franky from his bonds, as he used a Coup de Burst to escape."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2c/Luffy_Meets_Zephyr.png/revision/latest/scale-to-width-down/210?cb=20151106121422", "caption": "Luffy and Z meet."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/15/Zephyr_Defeats_Luffy_Fight_1.png/revision/latest/scale-to-width-down/210?cb=20130706145941", "caption": "Z subdues Luffy."}]}, {"title": "Secon Island", "level": 4, "content": [{"type": "paragraph", "text": "Later, on Secon Island, a squad of Marine soldiers catch up to Z and ambush him. Z easily beats everyone around him, with Kibin clashing with him. He uses his Tekkai, but Z breaks his defense with the power of his Busoshoku Haki. The Dyna Stones explode, causing the volcano to erupt. Z informs his men that the destruction the Second Point has been a success and they only need to destroy one more island."}, {"type": "paragraph", "text": "Suddenly, Luffy appears. Luffy charges forth and attacks with his Gomu Gomu no Rifle technique. Z blocks it, showing mild surprise to see Luffy. Luffy demands Z change his friends back to normal, as Ain and Binz attack. Sanji and Zoro intercept them, fiercely battling them both. Z tells Luffy if he wants something, he has to take it like a pirate. Luffy and Z both strike, the shock setting off the volcano to explode forth with magma."}, {"type": "paragraph", "text": "Luffy tells Z he won't be able to catch him this time, entering Gear Second. Z sends a volley of bullets at Luffy that he dodges before attempting once again to land a hit. Z blocks him again, but this time using the power of his Armament Haki on his normal arm. He asks Luffy to become Pirate King if he has the determination to risk his life, and his friends. He knocks Luffy back, sending him running with more shots from his arm cannon. Growing more angry, he asks Luffy if he is willing to walk over his friend's corpses to achieve his dream before sending out a powerful blast."}, {"type": "paragraph", "text": "Luffy and Z clash furious blows, with Z mocking Luffy telling him if he keeps being afraid of his Battle Smasher, he'll never land any hits on him. He strikes the ground, sending Luffy flying away. He catches up and fires more bullets at Luffy that he deflects back at him. Luffy tells him his bullets will never harm him, until Z pulls out a small pistol and fires a bullet into his shoulder made from Seastone. Mocking Luffy further, he tells him the strongest people in the New World would never have let themselves be hit with it and he relies too much on is Devil Fruit power. He takes Luffy's hat, promising to bury it himself once he has finished destroying the age of pirates."}, {"type": "paragraph", "text": "Luffy tries to grab it from him, telling Z the hat was given to him by Shanks. He grabs Luffy in his powerful grips and tells him Shanks, along with the rest of the Yonko, will all die before they know what is happening. Luffy is enraged, screaming at him to not mock Shanks as Z blasts Luffy away. Zoro and the others find Luffy, and help carry him to safety and are able to escape the island before it is destroyed."}, {"type": "paragraph", "text": "Z is shown watching the island exploding from one of his ships, with Ain wondering of Luffy's fate. Z reflects on the One Piece and becomes angered over how much suffering and death its existence has brought to the world. That they consider it a symbol of freedom, but he will destroy that and bring a close to the great pirate age."}, {"type": "paragraph", "text": "Some time later, the Neo Marines arrive on Piriodo. Ain is seen watching over Z as he rested, until sometime later he meets with Kuzan singing a requiem. He tells Z he always hated that song, before giving him a bottle of his favorite wine as a peace offering. He tells Z he used to drink that because of him, looking up to him. He tells Kuzan to not lecture him, and he will go forward with his plan no matter what."}, {"type": "paragraph", "text": "Kuzan tells him he might die, as Z responds that is no problem if he can rid the world of evil. Z tells him to step aside, and the next time they meet they will share drinks together. Kuzan and Z face each other, but each side unwilling to fight one another as enemies. Kuzan backs down and leaves Z to his machinations."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bc/Luffy_vs._Zephyr_Fight_2.png/revision/latest/scale-to-width-down/210?cb=20130902175755", "caption": "Luffy vs. Z."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Zephyr_Takes_Luffy%27s_Straw_Hat.png/revision/latest/scale-to-width-down/210?cb=20130902180009", "caption": "Z takes Luffy's straw hat."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bc/Kuzan_Meets_Zephyr.png/revision/latest/scale-to-width-down/210?cb=20140722073843", "caption": "Zephyr meets Kuzan."}]}, {"title": "Z's Last Stand", "level": 4, "content": [{"type": "paragraph", "text": "The Straw Hats head out to intercept Z, pushing through the Neo Marine blockade around Piriodo. As the Straw Hats fight with the Neo Marines, Kizaru and a large fleet of Marines arrive on the island. Kizaru cheerfully says that he'll kill every one of the Straw Hats so Z is not disappointed. Meanwhile, Z himself is sitting in the mouth of the volcano surrounded by Dyna Stones placed to blow. After a swig of his wine, he stares eagerly at Luffy's straw hat awaiting his inevitable arrival. Luffy is shown fighting off more Neo Marines, trying to stop his advances. He uses his Haki, dodging multiple shots from cannons gradually getting closer towards Z."}, {"type": "paragraph", "text": "Luffy finally finds Z waiting for him inside the volcano. He discards his jacket, as the two engage in a furious battle. Luffy pounds away against his Battle Smasher arm, with Z calling his efforts useless. Their fight grows more intense, Luffy's shirt incinerating off him from Z's raw strength. He tells Luffy he cannot defeat his justice. Luffy unleashes his Gatling Gun punches, able to land a few brief hits on Z's body but he shows no sign of any harm."}, {"type": "paragraph", "text": "He compliments Luffy on having courage for a pirate, remarking he is far more brave than the Marines. Luffy inflates his fist to Gear Third, using his Gigant Pistol move at Z. Z matches Luffy's hit with his Smash Blaster, both unable to push each other back. Z begins showing signs of fatigue, as the two rush and smash each others fists against one another as hard as they can. The force of the impact sends rippling shock waves along the volcano."}, {"type": "paragraph", "text": "The Straw Hats catch up to the battle, seeing Luffy had managed to leave an imprint of his fist inside Z's giant metal fist. Z asks him why he wants to fight him so much. That even if he defeats him, nobody will thank him for his efforts for the stigma of being a pirate. Luffy responds if he can't defeat him, he will never be able to become the Pirate King. Z then discards his cracked Smash Blaster, revealing a smaller mechanical arm he can still use. Z tells Luffy he is going to dedicate his life to ending his ambition, challenging him for their final bout."}, {"type": "paragraph", "text": "Z and Luffy activate their Armament Haki, their arms turning a hardened black. The two engage in a brutal fist fight, both striking each other with imbued haki. Kuzan is seen watching their match from a distance, stating \"Black Arm\" Zephyr has returned. Z and Luffy both give each other hard punches to the chest and stomach, giving Luffy a moment to recoil and puke. Luffy strikes back a punch that knocks Z's glasses right off."}, {"type": "paragraph", "text": "A brief flashback is seen in his mind of his early childhood, rattling his early memories. Z becomes elated, that he is being given such a good fight. Both Luffy and him are worn out, still pushing each other with punches back and forth. He corners Luffy and begins pounding on him, with Luffy showing little sign he can defend himself anymore. As Z begins to gain the upper hand, Luffy pushes him back with a kick."}, {"type": "paragraph", "text": "Fighting on their last reserves, Luffy shouts he is going to be the Pirate King with Z shouting his name in absolute confidence. After exchanging a few more blows to one another, Luffy finally collapses from exhaustion. Z falls to the ground after, unable to fight anymore too. Z bitterly said he had gotten old, and his body could not keep up with him anymore. He found it disappointing, telling Luffy he was enjoying fighting him."}, {"type": "paragraph", "text": "As the battle ends, the Straw Hats rush over to Luffy's aid, with Ain and Binz doing the same for Z. Z tells Luffy to finish him, but Luffy merely tells him he's already satisfied, giving him a smile. He offers to continue fighting him, if he wants but Z turns him down, also being satisfied. Z apologizes to Ain for giving her so such work. Ain begins crying for him, telling him she's happy he is alright."}, {"type": "paragraph", "text": "Kizaru then arrives with his army, telling he was going to kill them all. Z said he was done everything he wanted to do, and now will face the price for it as he marched towards the Marine army. He dismissed Luffy, and told him to leave the rest to him. Ain tried to rush to his side, but Kuzan summoned a giant wall of ice dividing everyone from him. Z begrudgingly accepted he had been given a place to die, as he faced the Marines head on."}, {"type": "paragraph", "text": "Even near death, his raw strength overpowered all the soldiers around him. Kizaru unleashed his Yasakani no Magatama attack, filling the sky with thousands of beams of light that rain down upon Z. He was badly injured, filled with burning holes in his body, but still stood against them. The Marines began to weep, shedding tears for being forced to kill their teacher. Z announced he would give them all their last training lesson, as he barreled forth giving his all for one last battle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ea/Zephyr_vs._Luffy_Fight_3.png/revision/latest/scale-to-width-down/210?cb=20130902181828", "caption": "Z's final battle with Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/29/Haki_Battle_Luffy_vs._Zephyr.png/revision/latest/scale-to-width-down/210?cb=20130902181805", "caption": "Z and Luffy battle with their Haki."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Zephyr_Defeated_by_Luffy.png/revision/latest/scale-to-width-down/210?cb=20160328204830", "caption": "Z defeated by Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Zephyr%27s_Final_Stand.png/revision/latest/scale-to-width-down/210?cb=20130707070248", "caption": "Z's final stand."}]}, {"title": "Legacy", "level": 4, "content": [{"type": "paragraph", "text": "Z's Battle Smasher was used to make part of the cross on his grave. The fate of his Neo Marines army is currently unknown, but, thanks to his actions, Ain and Binz were able to escape from Borsalino and his Marine fleet. Though Ain and Binz mourn for their fallen leader, Kuzan comforts them that he was a great man and to never forget his sacrifice."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Zephyr%27s_Grave.png/revision/latest/scale-to-width-down/210?cb=20130707065655", "caption": "Z's grave."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Z vs. Edward Newgate (unseen)", "elements": []}, {"text": "Z vs. Gol D. Roger (unseen)", "elements": []}, {"text": "Z, Ain, Binz, and a Marine platoon vs. a future Shichibukai", "elements": []}, {"text": "Z vs. Firs Island's Marine platoon", "elements": []}, {"text": "Z vs. Admiral Kizaru (on Firs Island)", "elements": []}, {"text": "Z vs. Straw Hat Pirates", "elements": []}, {"text": "Z vs. Commodore Kibin and his Marine platoon", "elements": []}, {"text": "Z vs. Monkey D. Luffy (on Secon Island)", "elements": []}, {"text": "Z vs. Luffy (on Piriodo)", "elements": []}, {"text": "Z vs. Admiral Kizaru, Vice Admirals Momonga, Doberman, Comil, Onigumo, Strawberry and a Marine platoon (on Piriodo)", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "On the official One Piece Film Z website and on official merchandise by Toei Animation, Shueisha, and Bandai Namco for the film, Z's name is written as \"Zetto\" despite the film being called \"Z\". Both are pronounced the same way in Japanese, despite the difference in spelling, with \"zetto\" being the phonetic spelling similar to \"zed\". In the Funimation dub, Z is referred to as \"Zed\"."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Z shares his name with Zephyrus (Ζέφυρος), the personification of the west wind in Greek mythology.", "elements": []}, {"text": "He is the only known Marine admiral that has not eaten a Devil Fruit.", "elements": []}, {"text": "His favorite alcoholic beverage is Jerez.", "elements": []}, {"text": "He is currently the highest-ranked non-canon Marine.", "elements": []}, {"text": "He is the second movie antagonist who is a former Marine, the first being Gasparde.", "elements": []}, {"text": "Z also shares many similarities with the main antagonist of the movie Strong World, Shiki:", "elements": [{"text": "Both are the antagonists of movies overseen by Eiichiro Oda during the whole process.", "elements": []}, {"text": "Both's histories have been developed by Oda personally.", "elements": []}, {"text": "Both also have remarkable prostheses that double as weapons, with Shiki having two swords replacing his feet and Z having a huge mechanical arm.", "elements": []}, {"text": "Both characters have elements of ships on their own bodies, with Shiki having a steering wheel on his head and Z having two mast riggings across his chest.", "elements": []}, {"text": "Both are from Roger's era.", "elements": []}, {"text": "Both had four episodes related to their respective movies with their own sets of characters.", "elements": []}]}, {"text": "Z also shares some similarities with Edward Newgate:", "elements": [{"text": "Both are from Roger's era.", "elements": []}, {"text": "They were the same age (though Newgate died two years before Z).", "elements": []}, {"text": "Their last actions were to sacrifice themselves to save their comrades from the Marines.", "elements": []}, {"text": "Both were killed by a former subordinate with whom they once shared a mutual respect.", "elements": []}, {"text": "Their signature weapons served as their grave markers.", "elements": []}, {"text": "Both were dependent on medical support outside of combat.", "elements": []}]}, {"text": "In the 6th fan poll, Z ranked 81st.", "elements": []}, {"text": "Z may have been partly inspired by the real life Claude Dansey, also known as \"Colonel Z\" and codenamed \"Z\", who secretly established his own spy organization when he grew frustrated with the incompetence of MI6.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Z makes his debut.", "elements": []}, {"text": "↑  One Piece Vol. 1000, Z's age, estimated height (almost twice as Luffy) and history revealed.", "elements": []}, {"text": "↑  One Piece Movie 12, Z has to use an aerosol during the battle against Borsalino.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 and Episode 511, Fishbonen informs Koby that any Marine of Vice Admiral or higher can use Haki.", "elements": []}, {"text": "↑", "elements": []}, {"text": "↑  One Piece Movie 12, G-5 ships appears behind the young Z.", "elements": []}, {"text": "↑  One Piece Anime — Episode 577, Z and the Neo Marines arrive to Firs Island.", "elements": []}]}], "images": []}]}