{"sections": [{"title": "Yeti Cool Brothers", "level": 1, "content": [{"type": "paragraph", "text": "The Yeti Cool Brothers,Rock (ロック, Rokku) and Scotch (スコッチ, Sukotchi) are assassins who were employed by Caesar Clown until his defeat. They are members of a certain type of giants."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The brothers are a pair of furry giants, having long limbs and being covered in white fur all over their bodies except their fingers. It is unknown if they are actual yetis, although several characters believe them to be due to the strong parallels."}, {"type": "paragraph", "text": "Their height dwarfs that of many giants. One of the brother's footprints is larger than Brook, who stands at 277 cm (9'1\"). When the pair captured Franky under Caesar Clown's orders, Scotch held his entire 240 cm (7'10½\") frame in just one hand."}, {"type": "paragraph", "text": "They wear blue shorts and bowler hats which are frozen from the top. Rock appears to wear either a yellow tie or scarf."}, {"type": "paragraph", "text": "So far in the series, they have been perpetually covered in shadows from the shoulders up. However, their faces have been revealed in a minibook. Rock has straight, rigidly defined facial features resembling a moai. Scotch wears a gas mask with lenses and canisters that are visible even from his silhouette."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "The Yeti Cool Brothers are quite merciless as shown when they attempted to eliminate Brownbeard, Zoro, Sanji (in Nami's body), and Brook. They are willing to assassinate anyone they are asked to so long as they are compensated. They are shown to be loyal to Caesar, as they follow his orders without question, which implies diligence to their employers in general. They are also quite proud, and found it insulting that their targets, Luffy and Franky (in Chopper's body) were too busy fighting each other to notice the brothers attacking them. Despite their reputation, they are apparently not very thorough as they believed they successfully killed Zoro, Brook, and Sanji (in Nami's body) when they only rendered them unconscious."}, {"type": "paragraph", "text": "The pair are considered to be quite elusive, as Brownbeard said that no one knows what they look like and they never show themselves. When Scotch appeared before him, his face was completely shadowed. Rock, who was just outside, also had his face covered in shadows. Scotch has a habit of saying \"cool\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Caesar believed dispatching the brothers to be excessive to deal with the Straw Hat Pirates, so they are presumably strong and impressive fighters. They are, in of spite their tremendous stature, fast enough to instantly disappear from Luffy's sight and with enough subtlety to suddenly appear behind Nami and Chopper without either noticing. The pair even managed to defeat Zoro, Brook, and Sanji (in Nami's body) seemingly effortlessly (though they later admitted to ambushing them with KYP gas to immobilize them)."}, {"type": "paragraph", "text": "The brothers know the environment of Punk Hazard, and possibly other arctic environments, very well, and they successfully incorporate their frigid surroundings into their fighting styles, such as shooting at icicles to dislodge them on foes and fighting on cliff edges to trick and drive their foes off it. Even with these advantages however, they were shown to be no match for Luffy, even while he focused more on dealing with a rampaging Franky (in Chopper's body) than the brothers, in contrast to Caesar's original belief."}, {"type": "paragraph", "text": "Outside of battle, their furry bodies grant the brothers great resistance to the cold, which enables them to walk around the freezing part of Punk Hazard with nothing more than shorts and hats (which are visibly frosted over). On some colder days the pair do seem to note the chill and cold, however."}, {"type": "paragraph", "text": "In the anime, they were able to move at speeds rivaling Soru to evade Luffy's Gear Second attacks."}, {"type": "paragraph", "text": "Despite these abilities, they do not appear to be very resilient, even for their size: It only took one heavy attack each (Rock being hit by the tip of a mountain, thrown by Franky in an uncontrolled Monster Chopper state, and Scotch hit by Law's Counter-Shock attack) before they were both knocked completely unconscious."}], "images": []}, {"title": "Attack", "level": 3, "content": [{"type": "list", "elements": [{"text": "Tsurara Kenzan (つらら剣山, Tsurara Kenzan, literally meaning \"Icicle Needle-Point Holder\"): The brothers use their knowledge of the environment of Punk Hazard to lead their foes into falling off a cliff onto a bed of towering icicles where they will be skewered. This was first used in an attempt to kill a falling Luffy. In the FUNimation subs, it is called Ice Spikes.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "The brothers each carry a giant-sized rifle which appears to provide their primary method of attack. The standard rounds they use are explosive, but the pair also have specialized gas rounds that can cause intoxication and/or drowsiness. Rock also mentioned they have used poison gas."}, {"type": "paragraph", "text": "Scotch wears a gas mask, which protects him from their own gas-ammunition. He was also shown to wield a large knife, though his proficiency with it is unknown as Trafalgar Law electrocuted him before he could take a swipe."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Yeti Cool Brothers were summoned by Caesar Clown to deal with the Straw Hat Pirates, and they were first seen outside one of the abandoned labs that the crew was residing in. While Sanji, Zoro, and Brook were searching for Kin'emon, the brothers left giant footprints for them to follow. Once they reach the edge of a cliff, the brothers ambush them and fired KYP bullets, sending the three Straw Hats falling into section F-16, which had the icicle pincushion on a plateau."}, {"type": "paragraph", "text": "During a conversation with one of Caesar's guards, they erroneously inform him that they killed Nami, Brook, and Zoro and tell him to send a team to collect the bodies before heading off to where the kids are. When they reach the Straw Hats' hideout, Luffy discovers them and turns back, but not before the brothers attack Brownbeard and capture Nami (in Franky's body)."}, {"type": "paragraph", "text": "While Luffy and Franky pursue the brothers, they proceed to set up an Icicle Pincushion ambush. Luffy falls into the trap, but easily destroys it unharmed with a Haki-enhanced Gomu Gomu no Gatling Gun. Rock then fires several shots at Luffy, which he counters with Gomu Gomu no Thank You Fire, deflecting the bullets with enhanced force right back at Rock to his sufferance. Scotch then fires a shot at a mountain top, dislodging a massive ice shard over Luffy and Franky. Rock uses his as an opportunity to prepare another attack, but Franky (in Chopper's Monster Point) grabs the shard and smashes it into Rock, knocking him out cold. Scotch grabs Nami and starts making his way toward the plateau where the research facility is built. After reaching the plateau, he sees Trafalgar Law and appeals for his help. To his surprise, Law instead attacks him and after a short battle, cleaves him in twain at the waist with his powers and delivers a powerful electric shock that completely incapacitates him."}, {"type": "paragraph", "text": "After the events on Punk Hazard, the Yeti Cool Brothers' status is unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/34/Scotch_Prepares_to_Shoot_Brownbeard.png/revision/latest/scale-to-width-down/210?cb=20141206192601", "caption": "Scotch prepares to kill Brownbeard under Caesar's orders."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c0/Law_Cuts_Scotch.png/revision/latest/scale-to-width-down/210?cb=20141206185951", "caption": "Law cuts Scotch in half."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yeti Cool Brothers vs. Roronoa Zoro, Brook, and Sanji (in Nami's body)", "elements": []}, {"text": "Yeti Cool Brothers vs. Monkey D. Luffy and Franky (in Chopper's body)", "elements": []}, {"text": "Scotch vs. Trafalgar D. Water Law", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The size of the Brothers, or at least their feet, differ greatly between media. The big toe is about the size of Brook's afro in the manga, while even the smallest toe is larger than his afro in the anime."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "When Zoro, Sanji, and Brook found the Yeti Cool Brothers' footprints, they each had their own idea of what a yeti looks like.", "elements": []}, {"text": "The Yeti, or Abominable Snowman, is a legendary ape-like beast said to inhabit the Himalayan region of Nepal and Tibet.", "elements": []}, {"text": "Both of their names make reference to alcoholic drinks: Scotch whisky is often referred to simply as \"Scotch\", and \"on the rocks\" is a slang term for mixed drinks that call for ice.", "elements": []}, {"text": "Scotch has the same name as one of Kaido's subordinates.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/Imagining_a_Yeti.png/revision/latest/scale-to-width-down/210?cb=20150825202113", "caption": "Zoro, Sanji (in Nami's body), and Brook imagine what a yeti looks like."}]}]}