{"sections": [{"title": "Rob Lucci", "level": 1, "content": [{"type": "paragraph", "text": "Rob Lucci is a member of CP-0, having originally been the strongest member of CP9. Operating undercover to obtain the Pluton blueprints from Iceburg, he worked as a sawyer, treenail, and bolt specialist for Galley-La Company's Dock One."}, {"type": "paragraph", "text": "After his defeat by Luffy, he was dismissed from CP9 by Spandam, who declared him and the other assassins to be responsible for the Straw Hats' havoc on Enies Lobby. However, he managed to join CP-0 within the next two years."}, {"type": "paragraph", "text": "He is the main antagonist of the Water 7 Arc and one of the two main antagonists of the Enies Lobby Arc, along with Spandam. He also is one of the central characters from CP9's Independent Report Cover Page Serial, along with the rest of CP9 members."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rob Lucci is a tall and slim, yet muscular man with arched eyebrows and a close-shaved goatee. He has shoulder length wavy black hair that is sometimes tied in a ponytail. When he is not fighting, his pet pigeon Hattori is usually perched quietly on his right shoulder. He has a tattoo of a crossed-out square on each upper arm, as well as five cannonball scars on his back in the shape of the World Government symbol."}, {"type": "paragraph", "text": "He wore a large black top hat with a sepia band until he lost it during his fight with Luffy. As a shipwright, he wore brown trousers with caramel suspenders over a white tank-top and shoes with black toe-caps. As an assassin, he wore a two-piece black suit with the sleeves normally rolled up, complete with black leather shoes and a white tie and handkerchief in the breast pocket."}, {"type": "paragraph", "text": "When invading Iceburg's mansion he was wearing a bull mask and a light pink robe with thick sleeves and a yellow \"tie\" above."}, {"type": "paragraph", "text": "He was noted to be good looking by some women from Water 7 and Gatherine."}, {"type": "paragraph", "text": "Lucci was drawn as a child by Oda after a fan asked to draw the CP9 members as children. Oda drew young Lucci with the kanji for \"peace\" (平和, heiwa) on his shirt, which possibly suggests that the branch Lucci is holding is an olive branch in tribute to the type of branch held by white doves (in this case Hattori) as a sign of peace."}, {"type": "paragraph", "text": "The anime had also portrayed Lucci as a teenager in its rendition of his past story. Though the two portrayals of Lucci are meant to be him, they have different styles to them, mostly because Oda's version was drawn after the anime had already depicted him and not just because they show him at two different ages. Note that Oda did depict the silhouette of thirteen-year-old Lucci from the backside, though only briefly - this most likely is where the anime design for him originates."}, {"type": "paragraph", "text": "In CP9's Independent Report, he wore a light spotted shirt with a black coat over his shoulders and had bandages over his forehead and chest from his fight with Luffy and let his hair fall freely."}, {"type": "paragraph", "text": "After the timeskip, he wears a blue-white suit with a white coat draped over his shoulders. His beard has also grown longer and has a small ball on the end. In One Piece Film: Gold, he wears a little medal on the chest, during the Levely Arc, he wears a purple flower instead."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "During the time he was in Water 7 as a carpenter, Rob Lucci never spoke, preferring to instead talk through his pet pigeon, Hattori, using ventriloquism. However, after he revealed himself to be a CP9 agent he spoke normally, with Hattori becoming a regular pigeon that displayed some human qualities. Hattori always rides on Lucci's shoulder until Lucci begins fighting, at which point he will fly overhead until the battle is over. Lucci seems to have a rivalry with Paulie, and often chides him for having money problems. Because of this rivalry, the two often fight; however, the matches generally end before there is a victor. Other than this, however, Lucci appears to be very distant from everyone else, including the other foremen and Iceburg."}, {"type": "paragraph", "text": "Lucci comes off as a cold and collected CP9 agent, almost never displaying any emotions (nevertheless even he displays shock at the knowledge that Franky had the Pluton blueprints the whole time). A testament to his cold nature is his brutal assault on his friend of five years, Paulie, whom he even tries to kill after the CP9's identities were revealed. He is likewise shown smirking when telling an official that taking Nico Robin back will never happen, when convincing Kaku and Kalifa to eat Devil Fruits, as well as when he and Spandam realize Luffy was following them (probably because of his lust for battle.) He also states that he feels no true bond with the city he has lived in for five years, and he seems to have no feelings for his fellow CP9 colleagues, least of all Spandam."}, {"type": "paragraph", "text": "However, it appears that in spite of his seeming lack of emotions, Lucci does not like being insulted. During his fight with Luffy, he did not pay attention to Usopp until he started insulting him. In addition, he reacts rather violently if anyone calls him a gaki (slang in Japanese for \"kid\" or \"brat\"), responding with a kick and a retort both times after Iceburg and Franky referred to him as such. He also finds it offensive when someone shows weakness around him, as seen when he told the cowardly Marines on a Buster Call ship to shut up, and goes as far as to dismiss a new colleague by presumably killing him for being weak. The reason that he killed the five hundred soldiers in his past was due to another belief of his - the belief that weakness is a sin. Personally, he believes anyone who shows weakness is no better than a criminal. He also believes if he is involved then the situation means blood will be drawn and that he also does not have to accept the views and ideals of his superiors as long as he completes his missions efficiently."}, {"type": "paragraph", "text": "Lucci bases his outlook on justice on his personal philosophy that any person or thing that goes against the World Government's interests should be destroyed, but is also evil for being that way. Specifically, he has declared to serve a \"Dark Justice\" (闇の正義, Yami no Seigi), his motto being \"Necessary Evil\" (必要悪, Hitsuyō Aku)."}, {"type": "paragraph", "text": "In combat, he is a very sadistic and violent fighter, and also seems to derive amusement and gratification from inflicting physical and emotional pain on others, making him a typical sadist. These scenes, along with when he anticipates battle, are the only times where he seems happy at all. In the Tower of Justice at Enies Lobby, he reveals that he only joined the World Government so he can be legally allowed to kill people. An example of Lucci's lust for violence is when he compromised the mission of bringing Robin to the Gates of Justice by allowing Monkey D. Luffy to tail him, for the sole purpose of having a battle, smirking when Luffy burst through the door. Lucci's violent and cruel nature is also shown when he goes into full-beast mode during battle, in order to attack Luffy more violently. Another example of his sadism is when Lucci flooded the underwater passageway to the Gates of Justice in an attempt to kill the Straw Hat crew members in the passageway, because he wanted to eliminate Luffy's chances of having everything just to anger him. He has a habit of demoralizing and taunting his opponents, which is seen when taunting Luffy about the possibility of him killing Nico Robin. While in his full beast form he acts more like a bloodthirsty animal as seen when he mauled Luffy. Like Jabra, Lucci is prone to licking his lips, showing a more animalistic side to his transformation."}, {"type": "paragraph", "text": "Despite all this apparent lack of morality, he has displayed some, if very little, sympathy for those he dubs innocent. When the Candy Pirates were attacking a small village, he quickly dispatched the captain to save the people, though his demonstration of Absolute Justice later prompts him and his comrades to leave. This shows that deep down, he is not completely heartless. He also displays some morals such as when he shows disgust towards Spandam for assaulting Robin when she was unable to fight back, despite claiming to hunt her to the ends of the world. Likewise, he shows concern for his pet pigeon Hattori, sending him away when in dangerous situations. Lastly he expresses gratitude to the doctor who saved his life after his clash with Luffy on Enies Lobby."}, {"type": "paragraph", "text": "However, after the timeskip, Lucci has apparently discarded any compassion he had as seen by his disregard for Saint Charlos' attempts to claim Shirahoshi as a slave during the Levely. He maintains that the Celestial Dragons are divine and have the right to obtain what they want from normal humans. He also continues to enjoy the prospect of causing bloodshed as seen with his smirk at the order to kill Neptune when the latter tried to prevent his daughter's abduction."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Organizations", "level": 3, "content": [], "images": []}, {"title": "CP9", "level": 4, "content": [{"type": "paragraph", "text": "With the exception of Spandam, he seems to have no feelings for his fellow CP9 colleagues. Even though Spandam is a weakling, Lucci respects him as his boss. However, he does appear to harbor some disdain for Spandam, as seen when he deliberately neglects to stop Chimney from following them to the Gates of Justice because he received no order to do so (and presumably because of his own desire for a battle) and when he flippantly refers to Spandam as \"a certain idiot\" and wishes he could witness Luffy's excellent initiative as a leader. Spandam also believes in Lucci's strength and he always refers to him as the strongest member of the organization. He has a fierce rivalry with Jabra that is most evidently expressed by their opposing Zoan fruit forms. He also does not care for CP9's newest member, Nero, stating that his defeat was expected due to his inability to use the whole Rokushiki move set. He even decided to kill him after his defeat by Franky. Despite Lucci's reputation as a cold-blooded assassin, the rest of CP9 (excluding Spandam) seem to genuinely care for Lucci's well-being, evidenced in their efforts to raise money to help pay for an operation that Lucci needed to save his life and their celebration when he was discharged from the hospital."}], "images": []}, {"title": "Galley La Company", "level": 4, "content": [{"type": "paragraph", "text": "Lucci seemed to have had a rivalry with Paulie, and often chided him for having money problems. Because of this rivalry, the two often fought; however, the matches generally ended before there was a victor. Other than this, however, Lucci appeared to be very distant from everyone else. Upon the truth being revealed, Lucci had no qualm trying to kill Paulie and Iceburg, and even claimed that he feels no true bond with the city he has lived in for 5 years."}], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Lucci is extremely loyal to the World Government. The Government saw Lucci as a very important asset and his strength is acknowledged by them. Lucci was willing to do whatever it takes for their sake and he followed the doctrine of Absolute Justice; he believed that the 500 soldiers who surrendered to pirates were no different than criminals who deserved death, and the Government apparently did not argue with his unauthorized killing of them. However, after Spandam framed CP9 for his debacles, Lucci and his colleagues became fugitives of the World Government."}, {"type": "paragraph", "text": "As of the time skip, however, this seems to have been rectified, as Lucci has been reinstated and promoted to CP-0 and Spandam has become his subordinate. While Lucci is loyal to the World Government, he cares nothing about their goals, ideals, or desires, for he is only interested in his license to kill in order to satiate his bloodlust."}], "images": []}, {"title": "World Nobles", "level": 3, "content": [{"type": "paragraph", "text": "As a member of CP0, Lucci has absolute loyalty to the World Nobles regardless of their immense tyranny, believing that their status as gods privileged them to do whatever they wanted, even if it means enslaving a princess or assassinating a king. Thus, while Lucci dutifully obeyed Charlos' orders to enslave Shirahoshi and also to execute Neptune for his defiance, he did not interfere when Mjosgard, another World Noble, punished Charlos for his atrocity. However, the completion of a mission is more important to him than the well-being of the Celestial Dragons, as he completely disregarded the safety of Camael and Shalria and was more than willing to lose them to collateral damage if it meant accomplishing his goal."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Lucci along with the whole of CP9 is a major enemy of Nico Robin. However, Lucci was especially interested in arresting her. Lucci and Franky are enemies. Lucci was shocked to see Franky burn the blueprints of Pluton, resulting in his five year mission ending in failure. Finally, Lucci personally made an enemy out of the Straw Hats' captain, Monkey D. Luffy. The two engaged in a vicious battle at the tower of Enies Lobby. Lucci was an extremely formidable opponent and made Luffy exert himself through raw physical power more than ever before, to the point where Luffy was unable to move after the battle. Despite being enemies, Lucci seemed to respect Luffy's strength and determination, saying that it would have been boring for him to have died in the Buster Call bombardment and also added that Luffy is a worthy captain for having absolute faith in his crew and their ability to survive."}], "images": []}, {"title": "Iceburg", "level": 4, "content": [{"type": "paragraph", "text": "Iceburg was the holder of the plans to Pluton for four years after Tom's death. After those four years, he secretly gave them to the man who he thought to be dead, Cutty Flam. As this was done in secret, the government still believed that Iceburg was in possession of the plans. As such, he was forever pestered by officials who came to try and convince him to hand over the plans. After years of being stalked by government officers for the Pluton plans, the strongest divisions of the Cipher Pol were secretly sent for Iceburg."}, {"type": "paragraph", "text": "Without him knowing, four of the CP9 agents infiltrated Water 7 and disguised themselves to look like normal people, several even gaining entries into his trusted inner circle. Three more masked people entered the room and revealed themselves to be not only CP9, but also people that Iceburg trusted: Lucci, Kalifa, Kaku, and bartender Blueno. Lucci revealed his theory about the real Pluton blueprints' whereabouts, while Kaku felt his pulse and Iceburg's heightened and nervous reactions only confirmed it."}], "images": []}, {"title": "Candy Pirates", "level": 4, "content": [{"type": "paragraph", "text": "The crew invaded St. Poplar during one of their raids. Unfortunately for them, CP9 were in the town at the time, having escaped from Enies Lobby and ending up there. Rob Lucci attacked the captain while the other CP9 members struck out at his crew. However, the citizens became horrified when Lucci took the attack too far and began to show \"excessive justice\" against their captain by stepping on the pirate's skull."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Hattori", "level": 4, "content": [{"type": "paragraph", "text": "Why Hattori is with Lucci is unknown considering the man's reputation as a heartless mass-murderer, though Lucci has had him since he was a child. He apparently is not afraid of Lucci and is very loyal to him, as he stays close to his master even in dangerous situations like the Buster Call. When Lucci is not fighting, Hattori is usually perched on his master's right shoulder. Lucci would have had to express some emotions to blend in with citizens while undercover, but Hattori did this for him as his ventriloquist dummy; this allowed Lucci to be somewhat sociable while remaining emotionless. While Hattori reverts to being an ordinary pigeon after Lucci was revealed to be an assassin, he occasionally exhibits human traits such as drinking from a cup."}], "images": []}, {"title": "Spandam", "level": 4, "content": [{"type": "paragraph", "text": "During the CP9's independent report, the CP9 members made Spandam their enemy. They were unable to turn to the World Government for help as Spandam has dispatched pursuers to capture them so they could be blamed for the mission's failure. After defeating the Marines led by Very Good, Lucci contacted a physically crippled Spandam using a Den Den Mushi and promised to come for him very soon."}, {"type": "paragraph", "text": "However, he seems to have let go of his vengeance against Spandam, as they are now part of CP-0. However, with Lucci now being Spandam's superior, he does seem to treat him poorly, even going as far as to call his former boss annoying."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "As the strongest member of CP9, Rob Lucci's great power has been acknowledged even by Bartholomew Kuma of the Shichibukai, who said that none had expected Lucci to be defeated. Even at the tender age of thirteen, Lucci was already known to be a very capable mass murderer, having killed 500 soldiers and a crew of pirates single-handedly. It should be also noted that Rob Lucci is the strongest member of CP9 in history by far; with his Doriki at 4000, almost twice that of the second strongest member, Kaku's 2200. Franky also remarked that his strength is levels above the rest of CP9 and later that, if it were not for Luffy, he was not sure how many of them would have been slaughtered. Despite his first and currently only known loss to Luffy, it remains unknown whether or not Lucci's strength has changed during the timeskip. However he is now officially a member of the CP-0, which is considered to be the strongest and the most exclusive of the Cipher Pol's."}, {"type": "paragraph", "text": "Because of his reputation, he is a very valuable asset to the World Government, almost to the point of legend; the Vice Admirals even believe that he can survive a Buster Call attack."}, {"type": "paragraph", "text": "Along with his great superhuman prowess, Lucci is a highly intelligent and cunning individual, being able to become a master carpenter within a 5-year period merely as a form of espionage and surveillance over his \"boss\" Iceburg (who CP9 believed to have possession of the blueprints for the Ancient Weapon Pluton), and even when it was discovered otherwise, Lucci quickly deduced the next most likely candidate (Franky) based solely on their adolescent friendship. He and the other CP9 agents that infiltrated Water 7 deceived every single inhabitant, a clear sign of their manipulative skills."}, {"type": "paragraph", "text": "A sound tactician, Lucci manages to almost single-handedly eliminate the Straw Hat Pirates (excluding Luffy, who he was battling) by understanding the structure of his environment and firing a well-aimed \"Rankyaku\" through a stone wall, flooding the ground floor of the Tower of Justice and all its hidden underground passages with seawater. Had it not been for the unexpected arrival of Kokoro and her mermaid heritage, they would not have survived. He also quickly analyzes the mechanics behind Luffy's Gear Second technique after engaging it for just a couple of minutes at most, explaining it to the rubber-man and stating that such bodily pressure would shave years off his lifespan.  The fact he was able to reach the same level as the Galley La carpenters (who spend their whole life building their skills) in five years just to do an undercover job shows a great talent for it."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Due to years of extremely hard training in the Rokushiki martial arts since childhood, Lucci has tremendous superhuman physical prowess, vastly superior to other Rokushiki masters of the CP9 including Kaku and Jabra, Lucci has shown to have extremely sturdy and tough durability. At only the age of 13, he came out mostly unharmed without showing any signs of pain after being shot at from behind by multiple cannon shots, only receiving the scars on his back. He also possesses an incredibly high degree of superhuman physical strength, as he could send Franky, a powerful cyborg, flying with a kick. He could block Sanji's kick with his forearm without using Tekkai. Lucci also easily caught Luffy's face with one arm while at the same time, shrugging off all his punches, and then casually threw him into a wall."}, {"type": "paragraph", "text": "During a brief confrontation against those who were trying to defend Shirahoshi from Charlos, Lucci was able to catch Leo, who is a very fast and small dwarf, and kick away Sai, the leader of the Happo Navy, with no effort."}], "images": []}, {"title": "Carpentry", "level": 3, "content": [{"type": "paragraph", "text": "Since Lucci worked as a shipwright during his mission on Water 7, this means that he has some carpentry skills and has knowledge about ships. He worked as a sawyer, treenail, and bolt specialist. He, along with Kaku, was able to recognize that the Pluton blueprints Franky revealed on Enies Lobby were indeed real."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Lucci has immense mastery of Rokushiki, having developed more powerful variations from each of the different forms, such as Rankyaku Hyoubi and Tobu Shigan: Bachi. Lucci is a child prodigy of the Rokushiki martial arts, and at thirteen years old, he was able to skillfully use both Soru and Shigan to slaughter over 500 soldiers, fatally piercing their armors along with their bodies. Using Tekkai, he can block and break blades from several pirates completely unharmed and even survived multiple direct cannon blasts to his back. By adulthood, Lucci's extraordinary skill in the Rokushiki allows him to used improved variations of the six forms, and even used the Rokushiki hidden technique, Rokuogan, during his fight with Luffy. The massively powerful technique is so strong that it causes severe internal injury to Luffy's body, who described its effect as an Impact Dial with greatly amplified power, which is no small feat considering that he is made of rubber. With his complete mastery of Rokushiki, in conjunction with his Devil Fruit ability, Lucci proved to be a resilient and formidable foe, fighting on an equal footing with Luffy in Gear Second, and literally forcing him to exert every ounce of strength against him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Shigan_Infobox.png/revision/latest/scale-to-width-down/210?cb=20150318204815", "caption": "Lucci effortlessly dispatches Paulie."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Rob Lucci ate the Neko Neko no Mi, Model: Leopard, a Zoan-type Devil Fruit which allows him to transform into a full leopard, a bulky leopard-human hybrid and, by using Seimei Kikan, a slender leopard-human hybrid. As Zoan class Devil Fruits enhance physical capabilities the most, it is most favored by martial artists like Lucci. Also, being a carnivorous animal, Lucci is more bloodthirsty and predatory than a regular Zoan class user, proven when he mauled Luffy as an actual leopard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Lucci_Mauls_Luffy_in_Leopard_Form.png/revision/latest/scale-to-width-down/210?cb=20130121002334", "caption": "Lucci mauling Luffy as a leopard."}]}, {"title": "Seimei Kikan", "level": 3, "content": [{"type": "paragraph", "text": "It has been revealed that Lucci can perform Seimei Kikan, like Kumadori, and use it to alter his body into forms that amplify his skills in a specific Rokushiki ability. However, only the Kami-e Form, which makes his man-beast form smaller and thinner, more like an average man-size, has been seen."}], "images": []}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Lucci possesses the ability to use Busoshoku Haki. He showed this ability in One Piece Film: Gold, where he hardened his arm while fighting Sabo. He also uses this type of Haki in One Piece: Burning Blood."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Lucci possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Early Years", "level": 4, "content": [{"type": "paragraph", "text": "Twenty years before the start of the series, an eight-year-old Rob Lucci (alongside a ten-year-old Blueno and a fifteen-year-old Jabra) trained in the Rokushiki style and in assassination with the other CP9 hopefuls on Guanhao around the time of Roger's execution. They trained hard in order to be \"stronger than justice\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/Rob_Lucci_Young.png/revision/latest/scale-to-width-down/210?cb=20130121001620", "caption": "Lucci during his training as a child."}]}, {"title": "The Island Raid", "level": 4, "content": [{"type": "paragraph", "text": "When Lucci was thirteen years old, a kingdom had five hundred of its soldiers taken hostage by a pirate crew, with the captain demanding to be made the new king of the kingdom. As the government saw the king beginning to admit defeat, they sent in Lucci to deal with the situation."}, {"type": "paragraph", "text": "He infiltrated the prisoners' holding ground and killed all five hundred hostages in the room, thus neutralizing the possibility of a trade and eliminating the soldiers that Lucci believed to be weak. He then mercilessly slaughtered the entire pirate crew and took the captain's head as proof. During the confrontation, the crew fired upon him with firearms which left him with the noticeable scars across his back. The fact that he survived these shots was the first indication to the World Government of how strong Rob Lucci would turn out to be."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fe/Rob_Lucci_Slaughters_Soldiers.png/revision/latest/scale-to-width-down/210?cb=20140910022007", "caption": "Teenage Lucci's massacre of soldiers."}]}, {"title": "CP9's Secret Mission", "level": 4, "content": [{"type": "paragraph", "text": "Five years before the current storyline, CP9 agents Lucci, Kaku, Blueno, and Kalifa took guises in the city of Water 7. As part of his mission, Lucci infiltrated the Galley-La Company by applying for a job as a shipwright in the attempt to retrieve the blueprints for Pluton from Iceburg, mayor and former pupil of legendary shipwright, Tom. He became a treenail specialist. He later became famous and a well-respected member of the Galley-La company."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the pirate Mikazuki refused to pay for Galley-La's repairs on his ship, Lucci and the Galley-La workers beat them up."}, {"type": "paragraph", "text": "Later, Paulie tried to repay some of his debt by stealing money that the Franky Family had stolen from the Straw Hat Pirates, but after speaking with the Straw Hats, Lucci caught him and berated him, speaking through Hattori. Lucci then brought the money back to the Straw Hats, and hit Paulie for good measure. Paulie attacked Lucci with Rope Action and slammed him into the ground, but Lucci broke his fall with one arm. Refusing to fight, Lucci and Paulie accompanied Iceburg as he gave the Straw Hats a tour of the Galley-La Headquarters. He was later present with Paulie and Iceburg as Kaku reported that the Straw Hats' ship Going Merry was irreparably damaged. Luffy wondered if they could build an identical ship, but Lucci said that no two ships could truly be identical. Later, Corgi came to talk to Iceburg, and Paulie wondered what he wanted, but Lucci said it was none of his business. Luffy and Nami then screamed as they realized that all their money was stolen, and Lucci tried to quiet them down."}, {"type": "paragraph", "text": "The next morning, Lucci sat by Iceburg's bedside as the mayor recovered from shot wounds he had obtained the night before. Eventually, Iceburg woke up, and he told Lucci, Kaku, Paulie, Peepley Lulu, and Kalifa that he saw two assailants, one being in a mask and the other being Nico Robin. Lucci then told Iceburg that he heard that Robin came as a member of the Straw Hats, causing Iceburg to pin the blame on the crew. Tilestone then came into the room and revealed that the Straw Hats were currently fighting Franky at Dock 1. Lucci, Kaku, Paulie, Lulu, and Tilestone then went to Dock 1, where they interrupted Luffy and Franky's battle. The team prepared to fight as Luffy and Franky confronted them, and as the fight progressed, Lucci attacked Luffy with several punches. Luffy tried to counterattack, but Lucci responded with a powerful swing that sent the Straw Hat flying. The team then accused Luffy of attacking Iceburg, and refused to believe his denials, preparing to take him out. Luffy leaped onto a platform being held up by a crane after Tilestone shot at him, but Lucci leaped at him with a saw and cut the ropes holding the platform. However, Franky then returned and attacked the shipwrights for interrupting his fight with Luffy, destroying more of the dock and allowing the Straw Hats to escape in the chaos. After the chaos ceased, Paulie had all the Galley-La workers patrol the island in order to catch the Straw Hats."}, {"type": "paragraph", "text": "As night fell and Aqua Laguna arrived, Lucci, Kaku, Paulie, Lulu, and Tilestone guarded the entrance to Iceburg's room. Iceburg then called Paulie into his room, and the shipwrights talked among themselves while Paulie was inside. Paulie then left to handle some business elsewhere. Soon after, Robin contacted the four CP9 agents to proceed with their plan once they got her signal. A massive explosion rocked Galley-La Headquarters, and Lulu and Tilestone raced to catch the perpetrator, leaving Lucci and Kaku behind. Lucci and Kaku then donned disguises and killed several people, two of whom they disguised as themselves. They went to the treasure room where Paulie was sent, and ordered him to give them the item that Iceburg had sent him to retrieve. Paulie did not know their identities, and they revealed to him they were from CP9. Lucci and Kaku easily overpowered Paulie in battle, but Paulie revealed as he collapsed that the document he had been sent to retrieve was a fake. Lucci and Kaku prepared to kill Paulie, but Luffy suddenly came flying in through the wall. Luffy confronted Lucci and Kaku, but Lucci managed to hit him with Rankyaku before pulling out several U-shaped stakes, which he plunged into the ground around Luffy's body in order to trap him. Not having time to stay, Lucci had Kaku trap Paulie with the same method before the two of them walked out, and Lucci contacted Kalifa, Blueno, and Robin, saying to hold off on shooting Iceburg since there was a hitch in their plan."}, {"type": "paragraph", "text": "As they returned to Iceburg's room, Lucci retrieved his hat from his dead body double before he, Kaku, Kalifa, and Blueno confronted Iceburg in their disguises alongside Nico Robin. The four agents then unmasked themselves before interrogating Iceburg on the whereabouts of the blueprints for Pluton. Lucci stated that they would be sure to execute their mission quickly and told Iceburg not to resist, revealing to him the true capabilities of the secret CP9 agency. He then revealed that the World Government intended to bring back the Ancient Weapons to use against pirates, and when Iceburg argued against this, Lucci kicked him in the face. As he had Kaku ensure check Iceburg's pulse, Lucci then theorized who held the real Pluton blueprints: Iceburg's fellow disciple from Tom's Workers Cutty Flam, now known as Franky. Lucci then confirmed his theory due to Iceburg's increased pulse, and the agents prepared to go find Franky, but were suddenly confronted by Luffy, Paulie, and the Straw Hats as they burst through the walls."}, {"type": "paragraph", "text": "Lucci revealed to a shocked Paulie that they were actually government agents and the ones who assailed Iceburg. An angered Paulie attacked Lucci, but the agent brought his former fellow shipwright down with Shigan. Lucci stated that they had mastered an array of superhuman abilities known as Rokushiki, and as he was about to kill Paulie, Luffy suddenly kicked him. Lucci caught Luffy's foot, and Luffy tried attacking with rapid punches, but Lucci shielded himself with Tekkai. He then used Soru and Shigan to strike Luffy's neck, which would have killed him if he were not made of rubber, but Luffy quickly rebounded and pulled Paulie to him. Luffy angrily confronted Lucci, but the agents paid him no mind as they prepared to go and get Franky. Lucci then warned the Straw Hats that the Galley-La Headquarters would go up in flames in two minutes, and had his fellow agents confront them in order to kill them. The CP9 agents easily beat around the Straw Hats, and as Luffy tried to reach Robin, Lucci grabbed him by the face as he had Robin go outside. Lucci then threw Luffy into the wall as the agents prepared to leave before the fire started, and Lucci noted the vast difference in power between them and the Straw Hats. As the fire started, he showed them his Devil Fruit hybrid form, and with a Rankyaku he caused the entire top part of the headquarters to collapse. Paulie tried to rescue Iceburg from the wreckage, but Lucci and the agents confronted him. Paulie shouted that he thought they were friends, but Lucci replied that only he thought that as he prepared to attack. Luffy then raced in and punched Lucci, but Lucci injured him further with a claw-enhanced Shigan before throwing him out of the building into the city. He then blocked a sword strike from Zoro before throwing him out as well, and the CP9 agents tied Iceburg and Paulie up before going outside, where they watched the Headquarters burn."}, {"type": "paragraph", "text": "The agents then raced through the air to find Franky, and Kaku eventually noticed the Franky Family, causing Lucci to confront them in a mask. Lucci demanded they repeat what they were saying about Franky, and threatened to kill them should they not comply. After ascertaining Franky's location, the CP9 agents took out the Franky Family members before moving on. They came to the warehouse under the bridge, where they took out Mozu and Kiwi before confronting Franky. Blueno got into a scuffle with Franky, but Lucci kicked Franky out of Blueno's grasp when he saw that Blueno was attempting to kill the cyborg. Lucci revealed the truth about their identities to a shocked Franky before stating Iceburg was dead and demanding the Pluton blueprints from him. Franky attacked Lucci, but Lucci dodged before knocking him out with a massive uppercut. Franky's crash created a hole in the wall that led to a drafting room. As they searched through it, Franky confronted them, telling them not to go through the memories of Tom's old home. Lucci demanded that Franky tell them where the blueprints were, but Franky refused, causing Lucci to have Kalifa tie Franky up as he wrecked the drafting room, recalling how Franky and Tom committed crimes 12 years ago. When Franky protested, Lucci kicked him, and the two continue to disagree over Tom's status as a criminal. The agents then prepared to escort Franky to Enies Lobby, and Lucci had Blueno call Spandam so he could talk to Franky like he requested. After the call, the agents tied up Franky and prepared to take him out. They were confronted by Usopp, but Lucci managed to easily intimidate him. Kaku then beat Usopp up, and the agents released the Going Merry into the junkpile below the warehouse before capturing the distraught Usopp."}, {"type": "paragraph", "text": "Lucci and the CP9 agents then boarded the Sea Train to Enies Lobby with Franky, Usopp, and Robin in tow, throwing the latter two in a storage room as the train prepared to depart. Kalifa stated that their mission was almost completed, but Lucci chided her to withhold that talk until they arrived. As they got going, Lucci looked forward to departure despite living on Water 7 for five years. Corgi told CP9 that each of the other cars would be guarded by powerful government officials. However, they later got a report that the last two cars were disconnected by Sanji, who was on the train and had freed Franky. Blueno asked if he should check on Robin, but Lucci said they should focus on apprehending Franky, as he confidently asserted that they would never get Robin back."}, {"type": "paragraph", "text": "Later, CP9 watched as Sanji and Franky blew the defeated Wanze and Nero into their car before confronting them, and Lucci wondered who Nero was. Nero promised Lucci he would kill Franky, but Lucci reminded him that Franky was supposed to be captured alive. Not pleased by Nero acting on his emotions, Lucci gave the new CP9 agent three seconds to run for his life, and as Nero tried to use Soru to escape, Lucci easily struck him down. Nero fell out of the car into the ocean, and Lucci called him trash for not yet fully mastering Rokushiki before telling Kalifa to report that he was too weak. Lucci then confronted Sanji and Franky, telling them to give up on rescuing Robin because her past made her a threat to the world. Sanji angrily attacked Lucci for his remarks on Robin, but Lucci easily blocked him as he continued his sentiments that Robin should die. Robin then came into the car and told the intruders to leave, causing Lucci to laugh, and Usopp came and told Franky to cut the car loose in order to escape. He threw a Smoke Star to distract the CP9 agents, but as they cut the cars loose, the CP9 agents pulled them back together and attacked Sanji as Robin took their side. Franky tried to free Sanji, Usopp, and Robin again as CP9 recaptured him, but Robin was eventually brought back by Blueno. Eventually, the Sea Train approached Enies Lobby with Robin and Franky in tow, and Lucci got nostalgic as he saw the island for the first time in five years."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/CP9_Burns_Galley-La_Headquarters.png/revision/latest/scale-to-width-down/210?cb=20150713113147", "caption": "CP9 destroys Galley La headquarters."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e9/CP9_Invades_the_Warehouse.png/revision/latest/scale-to-width-down/210?cb=20140916081947", "caption": "CP9 reaches Franky's warehouse."}]}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Upon reaching Enies Lobby, Lucci escorted Franky and Robin to the Tower of Justice, where Spandam and rest of CP9 waited. The CP9 were all reunited at the Tower of Justice as Lucci confirmed that both Cutty Flam and Robin were in custody. Both Lucci and Jabra appeared to show rivalry between them while both Kaku and Kumadori told them to calm down and show affection towards their long seen friends. Fukurou then measured their strength in Doriki and he revealed that Lucci's number is 4000. Spandam interrupted them and showed them a chest with two Devil Fruits."}, {"type": "paragraph", "text": "Spandam then told the members of CP9 to go back to their rooms and rest. Lucci then told Spandam that he was not in the mood for a toast and had no interest in status or authority. Lucci said that their brand of justice existed for the World Government and that the government recognized Spandam as the leader of CP9 and it was their duty to complete their missions perfectly. However, Lucci went on to say that he did not necessarily have to support Spandam's ideals. Spandam then asked Lucci what he wanted. Lucci transformed into his animal-human hybrid form and answered, \"Blood,\" saying if he was there, even death was justifiable. Rob Lucci and the others then left to go to their rooms."}, {"type": "paragraph", "text": "When Spandam gave Kaku and Kalifa Devil Fruits, Lucci encouraged them to eat the fruits. He told them that regardless of the type of power, how they use it was what matters, adding that there was a very low chance the fruits would weaken them, and that being a \"hammer\" is not much of an inconvenience. He went on to say that some people sail their whole lives looking for a single Devil Fruit."}, {"type": "paragraph", "text": "After Luffy defeated Blueno and shouted for Robin, Lucci joined the remaining CP9 agents on the balcony and commented on how he was surprised how a pirate actually defeated Blueno. Lucci and the rest of CP9 members witnessed the Straw Hats' arrival on the rooftop and their challenge to CP9 and the World Government, much to his amusement. Franky revealed he had the blueprints and then burned them, shocking CP9. Before Spandam dragged Robin away, he told CP9 that they had permission to kill all of the invaders. He told Rob Lucci to come with him to take Robin, since he needed to be protected."}, {"type": "paragraph", "text": "Spandam, Lucci, and Robin walked down a spiral staircase, as Spandam kept mocking Robin. In the undersea passage, Spandam told Lucci that he heard a noise, wondering if it was his imagination. Lucci suggested that it might be the pirates breaking through the door. Spandam was astounded, saying that the door was solid steel, and that there was no way they could have found the door to begin with. Lucci told him that he remembered a small girl and her pet following them earlier, so she probably told them. When Spandam asked Lucci why he did not kill her, he smugly replied that he never received an order to do so. Spandam was annoyed, telling Lucci he should decide those things on his own. He then asked if that meant someone was following them."}, {"type": "paragraph", "text": "Spandam ordered Lucci to drag Robin over and pull her by the hair if necessary. Lucci grabbed her by the arm, telling her it was an order for her to walk. As they continued walking, they all heard Luffy calling out to Robin. Lucci told Spandam to take Robin and continue on."}, {"type": "paragraph", "text": "Lucci then confronted Luffy and initiated a second fight with him. The two engaged in an extremely hectic and boisterous fight from which Lucci still held a noticeable advantage where Lucci withstood Luffy's attacks and countered with twice as much power. Hearing Robin's warning about the incoming Buster Call, Luffy tried to force his way past Lucci to reach her, but Lucci fought back fiercely and stopped him in his tracks, forcing him to continue the fight. Luffy was later joined by Franky, but even with the added reinforcement, the two of them were still woefully outmatched by Lucci."}, {"type": "paragraph", "text": "Luffy was unable to hurt Lucci, who hit him with Shigan \"Oren\". Franky came to Luffy's aid by trying to hit Lucci with Strong Hammer, which was able to blow away Fukurou. Franky's move was unsuccessful and Lucci struck Franky. However, Luffy entered Gear Second and blew Lucci away. Luffy managed to keep Lucci at bay and allowed Franky to leave the room to chase after Spandam and Robin. However, Lucci still managed to gain the advantage when the Gear Second effect wore out, leaving Luffy in the same situation."}, {"type": "paragraph", "text": "At this point, Lucci flooded the tunnels with water by using Rankyaku to break the wall to stop Luffy's crew from escaping and taunted Luffy, asking him whether he would continue to fight or rescue his friends and promptly escaped to higher ground. Luffy pursued him, claiming that if he could not defeat Lucci, he could not protect any of his friends. The fight continued with Lucci easily countering every one of Luffy's attacks and thrashed him around so much he could barely stand anymore."}, {"type": "paragraph", "text": "Rob Lucci, confident that Luffy used up all his energy using Gear Second, remarked that he was helpless before him like so many other pirates. In response, Luffy chuckled and claimed that he was going to use a different strategy and activated Gear Third with Hone Fusen. Lucci questioned the importance of \"bone\", while Luffy simply continued with his preparations."}, {"type": "paragraph", "text": "Luffy claimed that his left arm turned into the hand of a giant. Rob Lucci was unfazed by what seemed to be an intimidation tactic. Lucci stood firm against Gomu Gomu no Gigant Pistol with his Tekkai but the momentum was simply too high to block. Luffy, using the humongous strength of Gear Third, punched Lucci so hard that he was flung all the way onto a Buster Call ship, almost passing out in the process. Nevertheless, he took advantage of Gear Third's lack of speed to quickly strike Luffy down with another Tobu Shigan \"Bachi\", causing Luffy to deactivate Gear Third. He then used Rankyaku \"Gaicho\" for the very first time in the air while Luffy was down on a Buster Call ship to finish him off, causing an explosion and cutting through steel on the ship."}, {"type": "paragraph", "text": "Luffy was fortunate that Lucci's attack missed. Rob Lucci, while using Geppo to hop in the air, commented that on whether Luffy was being serious or joking around. He then used Kamisori to get to where Luffy was and thrashed him again. While Luffy was down and still deflated from deactivating Gear Third, Rob Lucci said that Gear Third was a very unbalanced technique and that he said that Luffy was willing to take the hits in exchange for that power."}, {"type": "paragraph", "text": "He uses Seimei Kikan: Kami-e Bushin to make his hybrid form smaller and thinner and attacked Luffy with Shigan, crashing him to the wall and destroyed a part of it. While Lucci was choking Luffy who was stuck to the wall, he was going to say that his stupid attack was not going to hurt, but was interrupted when Luffy punched him, angering him and smashed Luffy into the wall further. With Luffy now completely stuck to the wall, Lucci commented that was unfortunate, but in Luffy's \"stupid\" form, he told him to die. Rob Lucci then attempted to end the fight quickly with Shigan \"Madara\", but Luffy returned back to normal just in time. Suddenly, Lucci partially collapsed, realizing that Luffy had managed to fracture both his legs with Gear Third."}, {"type": "paragraph", "text": "Now partially disabled, he was easily beaten down by Luffy. While Rob Lucci was hit by Luffy's Gear Second Gomu Gomu no Jet Pistol, he prepared to use the most powerful technique known to those who have absolute mastery over Rokushiki, using Soru and coming to a halt in front of Luffy. He then used his trump card, Rokuogan, to severely injure Luffy, evening the odds once again. Rob Lucci then attempted to finish Luffy off with another Rankyaku \"Gaicho\". Luffy continued to press the fight, but Rob Lucci said that his Gear Second technique was starting to lose its edge, claiming that it was impossible for Luffy to escape Enies Lobby after all. He then continued by saying that even if the island lost its shape, he would pursue Nico Robin to the ends of the earth and obliterate her or anyone who got in the way of the World Government, all in the name of \"Dark Justice\", while attacking Luffy with many Rankyaku shock waves. Luffy countered them with his punches and said that they had come so far to set Robin free from such a thing."}, {"type": "paragraph", "text": "He then attacked Lucci with Gomu Gomu no Jet Stamp, but it was evaded by Lucci's Soru. Rob Lucci then used another Rokuogan on Luffy to greatly damage him again, having him face down in a pool of his own blood. Lucci commented that he would still kill Luffy's crew no matter how hard Luffy tried to prevent him from doing so. Lucci remained confident even after Luffy got up again due to Usopp's encouragement and used Seimei Kikan: Kaijo to return to his giant, stronger form, saying that he would defeat Luffy with all of his power at once. He continued taunting Luffy by telling him not to worry about his friends as he would send every single one of them to hell."}, {"type": "paragraph", "text": "Continuing the fight with his opponent, he used Shigan \"Madara\" again, while Luffy countered it with his punches. After getting hit again by Luffy, he attempted to use Rokuogan again. Luffy, in Gear Second, tried to get out of its range and claimed that he would not get hit by the same attack again, but Lucci used his tail to prevent him from escaping the technique. Determined to end the fight once and for all, Lucci channeled all of his power into his next attack, the powerful Sai Dai Rin: Rokuogan, to greatly wound Luffy once more."}, {"type": "paragraph", "text": "Rob Lucci turned around after performing his ultimate attack on Luffy but was surprised to sense that Luffy was still standing upright behind him. He turned around to see Luffy unleashing a brutal Gomu Gomu no Jet Gatling. Rob Lucci attempted to use Tekkai to deflect the blows, but unfortunately for him, the enormous attack struck Lucci so hard and fast that it appeared he was being hit with dozens of fists at the same time. The attack smashed Lucci against and through a brick wall, leaving him unconscious and defeated."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Lucci_and_Hattori_at_Enies_Lobby.png/revision/latest/scale-to-width-down/210?cb=20061008104142", "caption": "Rob Lucci and Hattori at Enies Lobby."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Luffy_and_Lucci_Clash.png/revision/latest/scale-to-width-down/210?cb=20150923093051", "caption": "Luffy and Lucci clash."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Gomu_Gomu_no_Gigant_Pistol.png/revision/latest/scale-to-width-down/210?cb=20131205132431", "caption": "Lucci struck by Luffy's Gomu Gomu no Gigant Pistol."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/62/Sai_Dai_Rin_Rokuogan.png/revision/latest/scale-to-width-down/210?cb=20140606035324", "caption": "Rob Lucci unleashes Sai Dai Rin: Rokuogan on Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8f/Lucci_Defeated_by_Luffy.png/revision/latest/scale-to-width-down/210?cb=20140915112758", "caption": "Lucci is defeated by Luffy."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "CP9's Independent Report", "level": 4, "content": [{"type": "paragraph", "text": "Blueno used an Air Door at Enies Lobby while carrying an unconscious Lucci. Due to the severe and near fatal injuries he suffered in his battle against Luffy, Lucci was comatose. They were unable to turn to the World Government for help, as Spandam had dispatched pursuers to capture them so they could be blamed for the mission's failure. He was carried by Kumadori while the rest were walking along the Sea Train tracks and was in serious need of medical attention. They reached the city of St. Poplar, where the rest of CP9 tried to gather money for his medical fees by becoming street performers, with Kalifa becoming a street cleaner. They gathered enough money and Lucci was given his much needed medical attention. Lucci later woke up, much to the joy of his comrades."}, {"type": "paragraph", "text": "When he was discharged from the hospital, Lucci was seen expressing gratitude for the first time in his known life when he shook his doctor's hand. He was then seen bowling with the other CP9 members."}, {"type": "paragraph", "text": "Along with the rest of CP9, he attacked the Candy Pirates when they started ransacking the island. Rob Lucci knocked out the captain with a kick while the others took out their ship. However, he started going overboard and tried to crush the skull of the captain, much to the horror of the spectators. This made the group realize they could not stay on the island much longer. They departed with the Candy Pirates' ship and eventually settled on their homeland, Guanhao. They began watching the CP9's next generation and when Captain Very Good arrived to arrest them, they stood their ground against them."}, {"type": "paragraph", "text": "As CP9 battled and eventually defeated the Marine troops, Lucci contacted a physically crippled Spandam using a Den Den Mushi and promised to come for him very soon. With that, CP9 left Guanhao and set sail into the distance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Excessive_Justice.png/revision/latest/scale-to-width-down/210?cb=20190109042952", "caption": "Lucci deals excessive justice."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Sometime during the timeskip, Lucci was reinstated as a member of Cipher Pol."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "Lucci appeared among the brokers who were watching Caesar Clown's broadcast of his weapon Shinokuni. After Caesar's defeat at the hands of Luffy, Lucci told another person to inform the world about the the pirate alliance of the Straw Hat Pirates and the Heart Pirates."}], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Lucci reappeared as a member of CP-0. Lucci went to Dressrosa to recover evidence of Doflamingo's smuggling operation only to find that they were already taken. Lucci suspected that the revolutionaries were responsible."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Heart of Gold", "level": 4, "content": [{"type": "paragraph", "text": "CP-0 captured a girl named Myskina Olga, who could lead them to a valuable treasure called the Pure Gold that the World Nobles desired. One of Lucci's agents reported that they had lost Olga to Mad Treasure, and Lucci threatened consequences should he fail further."}, {"type": "paragraph", "text": "The agent later reported that Mad Treasure had failed to acquire the Pure Gold and it was lost in the ocean. Lucci decided to end the mission in order to maintain balance in the world, and they figured out that Mad Treasure had looked for it on the orders of Gild Tesoro."}], "images": []}, {"title": "One Piece Film: Gold", "level": 4, "content": [{"type": "paragraph", "text": "Lucci reported to Sakazuki about Marine involvement in Gran Tesoro. Sakazuki was angry that they were helping a pirate, but Lucci replied that the Marines had their own motives."}, {"type": "paragraph", "text": "Later, Lucci was with a Marine fleet as it sailed toward Gran Tesoro. The fleet attacked Gran Tesoro, intending to destroy it despite the call for help from the World Nobles on board as well as the innocent people. However, Sabo suddenly appeared in order to prevent Lucci from threatening his brother Luffy. Lucci then turned into his leopard hybrid form, and the two clashed. The two battled to a stalemate until Gild Tesoro's defeated body fell in between them, and Lucci took his leave from the battle. Sabo retreated, and the Marine fleet waited for Gran Tesoro to blow up like they had heard. However, it failed to explode, and the fleet turned its attention to the Straw Hats escaping on the Thousand Sunny."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Sabo_Fights_Lucci.png/revision/latest/scale-to-width-down/210?cb=20170122224647", "caption": "Lucci clashes with Sabo."}]}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Charlos tried to take Shirahoshi by force, Lucci stopped Sai and Leo from interfering and explained to Nefertari Vivi about the World Nobles' right to do as they pleased. As Neptune prepared to attack Charlos and CP-0, the noble ordered Lucci to kill him. However, Donquixote Mjosgard intervened before Lucci could take any action."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "Lucci was present at the Pirates Expo, lurking in the background with the objective of obtaining the Eternal Pose to Laugh Tale. Although not seen by the other combatants, he took part in the final battle against Douglas Bullet, adding a Rankyaku to the onslaught of attacks used to break through Bullet's defenses. With Bullet defeated, Lucci attempted to snatch the Eternal Pose, but was stopped by Sanji. He then watched as Luffy destroyed the treasure."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Backstory", "level": 3, "content": [{"type": "paragraph", "text": "The anime follows the same trend for Lucci's back story, but with several differences and elaborations."}, {"type": "paragraph", "text": "After being sent, he approached the king, who begged Lucci to save the soldiers, but Lucci told the king not to question the ways of the World Government. This left the king to wonder what the Government was thinking, sending a young boy to such a dangerous assignment. Lucci stepped into the pirates' ship and claimed to serve justice against them, and they laughed and mocked him. After sarcastically telling Lucci to go home, two pirates attempted to strike him down with swords, but Lucci blocked it with his Tekkai."}, {"type": "paragraph", "text": "The crew thought Lucci was using some weird ability, and the captain warned that if Lucci resisted anymore, the hostages would die. Then, with the crew pointing guns at Lucci's head, he ordered his men to take Lucci to the prison along with the other soldiers, as a way to insult the World Government. After the pirates locked Lucci in and mocked him further, Lucci ensured that all the hostages were there - then, using his Rokushiki techniques, he brutally massacred all 500 hostages while the oblivious pirate crew was still enjoying their celebration party."}, {"type": "paragraph", "text": "When one of the pirates came to check out on the prisoners, he ran screaming for his captain - and the entire crew saw, to their horror and fury, all of their precious hostages murdered, with Lucci standing on top of the mountain of corpses, his victims' blood dripping from his hand. After a short argument on the justice of the World Government, the captain angrily ordered his crew to use their mortars - the very weapons that forced the soldiers to surrender - to kill Lucci, with five cannonballs striking Lucci right in the back. The captain said that Lucci deserved it for looking down on them, then complained how their perfect plan was ruined."}, {"type": "paragraph", "text": "In the midst of his complaint, he saw, to his shock and horror, that Lucci had survived the blast and had stood back up from the inferno, with his back scarred a shape reminiscent of the World Government's logo. Lucci then used his Soru to swiftly appear before the captain and seized him by the face, then, despite the captain's futile attempt to pry himself free, Lucci launched a barrage of Shigan (much like Shigan Oren) to brutally stab the captain to death, letting his corpse crash down onto the ground. The remnants of the crew realized that the child in front of them is in fact a heartless monster who is immune to weapons and hostage situations, they knew they had no chance of winning, and screamed in horror while fleeing. Whether they were pursued and killed is not known. With that, Lucci's mission came to completion."}, {"type": "paragraph", "text": "Regardless of which version, the scar that Lucci gained on his back vaguely resembles the symbol of the World Government. Also, Lucci's view of justice explained in the anime is also mentioned by Oda in an SBS, who says he cut it out of the manga in order for the story to move along faster."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Teenage_Lucci.png/revision/latest/scale-to-width-down/210?cb=20130121003053", "caption": "Thirteen-year-old Lucci in the anime."}]}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the manga, Lucci appears in silhouette as one of the brokers watching Caesar's broadcast, which is confirmed in One Piece Doors! Vol. 2 as well as Vivre Card - One Piece Visual Dictionary listing an appearance for Lucci in the Punk Hazard Arc. However, due to the ambiguity of the panel, the anime replaces Lucci with a different character with a thick mustache and a different voice actor."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Lucci vs. 500 Hostages", "elements": []}, {"text": "Galley La vs. Big Helmet Pirates", "elements": []}, {"text": "Lucci and Galley La shipwrights vs. Luffy and Franky (shipyard)", "elements": []}, {"text": "Lucci vs. Paulie", "elements": []}, {"text": "Lucci vs. Luffy (Galley La Headquarters)", "elements": []}, {"text": "Lucci vs. Roronoa Zoro (Galley La Headquarters)", "elements": []}, {"text": "Lucci vs. Franky", "elements": []}, {"text": "Lucci vs. Sanji", "elements": []}, {"text": "Lucci vs. Franky and Luffy", "elements": []}, {"text": "Lucci vs. Luffy (Enies Lobby Tower)", "elements": []}, {"text": "CP9 vs. Candy Pirates", "elements": []}, {"text": "CP9 vs. Very Good's crew", "elements": []}, {"text": "Lucci vs. Leo and Sai", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Lucci vs. Sabo", "elements": []}, {"text": "Lucci, Luffy, Hancock, Sabo, Law, Smoker, Crocodile, and Buggy vs. Bullet", "elements": []}, {"text": "Lucci vs. Sanji", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "An early design of Lucci had him without his goatee and distinctive lips."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In an SBS, a fan noted that Rob is another word for \"steal\" and Lucci sounds similar to luce, meaning \"light\" in Italian. Put them together, Rob Lucci means \"steal the light\", which follows his theme of dark justice."}, {"type": "paragraph", "text": "However, when the fan asked if Oda named him this on purpose, Oda did not know about it. It may have been pure coincidence, similar to how Oda did not know that there is a Maritime term called a \"Luff\" until some time after he named Luffy. As such, though there are many cases of False etymology within the One Piece fandom, this is one of the few addressed by Oda himself."}, {"type": "paragraph", "text": "Also, \"light\" in Italian is luce, not lucci (although luci is its plural form). This is most likely due to the fickleness of translating Japanese to Italian and vice-versa."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He featured in the second wave of the One Piece VS Figure Gashapon series, in the Portrait of Pirates: Neo-6 wave of figurines, in the Dokodemo Swing and Animal Mascot strap sets, in Bandai's FC candy toy sets, and in the Plex Anime Heroes Enies Lobby set. He will also be represented in the upcoming Deforme Figure Keyholder set and the High Spec Coloring 5 set."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Adventure", "elements": []}, {"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood (DLC)", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}, {"text": "One Piece: World Seeker", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Lucci is the only member of CP9 with both a given name and a surname (Kumadori's name is revealed to be a surname, but his given name is unknown).", "elements": []}, {"text": "In the 6th fan poll, Lucci ranked at 43th place, making him the most popular of the CP9 members.", "elements": []}, {"text": "His motto is \"Necessary Evil\".", "elements": []}]}], "images": []}]}