{"sections": [{"title": "Centaur Patrol Unit", "level": 1, "content": [{"type": "paragraph", "text": "The Centaur Patrol Unit was a unit of centaurs (humans who had their crippled legs replaced with functional animal ones by Trafalgar Law's powers) led by an alligator centaur named Brownbeard. They were under the ultimate control of Caesar Clown, who had them patrol Punk Hazard for trespassers. Brownbeard rebelled against Caesar for deceiving him while many others were left outside to die by the H2S experiment."}], "images": []}, {"title": "Members", "level": 2, "content": [{"type": "list", "elements": [{"text": "Brownbeard, an alligator centaur (ex-leader)", "elements": []}, {"text": "Smooge, a regular centaur", "elements": []}, {"text": "Chappe, a cow centaur", "elements": []}, {"text": "Run, a spider centaur", "elements": []}, {"text": "Fen Bock, a satyr", "elements": []}, {"text": "A leopard centaur", "elements": []}, {"text": "A giraffe centaur", "elements": []}, {"text": "A doe centaur", "elements": []}, {"text": "A rhinoceros centaur", "elements": []}, {"text": "A tapir centaur", "elements": []}, {"text": "A zebra centaur", "elements": []}, {"text": "Regular centaurs", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "The Centaur Patrol Unit was created by Caesar after Trafalgar Law gave animal legs to Brownbeard and Caesar's other subordinates."}], "images": []}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "Some of the Centaur Patrol Unit were attacked by Kin'emon's upper body on the cold side of Punk Hazard. One of the people of that group sent a distress signal with a Den Den Mushi, that was answered by Luffy."}, {"type": "paragraph", "text": "Monet flew to the burning half to scout and saw 4 intruders: Luffy, Roronoa Zoro, Nico Robin and Usopp. She instructed the Centaur Patrol Unit to eliminate them, so a leopard and a giraffe centaur went. They were easily beaten."}, {"type": "paragraph", "text": "Later, while the group of pirates were trying to cross the lake between the burning and freezing sides of the island, the leopard centaur got up, went near the lake, and threw a boulder at the pirates' boat. He then sounded a horn, telling Brownbeard and his subordinates to capture them from the freezing side. The group of the boss fired bazookas to try to sink the pirates' boat, and they eventually stuck the boat down. Just as they were about to shoot the swimming pirates, Brook appeared and froze their barrels, causing a series of backfires. As he fought the centaurs, Luffy and the others got to dry land, and, as the pirates admired the Unit's warm clothes, Brownbeard realized who Luffy was in terror."}, {"type": "paragraph", "text": "After the Straw Hat Pirates took the Unit's coats, they took Brownbeard hostage and used him to travel across the island. The group encountered Law and the G5 Marines after Law and Smoker's battle. Brownbeard tried to ask Law to help him, but the Shichibukai did not hear him. He rushed off with the Straw Hats as the conflict between Law and the Marines escalated, and they soon encountered the rest of the crew."}, {"type": "paragraph", "text": "The Straw Hat Pirates chained up Brownbeard, and the pirate explained his background with Caesar and Law, the latter of whom gave Brownbeard and his comrades their centaur legs. At the same time, a member of the Patrol Unit entered Caesar's lab and told him that Brownbeard had been captured. Caesar informed him that he'd save his boss and heal his wounds, but the scientist tested a poisonous gas on him instead."}, {"type": "paragraph", "text": "When Chopper discovered the NC10 in the children's systems, Brownbeard argued with him and defended Caesar as his savior. The Yeti Cool Brothers soon arrived, but Scotch shot Brownbeard after telling him Caesar's order for his death."}, {"type": "paragraph", "text": "Later, members of the Centaur Patrol Unit clashed with the G5 Marines outside Caesar's laboratory. Meanwhile, on the burning side of the island, Caesar ordered another group of the Unit to open a storage door, which let out Smiley. Two members of the centaur group ran from the creature and tried to call Caesar for help, but they were knocked unconscious by Smiley's poisonous gas emissions. The remaining members of the Unit who had their coats stolen began running from Smiley when they encountered Zoro, Brook, and Sanji. The conflict between the Unit and the Marines was also interrupted when Luffy, Robin, and Franky appeared. The Unit began fighting the pirates, but the exchange was stopped when pieces of Smiley began raining down of all of them and exploding. Caesar appears, and the Unit tries to support him as he fights Luffy. The Unit cheers for Caesar after the scientist beats the Straw Hat Pirates, Smoker, and Tashigi, and they tied them up as ordered."}, {"type": "paragraph", "text": "When Caesar tries to take the children from Usopp and Nami, Brownbeard charges at him. However, Caesar still defeats the three. After Smiley died and released the Shinokuni, Brownbeard carried Usopp and Nami and broke into Caesar's lab. Once inside, Brownbeard decides to help the Straw Hat Pirates and the Marines take Caesar down."}, {"type": "paragraph", "text": "Run charged at Luffy during the pirate's infiltration of the lab, but he was easily defeated. Brownbeard continued to carry the Usopp and Nami through the lab. The rest of the crew got on his back after getting tired of running. Brownbeard and the crew were stopped when Vegapunk's small dragon went on a rampage. They continued after Nami, Brook, and Kin'emon defeated it."}, {"type": "paragraph", "text": "The rest of the Unit joined Caesar in the lab's secret room to listen to their Master's plan. Brownbeard confronted Caesar, who tranquilized him and provoked him to attack. Once Brownbeard swung at Caesar, the rest of Caesar's underlings shot him. Before Caesar could finish him off, Luffy intervened to save him. After the laboratory was cut in half, Caesar revealed that he saw all of his subordinates as guinea pigs, leaving them distraught."}, {"type": "paragraph", "text": "After Luffy defeated Caesar, the Unit, the Straw Hat Pirates, the Marines, and the children loaded into a rail cart and fled the laboratory. Now safe, Brownbeard decided to let himself be captured by the Marines to receive medical treatment, as Caesar has poisoned all of his subordinates. Everyone celebrated their success with a feast. Smoker then let Brownbeard traverse the island to find and save his subordinates who were encased with the Shinokuni."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "The leopard and giraffe centaurs vs. Monkey D. Luffy and Nico Robin", "elements": []}, {"text": "The Centaur Patrol Unit vs. Monkey D. Luffy, Roronoa Zoro, Nico Robin, Usopp, and Brook", "elements": []}, {"text": "Centaur Patrol Unit vs. G-5 Marines", "elements": []}]}], "images": []}]}