{"sections": [{"title": "Nico Robin", "level": 1, "content": [{"type": "paragraph", "text": "Nico Robin, also known by her epithet \"Devil Child\" and the \"Light of the Revolution\", is the archaeologist of the Straw Hat Pirates. She is the sole survivor of the destroyed island of Ohara, which was located in the West Blue. She is currently the only person in the world known to have the ability to read and decipher Poneglyphs, a skill which is considered forbidden and threatening to the World Government."}, {"type": "paragraph", "text": "She was first introduced as the vice president of Baroque Works and secondary antagonist of the Alabasta Saga, known as Miss All Sunday, before joining the Straw Hats. She is the seventh member of the crew, the sixth to join, and like Nami and Chopper, is the third to rejoin, doing so near the end of the Enies Lobby Arc. "}, {"type": "paragraph", "text": "She ate the Hana Hana no Mi at a young age."}, {"type": "paragraph", "text": "During the Post-War Arc, she became involved with the Revolutionaries for two years. Her dream is to find the Rio Poneglyph which tells the true history. She currently holds a bounty of 130,000,000"}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nico Robin is a tall and slender young woman with shoulder-length black hair and eyes that has dark, wide pupils (her eyes are depicted to be brown in manga as well as the tenth and the twelfth movie; while in the anime, her eyes are depicted to be blue). She also has a long, thin and defined nose. In the anime, Robin's skin tone is slightly darker tan unlike in manga colored artworks where it is lighter. Robin also resembles her mother greatly, with the exception of her hair color and style as well as having slightly darker skin tone than her. Robin's limbs are very long, especially her legs, contributing greatly to both her fighting capabilities (given the nature of her powers) and overall height."}], "images": []}, {"title": "Before the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "She has no trademark looks like the others, though her all-purple cowgirl look from when she was first introduced is often associated as her trademark look. Like Nami, Robin seems to be fond of revealing outfits as she is frequently wearing clothing that are either dark in color (often black or purple) or consists of leather (sometimes both). She is also fond of high heels and they do not seem to affect the way she walks or her speed."}, {"type": "paragraph", "text": "Robin sometimes wears a gold arm band with white strings attached to it with the letter N on it, which stands for her family name. She also had a similar one with BW on it, which stood for Baroque Works, but no longer wears it as she is no longer affiliated with the group. She has also worn a cowgirl hat on numerous occasions."}, {"type": "paragraph", "text": "In the Alabasta Arc, she wore a revealing cowgirl outfit consisting of a purple cleavage-exposing corset and matching miniskirt, both with white ornaments hanging from them, and a white fur-lined coat paired with a white cowboy hat and white high-heeled boots. At the end of the arc when she started traveling with the Straw Hats, she wore a more modest buttoned up long-sleeved lavender shirt, and purple pants and matching boots."}, {"type": "paragraph", "text": "In the Skypiea Arc, along with Nami, Robin changed her outfit into something more appropriate for Angel Beach, switching into a yellow sleeveless shirt and purple pants reaching to her calves (which would not get wet as she walked on the beach), with a simple belt around her waist. She sported her white ornament on her left arm, and not needing footwear on the beach, ventured over to the shore barefoot. She put on purple high-heeled Mary Janes when she required shoes for travelling around the rest of Skypiea, and once the crew began exploring the ruins of Upper Yard, she donned her trademark white cowboy hat, which she still wore for the time being."}, {"type": "paragraph", "text": "In the Long Ring Long Land Arc, she wore her purple jacket over a blouse with aquamarine trim, dark blue pants, and matching boots. After being frozen by Kuzan and subsequently thawed out, she changed into more casual clothes to keep warm, consisting of a waist-length black sweatshirt with a dark gray hood, black leggings that reached down to the middle of her thighs, and simple white slippers. "}, {"type": "paragraph", "text": "In the Water 7 and Enies Lobby Arc, she wore a short, black, cleavage-revealing leather dress with long sleeves over what looked like a lighter, white polka-dotted under dress. She also wore black thigh high-heeled boots."}, {"type": "paragraph", "text": "In the Post-Enies Lobby Arc, she was seen wearing a tight-fitting, pink t-shirt that has the Galley-La emblem at the front and a pair of black trousers. She also wore a pair of white high-heeled shoes. Later, she replaced the T-shirt with a tight, pinstriped purple buttoned sweater and dark high-heeled shoes."}, {"type": "paragraph", "text": "In the Thriller Bark Arc, she wore a short garnet dress (purple in the anime) with lace embroidered edges, stockings reaching up to her thighs held up by suspenders, and black high-heeled boots with two lines of buttons on the front."}, {"type": "paragraph", "text": "In the Sabaody Archipelago Arc, she wore a black (purple in the anime) outfit consisting of a cowboy hat, a cleavage-revealing sleeveless shirt, with a wide, yellow collar covered with black concentric circle motifs, matching pants reaching down to her calves, and purple high-heeled Mary Janes. She also had a string of round and yellow ornaments that hung loosely from around her waist."}, {"type": "paragraph", "text": "While imprisoned on Tequila Wolf, Robin wore a single-piece blue prison jumpsuit, which was left open to reveal her ample bosom. While on Tequila Wolf, Robin's skin tone seemed to slowly lighten in color (possibly due to the cold weather of Tequila Wolf)."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "From the Return to Sabaody Arc near the end of the Fish-Man Island Arc, Robin's black hair (also lightened in color) has grown longer, which reaches her lower back and it is pulled back so it reveals more of her forehead and ears. After the timeskip, her outfit now is a long salmon sari-like skirt with a partially-zipped navy blue leather vest with a V-neck line similar to Boa Hancock's and an image of her Devil Fruit or of an actual Chrysanthemum morifolium is printed on the left breast near the shoulder that exposed her stomach, sunglasses, pink high heeled pumps, and a pink backpack. She wears sunglasses which she hangs on her forehead and is seen wearing them during the battle with the New Fish-Man Pirates in the Gyoncorde Plaza."}, {"type": "paragraph", "text": "Like Nami, Robin's breasts have also grown much larger and rounder, but her appearance has not changed much, save for the fact that her hourglass figure and body curves have become more pronounced. Robin's skin tone seemed to lighten with color to the point of the manga's skin color (possibly due to the time spending training indoors). Unlike the other members, Robin did not grow taller as she remains at 188 cm."}, {"type": "paragraph", "text": "After the battle for Fish-Man Island, Robin wore a teal, long-sleeved V-neck dress. While exploring the Burning Lands of Punk Hazard during the Punk Hazard Arc with some of her crew mates, Robin removes her dress due to the heat to reveal a floral camisole and black shorts; she later ties the dress around her waist. She also has on very high heels with this outfit and still wears her new trademark sunglasses over her forehead. She later wears a long, spotted winter coat over this while on the Ice Lands of the island, which she took from a female member of Brownbeard's Centaur Patrol Unit."}, {"type": "paragraph", "text": "During the events in Dressrosa, she wears a very short, black dress. It is low cut, and hence, a large portion of her breasts are visible, as well as her legs and lower thighs. Her costume also includes her sunglasses, black high heel boots, and a white bell-brimmed hat. She also chooses to wear her hair in a high ponytail. The hat was an extra precaution she used to hide her face along with her sunglasses to avoid being spotted by her enemies on the island, primarily the CP-0 agents. She also temporarily disguised herself as one of the grunts in the Donquixote Pirates, borrowing a uniform similar to that of a burglar with a dark long-sleeved turtleneck, dark camouflage pants, boots, gloves and a unique horned hat (as some of the grunts wore unique headgear)."}, {"type": "paragraph", "text": "After the events of Dressrosa Arc, she wears a light-colored tank top with word \"Corrida\" written on it along with dark-colored shorts (pink tank top and purple shorts in the anime)."}, {"type": "paragraph", "text": "During the Zou Arc, she wears a light purple turtleneck, dark fuschia colored shorts, and cream heels."}, {"type": "paragraph", "text": "During the Wano Country Arc, she tied her hair up, wears lipstick, and dresses in a traditional Geisha outfit."}], "images": []}, {"title": "Body Measurements", "level": 4, "content": [{"type": "paragraph", "text": "The author has also replied to a fan's question to saying that right now Robin's measurements are as follows:"}, {"type": "list", "elements": [{"text": "Updated measurements were provided in 37 volume SBS, in which Eiichiro Oda responded to a fan question by saying that her height was is 188 cm (6'2\"), making her the fourth tallest member of the Straw Hat Pirates, after Jinbe, Brook and Franky, and her three measurements are (according to Sanji and series creator in supplemental material) B99-W59-H89 (38\"-23\"-36\"), making her breasts an I-cup in Japan.", "elements": []}, {"text": "After the timeskip, in 69 volume SBS, her height is same, and her measurements are B100-W60-H90, making her breasts a J-cup in Japan.", "elements": []}]}], "images": []}]}