{"sections": [{"title": "Kibagaeru", "level": 1, "content": [{"type": "paragraph", "text": "Kibagaeru was the captain of the Fanged Toad Pirates until he lost to Foxy at the Davy Back Fight and joined his crew. Due to his anime-exclusive actions, he can be considered one of the main antagonists of the Foxy's Return Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kibagaeru is a wide-framed man with a gray mustache. He is dressed in elaborate pirate clothes, including a orange vest with a light purple tucked-in scarf, a blue captain's coat and a tricorne that had his crew's Jolly Roger on it. Upon joining the Foxy Pirates, he has crossed out the Jolly Roger on his hat, signifying his defection from his old crew, and donned an eye mask which the rest of the crew wears. He ocassionally seems to be cross-eyed, which makes him resemble a frog."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e7/Kibagaeru_Foxy_Pirate.png/revision/latest/scale-to-width-down/210?cb=20130509193118", "caption": "Kibagaeru as a member of the Foxy Pirates."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a pirate, Kibagaeru follows the code of honor quite strictly, as he adhered to the rules of the Davy Back Fight, and joined the opposing crew upon losing, even if it means abandoning his old crew, as well as losing his captaincy. He can be despicable and opportunistic, not caring much for the crew he left behind in favor of joining a bigger one, and in the anime, trying to usurp Foxy's position and kicking him out of the crew along with Porche and Hamburg, Foxy's first and most loyal crewmates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kibagaeru was the captain of the Fanged Toad Pirates, so he possessed authority over his subordinates. When he joined Foxy's crew following his defeat in the Davy Back Fight, he relinquished that authority upon becoming his subordinate."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Kibagaeru used a whip when he fought Luffy so that Foxy could become captain of his crew again."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Kibagaeru, as the captain of the Fanged Toad Pirates, was challenged by Foxy and his crew to a Davy Back Fight. They had five matches, and Kibagaeru and his crew lost all five, thus resulting in Kibagaeru and the crew's essential members (doctor, shipwright, and navigator) and jolly roger being taken by Foxy, leaving what's left of the crew in a wreck."}], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "Later, when the Straw Hat Pirates questioned about the challenge, Kibagaeru and his old colleagues happily revealed that they defected from their old crew and joined the new one willingly, showing the seriousness of the fight."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Foxy's Return Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Straw Hats' encounter with Noko, in a short anime filler arc, Kibagaeru took over the Foxy Pirates after Foxy lost the last event of the Davy Back Fight, and refused to allow Foxy back. After a fight against him and the Straw Hat Pirates, he finally decided to let Foxy rejoin his crew."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Kibagaeru was not named in the manga. He was first named in the ending credits of the anime, in a very vague manner, as \"Kiba captain\". His official name was revealed in One Piece Blue Deep: Characters World."}, {"type": "paragraph", "text": "Kiba (牙, Kiba) means \"fang\" in Japanese, while gaeru (蛙, gaeru) means \"frog\". Put together, it would spell out \"Fanged Toad\", a direct translation to his former crew."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 213), Kibagaeru's name is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 226.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 32 Chapter 304 and Episode 207.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 33 Chapter 306 and Episode 208.", "elements": []}, {"text": "↑  One Piece Anime — Episode 225.", "elements": []}, {"text": "↑  One Piece Anime — Episode 208, Kibagaeru's name vaguely revealed as \"Kiba\" in the anime ending credits.", "elements": []}]}], "images": []}]}