{"sections": [{"title": "Smooge", "level": 1, "content": [{"type": "paragraph", "text": "\"Rebar\" Smooge is an ex-prisoner, who was a centaur henchman for Caesar Clown."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Smooge is a man with a muscular upper body who wears a black, short-sleeved shirt with a decorative collar. He has a wide chin with a goatee, long dreadlocks with a orange-and-yellow striped pirate tricorne over it. His lower half is that of a horse, joined at the torso, with a black tail and a polka-dotted cloth tied around the waist."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Smooge was very loyal to Caesar Clown, since he calls him \"Master\". However, when Caesar betrayed his underlings, Smooge felt wronged and disgusted that he would harm his own subordinates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Smooge wields an oddly shaped double-headed war hammer."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Four years ago, he was a prisoner on Punk Hazard before the incident involving Vegapunk's chemical weapon. After the incident, he lost the use of his legs due to the poisonous gas, but when Caesar Clown came to the island a year later, he was given artificial legs. Because of this, he and the other ex-prisoners gladly accepted Caesar as their master, not knowing he was the one who caused their paralysis. Later on, when Trafalgar Law came to the island, he was given animal legs along with the other ex-prisoners."}], "images": []}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was later seen fighting the G-5 Marines outside of the lab along with the other ex-prisoners. He eventually retreated into the lab at Caesar's behest, but when Monkey D. Luffy started to corner Caesar, the scientist ordered the deadly H2S gas to be released into the lab, and how the subordinates can be replaced. Under the delusion that Caesar's cruelty was a ruse, Smooge , among with the other subordinates, were horrified when Caesar used the gas he fused with to kill the subordinates present in the battlefield."}], "images": []}, {"title": "Major Battle", "level": 2, "content": [{"type": "list", "elements": [{"text": "Smooge vs. Bakezo", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A rebar, his epithet, is short for reinforcing bar and refers to a steel rod or beam used to enforce concrete.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 68 Chapter 668 and Episode 594, Smooge is first introduced as one of Caesar's underlings.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 67 Chapter 664 and Episode 589, Smooge and the other ex-prisoners' history on the island.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 70 Chapter 691 and Episode 617, Smooge horrified that Caesar betrayed them.", "elements": []}]}], "images": []}, {"title": "Site Navigation", "level": 2, "content": [{"type": "paragraph", "text": " "}], "images": []}]}