{"sections": [{"title": "Smiley", "level": 1, "content": [{"type": "paragraph", "text": "Smiley, more commonly known as Slime (スライム, Suraimu), was a pet of Caesar Clown. It was created by gathering and compressing the poisonous H2S gas that spread throughout Punk Hazard and using Vegapunk's process of Zoan devil fruit animation to bring it to life. It was kept in the Punk Hazard Burning Lands before being released."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Smiley, as its other name \"Slime\" suggests, was an enormous gelatinous red-violet mass that was compared to a mountain in size. Thanks to its Devil Fruit power it took on the shape of an axolotl with eyes, a mouth, legs, caudal fin and external gills. Smiley was able to subdivide into smaller slimes, however, the smaller slimes did not take on the shape of axolotls."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Smiley_Full_Body.png/revision/latest/scale-to-width-down/200?cb=20180212130735", "caption": "A full body view of Smiley."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Smiley did not seem to have any understanding of its actions, as it continuously moved forward after being released and even killed some of Caesar's men in the process. It did know, however, that it was weak to water and figured out a way to avoid it, by propelling little parts of itself over the body of water. Smiley also responded to verbal commands from Caesar and followed them right away. However, Smiley sometimes ignored Caesar if it was interested in something else."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Smiley would constantly emit some kind of smoke or vapor, which would poison people that inhaled or touched it. It was also very corrosive, causing great pain on its own. Despite its composition, it appeared to move rather fast, as some of Caesar's men could not escape from it, despite them being centaurs. Due to its large size, it is very hard to avoid or escape from it. Smiley also appeared to be immune to extreme heat, as it could freely move over the scorching ground in the Burning Lands without any trouble. It could also shoot pieces of itself called Smilies (スマイリーズ, Sumairīzu) in order to cross a lake or other body of water, as it was weak to water. Even though it was immune to extreme heat, setting its body directly on fire would cause it to explode violently. Caesar once used this to his advantage by having the pieces latch onto his opponent and igniting them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Smiley_Exploding.png/revision/latest/scale-to-width-down/200?cb=20130616130204", "caption": "Smiley exploding after being burned."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Smiley consumed the Sara Sara no Mi, Model: Axolotl, a Zoan-type Devil Fruit which allowed it to take on the form of an axolotl. It is also what gave Smiley life and sentience. However, given its unique composition, it is very likely that it could only assume a hybrid form and not a full-beast form."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Four years ago, Smiley was created as a result of Caesar detonating his illegal chemical weapon of mass destruction experiment when Vegapunk attempted to dismiss him. One year later, when Caesar returned to the destroyed island, he condensed the H2S gas from the experiment into a slime form and \"fed\" it the Sara Sara no Mi, Model: Axolotl, thus creating Smiley. He then locked Smiley up for three years."}], "images": []}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Straw Hat Pirates and the G-5 Marines appeared on Punk Hazard and caused trouble for him, Caesar eventually lost interest in collecting bodies for his experiments and instead decided to release his pet, Smiley. Upon being released, Smiley immediately started to spread and move out, killing some of Caesar's men in the process. Later on, it was seen advancing further towards the Punk Hazard Ice Lands, where it was noticed by Zoro but mistaken for a mountain."}, {"type": "paragraph", "text": "Upon reaching the lake that separates the ice and fire sides, Smiley started to shoot little pieces of itself over to the ice side to avoid crossing the water. Some parts of it landed on the ship that the G-5 Marines were on, merging together to form a bigger Smiley. After some Marines tried to attack the slime with swords and get poisoned in the progress, one of them tries to kill Smiley with a flamethrower. Smiley, while ignited, at first gives the Marines hope, only to detonate in an enormous explosion, destroying the ship and presumably killing the Marines in the process. After the explosion, small lumps of Smiley rained down on the battlefield, poisoning some of Caesar's men. Caesar then showed up and explained to the crowd that Smiley had been consciously shooting small lumps off itself over the lake."}, {"type": "paragraph", "text": "Later on, Smiley was still shooting lumps off itself to the ice land side. The pieces that fell into the lake were slowly contaminating the water, killing the fish that lived in the lake. During Caesar's fight with Luffy, Caesar ordered the Smiley pieces to cling to Luffy, in order to create a huge explosion. While the Smiley pieces managed to stick to Luffy, the explosion still missed him."}, {"type": "paragraph", "text": "Back near the lake, a large amount of Smiley's body had managed to surround Zoro, Brook, and Kin'emon despite the former two's efforts to hold it back. Finding themselves unable to attack the poisonous mass, Smiley almost overcame them before Kin'emon revealed his Fox Fire style swordsmanship, which ignited and detonated Smiley pieces in the immediate area, but contained the explosions."}, {"type": "paragraph", "text": "Smiley was then seen during Caesar's Den Den Mushi broadcast chasing after Zoro, Sanji, Brook and Kin'emon. Upon venturing further inland, the group came across a large piece of wrapped candy being pulled by Caesar's subordinates. Without hesitation, and completely ignoring Caesar's order to wait, Smiley devoured the candy whole in a single gulp."}, {"type": "paragraph", "text": "Smiley then \"died\" as he collapsed back into his original gas form, only this time, the gas was much deadlier because of the effects of the bait: instead of poisoning its victims, it petrified them. Smiley's Devil Fruit powers were released from their vessel and quickly reincarnated themselves inside the closest apple on Punk Hazard. A nearby apple was then seen transforming into a Devil Fruit, which was an indication of Smiley's \"death\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Mysterious_Slime.png/revision/latest/scale-to-width-down/210?cb=20130512052804", "caption": "Smiley released on Punk Hazard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8c/Smiley_vs._G-5_Marines.png/revision/latest/scale-to-width-down/210?cb=20130704063123", "caption": "Smiley lands on the Marine's ship."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4c/Smiley_Eats_Candy.png/revision/latest/scale-to-width-down/210?cb=20141206202605", "caption": "Smiley eating the candy laid out for it by Caesar."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Smiley vs. G-5", "elements": []}, {"text": "Smiley vs. Kin'emon", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited World Red", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Smiley's \"death\" is a reference to a pyroclastic flow, a fast moving current of gas and ash which is the result of a volcanic eruption.", "elements": []}, {"text": "Smiley is the first Zoan Devil Fruit user that can transform into an aquatic animal.", "elements": []}, {"text": "Smiley is the first, and so far only, deceased Zoan Devil Fruit user.", "elements": []}]}], "images": []}]}