{"sections": [{"title": "Chappe", "level": 1, "content": [{"type": "paragraph", "text": "\"Rope-Tugging\" Chappe is an ex-prisoner who was a henchman for Caesar Clown. He was first seen fighting against the Marines of G-5 on Punk Hazard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chappe has a mostly bald head with a small ponytail at the back. He has a crooked nose and double chin. He wears a coat with frills and a striped shirt buttoned all the way up."}, {"type": "paragraph", "text": "He was shown to be a bull centaur."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Chappe_Full_Body.png/revision/latest/scale-to-width-down/180?cb=20150619011933", "caption": "Chappe's full-body."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Chappe was very loyal to Caesar Clown, since he calls him \"Master\". However, when Caesar betrayed his subordinates, he felt wronged and fled the facility with the Straw Hat Pirates and G-5 Marines. He was also scared of Smiley and did not know what it was."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He has considerable strength, as he and the rest of his group were able to fight against the G-5 Marines and gain the upper hand. He wields a rope whip in combat, and is seen being very proficient in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Four years ago, he was a prisoner on Punk Hazard before the incident involving Vegapunk's chemical weapon. After the incident, he lost the use of his legs due to the poisonous gas, but when Caesar Clown came to the island a year later, he was given artificial legs. Because of this, he and the other ex-prisoners gladly accepted Caesar as their master, not knowing he was the one who caused their paralysis. Later on, when Trafalgar Law came to the island, he was given animal legs along with the other ex-prisoners."}], "images": []}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was first seen fighting the G-5 Marines along with the other ex-prisoners. He witnessed when one of the G-5 ships exploded, and he was terrified when slime globs from Smiley landed close to him and his comrades. After Caesar's defeat, he was shown to have survived. He then escaped from the laboratory along with the Straw Hat Pirates and the G-5 Marines."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A \"chappe\" is a flap of leather attached to a sword's crossguard, also known as a \"rain-guard\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 68 Chapter 668 and Episode 594, Chappe fights against G-5 Marines.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 70 Chapter 691 and Episode 617, Chappe is horrified that Caesar betrayed them.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 68 Chapter 670 (p. 13-14).", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 70 Chapter 695 and Episode 621, Chappe is shown to have survived the battle against the G-5 Marines.", "elements": []}]}], "images": []}]}