{"sections": [{"title": "Forest Boss", "level": 1, "content": [{"type": "paragraph", "text": "The Forest Boss is a large baboon that was first introduced in Gedatsu's cover story."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Forest Boss is a large black and white baboon, seen wearing a jacket draped over his shoulders with a rope tied around his head like a headband. He is also seen smoking a black pipe."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "At first forest boss seems arrogant as he challenged Gedatsu to a fight. After his defeat to Gedatsu he helps out as he helps build a thermal station."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Forest Boss is a skilled carpenter, as he built the hot springs building within hours of joining the project with the help of his followers."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Gedatsu's Accidental Blue-Sea Life", "level": 3, "content": [{"type": "paragraph", "text": "He was awakened by Gedatsu during his work with Goro and the Dirt Boss. At first, the Forest Boss attacked Gedatsu, but he was easily defeated and became his second subordinate. While the Dirt Boss dug his tunnel to Alabasta, the Forest Boss and his baboons built a thermal station on Ukkari Hot-Spring Island. By the time they returned, the Forest Boss had already finished building."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Forest Boss vs. Gedatsu", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 180), His birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 35 Chapter 333, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 18, Forest Boss encounters Goro, Gedatsu, and Dirt Boss.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 35 Chapter 335, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 19, Gedatsu defeats Forest Boss.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 36 Chapter 340, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 24, Forest boss finishes building the resort.", "elements": []}]}], "images": []}]}