{"sections": [{"title": "Dirt Boss", "level": 1, "content": [{"type": "paragraph", "text": "The Dirt Boss is a giant mole awoken by Gedatsu during his work for Goro in his cover story."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a large and dark colored mole with a light colored duck-like snout. He carries a large pickaxe fit for his size and wears a miner's helmet."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "At first, Dirt Boss seems arrogant as he challenged Gedatsu to a fight. After his defeat to Gedatsu, he helps out as he digs a tunnel from Alabasta to the hot springs."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He is a very good digger, as he dug a tunnel connecting Goro's thermal island to Alabasta."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Gedatsu's Accidental Blue-Sea Life", "level": 3, "content": [{"type": "paragraph", "text": "While Goro and Gedatsu were digging around for the hot springs, Gedatsu stumbled upon the Dirt Boss. He attempted to attack Gedatsu, but was easily defeated and so became a subordinate of the former sky priest. He then kept digging and succeeded in helping Goro and Gedatsu in find water underground. Afterwards, he kept digging until he suddenly landed in Alabasta, and with that he created a tunnel that would connect the two islands."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, Tonjit's grandson appears riding a mole strongly resembling the Dirt Boss, but no connection between the two is mentioned.", "elements": []}, {"text": "In the game Unlimited Cruise, the player can catch moles that look like small versions of the Dirt Boss.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 34 Chapter 326, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 12, Dirt Boss is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 105), His birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 34 Chapter 326, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 12, Dirt Boss confronts Gedatsu and Goro.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 35 Chapter 329, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 14, Dirt Boss is defeated by Gedatsu.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 35 Chapter 330, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 15, Dirt Boss becomes a subordinate of Gedatsu.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 35 Chapter 332, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 17, Dirt Boss finds the underground hot spring.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 36 Chapter 337, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 21, Dirt Boss brings Goro home to Alabasta by accident.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 36 Chapter 341, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 25, Dirt Boss completes the tunnel to Ukkari Hot-Spring Island.", "elements": []}]}], "images": []}]}