{"sections": [{"title": "Nami", "level": 1, "content": [{"type": "paragraph", "text": "\"Cat Burglar\" Nami is the navigator of the Straw Hat Pirates. She is the third member of the crew and the second to join, doing so during the Orange Town Arc. She is the adoptive sister of Nojiko after the two were orphaned and taken in by Bell-mère."}, {"type": "paragraph", "text": "She was formerly a member of the Arlong Pirates and initially joined the Straw Hats so she can rob them for her real crew in order to buy back her village from Arlong, but joined the Straw Hats for real after they rebelled against and defeated Arlong. Her dream is to make a map of the entire world."}, {"type": "paragraph", "text": "She currently has a bounty of 66,000,000."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nami is a slim young woman of average height with orange hair and brown eyes. Most people consider her to be very attractive or even beautiful. She has a black tattoo (blue in the anime.) on her left shoulder, which represents mikan, and pinwheels (a homage to Bell-mère, Nojiko, and Genzo, respectively), where she used to have a tattoo for being a member of Arlong's crew."}, {"type": "paragraph", "text": "Her overall physique matured suddenly (though this is, most likely, a simple change in style of artwork). Her fashion frequently changes as does her hair style. Many of her shirts feature four-letter words, such as \"Gold\" or \"EVIL\", similar to a shirt that Bell-mère once wore that had \"MACE\" on it. On her left wrist, she wears the Log Pose, which she needs in order to be the navigator of the ship, and a gold bracelet, given to her by her sister, Nojiko. After the Arlong Park Arc, Nami frequently changes into a variety of clothes in the series for each arc, and usually pairs her tops with skirts that have two rings on the sides. Her trademark shoes are orange high-heeled gladiator sandals. Nami wears some form of high heels in every arc, and while they do make her taller, they do not seem to affect the way she walks or her speed. Though she tends to style her hair neatly, occasionally, a hair on top of her head may form into a messy cowlick."}, {"type": "paragraph", "text": "She wears a strap around her thigh with three slots in it which she keeps each pole of her bo staff and later the Clima-Tact in."}], "images": []}, {"title": "Before the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Before the Syrup Village Arc, Nami wore her trademark orange mini-skirt with two white rings on each side filled in with orange or brown in their centers and shirts with short sleeves that were long enough to hide her tattoo on her left shoulder that showed that she was a member of the Arlong Pirates. She also had short hair with a particularly curled strand over the left side of her face."}, {"type": "paragraph", "text": "During the Romance Dawn Arc to the Syrup Village Arc, Nami's initial trademark look consisted of a white and blue striped shirt, her trademark orange mini-skirt and brown high-heeled boots."}, {"type": "paragraph", "text": "During the Baratie Arc, she wore a pink shirt with the letters \"W\" and a lowercase \"B\" in the center in a circle in white. The shirt has white liners and two lines along the sleeves. She also wore her yellow mini-skirt, and brown high-heeled boots."}, {"type": "paragraph", "text": "During the Arlong Park Arc, Nami wore a green camisole with dark green flower shapes, tight black pants with two yellow rings on the sides, and light orange high-heeled sandals. Nami temporarily put on a glove to hide the fact she had stabbed her hand when pretending to murder Usopp, but quit wearing it once the truth was exposed. She also wore Monkey D. Luffy's straw hat for a while before it was later returned to him. After the arc, she wore a plain white shirt with a blue mini-skirt with two white rings on the sides. For the first time, she wore sleeveless clothing that exposed her Arlong Pirates tattoo, but later, in a fit of uncontrollable rage, Nami later stabbed her tattoo relentlessly in an attempt to destroy it, until Luffy stopped her by force. She eventually asked Dr. Nako to remove it, but the doctor couldn't erase it entirely, leaving a visible scar; the scar had been caused from both Nami repeatedly wounding herself in the arm and the indelible nature of the tattoo. Nami chose to cover it up by getting a new tattoo which was a cross between a tangerine and a pinwheel, in honor of both Bell-mère and Genzo. Nojiko also gave her a gold bracelet as a keepsake before she departed from her home, which Nami began to wear regularly on her left wrist ever since."}, {"type": "paragraph", "text": "During the Loguetown Arc, she wore a plain navy blue, short-sleeved shirt, a dark blue mini-skirt with white rings on the sides, and navy blue high-heeled sandals."}, {"type": "paragraph", "text": "During the Warship Island Arc to the Reverse Mountain Arc, she wore a sleeveless baby blue shirt with a light heart in the center with a crisscross design, a dark blue mini-skirt, and her regular light brown high-heeled sandals. She also received a Log Pose from Crocus and began to wear it regularly on her left wrist, the same one with her gold bracelet."}, {"type": "paragraph", "text": "During the Whisky Peak Arc, she wore a black shirt with the word \"MODE\" printed in the center in pink with the base in a pink mesh-like design, her regular yellow skirt and her high-heeled sandals."}, {"type": "paragraph", "text": "During the Little Garden Arc, she wore a simple, long-sleeved shirt with blue sleeves, her yellow skirt, and her high-heeled sandals. After escaping Mr. 3's Giant Candle Service Set, her shirt was burnt and revealed a black, lacy brassiere underneath. She also wore Sanji's jacket to cover up, before changing on the Merry."}, {"type": "paragraph", "text": "During the Drum Island Arc, she wore several outfits. In the beginning, Nami wore a pale blue, short-sleeved cotton sweater, her yellow skirt and high-heeled sandals. While Luffy and Sanji carried her to be treated by Dr. Kureha (she caught a fever in the previous arc), Nami wore a checkered, hooded parka with the colors white, orange and bright yellow (which Luffy later donned). She wore pale blue pajamas while recovering at Dr. Kureha's home, and a light purple blanket with light brown fur lining it when she ventured out of her room. In the end, Nami wore a long, maroon coat with fur on the hood, collar and hem, and maroon high-heeled winter boots."}, {"type": "paragraph", "text": "During the Alabasta Arc, she wore white overalls to protect her skin while in the desert, she retired these clothes during her fight with Paula to reveal a dancer like outfit (which Sanji had bought her earlier in the arc) after Paula damaged them. This outfit consisted of a blue and purple halter top with a pink shroud and a long white skirt with the top part blue, Nami later tore the skirt up the side to make it easier for her to run. Finally, Nami wore a long sleeved white shirt with a brown skirt to match all of these with her normal high heels."}, {"type": "paragraph", "text": "During the Jaya Arc, Nami wore a blue and white striped tank top with her usual skirt and high-heels."}, {"type": "paragraph", "text": "During the first part of the Skypiea Arc, while exploring Angel Beach and Upper Yard, she wore a bikini that was designed in a cloud pattern colored in blue, light blue and white. She paired her top with maroon trousers, and went barefoot. After returning from Upper Yard, she threw on a light yellow short-sleeved shirt over her bikini and put on her orange high-heeled sandals. Sanji notably showed dismay when Nami put on the shirt. She also wore glasses for a small period of time, and upon doing so, tied her hair back in pigtails to keep it out of her eyes, leaving it tied up for the remainder of her return trip to the Upper Yard. Nami eventually changed back out of her shirt when she had to dive into water, and stayed in her bikini; Sanji was pleased to see Nami had removed it. She finally changed into a gray, zippered camisole with the word \"EVIL\" imprinted on it in big blue letters, blue cutoff jeans, and a dark gray pair of sandals."}, {"type": "paragraph", "text": "During the Davy Back Fight Arc she wore a black tank top revealing her navel with the word gold on it, she also wore white jeans with two rings on the side, a bracelet, and her regular high heels."}, {"type": "paragraph", "text": "During the Water 7 Arc, she sported two outfits. The first one was a dark blue, short-sleeved shirt with a light blue tie that had three rows of black dots decorated diagonally at the end. She complemented her top with a white pleated skirt with golden rings on the sides and dark blue high heel gladiator sandals. After Luffy's fight with Usopp, Nami changed into a violet camisole with the number \"3\" imprinted on it in white, a white pleated mini-skirt, and her default high-heeled sandals."}, {"type": "paragraph", "text": "During the Enies Lobby Arc, she wore black high-heeled gladiator sandals, a brown cleavage-revealing blouse that exposes her abdomen with cream-colored liners and a pale blue, pleated mini-skirt. Initially, she also had on a blue denim jacket, but this was later caught and pierced by Kumadori's staff. This caused her to be pinned down, making Nami strip off the jacket and abandon it so she could run away."}, {"type": "paragraph", "text": "In the Post-Enies Lobby Arc, she wore a yellow mini-dress with a hood and her default orange high-heeled sandals."}, {"type": "paragraph", "text": "During the Thriller Bark Arc, she sported many outfits. One of them was a pink, long-sleeved sweater with a white collar, a pleated brown mini-skirt, and brown high-heeled boots. She later wore a strapless, long wedding gown and white high-heeled pumps. She tied her hair into a short ponytail. She seemed to have abandoned the sandals for high-heeled boots as of Chapter 435 but she started using sandals again by the end of the arc."}, {"type": "paragraph", "text": "For the Sabaody Archipelago Arc, Nami wore an orange shirt with an orange floral pattern, white short shorts, and her high-heeled sandals. Nami's clothes consisted of a pink shirt, jean shorts, and high heels for the Straw Hat's Separation Serial."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "From the Return to Sabaody Arc through the Fish-Man Island Arc, Nami's hair has grown rather long, which reaches her lower back. Her breasts have also grown larger and rounder like Nico Robin's, but apart from this, her appearance has not changed much, save for the fact that both her body curves and hourglass figure have become more pronounced. Oddly, Nami's face is now drawn to look younger with her eyes bigger (with the irises now showing), droopier and placed lower on her face; though this may be from the art style evolving. She also has grown slightly taller. After the timeskip, her outfit a revealing green and white bikini halter top, tight low-rider jeans (that expose a bit of her hips and rear), orange high-heeled sandals and a pair of pearl-like earrings that she constantly wears. Ever since arriving to the New World, Nami sports a new belt with a \"\" symbol on it where she can also keep the pieces of her Sorcery Clima-Tact on the right side and puts the belt around her waist when she is fighting seriously against an opponent."}, {"type": "paragraph", "text": "Before leaving Fish-Man Island. she changed into a Criminal brand red halter top and tied her hair back in two ponytails behind her with blue bands, as well as removed her belt. The Minister of the Left also gave her a New World Log Pose to replace her old Log Pose, which had become unreliable due to the more unpredictable nature of magnetic fields coming from islands in the New World, which she began to wear henceforth. As the crew left the island Nami decided to unwind, undressed, and took a bath, but upon being interrupted during her bath due to the ship getting caught in a White Strom, she rushed out onto the deck only wearing a light blue hooded zippered sweatshirt over her body to make herself decent for the time being, as well as her new Log Pose, gold bracelet, pearl earrings. She also put on slip-on brown sandals; in the anime, she was only shown wearing them very briefly and ended up barefooted, losing her sandals when the Sunny passed through the White Strom.  "}, {"type": "paragraph", "text": "At the start of the Punk Hazard Arc, when they arrived in the New World, Nami changed into a red and yellow Criminal brand bikini top with the same pair of jeans, belt, and high-heeled sandals. She also tied her hair back again, and temporarily wore a pink raincoat while in stormy waters. When she reached the cold side of Punk Hazard, Sanji gave her his jacket to stay warm. She was later given a long black double-breasted coat and a set of gloves by Kin'emon using his unnamed Devil Fruit power, but when Sanji was using her body after Trafalgar Law swapped their minds with his Ope Ope no Mi, he took them off to rescue Kin'emon's displaced torso from underwater, and they changed back into rocks. He had the samurai create a new set of winter attire, a tan coat with black fur and gloves. Inside Caesar Clown's lab, she shed the coat and gloves in the warmer conditions, causing them to revert back to rocks."}, {"type": "paragraph", "text": "After returning to the Thousand Sunny, she changed into real and more personalized stylish winter clothing and also replaced the clothes which were not suited for the cold, putting on a high-collared black coat with three sets of gold buttons held together by straps, brown gloves, a set of black leggings instead of jeans, and in place of her sandals, a set of calf-high dark brown boots with white fur insulating the boots at the calves. Once the crew had sailed out of Punk Hazard into more pleasant conditions, she wore a pink sleeveless shirt with the word \"HEAT\" on it in red letters with a picture of candy below it, teal and white striped shorts, and her high-heeled sandals."}, {"type": "paragraph", "text": "During the Dressrosa Arc, Nami's first outfit consists of a tank top and short shorts. Later, while playing a shogun scene on the Sunny, she wears a bikini top, a necklace with a star pendant, short shorts, and very high heels. After the crew had split up, she changed into a frilled halterneck and a pleated frilled skirt with round studs around the waistline and a small decorative bow in front. She wore her hair back in a ponytail with a scrunchie, and kept her pearl earrings and high-heeled sandals."}, {"type": "paragraph", "text": "While on Zou, Nami wore a fancy purple dress covered in fancy pearls, which is a national treasure of Zou. She still wears her high-heeled sandals and her hair is loose. When leaving Zou she wore a skirt and shirt with the number \"73\" on it and later a hooded fur coat when the crew was traveling in cold weather."}, {"type": "paragraph", "text": "In the Whole Cake Island Arc, Nami bought a corset skirt and blouse, making her look like a \"pretzel girl\", which Carrot and Brook liked. Before landing on Whole Cake Island, Nami briefly wore a suit of armor with spears on the back (due to fighting ants all night) but changed out of it instantly. Later on, after her original outfit gets destroyed in a fire, she steals new clothes from an unconscious man lying nearby; blue overalls with very large, puffy pant legs along with a pink sash wrapped around her waist. When meeting with the Fire Tank Pirates, she wore a short, backless red dress. After escaping Whole Cake Island, she wore a long sleeve white dress."}, {"type": "paragraph", "text": "In the Wano Country Arc, Nami first wore a dark-colored (light purple in the anime) dress with outlines (colored yellow in the anime). She was later given a blue and orange revealing kunoichi outfit by Kin'emon. Her third outfit was a light-colored kimono with a dark-colored pattern."}], "images": []}, {"title": "Body Measurements", "level": 4, "content": [{"type": "paragraph", "text": "The author has also replied to a fan's question to saying that right now Nami's measurements are as follows:"}, {"type": "list", "elements": [{"text": "In SBS Volume 6, Eiichiro Oda said that, according to Sanji, her measurements were B86-W57-H86 (34\"-22\"-34\").", "elements": []}, {"text": "Updated measurements were provided in 37 Volume SBS, in which Oda responded to a fan question by saying that her height was 169 cm (5'6½\"), and her three measurements were (according to Sanji's voice actor and series creator in supplemental material) B95-W55-H85 (37\"-21\"-33\"), making her breasts an I-cup in Japan. These measurements were mentioned in the anime during the Thriller Bark Arc.", "elements": []}, {"text": "After the timeskip, in 69 Volume SBS, her height is 170 cm (5'7½\"), and her measurements are B98-W58-H88 (38\"-22\"-34\"), making her breasts a J-cup in Japan.", "elements": []}, {"text": "Despite the figures above, Nami's breasts seem to enlarge and then \"reset\" throughout the arcs (this is much more obvious in the manga and in Movie 7).", "elements": []}]}], "images": []}, {"title": "Non-canon", "level": 3, "content": [{"type": "paragraph", "text": "In Episode 1, she appear with a ballroom gown with pink lines, a red necklace and earrings, and a pink bracelet. Then, he appears in a pirate's outfit, with a blue shirt, black pants, a red scarf at the waist, a pirate style black bandana in the head, and two black bracelets."}, {"type": "paragraph", "text": "In the Movie 2, she initially appears in a dark pink bikini. After the Trump Pirates stole the Going Merry with her clothes inside, he had to wear a wedding dress from a store."}, {"type": "paragraph", "text": "In the Movie 3, she wears a white dress with crisscrossed black lines, and a red belt. Also momentarily, she wears an extravagant monkey costume designed by Usopp."}, {"type": "paragraph", "text": "In the Movie 4, she wears a gray sleeveless jacket, with the word \"Evil\" on the chest, and a short blue skirt. In the final scene, she wears an orange dress with long sleeves and short skirt, with a white line on the sleeves, also worn during the plot of the Movie 5."}, {"type": "paragraph", "text": "In the G-8 Arc, she wears momentarily as a Marine janitor, with a white shirt, an apron with the symbol of the Marines, a white cap turned inside out, and two green gloves. Then, she changes the uniform for a nurse's, wearing a white nurse's cap, a pink shirt, and an apron with the Marines symbol and a pocket, and a dark pink ribbon at the waist."}, {"type": "paragraph", "text": "In the Movie 6, she initially wears a pink dress, a white shawl, and sunglasses with pink lenses. Then, she changes her clothes for a pink top and a yellow skirt with a black belt."}], "images": []}]}