{"sections": [{"title": "Poseidon", "level": 1, "content": [{"type": "paragraph", "text": "Poseidon is one of the three Ancient Weapons, alongside with Pluton and Uranus. It is a mermaid who has the power to communicate with Sea Kings."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rather than being an inanimate object like usual weapons, Poseidon was a mermaid belonging to the Ryugu Kingdom's royal bloodline. After she died, her descendants who possessed the same ability to speak with Sea Kings were granted her name as a Title, known colloquially as the \"Mermaid Princess\" (人魚姫, Ningyo Hime). Currently, Shirahoshi has inherited Poseidon's power and her name."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Poseidon has the power to communicate with and control Sea Kings, an ability that not even the most powerful merfolk possess. This is considered to be a powerful weapon because of the Sea Kings' destructive potential to sink islands with ease, and to control such a force is regarded as one of the most fearsome abilities in the entire world. When guided by the power of love, it can save thousands of lives, but with evil intentions, it can sink everything into the ocean. The Sea Kings refer to the Mermaid Princess as their queen."}, {"type": "paragraph", "text": "When the current Mermaid Princess Shirahoshi's powers first awoke at age six, she demonstrated no control over her own abilities and would inadvertently summon Sea Kings when she cried out loud, something which could put her kingdom at risk. Ten years later, during the battle against the New Fish-Man Pirates, she fully awakened her ability and seemingly gained control of it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/aa/Shirahoshi_Summons_Sea_Kings_as_a_Child.png/revision/latest/scale-to-width-down/200?cb=20141206185238", "caption": "The Sea Kings inadvertently summoned by Shirahoshi."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Original Poseidon", "level": 3, "content": [{"type": "paragraph", "text": "Poseidon lived during the Void Century and made a pact with Joy Boy. She would use her powers to command the Sea Kings to bring Noah to the surface and activate its intended mission, for which the details would be revealed when raised. However, Joy Boy failed in his commitment to Poseidon due to unknown reasons."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6f/Otohime_Speaks_of_the_Legend_of_Poseidon.png/revision/latest/scale-to-width-down/250?cb=20150730034801", "caption": "The legendary Mermaid Princess Poseidon who could command Sea Kings."}]}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "After the Void Century, Poseidon disappeared from records, with the only information about her being found on the Shandora Poneglyph in Skypiea, and the Ryugu Poneglyph located in the Sea Forest, which is written as a letter of apology from Joy Boy to Poseidon, apologizing for breaking his end of the bargain."}, {"type": "paragraph", "text": "Even after her death, her power did not die and Poseidon's ability was passed through the generations of the royal family, although never awakened. Meanwhile, Fish-Man Island attempted to keep its end of the bargain despite Joy Boy not keeping his. The World Government spent the next few centuries trying to avoid the awakening of the Ancient Weapons by outlawing the reading of the poneglyphs."}, {"type": "paragraph", "text": "Poseidon's story became a legend within Fish-Man Island over time and stories were passed throughout the Ryugu Kingdom royal family. According to one such legend, a mermaid would be born with the ability to control the Sea Kings; on that day a man would come to guide her. The first Vander Decken traveled to Fish-Man Island to find this mermaid. However, he failed to find her and the story was passed down through his descendants as well, with each new Vander Decken trying to find the princess."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Skypiea_Poneglyph.png/revision/latest/scale-to-width-down/200?cb=20120420134224", "caption": "The Shandora Poneglyph, holding the secret to Poseidon."}]}, {"title": "Current Poseidon", "level": 3, "content": [{"type": "paragraph", "text": "Eight years before the start of the series, Princess Shirahoshi had unwittingly demonstrated the ability to summon Sea Kings when her mother was in danger of being shot by the World Noble Mjosgard. Her cries summoned a group of the sea monsters, allowing her mother and Vander Decken IX to find out about her ability. At this point, Decken deduced that Shirahoshi is the Mermaid Princess of legend that his family had been searching for and decided to marry her to gain access to her fearsome abilities (as well as her unparalleled beauty), leading him to send her threatening marriage proposals for the next ten years. Otohime, knowing that such powers can be both beneficial and deadly, had her three sons train hard to become strong warriors in order to protect Shirahoshi when the time came. Shirahoshi's power was fully awakened during the fight with the New Fish-Man Pirates, which Neptune noted was not a good thing. However, it led to the Sea Kings stopping Noah from falling on Fish-Man Island."}, {"type": "paragraph", "text": "Indeed, when Caribou overheard Nico Robin and King Neptune discussing about Ancient Weapons and Shirahoshi as Poseidon, he swiftly tried to kidnap her for her apocalyptic power, only to be thwarted by the Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Sea_Kings_stop_Noah.png/revision/latest/scale-to-width-down/285?cb=20141206205545", "caption": "Shirahoshi summons Sea Kings to stop Noah."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In Greek mythology, Poseidon (Ποσειδών) is the god of the sea, water, and earthquakes. This notably keeps with the sea god-theme of her parents; Neptune is the Roman equivalent of Poseidon and Otohime is the daughter of the Japanese sea-god Ryūjin.", "elements": []}, {"text": "Poseidon currently is the only known ancient weapon to have the form of a living being.", "elements": []}, {"text": "Poseidon's ability is somewhat similar to the power to hear the Voice of All Things, which allows the person to understand animals, including Sea Kings.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 612 (p. 17-19) and Episode 531, Shirahoshi is finally seen for the first time.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 626 and Episode 546, Otohime speaks about the legend of the Mermaid Princess.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 29 Chapter 272 and Episode 174, Robin reads the poneglyph at Shandora.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 and Episode 569, Neptune explains to Robin who Joy Boy was.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 650 and Episode 570, Caribou attempted to kidnap Shirahoshi.", "elements": []}]}], "images": []}]}