{"sections": [{"title": "Vergo", "level": 1, "content": [{"type": "paragraph", "text": "\"Demon Bamboo\" Vergo was one of the four elite officers and the first to occupy the Heart seat of the Donquixote Pirates under the codename Corazon. He was a Marine vice admiral, and head of G-5, who made his debut at Punk Hazard. Due to his duplicitous conduct and allegiances, he can be considered the secondary antagonist of the Punk Hazard Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Vergo was a tall, light-skinned, lean, yet muscular man with short dark hair, a beard, sideburns, and sunglasses. From his sideburns on, his facial hair grew horizontally. On his cheek it grew downwards with a pointed end."}, {"type": "paragraph", "text": "Vergo wore a white knee-length trench coat that had a quilted design which stopped just below his waist (where the coat then had a plain design), along with two black pockets slightly above the chest on either side. Under the coat he wore a mauve-colored shirt with a purple-colored ascot embedded with a red jewel, with a golden-yellow outline at the top in the tie. He also wore black-colored gloves."}, {"type": "paragraph", "text": "As Vergo was a messy eater, he tended to have pieces of food stuck to his face from time to time, such as French fries when residents of a certain island had a flashback of him, and a partially eaten hamburger patty stuck to his left cheek when he was first introduced. However, once pointed out by Monet, Vergo then proceeded to finish eating the piece of food stuck to his cheek. This also extends to eating utensils- a stirring spoon from a coffee cup got stuck to his face and it stayed on his face for a long time, as it was still stuck when he talked with Caesar following the spread of Shinokuni, and when he proceeded to eliminate G-5. After being interrupted by a kick from Sanji, however, the spoon was knocked loose from his face."}, {"type": "paragraph", "text": "When he was younger, his relative features seem to be the same but is seen with a bowl haircut and lacking a full beard. During his time as a vice admiral of G-5, Vergo wore a Marine coat over his current attire."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Through his short confrontation with Trafalgar Law, Vergo proved himself to be a shrewd man. He could also come across as patronizing, mocking Law's position by pretending to have some respect for the Shichibukai. Seeing himself as above the Shichibukai, Vergo quickly reminded Law of the difference in their power by beating him unconscious. He was also shown to be a person who demands respect from others, such as when he demanded that Law refer to him as Vergo-san."}, {"type": "paragraph", "text": "Vergo stated that his favorite food was hamburgers. He appeared to be a very messy eater, as he was first shown to have the hamburger still on the side of his cheek, and apparently did not notice it until Monet pointed it out."}, {"type": "paragraph", "text": "While around citizens, Vergo was cited to be an amiable, personable and approachable person in comparison to the other G-5 Marines. The parents of the children kept on Punk Hazard trusted Vergo's words that all of the missing children died in accidents at sea. His statement caused them to partly believe that they were truly gone, though some parents still believed that their children are alive. Easily deceiving both citizens and the entire Marine bureaucracy, Vergo has proven himself to be highly manipulative and insidious."}, {"type": "paragraph", "text": "His true identity being a secret to most, he could become very cruel and ruthless once he revealed his true disposition, and would murder his own Marine subordinates without so much as a moment of hesitation or explanation. Being their leader also made him believe that anything he does to them is his right, believing they are nothing but rejects. His cruelty was reflected in his fighting style, as he often brutally beat his victims into submission. He also offered to cut one of Law's ears off and send it to Doflamingo as proof that he killed him. Contrary to his G-5 subordinates, he is very loyal to the Donquixote Family, respecting his comrades as family, though he showed extreme brutality when it comes to dealing with traitors, as he violently beat and scolded Rosinante for his treason; similarly, he does not hesitate in using similar violence against disrespectful juniors."}, {"type": "paragraph", "text": "Despite his perceived intelligence, however, Vergo sometimes seemed to lapse into moments of witlessness such as when he claimed to Caesar that he had been enjoying coffee and cookies, only to be reminded shortly thereafter that there had never been any cookies to begin with. Another example is when he was about to go after Smoker and Law, he could not remember where he placed his sword, only for Monet to remind him that he is not a swordsman. Even Doflamingo is aware of this, as when Vergo claimed to have purchased a camera only to be reminded that he did not buy one at all. In fact, he did not even notice there was a large piece of patty (or any other food and utensils) on his cheek until he was made to notice it. This habit started even when he was a simple ten years old, as a large, partly-eaten loaf of french bread was stuck on his cheek."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "As a Marine officer, Vergo was supposed to be loyal to the ideals and duties of the naval military; he was shown to be have placed great efforts during his first year enlisted. However, he was, in truth, a pirate who managed to keep his criminal activities a secret and was able to enlist into the Marines. Having spent 15 years ascending the ranks, he nevertheless was an enemy to the organization from the beginning, as he assisted Doflamingo in criminal activities by abusing the privileges as a high-ranking Marine officer, as well as passing off vital information and coverups. He was dishonorably discharged when Smoker reported him to Sakazuki."}], "images": []}, {"title": "G-5", "level": 4, "content": [{"type": "paragraph", "text": "As Vergo acted congenial towards everyone under his jurisdiction, his subordinates admired him despite their ruthless disregard for laws. However, when the situation called for it, Vergo was willing to mercilessly kill his Marine subordinates, which led them to adamantly believe that the Vergo attacking them was an impostor, insisting that the Vergo they knew was a kind and caring person. Smoker and Tashigi were the only two G-5 personnel who knew and accepted the truth. While engaging Smoker in the SAD room, he revealed his contempt for his charges, dismissing them as failures to the Marines. He also believed that being their leader, he has the right to do anything he wants to them, even killing them outright."}, {"type": "paragraph", "text": "Vergo was concerned about Smoker's transfer to G-5, as he mentioned that from the day Smoker was transferred, he had to put up the largest possible guard to prevent Smoker from finding him out. Vergo also expressed the desire to murder Smoker by accident, since he knows his true disposition. Smoker in turn expresses disdain for his colleague's felonies and intends to battle him alone in retribution for his treason against the Marines."}], "images": []}, {"title": "Crew and Allies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Vergo was stated to be Donquixote Doflamingo's most beneficial and trustworthy Marine officer. In the past, Vergo enlisted in the Marines under Doflamingo's orders. Vergo called him \"Doffy\" (ドフィ, Dofī) but also referred to him as \"Joker\". Among the Donquixote Pirates, Vergo had been with Doflamingo the longest, along with the other elite officers, since the four of them already saw Doflamingo as their king when he was 10 years old. While many other citizens tortured Doflamingo for his former status as a Celestial Dragon, Vergo saw the young boy as a friend, and even accepted Doflamingo as his leader after seeing him awaken his Haoshoku Haki. Although Doflamingo was ultimately forced to leave Vergo to die when he lost to Law, he did so by thanking him for all his services, causing Vergo to smile silently."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/The_Elite_Officers_Swear_Loyalty_to_Doflamingo.png/revision/latest/scale-to-width-down/200?cb=20151227180339", "caption": "The Executive Officers bow before Doflamingo."}]}, {"title": "Caesar Clown", "level": 4, "content": [{"type": "paragraph", "text": "Caesar Clown seemed to trust Vergo, as demonstrated by him giving the Marine Law's heart, who was later able to use it to incapacitate Law when he had begun to move against them. However, Vergo and his group's distrust towards Caesar led them to hire Monet and place her in Caesar’s organization. Caesar, in turn, considered Vergo to be expendable, as he ordered the Shinokuni gas to be leaked into the room where Vergo was engaging his subordinates in order to exterminate the G-5 Marines as part of the demonstration while revealing that Vergo's life was never a priority compared to the experiment."}], "images": []}, {"title": "Trebol, Diamante, and Pica", "level": 4, "content": [{"type": "paragraph", "text": "Vergo and the three have known each other for over thirty years. They share a fierce loyalty with Doflamingo to the point that the four of them destroyed an entire town for having bad pavement that made Doflamingo trip. They also refer to Doflamingo as \"Doffy\"."}, {"type": "paragraph", "text": "Like Vergo, they are Doflamingo's most trusted elite officers. However, upon Doflamingo's instructions to be enlisted into the Marines, his \"secret mission\" had been kept even from the members of the Donquixote Pirates as stated by Donquixote Rosinante in his private conversation with Law."}], "images": []}, {"title": "Monet", "level": 4, "content": [{"type": "paragraph", "text": "Vergo and Monet are well-acquainted with one another as they work under the same leader. Aside from Doflamingo, Monet was the only member of the Donquixote Pirates who knew about Vergo's mission to infiltrate the Marines."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Rosinante", "level": 4, "content": [{"type": "paragraph", "text": "Donquixote Rosinante is Doflamingo's younger brother, who disappeared since he was 8 years old and reappeared in front of the Donquixote Pirates at age 22 to join the crew. Because of Rosinante's claim, Doflamingo did not suspect him at all, and Vergo shared such trust. Rosinante succeeded Vergo in the title \"Corazon\". Upon discovering that Rosinante spied on the family on behalf of the Marines, Vergo immediately beat his successor violently, showing how angry he was at how their trust was infiltrated by a Marine."}], "images": []}, {"title": "Trafalgar Law", "level": 4, "content": [{"type": "paragraph", "text": "Vergo first met with Trafalgar Law 13 years ago; he knew the Shichibukai since they were members of Doflamingo’s crew. At the first moment of their encounter, Vergo acted congenially to the boy, not knowing who he was at the time. After finding out who he is via finding Donquixote Rosinante, however, Vergo showed his true nature; when Law tried to stop Vergo from brutalizing the man, Vergo extended the beatings to the boy for not giving him the proper honorific suffix \"-san\". This beating was quite vicious that Doflamingo surmised that it traumatized Law to this day. Vergo mocked Law by pretending to respect him as a Shichibukai, and then beating him unconscious without hesitation. Ever since that first meeting, Vergo demanded Law to show respect to him by adding the honorific suffix -san when addressing him, and on every occasion that Law neglected to do so, Vergo inflicted tremendous pain onto him. When Law did refer to him as that, it was to serve as mockery before he would defeat him in the SAD room. On Doflamingo's orders, Vergo intended to kill Law in the most brutal manner possible, and Vergo even offered to cut off one of Law's ears as proof. Unfortunately for him, Law paid Vergo back in kind by cutting him in half and doing again many pieces upon his defeat. Despite this, Vergo tried to warn him about Doflamingo's past, which Law ignored. Law also did not hesitate in leaving Vergo to die in the SAD production room, which he knew would explode."}], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Among the Straw Hats, Vergo only fought against Sanji. Even though Sanji attacked Vergo to stop him from killing Tashigi, he did despise Vergo for harming his Marine subordinates, stating that he was the kind of man that his captain would hate the most. However, their battle was left unfinished as Vergo left to pursue Law to the SAD room."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Vergo was a powerful man who was confident that he was above an opponent like Trafalgar Law, who is strong enough to become a Shichibukai. This was proven by Vergo's two easy victories against Law, although the fact he had Law's heart which he used to weaken him should be taken into consideration. Regardless, Doflamingo had enough confidence in Vergo to entrust him to kill Law in the most brutal method possible. He was also strong enough to completely overwhelm the entire Unit 01 of G-5, including Tashigi (minus Smoker at the time), despite their superior numbers. He defeated Vice Admiral Smoker with moderate difficulty (while still holding back his full strength)—although Smoker was more focused on retrieving Law's heart. Even when he was 10 years old, Vergo was strong enough to burn down an entire city alongside Trebol, Diamante and Pica, all of whom were minors."}, {"type": "paragraph", "text": "Being a former vice admiral and a former head of G-5, he had command over lower ranking subordinates, as well as control over the entire base. He was also skillful enough to deceive the entire Marine force, including the observant Smoker, in hiding his true affiliations, as well as deceiving citizens with pretexts by falsifying the crimes into \"accidents at sea\". Even after abdicating the position of Corazon, he remained an Elite Officer of the Donquixote Pirates until death, so he had command over the two thousand soldiers and eleven officers; his command was equal to Trebol, Diamante and Pica, and just underneath Doflamingo himself."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "He has shown to have an extremely high level of physical endurance, durability, and resilience as he was able to shake off a direct kick to the head from Sanji, who had strengthened the blow with Diable Jambe (although the attack did cause him to spit out blood), which sent him through a metal wall, followed by an additional barrage with few wounds. He was able to take even Law's Counter Shock, which was strong enough to take out one of the Yeti Cool Brothers with a single blow, with little damage. His endurance also allowed him to stay in a snowy environment without any signs of feeling cold, as he threw off his uniform and then had it draped over his shoulders open after violently beating Rosinante and Law."}, {"type": "paragraph", "text": "He possesses immense physical strength, as he could fracture a bone in Sanji's leg with one kick. Vergo is also remarkably fast, as he could easily keep up with Sanji's agility and when Law used his Room ability to retrieve his heart and Vergo immediately appeared in front of him and sent him flying with a kick."}, {"type": "paragraph", "text": "Vergo is also an extremely skilled and powerful hand to hand fighter. He could completely overpower Tashigi, an expert swordswoman, and also the entire Unit 01 of G-5 Marines. He easily fought against Sanji, a powerful master of the Black Leg style. Combined with his Haki, he defeated Smoker in one on one combat."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Like several other high-ranking Marines, Vergo had access to the Rokushiki martial arts style. Using Shigan, he swiftly stabbed multiple G-5 Marines at Punk Hazard. He also used Geppo to escape from H2S gas via midair and used this technique to travel through a hallway, and Soru to stop Trafalgar Law from retrieving his heart. Vergo could also use Tekkai, which Sanji stated to be as hard as iron. His Tekkai is tough enough to withstand Sanji's Diable Jambe enhanced kicks, which are powerful enough to smash through Jabra's Tekkai."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated by Doctor Fishbonen that all vice admirals possess Haki, so as a vice admiral, Vergo can also use the ability. He already had masterful usage of Haki even as a cadet in the Marines. Even at 10 years old, he was already knowledgeable of Haki, particularly that those who possess Haoshoku Haki are qualified to become king."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Vergo is highly proficient in Busoshoku Haki, as he is able to harden his body parts and any object he wielded similar to Luffy's Busoshoku Koka technique; in his case, a bamboo stick. During his battle with Smoker, Vergo was confident that his skill with Busoushoku Haki was superior to his colleague's and was shown to be capable of breaking the former's Haki-imbued jitte with a single attack from his bamboo stick, as well as seriously wounding his opponent. His mastery of Busoshoku Haki had been vouched by himself, Caesar, and even Doflamingo."}, {"type": "paragraph", "text": "He could manifest his ability for defensive purposes, such as when he blocked Tashigi's sword with just his arm. His Busoshoku Haki has been shown to be strong enough to block sharp or bladed weapons. Sanji described this ability like a mass of iron, thus making Vergo's body highly resistant to powerful attacks as seen when he withstood being smashed through a wall by the former. He could also apply it to his bare limbs to enhance his strikes, as seen when he brutalized Law with his hardened fist and elbow. His ability was what earned him the epithet \"Demon Bamboo\"."}, {"type": "paragraph", "text": "If the need arose, or if Vergo became enraged enough, he was capable of imbuing his entire body with Busoshoku Haki. This form grants him powerful blows that gave both Rosinante and Law a very severe and traumatizing beating. Also—according to Doflamingo—it protects him from even Law's spatial cutting power, which was supposedly able to cut through anything. Despite this, he was still unable to keep Law from slicing him in two along his waistline, as Law's power had improved dramatically since the last time the two had fought."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Vergo possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During his time as a cadet, as with many others of his rank at the time, he wielded a rifle on his back. However, he did not truly need it, as he threw it aside when beating Rosinante and Law up violently."}, {"type": "paragraph", "text": "When attacking Law, Vergo was seen using a long bamboo stick that he combined with his ability to harden it into a black material, which may be a reference to his nickname \"Demon Bamboo.\" When Vergo used Haki, it was colored jet black. It is unknown whether it was a special bamboo stick or not as Vergo never used his bamboo without infusing it with Haki. Its primary ability was attacking with Busoshoku Haki similar to Luffy's Busoshoku Koka, damaging his enemies severely. It could be used separately or fully. Vergo destroyed Smoker's jitte with the stick when it was reinforced with Haki."}, {"type": "paragraph", "text": "The bamboo stick was also used as a blow gun. Vergo shot a bamboo arrow (in the anime, it was a bullet) which pierced its target and created an immense explosion. When Vergo was using this ability, the stick became enlarged but it did not break. In the anime, this technique was depicted with the bamboo making a horn-like sound."}, {"type": "list", "elements": [{"text": "Oni Take (鬼・竹, Oni Take, literally meaning \"Demon Bamboo\"): The source of his nickname, Vergo imbues his bamboo stick with Busoshoku Haki, turning it jet black and incredibly hard, and then strikes down his foe. It was first used to snap Smoker's Nanashaku Jitte in half while defeating the vice admiral at the same time. This attack was powerful enough to create a shockwave that dented several layers of steel in front of him. In the FUNimation subs, this is called Demon Bamboo.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Vergo already came to know the Donquixote Family when he was 10 years old, having befriended Donquixote Doflamingo alongside the other future officers: Trebol, Pica, and Diamante while in North Blue. Impressed by Doflamingo's ability to use Haoshoku Haki, Vergo, Trebol, Pica, and Diamante swore their loyalty to the young former Celestial Dragon and treated him like royalty, protecting and training him in the arts needed to make him the Pirate King. Their devotion for him is such that they would kill any and everyone who would so much as offend Doflamingo in even the slightest manner, going as far as burning down an entire town for having poor pavement that made Doflamingo trip."}, {"type": "paragraph", "text": "Vergo was the first person to hold the Heart seat (and in effect, the codename \"Corazon\") in the Donquixote Pirates. At age 26, he enlisted in the Marines under Doflamingo's orders, and in effect, abdicating the title Corazon for Donquixote Rosinante to succeed. Vergo then climbed the ranks for about fifteen years. One year after becoming a Marine, he asked Admiral Sengoku to transfer him to G-5. He reached the rank of captain by the time Doflamingo took over Dressrosa, and eventually became a vice admiral. He did this while keeping his true identity hidden from everyone outside of his affiliates. This allowed Joker to have in his control one of the most trusted and convenient Marines available to him. While he was in the upper echelons of the Marines, he claimed to visit his sick sister in his hometown. However, it was most probably a lie to cover up his secret meetings with Doflamingo."}, {"type": "paragraph", "text": "About six months after his transfer, he was sent to Swallow Island to help retrieve the Ope Ope no Mi. There, he met a young boy who had a message for the Marines. While Vergo promised that the letter was in good hands, the child also asked the man to help save his injuried friend. Upon seeing the injured man, Vergo recognized him as Rosinante, Doflamingo's younger brother and the successor of the codename Corazon. Vergo then read the letter and saw it was information on the Donquixote Family's upcoming plans. Realizing that the boy is Trafalgar Law, the new recruit that Rosinante took away six months ago, and that Rosinante was a spy for the Marines, Vergo immediately disposed of the document and violently beat both Rosinante and Law by hardening his own fists with Busoshoku Haki. While distracted with his call to Doflamingo regarding Rosinante's treason, the traitors managed to slip away undetected. Doflamingo would suggest that this event traumatized Law to this day."}, {"type": "paragraph", "text": "Vergo also supported Caesar's research by reporting the kidnapped children to have died in accidents at sea in the official Marine reports, as well as helping to shroud the true nature of Punk Hazard in mystery, though out of distrust, Monet was placed as a deep cover agent to monitor the deranged scientist on behalf of Joker."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Donquixote_Elite_Officers_Burn_Down_a_Town.png/revision/latest/scale-to-width-down/210?cb=20151227113117", "caption": "The four children ruthlessly burning down an entire town for their poor pavement making their leader trip."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Vergo_Attacks_Rosinante.png/revision/latest/scale-to-width-down/210?cb=20150818173557", "caption": "Vergo attacks Rosinante."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "When Tashigi and Smoker were first transferred to the G-5 base, Vergo was telling them how the soldiers are rowdy and not too bright, but were overall good people. In between flashes of Vergo taking out more troops, Tashigi remembers a soldier telling her about how Vergo sometimes leaves suddenly to go home and care for his sick sister. She also remembers talking to him about a kidnapping case where Vergo told her it was a false claim, and that the parents were in denial and overreacting about the death of their child, saying that the idea of kidnapping gives them hope that their child is still alive, saying Tashigi would understand when she became a parent."}], "images": []}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the battle between Caesar, the Straw Hat Pirates, and the G-5 Marines, Vergo came across Law just as the young man fell to the ground, suffering internal damage as he began to cough up blood. He asked Law if he thought they really knew nothing, saying they placed Monet in Caesar's employment as a deep cover agent due to his boss' distrust of Caesar Clown. He mused on the fact that Law is a Shichibukai. Law asks him when he arrived, and he answered just moments ago. He explained he was in Dressrosa when he heard that an SAD tanker was heading out so he got on board, noting that it was the right choice."}, {"type": "paragraph", "text": "Law did not believe that Vergo's arrival was that coincidental and asked what he did to harm him. Vergo replied that if Law had done any harm, he would be dead right now, saying that Law can not hide anything from adults. Law then said he will have to get rid of him, grabbing his sword. But before he can even begin to draw it, he suddenly dropped it due to Vergo's paralyzing grip on Law's heart. Vergo then remembered he wanted to restate what he said earlier. He took out a bamboo staff and darkened it by imbuing it with Busoshoku Haki. He then brought it down on the back of Law's head, demanding that Law call him Vergo-san from now on."}, {"type": "paragraph", "text": "Vergo then captured Law, and put him in a cage along with Luffy, Robin, Franky, Smoker, and Tashigi. Vergo questioned Caesar's motives, which Monet suggested that since he has awoken his pet, Smiley , that he must be starting a new experiment. Monet inquired if Vergo ate a hamburger this morning, which Vergo answered saying that it was his favorite and asked how she knew. Monet tells him there is some meat left on his cheek. Vergo is later revealed as Vice Admiral Vergo, head of the Marine G-5 base. Continuing his discussion with Monet, Vergo commented that he would like to see the experiment and asked if everyone outside was going to die. Replying that they probably will, Monet assured Vergo that he would be safe inside the research facility. Interrupting the conversation, Smoker begins shouting at Vergo that the soldiers outside are his subordinates. Knowing this, Vergo was shown to be apathetic towards their plight and was instead more interested in the prisoners being held in the cage, referring to it as a grand line-up."}, {"type": "paragraph", "text": "Smoker begins to talk about \"Joker\", stating that it is the name of an underworld broker. Berating himself for not being able to weed out Vergo, their captor told Smoker that from the day Smoker was transferred; he had put up the largest possible guard, to keep Smoker from catching on to his illicit activities. Vergo told him that he would finally be relieved of that stress, as now that Smoker and Tashigi know his true identity; it meant that the two Marines will have to die there, while Vergo assured them that he will record it as an accident at sea. Asking Law who Joker is, Law explains to Luffy that he used to be a subordinate of Joker as well as Vergo (accounting for how they knew each other) and revealed to the group that Joker is just an alias he uses as a broker, but his real name is known throughout the world as Donquixote Doflamingo."}, {"type": "paragraph", "text": "Vergo was later seen sitting with Monet drinking coffee while Caesar made his broadcast to the various underworld brokers. During this broadcast it was revealed that Vergo was able to swiftly defeat Law due to the fact that after the Shichibukai and Caesar had made a deal involving the former and Monet's hearts, Caesar had then presented it to Vergo who subsequently used it to severely weaken Law during their battle. Caesar met up with Monet and Vergo, the latter of the two talking about how they had just been drinking coffee with some cookies, only to quickly remember that there were not any cookies to be had. Asking Caesar when he was going to start the experiment, the deranged scientist replies by asking Monet to collect some pictures, and tells Vergo to do a better job at keeping the Marines at bay, admitting that the arrival of Smoker and his men had caused him to become nervous."}, {"type": "paragraph", "text": "After the Straw Hats, Law, Kin'emon, Brownbeard, and the G-5 Marines unite and form an alliance, Vergo was seen with Caesar and Monet while Caesar is being informed that the Straw Hat Pirates, G-5 Marines, Kin'emon and Brownbeard are in the base. Vergo said that he was going to have to go kill Law, and looked for his sword. Monet told him he does not have a blade, since he was not a swordsman, and Vergo remembered he was not but he swore he would crush the interlopers personally."}, {"type": "paragraph", "text": "Arriving in the area the G-5 Marines had been left in, he initially did nothing while the soldiers celebrated his sudden appearance, believing him to be leading reinforcements. Tashigi was the only one not celebrating. Tashigi can barely make enough sound to tell them to run before multiple soldiers fall in front of Vergo. As a Marine falls over, Vergo's index finger is shown with fresh blood dripping from it. A soldier asked Vergo why he was attacking, saying that even as a form of punishment, using Shigan will kill them."}, {"type": "paragraph", "text": "Tashigi charged at Vergo with her sword. Vergo blocked the sword with his arm and then grabs her by the head. He then delivered a devastating close range punch that knocked her to the ground and almost unconscious. A soldier yelled at Vergo, calling him an impostor, saying the real Vice Admiral Vergo would never do this. The remaining soldiers all gang up and attack Vergo, but Vergo annihilated all of them so he is the only one left standing. Tashigi, in her mind, prays for Smoker's help. Vergo then heard someone and a person is seen bounding around the corridor. Before Vergo can react, Sanji delivers a flaming kick to Vergo's head. The soldiers that are still conscious are surprised to see one of the pirates. Sanji said he heard the sound of a woman in trouble and came to help."}, {"type": "paragraph", "text": "Sanji and Vergo began fighting, with Sanji landing a \"Flange Strike\" sending Vergo hurtling into a wall. Seemingly unfazed by the kick, Vergo prepared to counterattack, and Sanji remarked on Vergo \"hardening like steel\". Vergo attacked with one of his left kicks fracturing Sanji's right leg while Sanji blocked. Vergo attacked with another left kick as Sanji narrowly ducked avoiding the blow. As the two continue, Sanji yelled for the Marines to run away to the B Building as the room began to go into lock-down and the gas is let in from the A Building. An emergency broadcast was heard from the D Building that Law has invaded the SAD production room much to the dismay of Caesar and Vergo, with the latter stating this was what Law was after ever since he became a Shichibukai and that whatever he is planning will make a mess of the New World."}, {"type": "paragraph", "text": "After running away from Sanji, Vergo contacted Donquixote Doflamingo and notified him of Law's betrayal. Doflamingo ordered him to mercilessly kill Law, and Vergo agreed to bring back an ear to show proof of Law's death. Doflamingo then tells Vergo, Caesar, and Monet that he is going to send two subordinates (Baby 5 and Buffalo) to Punk Hazard, and when they arrive, all of them are to return to Dressrosa."}, {"type": "paragraph", "text": "Afterwards, Vergo arrived at the SAD room to confront Law. During the battle, Law tries to retrieve his heart, but Vergo beats him to the ground and steals the heart back. Law uses a Counter Shock on him, but it is ineffective. Law tells him that he was the one miscalculation in his plan as Vergo prepares to finish him, when Smoker suddenly shows up and prepares to engage Vergo."}, {"type": "paragraph", "text": "Smoker asks Vergo why the room they are in feels so eerie. Vergo told him not to worry about it. Smoker tells Vergo he is not looking forward to telling the company about their senior officer's treason, since Vergo was deeply admired by his subordinates. Vergo told Smoker he will not have to worry about his charges. Smoker, angered by this, attacked Vergo with his jitte, demanding to know what he did to the soldiers. Vergo blocked this attack with his bamboo cane."}, {"type": "paragraph", "text": "Vergo then taunted Smoker for having compassion towards his subordinates, but told him that since the truth is out, they will all have to die. Vergo's cane expanded in the middle, and something shoots out of it like a blowgun. The shot causes a huge explosion. Smoker avoided the attack by becoming intangible and tried to attack Vergo from behind. Vergo leaned back and narrowly avoided getting hit. He then tried to kick Smoker, but Smoker blocked it with his foot. He swung his cane but Smoker dodged it and moves around to Vergo's exposed side. Smoker then delivered a devastating punch to Vergo's face, sending the vice admiral flying back and landing in a heap. Smoker told him to never lay a hand on his subordinates and that his position did not make him infallible."}, {"type": "paragraph", "text": "The battle continued until the apparent defeat of Smoker, when it turns out he only acted as a diversion for Law to retrieve his heart without resistance. After this the Shichibukai starts to admonish Doflamingo, who was monitoring the battle with a miniature Den Den Mushi in Vergo's coat pocket. When Law claims that he is going to defeat Vergo, the vice admiral took his coat off and hardened his body with Busoshoku Haki. However, Law easily cut him in two with his Devil Fruit ability, along with the entire area."}, {"type": "paragraph", "text": "After his defeat, Vergo was dismembered and attached to the railing. He was complaining about his defeat, not knowing what to do. Vergo then tried to warn Law, saying that he is doomed because he does not know anything about Joker's past. Law proceeds to slice Vergo's face in half. As Law and Smoker are leaving the SAD room, Law discloses to Vergo that the room he is stuck in will explode."}, {"type": "paragraph", "text": "When Vergo was left alone, Doflamingo contacted him one last time and thanked him for all the hard work he had done until that point. Vergo was last seen smiling. Shortly after this exchange, the SAD production room Vergo was left in explodes. Doflamingo later states that Vergo has died."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/89/Vergo_Beats_Down_Law.png/revision/latest/scale-to-width-down/210?cb=20141206212832", "caption": "Vergo brutally beats Law to the ground."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/37/Vergo_With_Law%27s_Heart.png/revision/latest/scale-to-width-down/210?cb=20141206204935", "caption": "Vergo with Law's heart."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Sanji_Kicks_Vergo.png/revision/latest/scale-to-width-down/210?cb=20141111030048", "caption": "Sanji attacking Vergo with Diable Jambe."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Vergo_vs._Smoker.png/revision/latest/scale-to-width-down/260?cb=20141206213851", "caption": "Vergo vs. Smoker"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Law_Defeats_Vergo.png/revision/latest/scale-to-width-down/220?cb=20141206211644", "caption": "Law bifurcating Vergo."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Vergo vs. Donquixote Rosinante and Trafalgar Law (flashback)", "elements": []}, {"text": "Vergo vs. Trafalgar Law (Caesar Clown's Research Lab)", "elements": []}, {"text": "Vergo vs. G-5 Marines and Tashigi", "elements": []}, {"text": "Vergo vs. Sanji", "elements": []}, {"text": "Vergo vs. Smoker", "elements": []}, {"text": "Vergo vs. Trafalgar Law (SAD Room)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Vergo, Diamante, Trebol, and Pica vs. unknown thugs", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "Vergo's epithet, Kichiku would normally translate to \"Brute\". However, the kanji for it is written as 鬼竹 (literally meaning \"demon bamboo\") instead of the usual 鬼畜, making his epithet a Japanese pun. His technique, Oni Take, also translates to \"demon bamboo\", but with different pronunciation in the same kanji.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Vergo's former codename, Corazón, is the Spanish word for \"heart\", matching the card suit motif of Doflamingo's top executive officers.", "elements": []}, {"text": "Vergo is the only Elite Officer of the Donquixote Pirates to not have been stated to eat a Devil Fruit.", "elements": []}, {"text": "In the 5th fan poll, Vergo ranked 59th, making him the most popular of the Elite Officers.", "elements": []}, {"text": "While the first Corazon, Vergo, pretended to be a Marine but was really a pirate, the second Corazon, Rosinante, pretended to be a pirate but was really a Marine.", "elements": []}, {"text": "He and Rosinante are the only known Elite Officers to have a real name compared to the others (clover, diamond, and spade).", "elements": []}, {"text": "Every morning, Vergo ate a hamburger, fries, and a strawberry milkshake for breakfast.", "elements": []}]}], "images": []}]}