{"sections": [{"title": "Shanks", "level": 1, "content": [{"type": "paragraph", "text": "\"Red-Haired\" Shanks, also commonly known as \"Red Hair\", is the leader of the Red Hair Pirates and a member of the Yonko that rule over the New World. He is also a former member of the legendary Roger Pirates, the only group to successfully conquer the Grand Line, where he started as a pirate as an apprentice."}, {"type": "paragraph", "text": "Notably, he is the pirate who inspired Luffy to go on his journey as a pirate, and his crewmate Lucky Roo found the Gomu Gomu no Mi that was accidentally eaten by Luffy."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Shanks is a relatively tall man (just under two meters), well-built, tan-complexioned, and in the prime of his mid-adulthood. Among the Yonko past and present, he notably stands out as the smallest, most normal-sized by far, the others being various degrees of inhumanly proportioned."}, {"type": "paragraph", "text": "Living up to his epithet, Shanks' hair is toned distinctly red: usually depicted across media as deep-crimsonish. Worthy of note is that, uniquely among all characters yet seen, even ones with comparable hair color, Shanks' hair is the sole one filled with grayscale in the black-and-white manga (instead of inked black or left white). His first-seen hairstyle was a straight, middle-parted one kept loosely down to nape length, with shorter (at eye level), curtained bangs in the front. When he was nine years old, he had long hair and possessed his straw hat. In later appearances (at ten years older), he is shown with slightly longer hair, being wavier and more slicked back than before, except for some few strands he lets fall down the sides of his face, pushed farther sideward than said prior bangs."}, {"type": "paragraph", "text": "In his face resides a secondary trademark, a triple set of vertically parallel, linear scars that pass at an angle over his left (untouched) eye, revealed to have been given to him by Blackbeard some unknown time before the start of the series (and which he claims still aches). Additionally, Shanks' left arm is missing from below the deltoid, a result of him saving Luffy from a Sea King when Luffy was a child. As did his hair, Shanks' face changes as the manga's art style progresses: initially, it appeared more youthful, a soft jawline tapering down to a small, pointy chin. Its features were similarly milder than later depictions and, save for his petite nose, also larger, especially so his plain black eyes, topped by thin brows. Later appearances show Shanks more markedly countenanced, the square of his jaw, the sharper, narrower pair of eyes, and the chiseled, more prominently bridged nose lending him a manlier appearance. More consistent stays the man's facial hair, however, that he has always kept in a neatly thin connection of beard and mustache stubble, forming the beginnings of a circle beard."}, {"type": "paragraph", "text": "Clothes-wise, Shanks used to wear a certain straw hat obtained from Gol D. Roger (his former captain) that was synonymous with his image until he passed it on to Luffy. Otherwise, his outfit always includes a sweeping long, sleeveless black cape with a high collar (in the anime bearing a lighter, gray inside), and under it a simple, white shirt half-buttoned up, exposing the middle of his chest and some of his abs. Additionally, Shanks is always seen wearing pants cut below the knee, collected halfway up the shin. Initially (Chapter 1) the pair was a slightly loose, plain-brown one with golden buttons down the outer leg sides, and with a red sash around his waist to keep his shirt tucked inside. Later on, he is seen wearing a different, mildly baggier pair of pants with a green-yellow, indiscernible floral pattern (now revealing plenty leg hair), and his shirt is left out of his sash, which is now shown holding his saber at his right side. Finally, his footwear consists of simple brown sandals, their soles gray-studded. Post-timeskip, he is at some point seen wearing different pants yet again, light-colored with a rose pattern."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shanks is an extremely laid-back man, preferring to take his time as he and his crew traveled around the world as opposed to rushing from one place to another. Shanks is a compassionate man who leads his crew members with benevolence and is largely seen with respect from other captains. His selflessness is thus that he didn't even think twice when losing his arm defending a young Monkey D. Luffy from the Sea King."}, {"type": "paragraph", "text": "He typically avoids taking action that will result in violence, and is even able to waver the resolve of prominent figures, such as Dracule Mihawk to join in with his fun. However, despite his outward simplicity, Shanks bears a rather complex moral code. His aversion to conflict has lead him to believe that if personal opinions conflict, no matter how close the individuals may be, it is better to part."}, {"type": "paragraph", "text": "It is indicative that Shanks prefers others to see him as someone who cares little about his wellbeing, preferring to laugh off even dire situations as opposed to taking direct conflict. His carefree nature ends however when those under his leadership or protection are threatened."}, {"type": "paragraph", "text": "Shanks and his crew are almost always seen partying and drinking alcoholic beverages whenever they make an appearance, as the captain's favorite pastimes are attending and hosting parties and banquets."}, {"type": "paragraph", "text": "As noted by the Five Elders, Shanks is a pacifist by nature who does not actively seek to cause chaos and disorder. He is also against the idea of needless bloodshed, even if honor is involved, and so far seems to only step up for a fight when a friend is in danger. He also seems to admire those who have courage, having protected and commended Koby for gathering his courage to stop the war as the young Marine believed that it was pointless to continue."}, {"type": "paragraph", "text": "Shanks also has skills in diplomacy, as shown when he brokered a ceasefire between the Whitebeard Pirates and the World Government. His skills in diplomacy are so great that he managed to convince Sengoku to agree with his proposition, even though Sengoku has a strong hatred for pirates."}, {"type": "paragraph", "text": "He also likes teasing people, as demonstrated by his apparent reactions to Luffy as a child. Shanks himself was like Luffy (as a child) in his younger years."}, {"type": "paragraph", "text": "Despite being calm and brave most of the time, Shanks sometimes reacts in ways that are not always fitting in what others expect from him, a trait noted by Buggy as having \"always annoyed him\". These include panicking when things go wrong or shrugging off Buggy's angry disposition towards him to greet him in a friendly manner. He also seems to carry something personal regarding Marshall D. Teach deep within him, as when he spoke about his 3 scars to Whitebeard, he became serious about the situation surrounding Teach."}, {"type": "paragraph", "text": "Even though he has traveled the world, Shanks believes the best sake can be found in his hometown in the West Blue. When with Whitebeard, he also refers to alcohol as \"healing water\"."}, {"type": "paragraph", "text": "Like other characters in One Piece, Shanks has his own unique laugh, starting it with a \"Da\" (i.e. Dahahahahaha!)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/19/Shanks_laughs_at_the_Partys_Bar.png/revision/latest/scale-to-width-down/210?cb=20171002200646", "caption": "Shanks laughing even after being soaked with a drink."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Shanks seems to generally get along with them all, and they look up to him with respect as their captain, whom they refer to as “Boss”. Shanks looks out for the well-being of the entire crew, from refusing to take a child (Luffy) onboard his ship to denying permission to take on Whitebeard's men who had insulted Rockstar's honor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/Red_Hair_Pirates%27_Main_Members%27_Current_Appearances.png/revision/latest/scale-to-width-down/210?cb=20191211004157", "caption": "Shanks and his most closest crewmembers."}]}, {"title": "Benn Beckman", "level": 4, "content": [{"type": "paragraph", "text": "Beckman is the right-hand man of Shanks. He seems amazed at the actions of his captain, such as panicking when Luffy was taken or getting even drunker while already hungover when Mihawk brought news of Luffy's new bounty. He is one of the three members of the crew who always appear with Shanks."}], "images": []}, {"title": "Lucky Roo", "level": 4, "content": [{"type": "paragraph", "text": "Lucky Roo is unquestionably loyal to his captain as he quickly shot one of Higuma's men who pointed a gun at Shanks's head. He is also one of the three members of the crew who is always seen with Shanks."}], "images": []}, {"title": "Yasopp", "level": 4, "content": [{"type": "paragraph", "text": "Yasopp joined Shanks's crew after Shanks heard stories about the most accurate shooter and came to his home island to find him. Yasopp is happy to fulfill his dream of becoming a pirate and is grateful to Shanks. He is one of the three members of the crew who always appear with his captain."}], "images": []}, {"title": "Rockstar", "level": 4, "content": [{"type": "paragraph", "text": "Rockstar also respects and admires his captain. Although he was a beginner, Rockstar was ready to defend Shanks' honor and dignity while he was on Whitebeard's ship, delivering a letter. He also tried to use the strength of his captain to back up the importance of the letter he delivered to Whitebeard. Shanks also had Rockstar cease any attempt at fighting Whitebeard, since he didn’t want him to lose his life over foolishness."}], "images": []}, {"title": "Roger Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Of the Roger Pirates, most relationships between Shanks and the other crewmates remain unknown. However, it has been shown through flashbacks that he would fight with Buggy over just about anything, which led to them being punished by Silvers Rayleigh."}, {"type": "paragraph", "text": "Just like Buggy, he had a close bond with Gol D. Roger, as he was seen crying at Roger's execution and had acquired Roger's Straw Hat from him. Shanks appears to still think about him from time to time, as he compared Luffy to Roger when meeting him. After Ace's death, Shanks remarked on how he and Roger were similar in some ways."}, {"type": "paragraph", "text": "Shanks was well acquainted with Inuarashi and Nekomamushi, having met the two rulers of the Mink Tribe while sailing on Roger's ship when they were retainers for Kozuki Oden."}, {"type": "paragraph", "text": "Shanks appears to be still acquainted with Silvers Rayleigh, as in their reunion on Sabaody, Shanks told him about Luffy and the latter became eager to meet him."}, {"type": "paragraph", "text": "Shanks held Kozuki Oden in high regard as he wanted to help him make Wano Country open to the world though Oden declined the offer. Oden in turn, referred to Shanks as the first son."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Luffy looks up to Shanks, who is his role model, a childhood hero, and the man he wants to eventually surpass. At first, Shanks never took Luffy seriously because he was just a boy, so he mocked Luffy's dreams to become a pirate, dubbing him \"Anchor\"."}, {"type": "paragraph", "text": "Later, as Shanks and his crew were leaving after Luffy stood up for him in front of Higuma and his men, Luffy declared he would become better than him, causing Shanks to begin to treat him seriously. As the ultimate expression of this, he entrusts Luffy with his signature Straw Hat, which is of extreme sentimental value to Shanks (as it belonged to his former captain). There is an understanding between the two that Luffy will return the hat upon him becoming a great pirate, a promise that they have both taken very seriously - Luffy defends the Straw Hat with his life, upon arriving at Marineford, Shanks was not ready to accept the hat back. Benn Beckman told Shanks that Luffy is going to make something of himself, which Shanks confirmed by saying that Luffy reminds him of himself when he was Luffy's age. Just as Luffy is currently looking for Shanks, Shanks eagerly awaits the day that he meets up with Luffy. Shanks also sees Luffy as the future of piracy, a belief he was not shy with Whitebeard about when discussing his lost arm, and was so delighted at seeing Luffy's first bounty that he threw a party to celebrate, even though he was already suffering from a hangover from getting drunk previously. He expressed his empathetic thoughts for Luffy after helping bury his brother Ace after the war, knowing that it must be hard on him."}, {"type": "paragraph", "text": "They still have yet to meet each other face to face since Luffy was a kid, but Luffy restated his interest in seeing Shanks again in the New World after departing from Fish-Man Island. Meanwhile, Shanks and the Red Hair Pirates seem delighted at Luffy's fifth bounty."}, {"type": "paragraph", "text": "After Luffy's actions in Charlotte Linlin's territory was revealed to the world and has marked him as the \"Fifth Emperor\", Shanks was pleased with Luffy's progress and stated that Luffy is almost ready to meet him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b3/Luffy_receive_the_straw_hat.png/revision/latest/scale-to-width-down/210?cb=20150405160747", "caption": "Shanks gives his straw hat to Luffy."}]}, {"title": "Buggy", "level": 4, "content": [{"type": "paragraph", "text": "Shanks and Buggy served on the Roger Pirates since their childhood and they constantly fought with each other. Ironically, in their youth Buggy accused Shanks of being too naïve and innocent to ever make it as a pirate, but Shanks is currently a great pirate while Buggy and his crew are very weak in comparison. After Roger’s execution, Shanks offered Buggy a position in his crew, but the latter refused to work for him and they had not met each other for years. Despite their last meeting, it appears Shanks kept tabs on him as he was aware of Buggy’s activities as a pirate. The Marines themselves described their relationship as a \"brotherly bond\" and Whitebeard himself has noted that the two were always together."}, {"type": "paragraph", "text": "However, despite what they claimed to each other, Buggy did not pass up the opportunity to exploit Shanks' name. When the two met for the first time in years, Shanks was able to trick Buggy into giving Luffy the Straw Hat back. After learning of his deception, Buggy furiously berated Shanks for it afterward while Shanks himself was calm and greeted him jovially despite Buggy's reaction, indicating that despite their differences, the pair's relationship is still on similar ground to what it was in the past, although Shanks has matured. However, he still seems to view Buggy as a friend, since he was able to shrug off the latter's anger. Ironically, it was partially due to Buggy's association with Shanks (along with several other factors) that led to Buggy being offered the position in the Shichibukai by the World Government."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dd/Buggy_and_Shanks_in_Marineford.png/revision/latest/scale-to-width-down/210?cb=20170713142642", "caption": "Buggy and Shanks meeting in Marineford."}]}, {"title": "Makino", "level": 4, "content": [{"type": "paragraph", "text": "In Foosha Village, Shanks was close friends with Makino, the bartender of the village. Makino was very caring towards Shanks when Higuma assaulted him. Shanks even offered to help clean up the mess Higuma made, and Makino helped clean off Shanks after Higuma left. She was very grateful toward Shanks for saving Luffy at the cost of his left arm and holds him in high regard, knowing that, despite being a pirate, he is a good person. She even helped Ace learn to thank Shanks for saving Luffy's life."}], "images": []}, {"title": "Dracule Mihawk", "level": 4, "content": [{"type": "paragraph", "text": "In the past, they sought out each other on many occasions to duel. Their battles were said to echo through the whole Grand Line. However, Mihawk has given up on trying to fight Shanks after he lost an arm. He retains a neutral, though a somewhat friendly relationship with Shanks, and can track him down if the need arises. He and Shanks do manage to get along, regardless of their opposite personalities. Shanks was able to get Mihawk to join in when he threw a party to celebrate Luffy's first bounty, even when moments beforehand, Mihawk had scorned how laid-back Shanks was. Mihawk even mused out an apology to Shanks during the battle at Marineford, where he declares that he will not be holding anything back against Luffy right before launching a full-force assault upon him. When Shanks made his entrance during the Whitebeard War, Mihawk left the battlefield while stating that he agreed to participate in the war against Whitebeard, but fighting \"Red-Hair\" is beyond the scope of the World Government's orders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Shanks_Convinces_Mihawk_to_Celebrate.png/revision/latest/scale-to-width-down/210?cb=20121222203105", "caption": "Shanks and Mihawk"}]}, {"title": "Marco", "level": 4, "content": [{"type": "paragraph", "text": "Marco once regarded Shanks as an enemy due to being a rival of his captain. After Shanks knocked out some Whitebeard Pirates with his Haki, Marco insulted and scolded him for the damage he had done, and even told him to shut up after the Yonko offered him a chance to join his crew. When Shanks arrived at Marineford to stop the war, he asked Marco to withdraw. After the battle of Marineford, Marco apologized to Shanks for his previous behavior and genuinely thanked him for ensuring the funerals of both Whitebeard and Ace, finally acknowledging him as something of an ally."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Shanks_and_Marco_at_Whitebeard_and_Ace%27s_Funeral.png/revision/latest/scale-to-width-down/200?cb=20191208235441", "caption": "Shanks talking with Marco at the funeral of Whitebeard and Ace."}]}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "Shanks was on relatively good terms with Ace, who seemed to greatly respect him primarily for his role in saving his adoptive younger brother, Luffy, from the Sea King during the incident with Higuma. After setting out to begin his life of piracy, Ace immediately sought out Shanks to meet the man in person and thank him on Luffy's behalf. Shanks initially thought that Ace came to confront him (he was ready to unsheathe his sword at the Logia user on that very encounter), but immediately warmed up to Ace upon learning of his relation with Luffy. Shanks showed some concern for Ace upon learning that he was in pursuit of Blackbeard, and personally sought out Whitebeard to vocally disapprove of this and attempt to persuade him to recall Ace. After the announcement of Ace's execution, it was revealed that Shanks personally intercepted Kaido, another member of the Yonko, when the latter attempted to take advantage of the situation by attacking Whitebeard."}, {"type": "paragraph", "text": "It is unknown if Shanks ever found out that Ace was the son of his captain, Roger, before Sengoku made this fact public to the world. However, he has made connections between their personalities and behaviors in retrospect (at the burial site of Whitebeard and Ace), as neither of them would back down when someone they cared for was insulted."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a4/Ace_Meets_Shanks.png/revision/latest/scale-to-width-down/200?cb=20191210201831", "caption": "Shanks meets Ace."}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "The World Government views Shanks as a problem and a trouble maker, but realizes he is a man who will not try to change the world by himself. However, due to the position he holds, they fear he could get out of hand and are prepared to eliminate him if he ever does. The World Government tolerates his actions until that time comes. Despite his status as a notorious pirate, Shanks was permitted to meet with the Five Elders at Mary Geoise during the Levely. The Five Elders even allowed him to speak with them in private so he could talk to them about a certain pirate."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "Shanks and Sengoku hold some level of respect for each other; even as enemies, both the World Government and Red Hair Pirates see a clash between sides as the final option. When Shanks arrived at Marineford and proclaimed that the pirates would give Whitebeard and Ace proper burials, Sengoku agreed to hand over the bodies and declare the war to be over, as well as take all responsibility himself, which Shanks thanked him for. Vice Admiral Garp blames Shanks for poisoning Luffy's mind with ideas about being a pirate when he wanted Luffy to become a Marine."}, {"type": "paragraph", "text": "When Koby was about to be killed by Admiral Akainu for wasting precious seconds of the war by begging for a ceasefire, Shanks defended him and commended Koby for his brief moment of courage, which he stated would change the future of the world for better or worse. Shanks earned Akainu's fury not only for protecting Koby but because his arrival had allowed Luffy to escape his grasp."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/Shanks_in_Front_of_Sengoku.png/revision/latest/scale-to-width-down/200?cb=20191211010754", "caption": "Shanks convinces Sengoku to announce the end of the Paramount War."}]}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "The one Shanks seems to watch out for the most is Blackbeard, who gave him his three scars in a previous encounter. Shanks himself seems to know the potential danger Blackbeard represents is greater than that of anyone else."}, {"type": "paragraph", "text": "At Marineford, the two confronted each other and Shanks addressed Teach in a tense manner, and he only seems to regard Teach as a significant threat compared to the Marines or the Whitebeard Pirates and their New World subordinate crews. Teach was initially surprised at seeing him again but was amused at being called out by Shanks before he mocked him for the scars he gave him which angered Shanks."}, {"type": "paragraph", "text": "Having already proclaimed \"his\" era is beginning, unveiling the new members of his crew and demonstrating control over two Devil Fruits, Teach said he had achieved his goal for the time being, while also knowing he was not ready to face the Yonko."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "Since his time on the Roger Pirates, Shanks would constantly fight with the latter."}, {"type": "paragraph", "text": "Despite that being a Yonko made Whitebeard an adversary, Shanks met with him personally to warn him to keep his distance from Blackbeard, and prevented another Yonko, Kaido, from reaching Whitebeard, which enabled him to arrive at Marineford without any hindrance. After Whitebeard's death, Shanks saved Whitebeard's crew and the other allies and gave Whitebeard and Ace a proper burial."}], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "Not much is known about the relationship between Shanks and Kaido. When Kaido tried to stop Whitebeard from going to Marineford, Shanks intercepted him to allow the other Yonko to rescue Ace. It is not known what happened during their encounter, but Shanks arrived at Marineford unharmed."}], "images": []}, {"title": "Eustass Kid", "level": 4, "content": [{"type": "paragraph", "text": "No direct interaction has been shown between the two, but Kid has formed an alliance with fellow captains Basil Hawkins and Scratchmen Apoo to overthrow him. Kid also confirms that he lost his arm in an encounter with the Red Hair Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "As a former member of the Roger Pirates, captain of the Red Hair Pirates, and one of the Yonko in the New World, Shanks is known to be one of the four strongest pirates in the world. However, not much is known about Shanks' powers and abilities in detail."}, {"type": "paragraph", "text": "Shanks is the youngest of the Yonko, being on equal level with the more experienced Kaido, Charlotte Linlin, and even Whitebeard, who was feared as the strongest pirate in the World. Rockstar also used his captain's name to convey to Whitebeard the importance of the letter he delivered to him. It was also stated by the Five Elders that he is one of the few people capable of stopping Teach.Admiral Akainu fought through many men, a couple of Whitebeard's division commanders, and a few Shichibukai to get to Luffy, but did not challenge Shanks when the Yonko appeared. Members of the Worst Generation such as Eustass Kid, Scratchmen Apoo, and Basil Hawkins had to ally with each other to have a possibility of overthrowing Shanks."}, {"type": "paragraph", "text": "As a member of the Yonko, Shanks' name alone commands great power, as Buggy himself proved. His assertion that he previously had a \"brotherly bond\" with Shanks was one of the many things that earned him respect from the Impel Down inmates. In addition, Buggy did not shy from using the names of Shanks and his previous captain, Gol D. Roger, to maintain his respect among them. Even the fact that Buggy was seen back talking to Shanks was seen as a testament of Buggy's power to the former prisoners, who were not aware that the two had always acted like this and mistakenly thinking that it was because Buggy was not afraid of a Yonko. Shanks commands enough power to end the war at Marineford with just words. When he stated that there was to be no more fighting, no one stepped up to challenge him, even though the Marines were fired up after the death of Ace and Whitebeard. When Shanks offered to fight the very overconfident and pompous Blackbeard (who moments before had boasted about destroying the island and taking down Fleet Admiral Sengoku and Vice Admiral Garp after having already killed Whitebeard), Blackbeard declined and decided to leave, as it was too soon for him and his crew to take on Shanks. Furthermore, when Shanks requested that Whitebeard and Portgas D. Ace's dignity at death not be violated, Sengoku himself decided to call off the war and offered to take responsibility, showing that despite being a pirate, Shanks has earned Sengoku’s respect, something that no pirate other than the late Whitebeard is known to have achieved. He also possesses enough influence to gain an audience with the Five Elders, who like the leaders of the World Government would normally consider him an enemy. Although he did have to wear a hood to hide his identity to not cause trouble."}], "images": []}, {"title": "Leadership", "level": 3, "content": [{"type": "paragraph", "text": "According to Brannew, one of Shanks' greatest attributes is his leadership and charisma, having managed to earn the absolute trust and loyalty of the most talented and capable individuals from the four seas and Grand Line all noted for having particularly high bounties and recruited them into his crew. The most prominent are his officers: Benn Beckman of North Blue, Yasopp of East Blue, and Lucky Roo of South Blue. This made Shanks's crew extremely well balanced and impregnable, able to contend equally with the enormous military power of Charlotte Linlin's Big Mom Pirates, Kaido's Beasts Pirates, and Edward Newgate's Whitebeard Pirates."}], "images": []}, {"title": "Stealth Master", "level": 3, "content": [{"type": "paragraph", "text": "Shanks proved to be extremely skilled at infiltration and stealth, as shown when he successfully managed to infiltrate Mary Geoise by wearing only a cloak, a noteworthy feat considering that for most pirates, entering through Mary Geoise without being invited or enslaved is practically considered an impossible and unthinkable feat. He also avoided detection from the many guards and marines present."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Shanks has tremendous physical strength as he was once a rival to Mihawk, a master swordsman with tremendous power that could overwhelm Zoro in terms of brute force with immense ease. Even with only one arm, Shanks can apply tremendous power to his swordsmanship, able to easily match Whitebeard, a gigantic man, who could completely overpower giants and an entire army of powerful and skilled Marine officers. With his physical strength combined with Busoushoku Haki, Shanks could defend against Akainu's magma fist which has extremely destructive offensive power that could burn powerful enemies such as Jinbe, Ace, and even Whitebeard."}, {"type": "paragraph", "text": "Shanks possesses an immense amount of endurance and tolerance to pain. Even after having his arm bitten off by a Sea King that attempted to devour Luffy, Shanks was completely unfazed despite the heavy bleeding and simply used Haoshoku Haki to scare off the Sea King."}, {"type": "paragraph", "text": "Shanks is also an excellent swimmer, having once swim deep into the ocean depths to save Buggy from drowning and also swim a long distance fast enough to saved Luffy from being devoured alive by a Sea King."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "As the former rival of Mihawk who is known as the world's greatest swordsman, Shanks himself is an immensely powerful swordsman. Shanks could match a blow from Whitebeard with only one arm, which is a testament of his prowess in swordsmanship. Shanks is also powerful enough to easily defend against Akainu's magma fist using only his sword and Busoshoku Haki."}, {"type": "paragraph", "text": "Shanks appears to have favored his left arm before he lost it, as he is always seen holding his sword in his left hand during flashbacks. He is presumed to have been left-handed."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Shanks is one of the very small number of people in the world who can use all three types of Haki. Even Whitebeard complimented Shanks for his Haki when he used it on his visit."}], "images": []}, {"title": "Haoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Shanks can use Haoshoku Haki, an ability that only one in several million people can use."}, {"type": "paragraph", "text": "After saving Luffy from a Sea King, Shanks frightened it off with a single angry glare using this ability. Later, while Shanks was boarding Whitebeard's ship for their meeting, a large number of Whitebeard's crew (experienced men who have survived in the New World) lapsed into unconsciousness and the ship itself began to take physical damage from Shanks' mere presence. Whitebeard's men attributed this to his superior Haki."}, {"type": "paragraph", "text": "Oda mentioned in an SBS that Shanks could have knocked out all 100,000 pirates and fish-men opposing the Straw Hats during the Fish-Man Island Arc with his Haoshoku Haki (Luffy managed to overwhelm 50,000)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c0/Shanks%27_Haoshoku_Haki.png/revision/latest/scale-to-width-down/210?cb=20150410153012", "caption": "Shanks' Haoshoku Haki knocks out the weaker members of Whitebeard's crew."}]}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Shanks has great mastery over Busoshoku Haki, as shown during the Battle of Marineford, with his Haki infused sword he easily blocked Akainu's magma enhanced punch that is powerful enough to burn the strongest enemies such as Ace, Jinbe, and even the Yonko Whitebeard."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Shanks possesses the ability to use Kenbunshoku Haki. He has been seen using it while on Whitebeard's ship when dodging the jug thrown at him by Whitebeard after their discussion and in the video game One Piece: Pirate Warriors 3."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "So far, Shanks has only wielded a sword named Gryphon in combat. Gryphon is a large saber with a single edge blade and a large hand guard."}, {"type": "paragraph", "text": "Shanks has wielded four different swords at various points in the past aside from Gryphon. He used two different swords during his time as an apprentice pirate aboard Gol D. Roger's ship (one around the time Buggy ate the Bara Bara no Mi and another during a clash with the Whitebeard Pirates) and another one during his stay in Luffy's hometown. He was seen wielding a different sword during his meeting with Ace, which means he obtained Gryphon after the encounter with Ace."}, {"type": "paragraph", "text": "In One Piece: Pirate Warriors 3, Shanks wields a large firearm (either a shotgun or rifle) which he uses during certain combos. He also wields a similar weapon in One Piece: Burning Blood, though only as part of the moveset for his Strong World costume."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Shanks_Bringing_Out_His_Sword.png/revision/latest/scale-to-width-down/210?cb=20150601004719", "caption": "Shanks unsheathing his saber."}]}, {"title": "Video Game Only Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "This Isn't For Show: Shanks pulls out a large shotgun and fires it. Used by Shanks (Strong World) as one of his special attacks in One Piece: Burning Blood. He also uses the said gun as a part of his C2's full-input-finisher and his inverted C3's full-input-finisher in Pirate Warriors 3.", "elements": []}]}, {"type": "list", "elements": [{"text": "Betting on a New Era: Shanks charges towards the opponent and knocks them into the air with Gryphon, then pulls out his shotgun and shoots the helpless opponent. This Isn't For Show can be used afterward for a follow-up attack. Used by Shanks (Strong World) as one of his special attacks in One Piece: Burning Blood.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Apprentice Years", "level": 4, "content": [{"type": "paragraph", "text": "Shanks is originally from the West Blue. 30 years ago, at least when he was nine years old, Shanks was seen among the Roger Pirates with fellow apprentice Buggy. The two were seen reading a newspaper and Shanks looked with an unhappy smile on the news since it kept focusing on the Whitebeard Pirates. At this point, he is already wearing his straw hat, presumably Roger's."}, {"type": "paragraph", "text": "28 years ago, his captain was found to have an incurable disease. Later, they entered the Grand Line and recruited Crocus as ship doctor."}, {"type": "paragraph", "text": "At least more than 27 years ago, he spent most of his time together with Buggy, arguing over meaningless things, such as which pole was colder, the North or the South. Their constant bickering was met with annoyance by the crew's first mate, Silvers Rayleigh."}, {"type": "paragraph", "text": "Later, the crew spotted a nearby ship and was preparing to attack it. As they prepared for combat, Shanks and Buggy discussed the importance of treasure, with Shanks claiming that treasure is not the only important thing in a pirate's life. During a raid on an enemy ship, while the crew retrieved a Devil Fruit: Bara Bara no Mi, Buggy found a treasure map marking the location of a valuable underwater treasure which he did not plan to share with anyone. After the battle, the crew threw a party in celebration of their victory, and Shanks tried to invite Buggy to join them, as they had found a \"weird treasure\". That night, Shanks and Buggy talked about what they were planning to do after leaving the crew, and when Buggy claimed that he would gladly take Shanks as his crew member if it were not for his ideals, Shanks stated that he did not want to be Buggy's follower and that people with different beliefs like them should travel different paths. The two of them agreed that they would meet as enemies once they left the crew before Shanks told Buggy about how they had found a Devil Fruit, which he noted would sell for around 100,000,000 causing Buggy to improve his scheme."}, {"type": "paragraph", "text": "The next day, after Buggy ate a fake version of the Devil Fruit to trick the rest of the crew, Shanks came across him with the real fruit, forcing Buggy to hide it in his mouth. Shanks told Buggy to not steal too much food and walked away, but came back to tell him something that Roger just did, surprising Buggy, who accidentally swallowed the Devil Fruit. As Buggy was yelling at him, Shanks noticed the map Buggy had found earlier floating away, which prompted Buggy to leap into the ocean in pursuit of it. However, since Buggy could no longer swim, Shanks also leap into the ocean and saved him."}, {"type": "paragraph", "text": "27 years ago, while the crew was being confronted by Golden Lion Pirates, Shanks reminded Buggy not to worry since his body is immune to slashing attacks. Soon after, this battle was known as Edd War."}, {"type": "paragraph", "text": "25 years ago, Shanks offered Kozuki Oden his help to open Wano's border only to be politely declined by him."}, {"type": "paragraph", "text": "After Roger became Pirate King, the crew was disbanded in secret a year before his death. The members, including Shanks left the crew one by one."}, {"type": "paragraph", "text": "24 years ago, Shanks was among the attendant during Roger's execution at Loguetown. He was seen crying after his former captain passed away. Later, at the same place, he offered Buggy to join his crew but the latter refused him and the two went their own way."}, {"type": "paragraph", "text": "As a pirate, he took part in many things such as fighting with other crews and at some point they clashed with Whitebeard's crew."}, {"type": "paragraph", "text": "Despite the difference between them, both pirates were often seen together while they were on board the ship. This led Whitebeard to notice and even remember seeing a \"big nose\" with Shanks during their battles with Gol D. Roger."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Buggy_and_Shanks.png/revision/latest/scale-to-width-down/210?cb=20160823133821", "caption": "Shanks and Buggy as apprentice pirates on Gol D. Roger's crew."}]}, {"title": "The Rise of Captain Red-Haired Shanks", "level": 4, "content": [{"type": "paragraph", "text": "22 years before the current timeline, Shanks heard about a skilled sniper by the name of Yasopp and went to Syrup Village to recruit him. At some point in his life, Shanks met Marshall D. Teach, then a member of Whitebeard's crew. What exactly happened is unknown, but Blackbeard left Shanks with the 3 scars across his left eye. The exact date of that event is unspecified. However, there are signs indicating that those scars were made near the time of Roger's execution: while images of a younger Shanks depict him with his face unscathed, in two flashbacks (in Chapter 434 and Chapter 0), he has his face hidden by his hair and his hat."}, {"type": "paragraph", "text": "Shanks also fought often with Mihawk, and their battles were said to echo through the whole of the Grand Line. At some point, during his travels in the New World, Shanks came across the two rulers of the Mink Tribe, Inuarashi and Nekomamushi, and they became acquainted."}, {"type": "paragraph", "text": "12 years after the Roger Pirates' disbandment, Shanks arrived on Dawn Island, where he met a strange young boy named Monkey D. Luffy. Intrigued by the boy and enjoying the atmosphere of Luffy's village, he decided to make the island his crew's base for a short period of time, which turned into a year. Luffy quickly grew attached to the crew, so much so that he wished to join their ranks and become a pirate as well, but Shanks refused to allow the boy into his crew on the basis that he was too young."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b0/Shanks_knows_Yasopp.png/revision/latest/scale-to-width-down/200?cb=20171003201619", "caption": "Shanks meeting Yasopp."}]}, {"title": "Romance Dawn", "level": 4, "content": [{"type": "paragraph", "text": "One day, Shanks and his crew were parting in the Partys Bar, with Shanks denying Luffy the opportunity to join his crew because he felt the boy was too young and inexperienced. After tricking Luffy into drinking juice, Shanks told him that he and his crew would be leaving the village after two or three more trips, which Luffy said would give him time to learn how to swim. However, they were interrupted when Higuma and his bandits arrived and demanded sake, which Shanks and his crew had drank all but one bottle of. Shanks offered Higuma the last bottle, but Higuma smashed it over his head because he felt it was not enough. When Shanks tried to clean up the mess rather than retaliate, Higuma threw Shanks's food onto him and left, convinced that Shanks was a coward. Afterward, Shanks and his crew laughed over his humiliation, but Luffy, disillusioned by how Shanks refused to fight back, tried to leave, leading to Shanks discovering that he had eaten the Gomu Gomu no Mi when he grabbed Luffy's arm. Shanks told Luffy that this meant he could never swim again."}, {"type": "paragraph", "text": "A few days later, Shanks and his crew went out to sea, with Luffy being left behind once again. Eventually, Higuma returned and took Luffy as a hostage when the latter insulted him. As Higuma was preparing to kill Luffy, Shanks, having returned, appeared nearby and teased Luffy about his claim of having a punch as powerful as a pistol. Higuma warned Shanks to stay back, and when Shanks began to approach him, one of the bandits put a gun to his head. However, Shanks merely told the bandit to not point a gun at someone to scare them as Lucky Roo shot the bandit in the head, shocking the onlookers. When the other bandits claimed this was dirty, Shanks pointed out how he and his crew are pirates before telling Higuma that he will never forgive someone for harming his friend, no matter what their reasons may be. After Benn Beckman defeated the rest of the bandits, Higuma tried to claim that Luffy is the one who started this, but Shanks stated that it did not matter because Higuma had a bounty on his head, forcing Higuma to throw a smoke bomb and escape. Shanks expressed shock at Luffy having been kidnapped and frantically wondered what they should do."}, {"type": "paragraph", "text": "Soon afterward, Shanks caught up to Luffy, who had been thrown into the ocean by Higuma, and defended him from the Lord of the Coast, whom he scared away with a glare. However, as Shanks was comforting him, Luffy began crying over how Shanks had lost his left arm in defending him, only for Shanks to claim it was just an arm. Later, Shanks and his crew began preparing to leave the village. When Luffy told him that he would become a pirate on his own, Shanks claimed that Luffy did not have what it took to become a pirate, which prompted Luffy to angrily proclaim that he would gather his own crew to rival Shanks's and claim One Piece himself. Smiling at this, Shanks gave Luffy his straw hat and told him to return it once he had become a great pirate, causing Luffy to begin crying. As Shanks boarded his ship, Beckman told him that he believed Luffy would become a well-known pirate, which Shanks agreed with because Luffy reminded him of himself when he was younger."}, {"type": "paragraph", "text": "Shortly after, Shanks returned to the Grand Line, eventually arriving on the Sabaody Archipelago and meeting Rayleigh again. To Rayleigh's surprise, he had lost his trademark Straw Hat along with his left arm. When Rayleigh asked him why he excitedly started telling him about the young boy he met in East Blue who had spoken the exact same words as Gol D. Roger. Sometime later, Dracule Mihawk ceased dueling with Shanks because of his lost arm but he retained a casual standing with the latter and Shanks told him about Luffy."}, {"type": "paragraph", "text": "Six years after leaving Foosha Village and four years before Monkey D. Luffy began his pirate career, Shanks would become recognized as one of the Yonko."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Higuma_Mocks_Shanks.png/revision/latest/scale-to-width-down/210?cb=20130708223112", "caption": "Higuma insults Shanks."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Romance_Dawn_Arc.png/revision/latest/scale-to-width-down/200?cb=20170917155213", "caption": "Shanks gave Luffy his straw hat with the promise to return it once he had become a great pirate."}]}, {"title": "Meeting with Ace", "level": 4, "content": [{"type": "paragraph", "text": "A short while before the storyline he met Portgas D. Ace, who thanked him for saving his little brother. Shanks responded by throwing a party to celebrate, as he did not know Luffy had a brother."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime later, while Shanks and his crew were relaxing on an island after drinking too much, Mihawk arrived. After stating he had no interest in fighting him again, he showed Shanks that Luffy had gained a bounty of 30,000,000. Seeing Luffy had finally made his emergence, a gleeful Shanks had Mihawk stay as he threw another party despite his hangover from his previous drinking session."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6c/Shanks_smiles_at_Luffy%27s_bounty.png/revision/latest/scale-to-width-down/190?cb=20171002194637", "caption": "Shanks smiling after finding out about Luffy's first bounty."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Shanks later expressed an interest in Ace's pursuit of Blackbeard and sent Rockstar to deliver a note to Whitebeard concerning this matter. Angry that Shanks sent him a letter, Whitebeard told Rockstar his captain must come in person and bring plenty of good rum. Elsewhere, Shanks talked on a Den Den Mushi to Rockstar, where he laughed how the old man has not changed a bit and denied Rockstar the chance to redeem his honor against the Whitebeard crew before ordering him to come back. When Beckman questioned whether or not he should go to Whitebeard, Shanks told him that the crew should prepare for battle."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Whitebeard told Rockstar that Shanks would need to come to him in person if he wanted to deliver a message, the two Yonko finally met during the Jaya arc. At the Marine Headquarters, all Marines present were alerted about the news of the meeting of the two pirates . As both pirate ships approached each other, Whitebeard's men announced that Shanks was coming. When Marco warned the younger crew members to step back because they \"will not last\", they questioned why only to begin to fall unconscious and collapse one by one. Unfazed, Marco told the crew not to make a fuss about it as Jozu noted that Shanks's Haki is as strong as ever. Having arrived on the deck, Shanks apologized for his actions and claimed he was simply being cautious because Whitebeard's is still an enemy ship before telling Whitebeard he came to talk and had brought some \"healing water\". When Marco pointed out what Shanks had done, Shanks asked him to join his crew, which Marco angrily rejected."}, {"type": "paragraph", "text": "After sitting down to drink with Shanks, Whitebeard began reminiscing about the past, where he noted that Shanks used to be a simple apprentice on Roger's ship. When Whitebeard asked him if the \"Red Nose\" that was with him was still alive, Shanks revealed that he had not seen Buggy since they split up at Loguetown before revealing that he had heard rumors of Buggy still being a pirate. Whitebeard claimed that he could still hear the duels between Shanks and Mihawk that used to echo throughout the Grand Line before asking him what enemy he lost his left arm too, only for Shanks to state that he bet it on the \"New Era\"."}, {"type": "paragraph", "text": "Shanks noted that the scars over his left eye were currently aching and revealed that Blackbeard inflicted them before describing how Blackbeard deliberately avoided becoming notorious during his time on Whitebeard's crew. Shanks warned Whitebeard that Blackbeard would come for his position now that he had gained strength and started moving, and when Whitebeard asked him what he wanted him to do, Shanks asked him to stop Ace because he felt it was not the time for he and Blackbeard to fight. However, Whitebeard claimed that he needed to teach Blackbeard about morality and that Shanks was 100 years too early to tell him what to do. After finishing their sake, Shanks and Whitebeard drew their weapons and clashed, resulting in the skies above them splitting in two."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Shanks_vs._Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20170205001116", "caption": "Shanks and Whitebeard clash."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "As mentioned by Momonga, when Whitebeard began making his move towards Marineford to save Ace, Kaido attempted to take advantage of the situation to attack the Whitebeard Pirates. To the horror of the Marines, reports came in that Shanks had intercepted Kaido, creating a dispute between two of the four Yonko. While the two captains ended their confrontation with a stalemate, the Marines became greatly anxious about the possible problems that could arise from conflict between the two pirates."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the deaths of Ace and Whitebeard, Shanks suddenly arrived at Marineford, just in time to save Koby from being killed by Admiral Akainu. Commending the young Marine for his determination, Shanks told him that he had secured the \"seconds of courage\" to change the fate of the world with his brave words before proclaiming that he has come here to end the war. The Marines noticed the presence of the other Red Hair Pirates as they wondered how Shanks was able to arrive at Marineford so quickly, having fought with Kaido the day before."}, {"type": "paragraph", "text": "Calling out to Buggy, Shanks told him to give Luffy his straw hat and lied about rewarding him with a treasure map. When Lucky Roo asked him if he was sure that he did not want to see Luffy again after having not seen him for 10 years, Shanks admits he would like to do so before stating that it would be breaking their promise. After Trafalgar D. Water Law escaped with Luffy, an enraged Buggy called Shanks out on lying to him, but Shanks merely commented on how it has been a while since they last saw one another."}, {"type": "paragraph", "text": "After ordering Marco to withdraw in order to stop encouraging the battle, Shanks told the remaining Marine and Whitebeard Pirates that he and his crew would fight anyone who wished to continue the war. Shanks asked Blackbeard if he wished to do so, but Blackbeard decided to leave instead, having determined that it is not yet time to face Shanks. Shanks told the remaining Whitebeard Pirates and Marines to save face for him before telling the Marines that he wanted to give Whitebeard and Ace the burials they deserved. When Fleet Admiral Sengoku stated he would hand their corpses over to the pirates and that he would take responsibility for the Marines' actions, Shanks thanked him for doing so."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Shanks_Saves_Koby_From_Akainu.png/revision/latest/scale-to-width-down/210?cb=20130617023848", "caption": "Shanks saves Koby from Akainu."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b6/Red_Hair_Pirates_at_Marineford.png/revision/latest/scale-to-width-down/210?cb=20161030002517", "caption": "Shanks and his crew bring the war to a close."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later in the New World, the Red Hair Pirates attended Whitebeard and Ace's funeral with the Whitebeard Pirates to pay their respects. Marco thanked Shanks for ensuring that Whitebeard and Ace received proper burials. As he was leaving, Shanks quietly thought about how Luffy was handling Ace's death and noted that one must know both victories and defeat to become a real man."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Tomb_of_Ace_and_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20141206163731", "caption": "Shanks and Marco pay their last respects to Ace and Whitebeard."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "While attending a wedding at the ruins of a certain island, Shanks read the news of the Straw Hats' new bounties after the Dressrosa incident."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Shanks read the newspaper and looked forward to seeing Luffy again."}, {"type": "paragraph", "text": "Shanks later went to Mary Geoise to speak with the Five Elders in person about a certain pirate."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Shanks_in_Mary_Geoise.png/revision/latest/scale-to-width-down/200?cb=20190602025904", "caption": "Shanks in Mary Geoise to speak with the Five Elders."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Roger Pirates vs. Whitebeard Pirates", "elements": []}, {"text": "Roger Pirates vs. Golden Lion Pirates", "elements": []}, {"text": "Shanks vs. Marshall D. Teach (not seen)", "elements": []}, {"text": "Shanks vs. Dracule Mihawk (multiple times, none seen)", "elements": []}, {"text": "Shanks vs. Edward Newgate", "elements": []}, {"text": "Red Hair Pirates vs Kid Pirates (not seen)", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Shanks was first featured in the first pilot of One Piece Romance Dawn, Version 1 in the Shonen Jump specials showcasing upcoming artists, about a year and a half before One Piece began. Much of his storyline remained the same, with the major difference being that Higuma the Bear was absent from the story in this version. Another minor difference was that his arm was bitten off by a shark instead of a Sea King. Shanks himself is described as a Peace Main type of pirate."}, {"type": "paragraph", "text": "In the second pilot Romance Dawn, Version 2 of One Piece (featured in Weekly Shonen Jump magazine itself), Luffy got both his hat and the Devil Fruit he ate from his grandfather, not Shanks. According to Oda, the reason for not featuring Shanks was that he wanted Shanks to be kept a secret until One Piece was serialized so he would have a greater impact."}, {"type": "paragraph", "text": "Unlike Luffy, there was no real significant change in appearance from Romance Dawn V.1 to the final version. Even with the change of art style, aside from being drawn less realistically, he is the same, the only real exception being the absence of his black cloak, although he did wear a decorative short cape over his left shoulder at the end of the chapter."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Shanks_in_Romance_Dawn.png/revision/latest/scale-to-width-down/210?cb=20130211221112", "caption": "Shanks in Romance Dawn version 1."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, when Shanks is floating in the sea holding Luffy after losing his arm, blood can be seen dripping from his missing arm. In the anime, this blood is missing."}, {"type": "paragraph", "text": "The initial scene where Shanks meets Mihawk was very small in the manga. The anime extended this scene greatly. In the manga, Shanks asks Mihawk if he would join them in celebrating while in the anime, Mihawk is seen joining in Shanks's fun."}, {"type": "paragraph", "text": "Shanks' flashbacks of Luffy were extended and some of Buggy's were shown. Also, as the narrator talked about the war, scenes of Shanks inspecting Ace and Whitebeard's corpses were shown."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Shanks is mostly the center of the removal of alcohol-related alterations in the English dub by 4Kids. For example, the scene where Mihawk brought news of Luffy's coming suffered heavy cuts. Shanks still asks Mihawk to stay, but much of this scene was removed because of the alcoholic references, including references to him throwing a party to celebrate Luffy's coming. Thus, Shanks's fun-loving nature was lost, and instead, it depicted him with an evil tone; as Mihawk shows him Luffy's wanted poster, Shanks says that he can not let him leave, and the ensuing party was cut out due to the use of alcohol, leaving viewers to assume Mihawk's fate. Also, the scene was cut from its original episode and added at the end of a much earlier episode."}, {"type": "paragraph", "text": "In the process, many other scenes from the original episode were also cut from the 4Kids version and never shown, such as the scene showing Kaya and Luffy's hometown."}, {"type": "paragraph", "text": "He also speaks with an Australian accent in the English 4Kids dub."}, {"type": "paragraph", "text": "In the book The Anime Encyclopedia - A guide to Japanese animation since 1917 (2001), there was a short article about One Piece. In it there were two mistakes concerning Shanks; his name is written as \"Junx\" and he was written to have been saved by Luffy instead of the other way round. Of all these errors, the name \"Junx\" would remain in several revisited editions of the book."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Shanks_Convinces_Mihawk_to_Celebrate.png/revision/latest/scale-to-width-down/210?cb=20121222203105", "caption": "A scene cut from the 4Kids anime showing Shanks encouraging Mihawk to drink alcohol."}]}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Cameos and Crossovers", "level": 3, "content": [{"type": "list", "elements": [{"text": "Shanks has appeared in the game Jump Ultimate Stars for the Nintendo DS.", "elements": []}, {"text": "Shanks starred in the Mugiwara Theatre - Red-Hair of Class 3 - Sea Time written and drawn by Oda. The strip was done after he claimed first place in a poll for characters fans wanted to see appear in the Mugiwara Theatre series.", "elements": []}]}], "images": []}, {"title": "Cultural References", "level": 3, "content": [{"type": "list", "elements": [{"text": "A Japanese coast guard vessel, pretending to be a pirate ship during an exercise was caught on video using Shanks's Jolly Roger.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He was issued alongside Luffy and the Lord of the Coast in a One Piece Block Figures set featuring the Straw Hats and their past mentors/loved ones. He has featured in One Piece Gashapon sets. Another Gashapon set he featured in was the One Piece Full Color R Gashapon series. There was also a Plushie released for him. He was also featured in the Portrait of Pirates series."}, {"type": "paragraph", "text": "A note with many of the products produced featuring Shanks is that quite of few of them have a second arm hidden beneath his cloak (sometimes blackened out)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Shanks_Plushie.png/revision/latest/scale-to-width-down/210?cb=20070531081636", "caption": "Shanks DX Plushie."}]}, {"title": "Songs", "level": 3, "content": [{"type": "list", "elements": [{"text": "Katayoku no Taka", "elements": []}, {"text": "Talking Blues", "elements": []}]}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Jump Ultimate Stars", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Shanks has several traits that seperate him from the other Yonko:", "elements": [{"text": "Shanks is currently the youngest member of the Yonko.", "elements": []}, {"text": "Shanks is the only member confirmed to have not eaten a Devil Fruit.", "elements": []}, {"text": "Shanks is the only member who is not an Admiral of a Fleet.", "elements": []}, {"text": "Shanks is the only member of the original Yonko to not be a member of the Rocks Pirates.", "elements": []}, {"text": "Shanks is the only of the current members who is not an enemy of Luffy.", "elements": []}]}, {"text": "Shanks is the first character in the series to use Haoshoku Haki.", "elements": [{"text": "In fact, he was the first character to show any form of Haki.", "elements": []}]}]}, {"type": "list", "elements": [{"text": "In the 6th Japanese Fan Poll, Shanks is ranked the 11th most popular character in One Piece, making him the most popular of the Yonko.", "elements": []}, {"text": "In One Piece: Pirate Warriors 3, Shanks' taunt action allows him to put on sunglasses, which is a reference to his Strong World costume.", "elements": []}, {"text": "Shanks' favorite foods are kimchi fried rice and lobster.", "elements": []}, {"text": "In the anime, when Ace meets Shanks, it can be seen that Shanks still has both arms, even though he lost his left arm to the Lord of the Coast. This however, appears to be an error. This is corrected in the home release of the episode.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/80/Shanks_with_Left_Arm.png/revision/latest/scale-to-width-down/180?cb=20130622160829", "caption": "Shanks with his left arm in the anime."}]}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "According to Oda, Shanks is the one character that resembles himself the most out of all the One Piece characters, because of his cool and calm personality and stand-out attire.", "elements": []}, {"text": "In reference to Shanks and Buggy's \"which is colder\" question, a fan asked Oda who got it right. Oda went on to explain that the Arctic was just a mass of ice and the Antarctic was a continent, which was made of land. Since land is colder than the sea (and the Arctic is frozen sea whereas the Antarctic is frozen land), Shanks was correct and the South Pole is colder.", "elements": []}, {"text": "If a child asked Shanks for the Gomu Gomu no Mi, he'd tease them about being ten years too young to eat one.", "elements": []}]}], "images": []}]}