{"sections": [{"title": "Sanji", "level": 1, "content": [{"type": "paragraph", "text": "\"Black Leg\" Sanji, born as Vinsmoke Sanji, is the cook of the Straw Hat Pirates, as well as the former sous chef of the Baratie. He is also the third son and fourth child of the Vinsmoke Family, thus making him a prince of the Germa Kingdom, until he officially disowned them twice. Despite Sanji renouncing his surname Vinsmoke, the World Government labels it as part of his name on his wanted poster."}, {"type": "paragraph", "text": "He is officially the fifth member of the crew and the fourth to join, doing so at the end of the Baratie Arc. Since he was born in North Blue, he is the first Straw Hat not to originate from East Blue."}, {"type": "paragraph", "text": "He is one of the top four fighters in the crew alongside Luffy, Zoro, and Jinbe. His dream is to find the rumored chef's paradise, All Blue, which is where East Blue, West Blue, North Blue, and South Blue meet, along with their wildlife. Due to the events on Whole Cake Island, his current bounty is 330,000,000, giving him the third highest bounty in the crew after Luffy and Jinbe."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sanji is a slim, yet muscular, long-legged man with blond hair which he keeps brushed over one side of his face. Before the timeskip, this was the left side. After the two year timeskip, he switched his hairstyle so that it covers the right side. It also appears that Sanji's hair is less straight and scruffier after the timeskip."}, {"type": "paragraph", "text": "Among Sanji's physical traits are his distinctive eyebrows. Both form a spiral but at different ends. His right eyebrow forms a spiral at the outer end, while his left eyebrow forms a spiral at the inner end. However, his eyebrows curled in the opposite direction from his siblings, which curls in a counterclockwise direction (i.e to left side). Sanji's eyebrows curled in a clockwise direction (i.e to right side)."}, {"type": "paragraph", "text": "While Sanji's eyes usually seem black, he was depicted with grey-blue eyes in the anime at the beginning of Thriller Bark Arc. This is shown again during the Punk Hazard Arc, when Trafalgar Law switched Sanji into Nami's body, and her usual brown eyes became grey-blue in color."}, {"type": "paragraph", "text": "Sanji almost always wears a black, double-breasted suit with golden buttons and a tie together with a long-sleeved buttoned shirt of varying colors, usually orange, blue, turquoise, or black, with or without pinstripes. His outfit changes on a more frequent basis than most of the crew."}, {"type": "paragraph", "text": "As a child, Sanji wore a yellow shirt with the number \"3\" on it, white pants, brown boots, and a light yellow bandana around his neck. His hair was styled in the opposite manner as it is in the present."}], "images": []}, {"title": "Before the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "During the Drum Island Arc, he wore a brown coat with furry outlining."}, {"type": "paragraph", "text": "During the Alabasta Arc, he wore blue jacket-like attire suited for the desert in addition to orange sunglasses."}, {"type": "paragraph", "text": "During the Skypiea Arc, he wore a pink dotted shirt with black knee-length pants."}, {"type": "paragraph", "text": "During the Davy Back Fight Arc, he wore a lavender shirt with a blue tie."}, {"type": "paragraph", "text": "During the Water 7 Arc, he did not wear a suit jacket, but a black vest over an orange, pinstriped shirt."}, {"type": "paragraph", "text": "During the Thriller Bark Arc, he wore a dark blue shirt with a light blue tie, as well as his usual black suit jacket and trousers."}, {"type": "paragraph", "text": "During the Post-Enies Lobby Arc, he wore a darker lavender shirt with a red tie."}, {"type": "paragraph", "text": "During the Straw Hats' separation, Sanji was coerced into dressing as a typical okama, complete with a wig and heavy makeup, though reverts to his usual outfit and appearance sometime after that."}, {"type": "paragraph", "text": "He also wears dress shoes, mostly for his Black Leg Style. These shoes are extremely durable, and were designed to increase the power of his attacks, though he can attack sufficiently without them as shown in his fight against Kuroobi. Sanji is also a chain-smoker, and is rarely seen without a cigarette."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After the two year timeskip, Sanji now covers his right eye, shows his left eye, and has grown his hair just slightly longer. He also sports a dark anchor style facial hair, and stubble on his upper lip. Both his left and right eyebrow are curled to the right. Sanji's neck has gotten thicker as well, similar to Luffy and Zoro. He has grown taller, and therefore remains nearly the exact same height as Zoro. He wears a black double breasted suit with golden buttons and a yellow dress shirt together with a brown tie. In Punk Hazard, he wears a full black double breasted suit with golden buttons and a grey dress shirt together with a very light grey tie."}, {"type": "paragraph", "text": "While on Punk Hazard, Kin'emon used his unnamed Devil Fruit ability to give Sanji a double-breasted coat for the cold, as he was trapped in Nami's body because of Trafalgar Law."}, {"type": "paragraph", "text": "During the Dressrosa Arc, Sanji first wore a white dress shirt which he wore untucked, with a black tie, black trousers and a black, pinstriped waistcoat. Upon going incognito into Acacia, he wore a black double breasted suit, with a white shirt with the top button undone. In the anime he wears a blue tie as well. He also wore black glasses and a fake white beard and mustache. After being injured by Doflamingo, Sanji wore bandages around his chest and wore his shirt and suit jacket unbuttoned and over his shoulders."}, {"type": "paragraph", "text": "After arriving on Zou, Sanji sported a pair of sunglasses (with his hair still covering one of the glasses) an orange leather jacket, yellow trousers and a small backpack. He also slightly trimmed his beard. Later, he wore a black fur-trimmed coat over a dress shirt, and a beaded necklace."}, {"type": "paragraph", "text": "During the Whole Cake Island Arc, Sanji wore a white, frilled dress shirt as well as his usual black dress pants and shoes; he keeps the collar of the shirt upturned and the first few buttons undone. Later, his wrists are each fitted with a gold exploding wristlet (later revealed to be fakes), and his face is discretely covered by a transparent hi-tech mask given to him by his sister, to remove the facial swelling he received during a violent confrontation with his brothers. Once he departed for Whole Cake Chateau with his family, he was also clad in a red, single-shoulder royal cape held together with a golden chain and clasp. During the Tea Party, he wore a white tuxedo, comprising a dress shirt and ascot under a white vest, white trousers and shoes, and an open formal coat with a raised collar. After finishing the second wedding cake, Sanji disguised himself as one of the WCI 31 chefs by wearing a chef hat and a rag."}, {"type": "paragraph", "text": "During the Levely Arc, Sanji wore a dark long sleeve shirt with a light tie, dark pants, and a bandage wrapped around his right arm."}, {"type": "paragraph", "text": "In the Wano Country Arc, Sanji was given a yellow and white stripped yukata by Kin'emon with a top knot the same as Luffy and Zoro. Later, he dons the raid suit that was given to him by his family, which gives Sanji a presumably black Germa outfit and cape with the number 3 on it, as well as jet-propelled boots. Uniquely, it also gives him a mask to wear over his nose and mouth, as well as a pair of sunglasses and a set of earphones on the top of his head. It also slicks the front of his hair into two parts, one pointing up and one pointing down."}], "images": []}, {"title": "Non-canon", "level": 3, "content": [{"type": "paragraph", "text": "In the Movie 2, he initially appears he appears with a blue two-tone swimsuit. After the Trump Pirates stole the Going Merry with his clothes inside, he had to wear a white tuxedo with a red rose on the flap from a wedding store. Then he changes his clothes for a green jacket, with a gray shirt underneath, and black pants."}, {"type": "paragraph", "text": "In the Movie 3, he wears a dark brown jacket, with the chest area exposed, a white collar, and black pants. He also wears his orange glasses during the plot. Also momentarily, he wears an extravagant panda costume designed by Usopp."}, {"type": "paragraph", "text": "During the G-8 Arc, he infiltrates as a Marine cook, wearing a white cook uniform, a blue scarf on his neck, and a white chef hat."}], "images": []}]}