{"sections": [{"title": "Yarisugi", "level": 1, "content": [{"type": "paragraph", "text": "Yarisugi is a Marine Commodore of G-5 Unit 06."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yarisugi is an average sized and muscular man who wears a round hat with a short dark brim and a \"5\" at the front. He also has brown colored hair sticking out from the sides of his head to form a circle and a small black beard with a mustache of the same color, and a scar on his left cheek."}, {"type": "paragraph", "text": "Under a light fur-lined coat, he wears a bow-tie and a dark-colored leotard with the Marine symbol and \"G 5\" on it that goes from the middle of his chest to the middle of his thighs. He has three circular badges with dark-colored stars on them, two on the right of his coat, one on the left. He also has a belt strapped diagonally across his chest where he carries a sword. He wears metal greaves on his legs."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Yarisugi is a harsh and violent Marine, fitting the image of the G-5 branch where he works. Uncompassionate and unsympathetic, he kicked one of the citizens who was begging him to help find their children and even went as far as threatening the depressed citizens outright. He also tends to exaggerate things, saying, \"too\" in almost every sentence."}, {"type": "paragraph", "text": "Like most of the other G-5 Marines, Yarisugi enjoys torturing pirates. After Jinbe left Caribou at the G-5 base, Yarisugi quickly started coming up with ideas on how to torture him in the cruelest manner possible."}, {"type": "paragraph", "text": "In the anime, he is shown to have a crush on Tashigi, even getting a nosebleed from thinking about her and regrets that she has to work under Smoker instead of him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine commodore, he has command over lower ranking soldiers. He, along with the Marines of G-5, were strong enough to defeat Coribou, who held an impressive bounty of 190,000,000, as well as the rest of the Caribou Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries a sword, and he is shown using it in his fight against Coribou. He also uses the iron boots he wears, using them to kick a civilian quite hard."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was first seen on a certain island in the New World, telling parents that had lost their children that the children are all dead due to an accident at sea."}], "images": []}, {"title": "Caribou's Kehihihihi in the New World", "level": 4, "content": [{"type": "paragraph", "text": "After Jinbe left Caribou at the G-5 base, Caribou finds himself in Yarisugi's clutches. Yarisugi holds up Caribou's wanted poster while imagining some of the torture methods used by G-5. Just when Yarisugi and his men are about to burn Caribou at the stake, the Caribou Pirates arrive. After setting the stake on fire, he engages Coribou in combat and gets hit in the chest by his shovel. The G-5 Marines later defeat the Caribou Pirates, but Caribou manages to escape and flees on his pirate ship. Yarisugi holds Coribou at sword point as his brother abandons him. However, Coribou and the Caribou Pirates eventually manage to escape Yarisugi's clutches."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Caribou_Leaves_G-5.png/revision/latest/scale-to-width-down/180?cb=20130812085850", "caption": "Caribou escapes Yarisugi, who caught Coribou."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Yarisugi was present at New Marineford when the Marines intercepted a communication between Big Mom and Kaido."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yarisugi vs. Coribou", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name (やりすぎ, yari-sugi) means \"overdoing it\", which he has a habit of.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 68 Chapter 673 and Episode 599, Yarisugi makes his debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Information about Yarisugi is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 69 Chapter 687, cover story: Caribou's Kehihihihi in the New World Vol. 12.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 68 Chapter 673, Yarisugi suppresses the civilians", "elements": []}, {"text": "↑  One Piece Manga — Vol. 68 Chapter 673, Yarisugi claims that the children had all died", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 907.", "elements": []}]}], "images": []}]}