{"sections": [{"title": "Portgas D. Ace", "level": 1, "content": [{"type": "paragraph", "text": "Portgas D. Ace, born as Gol D. Ace and nicknamed \"Fire Fist\" Ace, was the adopted older brother of Luffy and Sabo, and son of the late Pirate King, Gol D. Roger and his lover, Portgas D. Rouge."}, {"type": "paragraph", "text": "He was adopted by Monkey D. Garp as wished by Roger to him before his birth. Ace was the 2nd division commander of the Whitebeard Pirates and one-time captain of the Spade Pirates. He also is the central character from Ace's Great Blackbeard Search Cover Page Serial."}, {"type": "paragraph", "text": "Hunted by the World Government for his lineage, Ace was captured and sentenced to death, which resulted in the Battle of Marineford in an all out clash of powers. Ace was freed, but he sacrificed his life to protect his younger brother from Akainu."}, {"type": "paragraph", "text": "His death ultimately proved to be the catalyst leading to Luffy training for two years to become strong enough to protect his friends, paving the way for the second half of the series."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ace was a tall muscular young man with curly black hair. Although they were not blood related, Ace looked remarkably like his foster brother, Luffy. However, Ace was more serious looking than Luffy's lighthearted design, and was also taller and more muscular. He also sported rather childish freckles (inherited from his mother), and tended to make a skeptical facial expression by raising his left eyebrow. Interestingly, his facial features were almost akin to his biological father Gol D. Roger in his youth without his mustache."}, {"type": "paragraph", "text": "Ace's tattoos were among his most remarkable, trademark features. He had a tattoo on his back of the Whitebeard symbol—purple bones formed in a cross behind a purple skull with a white mustache—that he described as his pride and joy. Ace had another tattoo on his upper left bicep that spells \"ACE\" vertically. The \"S\" crossed out is a tribute to Sabo as that's his jolly roger. On the cover of Chapter 596 indeed, Ace's tattoo is written as \"ACE\" instead of the original \"ACE\" as the cover is a \"what if\" image of Ace, Luffy, and Sabo together as adults with the former being known to be alive."}, {"type": "paragraph", "text": "Ace wore an open-front shirt until he received Whitebeard's tattoo - afterwards, he stopped wearing anything over his upper body except when on winter or desert islands due to the weather requirements. He wore black boots, black knee-length shorts with an eyelet-studded orange belt, and a blue pouch belted around his left leg. He also wore a short second belt with a large red \"A\" on the silver buckle over his right hip, but left it unfastened and threaded the free end along the back of his shorts. A dagger in a green sheath hung at his left hip. On Ace's left arm, he wore a Log Pose and a red and white striped bracelet around his wrist, an orange elbow guard, and his \"ASCE\" tattoo. He wore a red beaded necklace and an orange hat with two blue smileys, one frowning and one smiling, and a string of red beads sitting above the rim. Two long orange side straps hung down sides of his hat and met at a large medallion of a bull's skull with orange tassels."}, {"type": "paragraph", "text": "Unfortunately, Ace lost his trademark hat, which he already had when he began his journey as a pirate, on Banaro Island as a result of his duel with Blackbeard. His knife was also apparently confiscated, as he no longer had it in his next appearance as a prisoner at Impel Down. The tattoo upon his back that he took so much pride in was later destroyed by the same blow that eventually led to his death. However, at his grave, Ace's hat and knife were placed at his tombstone—either they were retrieved, or they were duplicates in Ace's possession."}, {"type": "paragraph", "text": "During the ending credits in the second movie, Clockwork Island Adventure, previews of upcoming characters from the Baroque Works Saga were featured. Ace was also included amongst the many characters, but while his clothes were almost identical, he boasted a very different color scheme to the one he was given in his official appearance in the anime."}, {"type": "paragraph", "text": "As a child, Ace is shown to have often worn t-shirts with two-kanji phrases on the front (such as \"innocence\" and \"violence\"). On some occasions they are linked to the scene in which they were worn, like \"independence\" when the three brothers built their own tree house to live in. He often wore knee-length shorts and a black elbow guard on his left arm. Ace was always seen wearing dark brown, flat, slipper-like shoes, and in the winter, he wore a green cardigan over his normal clothes."}, {"type": "paragraph", "text": "Upon leaving Dawn Island at the age of 17, he wore an outfit identical to the one he wore when he first met Whitebeard; however, he was less muscular than he eventually grew to be and had rounder, more childlike facial features."}], "images": []}]}