{"sections": [{"title": "Flare", "level": 1, "content": [{"type": "paragraph", "text": "Flare is a character from Eiichiro Oda's One-Shot Monsters."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Flare is a young girl with shoulder-length dark brown hair and dark green eyes. She wears a white shirt with line patterns and an orange apron over it. She looks very similar to Nami before the timeskip."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Flare is a kind girl, giving Ryuma, who had starved for five days, free food. She is also trusting and caring, as she was affectionate towards Cyrano for supposedly saving her life, but turned out to be using her, which led her to cry when she discovered the truth."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Flare was a little girl, her hometown was attacked by a dragon. Her house collapsed, trapping her parents under the rubble, but Flare managed to get out and tried to seek help. She eventually found a swordsman named Cyrano, and asked him to help her parents before passing out from her injuries. When she woke up, Cyrano told her he could not do anything for her parents and only managed to save her."}], "images": []}, {"title": "Monsters", "level": 3, "content": [{"type": "paragraph", "text": "Years later, Flare works as a waitress for the restaurant Gérard. Shortly after she meets back with Cyrano, she sees Ryuma peering through a window of the restaurant, starving. She lets him in and offers him a free meal, for which Ryuma thanks her, and tells her he is indebted to her. Just as Cyrano is about to leave, she witnesses as Ryuma challenges him to a duel after both swordsmen's sheathes accidentally came into contact. Before Ryuma could take the duel too far, however, she yells at him to stop, to which he immediately complies. She then resumes working until she hears some commotion outside. She goes to see what it is, and sees the townspeople angry at Ryuma, and accusing him of being responsible for causing a man named D.R. to summon a dragon. As soon as she hears this, Flare becomes enraged and slaps Ryuma, calls him an assassin, and tells him that she would have left him to starve if she had known what kind of man he was. Before Ryuma can try to explain himself, Flare yells at him to stay quiet, telling him that he would have never dared doing such a thing if he knew how terrifying and powerful dragons really are. Cyrano then arrives, and proposes to fight the beast himself. Flare tries to convince him otherwise, but Cyrano tells her he knew that this day would come ever since he saved her from the fire ten years ago, that in spite of his best efforts, he failed to retrieve the Dragon Horn to avoid a tragedy like this to happen again, and that fighting the dragon was the least he could do."}, {"type": "paragraph", "text": "After the entire town was evacuated, Flare is seen at the restaurant, pondering over what Cyrano said earlier. Ryuma comes in, telling her that he heard she was the sole survivor of a dragon's attack ten years ago, but Flare just tells him to leave. After Ryuma asks if dragons are really as terrifying as people said they were, Flare remembers the image of a dragon destroying her hometown, and starts running to try and stop Cyrano from fighting the beast. Ryuma catches up with her and tells her that it's pointless to try and reason him, but Flare replies that Cyrano intends to sacrifice himself for the town because Ryuma refuses to take responsibility for what he's done. The samurai then notices something behind Flare, and tells her to leave the town immediately, without turning back. However, the young girl does not listen, turns around, and sees Cyrano and D.R. looting the town. Horrified, she and Ryuma hide behind a wall, and listen to the two criminals gloating and laughing about what they have done, and Flare learns the truth about the dragon incident from ten years ago. It was actually Cyrano and D.R. who caused it, in order to loot the young girl's hometown. They slew all the townspeople, including Flare's father, but except for Flare herself, who the criminals used to gain prestige. The incident between D.R. and Ryuma was a setup as well. Flare apologizes to Ryuma for calling him an assassin earlier. The samurai points out that learning this truth does not seem to bother her that much, but Flare replies that she does not feel sad as much as she is furious, saying that crying would only make Cyrano and D.R. happier. Ryuma tells her to leave the town, but Flare goes back to the restaurant instead, and breaks down in tears."}, {"type": "paragraph", "text": "She is later seen on the roof of the restaurant, contemplating the sky and the incoming dragon, saying to herself that she might as well die here, and disappear along with the town. She then watches in surprise as an enrages Ryuma rushes to the dragon and slays it with one mighty slash of his sword. She then goes down to see him, and wonders why he did not leave. Ryuma tells her to go on living, as death is not much fun. Flare then asks him why his name is unknown, despite how incredibly strong he is, and how he took many great risks to protect the town, and Ryuma answers that a battle is not measured by whatever fame you gained through it, but rather by what you fought for. He also tells her that because he fought two battles, she now owes him a free meal, and that he will come back for some. Flare smiles as the samurai leaves, and the rest of the town comes back and sees the dead dragon on the ground. She then listens as the owner of the restaurant Gérard tells her that he now remembers that Ryuma's nickname is \"The King\", an epithet he got from the many people he saved."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Monsters — Flare is introduced.", "elements": []}]}], "images": []}]}