{"sections": [{"title": "Usopp", "level": 1, "content": [{"type": "paragraph", "text": "\"God\" Usopp is the sniper of the Straw Hat Pirates and the former captain of the Usopp Pirates. He was born in Syrup Village and was first mentioned by Yasopp, his father. Despite his normal cowardice, Usopp dreams of becoming a brave warrior of the sea just like his father and lives every day in pursuit of living up to this dream."}, {"type": "paragraph", "text": "Before join to the crew, he acts as the main ally of the Straw Hat Pirates during the Syrup Village Arc, joining at the end of the same arc, being officially the third (unofficially fourth) member of the crew, and the third to join. He left the crew during the Water 7 Arc, being after Nami, Chopper and Robin, the fourth to rejoin, doing so at the end of the Post-Enies Lobby Arc. His original bounty of 30,000,000 was credited to his alias and alter-ego \"Sogeking\"."}, {"type": "paragraph", "text": "During the events in Dressrosa, Usopp awakened his Kenbunshoku Haki, making him the fourth member of the Straw Hat crew to demonstrate and use a form of Haki."}, {"type": "paragraph", "text": "His current bounty, 200,000,000, is a huge jump from his original, due to his role as \"God\" for saving all the toy slaves in Doflamingo's underground trades. This took him from the third lowest bounty of the crew to the fifth highest, jumping past the previous holder, Nico Robin, who has since dropped to fifth place after the events of the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [], "images": []}, {"title": "Before the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Usopp is a slim tan-skinned teenager with medium-length black woolly hair, prominent lips and a long nose, which is apparently an allusion to Pinocchio (a wooden boy from a story of the same name who possessed a nose that would stretch after he lied). Usopp inherited his famous nose from his mother, while the rest of his face closely resembles his father's. During the Straw Hat separation, after landing in the Boin Archipelago, Usopp grew obese from overeating."}, {"type": "paragraph", "text": "Like the rest of the males of the crew, he wore one outfit for the majority of the series before wearing different clothing by the end of the Paradise. Usopp usually wore an olive green plaid bandanna, a blue and white striped armband on his left arm, along with special sniper goggles (he also has a pair of clear rectangular goggles that he sometimes wears in situations where he does not have his sniper goggles, like when he first met the Straw Hat Pirates or when his sniper goggles were stolen by Mr. 2), brown overalls with a white sash and no shirt underneath. He also carries with him a yellow satchel, which he stores all his tools and gadgets in."}, {"type": "paragraph", "text": "During the Drum Island Arc, he wore a brown jumper with white fur collar and cuffs, faded yellow gloves and grey pants with a black \"c\" pattern."}, {"type": "paragraph", "text": "During the walk through the desert in the Alabasta Arc, he wore a brown keffiyeh under his goggles and a dull green and black striped desert cloak."}, {"type": "paragraph", "text": "During the Skypiea Arc, he wore a murky green shirt underneath brown overalls and some bandages on his torso and arms after getting attacked by Enel. "}, {"type": "paragraph", "text": "During the final game of the Davy Back Fight, he wore a yellow zip-up coach jacket, a red towel around his shoulders, and silver sunglasses with purple lenses. Usopp was also trusted with Luffy's Strawhat which he wore on his head. "}, {"type": "paragraph", "text": "During the Water 7 Arc, he wore bandages under his overalls again after being attacked by the Franky Family."}, {"type": "paragraph", "text": "While on board the Puffing Tom he put on a gold colored sun-like mask he found in a compartment over his goggles and wore a red cape, calling this superhero persona \"Sogeking\". Usopp wore this costume for the rest of the Enies Lobby Arc. "}, {"type": "paragraph", "text": "During the Thriller Bark Arc Usopp wore a purple cape and a wide brim purple hat with a necklace of garlic to ward off evil creatures. "}, {"type": "paragraph", "text": "During Sabaody Archipelago Arc Usopp wore an unbuttoned turquoise shirt instead of his overalls and some green shorts with a yellow flower pattern on one leg."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After the two year timeskip, Usopp has become much more muscular than before and has grown his hair out. He has become \"manlier\" and is slightly taller than before."}, {"type": "paragraph", "text": "Usopp now has a new pair of goggles around his neck (his sniper goggles weren't shown) and has some headphones or ear protectors on. He also now has a little goatee along with a new white suncap he wears on his head. He also has a new pair of rolled-up yellow pants with red suspenders and a pair of boots."}, {"type": "paragraph", "text": "His trademark yellow satchel has been replaced with a red one, but he still has his blue and white striped wristband on his left arm."}, {"type": "paragraph", "text": "During the Punk Hazard Arc, he wore a purple coat with light blue lining on the sides, which he took from one of Brownbeard's Centaur Patrol Unit."}, {"type": "paragraph", "text": "During the Dressrosa Arc, he wore an orange open jacket with a ring of circles on the arms and a red cap which has a pointy stub on the end, which he used to make the Dwarves believe he was a descendant of Noland."}, {"type": "paragraph", "text": "During the Zou Arc, he wore a light green short-sleeved collared shirt buttoned up halfway with a short, black line on the middle of each sleeve and a dark green cap with his signature goggles resting on top of it."}, {"type": "paragraph", "text": "In the Wano Country Arc, Usopp wears a light blue yukata that is black and white striped at the bottom as well as a green bandana adorned with a frog and fake old man beard."}], "images": []}, {"title": "Non-canon", "level": 3, "content": [{"type": "paragraph", "text": "In the Movie 2, he initially appears he appears with a red and white striped swimwear. After the Trump Pirates stole the Going Merry with his clothes inside, he had to wear a brown kimono and a black hat from a wedding store. Then he changes his clothes for an orange jacket and dark green pants, returning to wear his usual bandanna."}, {"type": "paragraph", "text": "In the Movie 3, he wears a overalls with camouflage print, his white sash at the waist. He also wears his orange glasses during the plot. Also momentarily, he wears an extravagant lion costume designed by himself."}, {"type": "paragraph", "text": "During the G-8 Arc, he infiltrates as a Marine soldier, wearing a Marine uniform and cap."}], "images": []}]}