{"sections": [{"title": "Cyborgs", "level": 1, "content": [{"type": "paragraph", "text": "A cyborg is a human or other life form that has been modified with machinery and metal for better functioning. These mechanical enhancements can include cybernetic replacements for missing organs or body parts, metal skin for extra protection, and weapons installed somewhere in the body."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cyborgs have mechanical parts, which are usually visible on the outside. The Pacifista appear to have no visible mechanical parts at all but some are seen hidden underneath their clothes. Aside from this, they may appear as a normal human or animal on the outside. Modifications may be more apparent when they receive wounds as they may leave their mechanical parts exposed."}], "images": []}, {"title": "Biology", "level": 2, "content": [{"type": "paragraph", "text": "In the series, cyborgs are rare, as the technology required for their creation is somewhat advanced."}, {"type": "paragraph", "text": "Though they have mechanical parts, so long as their brain is not altered in any way, these cyborgs maintain their free will. As shown with Bartholomew Kuma, cyborgs with their brains modified lose their free will. This leaves them \"dead\", reducing them to being nothing more than a tool. It is also claimed by Donquixote Doflamingo that such cyborgs have no memories or recollections of their past lives."}, {"type": "paragraph", "text": "Indeed, Kuma has become obedient to the words of the World Government he once hated so much. In an earlier instance when Luffy hears a \"heartless\" remark from Franky, he asks him if he replaced his heart, to which he apologizes in metaphoric terms that he \"never meant to go that far\". This confirms Franky, unlike Kuma, has not lost his humanity."}, {"type": "paragraph", "text": "They can also be made from the corpses of the dead as well as the bodies of the living. The one thing they all share in common is they are still capable of bleeding."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/77/Kuma%27s_Cybernetic_Enhancements.png/revision/latest/scale-to-width-down/210?cb=20160127232838", "caption": "Kuma receives a wound that exposes his otherwise hidden mechanical parts."}]}, {"title": "Overall Strength", "level": 2, "content": [{"type": "paragraph", "text": "Their mechanical parts put them at high advantage against normal humans, their strength is normally far greater than a normal humans and each cyborg is essentially a living weapon. Those who are cyborgs often have an advantage in battle, as they are more powerful than regular humans in both offense and defense."}, {"type": "paragraph", "text": "Amongst the cyborgs themselves, capabilities and power varies per individual design; more advanced models may be superior to less advanced cyborgs as Kuma proved against Franky. Often Cyborgs can be mistaken for Devil Fruit users given their abilities, as Luffy thought when Franky demonstrated fire breath, although this does not prevent cyborgs from actually obtaining Devil Fruit powers, as Kuma ate the Nikyu Nikyu no Mi."}, {"type": "paragraph", "text": "A cyborg with a Devil Fruit power will be placed above the overall capabilities of another cyborg of the same design, as seen with Kuma and the Pacifista replicas. Due to the rules of Devil Fruits, copying the exact abilities of one Devil Fruit to another of the same model of cyborg is impossible."}, {"type": "paragraph", "text": "However Dr. Vegapunk seems to have found a way of mimicking the powers of the Pika Pika no Mi (excluding the intangibility and super-speed) into the Pacifistas models, putting this particular model of cyborg above the potential power of others."}, {"type": "paragraph", "text": "Another advantage they have is being to able to recover completely after receiving what may be otherwise lethal damage to normal non-cyborg individuals. They can also be repaired, modified and upgraded in ways humans cannot."}], "images": []}, {"title": "Weaknesses", "level": 3, "content": [{"type": "paragraph", "text": "Even cyborgs are not without certain flaws that leave them vulnerable, since the modifications that they have received are generally man-made, there are usually some limits to the extent of what they can do. For example, Franky modified his right arm to function somewhat like a bludgeoning tool while modifying the left to house several gunner-type weapons. He could not possibly interchange both functions in both arms with each other whenever he feels like it. Also, because he personally made the modifications on himself, there were several restrictions when he converted his body into a cyborg, namely the place around his back area where he wasn't able to reach around with his arms, leaving it lacking with metallic reinforcement in comparison to the rest of his body."}, {"type": "paragraph", "text": "It is later revealed that, given that they were originally flesh and blood, vestiges of their former states still remain within a cyborg's body. Because of that, they can be heavily injured if they receive internal damage, as demonstrated by the Straw Hat Crew on one of the Pacifista copies that they fought on Sabaody Archipelago two years ago."}, {"type": "paragraph", "text": "Another weakness that cyborgs share is that unless they are modified, they do not grow stronger. This is shown when the Straw Hats encounter the Pacifistas after the timeskip, since these prototypes were (according to Sentomaru) only as strong as they were two years ago, they did not stand a chance against the \"Monster Trio\", who were able to grow incredibly strong."}, {"type": "paragraph", "text": "One other weakness that the cyborgs whose personality is erased (like the Pacifistas) seem to share, is that they, like zombies, seem unable to feel pain, and thus are unable to realize when they are in danger, though with their sensors and programming may counteract this to an extent (depending on what their programming is)."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Initially, the first cyborg Oda wished to release was Don Krieg, as Don Krieg-9000, but the idea was scrapped. Instead, the first one shown was Bartholomew Kuma, although it wasn't until some time after the second (Franky) was introduced that his cyborg status was revealed.", "elements": []}, {"text": "The kanji used to describe cyborg is \"kaizō ningen\", the same word used for the modified humans.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cyborg - A Wikipedia article on cyborgs.", "elements": []}]}], "images": []}]}