{"sections": [{"title": "Lucky Roo", "level": 1, "content": [{"type": "paragraph", "text": "Lucky Roo is an officer of the Red Hair Pirates. He is also the one who found the Gomu Gomu no Mi which was eaten by Monkey D. Luffy."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lucky Roo has a round body shape and he is always seen eating a rack of meat. He is shown wearing goggles over his eyes at all times. Out of the entire crew, he appears to have changed the least over the years and shows little in the way of aging. In every appearance, Roo is smiling happily no matter how serious the situation is, such as Shanks clashing with Whitebeard."}, {"type": "paragraph", "text": "He wears a green t-shirt with white vertical stripes on it, paired by a matching bandanna on his head, short white pants (beige in the anime) with a dark green sash around his waist, and green shoes with fur around the ankles. He has a yellow coat draped over his shoulders like a cape, with a fur-lined collar and red epaulets with black stripes on them."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Roo appears to be a very fun loving pirate who is often seen hanging around another one of Shanks's crew members, Yasopp. He seems to be one of Shanks's most trusted crew members, as he is always seen when the Red Hair Pirates are featured, usually when something crucial happens. He shares this trait with Benn Beckman and Yasopp. He is the first person to actually kill someone in One Piece and sets the stage for the series: A pirate's life is a dangerous one."}, {"type": "paragraph", "text": "He has a very large appetite and in the manga he is seen drinking a whole barrel of sake by himself in the background while the crew was at the bar Makino worked in. He is almost always shown with a large grin even during the war, holding a large rack of meat in at least one hand, except for one scene in Episode 316, where he is holding onto a rail without any sign of meat."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Roo's abilities, but being an officer of a Yonko crew, he is assumed to be very powerful. He was marked as very notorious by the World Government and Marines."}, {"type": "paragraph", "text": "Despite his round body, he was able to sneak up on a mountain bandit without being noticed."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He used a flintlock to shoot a mountain bandit that was threatening Shanks at point blank range."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He is originally of the South Blue. He took the Gomu Gomu no Mi from an enemy ship."}], "images": []}, {"title": "Romance Dawn Arc", "level": 3, "content": [{"type": "paragraph", "text": "Lucky Roo was first seen in Luffy's past amongst Shanks' crew. He joined in with his crew's fun while they were bragging about a pirate's life in front of Luffy. He was next seen supporting his captain when a bandit pulled a pistol on him and threatened to kill him by killing the bandit first."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Red_Hair_Pirates_at_Foosha_Village.png/revision/latest/scale-to-width-down/210?cb=20160823155239", "caption": "The Red Hair Pirates at Luffy's Hometown."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "Lucky Roo was present when Dracule Mihawk informed his former rival about Luffy's up-and-coming, something that surprised him. The crew threw another party, despite being already worn out by the last one."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Rockstar came back from Whitebeard, Lucky Roo was with Shanks and the others. He asked Shanks what he planned on doing, since Whitebeard had ripped up his letter."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Lucky Roo watched on as Shanks encountered Whitebeard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/ff/Red_Hair_Pirates_Watch_Shanks_Clash_with_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20140603014326", "caption": "Roo, Yasopp, and Beckman watch as their captain clashes with Whitebeard."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "His crew intercepted Kaido, and it can be assumed that he helped in this interception. Upon the Red Hair Pirates arriving at Marineford, he was shown standing alongside Shanks and the rest of the crew. He asked Shanks if he wanted to see Luffy again for the first time in ten years, with food in his mouth."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Lucky Roo was also seen present at Ace and Whitebeard's funeral somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Lucky Roo and Benn Beckman vs. Mountain Bandits", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Lucky Roo seems to have been the end product of redrawing of a previous fat member of Shanks' crew who appeared in the Romance Dawn in several panels. Notably, Lucky Roo appears in a panel that itself is a repeat from the original Romance Dawn, also in the same part the human chain when the crew is dancing about a pirate's life, he also has mirrored pose that is identical to the original fat crew member from the original Romance Dawn."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "\"Roux\" translates from French as \"russet-red\". Although his name can be written as either \"Lucky Roux\" or \"Lucky Roo\". He is known as \"Lucky Roux\" in the official English versions as well."}, {"type": "paragraph", "text": "In the 4Kids dub, the scene where Lucky Roo shoots the bandit was edited so that he instead shoots a cap gun near the bandit's head. Shanks was then given added dialogue, implying that the bandit just passed out, rather than being killed (\"When he wakes up, tell him it was a cap gun\")."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece Grand Battle 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "It is likely that his name is a reference to Lucky Luke, a fictional cowboy (gunfighter) from the \"Lucky Luke\" Franco-Belgian comic book, created by Morris de Bevere. Lucky Luke is known as \"The man who shoots faster than his shadow\".", "elements": []}, {"text": "Lucky Roo appeared shorter than Shanks in their first appearance in Episode 4 but he appeared taller than Shanks when they went to Marineford.", "elements": []}, {"text": "Lucky Roo is the first person to kill someone both in the anime and the manga, by shooting a mountain bandit in the head at point blank range.", "elements": []}, {"text": "Lucky Roo is the first person, named or not, to name a Devil Fruit.", "elements": []}, {"text": "Lucky Roo happens to resemble another pirate from another famous Manga artist Leiji Matsumoto, the creator of several anime and manga series. Many of which consist of Space Operas that involve pirates that sail the universe in search of righting wrongs and solving political and revolutionary idealisms. The character he resembles is named Yattaran, who himself is based off another manga artist Kaoru Shintani (best known for Area 88) who, in his early career worked for Matsumoto building models for reference. This could be a coincidence however it most likely is a small shout out to the earlier works of Leji and Kaoru both whom have been writing manga for much longer than Oda has.", "elements": []}, {"text": "Lucky Roo's favorite food is bird meat on the bone.", "elements": []}]}], "images": []}]}