{"sections": [{"title": "Yasopp", "level": 1, "content": [{"type": "paragraph", "text": "Yasopp, known as \"Chaser\", is an officer of the Red Hair Pirates and is the crew's sniper. He is also the father of Usopp and the husband of Banchina."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "His appearance is very similar to his son, Usopp. However, he does not share the same long nose and has blond hair, the former being a hereditary trait of Usopp's mother, as well as her darker shade of hair. Twenty years ago, Yasopp had the same tight curls and black hair as Usopp, and in Romance Dawn, his hair was styled in loose waves, but later appearances show him with it in dreadlocks. In addition to that, his body was more slim while in his latest appearance, it seems to have become more muscular."}, {"type": "paragraph", "text": "His name was written on his headband, while in his latest appearance, he has no headband and his name is written on his upper right arm. During his time in Foosha Village, he wore a dark-blue shirt, dark-green pants reaching down to his calves and blue shoes with buckles on them. He donned his headband at this time. At Marineford, he sports a dark A-shirt, short pants, standard boots and a large belt with a bag attached to it. There is also a little necklace around his neck. He retains his trademark star-patterned cape, and he has his rifle attached to his back via a band. He is also more muscular than his earlier appearance."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He shares many personality traits with his son, including being able to encourage the rest of his crew to join in with his fun. He is very proud of his son, Usopp, to the point where he would often talk about his son over and over again to Luffy, which led Luffy to recognize Usopp on sight from Yasopp's stories alone. During his time in Luffy's village, Yasopp felt close to Luffy because he is the same age as his son whom he left at home."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Usopp", "level": 4, "content": [{"type": "paragraph", "text": "Usopp is Yasopp's son. Usopp does not know much about his father, only that he is a member of Shanks's pirate crew, a fact that he takes great pride in. It is said by Merry back at Syrup Village that Usopp started lying that pirates were coming to the village, hoping that his father would come back, when his mother fell ill. While the Red-Haired Pirates were docked at Windmill Village, Yasopp often spoke fondly of his son to a young Monkey D. Luffy. Usopp greatly respects his father, and has inherited his phenomenal marksmanship."}], "images": []}, {"title": "Banchina", "level": 4, "content": [{"type": "paragraph", "text": "Banchina was Yasopp's wife. Bachina persuaded him to go and fulfill his dream to become a pirate. He did so and left her and their son to join Shanks twelve years ago. Banchina was proud of her husband and admired his braveness."}], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Yasopp first met Shanks in Syrup Village two years after Gol D. Roger's execution. Shanks had heard of Yasopp's sniping skills and recruited Yasopp to join his crew. Yasopp is shown to be very loyal to his captain and enjoys partying with him and the rest of the crew."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Vista", "level": 4, "content": [{"type": "paragraph", "text": "At the end of the Battle of Marineford, Yasopp and Vista were seen looking at each other with discontent. The Blue Deep databook mentions that something happened in the past between the two of them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fb/Yasopp_and_Vista_Look_at_Each_Other.png/revision/latest/scale-to-width-down/180?cb=20150421104319", "caption": "Yasopp and Vista look at each other."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of the officers of a Yonko’s crew, it can be assumed Yasopp is very powerful. He is marked as very notorious by the world government and Marines."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Yasopp is noted to be a tremendously skilled marksman, capable of shooting the antennae off of an ant at one hundred feet away without harming the rest of it. Luffy also stated that he had never seen him miss a shot. His reputation was such that when Shanks was looking for potential crew members, he sought out Yasopp who had apparently already made quite a name for himself."}, {"type": "paragraph", "text": "In a filler episode, Daddy Masterson was a highly skilled sniper of the Marines and was known as one of the best. However, Yasopp was easily able to defeat him in a duel."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Being a sniper, he carries guns around with him almost all the time. Early on he is seen carrying a flintlock pistol, but later he carries a musket."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Early Years", "level": 4, "content": [{"type": "paragraph", "text": "Two years after the Pirate King Gol D. Roger was executed and three years before Usopp was born, Shanks appeared on Gecko Island asking for a man named 'Yasopp' and introducing himself as a pirate."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Yasopp_at_Syrup_Village.png/revision/latest/scale-to-width-down/210?cb=20181105130532", "caption": "Yasopp being recruited by Shanks."}]}, {"title": "Romance Dawn", "level": 4, "content": [{"type": "paragraph", "text": "Eventually, when Usopp was young, Yasopp left his home to become a pirate and joined the Red Hair Pirates and followed them to Luffy's hometown."}, {"type": "paragraph", "text": "While at Foosha Village, Yasopp would often demonstrate his incredible shooting skills to Luffy, as well as tell him stories of his son, Usopp. He left the village with the others and sailed to the Grand Line."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "Dracule Mihawk visited the Red Hair Pirates and showed Shanks Luffy's wanted poster, which surprised Yasopp. He was hungover (as was the rest of the crew) but they threw another party anyway."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Yasopp was with his crew, when Rockstar came back from Whitebeard's ship. Even then in the cold snow, the crew was having a party."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Shanks decided to visit Whitebeard, Yasopp questioned Shanks's real intentions for attacking Whitebeard since he had apparently said he would not start a fight."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Yasopp arrived at Marineford along with the rest of the Red Hair Pirates to try and end the war. Yasopp was seen standing alongside Shanks and the rest of the crew, preparing for potential combat, but Sengoku accepted the truce and ended the war."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Shanks took Ace and Whitebeard and buried them on an unknown island somewhere in the New World. Yasopp and the rest of the crew, along with the Whitebeard Pirates, attended the funeral to pay their respects."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Yasopp and some members of the Red Hair Pirates were at the ruins of a certain island. He was in good spirits while reading a newspaper about the Straw Hat Pirates' new bounties."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Yasopp_newspaper.png/revision/latest/scale-to-width-down/180?cb=20160910200939", "caption": "Yasopp reading the newspaper"}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Red Hair Pirates vs. Higuma and his bandits", "elements": []}, {"text": "Red Hair Pirates vs. Kaido and his crew (unseen)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Yasopp vs. Daddy Masterson", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Yasopp seems to have been the final draft of a headband wearing crew member that appeared in several panels in the original Romance Dawn. Yasopp also has a similar pose in a panel that was reused in the final version. The panel was mirrored in the final version so Yasopp is on the opposite side of his Romance Dawn V.1 counterpart, although his pose itself is not mirrored. Similarly, both he and the Romance Dawn head band wearing member were also helping load supplies when it came time for the crew to leave in both stories."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime only, Yasopp revealed during a duel with Daddy Masterson that he had been a hopeless father who was unable to do anything for his wife and son."}, {"type": "paragraph", "text": "Luigia has stated that Yasopp was a liar when he was young."}, {"type": "paragraph", "text": "During the Marineford Arc, he attempted to fight the Blackbeard Pirates by showing his gun in a threatening manner to Van Augur."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "He was part of the rewrite used by 4Kids to cut out Laboon during the Reverse Mountain Arc. The scene he was used for involved finding their Log Pose."}, {"type": "paragraph", "text": "In the 4Kids version, the Log Pose was inside Usopp's pocket which was found when it fell out. Usopp had a \"flashback\" (the scene of Yasopp saying \"I can shoot the antennae off an ant\" was used to mouth the words) where he apparently told his wife that Usopp will find it useful when he becomes a pirate. However, while not a major plot hole, there is no indication that Yasopp or his wife had any ideas that Usopp would be a pirate."}, {"type": "paragraph", "text": "In the 4Kids dub, both he and his son Usopp are played by the same voice actor, Jason Griffith. In the original and Funimation Dub, they have different voice actors."}, {"type": "paragraph", "text": "In the 4Kids dub, his name written on his bandana is also edited out."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He was issued alongside his son Usopp in a One Piece Block Figures set featuring the Straw Hats and their past mentors/loved ones."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece Grand Battle 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, his name on his headband is misspelled as \"Yassopp\".", "elements": []}, {"text": "Yasopp's favorite food is the fish of the season.", "elements": []}]}], "images": []}]}