{"sections": [{"title": "Benn Beckman", "level": 1, "content": [{"type": "paragraph", "text": "Benn Beckman is the first mate and an officer of the Red Hair Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Beckman is a tall man, standing at a height of 206 cm. His hair was jet black and pulled back in a pony tail 12 years ago in Monkey D. Luffy's hometown; in the current storyline, his hair has turned gray and is cut short. He is never seen without his rifle nearby or a cigarette in his mouth. He also now has a large, X-shaped scar on his left temple."}, {"type": "paragraph", "text": "His outfit has changed very little over the years since his first appearance; he now wears a black, v-neck shirt with three quarter sleeves (whereas he is previously seen wearing a short-sleeved shirt of a similar color and design) along with loose pants (originally of a dark green color, but presently gray) with numerous pockets on them, tucked inside his buckled boots. Like most of the other Red Hair Pirates, he wears a sash around his waist, to which he attaches his rifle in a pistol-like fashion. The only thing added to his attire is his spiral-patterned cloak."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Beckman appears to be a lot less fun-loving and a lot more relaxed than the other members of the crew are, acting as the level-headed member. He, Lucky Roo, and Yasopp are some of Shanks's most trusted crew members, as they are always seen when the Red Hair Pirates are featured, usually when something crucial happens."}, {"type": "paragraph", "text": "At times, Beckman seems amused at the actions of his captain, such as panicking when Luffy is taken or getting even more drunk when he has already drunk a lot before and when Mihawk brings the news of Luffy's first bounty. He is the first to speak out among the crew whenever they appear. He also seems to be the first to ask questions about the crew's situation, such as whether the World Government would try to stop them from seeing Whitebeard."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Beckman has the highest IQ of anyone in the East Blue. He is considered by the Marines to be one of the strongest members of the Red Haired Pirates, being one of Shanks's officers. During the Battle of Marineford, Admiral Kizaru chose not to fight him, even though he had just fought the First Commander of Whitebeard's crew and Whitebeard himself. However, it should be noted that Kizaru did continue his attack on Luffy when Beckman came down to join the rest of the crew."}, {"type": "paragraph", "text": "Beckman also single-handedly defeated Higuma's crew of mountain bandits, afterwards telling Higuma to bring a warship as backup if he wanted to fight them."}, {"type": "paragraph", "text": "When the Red Hair Pirates arrived at Marineford to stop the war, Beckman was able to climb on to a Marine ship's mast and sit on it, all the while pointing his flintlock at Kizaru, a Kenbunshoku Haki user, without the latter noticing."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Beckman carries a flintlock rifle with him, but he has yet to fire it, instead using it as a club on Higuma's men and as a threat against Kizaru."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He is originally from the North Blue. How Beckman came to be a member of the Red Hair Pirates is unknown."}], "images": []}, {"title": "Romance Dawn", "level": 3, "content": [{"type": "paragraph", "text": "In Foosha Village, Beckman tried to explain Shanks's decision on refusing to take Monkey D. Luffy with him to sea. Unfortunately, he found that his captain left him in somewhat of an awkward situation, since he seemed to enjoy mocking the fact that Luffy could not swim, leaving Beckman to explain that Shanks really was not that happy all the time. Later on, after the Higuma incident, Beckman and Lucky Roo took on Higuma's men. He shocked Higuma by taking out every last bandit, leaving only Higuma standing."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Red_Hair_Pirates_at_Foosha_Village.png/revision/latest/scale-to-width-down/240?cb=20160823155239", "caption": "The Red Hair Pirates in Foosha Village."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Dracule Mihawk informed the crew about the up-and-coming Luffy, Beckman was surprised at this fact. With his crew, they celebrated and invited the Shichibukai to the party despite Shanks and his crew already being worn out from another party the night before."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Shanks's call with Rockstar, Beckman asked Shanks how he thought the government would react to him wanting to meet Whitebeard."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Beckman accompanied Shanks when he visited Whitebeard, and later watched unfazed while Shanks and Whitebeard clashed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/ff/Red_Hair_Pirates_Watch_Shanks_Clash_with_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20140603014326", "caption": "Beckman, Roo, and Yasopp watch as their captain clashes with Whitebeard."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Prelude to the Whitebeard War", "level": 4, "content": [{"type": "paragraph", "text": "Since Vice Admiral Momonga mentioned that the Red Hair Pirates had intercepted Kaido, it can be assumed that Beckman helped in this interception."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Battle of Marineford, Beckman prevented Admiral Kizaru from attacking Luffy and Trafalgar Law, telling Kizaru not to move a muscle while aiming his gun at him. Later, the Red Hair Pirates left the battlefield peacefully, taking Ace's and Whitebeard's bodies with them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Benn_Beckman_Stops_Kizaru.png/revision/latest/scale-to-width-down/240?cb=20130624092055", "caption": "Beckman stopping Kizaru."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Beckman later attended Ace and Whitebeard's funeral somewhere in the New World."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Benn Beckman attended a wedding at the ruins of a certain island."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Benn Beckman and Lucky Roo vs. Mountain Bandits", "elements": []}, {"text": "Red Haired Pirates vs Kid Pirates", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Beckman has been featured in One Piece Gashapon sets and Portrait of Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b6/POPNeoDX-Benn.png/revision/latest/scale-to-width-down/150?cb=20150311023456", "caption": "Beckman DX figure."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece Grand Battle 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the 4Kids English dub, Beckman's cigarette is edited out.", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "When Oda gave his name, Oda joked on how he is called \"Shofukutei Nezumi\" because he looks a little like a mouse. However according to Oda, that was Usopp lying.", "elements": []}, {"text": "Beckman's favorite food is kamaboko.", "elements": []}]}], "images": []}]}