{"sections": [{"title": "Gol D. Roger", "level": 1, "content": [{"type": "paragraph", "text": "Gol D. Roger, more commonly known as Gold Roger, was a legendary pirate who, as the captain of the Roger Pirates, held the title of Pirate King and owned the legendary treasure known as \"One Piece\". He was also the lover of Portgas D. Rouge and biological father of Portgas D. Ace."}, {"type": "paragraph", "text": "Roger was famed as the man who did what no one thought possible – he conquered the Grand Line and amassed a vast fortune. Afterwards, knowing that he would soon die from an incurable disease, Roger disbanded his crew before turning himself in to be executed. The World Government intended to have Roger be publicly executed to discourage piracy, but his last words had the opposite impact. He stated that anyone who can find his treasure can claim it. As such, this made Roger single-handedly responsible for starting the Golden Age of Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Roger was a tall man fairly muscular. His most prominent physical features were his curved black mustache, a fierce grin he almost always wore, and his intense eyes. He also had thick black hair and a short, thick neck."}, {"type": "paragraph", "text": "Like many other high ranking pirates, he wore a long red captain's coat. Beneath his coat, he wore a blue shirt and had a yellow sash around his waist. He wore a white cravat around his neck, dark blue pants, and what appeared to be black sea boots. Before he turned himself in, he also wore a pirate hat with his Jolly Roger on it over a yellow spotted bandana. During the Edd War, however, he donned a dark-blue vest and a yellow sash."}, {"type": "paragraph", "text": "Thirty years ago, he was seen wearing a necklace on his neck."}, {"type": "paragraph", "text": "Later on, during a flashback to Roger's first meeting with Rayleigh, it was revealed that Roger wore the straw hat that Monkey D. Luffy is currently wearing."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Roger was said to be fearless, and those who witnessed his execution even claim that he smiled just before his death, and during all of his flashback appearances, Roger was seen with a confident smile."}, {"type": "paragraph", "text": "His personality is often noted by people who knew him to have been similar to that of Monkey D. Luffy. This is best shown when he meets Rayleigh and asks him to join him, despite having no idea how strong he was or even what role he would have on his ship.Portgas D. Ace revealed his lineage to Whitebeard, who noted that Ace's personality was not much like his father's. However, they both shared a refusal to run from battle: Monkey D. Garp stated that Roger would not run away from an enemy in order to protect his crew from danger. They both also shared the common traits associated with the Will of D."}, {"type": "paragraph", "text": "Roger was also a man who loved big, flashy things and reveled in his title of Pirate King despite his oncoming death. While not portrayed during any of his appearances, he could be a merciless enemy when he got angry. This was further evidenced when he killed all of Squard's crewmembers personally for unknown reasons."}, {"type": "paragraph", "text": "Roger was very quick to anger, and he would retaliate for something as simple as an insult to his crew, regardless of how small it might be. Garp stated that an angry Roger could be a violent, selfish, and short-tempered man, but his actions had been pure and straight, just like a child's, and that he was lucky to survive and become the Pirate King despite his extremely reckless nature."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "He apparently had a strong bond with his crew. Silvers Rayleigh, his partner, described him as a \"magnificent man\".Shanks and Buggy also seemed saddened when speaking of the day of their captain's execution, and both cried a lot at his execution."}, {"type": "paragraph", "text": "It is unknown if any of his crew knew that Roger had a son, Portgas D. Ace, prior to Sengoku making it public. According to Monkey D. Garp, even though the whole world hated him, his crewmates trusted Roger completely. He had also destroyed the military force of one country for insulting his crew."}, {"type": "paragraph", "text": "Kin'emon stated that Roger had great admiration for Kozuki Oden and recruited him as a crewmate for his final voyage."}], "images": []}, {"title": "Friends", "level": 3, "content": [{"type": "paragraph", "text": "Most characters who speak of their personal encounter with Roger only make good comments about him, as he seemed to have made many friends in his journey."}], "images": []}, {"title": "Gan Fall", "level": 4, "content": [{"type": "paragraph", "text": "He befriended Gan Fall, the God of Skypiea, and left him with wonderful memories."}], "images": []}, {"title": "Tom and Kokoro", "level": 4, "content": [{"type": "paragraph", "text": "He also befriended Tom and Kokoro, gaining enough admiration and respect for Tom to build him a ship, the Oro Jackson. The Fish-Man would later boast that he was proud he had built the Oro Jackson for the late Pirate King, even though such a declaration led to his death."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "In the past, both Roger and Garp allied with each other in order to defeat the Rocks Pirates."}, {"type": "paragraph", "text": "As a Marine, Garp attempted to kill Roger several times, but both men respected one another to the point that Roger trusted him as he would trust any member of his own crew. Prior to his execution, Roger imparted the name and location of his lover to Garp in order to protect their child, Portgas D. Ace, from being branded a criminal just by being born as the son of the Pirate King."}], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "Even though they were rival pirates, Roger and Whitebeard appeared to be on fairly good terms. Before his death, Roger even offered to tell Whitebeard the location of Laugh Tale and explained the significance of the initial D at their last meeting."}], "images": []}, {"title": "Shiki", "level": 4, "content": [{"type": "paragraph", "text": "In the past, Shiki the Golden Lion got in a fight with Roger. Later, upon hearing news of Roger's upcoming execution, Shiki attempts to kill Roger himself because of his respect for his rival; he believed that dying by the hands of the weak Marines would not be honorable, even for Roger."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "In the past, Roger managed to read Big Mom's Road Poneglyph using the Voice of All Things, allowing him to reach Laugh Tale before her. After failing to stop Roger from this, Big Mom vowed not to let anyone who read her Road Poneglyph get away again."}], "images": []}, {"title": "Rocks D. Xebec", "level": 4, "content": [{"type": "paragraph", "text": "Roger's first and perhaps his most formidable rival and greatest enemy was Rocks D. Xebec, the captain of the legendary Rocks Pirates who sought to become the king of the world. In order to stop Xebec, Roger allied with Garp and together, they managed to defeat the captain of the Rocks Pirates in God Valley after a massive battle."}], "images": []}, {"title": "Other", "level": 4, "content": [{"type": "paragraph", "text": "In Ace's past, there were thugs who hated Roger and spoke ill of him. Ace himself had to endure a life of listening to bad remarks about his father, and in his own death, he confirmed that Roger was not popular on a world wide scale. This implies that those who did not encounter him in their lifetime tend to view him in a bad light."}], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Portgas D. Rouge", "level": 4, "content": [{"type": "paragraph", "text": "Rouge was Roger's lover. It is unknown if they were ever married, nor how their relationship worked out, but she was seen crying when she learned of Roger's death from the newspaper. She died after Ace's birth due to a prolonged pregnancy, which lasted an unnatural twenty months in order to protect Ace from being hunted by the World Government, and also named their child \"Gol D. Ace\", proving that she wanted him to live up to his father's name."}], "images": []}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "Ace was the son of Roger. As Roger did not want Ace to be born as a criminal due to family ties, he requested Garp to take care of Ace in secrecy. When Roger spoke to Garp, he said that his unborn child held no sins. However, Ace did not see this as love and detested his father."}, {"type": "paragraph", "text": "Despite his hatred for his father, Ace seemed to have at least some respect for him, as he severely beat anyone who badmouthed Roger. However, this may have actually been due to the fact that said offenders often would begin slandering \"the son of Gol D. Roger\", thereby unknowingly referring to Ace himself. Dadan noticed that Ace had inherited much of Roger's personality after asking him why he did not run from Bluejam. Also, Shanks remarks at the place of Ace's burial that he was same as his captain, who would not run away in critical situations. The most prominent of the traits that Ace inherited from Roger was ruthlessness toward anyone who threatened or insulted his loved ones."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "Roger was hailed as the most powerful pirate of all time, considered nearly unstoppable in battle, although very little is known of his abilities in detail."}, {"type": "paragraph", "text": "As Pirate King, he retains the highest status among all the world's pirates even after his death, something elucidated by how incredibly massive a bounty he had in life, at over 5.5 billion being the highest in recorded history. Although unconfirmed, it seems that Roger never had a Devil Fruit ability, since he wore a wooden stockade to his execution rather than Seastone handcuffs."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Very few people are known to have ever matched Roger in battle: most prominently the legendary \"Hero of the Marines\" Monkey D. Garp, said to have cornered Roger multiple times before his surrender, as well as Roger's second foremost pirate rival Whitebeard, who held the power of the strongest Paramecia Devil Fruit and was called the \"Strongest Man in the World\" even before Roger's death. "}, {"type": "paragraph", "text": "Another person known to rival Roger was Rocks D. Xebec who was considered to be his first and most formidable rival, even more so than his former subordinate Whitebeard would come to be as it took the combined efforts of both Roger and Garp to finally defeat Rocks."}, {"type": "paragraph", "text": "Other examples of Roger's strength include fighting on equal ground with Shiki, who commanded the largest pirate fleet of the time, and single-handedly defeating the armies of several countries."}, {"type": "paragraph", "text": "He also had immense endurance and vitality even when he was ravaged by an incurable disease. With Crocus' medical skills, he managed to conquer the Grand Line."}], "images": []}, {"title": "Voice of All Things", "level": 3, "content": [{"type": "paragraph", "text": "Roger was also able to understand the meaning of the characters written on the Poneglyphs, as well as write in the same language. However, he was not like the Ohara scholars who used their intellect to study the Poneglyphs, so he could not exactly \"read\" them. According to Rayleigh, Roger could interpret the Poneglyphs because he had the ability to \"hear the voice of all things\"."}, {"type": "paragraph", "text": "He was also one of only four known beings in the series who possessed the ability to hear Sea Kings speaking, the other being Luffy, Shirahoshi, and Poseidon. He was also one of four known humans in the series who possessed the ability to hear Zunesha speaking, the other three being Luffy, Kozuki Oden, and Kozuki Momonosuke."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "While fighting Shiki and his massive fleet, it has been shown that Gol D. Roger wielded a sword in one hand and a gun in the other."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "The Beginning", "level": 3, "content": [{"type": "paragraph", "text": "Roger was born in Loguetown. While he wore a Straw Hat during his youth, he encountered Silvers Rayleigh who was living on a small ship he stole. Viewing their encounter as a fated meeting, he asked Rayleigh to join him. Having accepted the offer, Roger captained the Roger Pirates, during which he engaged in piracy while building up his fame over several decades. Brook referred to hearing of a \"rookie\" with that name when he was still with Rumbar Pirates."}, {"type": "paragraph", "text": "Approximately 38 years ago, Roger and his long time rival, Vice-Admiral Monkey D. Garp formed a temporary alliance against the Rocks Pirates, which led to the pair fighting on God Valley against the crew including Edward Newgate, Charlotte Linlin, Kaido, and their captain Rocks D. Xebec. The battle resulted in the dissolution of the crew, with people viewing Xebec as Roger's first and most formidable rival. Afterwards, the event became known as the God Valley Incident, although their alliance wasn't publicly reported."}, {"type": "paragraph", "text": "30 years ago, sometime after Tom had built the Roger Pirates their ship, Roger read a newspaper and learned that a samurai from Wano Country had joined the Whitebeard Pirates, leading Roger to become interested in meeting him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Rayleigh_and_Roger_Meet.png/revision/latest/scale-to-width-down/210?cb=20140727103201", "caption": "Roger and Rayleigh first meet."}]}, {"title": "Unavoidable Fate", "level": 3, "content": [{"type": "paragraph", "text": "Twenty-six years before the start of the story, Roger came down with an incurable disease. He decided to pitch one last journey with his crew into the Grand Line. Upon reaching the lighthouse at Reverse Mountain at the entrance of the Grand Line, he recruited Crocus as his doctor to keep him alive until the completion of his final journey. Their journey took them to Skypiea."}, {"type": "paragraph", "text": "In the New World, Roger managed to read the Road Poneglyph in the possession of Charlotte Linlin, better known as Big Mom, that helped guide Roger toward Laugh Tale's location. Roger would also find the other three Road Poneglyphs, one of which was on Zou."}, {"type": "paragraph", "text": "Before reaching Laugh Tale on his final journey, Roger was approached by the \"Flying Pirate\" Shiki, who had learned that Roger had located an Ancient Weapon. Seeing the opportunity, he asked Roger if they could join forces, as with his large pirate fleet and Roger's weapon, Shiki believed that they could take over the whole world together, even telling Roger that what happened between them in the past was forgotten. Despite the urges of one of his apprentices, Roger refused Shiki's offer and said that he wanted to be free to do what he wanted. Shiki announced that his answer meant the death of him, while Roger said it meant that he would beat him, and a great sea battle soon ensued between their crews. The battle was resolved by a storm that happened during their fight, which sunk half of Shiki's fleet. Despite this and getting a piece of a steering wheel lodged into his head that almost killed him, Shiki came to have great respect for Roger."}, {"type": "paragraph", "text": "Near his death, Roger had a final meeting with Whitebeard, where he told him about the nickname the government gave him, Gold Roger, and the secret of the Will of D."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1e/Roger_vs_Shiki.png/revision/latest/scale-to-width-down/210?cb=20130624091959", "caption": "Roger and his crew about to battle Shiki."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Whitebeard_and_Roger.png/revision/latest/scale-to-width-down/210?cb=20130405213116", "caption": "Roger talks with Whitebeard."}]}, {"title": "Final Days of the King", "level": 3, "content": [{"type": "paragraph", "text": "In the final days of Roger's reign, he had attained more wealth, power, and fame than anyone could imagine. He had encountered several powerful figures including the captain of the Whitebeard Pirates Edward Newgate, as well as the legendary marine Vice Admiral Garp, who had cornered Roger many times on his journey. Though now known as the Pirate King, Roger was well-aware of his own mortality, and he disbanded his crew in secret. Before his death, he told Rayleigh he would not die. He informed Whitebeard that he was going to die before his execution; whether he was referring to his illness or to him giving up to the Marines is unknown."}, {"type": "paragraph", "text": "Also, at some point he met Portgas D. Rouge, a woman living in Baterilla, that would later become the mother of his son, Portgas D. Ace. Eventually, Roger turned himself in to the Marines and was scheduled to be executed. While in prison, he asked Garp to take care of his son when he was gone, saying that an infant child should not be labeled a criminal for his family ties. Although Garp said he had no obligation to do so, Roger knew he would do it anyway."}, {"type": "paragraph", "text": "Thinking they would make an example of him to prevent others from becoming pirates, the Marines immediately set up his execution in Loguetown. But as he was about to die, Roger yelled out his famous last words. The swords of the executioners fell, and the greatest pirate of them all died."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Roger_Asks_Garp_to_Protect_Ace.png/revision/latest/scale-to-width-down/210?cb=20130223223518", "caption": "Roger entrusts his child's future to Garp."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dd/Roger%27s_Execution_in_Loguetown.png/revision/latest/scale-to-width-down/210?cb=20130121222929", "caption": "Roger's execution in Loguetown."}]}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "What was thought would be a warning to all and extinguish the hopes of all pirates had failed. The last words of Roger ignited the excitement of the world, and thus began \"The Great Age of Pirates\", dubbed by a few as the \"Age of Dreams\". The echoes of his influence resonate further into the current era, and have shaped most of the world after his death."}, {"type": "paragraph", "text": "As far as directly influencing major contenders, those known to be present at his execution include his apprentices Shanks and Buggy; the Shichibukai Crocodile, Donquixote Doflamingo, Dracule Mihawk, and Gecko Moria; and the revolutionary Monkey D. Dragon, and it can be assumed from their conversation with Shiki that Monkey D. Garp and former Fleet Admiral Sengoku attended as well.Smoker also appeared to be there as a child. When Shiki heard about Roger's execution, he was deeply angered and attacked Marine Headquarters in retaliation; after a great battle, he was eventually defeated and imprisoned in Impel Down, though would later go on to escape."}, {"type": "paragraph", "text": "Twenty-two years after his execution, as Whitebeard was about to die, he revealed to the world that Roger's treasure, One Piece, is real, and inferred the consequences of what would happen once it was discovered. This triggered the beginning of the New Age of Pirates to be created out of Roger's legendary treasure."}, {"type": "paragraph", "text": "The legend of the \"Pirate King\" and his treasure \"One Piece\" gave start to the \"Great Age of Pirates\", where many pirates sailed in search of its location or to follow in Roger's footsteps."}, {"type": "paragraph", "text": "All the men and women who had contact with Roger were ordered to be executed. In addition, the World Government issued an order to gather and quite possibly commit mass infanticide in order to purge any possible trace of Roger's progeny. The only ones to survive were his lover Rouge, and his crewmates who went their separate ways after his death. Roger's blood survived his death through his son Ace."}, {"type": "paragraph", "text": "Roger's will has been inherited and retransmitted by Whitebeard's last words, which started the \"New Age of Pirates\"."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Gol D. Roger and Monkey D. Garp vs. Rocks Pirates (unseen)", "elements": []}, {"text": "Gol D. Roger vs. Shiki (unseen, several times)", "elements": []}, {"text": "Gol D. Roger vs. Edward Newgate (unseen, several times)", "elements": []}, {"text": "Gol D. Roger vs. Monkey D. Garp (unseen, several times)", "elements": []}, {"text": "Roger Pirates vs. Golden Lion Pirates (Edd War)", "elements": []}, {"text": "Roger Pirates vs. Squard's first pirate crew (unseen)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Gol D. Roger vs. Killer Giant (mentioned)", "elements": []}, {"text": "Gol D. Roger vs. \"King\" Eric Dow (mentioned)", "elements": []}, {"text": "Gol D. Roger vs. the giant men Gowns Brothers (mentioned)", "elements": []}, {"text": "Gol D. Roger vs. the famous gunner Silver-Silver (mentioned)", "elements": []}, {"text": "Roger Pirates vs. Naguri Pirates", "elements": []}, {"text": "Gol D. Roger vs. Zephyr", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Exactly how Gol D. Roger died is a subject of debate. In the anime, two men jabbed spears into his heart, impaling him (though failing to make him stop smiling); in the 4Kids dub he was \"hung\" at the \"Roguetown\" gallows; and the English-language manga says the Marines \"lopped off his head\", decapitating him. The original Japanese manga never reveals precisely how he was executed (though it depicts the scene), but it remains to be seen whether this will become an important plot point in the future, or if it was simply a way of lessening the visceral impact of the character's death. The only other character to be seen undergoing the same method of execution was Mont Blanc Noland."}, {"type": "paragraph", "text": "In the 4Kids dub, Roger's last words before he died were: \"My fortune is yours for the taking, but you'll have to find it first. I left everything I owned in One Piece\". In volume one of the English manga, Roger's last words were: \"My treasure? Why, it's right where I left it. It's yours if you can find it. But you'll have to search the whole world!\". So with his legendary treasure One Piece now up for grabs, people took to the seas in search of it. The words \"In One Piece\" are an American interpretation."}, {"type": "paragraph", "text": "In the original Japanese opening, Gol D. Roger states \"My wealth and treasures? If you want it, I'll let you have it...search for it! I left all of it at that place\". \"That place\" is a way of describing somewhere that is known to the listeners (although it is not revealed to readers until later) - others who have talked about the location of the treasure have been clear that it is at Laugh Tale, the last island on the Grand Line."}, {"type": "paragraph", "text": "In the FUNimation opening, Roger's last words were: \"You want my treasure? You can have it! I left everything I gathered together in one place. Now you'll just have to find it!\"."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, there is a filler episode concerning Roger, where it is revealed that a 12-year-old Smoker witnessed Roger's execution. In this scene Roger's appearance is shown a little bit more, revealing that he had hairy upper arms, and wore an anchor necklace. However, none of this has ever been confirmed in the manga canon. Also, in that episode the execution happened on a sunny day, while in episode 0 it happened on a dark and rainy day. In the anime Strong World episode 0, Roger was seen wielding a sword only whilst fighting Shiki's fleet, while in the manga he is seen wielding a sword and pistol."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Roger is the first character to be shown with the D in his name. However, he is the second to be named. Dr. Kureha revealed that his true name was Gol D. Roger after his initial introduction. This is also the first indication that there is an underlying mystery and something special in those who carry the initial D, and Roger himself admits to Whitebeard that the D has a greater meaning than a simple initial.", "elements": []}, {"text": "During Shanks' flashback back to Roger's death and the day he last saw Buggy, rain can be seen falling down on the town at that moment. This is echoed by Monkey D. Luffy's departure from Loguetown, as it also rained during his escape.", "elements": []}, {"text": "It was stated that Ace's mother held him for 20 months (5 months before and 15 months after Roger's execution). Since Ace's birthday is January 1, Roger must have been executed sometime between late September and early October.", "elements": []}, {"text": "Roger was the first named character shown in the One Piece series and the first person in general in the manga.", "elements": []}, {"text": "In the 4th Japanese popularity poll, Roger (along with Chopperman and Van Augur) ranked 83rd.", "elements": []}, {"text": "It seems that Roger did not like the nickname \"Gold Roger\" because it was not his true name.", "elements": []}, {"text": "In Episode 85 of the anime, when Hiriluk was describing what a pirate is to Chopper, a man who was identical in appearance to Roger was seen.", "elements": []}, {"text": "When Oars was pretending to be a pirate by placing a piece of rubble on his head, a pirate similar to Roger was also shown.", "elements": []}, {"text": "Upon his death, the real life pirate Olivier Levasseur had tossed a cryptogram from the scaffolding into the crowd and told them if they could figure out the message, his treasure (now valued at £160,000,000 in today's money) would be theirs, a treasure that to this day has never been found. This seems to have been part of the inspiration for Roger's legendary death speech, as Roger himself had delivered the message to find his treasure, and notably the Poneglyphs are also part of a grand cryptogram leading to the end of the Grand Line.", "elements": []}, {"text": "Another possible inspiration for Roger could be Henry Every. In 1695, Every led what has been called the most profitable pirate raid of all time, capturing an enormous treasure estimated to be worth up to £600,000 (around $400 million in modern currency), becoming the richest pirate in the world and earning him the epithet \"The King of Pirates\". Despite being the target of a worldwide manhunt and getting the highest bounty in history placed on his head (£1,000, around $700,000 currently), Every vanished with his treasure in the Caribbean (then called New World). He is said to have influenced the next generation of pirates, including Blackbeard, Bartholomew Roberts, Calico Jack, Samuel Bellamy and Edward Low, among others, who were children at the time (and whose names are used for several One Piece characters).", "elements": []}, {"text": "Roger is the first known owner of the straw hat that Luffy (and previously Shanks) wears.", "elements": []}, {"text": "In One Piece Green, it was revealed that Roger's mustache was actually intended to be his nose hair in the beginning.", "elements": []}, {"text": "He is the first character shown in the anime due to being in the first opening.", "elements": []}, {"text": "Roger's favorite foods are sake and Higashizame steak.", "elements": []}, {"text": "Although his bounty is now inactive, Roger's bounty is the highest amount in the series, with 5,564,800,000, stated to be unsurpassed by any pirate.", "elements": []}]}], "images": []}]}