{"sections": [{"title": "Sengoku", "level": 1, "content": [{"type": "paragraph", "text": "Sengoku the Buddha was the fleet admiral of the Marines before the timeskip, succeeding Kong and preceding Sakazuki."}, {"type": "paragraph", "text": "He was also one of the major figures along with Whitebeard, Shiki, and Monkey D. Garp during the times when Gol D. Roger was still alive, and still continues to be in the present, even after his retirement from the Marines. Sometime during the timeskip, he became an Inspector General. He raised Donquixote Rosinante like his own son."}, {"type": "paragraph", "text": "Due to his actions and his position in the Marines, he is one of the main antagonists of the Marineford Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sengoku is a tall, fair-skinned, and muscular man with a long, braided goatee and a mustache. He is usually seen alongside his pet goat. His cap covers his hair, which is set in a large afro. His afro was revealed after using his Devil Fruit powers and having his cap knocked off. Ironically, prior to the timeskip, despite already being an elderly man upon his debut (being 77 years old at the time, thereby making him a year older than Garp and Rayleigh, both men being from his generation), Sengoku displayed little to no physical signs of his actual age, with his hair still not having grayed after 20 years.   "}, {"type": "paragraph", "text": "He typically wears black-rimmed glasses and a white and gold full Marine admiral uniform that is adorned with medals. The most distinctive features of this uniform are a life-size seagull on top of his cap, and his oversized Marine coat which he wears like a cape. His coat has the kanji for justice, in blue, emblazoned on the back."}, {"type": "paragraph", "text": "Twenty years before the present storyline, when Sengoku was already an admiral, he did not cover his afro and sported only a mustache. During his orders to Saul to bombard Ohara, he wore less regal-looking attire than he does in the present storyline: a simple black tank top, blue jeans, and his glasses, which is unlike a typical admiral's formal suit. The only Marine-related attire he wore at the time was apparently his Marine coat, draped over like a cape. However, when he was fighting Shiki in Marineford, he was wearing a black double-breasted suit with a blue tie under his coat. Fourteen years ago, still as an Admiral, he is seen wearing a white suit with a floral button dress shirt underneath and begins to grow his trademark braided goatee, albeit much shorter than it is now. His epaulettes during his time as an Admiral were similar to Garp's, which were red and black, but he doesn't have black on it and he never used red epaullets ever since he became Fleet Admiral."}, {"type": "paragraph", "text": "In his youth, he also did not cover his afro and he lacked a beard."}, {"type": "paragraph", "text": "As a child, Sengoku had his trademark afro, and he was seen wearing a karate uniform with a black belt tied on his waist."}, {"type": "paragraph", "text": "During the two year timeskip, Sengoku aged with his hair turning gray. His former uniform is now replaced with a more casual wear during his retirement. He is wearing a dark blue shirt with red and green zig-zag patterns, orange tie with white marine shorts, and a Marine coat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sengoku appears to be an exceedingly proud, enlightened, and intelligent man who was loyal to the World Government and, up until the cover-up of the Impel Down incident, never questioned orders from them. He also will not accept any reason for letting a criminal go, and also has a habit of getting very irritated with failure. His motto is \"Reigning Justice\" (君臨する正義, Kunrinsuru Seigi), in that he prioritizes upholding justice over all things, although he certainly does not shy away from actions that fall under the code of Absolute Justice. From his view, the Shichibukai are just pirates, though he notes how valuable they can be when the time comes. However, as the years went by, he appeared to be losing his faith in the government, shown after the Battle of Marineford when he was furious at the order from the Five Elders to suppress the second escape incident in Level 6 of Impel Down to save face and keep the faith of the people, thus placing nations in danger. This eventually led Sengoku to resign from the Marines."}, {"type": "paragraph", "text": "Before the Whitebeard War, he was concerned over the movements of the Straw Hat Pirates, and had followed their actions ever since they departed from Water 7, though at the time his current concern was about the upcoming war against Whitebeard, to the point that he brushed off the incident of the attack on a Celestial Dragon and left it to the admirals. Upon hearing about Luffy's break-in of Impel Down, Sengoku was so frustrated that he almost took it out on Garp, and had come close to losing his patience with the antics of the Monkey family in general."}, {"type": "paragraph", "text": "Sengoku also believed that a person's birth (with the consideration of the parents' reputation) is enough to determine the potential impact they could bring to the world if left unchecked, such as Ace being Roger's son and Luffy being Dragon's son. This is shown at Ace's execution, where one of the main reasons for Ace's execution was not just because he was a pirate, but because he was the son of Gol D. Roger, and Sengoku believed that Ace must be eliminated by any means necessary, even if that meant an all out war with Whitebeard."}, {"type": "paragraph", "text": "His epithet, Sengoku the Buddha, may seem contradictory at best since throughout the course of the series, while he has shown himself to be an extremely calm, composed, collected man, he has also shown himself to be quite capable of anger and violence. Doflamingo remarked on this irony when the Shichibukai convened at Mary Geoise to choose a successor for Crocodile. However, with the revelation of his Devil Fruit power, it would seem his epithet's origins come from his fruit's ability, exactly like the three current admirals (although his is not an alias)."}, {"type": "paragraph", "text": "He also appears to have some common sense, as shown when he ordered the Whitebeard War to be put to an end and ordered the other Marines to tend to the wounded. His justice is not as uncompromising as Akainu's, and it seems to be more of a mix of both absolute and moral justice, as he did hold a large speech about morality. Another hint of moral justice is also shown when he got infuriated when the World Government decided to cover up the mass escape of the Level 6 Impel Down prisoners released by Blackbeard, although he once said not to question the World Government's orders."}, {"type": "paragraph", "text": "In addition, in his conversation with Kong, he stated that justice is a matter of personal values and does not endorse one form of justice over the other, mirroring Smoker's talk with Tashigi in Alabasta. This insinuates that Sengoku is more of a pragmatist in applying justice. Caesar Clown also states Sengoku is too soft for rejecting the potential of mass-murder weapons and experimentation on prisoners, in contrast to what Caesar believes Sakazuki would want, further enforcing that Sengoku is more moral than he appears."}, {"type": "paragraph", "text": "After becoming an Inspector General, Sengoku seems to have become far more cheerful and laid-back, and tends to take things very casually like his friend Garp, such as how he merely laughed playfully when Issho voiced his thoughts in how Law and Luffy should be acknowledged as Dressrosa's heroes, along with the admiral's decision to not arrest the pirate alliance immediately. Tsuru notes this drastic change in Sengoku's behavior is the result of how he has less responsibilties as compared to his time in the past. Regardless, he still shows wisdom as he passed down his knowledge to the current generation of Marines about the past regarding the Yonko and pointed out how many world known figures have some affiliation with Wano."}, {"type": "paragraph", "text": "Though he may appear to be stern because of his duties as a Marine, he is actually very kind and compassionate. His drastic actions at the Battle of Marineford were motivated by the desire to protect innocent civilians from getting embroiled in conflict out of fear that when the secrets held in One Piece are discovered, it would turn the world on its head and lead to total war. He also expressed extreme rage towards the World Government for trying to cover up the break out of extremely dangerous criminals imprisoned in Level Six of Impel Down, as letting such criminals loose could pose immense danger to civilians. Furthermore, learning about Donquixote Rosinante's death, a man he considered like his own son, was enough to break his heart and drive him to tears."}, {"type": "paragraph", "text": "Like his longtime colleague Garp, Sengoku's favorite snack is okaki, fried rice crackers. He is often seen munching on them, especially in his retirement."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Sengoku_cries.png/revision/latest/scale-to-width-down/190?cb=20160522202541", "caption": "Sengoku weeping inconsolably at the news of Rosinante's death."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Monkey D. Garp is a lifetime colleague of Sengoku's, having occasionally accompanied him on his assignments when he was still an admiral, and even then Sengoku found him irritating. As Garp is considered a \"Hero of the Marines\", Sengoku respects him greatly. However, their relationship was tested after discovering that Garp withheld the information that the infamous Monkey D. Luffy is his grandson, which left the Fleet Admiral furious at Garp. This, added to the frustration caused by Luffy's repeated actions against the World Government, caused Sengoku to start losing patience with Garp and he made it clear he would have forced him to take responsibility if it were not for his position as the Hero of the Marines. Garp, on the other hand, took the development happily, much to Sengoku's frustration."}, {"type": "paragraph", "text": "Sengoku had somehow found out that Garp had adopted Portgas D. Ace, the son of Pirate King Gol D. Roger, which was meant to be kept secret from the World Government. Sengoku warned Garp not to do anything foolish regarding Ace's execution, or there would be no mercy. Sengoku also knows that the Revolutionary known as Dragon is Luffy's father, and by extension Garp's son. It is unknown as to how long Sengoku knew about all this, or when he first learned about this, or how it would affect Garp's standing in the Marines. However, Sengoku had no problem in revealing everything to the entire world. When Garp allows Luffy to pass him, Sengoku was displeased, saying that Garp was in the end \"still a grandfather\". When Garp stood up after being hit by Luffy, he asked him whether he was alright, showing some concern. Sengoku is also quick to restrain Garp if he tries to do anything foolish, as shown when Sengoku pinned Garp to the ground when he later tried to go after Akainu for killing Ace."}, {"type": "paragraph", "text": "Despite being Garp's superior officer, Sengoku nonetheless carries a great deal of respect and still considers him to be an important friend and ally."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f9/Garp_and_Sengoku.png/revision/latest/scale-to-width-down/250?cb=20160212210238", "caption": "Sengoku's annoyance at Garp."}]}, {"title": "Tsuru", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku appears to be well-acquainted with Vice-Admiral Tsuru as well. Thirteen years ago in the North Blue, she worked under Sengoku's orders to stop the Donquixote Pirates. Despite being outranked by him, Tsuru still had no problem calling him a fool for providing her wrong intel."}, {"type": "paragraph", "text": "Nowadays, Tsuru appears to be annoyed with Sengoku's new cheerful disposition and lack of responsibility that is almost similar to Garp."}], "images": []}, {"title": "Kuzan", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku seems to show great respect for the former Admiral and appreciates his view on justice as well as his potential for leadership. This was proven when he personally nominated Kuzan to replace him in the position of Fleet Admiral, when he decided to step down himself."}], "images": []}, {"title": "Issho", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku seems to show respect for the newly promoted Admiral and respects his view on justice. He does not berate Issho for his choice to expose the abuse of the Shichibukai position by Donquixote Doflamingo to the general public. Despite this, the former Fleet Admiral does lightly suggest that Issho apologize to Sakazuki to mitigate the punishment he received for his refusal to suppress the Government's decision to permit the Heavenly Demon to usurp the Dressrosa throne."}], "images": []}, {"title": "Sakazuki", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku seems to be casual with his successor to the position of Fleet Admiral. He is amused when Issho uses a loophole to attend the Levely and comments to Akainu on how difficult it is to lead the Marines."}], "images": []}, {"title": "Donquixote Rosinante", "level": 4, "content": [{"type": "paragraph", "text": "Despite being the last remaining relative of the pirate and future Shichibukai Donquixote Doflamingo, Sengoku had great trust in Rosinante, as Doflamingo was unknowingly being monitored by his younger brother. When Rosinante was 8 years old, Sengoku took him under his wing and later helped him become a Marine. It was implied that Sengoku was responsible for Corazon's facade of hating kids, in a ploy to discourage children from being drawn to and staying with the Donquixote Pirates."}, {"type": "paragraph", "text": "Sengoku always saw Rosinante as a son, and was devastated when his death was reported. Because of this, and with Rosinante lying to Sengoku just once regarding to the Minion Island incident, Sengoku would later converse with Trafalgar Law to confirm how and why Rosinante died, and was able to get some closure upon learning the circumstances."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Rosinante_Meets_Sengoku.png/revision/latest/scale-to-width-down/180?cb=20150823155227", "caption": "Sengoku's first meeting with Rosinante."}]}, {"title": "World Government", "level": 3, "content": [{"type": "paragraph", "text": "Twenty two years ago, Sengoku was shown to be loyal to the World Government and did not like anyone questioning them. However, he has now lost his trust in them, especially the Five Elders, concerning the suppression of the Impel Down incident. This was proven by showing how angry he was at the government's decision not to issue bounties on the many criminals who had escaped from Level 6 of Impel Down. This is also shown by his outburst at their decision to keep quiet about the breakout, even though any one of the escapees could potentially destroy a country. This was one of, if not the biggest reason, for his resignation from the Marines."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "As Sengoku was a major figure back in Gol D. Roger's time, and still is today, he is one of the few enemies Whitebeard respects. Sengoku, along with the entire Marines and World Government, waged war against Whitebeard over the life of Portgas D. Ace before the latter's death. With the Marines' victory, Sengoku respected Shanks' wish to relinquish the bodies of Whitebeard and Ace for a proper burial, as opposed to showing them on the televised broadcast as trophies. By Shanks' admission, the fleet admiral respected the old pirate."}], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku shows a great deal of hatred towards Blackbeard for a number of reasons. These reasons include abandoning his post in Marineford, stealing a warship, infiltrating Impel Down, recruiting a number of extremely dangerous prisoners into his crew, abusing his position in the Shichibukai and later resigning from it, obtaining the power of the Gura Gura no Mi, and attempting to completely destroy Marineford."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Before resigning from the Marines, Sengoku was angry with Luffy's actions such as defeating Shichibukai Crocodile, invading Enies Lobby and defeating Rob Lucci of the CP9, defeating Shichibukai Gecko Moria, punching World Noble Saint Charlos, breaking into and out of Impel Down, and intruding on the war against Whitebeard in an attempt to rescue Ace."}, {"type": "paragraph", "text": "Coupled with the fact that each action deals a devastating blow to the World Government and that he is also Vice Admiral Garp's grandson, Sengoku tended to take the frustration he felt after one of Luffy's stunts out on Garp. Sengoku also knows that Dragon is Luffy's biological father, and considers Luffy to be a great threat to the world due to his heritage, which is exactly the same way he felt about Ace. After the time-skip, he no longer shows any animosity towards Luffy, as he did not reprimand Issho for letting Luffy and Law escape Dressrosa."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Despite Shanks being a pirate, which would make him an enemy, Sengoku appears to have some respect towards him, stating that because of his words, he would officially end the war with the Whitebeard Pirates as well as hand over Ace and Whitebeard's bodies to the Red Hair Pirates to be given a proper burial. This is the first time Sengoku has shown respect towards a pirate, whereas he would not show respect even towards the Shichibukai."}], "images": []}, {"title": "Shiki", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku seemed to view Shiki as his main enemy twenty years ago in the same sense that Garp viewed Gol D. Roger. He warned Garp that Shiki was his to capture, and was annoyed when Garp said he would give him the credit, showing Sengoku felt the need to capture Shiki himself and wasn't merely after fame. Although he was willing to fight Shiki with Garp when he attacked Marineford, this could be to limit the damage Shiki could cause seeing as he destroyed half of Marineford when fighting both of them."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "Despite being on opposite sides of the law, they both cared for the same person, Donquixote Rosinante, and currently honor his memory in their own different ways. Sengoku told Law that he should live because Rosinante sacrificed himself for the Surgeon of Death. Perhaps because of Rosinante's actions, Sengoku decided to let Law leave Dressrosa, under the claim that he (Sengoku) is no longer a field officer, and therefore not obligated to arrest the renegade Shichibukai."}, {"type": "paragraph", "text": "Sengoku was surprised to discover that Law was a D, but apparently claimed that he knew nothing about the unique meaning of the letter."}], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "As the Marines transferred Doflamingo toward Impel Down, Jack attempted to rescue him at any costs. Sengoku's reputation isn't enough for Jack to take back Doflamingo by force."}], "images": []}, {"title": "Shichibukai", "level": 4, "content": [{"type": "paragraph", "text": "As with Vice Admiral Smoker and Admiral Kizaru, Sengoku believes that the Shichibukai are no more than pirates, and therefore, trusts them very little, made clear when he called them \"scum of the sea\". However, he sees them as being very useful in times of need. When these World Government allies refuse to live up to their duties, such as Boa Hancock, Jinbe, and Marshall D. Teach did, Sengoku shows his resentment. Surprisingly, despite being informed about the exposure of Donquixote Doflamingo's criminal enterprises on Dressrosa, he does not seem enraged and casually discusses the fiasco."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Z", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku and Z were once friends until Z resigned from the Marines after the World Government allied with pirates. Sengoku stood silently for his former friend even attempting to destroy the new world."}], "images": []}, {"title": "Kong", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku and Kong are acquainted with each other even after Kong become the Commander-in-Chief for the World Government. Sengoku once worked under him when Kong was Fleet Admiral during Roger's time. After the Marineford War, Kong reassigned Sengoku as Inspector General after he succeeded in persuading Sengoku to stay in the Marines."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the former Fleet Admiral of the entire Marine force, Sengoku had absolute power over every action the Marines do, including summoning a Buster Call, granting and removing a Shichibukai's title at any time, provided they meet the criteria for either. The only ones that are above him and command him are the Five Elders and Commander-in-Chief Kong. However, with his resignation came the loss of such authorities."}, {"type": "paragraph", "text": "Sengoku possesses a strong will as he was able to resist Luffy's unconscious burst of Haoshoku Haki."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Alongside Garp and Tsuru, Sengoku is one of the most powerful Marines of his generation. Even without his Devil Fruit powers, Sengoku has enormous strength, enough to effortlessly hold down an enraged Garp with only one hand. Sengoku is also a tremendously skilled hand-to-hand fighter. Combined with his Mythical Zoan Devil Fruit powers, he could knock away all the members of the Blackbeard Pirates, who are extremely powerful in their own right, sending them flying."}, {"type": "paragraph", "text": "When Shiki was wreaking havoc in Marineford twenty two years ago, Sengoku fought alongside Garp and were able to subdue him whilst destroying half the city in the process, keeping him imprisoned in Impel Down, a tremendous feat as Shiki is an immensely powerful swordsman who had single-handedly slaughtered an entire army of Marines before they subjugated him."}, {"type": "paragraph", "text": "Alongside Fujitora and Tsuru, Sengoku could defeat Jack, one of the most powerful members of the Beast Pirates, who could single-handedly fight the entire military force of the Mokomo Dukedom consisting of minks who were natural born fighters."}, {"type": "paragraph", "text": "Sengoku has extraordinary speed even in his gigantic buddha form. He could launch an unexpected surprise attack on all the members of the Blackbeard Pirates."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Sengoku ate the \"Hito Hito no Mi, Model: Daibutsu\", a rarer-than-Logia Mythical Zoan-class Devil Fruit which allows him to turn into a gigantic Daibutsu, which is probably the reason for his nickname. Nearby Marines claim that they have never seen him use this power before the war."}, {"type": "paragraph", "text": "While enlarging, his Marine jacket, glasses, and pants enlarge with him; his uniform, which also enlarges, seems to be tied around his waist, though he was not seen doing it during the transformation. The color of his body (and uniform) seems to change to a golden skin color, similar to a polished gold statue. In this form his body has different proportions, as his torso and arms are much larger compared to the rest of his body."}, {"type": "paragraph", "text": "This ability gives him a massive power boost to his already impressive strength, enough to cause the execution stand to collapse in one indirectly connecting punch, despite the combined effort of Luffy's Gear Third and Mr. 3's Candle Wall to absorb the attack. He can also launch an explosive shock wave with a palm thrust, enough to send a majority of the Blackbeard Pirates flying a fair distance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Hito_Hito_no_Mi%2C_Model_Daibutsu_Infobox.png/revision/latest/scale-to-width-down/210?cb=20160818203351", "caption": "Sengoku transforms with his Devil Fruit."}]}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "An extraordinary master strategist with immense military experience, Sengoku is renowned for his tactical and strategic genius by Marines and pirates alike. He is mainly responsible for all the Marine maneuvers deployed throughout the Whitebeard War at Marineford, such as forwarding a plan to all Marines that Portgas D. Ace was to be executed ahead of the official schedule with the intention that the opposing pirate forces would intercept the message and lose their composure. He then conspired with Admiral Akainu in a plot to derail the alliance between Whitebeard's core divisions and the 41 independent New World pirate crews assisting by directing a 20-strong Pacifista division to target only the non-Whitebeard division pirates, and it was possible that the earlier transmissions regarding Ace's true parentage was not only an act of public justification but also to demoralize those pirates who were undermined by the Roger Pirates. With Akainu's persuasion, Sengoku's plan managed to drive one of those captains to attempt assassinating Whitebeard himself, and while the blow was not fatal, it did further debilitate Whitebeard's already hazardous condition."}, {"type": "paragraph", "text": "He operated his strategies while keeping close in mind the various powers of his greatest subordinates, especially the Marine Admirals: raising Marineford's siege walls in conjunction with Akainu's \"Ryusei Kazan\" to rout the allied pirate forces and destroying Whitebeard's flagship, the Moby Dick while protecting the brunt of the Marine garrison from the damage."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It has been stated that all marines with the rank of vice admiral and above possess Haki, so as a former high ranking officer as well as leader of the Marines, Sengoku can also use the ability."}, {"type": "paragraph", "text": "Sengoku is one of the very few people in the world who can use all three types of Haki."}], "images": []}, {"title": "Video Game Only Techniques", "level": 3, "content": [{"type": "list", "elements": [{"text": "Artillery Order (, Artillery Order): Sengoku uses a Den Den Mushi to call in an artillery strike on his opponent. Appears as one of Sengoku's Special Attacks in One Piece: Burning Blood.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early life", "level": 4, "content": [{"type": "paragraph", "text": "Not much is known about Sengoku's early life, other than he is originally from the South Blue and joined the Marines 56 years ago along with Garp and Tsuru, at the age of 23. Over the years, Sengoku would rise up through the ranks of the Marines, eventually achieving the rank of Admiral at some point before the Great Age of Pirates."}], "images": []}, {"title": "Encounter with Shiki the Golden Lion", "level": 4, "content": [{"type": "paragraph", "text": "Twenty-seven years before the current storyline, the Marines were alerted to a confrontation between Shiki and Gol D. Roger, and the then-Admiral Sengoku, Monkey D. Garp, and several other high-ranking Marines were sent on a mission to contain it. Before they could make it, a storm occurred and half of Shiki's fleet was sunk during the battle. Three years later, Roger turned himself over to the Marines, and his execution was announced across the world. A week before Roger's execution, Shiki attacked Marineford, demanding that he be allowed to kill Roger. Sengoku and Garp intervened and fought him together. After a fierce battle that destroyed half of Marineford, they managed to defeat Shiki, and he was imprisoned in Impel Down."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/Shiki_and_Sengoku_and_Garp.png/revision/latest/scale-to-width-down/210?cb=20130525044135", "caption": "Sengoku and Garp fight Shiki."}]}, {"title": "Ohara Incident", "level": 4, "content": [{"type": "paragraph", "text": "Twenty-two years before the current storyline, Sengoku received orders from the World Government to carry out a secret mission. This mission was to send a Buster Call to obliterate Ohara. With these orders, Sengoku gave the Golden Den Den Mushi for the operation to CP9 director who was to investigate the situation, Spandine. Among the five Vice Admirals Sengoku chose to lead the Buster Call were Sakazuki, Kuzan, and Jaguar D. Saul."}, {"type": "paragraph", "text": "After the arrest of Nico Olvia, Sengoku notified Saul of his role in the upcoming mission. The giant protested against this and tried to reason with Sengoku that the Oharans were merely scholars interested only in history. Sengoku however turned a deaf ear and told Saul to just follow orders."}, {"type": "paragraph", "text": "Later, Sengoku received news that Saul had liberated Nico Olvia from her imprisonment. Seeing that the Buster Call mission to Ohara was in jeopardy, Sengoku ordered his subordinates to quickly find the two before the operation could be stopped."}, {"type": "paragraph", "text": "After the operation was finished, Sengoku was informed by Spandine that one of the scholars of Ohara had escaped from the Buster Call attack. This little girl, Nico Robin, was deemed a threat. With that in mind, Sengoku and other high ranking officials put up a bounty of 79,000,000 on her in order to help catch her."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2c/Sengoku_Orders_Saul.png/revision/latest/scale-to-width-down/210?cb=20161104023820", "caption": "Admiral Sengoku telling Saul of his mission to Ohara."}]}, {"title": "Pursuit of the Donquixote Pirates", "level": 4, "content": [{"type": "paragraph", "text": "At some point, Sengoku encountered Donquixote Rosinante while he was still a child and took him in. After Rosinante enlisted into the Marines and rose to the rank of commander, Sengoku assigned him with a mission to spy on the Donquixote Pirates, led by Rosinante's elder brother Donquixote Doflamingo, and to make sure that children do not get involved with the pirate crew. Fourteen years before the current storyline, Rosinante contacted Sengoku and asked for permission to put his mission on hold, which Sengoku granted. He then accepted a request from Vergo to transfer to the G-5 base, noting the progress he had made in the one year since he joined the Marines."}, {"type": "paragraph", "text": "Six months after Rosinante left the Donquixote Pirates, Sengoku contacted him again and was surprised that he was informed of the Ope Ope no Mi from his brother. Sengoku then informed Rosinante of a trade that was going to occur on Rubeck Island in three weeks and Rosinante informed the admiral of Doflamingo's plans to steal the Devil Fruit and that the crew would be on Swallow Island three days before the exchange. Sengoku then made plans to ambush the Donquixote Pirates on Swallow Island and warned Rosinante not to go anywhere near there."}, {"type": "paragraph", "text": "After discovering Rosinante's death, Sengoku grieved."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Crocodile was defeated by Monkey D. Luffy and stripped of his rank as a Shichibukai, Sengoku was called in to discuss Crocodile's replacement in Mary Geoise, along with the various Marine officers attending there and whoever among the Shichibukai decided to show up. He showed up late and caught Doflamingo messing around with some of the Marine officials attending the meeting. Seeing the pirate's actions, he told him to stop immediately. With that settled, he apologized for being late, greeted everyone, and started the meeting."}, {"type": "paragraph", "text": "While Sengoku discussed some further formalities with Doflamingo, he and the others were shocked by Dracule Mihawk's sudden appearance in the meeting. Sengoku and everyone else were then later interrupted by the appearance of Laffitte, who had somehow snuck into the meeting room. As Sengoku was told of the identity of this newcomer, Laffitte suggested a perfect candidate to replace Crocodile, Marshall D. Teach. Having never heard of Teach before, Sengoku told Laffitte that an unknown pirate without a reputation would not be much use as a Shichibukai. Laffitte however told Sengoku that he and the rest of his crew already had a plan to make Teach famous. With that, Laffitte left Sengoku and the other people attending the meeting and told them to remember his crew's name, the Blackbeard Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Shichibukai_Meeting_at_Mary_Geoise.png/revision/latest/scale-to-width-down/210?cb=20130420053947", "caption": "The meeting in Mary Geoise."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the destruction of Enies Lobby, Sengoku learned some startling information about one of the prominent players involved. Garp accidentally informed Sengoku that Luffy was his grandson. This revelation annoyed Sengoku not only because Garp withheld such information, but also because he did not capture Luffy while he was in Water 7. Sengoku ordered Garp to return to Water 7 to capture Luffy."}], "images": []}, {"title": "Thriller Bark Saga", "level": 3, "content": [], "images": []}, {"title": "Thriller Bark Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the news of Shichibukai Gecko Moria's defeat, Sengoku was in Mary Geoise with Garp and Bartholomew Kuma. He was very angry that Kuma did not capture the Straw Hat Pirates and voiced concern about their proximity to Marine Headquarters. Garp also annoyed him when he talked about tea and crackers. Sengoku also commented on how Luffy tended to get into one thing after another."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Strong World", "level": 4, "content": [{"type": "paragraph", "text": "When Shiki returned from his 20-year disappearance, he attacked Marineford using his powers to levitate and hurl fleets of ships at the island as a warning to the Marines. Sengoku was surprised he was still alive after all this time. After Shiki's surprising defeat at the hands of Luffy days later, Sengoku lamented on how the Marines were useless and they had been saved by pirates."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b3/Sengoku_Strong_World.png/revision/latest/scale-to-width-down/210?cb=20150120185651", "caption": "Sengoku during Shiki's attack on Marineford."}]}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku was greatly irritated by Luffy's attack on World Noble Saint Charlos and for \"taking hostage\" his father and sister. Seeing this, Admiral Kizaru offered to go to Sabaody Archipelago himself to handle the problem."}], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "At Marine Headquarters, Sengoku received the report that Vice Admiral Momonga had managed to \"convince\" Pirate Empress Boa Hancock to follow up on the mandatory summons of the government. Sengoku was pleased by this as he acknowledged Hancock's strength, but was also troubled that Jinbe refused to cooperate with them and was prepared to lose his status, fighting the Marines instead of Whitebeard."}, {"type": "paragraph", "text": "Afterwards, an official told him of the number of pirates that Admiral Kizaru managed to capture at Sabaody and at least five hundred pirates were to be sent to Impel Down. Sengoku was irritated for being bothered for such a reason and asked to be informed only of matters relating to Whitebeard. In the same manner, he brushed off the matter of the incident with Saint Charlos, saying it was a matter for the admirals. He then asked where Garp was and was annoyed upon learning that he left for Impel Down a while ago. He then received news that Whitebeard's main ship, the Moby Dick, was on the move and that all twenty three patrol ships were decimated. He ordered extreme caution even at Impel Down."}], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "To Sengoku's great displeasure, he received information that Luffy had broken into Impel Down and, putting the dots together, Sengoku correctly deduced that Luffy's invasion within the great prison itself was to rescue Portgas D. Ace from execution in the critical time when they were supposed to be preparing for war against Whitebeard. Garp, however, found it amusing that his grandson would go to such lengths simply to rescue Ace. Sengoku angrily told Garp that no one had attempted anything so atrocious in the history of Impel Down, since twenty two years prior to current events, and was annoyed that the one who would do it was Garp's grandson."}, {"type": "paragraph", "text": "Sengoku also said to Garp that had he not been the \"Hero of the Marines\", he would have held Garp personally responsible for his family's actions. Garp simply replied that the life of an old man would not atone for Luffy's transgressions."}, {"type": "paragraph", "text": "When Blackbeard stole a Marine ship with his crew and broke into Impel Down, Sengoku looked distraught at the news."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5f/Sengoku_Blames_Garp_For_Luffy%27s_Actions.png/revision/latest/scale-to-width-down/210?cb=20150120185544", "caption": "Sengoku blaming Garp for Luffy's actions in Impel Down."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three hours prior to Ace's execution, Sengoku told Garp that he would reveal Ace's origins to the world, which Garp allowed. Sengoku then revealed to his subordinates that Ace's father was none other than Gol D. Roger, the Pirate King. He later witnessed the arrival of Whitebeard and his allies. According to Whitebeard, they had not seen each other in decades. When Whitebeard began his attack, Sengoku stated that Whitebeard ate the Gura Gura no Mi and that he had the power to destroy the world. Following several attacks from both sides, he proclaimed that the war had begun."}, {"type": "paragraph", "text": "When Sengoku prepared to initiate a plan to execute Ace before the scheduled 3:00 p.m., he was interrupted when Garp sat on the execution platform, torn between family and duty. Sengoku warned him not to do anything foolish or he would suffer the consequences."}, {"type": "paragraph", "text": "Luffy's unceremonious self-introduction into the Battle of Marineford had Sengoku apoplectic, going so far as screaming at Garp for having his family intruding in the World Government's affairs again. Sengoku only got angrier when Jinbe loudly declared his resignation from the Shichibukai. When asked by Kizaru if executions were in order for each and every last one of the Impel Down escapees, Sengoku wholeheartedly agreed."}, {"type": "paragraph", "text": "When Luffy declared that he was Ace's brother, which brought the question of how Roger can have a second son after he died before Ace's birth and Rouge dying shortly after the birth, Sengoku revealed to the world that Luffy was not only Ace's adoptive brother, but is also Revolutionary Dragon's son, making Luffy another dangerous future element. Sengoku later gave the order to cut the video broadcasting. An army of Pacifista lead by Sentomaru appeared, being the Marine's ultimate strategy. However, because Buggy had stolen one of the Visual Den Den Mushi to broadcast his own fame as a member of Gol D. Roger's pirate crew, Sengoku's plan to execute Ace early could not proceed, and he ordered the Marines to shoot down Buggy and his crew."}, {"type": "paragraph", "text": "Meanwhile, Sengoku ordered Akainu to deceive Squard, one of Whitebeard's allies, telling him that Whitebeard had sold out every one of his allies to the Marines. Because of this, the Pacifistas attacked all non-Marines in the bay except members of the Whitebeard Pirates, and because of his hatred towards Roger (and by extension, his son Ace), Squard believed Akainu's words and attacked Whitebeard, stabbing him in the chest. Everything went according to Sengoku's plans, except for the fact that the whole world had seen everything happening thanks to Buggy's Den Den Mushi. In order to prevent him from broadcasting any more of the battle, Sengoku ordered Aokiji to freeze him, the Den Den Mushi, and the Impel Down prisoners with him."}, {"type": "paragraph", "text": "After the siege wall was raised, Sengoku flinched after one of Whitebeard's shockwaves slammed against the wall. His order to commence Ace's execution spurred Luffy into hurtling himself over the siege wall and landing in front of the execution platform, at which Sengoku grimaced. Sengoku then ordered for Ace's execution, but the executioners were attacked by Crocodile, much to Sengoku's suprise."}, {"type": "paragraph", "text": "After Little Oars Jr. helped breach the siege wall with the newly revealed ship, which allowed the Whitebeard Pirates access into the main plaza, Sengoku stated that he would not be able to sit and watch anymore. He rolled up his sleeves and assumed that he would soon go into battle himself."}, {"type": "paragraph", "text": "After Whitebeard made a declaration of refusing to die until he could secure a future for his \"children\", Sengoku ordered for another pair of executioners to proceed with executing Ace, telling Whitebeard to see their future as it was. Luffy then unleashed a wave of Haoshoku Haki, which knocked out the executioners. Sengoku was shocked at this sudden burst of Haki."}, {"type": "paragraph", "text": "When Luffy, thanks to Inazuma's powers, managed to reach the execution platform, Sengoku complained about Garp hesitating and letting his grandson pass through him, declaring that even he was a father. Then, when Luffy tried to free his brother, Sengoku transformed into his giant form, declaring he would carry out the execution himself. As Sengoku attacked Luffy, the latter activated Gear Third, which surprisesd Sengoku, seeing that Luffy's body size increased. Sengoku's attack was stopped by Luffy's Gigant Fusen, supplemented by Mr. 3's Candle Wall defense. The execution platform was destroyed by Sengoku's massive punch and the fleet admiral fell to the ground with the pirates."}, {"type": "paragraph", "text": "After Ace had been freed, Sengoku was ashamed of himself for allowing Ace to escape in his presence. As Whitebeard was reducing Marineford to ruins, Sengoku told his men that Whitebeard was the threat for the moment."}, {"type": "paragraph", "text": "After Akainu killed Ace, an enraged Garp expressed a desire to kill the admiral in revenge. To prevent him from acting on this desire, Sengoku pinned Garp down to the ground, calling him a fool. When Akainu blasted off a portion of Whitebeard's head, Whitebeard still continued to shatter the Marine Headquarters, and Sengoku was shocked that the great pirate could still have so much power."}, {"type": "paragraph", "text": "Sengoku's shock became mixed with fury when the Blackbeard Pirates arrived on the battlefield, with many legendary prisoners from Impel Down standing on the execution scaffold. Sengoku's fury only intensified when he learned that Blackbeard only wanted the Shichibukai title to break into Impel Down to recruit those prisoners, and that he had discarded the title."}, {"type": "paragraph", "text": "When Whitebeard was saying his last words about the Will of D., Sengoku showed great fear and was furious with Whitebeard because he revealed to the entire world that One Piece truly existed. After Whitebeard had taken his final breath, Sengoku witnessed Blackbeard and Whitebeard disappeared under a black cloth, and later Blackbeard coming out of it after somehow stealing the powers of the Gura Gura no Mi from his former captain and using them to attack the already crumbling Marineford."}, {"type": "paragraph", "text": "When Blackbeard declared that this age was his and intended to start it off by sinking Marineford, Sengoku transformed into his Buddha form and delivered a powerful shockwave to the Blackbeard Pirates, sending the whole crew flying. He then warned Blackbeard not to go around spouting nonsense such as sinking the mighty fortress which represents justice, and prepared to fight to defend the pride of the Marines. Blackbeard taunted Sengoku and Garp, stating he would end their age just like he ended Whitebeard's."}, {"type": "paragraph", "text": "The battle came to a halt by Koby's screaming for everyone to stop. Sengoku listened to the young Marine's speech before he witnessed the arrival of Shanks, who stopped Akainu from killing Koby and stated to be in Marineford to end the war. After a short conversation with Shanks, Sengoku allowed him to take the bodies of Ace and Whitebeard, saying that he would take full responsibility for letting all the pirates on the battlefield go. He then told the Marines to tend to the wounded and that the war was over."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Sengoku_Reveals_Ace%27s_Father.png/revision/latest/scale-to-width-down/210?cb=20130403032120", "caption": "Sengoku reveals who Ace's father is."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Sengoku_Prepares_For_Battle.png/revision/latest/scale-to-width-down/210?cb=20101120092139", "caption": "Sengoku prepares to fight."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/57/Sengoku_Attacks_Luffy.png/revision/latest/scale-to-width-down/210?cb=20101220030724", "caption": "Sengoku strikes an inflated Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b1/Sengoku_Holds_Down_Garp.png/revision/latest/scale-to-width-down/210?cb=20130525044850", "caption": "Sengoku pins Garp down."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/54/Sengoku_Attacks_the_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/210?cb=20130914170940", "caption": "Sengoku attacking the Blackbeard Pirates."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sitting on a pile of rubble during the war's aftermath and covered in bandages from the injuries he had sustained at some point during the war, Sengoku was informed by Brannew about Magellan's critical condition. Sengoku forbade Magellan from leaving his medical care to take responsibility for the mass breakouts or to commit suicide for his failure. He was also told about the situation in Impel Down Level 6, in which there were Level 6 prisoners missing from the prison other than the four Blackbeard took, despite Blackbeard ordering them to massacre each other and that he would take the winners as his new recruits."}, {"type": "paragraph", "text": "This lead Sengoku to suspect that other Level 6 prisoners had also escaped. Sengoku told Brannew to distribute wanted posters immediately, as even one Level 6 prisoner getting into a nation could cause major casualties to its citizens. However, Brannew informed the fleet admiral that the World Government was trying to keep this breakout quiet in order to save face and to keep the faith of the people. This level of suppression greatly infuriated Sengoku."}, {"type": "paragraph", "text": "Two weeks after the war, Sengoku approached Commander-in-Chief Kong, requesting resignation from his position as fleet admiral. Kong, though somewhat disappointed at this, accepted Sengoku's decision but assured him that both his and Garp's (who resigned earlier) records would remain untouched as an influential way of recruiting new Marines. Before departing, Sengoku suggested that Aokiji replace him as the next Marine fleet admiral."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Sengoku_Resting_After_the_Battle.png/revision/latest/scale-to-width-down/210?cb=20130912171234", "caption": "Sengoku resting after the battle."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Sengoku_Resigns_from_the_Marines.png/revision/latest/scale-to-width-down/210?cb=20141206163610", "caption": "Sengoku meets Kong and resigns."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Z", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku was shown at Marine Headquarters with Garp reflecting on the destruction of Secon Island at the hands of the former Admiral Z. He remarked on how his past was very tragic and how destroying the island and putting innocent civilians in danger was unacceptable. Garp remarked that not everyone could see things separately like him. As Garp explained to Koby and Helmeppo about Z's past, Sengoku stood silently reflecting on his former friend."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/Sengoku_Film_Z.png/revision/latest/scale-to-width-down/210?cb=20131018232935", "caption": "Sengoku, aged over the timeskip."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo was defeated, Sengoku discussed the news with Tsuru while snacking on some okaki."}, {"type": "paragraph", "text": "Three days later, Sengoku and Tsuru arrived at Dressrosa. Sengoku cheerfully commented about Admiral Fujitora's argument with Fleet Admiral Sakazuki and expressed how happy he was to not be Fleet Admiral anymore. They then met up with Admiral Fujitora and Sengoku laughed playfully at how Fujitora used a dice to determine his decision to not capture Luffy and Law. Sengoku was then greeted by the princess of the Tontatta Tribe, Mansherry. After learning of her healing ability, Sengoku offered to assist in healing the injured."}, {"type": "paragraph", "text": "After the Marines were mobilized to pursue Luffy and his allies, Sengoku had a private conversation with Law concerning Rosinante near the eastern port. After discussing how much Rosinante meant to each of them, Law revealed himself to be a \"D\" and asked Sengoku about it. Sengoku was surprised at the revelation but did not answer the question. Sengoku then told Law to live his life as Rosinante wanted. Their conversation ended when Issho used his gravity ability to lift all the rubble in Dressrosa in preparation to strike Luffy's allies at the eastern port."}, {"type": "paragraph", "text": "After Fujitora allowed Luffy and his allies to escape, Sengoku appeared behind him, saying that he heard him thanking Luffy. After leaving Dressrosa, Sengoku and the Marines escorted Doflamingo. Sengoku asked Issho to apologize to Sakazuki, but he refused, saying that he still has his pride. Sometime later, a subordinate of Kaido, Jack, attacked the Marine convoy in an attempt to retrieve Doflamingo. Though he sank two of the Marine ships, Jack was ultimately defeated."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d9/Law_and_Sengoku.PNG/revision/latest/scale-to-width-down/200?cb=20190929024611", "caption": "Law and Sengoku reminiscing on Rosinante."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku later returned to New Marineford. When Sakazuki was furious about Issho's presence at Mary Geoise, Sengoku jokingly commented that Sakazuki's job as fleet admiral must be difficult, much to Sakazuki's annoyance."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the abolishment of the Shichibukai system and the Marines learning of Big Mom and Kaido's newly formed alliance, Sengoku participated in a meeting with many Marine officers. Sengoku told them about the Rocks Pirates, along with their captain, Rocks D. Xebec, who he remembered well. He then went into detail explaining the God Valley Incident, along with the history Garp had with Roger facing the Rocks Pirates. Fleet Admiral Sakazuki then entered the room and said that the Marines were leaving Wano Country alone due to not having enough manpower to deal with both Big Mom and Kaido. Sengoku and Sakazuki then discussed about Kozuki Oden and the relationships he had with the Yonko members."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sengoku and Monkey D. Garp vs. Shiki", "elements": []}, {"text": "Sengoku vs. Monkey D. Luffy, Portgas D. Ace and Mr. 3", "elements": []}, {"text": "Sengoku and Monkey D. Garp vs. Blackbeard Pirates", "elements": []}, {"text": "Doflamingo's Marine escort vs. Jack (not shown)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Sengoku thus far has been featured in the One Piece DX Figure The Marines set, along in the One Piece Collection -Promise of the Marineford, and the One Piece Den Den Mushi Measuring Tape collection."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Sengoku_DX_Marine.png/revision/latest/scale-to-width-down/150?cb=20130525045014", "caption": "One Piece DX Marine Sengoku."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Unlimited Cruise SP", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sengoku has a pet goat. The goat is often with Sengoku, including in a Marine base when Saul was ordered to attack Ohara, at the meeting in Mary Geoise, on the execution platform when Ace's parentage is revealed, and during the aftermath of the war. After the timeskip, the goat is on the Marine ship leaving Dressrosa. The goat was also present while Sengoku spoke to many Marines officers about the past of the Rocks Pirates.", "elements": []}, {"text": "When Sengoku and Tsuru were mentioned by Bartolomeo, they were shown in the latter's imagination, hardly resembling their real appearance at all.", "elements": []}, {"text": "\"Sengoku\" can be written in kanji as 戦国, meaning \"warring states\", a term borrowed from ancient Chinese to represent a period of history in Japan known as the \"Sengoku Period\", which was recorded to have had near constant military conflict with extensive use of naval forces.", "elements": []}, {"text": "Sengoku shares his birthday, May 9, with Kong.", "elements": []}, {"text": "Sengoku is the first Mythical Zoan user to appear in the series, though he was not revealed to be one until 337 chapters after his debut.", "elements": []}, {"text": "Sengoku is the first and only known Haoshoku Haki user who has never been a pirate. He is also the only known Marine to possess this type of Haki as well as the only known Marine capable of using all three forms of Haki.", "elements": []}, {"text": "His motto is \"Reigning Justice\".", "elements": []}]}], "images": []}]}