{"sections": [{"title": "D.R.", "level": 1, "content": [{"type": "paragraph", "text": "D.R. is one of the main antagonists in Oda's one-shot, Monsters."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "D.R. has the letters of his name tattooed around his eyes, and has short, tufty light orange hair. He wears a purple cape over his attire."}, {"type": "paragraph", "text": "7 years before events of the story, he had shorter spiky hair, his \"DR\" tattoos were smaller and on D.R.‘s forehead, instead of around his eyes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "D.R. is a cunning and dishonorable conman, plotting with his partner to frame an innocent samurai while they loot a town. When death is imminent, however, D.R. shows his cowardly side, using the fact that he is the only one who could prevent impending danger as leverage."}], "images": []}, {"title": "Abilities", "level": 2, "content": [{"type": "paragraph", "text": "It is mentioned that he is a third rate swordsman. He could also use the Dragon Horn to summon and control a dragon, a feat that took him three years to master."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "He bumped into Ryuma and he stabbed himself, claiming that Ryuma did it. After this event he summoned a dragon to destroy the village, claiming that Ryuma challenged him to do it by stabbing him, but his original plan was to steal the villagers' precious items when they ran for their lives. Instead, after his partner Cyrano was killed in one stroke by Ryuma, D.R. threatened the samurai with the supposed fact that he is the only one who could control the dragon. His pleas fell on deaf ears as Ryuma stabbed him to death."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "D.R. vs. Ryuma", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "D.R.'s wanted poster can be seen in Episode 45 of the anime on the wall on Fullbody's ship. Another one can be seen in Episode 48 when Luffy goes to the Gold Roger Bar. The Episode 48 poster is the only one crossed out, signifying that D.R. is already captured (or in his case, confirmed dead), and that his bounty has been retracted.", "elements": []}, {"text": "For some reason, the wanted posters of D.R. in Episode 45, Episode 66, and the ninth movie are not crossed out, despite his downfall many years ago.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Monsters - D.R. is introduced.", "elements": []}, {"text": "↑  One Piece Movie 9, D.R.'s wanted poster is seen in the intro alongside others.", "elements": []}, {"text": "↑  One Piece Anime — Episode 45, D.R.'s wanted poster is seen posted on the wall of Fullbody's ship.", "elements": []}, {"text": "↑  One Piece Anime — Episode 48, D.R.'s wanted poster is seen posted on the wall of the Gold Roger Bar.", "elements": []}, {"text": "↑  One Piece Anime — Episode 66, D.R.'s wanted poster is seen posted inside a building in Whiskey Peak.", "elements": []}]}], "images": []}]}