{"sections": [{"title": "Sakazuki", "level": 1, "content": [{"type": "paragraph", "text": "Sakazuki, formerly known by his admiral alias Akainu, is the current fleet admiral of the Marines, succeeding the previous fleet admiral, Sengoku. During the first half of the series, he was one of the three admirals, and the last one to be fully revealed. He ascended to the position of fleet admiral after defeating Kuzan in a ten-day duel that left Punk Hazard in its current state. One of his first decisions was to relocate the Marine Headquarters into the New World in preparation for the New Pirate Age."}, {"type": "paragraph", "text": "In the manga, he was first mentioned by Nico Robin during the initial encounter with Aokiji. In the anime, he was mentioned earlier by Vice Admiral Jonathan during the anime-only G-8 Arc, which aired after Akainu had been revealed in the manga."}, {"type": "paragraph", "text": "Because of his actions, Akainu was one of the main antagonists of the Marineford Arc and after his promotion, he became one of the central antagonists of the series."}, {"type": "paragraph", "text": "Sakazuki is perhaps the most strident follower of Absolute Justice in the entire series, to the point where his extremism prompted an equally high-ranking colleague to resign from the Marines. He believes that a person's heritage is a reflection of how big of a threat they pose - a belief which caused him to target Portgas D. Ace and Monkey D. Luffy during the Battle of Marineford for the purpose of purging their \"bad blood\", which ultimately led him to personally kill Ace and attempt to kill Luffy, which he failed to do - managing only to leave a massive scar on his chest."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sakazuki is an incredibly tall, light-skinned, unusually muscular man (the most muscular of the former admirals). He's about as tall as his fellow admirals, with a square-shaped face, very pronounced facial features, and short black hair. He stands at 306 cm (10'), making him taller than other massive characters like Jinbe, who is 301 cm. He usually wears a standard Marine cap and sports a crimson, double-breasted suit, decorated with what appears to be a pink rose on his left buttonhole. Unlike many high-ranking Marines, he does not wear a tie, but instead leaves his light colored flower-patterned shirt unbuttoned, showing his muscular neck and part of his tattoo. He wears black gloves and black shoes. "}, {"type": "paragraph", "text": "The tattoo on the left side of his chest is black (light-blue in the anime), containing numerous images of flowers integrated into its design. Sakazuki's tattoo has flame-shaped edges, and it extends from the admiral's left shoulder to his hip, covering part of his back and ribs. He has another, smaller tattoo in the shape of a black sword on his right deltoids and a small part of the biceps. In the anime, his eye color is seen to be brown, and this was also shown in a colored drawing by Eiichiro Oda."}, {"type": "paragraph", "text": "In his youth, Sakazuki wore an open red shirt, as well as a set of khaki pants held up with a loosely tied yellow-orange ribbed belt with a silver bullseye shaped buckle, and a pair of red sneakers. He also carried a katana on his back."}, {"type": "paragraph", "text": "Twenty-two years ago at the Ohara Incident, he wore a simple white Marine cap under a dark gray hood that seemed to be a part of a cloak he wore beneath his suit, or Marine coat. Until getting off his chair in order to destroy an incoming iceberg during the Battle of Marineford, his face was always hidden by the bill of his cap."}, {"type": "paragraph", "text": "As a child, Sakazuki still had the grim disposition he retained as an adult. He also wore tattered clothes and carried a dagger. He wore a cap similar to the Marines' cap he would don in the future, except it has the kanji for \"justice\" instead."}, {"type": "paragraph", "text": "After the time-skip, as a result of his intense battle with Kuzan at Punk Hazard, the right side of Sakazuki's neck and face are scarred, and a chunk of his right ear is missing. In addition to his injuries, he also grew a mustache and goatee. He has also replaced his trademark red suit for a white one, similar to what Sengoku wore when he was Fleet Admiral; however, Sakazuki still wears the same floral pattern shirt underneath and doesn't wear his black signature gloves. He is also frequently seen smoking a cigar."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "While he is a very capable and strong leader who has consolidated the power and prestige of the Marines, Sakazuki would be best catagorized as an extremist and highly dogmatic. Sakazuki is an adamant believer in Absolute Justice, and is ruthless in his maintenance of it. His motto is \"Thorough Justice\" (徹底的な正義, Tetteiteki na Seigi). He has a stern, dead-serious disposition, grim, expressionless, and was the most ruthless out of all three admirals two years ago. This has given him a very fearsome reputation, but of greater concern is his dogmatism, which may end up making the Marines into a force that is worse than the enemies they hope to eliminate. Despite this disposition, like Eustass Kid, Akainu seems to be able to restrain himself at times, having chosen to spare the life of Jewelry Bonney and her crew after they were left by the Blackbeard Pirates for Akainu to salvage, and letting his colleague Aokiji live despite Aokiji losing to him after a 10 day duel to the death for the position of fleet admiral. "}, {"type": "paragraph", "text": "During the Buster Call attack on Ohara, Sakazuki's beliefs led him to go as far as destroying a refugee ship because of the possibility that a scholar could be hiding on board. His logic being that if even one of the scholars of Ohara had escaped with it, the mission would have been a failure, much to the dismay of Kuzan, who called him a fool for overdoing things. His extremism has turned him into a borderline, if not outright psychopath, willing to do anything to serve his own goals no matter the cost. He mostly sees the Marines as an extension of himself and his own beliefs, willing to kill those who disagree with him, and showing little care for people placed under his charge. While this has made him extremely powerful and feared among pirates, it also makes him feared and loathed by his own men, losing a very useful and powerful ally in Kuzan because of it. The best example of this is when he attempted to murder Koby for his plea to stop the war. His extremism also caused him to bar Fujitora from ever entering a Marine base due to his prostration in Dressrosa, though it was mostly because Sakazuki couldn't stand to see his version of justice and honor shamed because his enemies showcased its own failure. Fujitora rightly pointed out that Sakazuki's version of Justice had no credibility or honor in the first place if it was that fragile, which only inflamed Sakazuki's rage, seeing it as a personal slight."}, {"type": "paragraph", "text": "Additionally, he has no tolerance for Marines who desert their posts, which the only consolation he does offer is that they should not dishonor their families by running away.Caesar Clown also believed that Sakazuki would desire his ideas of mass-murder weapons and inhumane experimentation on prisoners, in contrast to the more pragmatic Sengoku. To Akainu, any Marine who is not willing to fight for justice is not worthy of being called a Marine. Again though, despite all of this, even Sakazuki could not kill his former compatriot Kuzan."}, {"type": "paragraph", "text": "As Fleet Admiral, Sakazuki holds immense pride in the name of the Marines. For example, when he learned that Fujitora had let the world know of what transpired in Dressrosa, Sakazuki was furious. His pride is so great he would rather cover up the ordeal to ensure that the Marines are adamant and credible to his doctrine of Absolute Justice. This conceited behavior also led to him yelling at the Five Elders for declaring Doflamingo's resignation from the Shichibukai as a false report, as he knew the world's confusion would damage their trust in the Marines, as well as the reputation of the Marines."}, {"type": "paragraph", "text": "Despite his position as an admiral prior to promotion, Akainu is willing to lie to and deceive his enemies in order to achieve Justice. So far, Akainu's manipulations have been incredibly successful, such as when he managed to deceive Squard through Sengoku's master strategy, or insulting Whitebeard to get Ace angry enough to stop his attempt at escape."}, {"type": "paragraph", "text": "He finds people who attempt to interfere with him as nothing more than irritating obstacles. Furthermore, he seems to be unafraid of older legends, as when Whitebeard told his men not to be intimidated by Garp due to the Marine being an old man, Akainu mocked Whitebeard's comment, saying that Whitebeard was also from the same generation as Garp before attacking the Yonko. While other Marines such as Sengoku and Garp share a decent amount of respect for their accomplished enemies, Akainu has no such empathy, instead disparaging them at every chance he gets."}, {"type": "paragraph", "text": "Prior to Sengoku making it public, Akainu was one of the few who knew that Luffy was Dragon's son. It is unknown if he has some past relationship with Dragon, or if it was simply common knowledge among the higher ranking Marines that Dragon is Garp's son. As such, Akainu deems that Luffy's mere existence, due to being Dragon's son, is enough to be a threat to the world and therefore must be eliminated. In fact, Akainu's beliefs about heritage run deep enough that he declares that even if every other pirate escapes, he would personally ensure that neither Ace nor Luffy were allowed to leave the war alive due to their bloodlines. This conviction fueled Akainu even to the point of actively hunting Luffy himself, even though Blackbeard was destroying Marineford at the time."}, {"type": "paragraph", "text": "Akainu does not see it as the business of the Marines to involve themselves with the business of the Celestial Dragons. This was proven during his confrontation with the Five Elders, where he disparages them for permitting the Celestial Dragons' CP-0 to falsify Donquixote Doflamingo's resignation from the Shichibukai. He even questions if the Five Elders are puppets to the World Nobles."}, {"type": "paragraph", "text": "Surprisingly, Sakazuki can demonstrate caution in regards to battling pirates or causing disturbances in global affairs. Despite Borsalino's request to travel to Wano Country to deal with the possible alliance of the Beasts Pirates and Big Mom Pirates, he declines citing that Wano's military strength is an unknown factor and they are not within their jurisdiction."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "As the Marine fleet admiral, Sakazuki has command over the entire organization. Marines respect him and used to call him \"Admiral Sakazuki\" most of the time, as opposed to his epithet."}, {"type": "paragraph", "text": "Nevertheless, his ruthless adherence to \"Absolute Justice\" has made his colleagues fear and despise him, especially Aokiji, who called him a fool for taking things too far. In turn, Akainu will easily kill any Marines who contradict his beliefs, as he executed a soldier for leaving his post in fear, and even made an attempt on Koby's life for voicing his objections for taking the war too far."}], "images": []}, {"title": "Kuzan", "level": 4, "content": [{"type": "paragraph", "text": "Aokiji strongly opposed Akainu becoming fleet admiral and dueled him for the position. After winning, Sakazuki decided to spare Kuzan because they were comrades, showing at least some compassion, if only for a whim. Regardless, Kuzan chose to leave the marines and resign from the position of admiral, so as to not serve under Sakazuki. Despite sparing Kuzan, he is derisive about his decision to resign from the Marines and states his activities are not their concern."}], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Akainu also did not show any respect to Monkey D. Garp, despite the old vice admiral being a \"hero\" who was eligible for the position of admiral, due to him being from the previous generation, but mostly for sharing the same lineage with Dragon and Luffy. Garp, in turn, tried to murder Akainu for executing Ace, and had to be restrained by Sengoku."}], "images": []}, {"title": "Sengoku", "level": 4, "content": [{"type": "paragraph", "text": "Akainu did not seem to have any problems with Sengoku when he was his subordinate before the timeskip. This was seen when he grudgingly complied with Sengoku's order to end all hostilities of the Marineford War and permitting the Whitebeard Pirates to leave. However, after succeeding Sengoku in his position as fleet admiral, he was annoyed by Sengoku's amusement at Issho using a loophole to enter Mary Geoise."}], "images": []}, {"title": "Issho", "level": 4, "content": [{"type": "paragraph", "text": "Sakazuki's relationship with Admiral Fujitora is also strained. Although they seemed to be on amicable terms previously, as he initially put an immense amount of trust in him since he believed that Issho can stop Law and Luffy, and Issho could address Sakazuki with the nickname Saka-san without it bothering him. This friendly status changed when Issho took matters into his own hands during the incident in Dressrosa, by putting his faith in pirates to defeat Doflamingo as well as bowing apologetically to King Riku for the World Government allowing Doflamingo to torment their kingdom for so long. Furious over Issho humiliating the Marines, Sakazuki ordered Issho to kill Law and Luffy and reiterated that he wouldn't allow any Marine bases to take him in until he accomplished that goal, which Issho was content with, as his opinion of the Marines and their sense of justice was disparaging."}], "images": []}, {"title": "World Government", "level": 3, "content": [{"type": "paragraph", "text": "Sakazuki is shown to have absolute loyalty to the World Government and is an extreme follower of their doctrine of Absolute Justice. When Sengoku stepped down as Fleet Admiral, many in the upper echelons nominated him to be Sengoku's replacement."}], "images": []}, {"title": "Five Elders", "level": 4, "content": [{"type": "paragraph", "text": "Even though he is loyal to the World Government, he was disgusted when he was informed that the report given to Marine Headquarters about Doflamingo's resignation from the Shichibukai was fraudulent. He even personally argued with the Five Elders concerning the matter. During that heated argument, Sakazuki criticized how much work they issued because of Doflamingo. Sakazuki even insulted, provoked, and mocked them because CP0 acted over their heads, testing his limits and showing that he does not agree with everything the Five Elders do. After Sakazuki complained to the elders about how Doflamingo's actions would make him look as Fleet Admiral, they retorted that Sakazuki's reputation does not matter to them. They also provoked him by bringing up his old colleague's recent acts. However, Sakazuki did not fall for their taunts as he told them that Kuzan left the Marines when he became fleet admiral and it has nothing to do with them."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Shichibukai", "level": 4, "content": [{"type": "paragraph", "text": "Even though the Shichibukai are on the World Government's side, Sakazuki sees all of them as nothing more than pirates and believes they cannot be trusted. Despite this, Sakazuki saw them as a neccesary military force for the marines and was unhappy that the Shichibukai system was abolished, but Issho believes the reason why Sakazuki thinks this way is because Sakazuki had never personally suffered from the Shichibukai the same way others have."}], "images": []}, {"title": "Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "As Akainu boldly insulted Whitebeard, he earned the wrath of Portgas D. Ace, who viewed the captain as a father figure. This made Ace lose his chance to retreat in an attempt to strike down Akainu in revenge, only to fail and ultimately lose his life at the hands of the then admiral. Akainu, in turn, viewed Ace as one of the two most dangerous individuals (the other one being Luffy) in the world, due to his father being Gol D. Roger."}, {"type": "paragraph", "text": "Akainu feigned sympathy towards Squard to get him to betray Whitebeard, then brutally injured Whitebeard and killed Ace, which resulted in the rest of the Whitebeard Pirates directing their anger toward him, and the remaining commanders attempting to fight against him, even though they might have been killed. Whitebeard himself brutally injured Akainu (an example of this would be when Akainu was placed at the epicenter of a shock wave, courtesy of the Gura Gura no Mi) out of revenge for Ace's demise. Akainu, however, views all pirates as criminals that are not allowed to exist, and the Whitebeard Pirates are no exception."}], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "During the war at Marineford, Akainu tricked Squard into stabbing Whitebeard. When Whitebeard was unleashing his Gura Gura no Mi powers at the plaza, Akainu engaged him in combat, trying to prevent him from causing any more significant damage to Marineford. After he provoked and killed the second division commander Ace, Whitebeard brutally injured Akainu. During the ensuing conflict, Akainu burned off a portion of Whitebeard's head."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Due to Luffy being the son of the Revolutionary Dragon, Akainu views him as the most dangerous threat to the world, along with Ace, and possesses an immensely dangerous obsession with ending Luffy's life. After killing Ace and sending Luffy into a mental breakdown, Akainu hounded Luffy throughout the remainder of the war, insistent that he would not escape Marineford alive. To this end, the Admiral ignored all surrounding threats, and focused solely on taking Luffy's life. Akainu showed frustration when Shanks' intervention allowed Luffy to escape. Even though he failed to take Luffy's life during the war, he managed to give Luffy an X-shaped scar that covers most of his chest. Furthermore, Akainu did the only thing that no one else could do in the entire series: completely break Luffy's spirit."}, {"type": "paragraph", "text": "Akainu always refers to Luffy as \"Dragon's son\", viewing him as a global-scale threat solely based on heritage, and that Luffy must be eliminated at all costs. Two years after the war at Marineford, he wasted little time in sending an admiral to capture or kill him. On the other hand, Luffy holds great hatred towards Akainu for killing his brother, although after learning of Akainu's promotion, he was quick to return to his old carefree attitude after a brief moment of anger."}, {"type": "paragraph", "text": "After Luffy defeated Doflamingo, Sakazuki was shocked and angry over the incident and during a heated argument with Fujitora, Sakazuki demanded him to arrest Luffy."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Akainu considers Jinbe a traitor after his resignation from the Shichibukai and for cooperating with Luffy. Although he was more interested in taking Luffy's life, he showed absolutely no mercy to Jinbe on the battlefield and attempted to kill him numerous times while Jinbe was protecting Luffy. Jinbe is aware of how dangerous Akainu is, and wasted no time in warning the Straw Hats about how ruthless the Marines have become under his command."}], "images": []}, {"title": "Crocodile", "level": 4, "content": [{"type": "paragraph", "text": "During the war at Marineford, the former Shichibukai Crocodile became enemies with Akainu. When Akainu attempted to kill both Luffy and Jinbe, Crocodile intercepted Akainu by using Desert Grande Espada."}], "images": []}, {"title": "Jewelry Bonney", "level": 4, "content": [{"type": "paragraph", "text": "After learning of Jewelry Bonney's whereabouts, Akainu said that the World Government had been worried due to her disappearance, and Bonney replied that she hates the World Government and the Marines."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "After learning that Law formed an alliance with Luffy, Sakazuki was deeply concerned with Law's actions and sent Fujitora to Dressrosa to capture both him and Luffy. After his heated argument with Fujitora, Sakazuki ordered him to arrest Luffy and Law."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Shanks intervened on Sakazuki's attempt to kill Koby, while Sakazuki was shocked to see him at Marineford. Aware of Shanks' threat, Sakazuki made no attempt to attack him though the latter earned Akainu's fury because his arrival had allowed Luffy to escape his grasp."}], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Two years ago, when Blackbeard arrived at Marineford and stole Whitebeard's Devil Fruit power, Akainu ignored him to pursue and attempt to kill Luffy which ended in failure. After the war at Marineford, Akainu was sent to deal with Blackbeard, but Blackbeard and his crew got away."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the current fleet admiral, Sakazuki has control over the entire Marine organization, from ordering all soldiers and officers as he sees fit to issuing a Buster Call on any island he deems to be a threat, and to revoke any Shichibukai's title at any time, as well as including the authority to promote and demote any Marines as he sees fit on top of granting the power and authority to either temporarily grant others similar authority and power, or near-permanent power to anyone he wants, or has to. His only superiors are the World Government's Commander-in-Chief Kong and the Five Elders."}, {"type": "paragraph", "text": "Sakazuki's background, specifically his black-hearted behavior, is renowned, especially among the stronger figures in the New World, striking fear into the hearts of pirates and marines alike. After Van Augur identified Akainu aboard a marine ship for negotiations, Blackbeard immediately fled, knowing the consequences of battling against him, even though Blackbeard had gained the powers of the Gura Gura no Mi, and had strengthened his crew with several of Impel Down's most powerful criminals."}, {"type": "paragraph", "text": "Many within the high ranking echelons within the World Government suggested Akainu to become the succeeding fleet admiral over Sengoku's personal recommendation for Kuzan, thus further supporting his incredible military might. Furthermore, Jinbe noted the Marines have become a much more powerful organization under Akainu despite the resignations of Garp, Sengoku and Kuzan, indicating great leadership on Akainu's behalf."}, {"type": "paragraph", "text": "He is a very skilled manipulator, using his knowledge of his opponents to deceive them into doing what he wants. He feigned sympathy to Squard, and used his hatred of the late Pirate King to influence him into betraying his loyalty to Whitebeard. He also used Ace's devotion to Whitebeard to his advantage, as seen by his insulting Whitebeard in order to provoke Ace into attacking him and preventing his escape, and ultimately killing the young pirate by aiming for his younger brother."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Sakazuki has an immense amount of superhuman durability, as is illustrated by the fact that not even two Busoshoku Haki enhanced quake-powered blows, which caused far more damage at point-blank range, from Whitebeard were able to keep him down, one of which was powerful enough to split Marineford in two, and he was still able to fight the Whitebeard Pirates and two former Shichibukai (Crocodile and Jinbe) all at the same time. He has enormous stamina, being able to fight numerous enemies and being able to keep going without showing any signs of exhaustion."}, {"type": "paragraph", "text": "His durability also extends to Haki-enhanced attacks, as not even Marco, Vista, and Jinbe, who are highly skilled Busoushoku Haki users, could deal any significant damage to Sakazuki. It took Whitebeard's own powerful Haki to actually injure him."}, {"type": "paragraph", "text": "Sakazuki possesses tremendous physical strength, as shown when he pinned Whitebeard's giant bisento down to the ground with just one leg. Akainu is also a powerful and skilled hand to hand fighter, which he combines with his Logia abilities for destructive offense. He easily defeated Inazuma, as well as two extremely powerful martial art masters such as Ivankov and Jinbe. Furthermore, he was the one who emerged victorious from the ten day duel between him and Aokiji for the position of the fleet admiral, although they both suffered grave injuries."}, {"type": "paragraph", "text": "He also has extremely acute hearing, being able to hear activity underwater before the Whitebeard War began."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Sakazuki possesses the Magu Magu no Mi, a Logia-class Devil Fruit which grants him the ability to transform his body into magma and manipulate it at will, as well as produce near-limitless amounts of it. As a Logia, Sakazuki can let physical attacks pass through him without injury, and can only be wounded with the use of Haki, Seastone, being caught off guard, and his elemental weakness."}, {"type": "paragraph", "text": "His ability is naturally of a higher order than Ace's pyrokinetic abilities, as the higher heat and smothering abilities of his magma allowed him to successfully harm Ace despite Ace's Logia-defense, and ultimately kill Ace due to this superiority. The destructive heat and explosive powers from the magma enables Akainu to cause massive damage, and to take on people like Emporio Ivankov and Jinbe with minimal effort. During the decisive ten day battle on Punk Hazard for the position of fleet admiral, Akainu showed the furious power of his Devil Fruit as he changed the weather of one side of Punk Hazard and left it in a blaze. His Devil Fruit also boasts the highest offensive power amongst all the Devil Fruits."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Magu_Magu_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20110427102452", "caption": "Akainu transforming his body into a wave of magma."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so being two ranks above vice admiral, Sakazuki can also use this ability."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Sakazuki possesses the ability to use Busoshoku Haki. He was seen using an advanced level of Busoshoku Haki to negate Whitebeard's attempt to destroy the execution platform, by creating, with his fellow admirals, a shield combination of their three Haki."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Sakazuki possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Sakazuki was seen wielding a knife as a child, and a katana during his youth as a Marine."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sakazuki was born in North Blue. Even as a child, he already has a grim disposition, and a sense of justice showcased on the hat he wore."}], "images": []}, {"title": "Joining the Marines", "level": 4, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story.  At the age of 23, Sakazuki joined the Marines alongside a 26 years old Borsalino, and came under the tutelage of instructor Zephyr. The two were already considered \"monsters\"."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "A Storm in the Edd War", "level": 4, "content": [{"type": "paragraph", "text": "When the Marines learned that the Roger Pirates and the Golden Lion Pirates were about to battle in the Edd War, three years before the death of the Pirate King, Sakazuki was seen in Marineford, walking with Garp, Kuzan, Saul and Tsuru, listening to the conversation about Garp's efforts to capture Gol D. Roger."}], "images": []}, {"title": "Ohara Incident", "level": 4, "content": [{"type": "paragraph", "text": "He was known as Vice Admiral Sakazuki before his promotion. He was present at the Ohara incident, being one of the five vice admirals leading the Buster Call bombardment. He ordered the destruction of an evacuation ship of civilians and soldiers, claiming it needed to be destroyed in case a single scholar managed to sneak on board (an action that horrified even Spandine)."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Vice Admiral Momonga mentioned to Boa Hancock that the three Marine admirals, including Akainu, will lead the Marines against the Whitebeard Pirates following the announcement of Portgas D. Ace's execution."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Following the gathering at Marineford, Akainu was seen sitting beneath the execution platform of Portgas D. Ace with his fellow Marine admirals."}, {"type": "paragraph", "text": "Akainu stepped into the battle when Jozu hurled a massive iceberg, displaying abilities to control volcanic rock by launching a fist made of magma to destroy the iceberg and sending small burning rocks flying all over the place, destroying one of Whitebeard's ships."}, {"type": "paragraph", "text": "He was later seen confronting a Marine officer who was fleeing from the battle not wanting to die out of concern for his family. Akainu attacks, and brutally executes the Marine officer for this \"cowardice\", much to the horror of Koby and Helmeppo who were watching (having nearly ran into the admiral themselves doing the same thing). Akainu then receives a report on the Den Den Mushi that the preparations for Sengoku's plan are set. Luffy's arrival at Marineford has Admiral Akainu commenting that, as the son of Dragon, Luffy is the one pirate who must be eliminated at all costs."}, {"type": "paragraph", "text": "During the battle, following Sengoku's orders, Akainu talked to Captain Squard, making him believe that Whitebeard had betrayed his allies, trading their lives for Ace's. He demonstrated his words by making Squard notice that the Pacifistas attacked everyone in the bay except Whitebeard's pirates, this being also part of Sengoku's plan. He told Squard he does not agree with the plan of sparing Ace's and Whitebeard's life, and offered him the chance to save himself and his own crew if he killed Whitebeard. Because of his deep hatred for Gol D. Roger, who killed his first crew, Squard believed him and attacked Whitebeard, by stabbing him in the chest."}, {"type": "paragraph", "text": "Whitebeard survived Squard's attack, and forgave his ally and started a massive attack against the Marines, using his Devil Fruit's powers. Akainu, along with Aokiji and Kizaru, managed to stop Whitebeard's seismic waves directed to the platform on which Ace was chained."}, {"type": "paragraph", "text": "After the steel wall was finally raised around the pirates, Akainu started to attack the pirates with his Ryūsei Kazan, which melted Aokiji's ice and destroyed the Moby Dick. Much later, when Luffy was hurled over the siege wall and landed before the execution platform, Akainu sneered before commenting on how bold the son of Dragon is."}, {"type": "paragraph", "text": "After Whitebeard and his crew successfully entered the plaza, Whitebeard began to swing his Bisento for another attack when Akainu intervened, and told him that the island would not hold out long if he kept doing that. Whitebeard then told him he should try and protect it. They then both used their Devil Fruit powers and clashed with each other."}, {"type": "paragraph", "text": "When Garp joined the battle, Whitebeard told his men that he is just an old man and that they should not be fooled. Akainu retaliated and said that Whitebeard himself was also of the same generation. The two clashed again, causing another rampage in Marineford. Akainu was angry at Whitebeard and shouted at him for destroying the city, and Whitebeard repeated what he said before and told him he should protect it. Suddenly, Whitebeard grabbed his chest and coughed up a massive amount of blood. Akainu commented on how Whitebeard can not escape the effects of old age and took full advantage by landing a devastating blow on Whitebeard's chest with molten magma."}, {"type": "paragraph", "text": "Luffy unleashed a wave of Haoshoku Haki, which saved Ace from the second execution attempt, while Akainu noticed that Luffy used his power unconsciously. When Ace was finally freed, Akainu assured his men that there was nothing to worry about, since the two pirate brothers were going to be captured again and executed. He then confronted Luffy and Ace, and provoked Ace into attacking him by disparaging Whitebeard. After Ace's attack backfired, Akainu said that his magma can smother Ace's fire and was thus able to injure Ace despite his Logia intangibility, making him his natural enemy."}, {"type": "paragraph", "text": "He went on to state that both Luffy and Ace deserved to be executed due to their parentage and attacked Luffy, but Ace threw himself in the way. Ace took Akainu's devastating attack through his torso, which shortly lead to his death. Akainu then burned Jinbe as the latter attempted to protect Ace from a strike to the head. Marco and Vista attacked him with their haki, and he commented on how much of a nuisance they were. Enraged at the death of Ace, Whitebeard attacked Akainu, striking him from the back with a crippling blow. Akainu got back up and attacked back, burning off a portion of Whitebeard's head. Whitebeard then gave the admiral another devastating blow, sending him falling into a crater. Akainu, having survived Whitebeard's onslaught, tunneled underground and reappeared in front of Jinbe as he was making his way to the escape ship with Luffy in tow."}, {"type": "paragraph", "text": "Akainu demanded Jinbe to hand over Luffy, but Jinbe refused, stating that he will protect Luffy with his life. Akainu then prepared to attack, but Ivankov appeared and blasted Akainu with a Hell Wink. He later heard Blackbeard as he declared to the entire world that the age of Blackbeard has begun. Despite Blackbeard's grave announcement and his newly acquired power, he still chose to continue pursuing Luffy. Akainu then subdued Ivankov and Inazuma and continued to chase after Jinbe and Luffy, which ends in Akainu piercing through Jinbe and straight towards Luffy, critically injuring the both of them."}, {"type": "paragraph", "text": "When he was prepared to finish them off, Crocodile repelled him and got Luffy and Jinbe out of the admiral's reach. Akainu then prepared to face off against Crocodile and the Whitebeard Pirates."}, {"type": "paragraph", "text": "He took down Curiel and went into a blind rage yelling to the marines to not let pirates roam this earth. He, along with the whole battlefield, was stopped by Koby as he yelled for the fighting to stop. Akainu was outraged at this and attacked Koby, only to have his punch blocked by Shanks. Akainu was angered, because Shanks's interference had caused Luffy to escape his grasp. After Aokiji and Kizaru's failed attempts on Luffy's life and Sengoku complying with Shanks' demands to end the Whitebeard War, Akainu was very displeased."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/aa/Akainu_vs_Block_of_Ice.png/revision/latest/scale-to-width-down/210?cb=20190224182922", "caption": "Akainu preparing to attack a gigantic iceburg hurled by Jozu."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Sakazuki_Attacks_Whitebeard.png/revision/latest/scale-to-width-down/230?cb=20141206161512", "caption": "Akainu strikes Whitebeard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Ace_Saves_Luffy.png/revision/latest/scale-to-width-down/210?cb=20190830051344", "caption": "Akainu fatally injures Ace."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/46/Whitebeard_Breaks_Akainu%27s_Ribs.png/revision/latest/scale-to-width-down/210?cb=20140801152509", "caption": "Akainu brutally attacked by an enraged Whitebeard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Shanks_Saves_Koby_From_Akainu.png/revision/latest/scale-to-width-down/210?cb=20130617023848", "caption": "Shanks saves Koby from Akainu."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the Blackbeard Pirates' raft was damaged because of the size of Sanjuan Wolf, Marshall D. Teach took Jewelry Bonney and her crew as a means of exchange with the World Government for a new ship. The Marines did not seem to accept the exchange, since Akainu was sent to the island. Blackbeard and his crew escaped, and left Bonney behind. Akainu faced Bonney, and said that the World Government had been worried due to her disappearance, and Bonney replied that she hates the World Government and the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Akainu_Captures_Bonney.png/revision/latest/scale-to-width-down/180?cb=20140801104743", "caption": "Akainu apprehends Bonney."}]}, {"title": "During the Timeskip", "level": 3, "content": [], "images": []}, {"title": "A Rise in Rank", "level": 4, "content": [{"type": "paragraph", "text": "Sakazuki was nominated for the position of fleet admiral after Sengoku had retired. Kuzan, however, was against the idea of having him become the new fleet admiral and the two admirals battled each other for the position on Punk Hazard. The battle lasted for ten days, and their respective powers caused Punk Hazard to permanently be frozen on one half and burning on the other. In the end, Sakazuki ended up as the victor of that battle, although both men were seriously wounded. Sakazuki, however, decided to let Kuzan live because they were comrades."}, {"type": "paragraph", "text": "His new leadership has given the Marines a stronger sense of Absolute Justice. Not wanting to serve under Sakazuki, Kuzan decided to resign from the Marines. After becoming fleet admiral, Sakazuki decided to relocate the Marine Headquarters to the New World in exchange for the G-1 branch."}, {"type": "paragraph", "text": "As fleet admiral, Sakazuki instituted a mandatory draft to bolster the forces of the Marines; Admirals Fujitora and Ryokugyu were recruited in this draft."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Kuzan_vs._Sakazuki.png/revision/latest/scale-to-width-down/210?cb=20130521141619", "caption": "Kuzan vs. Sakazuki."}]}, {"title": "3D2Y", "level": 4, "content": [{"type": "paragraph", "text": "When Byrnndi World and the World Pirates make their return and threaten the Government, Sakazuki and the Marines, summoned by Buggy, ambush World's ship and began to attack it, in which Sakazuki does heavy damage with his magma powers."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "One Piece Film: Z", "level": 4, "content": [{"type": "paragraph", "text": "After Borsalino informed him of Z's return, Sakazuki ordered a summit meeting at the new Marine Headquarters. He was enraged of hearing the news of the Dyna Stones being stolen and the destruction of the Marine base at Firs Island. Reluctantly, he dispatched Borsalino and six vice admirals to eliminate him and the Neo Marines, while quietly wishing that he did not have to resort to killing their former instructor."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Marine_Summit_Film_Z.png/revision/latest/scale-to-width-down/180?cb=20130706044227", "caption": "Sakazuki and the other high ranking officers discussing Zephyr's recent actions."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Donquixote Doflamingo supposedly renounced his title of Shichibukai and Luffy and Law formed an alliance, Sakazuki was seen with the other high-ranking marines discussing the next course of action. After he declared that he would not let Law and Luffy do whatever they wanted, Sakazuki asserted that the situation would be cleared in a day and noted that he had sent Admiral Fujitora to take care of it."}, {"type": "paragraph", "text": "Later, Sakazuki communicated with Fujitora via Den Den Mushi to inform him that the report given to Marine Headquarters regarding Doflamingo's resignation was fraudulent, and noted the situation was infuriating, and that he was heading to Mary Geoise to confront the Five Elders about it."}, {"type": "paragraph", "text": "Sakazuki later had a meeting with the Five Elders and a heated argument broke out between them. After learning that the false news about Doflamingo leaving the Shichibukai was by the order of those above them, he angrily asked the Five Elders why the whole world had to be misled for Doflamingo's sake, noting that if an incident like this were to occur again, he as fleet admiral would be disgraced. The Five Elders ignored him, saying that they were not concerned with his reputation as the Marines are only the public face of the World Government. When he was told that the case had been left to the Cipher Pol, Sakazuki retorted that even the Five Elders had been walked over by the \"Celestial Dragons' puppets\". The Five Elders responded in anger, blaming Sakazuki for Kuzan joining Blackbeard. Sakazuki replied that Kuzan's actions after he left the Marines were not his concern. Suddenly, a Marine interrupted the meeting and reported about what transpired on Dressrosa."}, {"type": "paragraph", "text": "Sakazuki then contacted Fujitora and scolded him for allowing the true news of what transpired at Dressrosa to spread throughout the world without the consent of those in the higher echelons. He angrily told Fujitora that he should know what it means for him to admit fault, and that he should have reported it before taking action. Fujitora replied if he had done so, the incident might have been covered up. Sakazuki suggest that cover-ups were needed in order to save the face of the World Government. Fujitora stated that he does not want to be made into a hero for something he did not do, and that the World Government needs to take responsibility for their actions. Sakazuki shouted that it is a matter of credibility and trust and Fujitora had disgraced the face of \"Justice\", but Fujitora responded, rightly, that if Justice was so easily shamed and fragile, the credibility and trust Sakazuki was worried about was nonexistent in the first place.  This response infuriated Sakazuki further as it meant his power was hollow and empty.  In his anger, Sakazuki then demanded Fujitora to bring back the heads of Luffy and Law as recompense for his actions at Dressrosa, and forbade Fujitora from entering any Marine base until he carried out this order."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d1/Sakazuki_and_Five_Elders_Meeting.png/revision/latest/scale-to-width-down/250?cb=20160411034019", "caption": "The meeting between Sakazuki and the Five Elders."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Sakazuki_argues_with_Fujitora.png/revision/latest/scale-to-width-down/180?cb=20150714144555", "caption": "Sakazuki chastises Fujitora for dragging the name of \"justice\" through the dirt."}]}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Gold", "level": 4, "content": [{"type": "paragraph", "text": "In Marine Headquarters, Sakazuki received a report from Rob Lucci about the Marines sending forces to aid Gild Tesoro. Sakazuki was not happy about serving a pirate, but Lucci replied that the World Government had motives of its own."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "While reading the newspaper detailing Luffy's exploits at Totto Land, Sakazuki received a report that Komane, the princess of the Lulusia Kingdom was kidnapped by pirates, making him furious and questioning why the escort allowed that to happen."}, {"type": "paragraph", "text": "He was later enraged to hear that Fujitora arrived at Mary Geoise when he had not yet claimed the heads of Luffy and Law. When Sengoku popped his head through the doorway and asked him if being fleet admiral was difficult, Sakazuki told Sengoku to shut up."}, {"type": "paragraph", "text": "After the Marines intercepted a communication between Big Mom and Kaido, Borsalino asked if he should go to handle the situation. Sakazuki told him to wait because they did not know the strength of Wano Country's forces."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Shichibukai system was abolished, Sakazuki spoke to Fujitora via Den Den Mushi and explained that the timing was bad due to the Pirate Alliance of the Big Mom and Beasts Pirates. Sakazuki later interrupted a meeting Sengoku was holding and said that the Marines were leaving Wano Country alone due to not having enough manpower to deal with both Big Mom and Kaido. Sakazuki and Sengoku then talked about Kozuki Oden."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Sakazuki vs. Squard", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Sakazuki's alias, \"Akainu\", means \"Red Dog\" in Japanese. His real name Sakazuki (盃) means \"sake cup\"."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The anime-only vice admiral Jonathan is said to be Sakazuki's protege, but unlike his mentor who is a pure believer in Absolute Justice, Jonathan believes more in Moral Justice."}, {"type": "paragraph", "text": "In the anime, the events of the Battle of Marineford after Whitebeard's death are touched upon showing massive explosions rocking Marineford, sending nearby pirates flying back. Large geysers of magma are shown showering the escaping New World Pirates. His efforts to pursue Luffy are consistently stalled by Marco deflecting all of his attacks and the Whitebeard Pirates forcing him back with a barrage of bullet and cannon fire, at which he comments is irritating."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Sakazuki has been a choice character in several series of merchandise. He has been featured in the Portrait of Pirates Figuarts Zero, One Piece DX Figure, One Piece High Spec Coloring Figure, Ichiban Kuji One Piece and Super Modeling Soul One Piece lines. But also in the World Collectable,One Piece Super Effect, One Piece Amazing Log Collection,Deformeister Petit One Piece,One Piece Super Deformed Figures, Anichara Heroes, One Piece Full Face Jr. and the One Piece Logbox series."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/POPNeoDX-Akainu.png/revision/latest/scale-to-width-down/180?cb=20150311022505", "caption": "Akainu in Portrait of Pirates."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise SP", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "J-Stars Victory Vs", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece: Pirate Warriors 4", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: World Seeker", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The way Sakazuki's character design is drawn resembles the famous late Japanese actor, Bunta Sugawara. Akainu's real name, Sakazuki, is apparently based on the three movies of Bunta Sugawara with \"Sakazuki\" in the title. Even Sakazuki's birthday is based on Sugawara's.", "elements": []}, {"text": "His nickname, along with the other admirals' (Aokiji, Akainu, and Kizaru), are taken from Momotaro legends (Momotaro met Pheasant, Dog, and Monkey as friends to accompany him in his journey).", "elements": []}, {"text": "According to an interview with Eiichiro Oda, Sakazuki is so strong that, if he were to become the protagonist, he could end the One Piece series within a year.", "elements": []}, {"text": "In the 5th fan poll, Sakazuki ranked 47th.", "elements": []}, {"text": "Before his full appearance was revealed, many non-canon sources had attempted to depict Sakazuki after the timeskip, which would later turn out to be highly inaccurate to his actual appearance in the manga. In these sources, his face is depicted as being totally intact, as well as having identical attire to the clothing he wore before the timeskip in non-canon sources, including One Piece Film: Z, Wake up!, Hard Knock Days and Super Grand Battle. In One Piece Film: Gold, Sakazuki is depicted with the scars on his face but he still wears his pre-timeskip clothing.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bc/Bunta_Sugawara.png/revision/latest/scale-to-width-down/150?cb=20130128002342", "caption": "Bunta Sugawara, the actor who Sakazuki was based on."}]}]}