{"sections": [{"title": "Borsalino", "level": 1, "content": [{"type": "paragraph", "text": "Borsalino, more commonly known by his alias Kizaru, is an admiral in the Marines. After Aokiji resigned from the Marines and Akainu was promoted to fleet admiral, Kizaru is now the only remaining admiral from the previous trio."}, {"type": "paragraph", "text": "He was first mentioned by Nico Robin during the Straw Hat's initial encounter with Aokiji. Because of his actions, Kizaru can be considered the secondary antagonist of the Sabaody Archipelago Arc and one of the major antagonists of the Marineford Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kizaru is an incredibly tall man, roughly the same size as the other two former admirals, Aokiji and Akainu. Kizaru is a middle aged man with a moderate amount of wrinkles on his face, black hair, and a very thin beard. He is older than the other two admirals, a fact that reflects on his looks. Among the admirals of the previous generation, he alone has the slimmest build among them."}, {"type": "paragraph", "text": "His standard outfit consists of a yellow striped suit with a Marine coat draped over his shoulders like a cape, his arms not in its sleeves. Kizaru also wears pure white shoes, gold-amber tinted sunglasses, and a dark green shirt with a mauve tie under his yellow suit. There is a tiny Black Den Den Mushi on his left wrist, like a wristwatch, underneath the sleeve of his suit. He is generally seen wearing a relaxed grin on his face."}, {"type": "paragraph", "text": "As a child he wore a large yellow striped hat, much like his older self's suit, a yellow vest and he still had his grin that he maintained throughout his life. In his early days as a Marine he wore a knit cap with the Marine emblem on it, sunglasses and also a normal Marine jacket with a striped undershirt."}, {"type": "paragraph", "text": "In his youth, he wore a Marine skull cap and he had no facial hair."}, {"type": "paragraph", "text": "Twenty-seven years before the start of the series, he wore a typical Marine cap and his beard was not as full as it is currently. He also lacked the gold amber-tinted sunglasses, shirt, and tie, which he was last seen wearing."}, {"type": "paragraph", "text": "When he was seen stationed at Marineford as a vice admiral thirteen years before the start of the series, he was sporting a large dark grey hat, dark gloves and had a cigarette in his mouth. His trademark pinstriped suit was light grey, matching his tie, while his thin beard was not yet present."}, {"type": "paragraph", "text": "For a time, his appearance after the timeskip in the anime deviated from that in the manga, as his character reappeared in the anime before being reintroduced in the manga, where he was given a different design that what Eiichiro Oda eventually decided to use for the manga. In One Piece Film: Z, he was shown wearing a different pinstripe suit, and instead of a collared shirt and tie, had on a viridian green turtleneck. The appearance he had here was also seen on his half-completed wax likeness made by Diego in Episode of Luffy and used for One Piece: Pirate Warriors 2 and One Piece: Unlimited World Red. This served as his acting post-timeskip appearance, until he made his first actual appearance after the timeskip in the manga in Chapter 802, which saw him in a pinstripe suit similar to the one shown for his anime appearances, but not entirely sharing the same design, nor was it the one he had worn before the timeskip. He also continued wearing a collared shirt and tie instead of a turtleneck."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kizaru comes off as a very laid-back, easygoing man who seems to take most things lightly no matter the severity of the situation. He talks in a calm voice suiting this demeanor, and in a sarcastically intonated, slow manner with the last syllable of a sentence often drawn out — usually the sentence-final particles \"ne\" (ね, \"ne\") or \"yo\" (よ, \"yo\") for emphatic effect. He is prone to beginning sentences with an \"ooh\", such as when observing something surprising or that piques his interest. Still, his register is quite formal (compared to Aokiji's more colloquial or Akainu's rougher, more derogatory speech patterns), using the polite \"desu\"/\"masu\" and taking care to address certain people with an honorific (such as his superior or even a pirate of high status)."}, {"type": "paragraph", "text": "With an ever-relaxed air in or out of combat, Kizaru is almost never shown losing his cool under stress, raising his voice, or getting excited to prompt action. With his Logia invulnerability, he can afford remaining apathetic to most enemy attempts to harm him, paying extremely sudden or surprisingly potent attacks little to no mind if they come from much weaker opposition; to the point of not visibly reacting at all when shot in the head."}, {"type": "paragraph", "text": "Such attitude of the admiral often lapses into outright absentmindedness, if not carelessness, that has him do things like repeatedly speak into a black Den Den Mushi meant not for talk but wiretapping (which had been explained to him multiple times) or politely asking fleeing pirates that just shot at him if they could help him find his acquaintance. He has also been shown irresponsibly using his strength with no regards for collateral damage, acting oblivious to the mass destruction that he threatens to bring on; this is seen when he felled a Yarukiman Mangrove on Sabaody on self-admitted accident, then simply brushed it aside. Additionally, Kizaru's casual attitude about whatever occurs around him may give way to the man leaving himself open to unsuspecting assault, such as watching his opponents unleash attacks without readying himself."}, {"type": "paragraph", "text": "Kizaru has been seen mid-battle remarking that it is \"scary\" or \"quite the shock\" when he encounters someone powerful, bold, or who unleashes a surprising move; however, he typically retains a nochalant face and tone, making him sound facetious. In fact, Kizaru has been shown acting fearlessly around the strongest of pirates — the likes of Silvers Rayleigh,Benn Beckman,Marco, or even Whitebeard, a Yonko. While acknowledging their strength, Kizaru has no issue with battling them one-on-one, and if they are getting in his way will try his best to get around them. Even after Shanks came to Marineford to end the war, Kizaru attempted one last attack on Monkey D. Luffy right after Beckman had held him at gunpoint to prevent him from so doing. Two years later, the admiral volunteered to personally go break up a potential meeting between the Yonko Big Mom and Kaido, which would entail going to the independent Wano Country that even Akainu is wary of."}, {"type": "paragraph", "text": "In battle, Kizaru can be condescending toward those he deems weak, mocking them or those associated with them. During the Marineford war, he would initially go out of his way to strike down Luffy, seeking to illustrate their gap in strength. He would go on to reproach Luffy for his inadequate strength, and taunted Whitebeard for rallying behind the weaker pirate."}, {"type": "paragraph", "text": "Not much a leader and preferring to follow orders, to the point of accepting ones from close subordinates, Kizaru has never been shown expressing sympathy for or against the philosophy of Absolute Justice, instead going by his own motto of \"Unclear Justice\" (どっちつかずの正義, Dotchitsukazu no Seigi). With no qualms about carrying out any given order, he has acted more callous than the highly moral-bound Aokiji and Fujitora, while not going out of his way to achieve justice to as thorough an extent as the extremist Akainu. He seems inclined toward missions that do not require significant work, as he went to deal with the issue on Sabaody due to believing it would be over quickly and became annoyed when Rayleigh interfered."}, {"type": "paragraph", "text": "He may shift objectives on a whimsical basis, shown when on Sabaody, he went from initially looking for Sentomaru, to follow the original goal of his mission, to then committing to an unrelated fight with four Supernovas, yet once defeating them simply disregarded their capture upon being given a new instruction. Regardless, Kizaru acts disdainful toward pirates on a default basis and will not show them mercy; for example, he sees the Shichibukai as no more than pirates and claims that a man like Rayleigh, despite having retired from piracy over 20 years earlier, could not have his crimes forgiven as a someone formerly of the Roger Pirates. After failing to capture Luffy on Sabaody, Kizaru instead went through with capturing 500 other pirates, showing that he may sway between either a more thorough or remissive execution of justice."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "Of all the admirals, Kizaru has displayed the most casual relationship with his fellow Marines, if not genuine leadership qualities, from how he mentioned in passing to the Giant Squad to watch out for attacks from the sky after everyone witnessed him being kicked down by Marco, as well as giving advice to shoot through the head after volunteering to help the troops subdue the recently awakened Little Oars Jr.."}, {"type": "paragraph", "text": "Kizaru's behavior is just as relaxed with his fellow admirals as it is with his subordinates."}, {"type": "paragraph", "text": "Sentomaru seems to have a high level of respect for him and calls Kizaru \"Uncle\" (黄猿のオジキ, Kizaru no ojiki, a Japanese word commonly used to refer to a yakuza family \"father\" boss), but he has also chastised Kizaru for his absent-mindedness."}, {"type": "paragraph", "text": "Kizaru had high respect and admiration for Zephyr, who trained him in his early years. Even when he turned rogue against the Marines, he still respected him. Despite Zephyr never respecting Kizaru in return, he enjoyed confronting him during battle. Despite his respect for Zephyr, Kizaru had no problems fighting or killing him during their recent encounters, stating that doing so would go against his duties."}], "images": []}, {"title": "Shichibukai", "level": 3, "content": [{"type": "paragraph", "text": "Even if the Shichibukai are on the World Government's side, Kizaru, like Smoker, Sengoku, and Fujitora, believes that the Shichibukai are nothing more than pirates and cannot be trusted. When Bartholomew Kuma came to Sabaody, Kizaru said \"This is why pirates cannot be trusted\"."}, {"type": "paragraph", "text": "Though being neutral to any absolutist ideology, Kizaru has shown little to no mercy to any kind of pirates, as seen when he tried to capture the long-retired Silvers Rayleigh, and when he interrupted his mission to fight Basil Hawkins. It is later revealed that, in his frustration over this loss, Kizaru rounded up 500 pirates and sent them to the notorious Impel Down prison. This was shown again during the battle of Marineford, where he was merciless against the Whitebeard Pirates and their allies. When the Impel Down prisoners arrived on the scene, Kizaru accepted Fleet Admiral Sengoku's request to execute every single one of them."}], "images": []}, {"title": "Bartholomew Kuma", "level": 4, "content": [{"type": "paragraph", "text": "He also remains suspicious of the Shichibukai, even Bartholomew Kuma, who is said to be the most loyal of the seven. Kuma stated that his pact and loyalties were with the World Government and, as such, he did not have any obligation to explain his motives to the Marines."}], "images": []}, {"title": "Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Kizaru was a major player of the Marines during the Battle of Marineford, causing large number of casualties for the Whitebeard Pirates and their allies from the New World, along with the intervening Impel Down prisoners. He initially went down to strike Whitebeard, but got intercepted and drawn into combat against 1st Division Commander Marco, whose strange Mythical Zoan regenerative capabilities largely negated Kizaru's Pika Pika no Mi, and forced the Admiral into a stalemate."}, {"type": "paragraph", "text": "When Whitebeard is critically injured by Admiral Akainu, the event is enough to allow Kizaru an opportunity to catch Marco off-guard, preventing his phoenix-based regeneration from kicking in fast enough to avoid injury. With the aid of Vice Admiral Onigumo, Kizaru manages to place a pair of seastone handcuffs onto Marco, nullifying his Devil Fruit powers."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "He targeted the Straw Hats, but he was forced to combat the \"Dark King\" Silvers Rayleigh, and he finally lost his prey when the Shichibukai Bartholomew Kuma teleported the pirates across the four corners of the world."}, {"type": "paragraph", "text": "Kizaru was also a major hindrance to Luffy's rescue attempts and at one point, mocked Luffy for not having the power to save Ace. He kept Luffy from his goal multiple times and even destroyed the original key to Ace's handcuffs. He is noticeably the most impressed Admiral when Luffy shows his Conqueror's Haki and the one who most enjoyed his fight with Luffy. Overall, Kizaru kept hounding Luffy while he was within his grasp, first at Sabaody Archipelago and then at the Whitebeard War, due to the demands made by the World Nobles."}], "images": []}, {"title": "Silvers Rayleigh", "level": 4, "content": [{"type": "paragraph", "text": "After the incident where Luffy punched a World Noble, Rayleigh fought Kizaru to prevent him from capturing the Straw Hats. He told him that if he were to get rid of his wanted poster, he could go into a peaceful retirement. Kizaru replied that Rayleigh's bounty cannot simply be forgotten, as being a pirate carries the crimes throughout the entire life, especially a Roger Pirate."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine admiral, Kizaru must have at least above-average leadership and co-ordination skills (in organizing large regiments of Marine soldiers easily and efficiently, as seen by his commands towards the \"Giant Squad\" to keep vigilance of the skies for incoming assault, as well as structuring \"Buster Call\" fleets). As an admiral, Kizaru has command over the many thousands of soldiers ranked lower than him, his status being second highest within the entire Marine organization, just below Fleet Admiral Sakazuki. He also has the power to initiate a Buster Call on any island he deems to be a threat, as well as grant lower ranking World Government agents such a privilege. As an admiral, he has the authority to revoke a Shichibukai's title."}, {"type": "paragraph", "text": "His presence at Sabaody Archipelago was enough to cause a panic on the island among the pirates and make the entire population flee from the island, including the Eleven Supernovas. He was able to defeat four of the Supernovas on Sabaody Archipelago with great ease, though arguably, a Pacifista aided him somewhat at the time. He was even able to fight Whitebeard, who was one of the four most powerful pirates ever known, single-handedly."}, {"type": "paragraph", "text": "Fitting his title of admiral, Kizaru is one of the most powerful fighters within the World Government and the Marines. Even as a vice admiral, Kizaru was already extremely strong, defeating Arlong quickly and effortlessly."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a Marine admiral, Kizaru is one of the strongest fighters within the World Government and Marines. He possesses immense physical strength, capable of holding down Whitebeard's massive bisento with just one foot, and is capable of fighting Rayleigh and Whitebeard equally despite their Haki abilities. Kizaru got struck by a \"Haki\"-wielding Marco, and sustained little damage from the physical blow. His power-scaling places him comparable to Akainu, who managed to deflect blows from Whitebeard with difficulty."}, {"type": "paragraph", "text": "He also has extremely acute hearing, being able to hear activity underwater before the Whitebeard War began. He possesses incredible physical durability, as shown when he was kicked to the ground by Marco without even receiving a scratch."}, {"type": "paragraph", "text": "The greatest aspect of Kizaru's physical abilities is his immense speed and extraordinary reflexes, which is further enhanced by the light based powers of the Pika Pika no Mi. This makes him immensely dangerous in speed combat. As shown in Marineford, he easily intercepted and overwhelmed Luffy's Gear Second enhanced speed, which could easily keep up with two Rokushiki masters, Blueno and Lucci, who are extremely skilled in Soru. In Film: Z, Kizaru easily matched his former mentor Zephyr in terms of speed and could swiftly counter and evade Zephyr's attacks while preventing himself from being restrained by his Sea Stone coated Smash Buster."}, {"type": "paragraph", "text": "Kizaru is also extremely proficient in kicking, which is enhanced by his Logia powers, allowing him to kick foes such as Hawkins and Luffy with devastating power. He could send Urouge crashing through buildings with a single light enhanced kick."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Kizaru possesses the power of the Pika Pika no Mi, a Logia-type Devil Fruit that grants him the powers of the element of light. As a Logia-user, he is able to let objects pass through him and reconstruct his body from energy particles. He is capable of moving and attacking at the speed of light, and all of his attacks are based on the element of light, such as firing energy blasts from his fingertips or feet with extreme accuracy and precision. His power is very destructive, causing huge explosions and can easily destroy buildings. He also has the ability to reflect himself, essentially moving from one location to the next at the speed of light. Due to this fruit's power, Kizaru is possibly the fastest man in the world."}, {"type": "paragraph", "text": "He also has great accuracy and precision in firing his laser beams of light, as shown when he shot and destroyed the key to Ace's shackles whilst it was still in Luffy's hands at a far distance."}, {"type": "paragraph", "text": "He can also make a powerful energy sword out of pure light named Ama no Murakumo, which can stand up to extremely powerful Haki-based attacks, as seen when he was fighting Silvers Rayleigh, who is an extremely powerful Busoushoku Haki user."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/77/Borsalino_Kicks_Luffy.png/revision/latest/scale-to-width-down/210?cb=20130914124547", "caption": "Kizaru's main style of combat involves kicking at the speed of light."}]}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Kizaru has shown extremely proficient skill in wielding his Ama no Murakumo light energy sword. He could duel Silvers Rayleigh, who is an immensely powerful swordsman, to a draw despite having his Logia intangibility negated by Rayleigh's Haki. In Film: Z, Kizaru could use his sword skills to fight on equal level with Zephyr, who is a very powerful hand to hand fighter equipped with the Battle Smasher, which is a powerful bionic arm embedded with Sea Stone which is especially effective in fighting Devil Fruit Users."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so with a rank above vice admiral, Kizaru can use that ability."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Borsalino possesses the ability to use Busoshoku Haki. He was seen using an advanced level of Busoshoku Haki to negate Whitebeard's attempt to destroy the execution platform, by creating, with his fellow admirals, a shield combination of their three Haki."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Borsalino possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Joining the Marines", "level": 4, "content": [{"type": "paragraph", "text": "At the age of 26, Borsalino joined the Marines alongside a 23 year old Sakazuki, and came under the tutelage of instructor Zephyr. The two were already considered \"monsters\"."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "A Storm in the Edd War", "level": 4, "content": [{"type": "paragraph", "text": "Not much is shown about Borsalino's past. He is briefly seen 27 years ago in the background when Garp and Sengoku were discussing how to deal with the Edd War battle between Gol D. Roger and Shiki. His position at that time is unknown, but it can be said that he was already among high rank officers, as he was wearing the Marines coat and his trademark yellow suit."}], "images": []}, {"title": "Fisher Tiger's Time", "level": 4, "content": [{"type": "paragraph", "text": "While the Sun Pirates were wreaking havoc on the seas, Strawberry reported to Vice Admiral Borsalino that Rear Admiral Kadar's ship had been sunk. Borsalino commented on how troublesome and scary the Sun Pirates were while acting calm as usual."}, {"type": "paragraph", "text": "After learning that the people of Foolshout Island sold out Fisher Tiger, Arlong went to that island to avenge him. Borsalino, who happened to be there, effortlessly defeated him. He then taunted Arlong and was surprised to hear that Fisher Tiger was dead, before saying that he was going to take him somewhere. He then brought Arlong to G-2 for interrogation."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Borsalino_Defeats_Arlong.png/revision/latest/scale-to-width-down/210?cb=20141206185546", "caption": "Borsalino detains Arlong."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kizaru was in Mary Geoise when Sengoku received a report of Monkey D. Luffy punching a World Noble on Sabaody Archipelago. He offered to go, saying he would not take long."}, {"type": "paragraph", "text": "Kizaru took a Marine battleship to Sabaody, and made landfall by riding on a shot cannonball. He unsuccessfully tried to call Sentomaru, and a pirate attempted to shoot him through the head. The bullet passed through Kizaru, and he came up to the pirates to ask them if they had seen Sentomaru. They ran away, and Kizaru shot a beam of light at them, creating an explosion that toppled an entire Yarukiman Mangrove. Still searching for Sentomaru, he then confronted Basil Hawkins. Hawkins did not know about Sentomaru, and Kizaru decided to take the time to attack him. Hawkins survived Kizaru's attacks by transferring the damage to straw dolls, and the two of them were interrupted when Urouge was sent crashing in by a Pacifista. Kizaru watched as X Drake and Urouge fought two of the Pacifistas, and when Urouge was left standing around, Kizaru came up to him and kicked him at light speed, sending him crashing through several buildings."}, {"type": "paragraph", "text": "Hawkins then turned into a giant straw man to attack Kizaru, but the admiral easily dealt with the pirate, who could still be damaged in his new form. Before he could finish Hawkins off, however, Kizaru was confronted by Scratchmen Apoo from a faraway rooftop. Apoo played \"Combat Music\" that cut off Kizaru's arm and made his body explode, but Kizaru quickly reformed his body. As Apoo was jumping from rooftop to rooftop, Kizaru quickly approached him by reflecting himself through mirrors and then kicked the Supernova down into a building, demolishing it. He then kicked Drake away in the blink of an eye before shooting Hawkins, but before he could attack Hawkins further, he received a call from Sentomaru, who told him to go after Luffy, Eustass Kid, and Trafalgar Law."}, {"type": "paragraph", "text": "Kizaru arrived at Grove 12, where he encountered the fleeing Roronoa Zoro, Usopp, and Brook and took out the fatigued Zoro with one blast. Before he could finish Zoro off, however, his kick was blocked by Silvers Rayleigh. Kizaru wondered what to do with the legendary pirate, and got insulted when the Straw Hats used Rayleigh's arrival to run away. He tried reflecting himself toward the Straw Hats, but Rayleigh stopped him with a sword. Kizaru created a sword out of light, and the two of them clashed. During the fight, Kizaru noticed in shock that Bartholomew Kuma had come to confront the Straw Hats, and watched as the Shichibukai teleported them away one by one. Kuma then went up to Rayleigh to tell him something in private, and Kizaru requested to know what he said, but Kuma refused to tell him. Kizaru remarked that Kuma's actions were troublesome as the pirate finished removing all of the Straw Hats from the island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Basil_Hawkins_Attacks_Borsalino.png/revision/latest/scale-to-width-down/210?cb=20130521022045", "caption": "Hawkins attacking Kizaru in his \"Goma no So\" transformation."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/41/Rayleigh_Stopping_Kizaru.png/revision/latest/scale-to-width-down/210?cb=20121130035002", "caption": "Kizaru clashes with Silvers Rayleigh."}]}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kizaru captured 500 pirates during his visit to Sabaody. With the date of Portgas D. Ace's execution drawing closer, the admiral arrived to lead the battle against the Whitebeard Pirates."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kizaru sat alongside his fellow admirals Aokiji and Akainu below Ace's execution platform as the Marines and Shichibukai prepared for war on Marineford. They watched as the Whitebeard Pirates arrived to save Ace, and Kizaru got a bad feeling before Whitebeard summoned two tsunamis with his Devil Fruit powers. The Marines and pirates then rushed into battle, and Kizaru attempted to shoot light beams at Whitebeard, but his attack was blocked by Marco. Kizaru shot beams at Marco as the pirate transformed into a phoenix and flew toward him, but Marco regenerated from the hits and the two clashed. Kizaru blasted Marco away with an explosion, and told the Giant Squad to be prepared for an aerial attack."}, {"type": "paragraph", "text": "Later, a group of Impel Down escapees led by Luffy landed in the bay, and Kizaru was surprised to see Luffy again so soon. He then asked Sengoku for permission to execute all the new arrivals, which was granted. When Luffy charged toward the plaza, Kizaru shot a beam at him, but the beam was intercepted by Emporio Ivankov, and Kizaru urged on his subordinates to go and capture Luffy. Later, he was seen attacking some of the Whitebeard Pirates before he kicked Luffy away when the pirate came charging in. Some of the Whitebeard Pirates came in to stall Kizaru for Luffy, and he watched as Whitebeard was betrayed by his subordinate Squard."}, {"type": "paragraph", "text": "Whitebeard recovered from Squard's attack and entered the fight, sending a shockwave at Ace's execution platform. However, Kizaru, Aokiji, and Akainu stopped it with their Haki. The Marines put up the encircling wall around the bay to trap the Whitebeard Pirates, but the fallen giant Little Oars Jr. blocked part of the wall and tried heading for Ace. Kizaru prepared to shoot Oars Jr. through the head, when Luffy suddenly flew over the wall and confronted the three admirals. Kizaru, Aokiji, and Akainu easily avoided Luffy's attacks with their Logia powers, and Luffy tried running past them with Gear Second, but Kizaru easily caught up to him and kicked him far away. Aokiji went to deal with Luffy, and Kizaru and Akainu watched as Oars Jr. brought the Whitebeard Pirates to the plaza and Whitebeard resumed his assault."}, {"type": "paragraph", "text": "Luffy tried mounting another charge toward Ace, but Kizaru shot him, saying he would need more than willpower to rescue Ace. He then kicked Luffy toward Whitebeard, and mocked Whitebeard's choice to rally behind someone like Luffy. He then avoided an attack from one of Whitebeard's crew members before shooting him. Whitebeard briefly struggled with the effects of his age, and Marco ran toward him, allowing Kizaru to catch the pirate off-guard and shoot him in the back.Onigumo then placed seastone handcuffs on Marco, and Kizaru shot the defenseless pirate twice more."}, {"type": "paragraph", "text": "Luffy managed to stop Ace's execution by knocking out the guards with Haoshoku Haki, and Kizaru was astounded by his power. Luffy got closer to the execution platform, and Kizaru tried to go to him, but he was stopped by Whitebeard. However, Kizaru shot Whitebeard through the chest before destroying Luffy's key to Ace's handcuffs with a beam of light. Although Luffy ultimately succeeded in rescuing Ace, the latter was killed by Akainu, and the Blackbeard Pirates arrived to kill Whitebeard and take his power. The Whitebeard Pirates and Impel Down escapees worked to save Luffy, and as Buggy tried bringing Luffy and Jinbe to Trafalgar Law's submarine, Kizaru shot through the pirate's collar. When Luffy and Jinbe made it onto Law's ship, Kizaru attempted to shoot them again, but was stopped as the Marine Koby pleaded for an end to the fighting. Kizaru tried to attack regardless, but was held at gunpoint by Benn Beckman as Shanks and the Red Hair Pirates arrived to end the war. When Law's submarine submerged and departed from Marineford, Kizaru went ahead with his attack and assaulted the bay with several beams of light, but unbeknownst to him, he did not hit the submarine. The battle then concluded as each faction went their own way."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Borsalino_vs._Marco.png/revision/latest/scale-to-width-down/210?cb=20130315154132", "caption": "Kizaru battles Marco."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Borsalino_Attacks_Marco.png/revision/latest/scale-to-width-down/210?cb=20130308091807", "caption": "Kizaru shoots an off-guard Marco."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Borsalino_Attacks_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20160212193508", "caption": "Kizaru attacks Whitebeard."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "One Piece Film: Z", "level": 4, "content": [{"type": "paragraph", "text": "Two years later, when the Neo Marines attacked Firs Island to steal the Dyna Stones, Kizaru arrived to defend the island's Marine Base. He began attacking the ships and the Neo Marines trying to escape when the former admiral and instructor, Z, joined the battle and deflected his attacks, giving the needed time for his subordinates to escape. Kizaru asked why he was there, to which Z told him that he relied too much on his Devil Fruit abilities. Kizaru simply replied that he was still hard like a rock and formed a light sword to battle with."}, {"type": "paragraph", "text": "The two had a fierce clash, with Z telling him that he became cocky since becoming an admiral. Kizaru told him he did not come to dwell on the past, firing a finger beam at him. Z blocked the blast and charged at him, overwhelming the admiral in a great explosion. Kizaru reformed behind him and attacked, with Z blocking his attack with his great mechanical limb. Kizaru told him that he could not match his speed with that heavy weapon, and then asked what he wanted the Dyna Stones for. Z told him that he could never get along with him while charging him. Kizaru effortlessly dodged and kindly asked for him to give back the Dyna Stones. Z then grabbed a Dyna Stone that had been dropped and crushed it. Terrified, Kizaru tried to flee the incoming blast but Z hurled it at his face as soon as he reformed. The blast engulfed the entire island, destroying the Marine Base."}, {"type": "paragraph", "text": "Kizaru managed to survive and he later joined the summit about the return of \"Black Arm\" Z, where Sakazuki and the others were briefed on the destruction of the Marine Base and theft of the Dyna Stones. Kizaru chimed in that there was no way Z survived the explosion. Tsuru responded that Z was still alive, because he was too stubborn to die. Sakazuki lamented on their former teacher turning on them, but ordered Kizaru and six present vice admirals to kill their former instructor."}, {"type": "paragraph", "text": "While the final battle between the Straw Hat Pirates and the Neo Marines progressed, Kizaru and his fleet landed on Piriodo and when the fight ended, he appeared to capture both Z and Luffy's crew. Z then went alone to fight against the whole Marine fleet, letting his comrades and the Straw Hat Pirates escape. During Zephyr's last stand, Kizaru said goodbye to his former teacher and shot a full Yasakani no Magatama against him, leaving him seriously injured. However, Z yet did not fall and continued to fight. Z later died, but it is unknown if by Kizaru's attacks."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Borsalino_vs._Zephyr.png/revision/latest/scale-to-width-down/210?cb=20140722070942", "caption": "Kizaru battles Z"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Borsalino_Prepares_to_Attack_Zephyr.png/revision/latest/scale-to-width-down/210?cb=20131018232058", "caption": "Kizaru about to use Yasakani no Magatama against Z."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kizaru was at Marine Headquarters when he received a report of the Shichibukai Edward Weevil attacking another one of Whitebeard's former subordinate crews and destroying the surrounding area. He remarked that Weevil's strength resembled Whitebeard's regardless of whether or not the Shichibukai is indeed the son of the late Yonko."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Marines intercepted a communication between Big Mom and Kaido, Kizaru asked if he should go to handle the situation. Sakazuki told him to wait since they did not know the strength of the forces at Wano Country."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Borsalino vs. Arlong", "elements": []}, {"text": "Borsalino and a Pacifista vs. Basil Hawkins, Urouge, X Drake, and Scratchmen Apoo", "elements": []}, {"text": "Borsalino vs. Roronoa Zoro", "elements": []}, {"text": "Borsalino vs. Silvers Rayleigh", "elements": []}, {"text": "Marines and Shichibukai vs. Whitebeard Pirates and allies", "elements": [{"text": "Borsalino vs. Marco", "elements": []}, {"text": "Borsalino vs. Monkey D. Luffy", "elements": []}, {"text": "Borsalino vs. Namur, Kingdew, Izo, Fossa, and Speed Jiru", "elements": []}, {"text": "Borsalino, Kuzan, and Sakazuki vs. Monkey D. Luffy", "elements": []}, {"text": "Borsalino vs. Rakuyo", "elements": []}, {"text": "Borsalino and Onigumo vs. Marco", "elements": []}, {"text": "Borsalino vs. Edward Newgate", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Borsalino vs. Z (on Firs Island)", "elements": []}, {"text": "Borsalino vs. Z (on Piriodo)", "elements": []}]}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "list", "elements": [{"text": "Kizaru is shown during the One Piece Premier Show 2012 as an admiral of the Marines.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Borsalino_in_One_Piece_Premier_Show_2012.png/revision/latest/scale-to-width-down/180?cb=20130128003243", "caption": "Kizaru as he appears in the show."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Pirate Warriors 4", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The model of Kizaru's face is the Japanese actor, Kunie Tanaka. Along with that, Kizaru's clothes, real name, Borsalino, and birthday, are apparently based on a movie character that Kunie Tanaka played in his youth. The character Borsalino from the old Japanese film Truck Yarō (トラック野郎), wore a suit and sunglasses similar to Kizaru's design.", "elements": []}, {"text": "When first mentioned by Robin, Kizaru's silhouette was seen wearing an unusual deerstalker hat, which he wore during his time as a vice admiral. It is likely a reference to the Italian hat company Borsalino, from which Kizaru's real name is apparently derived.", "elements": []}, {"text": "Kizaru's lazy and easy-going demeanor is something of a reference to the main characters' approach to crime from the 1970s French film Borsalino.", "elements": []}, {"text": "His epithet, along with the other admirals' (Aokiji, Akainu, and Kizaru), are taken from Momotaro legends (Momotaro met Pheasant, Dog, and Monkey as friends to accompany him on his journey).", "elements": []}, {"text": "Kizaru's techniques, Yata no Kagami (八咫鏡), Ama no Murakumo (天叢雲劍) and Yasakani no Magatama (八尺瓊曲玉) are taken from the Three Sacred Treasures of Japan.", "elements": []}, {"text": "In the 6th Japanese Fan Poll, Kizaru ranked 77th.", "elements": []}, {"text": "When he appeared on the Sabaody Archipelago, he was riding on a cannonball, which could be a reference to the fictional character Baron Münchhausen's tall tale of riding on one.", "elements": []}, {"text": "Similarly to Akainu, Kizaru was also depicted in non-canon sources with a post-timeskip appearance that later proved inaccurate to his actual appearance, including Episode of Luffy, One Piece Film: Z, One Piece: Pirate Warriors 2, One Piece: Unlimited World Red and One Piece: Pirate Warriors 3. In these sources, Kizaru is seen wearing a turtleneck under his suit rather than his usual shirt and tie, which he continued wearing after the timeskip in the manga. However, unlike with Sakazuki, this design came from a sketch drawn by Oda for the movie.", "elements": []}, {"text": "Borsalino's favorite foods are miso ramen, ginger, and bananas.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Kunie_Tanaka.png/revision/latest/scale-to-width-down/150?cb=20130307122911", "caption": "Kunie Tanaka."}]}]}