{"sections": [{"title": "Tsuru", "level": 1, "content": [{"type": "paragraph", "text": "\"Great Staff Officer\" Tsuru is a veteran Marine Vice Admiral and an old associate of fomer Fleet Admiral Sengoku and fellow Vice Admiral Monkey D. Garp."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tsuru is a tall, thin, and elderly woman with gray hair tied in a bun. Her attire appears to be less formal than the other high-ranking officers', consisting of an untucked shirt, with the sleeves rolled up and a tie around her neck, and calves-long pants, which makes her somewhat resemble the animal of her name, the crane. She sports earrings made of beads, and wears two bracelets on her right wrist. The epaulets on her Marine coat are purple. During the time of the Battle of Edd War, they were the standard blue."}, {"type": "paragraph", "text": "Twenty-seven years ago at age 49, her skin was already wrinkled despite only being middle-aged."}, {"type": "paragraph", "text": "In her youth, she was quite beautiful and had dark blue hair tied up in a loose ponytail, with sidebangs that framed both sides of her face. She wore a standard Marine uniform with a rifle strapped to her back."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She is a veteran Marine who is not without wisdom for her age. She seems extremely knowledgeable; she knew who set the Marines to fight each other in the Marine and Shichibukai meeting when all others thought the two were simply messing around, and knew who Laffitte was on sight. She is not above telling off the younger marines that show concern for her well being when she steps up to fight the incoming pirates at Marine HQ. She then justifies herself being on the front line with the other vice admirals by stating there is no longer a safe place left in the world for her to run to anyway. According to Garp, she is an empathetic woman although she does not show this disposition very often."}, {"type": "paragraph", "text": "Tsuru follows \"Clean Justice\". This motto was first seen in the Adventure of Nebulandia special, and was confirmed to be canon in Vivre Card - One Piece Visual Dictionary."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Gion", "level": 4, "content": [{"type": "paragraph", "text": "Tsuru and Gion have a close relationship due to Tsuru treating Gion as if she is her little sister."}], "images": []}, {"title": "Sengoku", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku appears to be well-acquainted with Vice-Admiral Tsuru as well. 13 years ago, in the North Blue, she worked under Sengoku's orders to stop the Donquixote Pirates. Despite being outranked by him, Tsuru still had no problem calling him a fool for providing her wrong intel."}, {"type": "paragraph", "text": "Nowadays, Tsuru appears to be annoyed with Sengoku's new cheerful disposition and lack of responsibility."}], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Tsuru is well acquainted with Garp, having known him for a long time. Before the Battle of Marineford occurred, she told him that he had done nothing wrong about Ace, which Garp replied with laughter, saying that she was supposed to be sympathetic towards him during this situation."}, {"type": "paragraph", "text": "Garp and Sengoku are the only ones that call her Tsuru-chan while the others call her either Vice Admiral Tsuru or Tsuru-san."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Tsuru has a history with the Donquixote Pirates, having pursued them on numerous occasions before the crew's captain, Donquixote Doflamingo, became a Shichibukai. After Doflamingo and his crew were defeated and arrested, Tsuru looked after Doflamingo until they arrived at Impel Down. After they arrived at Impel Down, Tsuru denied Doflamingo's request for newspapers."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine Vice Admiral and being a part of the same generation of prominent Marines as Garp and Sengoku, Tsuru is possibly one of the most powerful Marines in the series. Even in her elderly age of 63, Tsuru was strong enough to strike intense fear into Doflamingo who is an extremely powerful pirate before he became a Shichibukai, as he was quick to flee during her many pursuits of the Donquixote Pirates throughout the North Blue, and despite his initial plans to reclaim Law from the Marines's custody to use his powers to immortalized himself, Doflamingo quickly changed his plans upon seeing her battleship off the coast of Minion Island. Several years later, when Doflamingo lost his title as a Shichibukai, he still showed respect for her, a stark contrast to his usual disrespect to other high ranking Marines."}, {"type": "paragraph", "text": "Alongside Sengoku and Issho, she was part of Doflamingo's Marine escort who fought against Jack, a right-hand man of the Yonko Kaido."}], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Tsuru is exceptionally well-versed in military strategies. She is a master tactician with extraordinary wisdom and could instantly formulate new plans right on the spot, earning her the nickname \"Great Staff\"."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Tsuru possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "Weapon", "level": 3, "content": [{"type": "paragraph", "text": "In her youth, she is seen with a flintlock rifle. How proficient she is in using it is unknown."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Tsuru ate the Woshu Woshu no Mi, a Paramecia-class Devil Fruit that allows her to literally \"wash and hang out to dry\" people and objects as if they were clothes, turning them into flat and malleable like clothes. This disables the opponents by rendering them unable to move. This can also \"clean\" a limited amount of evil off the victims, which is considered a dangerous ability against pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4c/Woshu_Woshu_no_Mi_Infobox.png/revision/latest/scale-to-width-down/250?cb=20121228203008", "caption": "Tsuru's Devil Fruit's laundry power."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Tsuru joined the Marines 56 years ago along with Sengoku and Garp. 27 years ago, Tsuru was seen walking with fellow vice admirals Monkey D. Garp, Jaguar D. Saul, Kuzan, and Sakazuki. Garp asked her if he could borrow a ship, but she refused because he always broke them."}, {"type": "paragraph", "text": "Thirteen years ago, Tsuru was stationed in the North Blue, where she continuously pursued the Donquixote Pirates at the time. Doflamingo noted that her chases stopped after Rosinante left the crew, which led Doflamingo to suspect that his younger brother was giving away his crew's location to the Marines."}, {"type": "paragraph", "text": "Three days before the scheduled exchange between the Marines and Diez Barrels for the Ope Ope no Mi, she was stationed at Swallow Island following Rosinante's intel that Doflamingo and his crew would be there, unaware that they actually had gone to Minion Island instead. She was then contacted and informed by the Marines scouting Minion Island about the fire at Barrels' hideout and ordered them to investigate the coast while avoiding being spotted. As Doflamingo and his crew were leaving the island, Tsuru's ship fired at them, forcing them to flee."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/77/Tsuru_Chases_Donquixote_Pirates.png/revision/latest/scale-to-width-down/180?cb=20150820163708", "caption": "Tsuru's battleship in pursuit of the Donquixote Pirates."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Tsuru was present for the meeting at Mary Geoise to choose a replacement for Crocodile. As Doflamingo was forcing Marine officers to fight each other, Tsuru told him to stop."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Tsuru was present at Marineford in preparation for war against Whitebeard. Tsuru said some comforting words to Garp concerning the upcoming execution of Portgas D. Ace but he replied with laughter, stating that she should be shown sympathy rather than comforting him. Upon Whitebeard's arrival, she commented on the illogicality of his position and joined the other vice admirals when his division commanders began their attack. Although Vice Admiral Yamakaji expressed concern for her safety, Tsuru stayed on the front lines, stating that there was no safe place to hide."}, {"type": "paragraph", "text": "She was next seen observing that Little Oars Jr. was bigger than any giant. She was then seen receiving Sengoku's order to prepare for the next part of the Marines' plan after having dealt with several pirates using her powers."}, {"type": "paragraph", "text": "She later went to the plaza when Sengoku started to execute the final stage of his plan. After Shanks' arrival and call for a ceasefire, she was seen standing down along with the other Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Garp_and_Tsuru.png/revision/latest/scale-to-width-down/250?cb=20130302134949", "caption": "Tsuru with Garp at Marineford."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Z", "level": 4, "content": [{"type": "paragraph", "text": "After the destruction of Firs Island, Tsuru attended a meeting with other Marine officers to discuss the threat of Z. After Borsalino acquainted Sakazuki of Z's return, Tsuru reiterated the present about Z's former rank and his strength."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Donquixote Pirates were defeated, Tsuru sailed along with Sengoku. After a conversation concerning Doflamingo's crew, Sengoku offered Tsuru some okaki."}, {"type": "paragraph", "text": "Three days after Doflamingo's downfall, Tsuru and Sengoku arrived at Dressrosa and met up with Admiral Fujitora. Tsuru asked Fujitora why he did not capture Luffy and Law. The Admiral explained that he made his decision based on the roll of a dice and that the pirates had been lucky for two days in a row. Fujitora then gave Tsuru his dice and declared that if it rolled on any number other than one, he would go after the pirates himself."}, {"type": "paragraph", "text": "After Luffy and his group escaped, the Marines left Dressrosa while escorting Doflamingo. While guarding Doflamingo's cell, Tsuru reminded Doflamingo of the reality that he lost and then listened to his comment about how the war for the title of Pirate King will begin. Later, the Marine convoy came under attack by Jack of the Beasts Pirates, who sought to rescue Doflamingo. Two of the Marines' four ships were sunk but they managed to defeat him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/Doflamingo_being_taken_to_Impel_Down.png/revision/latest/scale-to-width-down/210?cb=20160620184631", "caption": "Tsuru speaks to the imprisoned Doflamingo."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In her first appearance in the anime, she does not say anything. In the manga, she talks to Donquixote Doflamingo, ordering him to be a good boy and calm down."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tsuru's crew vs. Donquixote Pirates (at least once)", "elements": []}, {"text": "Marines and Shichibukai vs. Whitebeard Pirates and Allies.", "elements": []}, {"text": "Doflamingo's Marine escort vs. Jack (not shown)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Eiichiro Oda has stated that he tends to name female characters after birds. This tradition continues with Tsuru, whose name means \"crane\". Her name can also be translated as \"to hang\", depicting her ability.", "elements": []}]}, {"type": "list", "elements": [{"text": "She is currently the highest ranked female Marine along with Gion.", "elements": []}, {"text": "In the 4Kids dub, Tsuru's rank of vice admiral (中将, Chūjō) title has been translated as her surname.", "elements": []}, {"text": "Interestingly, Tsuru commanded a crew that consisted entirely of female Marines.", "elements": []}, {"text": "When Tsuru and Sengoku were mentioned by Bartolomeo, they were shown in the latter's imagination, hardly resembling their real appearance at all.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Bartolomeo%27s_Imagination_of_Sengoku_and_Tsuru.png/revision/latest/scale-to-width-down/150?cb=20161221125616", "caption": "Tsuru (on the right) and Sengoku in Bartolomeo's imagination."}]}]}