{"sections": [{"title": "Comil", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Comil is the commander of Marine Base G-2. He first appeared in Portgas D. Ace's cover story, and later took part in the Battle of Marineford."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Comil is a tall, large man with a bald top, but blonde spiky hair flowing downwards on the back of his head, similar to Shiki. He has a mustache and is dark-skinned. His mustache looks like what one usually gets after drinking milk."}, {"type": "paragraph", "text": "He dresses in the typical garb of many high-ranking Marines: he sports a red, double-breasted suit over a dark-green shirt with a plain green tie, and also has a Marine coat draped over his shoulders like a cape."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Comil seems to be a believer of Moral Justice as he let Portgas D. Ace escape after he saved one of his men and some important sheets from a burning ship. He cares deeply for his subordinates, assisting the one Ace saved from the fire as soon as he could. He also seems to enjoy the little things, smiling happily after Moda sent him some milk to make the coffee served in his base taste better (which he, along with the base's personnel, hated)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Comil is capable of commanding a Buster Call alongside four other vice admirals. As the commander of the G-2 Marine base, he possesses authority over the lower-ranking subordinates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is seen carrying a pair of katanas, attached to his right hip, in a similar fashion to Zoro or ancient samurais."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Comil can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Ace's Great Blackbeard Search", "level": 3, "content": [{"type": "paragraph", "text": "Comil's administrative meetings were plagued by bitter coffee, as Ace witnessed firsthand when he infiltrated the base posing as a Marine officer. Though Ace's cover was blown, he ended up saving the day by reuniting the milk-maiden Moda with her parents on the base's grocery ship. This ensured a steady supply of milk to G-2, as well as pleasant meetings with good tasting coffee for the vice admiral."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Comil answered the summoning of the Marines to reinforce Marineford."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was seen holding two katanas on his right hip. Later, he was seen with his fellow vice admirals lined up and ready to fight the Whitebeard Pirates."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Marines and Shichibukai vs. Whitebeard Pirates and Allies", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is a Japanese term for coffee (コーヒー kōhī) with milk (ミルク miruku). Ace's Great Blackbeard Search's secondary plot was about him, the bitter-tasting coffee, and adding milk to make it taste better.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 59), His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 31 Chapter 289, cover story: Ace's Great Blackbeard Search Vol. 15, Comil makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 524 (p. 16) and Episode 421, Comil is seen gathering alongside his fellow Marines.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 7) and Episode 511, a doctor states that all the vice admirals can use Haki.", "elements": []}]}], "images": []}]}