{"sections": [{"title": "Jaguar D. Saul", "level": 1, "content": [{"type": "paragraph", "text": "Jaguar D. Saul was a giant and a former Vice Admiral who first appeared as a castaway on the island of Ohara."}, {"type": "paragraph", "text": "He was introduced in Nico Robin's flashback during the Enies Lobby Arc, and by then he had already defected from the Marines."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As a giant, Saul was many times larger than a human. He had long, orange hair and a big beard that seems to connect around his entire face, which somewhat resembled a lion's mane."}, {"type": "paragraph", "text": "During his time as a vice admiral, Saul wore a Marine coat like all other higher-ranking Marines. However, after his defection, he discarded it. When he crash-landed on Ohara, he was wearing a black shirt and gray jeans that were a little tattered. Also, as a Marine, he had worn the Marine cap, but upon his defection he exchanged it for a cowboy's hat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Saul was a big and friendly giant who was somewhat shy and timid. While he was loyal to the Marines, he questioned their orders at least twice, which shows that he followed Moral Justice over their code of Absolute Justice. In the end, it was this moral judgment that led him to betraying them, as Saul could not see why the Marines would need to slaughter an entire clan of mere archaeologists, who had no fighting chance against them. He also justified his choice of defending Robin after seeing a former colleague destroy an entire ship of innocent citizens, who held no related crimes to the incident at hand."}, {"type": "paragraph", "text": "He saw the giants of Elbaf to be somewhat barbaric, and did not follow their traditions of fighting to the death."}, {"type": "paragraph", "text": "Saul was also characterized as having a unique, but awkward laugh (Dereshishishishi). He enjoyed seeing others laugh and have fun, as shown when he encouraged Robin to laugh. Like other \"D's\" before him, he was seen laughing before his apparent death."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/05/Saul%27s_Laugh.png/revision/latest/scale-to-width-down/210?cb=20130725061401", "caption": "Saul's unusual method of laughing."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Nico Robin", "level": 3, "content": [{"type": "paragraph", "text": "He was one of the three people who influenced Nico Robin. Saul was the first person to have befriended Robin (besides Ohara's archaeologists) after she found him washed up on Ohara's shore. Afterwards, Robin visited and brought food for him for several days while he built a raft to leave the island. One day, he taught and encouraged Robin to laugh whenever she was sad, even if it hurt. Seconds before his death, Saul told Robin that she would find friends that will protect her and live with her someday. As Robin left the island, she mourns for his death, along with the destruction of her home and the death of her mother."}, {"type": "paragraph", "text": "Saul's relationship with Robin explained how she knows about the Will of D.. After saving Luffy from being buried under quicksand, she questioned him about why those who have the Will of D. fight, although Luffy had no idea what she was talking about."}], "images": []}, {"title": "Kuzan", "level": 3, "content": [{"type": "paragraph", "text": "Saul and Vice Admiral Kuzan (later known as Admiral Aokiji) also had a good friendship. They also shared the same sight on Moral Justice. Despite this, their friendship was not enough to spare Saul, though the reason Kuzan allowed Robin to live was mostly a final favor to Saul."}], "images": []}, {"title": "Nico Olvia", "level": 3, "content": [{"type": "paragraph", "text": "Saul initially had a hostile interaction with Nico Olvia. She berated him for murdering her colleagues and blindly complying with the World Government's policies without knowledge of the entire situation. Saul realized she was correct and it lead him to question his senior officer about the prohibition on Poneglyphs. The lack of answers prompted him to question Olvia about her work and in disdain for the World Government's cruelty defected by releasing her. Olvia warned him that he could never return to the Marines due to his treason. Saul responded by stating he was following his own ethics and wished her luck on her return to Ohara. Olvia finally trusted him by requesting Saul to protect her daughter and evacuate her from Ohara. Saul told Robin to be proud of her mother and the other archaeologists for their defiance of the World Government."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a former Marine vice admiral, Saul had command over lower-ranking subordinates, as well as lead a Buster Call ship. His defection cost him this power."}, {"type": "paragraph", "text": "Being a giant, he possessed almost unbeatable strength, which was, in fact, greater than that of most giants. He could easily lift a Buster Call ship up out of the water to slam it back down and destroy it (a Buster Call ship's size was several times the size of a giant at the time)."}, {"type": "paragraph", "text": "He had experienced the Grand Line and had seen Devil Fruit users. He even states that he was somewhat jealous of their incredible abilities."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Jaguar_D._Saul%27s_Strength.png/revision/latest/scale-to-width-down/210?cb=20171109162802", "caption": "Saul lifting a Marine battleship at Ohara."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Saul could also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Early History", "level": 3, "content": [{"type": "paragraph", "text": "Saul is a giant, but not an Elbaf giant, as he was born somewhere in the South Blue."}, {"type": "paragraph", "text": "At some point in his life, he became a Marine and eventually made it to the rank of vice admiral. Before the storyline, Saul had traveled in the Grand Line, though nothing was said of his adventures other than the fact that he met many Devil Fruit users."}], "images": []}, {"title": "A Storm in the Edd War", "level": 3, "content": [{"type": "paragraph", "text": "When the Marines learned that the Roger Pirates and the Golden Lion Pirates were about to battle in the Edd War, three years before the death of the Pirate King, Saul was seen in the Marineford, walking with Garp, Kuzan, Sakazuki and Tsuru, listening to the conversation about the Hero of the Marines' efforts to arrest Gold Roger."}], "images": []}, {"title": "Ohara Incident", "level": 3, "content": [{"type": "paragraph", "text": "While on duty, Saul's vessel encountered a wanted ship run by the archaeologists of Ohara, who left West Blue to locate and decipher the mysterious poneglyphs that bear an ancient, forgotten history that was forbidden to be studied. Despite ordering his men to take the archaeologists alive, Saul's crew slaughtered all but one; Nico Olvia, the mother of future Straw Hat Pirates' member Nico Robin."}, {"type": "paragraph", "text": "After Olvia's capture, Saul was informed by Sengoku that he would be one of the five chosen vice admirals to lead a Buster Call against Ohara for its crimes of deciphering the poneglyphs. Rejecting the study of history as a justification for the order, Saul would begin to doubt the naval doctrine of \"Absolute Justice\". After interrogating Olvia, Saul grew disgusted with the military's brutal intentions and defected against the World Government by releasing her."}, {"type": "paragraph", "text": "Shortly thereafter, he was shipwrecked in a storm, then sent adrift in the ocean until fatefully landing on Ohara itself. There, he met and, at first unknowingly, befriended Nico Robin and was reunited with Nico Olvia. After promising Olvia that he would ensure Robin's safety, Saul was confronted by Vice Admiral Kuzan as he was destroying the Buster Call ships. As he was being frozen, Saul smiled and laughed, cryptically echoing the way Gol D. Roger was executed two years prior."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Jaguar_D._Saul_Meets_Nico_Olvia.png/revision/latest/scale-to-width-down/210?cb=20100613085348", "caption": "Saul meets the archeologist Nico Olvia."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jaguar D. Saul vs. Buster Call battleships", "elements": []}, {"text": "Jaguar D. Saul vs. Vice Admiral Kuzan", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He is so far the only known giant to bear the initial D. although he said everyone in his family also has the initial D. so that means that there were/are other giants with the initial D.", "elements": [{"text": "He is also the only known character with the initial D. who is not a human.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 392 and Episode 275, Jaguar D. Saul debuts.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0427), Information about Saul is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 135), Saul's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 396 (p. 13-15) and Episode 277.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 396 (p. 8) and Episode 277.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 396 (p. 16) and Episode 277.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 and Episode 511, Dr. Fishbonen states Haki is a power all the vice admirals use.", "elements": []}]}], "images": []}]}