{"sections": [{"title": "Morgan", "level": 1, "content": [{"type": "paragraph", "text": "\"Axe-Hand Morgan\" is a former Marine captain and the first Marine officer of significant rank to be seen in the series. He is the third antagonist of the Romance Dawn Arc. After his defeat at the hands of Zoro, he was stripped of his status that he had been abusing for three years."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Morgan is a very tall and muscular, intimidating man with blonde hair (white-blonde in the anime) and a steel jaw. As his epithet suggests, his right hand is replaced by a huge steel axe, the handle of which seems to go right through his forearm. Like most marines of high rank in the series, he wears a large, billowing coat like a cape. His coat however does not have \"Justice\" on the back. He can also normally be seen smoking a cigar."}, {"type": "paragraph", "text": "After he was arrested, he was put into prisoner clothes, which consisted of a white and blue striped long sleeve shirt and matching striped pants. He also had chains around his hands and legs. Five years ago, Morgan looked much like he does in the present storyline, except without the axe hand and the metal jaw. He had a slimmer build than he does in the present storyline, and his hair is seen being slightly longer than it is at this point of the story."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Prior to \"capturing\" Kuro, Morgan seemed to be a brave man who was not afraid of death. After his promotion, Morgan was corrupted by his power and became who he is today."}, {"type": "paragraph", "text": "When Morgan is first introduced, he is governing over the small island of Shells Town, where his naval base is located. He is a cruel man who did little but spread terror on the town's citizens. He is ruling by fear, abusing his rank to make people pay taxes, and even going as far as killing his own men if they do not obey his commands."}, {"type": "paragraph", "text": "He has a very spoiled son named Helmeppo, who is almost as bad at using his father's rank to get what he wants from the island's inhabitants. Although Helmeppo thought that he could get away with whatever he does because his father would protect him, in truth Morgan shows not even the slightest of fatherly love for Helmeppo. Morgan's lack of love goes as far as stating that before he punched Helmeppo, he never hit him because he's a foolish son not even worth hitting."}, {"type": "paragraph", "text": "Morgan's obsession with rank is proven in his battle against Luffy, where, despite not being able to land a single blow on the rubber man (and having taken several), he would not accept defeat."}, {"type": "paragraph", "text": "After his defeat, dismissal, and escape from arrest, Morgan became rather carefree, as he was napping nonchalantly on his boat as it sailed through the sea."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine captain, Morgan had command over lower-ranking subordinates and citizens. However, he heavily abused this authority to get whatever he desired. He was eventually stripped of his rank and authority after he was easily beaten by Luffy and Zoro."}, {"type": "paragraph", "text": "Morgan is quite strong, being able to carry around his large axe hand all the time with ease. He was also durable, as he is the sole survivor of Kuro's wrath five years ago, although the reason for his survival was later revealed to be a plot planned by Kuro. He also has knowledge of Devil Fruits despite their rarity in the East Blue, and saw through Monkey D. Luffy's rubbery body as a result."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In battle, Morgan has a massive axe installed in place of his right arm, which was strong enough to slash through an entire fence with one swing through a shock wave and create a small fissure in the ground."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Five years ago, when Morgan was still a mere chief petty officer, he and his crew attacked the Black Cat Pirates one night, only to incur the wrath of their captain, Kuro. Morgan was the only survivor on board of his ship, which left him with a broken jaw and the loss of his arm. Refusing to beg for his life, Morgan challenged Kuro to bring him death. However, Morgan surviving the pirate's deadly claws was deemed impressive, and Kuro used Morgan as part of his plan to escape the pirate life. Morgan was hypnotized by Jango into believing that he had captured Kuro (actually a lookalike pirate), gaining him immediate fame, the rank of lieutenant commander and possibly setting him on the path to his current obsession with rank and power. While Kuro's assault broke his jaw, causing him to get his brace, it's unclear how or when he got his trademark axe hand."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/ff/Kuro_Breaks_Morgan%27s_Jaw.png/revision/latest/scale-to-width-down/210?cb=20130125192524", "caption": "Morgan is defeated by Kuro"}]}, {"title": "Romance Dawn Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was left in charge of a Marine base on an island. As a high ranking and famous Marine, none dared challenge his authority, not even his own men as he had a habit of punishing those who disobeyed him (even killing his own men)."}, {"type": "paragraph", "text": "This all changes however when Luffy comes to town to help Koby fulfill his dream, and possibly recruit Roronoa Zoro into his crew. After Luffy accidentally breaks a newly finished statue of Morgan, the captain immediately sets after him, (considering that he was about to have one of his men killed for just scratching the statue, this is rather humorous as it occurs just as he was about to do the deed) confronting Luffy in the courtyard of the Marine base. Morgan is defeated by Luffy without even landing a single blow, though he is finished off by Zoro as Luffy has to deal with Helmeppo holding Koby hostage."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/db/Luffy_vs._Morgan.png/revision/latest/scale-to-width-down/210?cb=20130126073717", "caption": "Axe-Hand Morgan preparing to combat Luffy and Zoro."}]}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "Upon the issuance of Luffy's 30,000,000 bounty, one of the Marines that guarded his cell returned with the pirate's bounty poster in hand. The Marine then snickered and showed Morgan the poster, to which Morgan became agitated."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Diary of Koby-Meppo", "level": 3, "content": [{"type": "paragraph", "text": "Morgan was later seen in the series in a chapter title page mini-story, as a prisoner stripped of rank on Vice-Admiral Garp's ship, where both Koby and Helmeppo also happen to be serving. However, Garp had suddenly fallen asleep and was slashed by Morgan, who escaped the ship by using his own son as a hostage. Helmeppo disowned him shortly thereafter  and returned to the Marine ship, leaving Morgan alone and drifting on the ocean."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Morgan%27s_Escape.png/revision/latest/scale-to-width-down/210?cb=20130122224426", "caption": "Morgan escapes, holding Helmeppo hostage."}]}, {"title": "Jango's Dance Paradise", "level": 3, "content": [{"type": "paragraph", "text": "He was seen again as a cameo in Jango's Mini-arc taking a nap in the ocean as Jango unknowingly passes him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/Morgan_Passes_Jango.png/revision/latest/scale-to-width-down/210?cb=20140916073331", "caption": "Morgan is seen passing Jango after his escape."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Morgan vs. Kuro", "elements": []}, {"text": "Morgan vs. Monkey D. Luffy and Roronoa Zoro", "elements": []}, {"text": "Morgan vs. Monkey D. Garp", "elements": []}, {"text": "Morgan vs. Helmeppo and Koby", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Helmeppo was drawn before his father and early drawings of Morgan greatly resembled Helmeppo's own appearance. One example had him almost identical to Helmeppo, just with a crazier hairstyle. Though he is said to have gone through several transformations, he was given his final design after the editor told Oda that the early design simply \"looked too lame\"."}, {"type": "paragraph", "text": "Morgan's original name was going to be 'Captain Chop'. Oda explained that he did not have the nerve to actually use this name (his name also apparently was similar to a wrestling move by a famous Japanese wrestler called Giant Baba)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Early_Morgan.png/revision/latest/scale-to-width-down/180?cb=20150829143045", "caption": "Early Morgan."}]}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Morgan is seen in his prison cell at the 153rd Branch Marine Base, when a Marine soldier of the same branch showed him Luffy's 30,000,000 bounty. This scene did not appear in the manga."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "While Morgan still retains his murderous tendencies in the 4Kids dub (ordering a marine to kill Rika, preparing to kill her himself after he refused, and almost killing another subordinate for denting his statue), when his men hesitated to attack Luffy and Zoro, instead of commanding them to kill themselves for disobedience, he instructed that they will attack, or else they'll have to \"shake hands\" with his ax-hand."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}]}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Cultural References", "level": 3, "content": [{"type": "list", "elements": [{"text": "In Gintama Episode 50, an Axe-Hand Morgan look-alike is seen charging towards one of the characters to fight, along with Crocodile and characters from other anime and manga.", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "When Morgan was explaining Devil Fruits to his men, he used two examples: the ability to breathe fire, and another to cause tsunamis, both of which belonged to two world-renowned pirates: the Yonko, Whitebeard, and his subordinate and son of the late Pirate King, Portgas D. Ace; both of which were the first Devil Fruit users to die in the series.", "elements": []}, {"text": "Oda intended to give him an onion-like hair style resembling his son Helmeppo and name him \"Chop\" instead of \"Morgan\", but the idea was soon discarded because of comment on the character as \"Ugly\".", "elements": []}, {"text": "Morgan is the first Marine to be mentioned in the One Piece series.", "elements": []}, {"text": "The word \"Möwe\", which appears on Morgan's metal jaw, is German for \"seagull\", which is the symbol of the Marines.", "elements": []}, {"text": "Oda stated that Morgan's name came from a real-life pirate. It is most likely from Sir Henry Morgan, who also began his career as a law-abiding seafarer.", "elements": []}, {"text": "\"Captain Morgan\" is a brand of rum.", "elements": []}, {"text": "Oda explained in an SBS that had Morgan been a Marine on the Grand Line he would have held the rank of Lieutenant, as there is a three-rank difference between the Headquarters Marines and Auxiliary Marines (Marines stationed in one of the Four Blues).", "elements": []}, {"text": "He is the first character in the series to call Luffy by his nickname, \"Straw Hat\".", "elements": []}]}], "images": []}]}