{"sections": [{"title": "Nezumi", "level": 1, "content": [{"type": "paragraph", "text": "Captain Nezumi is a Marine captain of the 16th Branch in the East Blue. Due to his actions, he can be considered the secondary antagonist of the Arlong Park Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nezumi has the appearance of a rat (\"nezumi\" is Japanese for both \"mouse\" and \"rat\"). He has whiskers, and rat ears attached to his marine cap. He also has brown hair. Unlike other Marines he has a greyish-blue button up coat that goes down to his feet, with a black belt and blue shoulder pads."}, {"type": "paragraph", "text": "His button up coat lacks the blueish color in the digitally colored manga and Episode of East Blue."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "His manners matches that of his appearance, in that he is rodent-like in every sense of the phrase. He is arrogant, cowardly, and decidedly corrupt. He is also greedy, as he willed to look the other way when Arlong took over Cocoyasi Village, so Arlong bribed him with Nami's treasure. He uses his military rank to intimidate his enemies and expects civilians to fully cooperate with him, regardless of his actions. When overpowered, he would cower and comply in fear, only to spout threats and revenge when he reaches a good distance."}, {"type": "paragraph", "text": "Like other characters in One Piece, he has a unique laugh: \"Chi chi chi chi\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine Captain and head of the 16th Branch, Nezumi has authority over the base and lower-ranking subordinates. However, he relies mainly on his rank and soldiers to intimidate his enemies and civilians. He has little to no physical combat capabilities himself, as he and his entire unit, were easily beaten up by Roronoa Zoro, who was critically wounded and bleeding at that time, as well as by Nami. Nezumi was practically wailing for mercy when he was stared down at by the Cocoyasi Villagers and Straw Hat Pirates, only to make death threats when he swam away to a fair distance, showing little to no mental fortitude."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "Nezumi accepted bribes from Arlong to keep the Marines from investigating the crimes of the Arlong Pirates. Acting on a tip from Arlong, he discovered the treasure that Nami had been hoarding in order to buy back Cocoyasi Village, and confiscated it."}, {"type": "paragraph", "text": "Once Arlong was defeated, Nezumi attempted to take all the glory from the Straw Hat Pirates, as well as the money from Arlong's stores. Roronoa Zoro quickly defeated Nezumi and his men. Nami hit him with her staff for destroying the orange grove and shooting Nojiko and then demanded that he return the stolen money, rebuild Gosa Village, and clean up all the mess left over from Arlong's reign. Humiliated and injured, he quickly retreated to a fair distance before swearing revenge against Monkey D. Luffy."}, {"type": "paragraph", "text": "Nezumi returned to his base and reported to his superiors about the incident, prompting the Marines to assign Luffy with his first bounty. However, Nezumi was not pleased with the wanted poster picture, as he thought it did not make Luffy look dangerous."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Nezumi_Beaten_Up.png/revision/latest/scale-to-width-down/210?cb=20180622080705", "caption": "Nezumi beaten up for trying to spoil the Cocoyasi Villagers' victory."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The 4Kids dubbed anime refers to his rank as Colonel, rather than Captain."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His Marine identification code is 00733.", "elements": []}, {"text": "He is the only person known to personally requested to put a person on the bounty list.", "elements": []}, {"text": "Nezumi's favorite food is cheese.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 8 Chapter 69 (p. 12-16) and Episode 31, Nezumi makes his debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0093), Nezumi's information is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 8 Chapter 69 (p. 15) and Episode 31, Hatchan mocks Nezumi's look due to his mouse face.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 94 (p. 8-13) and Episode 43, Nezumi attempts to take what he can out of Arlong's defeat.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 80 (p. 6) and Episode 36.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 80 (p. 6-15) and Episodes 36–37.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 94 (p. 8-13, 16-17) and Episode 43.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 94 (p. 16-17) and Episode 43, Nezumi reports to Marine HQ.", "elements": []}]}], "images": []}]}