{"sections": [{"title": "Pudding Pudding", "level": 1, "content": [{"type": "paragraph", "text": "Pudding Pudding was a Marine commodore in the 77th Branch of the Marines."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pudding Pudding is a man of average height with light purple hair, that he wears in multiple ponytails, a long goatee and has an average build. He wears a standard Marine uniform with a Marine coat and a green scarf."}, {"type": "paragraph", "text": "In his youth, he only had one ponytail."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/10/Pudding_Pudding_Youth.png/revision/latest?cb=20121205213625", "caption": "Pudding Pudding in his youth as a Marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appears to have full confidence in the abilities of his unit, warning the Arlong Pirates that the 77th Branch is known for its valor. Unfortunately, for him and his men, however, the commodore underestimated the pirate's abilities, possibly out of overconfidence in the Marines. He is shown to at least practice a somewhat refined version of justice; caring for not only the evacuation of the survivors from Arlong's reign, but also destroying the Arlong pirates altogether for their crimes. Unlike Nezumi, he appeared not in the least bit willing to negotiate with Arlong."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Subordinates", "level": 3, "content": [{"type": "paragraph", "text": "He seems to care for his subordinates. He had a casual conversation about Arlong Park with one of his subordinates. Before emerging into battle with the Arlong Pirates, Pudding Pudding encouraged his men to fight. His subordinates care about him, as they were very angry at Chew when the fish-man attacked their commodore."}], "images": []}, {"title": "Pirates", "level": 3, "content": [{"type": "paragraph", "text": "He believes that pirates should not be able to set up a base. Because of his strong sense of justice, he can not overlook pirates that he encounters, despite the mission he is on. Despite this, when he directly encounters a pirate, he introduces himself and he asks him or her to surrender first."}], "images": []}, {"title": "Arlong", "level": 3, "content": [{"type": "paragraph", "text": "When Pudding Pudding's ship attacked Arlong Park, Arlong was willing to negotiate with the Marine commodore by bribing him with 2,000,000. However, Arlong changed his mind when the Marines shot a cannon ball toward him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a commodore of the 77th branch, Pudding Pudding had command over the base and lower ranking Marines. However, he had not shown any physical combat capabilities as Chew shot him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was dispatched to Arlong Park to evacuate the survivors of Arlong's tyrannical reign. When Pudding Pudding sees the Fish-Man's base, hubris gets the better of the commodore, and he orders an attack. This provokes Arlong's ire, and the fish-man crew make quick work of Pudding Pudding and his ship, sending them to the bottom of the sea in an artificial maelstrom."}], "images": []}, {"title": "Manga Influences", "level": 2, "content": [{"type": "paragraph", "text": "It was asked by a fan if Pudding Pudding was modeled after Purin Purin-chan from the 1981 puppet show, \"Tales of Purin Purin\". Oda confirmed the similarity between the two characters (his older sister liked the show), however, he only remembered the name and hairstyle."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 75 and Episode 34.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Pudding Pudding's birthday is given.", "elements": []}, {"text": "↑  One Piece Red: Grand Characters (p. 198), His name is written in English as 'Pudding Pudding'.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 34, Fan Question: Is Pudding Pudding based on Purin Purin chan?", "elements": []}]}], "images": []}]}