{"sections": [{"title": "Hina", "level": 1, "content": [{"type": "paragraph", "text": "\"Black Cage\" Hina is a Marine officer and a former classmate of Vice Admiral Smoker.Jango and Fullbody are currently her subordinates. She was originally introduced as a captain. During the timeskip, she was promoted to the rank of rear admiral."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hina is a tall and slim woman with straight, waist-length pink hair that she wears in a middle part. She has dark brown eyes and wears red lipstick. She is sometimes seen smoking a cigarette."}, {"type": "paragraph", "text": "During her first appearance, she wore a burgundy-purple two-piece suit over a white blouse, as well as dark brown shoes and a pair of dark gloves."}, {"type": "paragraph", "text": "Her second outfit consists of a purple shirt with a deep neckline and golden motifs on the front, matching long pants, and high-heeled shoes. She also sports a bead necklace around her neck and a pair of purple sunglasses either covering her eyes or on her forehead."}, {"type": "paragraph", "text": "As with most Marines, Hina often accompanies her outfit with a long white Marine jacket draped over her shoulders like a cape. The only difference is that she retains her signature color on the epaulettes, which was light blue, while Marines officers normally have red and blue epaulettes."}, {"type": "paragraph", "text": "As a child, she had the same haircut but with shorter hair. She wore a plain striped dress and shoes. She was depicted as keeping several pet birds in cages, in reference to her devil fruit."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hina has a tendency to speak in the third person. It is normal for young children in Japan to refer to themselves by using their own names as a first-person pronoun (e.g., \"Hina fail\".) This is seen as cute. Aside from this habit, however, she does not make any effort to act cutely and usually appears very stoic. She has been shown to be a respectful and rational person, calmly admitting her loss after trying to capture Luffy."}, {"type": "paragraph", "text": "Hina seems to be quite knowledgeable on historical facts as she mentioned the legendary Rocks Pirates, whose existence is only more commonly known among older marines, such as Garp and Sengoku, rather then most marines of her generation."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "Hina is a long-time friend of Vice Admiral Smoker, having joined the Marines at the same time he did. She has helped him escape from situations that could have gotten him fired. Because they have known each other for a long time, Hina calls him Smoker-kun (a Japanese honorific used usually for younger peers) while Smoker addresses Hina by her name alone (which, in Japanese, shows either a sign of disrespect or closeness)."}, {"type": "paragraph", "text": "Jango and Fullbody tend to follow Hina around. She does not respond to their words of adoration, but she also seems to be rather forgiving of them when they goof off and dance, as they usually do. She took them in as subordinates in recognition of their (moderate) strength."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Hina has proven to be quite perceptive, as she was able to see through Miss Goldenweek's, Mr. 5's, and Miss Valentine's disguises by looking at their wanted posters."}, {"type": "paragraph", "text": "She is a skilled unarmed combatant and was able, with the aid of her Devil Fruit, to beat Mr. 2 Bon Kurei, a powerful hand-to-hand fighter, in a one-on-one battle."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "She received the nickname \"Hina the Black Cage\" because of her Ori Ori no Mi ability, a Paramecia-type Devil Fruit that allows her to form restraints on people by swiping her limbs through them. She can let others pass through her body, leaving them trapped in a ring of iron. She can also extend her arms to form a cage which traps anyone who interacts with its bars."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/The_Ori_Ori_no_Mi_in_Action.gif/revision/latest?cb=20121102011700", "caption": "The Ori Ori no Mi being used."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Although she has not been shown wielding any weapons, Hina has at her disposal the Black Cage Corps (黒檻部隊, Kuroori Butai). So far only the \"Black Cage Corps: Black Spear Squadron\" (黒檻部隊 黒ヤリの陣, Kuroori Butai: Kuroyari no Jin) has been seen."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Years ago, she was at the Marine academy training alongside Smoker. While she was a shining example of a student, Smoker was a troublemaker and Hina had to bail him out on several occasions."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Jango's Dance Paradise", "level": 4, "content": [{"type": "paragraph", "text": "Hina was first seen in Jango's mini-series when Jango and Fullbody spotted her and became her followers."}], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Hina was formally introduced in Alabasta when she arrived after Crocodile and Baroque Works had been defeated by the Straw Hat Pirates. She was seen alongside Smoker on the ship that contained the Dance Powder. She asked Smoker if he used the dance powder to make it rain, to which he replied that he knew the difference between right and wrong and that he would not use something that is prohibited by the country. She was then asked by Smoker to bring both the ship and the apprehended members of Baroque Works to his ship."}, {"type": "paragraph", "text": "The next day, she was present when Smoker received a call from Marine Headquarters, congratulating him and Tashigi for defeating Crocodile and that they were to be given medals and would be promoted. Smoker angrily denied it, stating that it was Straw Hat Luffy and his crew who took down Crocodile, not him. While this is going on, Hina told Smoker to accept the medals and the promotion, telling him that it was obvious that the World Government planned to cover up the entire incident and that if he disobeyed the top brass, he could risk getting court-martialed. However, Smoker told her that it would be better than living a lie and, before hanging up, told the person on the other end to tell the \"old geezers\" at Marine Headquarters to go to hell."}, {"type": "paragraph", "text": "Some time later, Hina attempted to capture the Straw Hat Pirates as they left the island. She broke her trademark warship formation after being tricked by Mr. 2's Mane Mane no Mi powers. Later, she had no choice but to give up chasing the Straw Hats after Monkey D. Luffy returned all the projectiles that were launched at him, damaging the warships."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 4, "content": [{"type": "paragraph", "text": "She was next seen vacationing on Kyuka Island until capturing Miss Valentine. She was once again tricked by Mr. 2's Mane Mane no Mi powers when he disguised himself, this time as Mr. 3. As a result, Miss Valentine escaped her custody and several BW agents stole her ship, but she captured Mr. 2 and Mr. 3 in the end."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Hina reported to the summoning of the Marines to reinforce Marineford."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three hours before Ace's execution, Hina listened to Sengoku's speech about Ace's past. She later attacked Luffy, but he activated Gear Second and dodged her attempt to ensnare him, leaving her attacking her own allies. She silently admitted defeat to herself."}, {"type": "paragraph", "text": "At the end of the war, she stood next to her fellow marines."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/Awase_Baori.gif/revision/latest?cb=20130117213924", "caption": "Hina attempts to capture Luffy and other pirates with Awase Baori."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "One Piece Film: Z", "level": 4, "content": [{"type": "paragraph", "text": "Hina attended a summit after former Admiral Zephyr, now leader of the Neo Marines, attacked a Marine base and stole the Dyna Stones. She was seen standing beside Fleet Admiral Sakazuki, silently listening as the others discussed the matter."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Hina_at_the_Marine_Summit_Meeting_in_Film_Z.png/revision/latest/scale-to-width-down/150?cb=20130704135445", "caption": "Hina at the Marine summit meeting."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Nefertari Family departed Alabasta for the Levely, Hina and her men escorted them to Mary Geoise."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Hina was later present at Red Port when the Marines intercepted a communication between Big Mom and Kaido. Hina spoke with Garp about a powerful pirate group named Rocks that were before Roger's era."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hina vs. Mr. 2 Bon Kurei", "elements": []}, {"text": "Hina vs. Mr. 2 Bon Kurei (disguised as Monkey D. Luffy)", "elements": []}, {"text": "Marines and Shichibukai vs. Whitebeard Pirates and allies", "elements": [{"text": "Hina vs. Monkey D. Luffy", "elements": []}]}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Hina was originally intended to be called \"Marushiano\" (マルシアーノ). She also was supposed to have the rank of Ensign, rather than Captain. Although the character went through a name and rank change, the overall appearance remains the same. Furthermore, like how Fullbody is attracted to Hina, he was originally intended to be attracted to \"Marushiano\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/ff/Early_Hina.png/revision/latest/scale-to-width-down/120?cb=20180628010502", "caption": "An early sketch of \"Ensign Marushiano\"."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her birthday is March 3, a Japanese holiday called Hina-matsuri or Girls' Day (coinciding with her name).", "elements": []}, {"text": "In the 5th Japanese Popularity Poll, Hina is ranked the 105th most popular character in One Piece.", "elements": []}]}], "images": []}]}