{"sections": [{"title": "T Bone", "level": 1, "content": [{"type": "paragraph", "text": "\"Ship Cutter\" T Bone is a former knight and currently a Marine officer."}, {"type": "paragraph", "text": "He was one of the antagonists during the Sea Train voyage in the Water 7 Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "T Bone has curly long black hair, a skeletal face, and a long neck, and he is missing one tooth. He is pot-bellied with muscular arms and thin legs. Even after becoming a Marine, his overall appearance mirrors his former occupation: he is clad in golden, sleeveless chain mail armor with an ornately decorated collar and he wears a helmet with a long, flowing purple plume on the top. Over his cuirass, he has a tunic emblazoned with the Marine symbol. He has a rope belt tied around his waist, similar to the ones worn by some samurai. His attire is completed by standard light-blue pants and shoes. It should be noted that many elements of his outfit have one or more crosses on them: his helmet, the pendants hanging from his belt, and his sword's hilt."}, {"type": "paragraph", "text": "He carries around his signature weapon, a decorated sword reminiscent of the ones used by Templars in popular fiction, either on his right hip (suggesting he may be left-handed or ambidextrous) or hanging from his back."}, {"type": "paragraph", "text": "Also, instead of wearing the standard officer's Marine coat, he has a high-collared mantle with the kanji for \"justice\" (正義, Seigi) printed on it. He tore it to pieces during the travel on the Puffing Tom in order to treat his injured comrades; however, he seemed to have repaired it or have gotten a new one in his appearance in the Marineford Arc."}, {"type": "paragraph", "text": "In his younger days in the Marines, he had shorter hair and sported a standard Marine cap."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "T Bone is a very honorable and considerate person, and he absolutely abhors needless violence. His main fault is his tendency to take life very seriously - although he values the soldiers under his command, he has a tendency to fuss over their minor problems in a melodramatic manner, which can make them uncomfortable. He is noted for being far too willing to sacrifice himself, even when the situation does not call for something so drastic. Apparently, he has a penchant for dramatic phrasing, and he often speaks about honor and justice. He believes very strongly that it is a Marine's duty to protect innocent people. He has a very strong will that was shown when he left his detached train car and ran across the train tracks completely indifferent to the storm going around him. He believes every criminal he lets get away leaves an innocent person in danger. Because of this he will do anything and everything in his power to catch them even if it means claiming his own life. He claims to dislike curved swords, such as Zoro's swords. His own sword fighting style even reflects a lack of crooked swings, preferring to slash in straight motions or sharp right angles."}, {"type": "paragraph", "text": "T Bone's motto is \"Do 100 good deeds every day\", and because he dislikes unnecessary violence so much and wishes to protect life, he is also a vegan."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "Being a Marine Captain, T Bone has many marines under his command. He values the soldiers under his command and is shown to care for their well-being to the point of melodramatically worrying about their minor problems, making them uncomfortable. That aside, his men show great admiration for their Captain, believing he can defeat any enemy. He puts their safety as a high priority, going back to warn them about Sanji, Franky, and Usopp's trap rather than saving himself or chasing the Straw Hats. He also saved them from the sea king that attacked their detached car. They, in turn, were determined to help him after he was defeated by Zoro; however, this was only seen in the anime."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "T Bone recognized Zoro as the pirate hunter upon seeing him on the upcoming train but decided to confront him in order to protect his subordinates. Zoro acknowledged that T Bone is a strong swordsman, and during their brief battle, it seemed that they both developed some respect for each other's strength. Zoro even apologized for not being able to stop and save T Bone from the sea, but he explained that saving his friend was more important than justice."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "T Bone is extremely strong and resistant: his thin and apparently frail legs allowed him to run for a long time on the Sea Train's rails during a storm. He was struck by a hit strong enough to destroy his own sword without receiving permanent damage. The force he applied in his sword strikes can cut through metal trains, large ships, and even giant Sea Kings in half. Also, Zoro commented to himself twice that T Bone was strong, and the fact that their fight lasted only moments does not mean he was inferior to Zoro at all (at that point the fight could only be settled in mere moments as the Rocket Man was racing towards the rails T Bone was standing on)."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "T Bone is renowned for his incredible mastery in swordsmanship: he is capable of generating flying slashes from the force of his sword strikes, something only the strongest swordsmen like Roronoa Zoro and Dracule Mihawk have been capable of. His sword strikes are powerful enough to cut through trains, boats, and sea kings. T Bone is known as the \"Ship-Cutter\" (船斬り, Funekiri) for his prowess in swordsmanship according to Zambai, T Bone can easily slice large ships like cutting steaks."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "T Bone wields a sword called Bamboo. It is a sword with a perfectly straight blade and is finely decorated, as well as the hilt. During his fight with Zoro, his sword was destroyed by the pirate."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Before joining the Marines, T Bone was a royal knight. The country he served is unknown."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "T Bone was assigned to help escort the CP9 agents to Enies Lobby, the Judicial Headquarters of the World Government on the Grand Line, where T Bone is usually stationed. He was stationed in the 5th car of the Puffing Tom alongside 40 of his men. When he and his men faintly heard the Straw Hat Pirates in the car behind them, T Bone stood to defend them as a precaution. T Bone noticed that one of his underlings was injured (the Marine had a bleeding bug bite), so he called the man to stand at attention. T Bone tore part of his cape off and gave it to the Marine. After receiving word from another Marine soldier that the 6th and 7th cars' guards had been defeated and that the prisoners escaped, T Bone and his men moved to another car in order to assist those knocked out by Sanji. T Bone tended to the wounds of the 7th car guards, tearing more of his cape off. As they were doing so, Sanji, Franky, and Usopp knocked on the door and greeted the guards before quickly closing and sealing the door of the car T Bone and his men were standing in. The Captain cut it clean with his Chokkaku Senkō: Bone Soir and started chasing them on the train's roof. T Bone realized that they had fallen into a trap, but his efforts to escape to the cars ahead was futile; he and his men were separated from the other passengers when the Straw Hats and the cyborg detached their cars from the train."}, {"type": "paragraph", "text": "After killing a Sea King that assaulted their car with one blow, T Bone started running along the tracks by himself, seeking help and chasing the train. He encountered a Sea King on his path, but he cut it in half and continued. He was then reached by the Rocket Man, and after exchanging some words with Roronoa Zoro, he battled him on the rails, attacking him with his Chokkaku Hichō: Bone Ōdorī. Despite his skills, he was defeated by the Straw Hat Pirates swordsman's Gyūki: Yuzume. Zoro's blow destroyed T Bone's blade and knocked him into the sea as the Rocket Man sped down the tracks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/18/Zoro_Defeats_T_Bone.png/revision/latest/scale-to-width-down/210?cb=20130922181936", "caption": "T Bone is defeated by Zoro."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, T Bone reported to the summoning of the Marines to reinforce Marineford."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/77/T_Bone_Arrives.png/revision/latest/scale-to-width-down/210?cb=20130307125026", "caption": "T Bone arrives at Marineford."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "T Bone was shocked to see that Little Oars Jr. was still alive."}, {"type": "paragraph", "text": "After the Red Hair Pirates arrived, Sengoku ordered the Marines to stand down, ending the war."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "T Bone encountered Admiral Fujitora when the latter was entering Mary Geoise. While T Bone had orders to throw Fujitora out of any Marine base, the admiral pointed out that Mary Geoise is technically not a Marine base. Not knowing how to respond to this answer, T Bone returned to Sakazuki at New Marineford to inform him of the situation, enraging the Fleet Admiral."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, an early concept of T Bone was revealed with a completely opposite personality."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Early_T_Bone.png/revision/latest/scale-to-width-down/210?cb=20150404101842", "caption": "Early concept of T Bone from One Piece Green."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, T Bone is shown floating in the sea and thinking about his defeat, as his men approached to assist him, rowing on the car bifurcated by Zoro."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "T Bone vs. a Sea King (unseen)", "elements": []}, {"text": "T Bone vs. Roronoa Zoro", "elements": []}, {"text": "The Marines and Shichibukai vs. Whitebeard Pirates and Allies", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "T Bone appears in One Piece Anichara Heroes Vol. 5 - Enies Lobby along with other major characters from the Enies Lobby Arc."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/OPAnicharaHeroes-EniesLobby1.png/revision/latest/scale-to-width-down/180?cb=20131128103248", "caption": "T Bone and other Enies Lobby character appear in miniature."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A fan asked Oda whether T Bone was a zombie like the ones in Thriller Bark or a boney man like Brook. Oda jokingly explained that T Bone would be a General Zombie through the process of deductive reasoning. His explanation was that since T Bone is neither a Wild Zombie nor a Surprise Zombie, and that Soldier Zombies are those that are without weapons, then T Bone would be a General Zombie.", "elements": []}, {"text": "In a Japanese Fan Poll, T Bone is currently ranked the 122nd most popular character in One Piece.", "elements": []}]}], "images": []}]}