{"sections": [{"title": "Brannew", "level": 1, "content": [{"type": "paragraph", "text": "Commodore Brannew is a Marine officer stationed at Marine Headquarters who assigns bounties to criminals."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Brannew is a tall, tanned man with dark-green curly hair, upwards pointing sideburns, large lips, and eyes that are always obscured by a pair of sunglasses. He sports a blue and white striped shirt with an open collar, pink suit pants, and a pair of shoes. There are epaulets attached to his shirt, suggesting that this is his modified version of the Marine uniform; however, during the Battle of Marineford, he was seen wearing a standard Marine coat with epaulets draped on his shoulders like many other officers."}, {"type": "paragraph", "text": "After the timeskip, he is seen wearing a dark colored shirt with vivid blue patterns along with the standard Marine coat draped over his shoulders. He also now wears an earring on both ears."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Brannew has displayed a strong belief in justice and eradicating evil. When he first decided Monkey D. Luffy's first bounty, he acknowledged that it appeared to be high, but proclaimed that it was necessary in order to get rid of evil before they grew stronger. He also takes his work very seriously, as he searched all over Marineford for Sengoku in order to report to him about the situation at Impel Down. He also values the Marines greatly, as demonstrated by his outrage of Luffy ringing the Ox Bell during his report to other officers."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As commodore, Brannew has command over lower-ranking subordinates. Despite his rank being lower than his superiors, he seems to have quite a lot of authority, as he is usually seen in charge of meetings where higher-ranking officers have to patiently listen to him speak. In terms of fighting ability, Brannew appears to be somewhat capable of putting up with combat as he survived the Battle of Marineford."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During the battle of Marineford, Brannew was seen wielding a sword."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Captain Nezumi had informed Marine Headquarters about a certain dangerous pirate and had requested a bounty be placed on his head, Brannew convened a meeting of Headquarters' officers, where he revealed that their branches had been unable to deal with this new pirate crew. He then revealed that the likes of Buggy, Don Krieg, and Arlong, pirates that stood out in a sea where the average bounty was but a mere 3,000,000, had all been defeated by this newbie pirate. In light of this severity, Brannew proposed a bounty of 30,000,000 to be placed on Monkey D. Luffy in order to eradicate him early on."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Battle of Marineford, Brannew defended Marine Headquarters from the attacks of the Whitebeard Pirates and their allies. However, in the midst of battle, he was temporarily taken aback when Little Oars Jr. joined the attack. Sometime afterwards, Brannew got injured in battle."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, an injured Brannew ran around the destroyed Marine Headquarters looking for Sengoku to inform him about the situation at Impel Down. He revealed to Sengoku that Magellan was badly injured, but still alive, and that he had already taken responsibility for the prison escape. When Sengoku questioned him about what exactly occurred, Brannew recounted the events that had transpired with the Blackbeard Pirates and revealed that, besides the four that had joined Blackbeard, there were also other Level 6 prisoners missing. When Sengoku ordered him to send out bounty posters of the escapees, Brannew hesitated before informing the fleet admiral that the World Government had decided to keep their escape secret, so that the people would not lose faith in their authority."}, {"type": "paragraph", "text": "Sometime later, Brannew convened a meeting at the conference hall, where he recounted Monkey D. Luffy's recent actions. Summarizing the pirate's relations with Portgas D. Ace, Monkey D. Garp, and Monkey D. Dragon, he explained to the Marine officers gathered that the pirate's whereabouts had been unknown, but that he suddenly reappeared at Marine Headquarters alongside Jinbe and Silvers Rayleigh. He went on the reveal that the three took advantage of a time when security was low to ritually sail around Marineford in a hijacked battleship, ring the Ox Bell sixteen times, and throw a bouquet of flowers into the rubble while bowing his head in silent prayer. Brannew then stated that this was a humiliation for the Marines to let him escape and let the journalists report this incident worldwide. Finally, he concluded that the act of ringing the bell sixteen times, and not two as was customary of an observance for a tragedy, was a sign that this was a sheer declaration of war by the pirate."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/aa/Brannew_Reports_to_Sengoku.png/revision/latest/scale-to-width-down/230?cb=20110320023912", "caption": "Brannew speaking with Sengoku."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Brannew_After_War.png/revision/latest/scale-to-width-down/230?cb=20130616001412", "caption": "Brannew talking about Luffy's sudden return to Marineford."}]}, {"title": "During the Timeskip", "level": 3, "content": [], "images": []}, {"title": "3D2Y", "level": 4, "content": [{"type": "paragraph", "text": "When news broke out that Byrnndi World had reappeared and had created a path of destruction, Brannew reported to the newly promoted Fleet Admiral Sakazuki. In his office, Kizaru asked Brannew whether World was also responsible for the disappearance of a certain island, to which Brannew confirms that the World Government believes so and that the Shichibukai have been ordered to gather. Tsuru then arrived and revealed more information about World's past and warned them about how dangerous he was. Upon hearing this, Brannew displayed some uneasiness towards World's notoriety."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After news had spread that Donquixote Doflamingo had resigned from his position, a meeting was called at the new Marine Headquarters at New Marineford to discuss the matters of the Shichibukai. The now-Commodore Brannew emphasized to other high-ranking officers how it was the duty of the Shichibukai to provide their power to the government in exchange for their right to do as they please. However, with the recent turn of events such as Doflamingo's supposedly resignation and Law's alliance with Luffy, Brannew expressed his anger at the balance of power being thrown off. He was then cut off by Sakazuki, who explained that he had already sent Fujitora to address the issue."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the abolishment of the Shichibukai system and the Marines learning of Big Mom and Kaido's newly formed alliance, Brannew participated in a meeting with many Marine officers. After Sengoku told them about the Rocks Pirates and the God Valley Incident, Brannew went over the bounties of each of the Yonko and Roger. The meeting was interrupted when Sakazuki entered the room and said that the Marines were leaving Wano Country alone due to not having enough manpower to deal with both Big Mom and Kaido."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The katakana forming Brannew's name are the transcription of the English word \"brand-new\".", "elements": []}, {"text": "Brannew's favorite food is blancmange.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 96 (p. 5-6) and Episode 45, Brannew is first introduced.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 70 Chapter 700 (p. 12), Brannew's name and current rank are romanized.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 151), Brannew's birthday is given.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0113), Information about Brannew is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 581 (p. 14-16) and Episode 490, Brannew informs Sengoku about Impel Down's situation.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 and Episode 511, Brannew informs the Marines of Luffy's infiltration of Marineford.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 554 and Episode 463, Brannew is surprised by Little Oars Jr.", "elements": []}, {"text": "↑  One Piece Anime — 3D2Y: Overcome Ace’s Death! Luffy’s Vow to his Friends, Brannew reports to Sakazuki about Byrnndi World.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 957.", "elements": []}]}], "images": []}]}