{"sections": [{"title": "Tashigi", "level": 1, "content": [{"type": "paragraph", "text": "Captain Tashigi is a Marine officer serving under Vice Admiral Smoker in the base of G-5."}, {"type": "paragraph", "text": "She was originally introduced as Master Chief Petty Officer (曹長, Sōchō) in Loguetown  but was promoted to Ensign (少尉, Shōi) after the events in Alabasta. During the timeskip, she was promoted to Captain (大佐, Taisa)."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tashigi has dark brown eyes and wears her black hair between chin- and shoulder-length. She looks remarkably similar to the late Kuina, Zoro's childhood friend. She wears rectangular glasses with red frames."}, {"type": "paragraph", "text": "Before the timeskip, she was seen wearing short-sleeved shirts of varying different colors and designs but usually covered them with her white-trimmed, waist-length blue leather coat. She tended to wear blue jeans with black shoes but has also paired white capris with tan shoes."}, {"type": "paragraph", "text": "Her face and hair have changed slightly several times since her introduction, especially noticeably in Chapter 439. However, it is not clear whether this was an intentional redesign or simply a result of the author's continually evolving art style and the length of time she had been out of the spotlight."}, {"type": "paragraph", "text": "After the timeskip, her hair is much longer and now pinned up by a clip. She still wears glasses, and, like many other women, her figure has become more exaggeratedly feminine than it was two years ago. She was seen wearing a floral button-down shirt, blue capris, dark pink gloves with a white trim, and dark pink boots. Having achieved the rank of captain, she replaced her blue coat with a pink version of the standard Marine officers' coat. As with Hina, Tashigi's subordinates tend to fawn over her, but it is clear that they also respect her as their superior."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Tashigi was first introduced when the Straw Hat Pirates docked in Loguetown, where she was stationed. Smoker, her superior officer, seems to regard her as a protege, and the two work very well together. Despite her proficiency in sword fighting, she is usually clumsy, which gets on Smoker's nerves. She is extremely interested in katanas, often identifying their names and origins on sight; even when in danger, she may be distracted by the presence of a famed blade. During the Loguetown Arc, she was even shown carrying what seemed to be a pocket Meito field guide."}, {"type": "paragraph", "text": "Tashigi is very brave and reckless when fighting her opponents, a trait typical of swordswomen and swordsmen. She will battle anyone she considers an enemy, regardless of their reputation. This fighting spirit often turns into carelessness and has led to her defeat on several occasions, much to Smoker's disdain. Two examples would be her fight against Nico Robin, during which her knee was broken, and her fight against Law, during which she was cut in half. She is also stubborn and may refuse to accept defeat if she feels she has been looked down upon, as seen when she demanded a rematch with Zoro, indignant that he didn't cut her down. She even refused to give up after Law separated her torso from her legs and chopped Shigure in half. Her endless determination could be interpreted as a \"sore loser\" attitude, but it seems to derive from her desire to protect what is important to her."}, {"type": "paragraph", "text": "Like Smoker, Tashigi's definition of \"justice\" differs from that of the Marines as a whole, and she does not hesitate to fight in its defense. Her stated goal is to remove all Meito from the hands of those who would use them for their own selfish ambitions. Despite her distaste for pirates, Tashigi is willing to work with them and abandon her Marine pride if she deems it necessary for the greater good."}, {"type": "paragraph", "text": "Tashigi felt that, as a swordswoman, she would be perceived as inferior to swordsmen by default, and she accused Zoro of refusing to cut her because of her gender. She also felt insulted when Law cut her without killing her. As a swordswoman, she would rather face death than be shamefully defeated. However, this does not stop her from trying hard to get stronger and achieve her dreams."}, {"type": "paragraph", "text": "Tashigi wears her shirts buttoned up higher and shows less cleavage than many other female characters, indicating that she is somewhat reserved about her body. This was especially apparent when she was trapped in Smoker's body, as she wore his jacket fully closed and protested heavily when Smoker (trapped in her body) took off her bra and wore her shirt completely unbuttoned. Her shyness was also shown when she screamed in embarrassment after returning to her body and finding it in that state of undress."}, {"type": "paragraph", "text": "One of Tashigi's most prominent character traits is her absentmindedness. When Smoker was chasing after Luffy during the Alabasta Arc, she failed to recognize the situation until Smoker told her what to do. In the anime, she had a brief but polite interaction with Chopper without realizing that he was a talking reindeer. The most significant example of her oblivious nature was when, in the Loguetown Arc, Tashigi spent a very long time failing to realize that the three-swords-carrying, haramaki-wearing swordsman she had befriended was, in fact, the three-swords-carrying, haramaki-wearing Pirate Hunter, Roronoa Zoro."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8b/Tashigi_Embarrassed.png/revision/latest/scale-to-width-down/150?cb=20181014114328", "caption": "Tashigi showing embarrassment."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [], "images": []}, {"title": "Smoker", "level": 4, "content": [{"type": "paragraph", "text": "Tashigi's relationship with her superior, Smoker, is strictly professional. Smoker often scolds her for such mishaps as mistaking a fellow Marine for Smoker because she wasn't wearing her glasses. Her absent-mindedness greatly gets on his nerves, and in the 97th chapter of the series, Smoker himself claimed that she was the shame of the Marine HQ. Despite this, he respects her and trusts her judgement, as seen when he tells her to follow her own sense of justice in Alubarna. Tashigi always apologizes to Smoker when she makes a mistake, and she tries to follow his orders as closely as possible, indicating an earnest admiration for her mentor."}, {"type": "paragraph", "text": "Recently, she has shown some defiance toward her superior. When he scolded her for begging Law to spare their lives, she retorted that it was the only way they could save their subordinates and the abducted children from Vergo. Smoker saw her logic and realized that he was the one who had been mistaken. She later glared at him for having worn her shirt unbuttoned when he was in her body."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Tashigi_Cries_For_Smoker%27s_Encouragement.png/revision/latest/scale-to-width-down/210?cb=20191208154956", "caption": "Tashigi cries after receiving stimulus phrases from Smoker."}]}, {"title": "G-5", "level": 4, "content": [{"type": "paragraph", "text": "Tashigi's new subordinates idolize and often make passes at her, much to her frustration. They find her distractingly lovely even during battle and often get scolded for it. Although they disrespectfully refer to her as \"Captain-chan\" and \"Tashigi-chan,\" her subordinates are very protective of her and will defend her with their lives. Although she is certainly annoyed by their constant harassment, she shows genuine concern for them, even telling Smoker that they have no choice but to cooperate with felons in order to rescue them from danger. Another example of her value for her subordinates is that she spared them from the cruel truth that Vergo, the commanding officer they admire, was actually a traitor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Tashigi_Annoyed_by_her_Subordinates.png/revision/latest/scale-to-width-down/210?cb=20150528013603", "caption": "Tashigi annoyed by her subordinates."}]}, {"title": "Shichibukai", "level": 3, "content": [{"type": "paragraph", "text": "Tashigi originally thinks of the Shichibukai as allies. Her superior Smoker reminded her that he doesn't trust the Shichibukai and believes that pirates are pirates. Tashigi now believes that the Shichibukai are nothing more than pirates and that they cannot be trusted."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Tashigi seems to hold a grudge against Roronoa Zoro, believing that he was using his swords for means of making money (bounty hunting). After learning his true identity and his new career as a pirate, she challenged him to a duel. Zoro defeated her, but she refused to accept her defeat unless he actually cut her. One of Tashigi's goals is to defeat Zoro in order to gain his Wado Ichimonji, as she believes that such a renowned blade should not be in the hands of a criminal; much later, she noticed that Zoro was also wielding Shusui, furthering her interest."}, {"type": "paragraph", "text": "Upon seeing his improved skills after the two years, she seemed to have a respectful understanding of his immense power. It also appears that she has seen how wrong she was about him attacking women after seeing him harming Monet in her defense."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/ff/Tashigi_Facing_Zoro.png/revision/latest/scale-to-width-down/210?cb=20191211122026", "caption": "Tashigi facing Zoro in Loguetown."}]}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Although Tashigi and Sanji are on different sides of the justice system, he nevertheless is smitten by her the moment they met in Loguetown. During their second meeting on Punk Hazard, his womanizing ways led him to be overexcited. When Tashigi was nearly killed by Vergo, Sanji immediately and unhesitatingly goes out of his way to save her, simply because he felt \"a woman crying in the distant\". He dismissed the fact that they are meant to be enemies when Tashigi brought it up."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Tashigi mostly relies on her great speed and agility in battle. She has been aiming to get stronger since the end of the Alabasta arc. After the timeskip, Tashigi has shown considerable strength, able to apply enough force on Shigure to deflect a cannonball. Her speed and agility has also greatly improved, able to jump to very tall heights as well as using the Rokushiki Soru technique to move instantaneously. Tashigi has shown exceptional pain tolerance, able to withstand Monet violently frostbiting her shoulder."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Tashigi is a highly skilled Gentle Blade type swordswoman, capable of defeating two pirates in Loguetown with little effort and quickly take down multiple opponents within seconds. Tashigi has encyclopedic knowledge about swords, as shown in the sword shop at Loguetown. She's also been seen carrying her sword on both her left and right side, suggesting that she's capable of comfortably drawing it with either hand."}, {"type": "paragraph", "text": "Tashigi's personal katana is the Meito Shigure.  "}, {"type": "paragraph", "text": "After the timeskip, her skills have improved, as she was able to precisely deflect an enemy cannonball with her katana in the same way Dracule Mihawk has deflected bullets."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/76/Tashigi_Deflects_Cannon_Ball_Post_Timeskip.gif/revision/latest?cb=20121112010459", "caption": "Tashigi deflecting a cannonball using her swordsmanship."}]}, {"title": "Swords", "level": 4, "content": [{"type": "list", "elements": [{"text": "Shigure (the sword she usually carries and uses)", "elements": []}, {"text": "Yamaoroshi (formerly belonged to Billy of the Yes Pirates)", "elements": []}, {"text": "Kashu (formerly belonged to Mr. 11 of the Baroque Works)", "elements": []}]}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, Tashigi was seen using Soru to avoid snowballs in her fight against Monet."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "During her battle with Trafalgar Law, Smoker revealed that Tashigi uses Haki but stated that her aptitude with it is not yet enough to counter Law's ability."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Tashigi possesses the ability to use Busoshoku Haki. She was seen using Busoshoku Haki when she was able to cut Monet, a Logia user, causing her to bleed."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Tashigi possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "She was born in the East Blue. Since childhood, she began to take a liking for swords."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "While Zoro was walking around town, he noticed Tashigi being confronted by two pirates. Tashigi, being a swordswoman, quickly finished them off but ended up dropping her glasses. Zoro, impressed by her skills, retrieved them for her, but when she thanked him, he was taken aback by how uncannily she resembled his long dead friend, Kuina."}, {"type": "paragraph", "text": "Tashigi ran into Zoro again when she went to pick up her sword from the sword shop, and after seeing him pit his luck against a cursed sword by tossing it and letting it fall over his outstretched arm, she thought of him as an extraordinary swordsman."}, {"type": "paragraph", "text": "Soon after, Tashigi met up with Smoker and they headed to the execution platform where Buggy was about to execute Luffy. The two marines were surprised to learn that Pirate Hunter Zoro was in the same crew as Straw Hat Luffy. Smoker asked Tashigi if she had ever seen somebody accept their death and laugh at the execution platform."}, {"type": "paragraph", "text": "When Tashigi learned Zoro's true identity, she confronted him as the Straw Hat Pirates were making their escape from the town. She accused him of lying to her and stated that she would take Zoro's Meito, Wado Ichimonji, away from him. As the pair broke into a fight, Sanji yelled at Zoro for attacking a woman but was pulled by Luffy toward the harbor, leaving Zoro behind. Tashigi was promptly defeated, knocked against the wall with Zoro's sword at her throat, and Zoro said that he would never give up his sword. As he began to run after Luffy and Sanji, Tashigi was outraged that she wasn't killed and demanded to know why he refused to kill her, thinking that he was looking down on her as a woman. Zoro yelled at her and told her to stop imitating his dead friend, and the two broke out in a childish argument until Dragon’s arrival separated them."}, {"type": "paragraph", "text": "Afterward, she set out to sea with Smoker, chasing after Zoro and the rest of the Straw Hat crew and eventually reaching Alabasta."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cd/Tashigi_Witnesses_Zoro%27s_Luck.png/revision/latest/scale-to-width-down/210?cb=20151024170923", "caption": "Tashigi, after witnessing Zoro's \"Luck versus Curse\"."}]}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "During their journey, Tashigi and Smoker captured Mr. 11 and uncovered some information about Baroque Works."}, {"type": "paragraph", "text": "After the Straw Hat Pirates escaped from Nanohana, Smoker was concerned by the fact that he recognized the princess of Alabasta among them. He expressed his contempt for the Shichibukai, telling Tashigi that tigers never change their stripes—once a pirate, always a pirate."}, {"type": "paragraph", "text": "At a bar in Rainbase, Luffy and Usopp bumped into Smoker and Tashigi. She paid for the water that the pirates ran out with."}, {"type": "paragraph", "text": "She encountered Zoro again in Rainbase and demanded a rematch, but all they managed before he escaped was a brief argument. Later, she dropped her glasses, and when Chopper retrieved them, she thanked him without realizing he was a pirate (or a reindeer)."}, {"type": "paragraph", "text": "Smoker told Tashigi to go straight to Alubarna by herself and to follow her own justice there. He asked her to watch closely how the place would end up, particularly whether it got destroyed or not, and then drove away."}, {"type": "paragraph", "text": "Nico Robin, taking Cobra as hostage, encountered a group of Marines with Tashigi at the lead. When they refused to get out of Robin's way, she started to threaten them but was interrupted by Tashigi. Robin said that she had no choice but to kill them, but Cobra asked them not to worry about him and instead try to stop the bomb that would be detonated seven minutes later."}, {"type": "paragraph", "text": "Tashigi assured him that they would save him and stop the bomb, but Robin incapacitated the group of Marines with her power. After seeing her devil fruit power, a Marine realized that she was Nico Robin, the girl who sank 6 Marine ships at age 8 and had a bounty of 79,000,000. Robin was starting to lose her patience when Tashigi sent her men to go stop the bomb. Facing Robin alone, Tashigi was quickly defeated when the former used some arms to point Shigure at the latter's throat and then broke her leg. Soon after, Crocodile came across the defeated Tashigi and insulted the Marines' sense of justice before continuing on."}, {"type": "paragraph", "text": "Tashigi tried to help the Straw Hats find the bomb. In the end, Pell sacrificed himself to save the city and took the bomb to the sky, where it exploded. Even from far above Alubarna, the bomb's blast radius reached the fighting armies below and blew most of them off their feet, including Tashigi and Usopp."}, {"type": "paragraph", "text": "Crocodile suddenly fell from the sky, followed by the first rain the country had seen in years. Tashigi and the Marines found the unconscious Shichibukai. Tashigi revoked his title and promptly arrested him for his crimes against the World Government."}, {"type": "paragraph", "text": "Torn between her duties as a Marine and recognition of the Straw Hats merit, Tashigi ordered her subordinates to not arrest the crew while they were unconscious in the middle of the street. When Tashigi rejoined Smoker and Hina and reported her failure to apprehend the Straw Hat Pirates, she started crying and blaming herself for being too weak to do anything more than support the criminals. Smoker told her to try to get stronger."}, {"type": "paragraph", "text": "She and Smoker were each granted a promotion by the World Government, despite Smoker's objections."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6c/Robin_Grabs_Tashigi.png/revision/latest/scale-to-width-down/210?cb=20130123232402", "caption": "Tashigi is defeated by Nico Robin."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Tashigi appeared again after receiving word of the Straw Hats' ordeal at Enies Lobby. She tried to relay the news to Smoker but directed her words at the wrong Marine because she wasn't wearing her glasses."}, {"type": "paragraph", "text": "Smoker told Tashigi that what they really needed was status; he also noted that pirates worldwide had started to recognize the Straw Hats. He decided to stake his pride on crushing them in the New World."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Tashigi reported to Marineford when summoned as reinforcement."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Smoker_Tashigi_Marineford.png/revision/latest/scale-to-width-down/210?cb=20130224105709", "caption": "Tashigi with her superior, Smoker, arriving at Marineford."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three hours before Ace's execution, she was seen listening to Sengoku's speech about Ace's past."}, {"type": "paragraph", "text": "She was shocked by Luffy's arrival at Marineford and immediately decided to alert Smoker to this new factor in the war against the Whitebeard Pirates. As Luffy was charging toward the execution platform, Tashigi attempted to fight him, but Smoker got to him first."}, {"type": "paragraph", "text": "As Sengoku started putting the final phase of his plan into motion, Tashigi and Smoker retreated to the plaza."}, {"type": "paragraph", "text": "Tashigi witnessed a Marine seeking help for his wounded comrade only to be told to leave the fallen and to continue on with the fight. Tashigi thought to herself that even after the Marines completed their goal, they would not stop."}, {"type": "paragraph", "text": "After Shanks arrived, she stood down with the other Marines."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "When Tashigi and Smoker were first transferred to the G-5 base, Vergo was seen telling them that the soldiers were rowdy and not too bright, but that overall, they were good people."}, {"type": "paragraph", "text": "A soldier told her about how Vergo would sometimes leave suddenly to go home and care for his sick sister. She remembered talking to the vice admiral about a kidnapping case that he insisted was a false claim; he said that the parents were in denial and holding onto the false hope that their children were kidnapped rather than dead."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Tashigi and Smoker (having been promoted to captain and vice admiral respectively) are now in charge of G-5. Near the Red Line, they were seen fighting multiple pirate ships that emerged from the sea. Tashigi used her sword to expertly redirect an incoming cannon ball, which subsequently blew up a ways away from the ship."}, {"type": "paragraph", "text": "Two subordinates cheered for her. She tried to berate them for messing around but ended up berating the ship's mast because her glasses were on her forehead and not in front of her eyes. She loudly scolded the men for disrespecting her just because she's a woman. Smoker told her to shut up and stop interrupting his interrogation but then berated the subordinates for staring at her instead of taking the situation more seriously."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "After learning that the Straw Hats were heading to Punk Hazard by intercepting a distress call with a black Den Den Mushi, Tashigi and Smoker decided to go there as well."}, {"type": "paragraph", "text": "After arriving on the winter side of the island, they approached the PH-006 building. They were greeted by the Royal Shichibukai Trafalgar Law. As Smoker and Law discussed the possible presence of the Straw Hat Pirates on the island, several Straw Hats accompanied giant children burst out of the building and encountered Law and the G-5 Marines, surprising absolutely everyone involved. The Straw Hats and the children went back the way they came. Tashigi was about to give chase, but Law stood in their way, saying that he would not allow them to leave the island. Law turned their battleship into performance art and abducted all of their Den Den Mushi."}, {"type": "paragraph", "text": "Tashigi attempted to attack Law despite Smoker's warning that her Haki was not strong enough to defeat Law. When her attack backfired, Law chopped the captain and her Shigure in half. Tashigi expressed her shame at being cut but not dying, but Law told her that the weak cannot even choose how they die, causing her to bite her lip in shame. Using one arm to support her severed upper body, Tashigi's torso tried to attack Law yet again, but her amputated katana could not reach him. Law was about to attack her again when Smoker stepped in and deflected the attack with his jitte. While Smoker battled Law, the other G-5 Marines grabbed both halves of Tashigi and fled Law's \"Room.\" While the Marines were wondering why a Shichibukai would attack fellow allies of the World government, Tashigi herself recalled what Smoker once said to her: that pirates will always be pirates. Her subordinates then stuck the captain's two halves back together."}, {"type": "paragraph", "text": "When she returned to the scene of the battle, Tashigi was horrified to see Smoker lying unconscious and defeated on the ground. She noticed a hole in his chest and realized that his heart was stolen by Law, just like he had stolen the hearts of a hundred pirates in exchange for Shichibukai status. Enraged, she tried to attack Law again, but he responded by using Shambles to put her mind in Smoker's body and vice versa, after which she and Smoker were brought to safety in a nearby cave. When they regained consciousness, Tashigi told Smoker about a series of reports about children dying in accidents and presented her theory that these were actually kidnappings being covered up by a fellow Marine."}, {"type": "paragraph", "text": "Later on, Tashigi, Smoker, and the other G-5 Marines fought some centaurs and satyrs. Tashigi compared their appearances to some wanted posters and recognized many of them as infamous pirates who had been captured. She asked Smoker how that was possible when the survivor count of the Punk Hazard incident was zero. Smoker didn't understand either but told her that they needed to report all this."}, {"type": "paragraph", "text": "Still in Smoker's body, Tashigi was seen fighting alongside Smoker and the G-5 Marines in an attempt to break through the front of the research facility. She used Smoker's Devil Fruit powers but was too inexperienced to make them work properly. She later observed Luffy, Robin, and Franky flying through the air towards the facility. Tashigi rashly confronted Luffy and managed to use the Devil Fruit powers to attack him, but he easily dodged. Tashigi was excited that she was able to control the powers in the first place, but as a result, Luffy caught her off guard and pinned her to the ground."}, {"type": "paragraph", "text": "Later in the battle, pieces of slime started falling from the sky onto the battlefield. Tashigi watched in horror as the slime exploded after some of her subordinates tried to burn it. As the slime continued throwing itself over the lake, Tashigi suggested to Smoker that they should find some place with a roof. Tashigi, Smoker, and the other Marines were shocked when Luffy suddenly grabbed Caesar Clown. When Luffy suddenly collapsed at the end of the fight, Tashigi was surprised at the outcome. Tashigi, Smoker, Franky, and Robin later fell victim to the same treatment: Caesar was suffocating them with his Devil Fruit abilities."}, {"type": "paragraph", "text": "She was then locked up in a cell with Smoker, Luffy, Franky, Robin, and Law. Having learned the truth about Vergo, she asked Smoker what to do about the pain of having her trust broken. Smoker just told her that her suspicions were spot on. She listened in as Law revealed that Joker is Doflamingo."}, {"type": "paragraph", "text": "While Caesar was broadcasting his experiment with the chemical weapon to underworld brokers, Tashigi was seen sitting with Robin, Franky, Law, Smoker and Luffy. After witnessing the devastating effects of the poison cloud that Smiley released, Caesar proceeded to move the cage outside of the facility so that the captives would fall victim as well."}, {"type": "paragraph", "text": "Tashigi watched as Law initiated their escape plan, directing Franky to launch his Franky Fireball at the remains of the battleship down below. The resulting smoke obscured Caesar's view of the cage, allowing them to discreetly take action. Law revealed that he had replaced some of the Seastone handcuffs with regular ones so that he could escape easily if necessary. After freeing Luffy and the others, Law returned Smoker and Tashigi to their original bodies and offered to spare their lives in return for their cooperation. Tashigi begged Law to take off her chains. Smoker berated Tashigi for giving in to a pirate, but she countered him by saying that they had to live in order to protect their soldiers, bring Vergo to justice, and rescue the children. Law chimed in to remark that she seemed to be smarter than Smoker, since she understood the situation better than him. Smoker begrudgingly admitted that he was wrong and decided to hear Law out. Shortly after Law undid their chains, Tashigi fixed her hair and shot a puffy glare at Smoker, annoyed that he had worn her shirt unbuttoned and smoked so much in her body."}, {"type": "paragraph", "text": "Law then teleported them into the facility using his power. They opened the shutters, allowing the Marines outside to escape from the incoming poisonous gas."}, {"type": "paragraph", "text": "Once everyone was back together, Law told Smoker and Tashigi not to get in his and Luffy's way. He then revealed a safe exit route but warned everyone that he could not guarantee their safety after two hours. Everybody split up, and Tashigi wanted to go with Smoker to confront Vergo, but Smoker ordered her to look after the G-5 Marines and help everyone escape. Tashigi agreed to follow his order."}, {"type": "paragraph", "text": "The G-5 Marines attempted to capture the Straw Hats but were abruptly repelled by Zoro, Kin'emon, and Brook as they cut through the shutter and barged in. Tashigi was not happy to see Zoro again, but she told her subordinates that they should forget about capturing the Straw Hats for now, as their priority should be reaching the passageway to Building B before Caesar could close it off. After Caesar's minions used a cannon to blow a hole on Building A, the gas started flowing inside. The Straw Hats, Brownbeard, and most of the G-5 Marines managed to pass through the gate to Building B before it closed. Tashigi was thrown to the other side of the gate by some of her fellow Marines. After one of her men told them that they saved her, Tashigi looked through a narrow gap between the doors and was horrified to see that the Marine soldiers left in Building A had been petrified, preserving their thumbs-ups and victory signs."}, {"type": "paragraph", "text": "After mourning the loss of her G-5 comrades, she took the lead toward the escape route. Her subordinates were delighted to see Vergo appear in Building B, unaware of his treachery. Tashigi warned them that he was not what he seemed to be. Vergo attacked and defeated a large number of G-5 Marines before aiming for Tashigi. Sanji suddenly rushed in and saved her before telling her and the other G-5 to retreat to Building C; at the same time, the Building A gate opened, allowing gas to flow into the passageway. While Sanji held Vergo back, Tashigi and her subordinates quickly escaped to Building C as the gate between B and C started to close. Sanji managed to escape before the gate completely shut. He reveals to the Marines that Vergo had suddenly run away from the battle. Even though Tashigi already knew the truth about Vergo, she let her subordinates continue believing that the Vergo they had just encountered was an impostor."}, {"type": "paragraph", "text": "Hot on the trail of the other group trying to escape, the remaining Marines and Sanji headed toward the Biscuit Room after an explosion allowed the gas to start flowing into Building C."}, {"type": "paragraph", "text": "When Tashigi and her group arrived at the Biscuit Room, they managed to swiftly seal off the door to the room, preventing the gas from entering and gaining some time. Once Monet learned that the Marines were also trying to save the children, she got mad and viciously attacked them, biting off a Marine's shoulder in the process. Tashigi attacked Monet with a Haki-imbued slice to prevent her from harming anyone else. Tashigi ordered the Marines to catch up with the children and declared that she would stay behind to fight Monet even though Zoro happened to be there fighting Monet already."}, {"type": "paragraph", "text": "Tashigi and Zoro began to argue over his dismissive treatment of Monet and apparent reluctance to cut her, which Tashigi felt was rooted in sexism. After Zoro got so annoyed by her accusations that he decided to sit down and let her take care of the harpy, Tashigi began to battle Monet. She initially avoided all of Monet's attacks by using Soru and her blocking skills, but Monet used a blinding technique called \"Blizzard\" to catch the captain. She bit down hard into Tashigi's shoulder and attempted to rip it off. After remembering what Monet did to her subordinate, Tashigi cleverly held Monet's head down as a means to stop her from pulling her shoulder off. Monet continued to bite down harder and harder until Zoro stepped in and gave her a cut on the cheek."}, {"type": "paragraph", "text": "Tashigi watched as Zoro cut Monet in half, shocked at his sudden outburst. She soon realized that he had not used Haki when cutting Monet and noted the immense fear he had caused the harpy. She pondered the fact that he won the battle with fear alone and wondered just how strong he and the other Straw Hats had become over the last two years. Her thoughts were interrupted when Monet finally got up and attempted to stab Zoro in the back. Tashigi swiftly finished Monet off with a slash to the back. Shortly afterwards, she berated Zoro for not dealing the finishing blow to Monet when he had the chance but once again got irritated with him when he told her that he would have cut Monet if Tashigi hadn't. Zoro proceeded to give her a patronizing congratulations and promised to let her have the credit, which really ticked her off. When she asked Zoro why he insisted on looking down on her, he responded by saying that she was indeed below him, much to her annoyance."}, {"type": "paragraph", "text": "After the battle, Zoro carried the injured Tashigi over his shoulder despite her embarrassment and complaints. While being carried, she noticed that he was carrying Shusui and got excited about it, but Zoro didn't care. They soon reunited with their respective groups, at which point she demanded that he put her down before her subordinates saw her."}, {"type": "paragraph", "text": "Once everyone reached Building R safety, they boarded a rail cart and made their escape. With Nami's assistance, they arrived outside, and Tashigi, Nami, and Robin seemed unimpressed by General Franky."}, {"type": "paragraph", "text": "Some time after the defeat of Baby 5 and Buffalo and the capture of Caesar Clown, Tashigi tearfully asked Nami to let her take care of the children. Wishing the best for them, Nami accepted her offer, and a relieved Tashigi went inside the tanker where the children were staying after Law treated them. She declared that the Marines would take care of them from that point on, much to the children's disappointment; they wanted to stay with the Straw Hats a little more. Tashigi was later seen participating in the banquet along with the pirates, the other Marines, and Caesar Clown's former henchmen, smiling as the children played with her."}, {"type": "paragraph", "text": "When preparing to depart with the children, Tashigi was visibly shocked when her subordinates began insulting the pirates in front of the children while singing praises of the Marines. She scolded them for their shameful behavior. However, she laughed when the soldiers revealed that they had to rely on exaggerated insults if they didn't want to end up liking these pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Tashigi_Cut_by_Law.png/revision/latest/scale-to-width-down/210?cb=20140916074529", "caption": "Tashigi cut in half by Trafalgar Law."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Tashigi_in_Smoker%27s_Body.png/revision/latest/scale-to-width-down/210?cb=20130331093453", "caption": "Tashigi in Smoker's body."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/50/Punk_Hazard_Counter_Attack_Begins.png/revision/latest/scale-to-width-down/210?cb=20190829214730", "caption": "The counter attack begins."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Vergo_vs_Tashigi.png/revision/latest/scale-to-width-down/210?cb=20130801025123", "caption": "Tashigi knocked down by Vergo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/15/Tashigi_Defeats_Monet.png/revision/latest/scale-to-width-down/210?cb=20141022222621", "caption": "Tashigi dealing the finishing blow to Monet."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Tashigi_Bowing_to_Nami.png/revision/latest/scale-to-width-down/210?cb=20150529060732", "caption": "Tashigi asks Nami to let her take care of the children."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat at Dressrosa, Tashigi and Smoker received the news of Luffy and Law's exploits and were pleased that Issho did not allow the incident at Dressrosa to be covered up like the one at Alabasta. Tashigi also informed the children from Punk Hazard that they would see Vegapunk in a few days."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 3, "content": [{"type": "paragraph", "text": "Tashigi and Smoker went to Delta Island to attend the Pirates Expo undercover."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tashigi vs. Billy (novel)", "elements": []}, {"text": "Tashigi vs. Koze and Packy", "elements": []}, {"text": "Tashigi vs. Roronoa Zoro", "elements": []}, {"text": "Tashigi vs. Mr. 11 (unseen)", "elements": []}, {"text": "Tashigi vs. Miss All Sunday", "elements": []}, {"text": "Tashigi and Smoker vs. unnamed pirate with a bounty of 50,000,000 (not seen)", "elements": []}, {"text": "Marines vs. Whitebeard Pirates and their allies", "elements": []}, {"text": "G-5 Unit 01 Marines vs. the pirates formerly enslaved by the New Fish-Man Pirates", "elements": []}, {"text": "G-5 Unit 01 Marines vs. Trafalgar D. Water Law", "elements": []}, {"text": "G-5 Unit 01 Marines vs. centaurs and satyrs", "elements": []}, {"text": "Tashigi (in Smoker's body) vs. Monkey D. Luffy", "elements": []}, {"text": "Tashigi (in Smoker's body), Smoker (in Tashigi's body), Nico Robin, and Franky vs. Caesar Clown (unseen)", "elements": []}, {"text": "Tashigi vs. Vergo", "elements": []}, {"text": "Tashigi and Roronoa Zoro vs. Monet", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Like Kuina, her name comes from a flightless bird. The fact she is named after a flightless bird is a reflection of herself. In regards to the bird itself, Oda stated though a bird cannot fly, it does not mean it never will."}, {"type": "paragraph", "text": "The Viz Manga gives her the rank of Sergeant, while the Funimation dub gives her the rank of Sergeant-Major."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Tashigi has been portrayed in many forms of merchandise. She was also featured in the series of models Portrait of Pirates."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "Grand Battle!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "Treasure Battle!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "Set Sail Pirate Crew!", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Grand Battle 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Legend of the Rainbow Island", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the 6th Japanese fan poll, Tashigi was ranked as the 33rd most popular character, sharing the spot with Smoker.", "elements": []}, {"text": "A fan once inquired about Tashigi's glasses, as she seems nearsighted but lifts her glasses to look closely at a sword and was seen running without glasses. The reader asked if the glasses were for show. Oda stated that she does need them.", "elements": []}, {"text": "In Japan, the act of taking another's sword is seen as a strong statement that implies the wielder was not worthy of the blade, and Tashigi is doing this by taking the blades from criminals.", "elements": []}, {"text": "Tashigi and Kuina are both voiced by Monica Rial in the FUNimation dub.", "elements": []}, {"text": "So far, Yamaoroshi and Kashu are the only swords known to have been taken from their previous owners by Tashigi.", "elements": []}, {"text": "Tashigi was the second female Marine shown in the series, with the retired and deceased Bell-mère being the first.", "elements": []}, {"text": "Along with Smoker, Tashigi has appeared in more sagas than any other characters outside the Straw Hat Pirates.", "elements": []}, {"text": "In One Piece: Pirate Warriors 3, Tashigi's taunt action allows her to remove or put on her glasses. When her glasses are off, the screen becomes blurry with a heavy depth of field effect.", "elements": []}, {"text": "It is unknown whether if this is a mistake or not, as Tashigi was supposed to be a Warrant Officer after the Alabasta Arc instead of being Ensign in the Marine Ranks itself. In the anime, it is said that Tashigi was promoted by one rank, the same as Smoker. However, Tashigi presumably received a two rank promotion after that incident, from Master Chief Petty Officer to Ensign.", "elements": []}, {"text": "Tashigi's favorite food is hot coffee.", "elements": []}]}], "images": []}]}