{"sections": [{"title": "Koby", "level": 1, "content": [{"type": "paragraph", "text": "Koby is a Marine Rear Admiral who trained together with Helmeppo under Vice Admiral Garp's supervision. He is currently a member of the Marine special forces unit SWORD."}, {"type": "paragraph", "text": "He was formerly an involuntary pirate ship caretaker for the Alvida Pirates until he was liberated by Luffy, and he was the first person Luffy befriended on his travels."}, {"type": "paragraph", "text": "He and Helmeppo are also the central characters from Diary of Koby-Meppo Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "In his first appearance, Koby was a small, timid, chubby boy with pink hair and round-frame glasses."}, {"type": "paragraph", "text": "Due to the passage of time and Garp's training, Koby has grown thinner and taller, standing close to Luffy in height. He has also gained a cross-shaped scar above his right eye, presumably earned under Garp's heavy-handed tutelage. His hair has grown longer and shaggier since his growth spurt, but it has retained its pink color."}, {"type": "paragraph", "text": "Koby wears a standard-issue Marine jacket, pants, and neckerchief as well as a brightly patterned bandanna worn tied across his forehead. Koby's glasses are still present, but he has adopted the habit of wearing them pushed up on his forehead, occasionally using them for reading."}, {"type": "paragraph", "text": "After the timeskip, Koby has grown even taller, reaching Garp's shoulders. He now wears a scarf, a senior officer's Marine coat with the word \"justice\" on it, a merit on his jacket, and a new bandanna. The scar on his forehead also has grown wider."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Koby was first introduced as the Alvida Pirates' hapless ship caretaker who lived in fear of both the ship's crew and captain. Two years of forced servitude had robbed him of all hope of escaping as well as his dream of becoming a Marine, leaving him with few goals other than avoiding being bludgeoned to death by Alvida's iron mace. Luffy was less than impressed with Koby's cowardice, describing him as \"pretty stupid and useless...and kinda wimpy too\". However, Luffy's boundless optimism and single-minded pursuit of his dream rekindled a similar conviction in the downtrodden ship caretaker, allowing him to defy his captors, even under the threat of a brutal death by Alvida's mace."}, {"type": "paragraph", "text": "As the pair continued in their travels, Koby remained timid and cautious, often relying on Luffy to perform dangerous tasks and becoming alarmed by his companion's reckless behavior."}, {"type": "paragraph", "text": "He was also shown to be perceptive, noting that it was \"strange\" for the citizens of Shells Town to be afraid of a Marine Captain and telling Luffy that he had \"a bad feeling about this.\" Koby's naïve belief in the blanket integrity of the Marines was dashed when he witnessed the actions of Axe-Hand Morgan and his son, but it only strengthened his resolve to become, in his words, \"a real Marine.\""}, {"type": "paragraph", "text": "Under Garp's instruction, Koby's timidity has been replaced with confidence, although he remains polite, self-effacing, and apologetic if he feels he has done something overly ambitious (such as publicly stating his goal to become a Marine admiral). He continues to be an emotional, compassionate person who can easily be driven to tears for a variety of reasons, which led to Zoro jocularly calling him a \"crybaby\" during their reunion at Water 7."}, {"type": "paragraph", "text": "Koby does not act with the reckless bravery that many characters in the series exhibit, but rather on moral compunction. He has put his life on the line at least twice for the sake of what he feels is right, most notably at the Battle of Marineford where he brought fighting to a standstill by facing down Admiral Akainu and bought the precious seconds needed for Luffy to escape."}, {"type": "paragraph", "text": "For all he has done and is capable of doing, Koby is rather humble, as he denied Kyros' claim of him being a hero during the Rocky Port Incident and did not claim credit for stopping a torpedo that was aiming at the Dressrosa and Prodence Kingdom ships."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Garp is the mentor/instructor of Koby and Helmeppo; he keeps them out of trouble and ensures that they are not slacking off. If they do get out of hand, he knocks them around to ensure they know their place. Koby admires Garp, even though he maintains a highly brutal clutch on him because he would not be where he is without him. Garp was horrified when Koby shouted out to stop the massacre at Marineford during the Whitebeard War."}], "images": []}, {"title": "Helmeppo", "level": 4, "content": [{"type": "paragraph", "text": "After his father was kicked out of the Marines, Helmeppo lost access to the luxurious life that he once held under his father's rank. He was forced to become a chore boy alongside Koby, and despite Koby's good-natured attempts to befriend him, he refused any of it. After being kidnapped by his own father and held hostage, Helmeppo disowned his father and started changing, becoming braver and less of a spoiled brat. Eventually, Koby and Helmeppo become good friends. Now they are working together. In addition, Helmeppo seems to care for Koby, and he rushed to help him after being defeated by Luffy."}], "images": []}, {"title": "Sakazuki", "level": 4, "content": [{"type": "paragraph", "text": "Koby seemed to have a great fear of Fleet Admiral Sakazuki. He and Helmeppo were terrified to witness Sakazuki executing a fellow marine for abandoning his post. Also, after Koby’s speech, Sakazuki tried to kill him, which caused Koby to fear him even more. This incident did not affect Koby's standing in the Marines since he was promoted to the rank of Captain after Akainu became Fleet Admiral."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Koby was one of the first people Luffy met on his journey. He traveled briefly with Luffy, acting as a temporary navigator after Luffy helped him escape from his servitude to Alvida. He later joined the Marines after the incident with Captain Morgan. The two also encountered each other at Water 7. Although they are now on opposite sides and will inevitably have to fight, Koby and Luffy still consider each other friends, since Luffy helped Koby muster up the courage to become a Marine."}, {"type": "paragraph", "text": "They were both happy to see each other again at Water 7 though he was surprised to learn of Luffy's father. However, during the Battle at Marineford, Koby chose to fight Luffy only to be swiftly defeated by a punch to the face. Despite that, this has not damaged their friendship, as Koby still admires Luffy's strength."}], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Koby also met Zoro while he was imprisoned in Captain Morgan’s Marine base. At first, Koby was afraid of Zoro’s bad reputation. However, after finding out Zoro had a kind personality, Koby started to admire him. Both of them were glad to see each other again at Water 7. However, Zoro acknowledged that Koby was better friends with Luffy than with himself."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Alvida Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Koby was forced to serve as a chore boy under Alvida and her crew for two years after he accidentally boarded their ship. Because of his cowardice, he would do whatever he was ordered to do without question. He was often mocked by the pirates in Alvida's crew. Alvida would often ask Koby who was the most beautiful woman in the world and, if he didn’t reply that she was, he would be punished. When Luffy showed up, he explained to Koby that he was willing to die for his dream. After Koby realized that he should also be willing to die for his dream, he found the courage to openly defy Alvida and express his true feelings towards her. This angered Alvida, and she was about to kill Koby, but Luffy stepped in and quickly defeated her."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "In his first appearance, Koby lacked any fighting skills. According to Alvida, the only reason she kept him around was because he happened to be good at navigation. He gained some fighting skills when he trained alongside Helmeppo under Vice Admiral Monkey D. Garp."}, {"type": "paragraph", "text": "After two years, he reached the rank of Captain and later Rear Admiral. As a Marine rear admiral, he has command over the lower-ranking Marines and is in charge of his own ship."}, {"type": "paragraph", "text": "He has some knowledge of swordsmanship, as he was seen practicing with Helmeppo and Bogard."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Due to his harsh training regime under Garp as well as further training after two years, Koby possesses immense physical strength and speed. He has shown himself to be an excellent swimmer. He can move incredibly fast even when underwater, as he caught up to a torpedo within seconds. With his strength, he was capable of redirecting the large torpedo underwater with his bare hands."}, {"type": "paragraph", "text": "In Episode of Luffy, he shattered a gigantic metal disk with a single punch and performed Rokushiki techniques with great ease."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2f/Koby%27s_New_Strength.png/revision/latest/scale-to-width-down/210?cb=20121228151411", "caption": "Koby cracks a huge metal disk with a single punch."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "During the Battle of Marineford, Koby awakened an ability known as Kenbunshoku Haki. Koby was shown hunched over and crying intensely on the battlefield, saying that the voices in his head were disappearing one by one as the combatants around him were slain, much like what Aisa felt during the Skypiea Arc."}, {"type": "paragraph", "text": "After the timeskip, Koby has developed his Kenbunshoku Haki to the point that it is on a very advanced level. He was able to notice a torpedo heading toward the Dressrosa-Prodence Kingdom ship underwater from his own ship a ways off, which shocked Helmeppo, as he did not notice the torpedo despite having Kenbunshoku Haki as well. On top of that, Koby also managed to sense Kyros's great strength even though he just met him."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Since his training with Garp, Koby has become strong enough to use at least one of the Rokushiki, the Soru technique. He has used Soru against Luffy twice: once at Water 7 and once at the Battle of Marineford, although the technique did not help him win either fight."}, {"type": "paragraph", "text": "In One Piece: Gigant Battle! 2 New World he is also capable of using the Geppo and Rankyaku techniques."}, {"type": "paragraph", "text": "After the timeskip, Koby has mastered his Rokushiki techniques. In Episode of Luffy, he shows to be able to use a technique similar to Rankyaku, but is done with his arms."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Koby had intended to board a ship for a fishing trip one day, but he got on the wrong ship and ended up with the Alvida Pirates. To stay alive, Koby put himself in servitude to the crew. He harbored dreams of escaping and becoming a Marine, and worked on building an escape boat for two years."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Koby_Getting_on_Wrong_Boat.png/revision/latest/scale-to-width-down/210?cb=20130117224250", "caption": "Koby getting on the wrong boat."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Romance Dawn Arc", "level": 4, "content": [{"type": "paragraph", "text": "Koby was onboard the Miss Love Duck as Alvida beat around her crew members for leaving the ship dirty. She kicked him around as well before telling him to go clean the wash room. Koby discovered a barrel that had washed ashore on Goat Island and rolled it to a storeroom, thinking it was full of sake. His crewmates prepared to start drinking when Monkey D. Luffy suddenly burst out of the barrel. Alvida heard the commotion and threw her mace at the storehouse, and Koby chased after Luffy as he was sent tumbling away by the impact."}, {"type": "paragraph", "text": "Luffy asked Koby for a boat, and Koby presented him with his self-made boat, saying he did not have the courage to escape on it. Luffy was not impressed with Koby, telling him about his dream to become Pirate King and his lack of fear of dying in his quest. Koby was very impressed with Luffy's resolve and began talking about his own dream, but Alvida suddenly came in and smashed his boat with her mace. Thinking Koby had hired Luffy to capture her, Alvida gave him one last chance to say she was beautiful, only for Luffy to insult her offhandedly. As he remembered Luffy's resolve, Koby threw away his fear of death and insulted Alvida as well. He stood firm as the enraged Alvida prepared to kill him, but Luffy suddenly jumped in front of Koby as he took Alvida's mace without being harmed and defeated her with a single punch. Luffy then told the Alvida Pirates to get him and Koby a boat, to which they complied."}, {"type": "paragraph", "text": "As they set off to sea, Koby was concerned about what Luffy's fate in the Grand Line would be, and Luffy said he would recruit a strong crew starting with the bounty hunter Roronoa Zoro. This shocked Koby, who believed Zoro was a bloodthirsty criminal. The duo reached the Marine base where Zoro was being held prisoner, and prepared to part ways after eating at a restaurant. The other customers recoiled in shock when Luffy mentioned Zoro, but to Koby's surprise they also recoiled after he mentioned Morgan, the captain of the Marine base. The two then went to the Marine base and looked for Zoro, and Koby became fearful upon finding him. When Zoro asked for Luffy to free him, Koby discouraged Luffy out of fear for his safety, but Luffy ignored him. However, a girl named Rika suddenly climbed up next to Koby and Luffy, and the two watched as she tried feeding Zoro some rice balls, only to be caught by Morgan's son Helmeppo and thrown out. Koby tended to Rika while Luffy went to Zoro, and after Luffy came back, they went into the village and Rika told them about how Zoro was unjustly imprisoned by Helmeppo and Morgan."}, {"type": "paragraph", "text": "Helmeppo then came into the village, mentioning to Luffy how he planned to execute Zoro in three days despite giving Zoro a chance at freedom, and Koby watched as Luffy punched him for dishonestly imprisoning Zoro. Koby held Luffy back from attacking Helmeppo further, and grew worried as Helmeppo went away and promised revenge. Luffy went to go recruit Zoro, and a little while later, Koby went to free Zoro because he wanted to uphold real justice as a Marine. He was shot in the shoulder by a Marine, but decided to stay and continue freeing Zoro. Koby revealed Helmeppo's deception to Zoro and said that Luffy had attacked Helmeppo because of this. Suddenly, the two of them were surrounded by Marines."}, {"type": "paragraph", "text": "The Marines shot at Koby and Zoro, but they were suddenly shielded by Luffy, whose rubber body shot the bullets back, and Koby fainted after seeing this. He came to soon afterward, only to see the Marines charging at them with swords. However, Luffy freed Zoro and the two pirates took out the Marines. As Luffy fought Morgan, Koby called for him to defeat the Marines, and was shocked as Morgans sliced an entire fence in two with his axe hand. Koby watched as Luffy overwhelmed Morgan, but he was held at gunpoint by Helmeppo in an attempt to stop Luffy. Koby said he was not afraid of death, and watched as Luffy punched Helmeppo while Zoro struck Morgan down. To Koby's surprise, the Marines then celebrated their captain's defeat."}, {"type": "paragraph", "text": "Koby, Luffy, and Zoro then went to Rika's mother's restaurant, and Koby reflected that Luffy and Zoro were the first friends he made. The Marines then came in and asked Luffy and Zoro to leave the island since they were pirates, and they asked if Koby was with them. Koby denied it, but Luffy started telling the Marines about his past with Alvida. This caused Koby to punch Luffy and the two to get into a fight, but as they were broken up Koby knew that Luffy did that to distance the two of them and allow him to join the Marines. He then asked to join the Marines, and although they were aware of his past, they agreed to his request. As Luffy and Zoro prepared to sail away, Koby came and saluted them in thanks, and to his surprise he was joined by the rest of the Marines as they thanked Luffy and Zoro for their actions."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Luffy_vs._Koby.png/revision/latest/scale-to-width-down/210?cb=20130308222540", "caption": "Luffy attacks Koby."}]}, {"title": "Diary of Koby-Meppo", "level": 3, "content": [{"type": "paragraph", "text": "After joining the Marines, Koby and Helmeppo started out as Marine chore boys at the 153rd Branch in Shells Town. The two were later tasked with chore duty on a ship transferring the prisoner Morgan. As Vice Admiral Garp was taking Morgan into his custody, Morgan caught Garp off-guard and slashed him before taking Helmeppo hostage. Morgan fled on a small boat with his hostage and the Marines prepared to fire on the small vessel. However, Koby, not willing to let them kill his friend, scared them away with a gun. Bogard sliced Koby's guns into pieces, but Garp stepped in before the two could continue fighting. Though Morgan escaped, the bravery shown by the two earned them the attention of Garp, who took the two under his wing as pupils. Koby and Helmeppo accompanied the vice admiral to Marineford to train under him."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Koby went to Water 7 alongside Helmeppo when Garp paid Luffy a visit. On the vice admiral's order, Helmeppo charged at Zoro while Koby attacked Luffy. Both he and Helmeppo were easily beaten after a brief skirmish. Koby cheerfully admitted defeat and reintroduced himself to Luffy and Zoro, asking if they remembered him. Although the Straw Hat captain initially had trouble recognizing Koby due to his growth spurt, the trio were happily reunited. Koby, like the Straw Hat crew and the rest of Garp's men, was shocked when the vice admiral revealed that the revolutionary Dragon is his son and Luffy's father."}, {"type": "paragraph", "text": "After some time, Zoro went back inside with the other Straw Hats, leaving Luffy, Koby, and Helmeppo to sit outside and reminisce about their first meeting and the young marine's journey to the Grand Line. Luffy insisted that the two Marines come in and share a meal with his crew, but Koby declined the invitation, saying that he and Luffy were members of opposing factions and that they should not be too friendly with one another. Before he left, Koby asked Luffy what he knew about the latter half of the Grand Line, which Marines and pirates call \"the New World.\" He requested to meet the Straw Hat captain again in that sea, promising to be strong enough to fight and capture him."}, {"type": "paragraph", "text": "He became so worked up that he accidentally blurted out his dream of becoming an admiral before immediately collapsing in embarrassment. Luffy accepted Koby's ambitious proclamation as a certainty, saying that if the Marine wanted to fight with him in the New World, then he could not be anything other than an admiral. Koby was moved to tears by Luffy's unshakable faith in him and was teased by Zoro for still being a crybaby. Koby and Helmeppo departed, repeating their challenge to the Straw Hats to meet again in the New World."}, {"type": "paragraph", "text": "Koby saw Luffy one more time as he left Water 7 when Garp attacked. He was afraid the vice admiral would sink the Thousand Sunny and its crew, but was relieved when the Straw Hats managed to escape."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f2/Luffy_and_Zoro_Defeat_Koby_and_Helmeppo.png/revision/latest/scale-to-width-down/210?cb=20150430013638", "caption": "Koby and Helmeppo are easily defeated by Luffy and Zoro."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Koby and Helmeppo reported to Marineford to participate in the war against the Whitebeard Pirates, and they were present for Sengoku's speech about Ace's past. After hearing that Ace was Gol D. Roger's son, the two came to a conclusion that Ace and Luffy were not biological brothers."}, {"type": "paragraph", "text": "Frightened by the display of power from both sides and the ensuing bloodshed as the Marines and Whitebeard's forces clash, Koby and Helmeppo ran away. By chance, they crossed paths with Akainu and, from their hiding place behind a wall, witnessed the admiral brutally punishing another Marine for deserting. They later overheard Sengoku's communication with Akainu through the admiral's Den Den Mushi, which revealed the fleet admiral's plan to ignore the schedule and execute Ace right away. It was then that they noticed Luffy's ship falling from the sky. Upon seeing Luffy, Koby was utterly surprised. When Sengoku announced that Luffy is Dragon's son, Koby was shocked that the Fleet Admiral decided to reveal such information."}, {"type": "paragraph", "text": "When Luffy was charging to the execution stand to rescue Ace, Koby blocked his path, determined to fight him. He told himself that, if he cowered away from the situation, he would not be able to improve. His resolve, however, was not enough as Koby was no match for Luffy and was defeated with a single punch. Luffy moved on, leaving Koby unconscious in the middle of the battlefield."}, {"type": "paragraph", "text": "Eventually, Koby woke up, distressed that the war was still raging despite the fact that Portgas D. Ace had been killed by Akainu. The trauma of the battle triggered his own Haki, allowing him to involuntarily sense every human presence nearby on the battlefield (described by Koby as voices inside his head). He was reduced to tears as he listened to the voices of the combatants disappearing one by one as they were killed. As the violence rised to a fever pitch, Koby screamed at the top of his lungs, begging both sides to stop throwing lives away for a war that no longer had any purpose."}, {"type": "paragraph", "text": "The young Marine's cry caused a moment's pause in the battle and inadvertently saved Luffy's life. Kizaru, who was seconds away from destroying Trafalgar Law's submarine, stopped to look at Koby, which gave the Heart Pirates the time needed to submerge and flee from the battlefield with Luffy on board. Akainu, unimpressed, prepared to kill Koby for wasting precious seconds of the battle. The young Marine fearfully steeled himself for death, reassuring himself that he said what he had to say and that he had no regrets."}, {"type": "paragraph", "text": "His life was saved by the sudden arrival of Shanks, who commended the young Marine for his actions, explaining that his few seconds of courage have drastically changed the future of the world. Koby immediately fell unconscious after his timely rescue from an otherwise certain demise."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Koby_and_Helmeppo_at_Marineford.png/revision/latest/scale-to-width-down/210?cb=20140722071224", "caption": "Koby and Helmeppo at Marineford."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/86/Luffy_Defeats_Koby_at_Marineford.png/revision/latest/scale-to-width-down/210?cb=20181110202546", "caption": "Luffy defeats Koby with just one blow."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Shanks_Saves_Koby_From_Akainu.png/revision/latest/scale-to-width-down/210?cb=20130617023848", "caption": "Koby is saved from Akainu by Shanks."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Koby was next seen at Marine Headquarters healing center, surrounded by other injured soldiers and Helmeppo at his bedside. He was still clearly traumatized by the events, saying that he had felt human presences too strongly and that he could not calm down. Doctor Fishbonen told him that what he was feeling was Haki."}, {"type": "paragraph", "text": "Doctor Fishbonen informed Koby that all Marines ranked vice admiral and above have Haki and that Garp should be able to help him. Helmeppo was envious that Koby seemed to have advanced in skill, though Koby claimed to not have known about the ability in the first place."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Koby_Being_Treated_After_the_Battle.png/revision/latest/scale-to-width-down/210?cb=20130524221328", "caption": "Koby at the infirmary while Dr. Fishbonen is checking on him, explaining that his Haki has awakened."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Koby was somehow involved in the Rocky Port Incident that Trafalgar Law was the mastermind of."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "One Piece Film: Z", "level": 4, "content": [{"type": "paragraph", "text": "After Firs Island was destroyed by Z, Koby appeared on a Marine battle ship along with Helmeppo and Garp, who revealed to him the existence of Z. Later, after the destruction of Secon Island, Garp and Sengoku explained to him and Helmeppo about Z's past."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Marine Rookie Arc", "level": 4, "content": [{"type": "paragraph", "text": "Koby was with Garp in his office when the latter received a call from Vice Admiral Prodi, who was angry about the new transfer Grount's actions in his base on Fron Island. After the call, Koby wondered why Grount wanted to be transferred to such a remote area."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "When a pirate crew shot a torpedo at the Dressrosa-Prodence Kingdom convoy to the Levely, Koby swam up to it and redirected its path before jumping on deck and greeting the royals on board. He contacted Helmeppo, who took out the pirates, before talking with Kyros, who commended his actions during the Rocky Port Incident. Koby denied his heroism before Rebecca came bearing news of Luffy. Koby read the news of Luffy's exploits at Totto Land with delight, and tried to mask his admiration of Luffy to Rebecca, but she told him they could talk about it in secret."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the abolishment of the Shichibukai system, Koby headed for Amazon Lily to capture Boa Hancock. On the way, he contacted X Drake via Den Den Mushi and was informed of Kaido and Big Mom's newly formed alliance and CP-0's arrival in Wano Country."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Koby and Helmeppo vs. Bogard", "elements": []}, {"text": "Koby vs. Luffy (Water 7)", "elements": []}, {"text": "Koby vs. Luffy (Marineford)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Koby and Helmeppo vs. Morgan", "elements": []}, {"text": "Koby and Helmeppo vs. Monkey D. Garp", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, a report was published in a newspaper stating that Garp, Koby, and Helmeppo had traversed Reverse Mountain in order to enter the Grand Line. This report was later brought up before Koby by Luffy in a later episode. Upon hearing this report, Koby explained to Luffy that the report was just a cover story in order to hide the secret of how the Marines are able to pass directly through the Calm Belt.", "elements": []}]}, {"type": "list", "elements": [{"text": "Despite this rewrite of the anime's initial mistake, two errors remain:", "elements": [{"text": "Koby and Helmeppo had passed a few sentences about the Reverse Mountain during the adaptation of their mini-series and commented how frightening it had been for them.", "elements": []}, {"text": "Zoro was also surprised by Koby's presence in the Grand Line though he saw the article along with Luffy and the present crew members in the newspaper.", "elements": []}]}]}, {"type": "list", "elements": [{"text": "Also in the manga, Koby got shot in his left shoulder. In the anime, it was left out.", "elements": []}]}, {"type": "list", "elements": [{"text": "In the manga version of Diary of Koby-Meppo, Koby was seen holding guns to keep Marines from shooting Morgan while he was holding Helmeppo hostage right before Bogard sliced the guns into pieces. In the anime version, Koby did not hold any guns and only persuaded the Marines not to shoot Morgan.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A fan once asked why Koby looked so different from his first appearance. According to Oda, Koby just went through a growth spurt and tightened his muscles with discipline (due to Garp's training).", "elements": []}, {"text": "In the 5th fan poll, Koby ranked 37th.", "elements": []}, {"text": "Koby currently holds the record of fastest known promotion through the ranks, from Chore Boy to Rear Admiral in less than three years.", "elements": []}, {"text": "Koby's favorite foods are Rika's onigiri and buttered potatoes.", "elements": []}]}], "images": []}]}