{"sections": [{"title": "Helmeppo", "level": 1, "content": [{"type": "paragraph", "text": "Lieutenant Commander Helmeppo is a Marine officer and the son of disgraced Marine Captain \"Axe-Hand\" Morgan. Once a spoiled child who took advantage of his father's status, he is now a lieutenant commander  who trained with Koby under Vice Admiral Garp."}, {"type": "paragraph", "text": "Due to his actions when he was first introduced, he can be considered a supporting antagonist of the Romance Dawn Arc. He and Koby also are the central characters from Diary of Koby-Meppo Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "When Helmeppo first appeared, he was a skinny and lanky-looking young man with light blonde hair shaped like a sideways oval on top of his head. He also has a cleft chin."}, {"type": "paragraph", "text": "Originally, he wore dark purple uniforms with white shoes and a rubber band ring on his left hand while his father was still in power. After his father Morgan was defeated, he wore a standard marine \"cabin boy\" uniform. After his extensive training with Garp, he started wearing a white shirt with a pale green vest over it, purple pants, black gloves, and a rather odd-looking black visor."}, {"type": "paragraph", "text": "He also now has longer hair tied back into a ponytail as well as having a more muscular appearance compared to his original look."}, {"type": "paragraph", "text": "After the timeskip, Helmeppo wears a hat, junior officer's marine coat, and a scarf. Unlike most other officers however, Helmeppo does not wear his coat as a cape, but puts his arms through the sleeves."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Helmeppo used to be a coward who hid behind his father's wealth and power. He began to shun others and belittle them with the knowledge that his father was greatly feared. Whenever someone disagreed with him he'd threaten to tell his father on them and have them killed. Helmeppo showed that he wasn't as cruel as his father when he became horrified by Morgan's orders to kill a child. Despite this, Helmeppo loved his father and thought he loved him back. His father hits him when Helmeppo asked him to kill Luffy for hitting him, after which Morgan revealed how he thinks of Helmeppo as a worthless son."}, {"type": "paragraph", "text": "He lost his luxurious life that he had under his father's rank after his father was kicked out. He was forced to become a chore boy alongside Koby, whose friendly approaches were turned down. Part of Helmeppo was still loyal to his father which was evident when he was seen crying before his father's execution. However, he later realizes that his father is as brutal and murderous as the pirates he claimed to oppose and disowns him. This finally cut his last tie to his father and pushed him to change, becoming braver and less of a spoiled brat. Eventually he and Koby become good friends."}, {"type": "paragraph", "text": "Helmeppo matures by the events of Water 7, even referring to his younger self as \"that bratty, selfish son who lived off his father's status\". Now a lieutenant commander alongside Koby, he continues his training in the Marines. His appearance has changed, as his hair has grown to his shoulders, and he now wears a visor. He was deeply (and comically) upset when Zoro and Luffy did not recognize him, and seemed equally upset when they did not say goodbye to him either."}, {"type": "paragraph", "text": "Helmeppo seems to be more levelheaded than Koby when it comes down to analyzing situations, as Koby is more aggressive. After the time skip, he has developed a penchant for being overly formal, even with Koby."}], "images": []}, {"title": "Relationship", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Morgan", "level": 4, "content": [{"type": "paragraph", "text": "Helmeppo previously thought that he had a very good relationship with his father Morgan. Before meeting Monkey D. Luffy and Koby, Helmeppo took advantage of his father's position as a tyrannical Marine Captain to act as he pleased, believing his father would back him up should anything threaten or displease him. To his shock, however, when Helmeppo tried to call for his father to get back at Luffy for punching him, Morgan instead smashed his son with the back of his ax-hand for trying to order him around, revealing that he had no fatherly affection for him and even considered Helmeppo a worthless son not worth hitting. Despite this, Helmeppo remained delusional of his relationship with his father and tried to assist him in defeating Luffy by taking Koby hostage. After Morgan was stripped of his rank and incarcerated, he escaped and took his son hostage, at which point Helmeppo finally disowned his father and changed his personality."}], "images": []}, {"title": "Marines", "level": 3, "content": [], "images": []}, {"title": "Monkey D Garp", "level": 4, "content": [{"type": "paragraph", "text": "Garp is the mentor of Helmeppo and Koby. He keeps them out of trouble and ensures that they are not slacking off. If they do get out of hand, he knocks them around to ensure they know their place."}], "images": []}, {"title": "Koby", "level": 4, "content": [{"type": "paragraph", "text": "After his father was kicked out of the Marines, Helmeppo lost access to the luxurious life that he once held under his father's rank. He was forced to become a chore boy alongside Koby, and despite Koby's good-natured attempts to befriend him, he refused any of it. After being kidnapped by his own father and held hostage, Helmeppo disowned his father and started changing, becoming braver and less of a spoiled brat. Eventually, Koby and Helmeppo become good friends. Now they are working together. In addition, Helmeppo seems to care for Koby, and he rushed to help him after being defeated by Luffy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "After a harsh training regimen under Garp, Helmeppo gained great physical prowess. He was able to jump very high while intercepting Zoro."}, {"type": "paragraph", "text": "After the two year timeskip, he became powerful enough to become a lieutenant commander, and overpower an entire pirate crew by himself with great ease."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Helmeppo is considerably skilled in swordsmanship. After the timeskip, his swordsmanship has greatly increased, able to swiftly defeat an entire pirate crew who took a princess prisoner shortly after Koby intercepted their torpedo from destroying the Dressrossa and Prodence escort ships."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Helmeppo's weapons of choice are a pair of kukri, which he keeps at the back of his waist on his belt. He was seen using them against Zoro when they met again in Water 7. However, he was still no match for Zoro."}, {"type": "paragraph", "text": "After the time-skip, Helmeppo wields a larger pair of kukri."}, {"type": "paragraph", "text": "Before becoming an actual Marine, Helmeppo's only weapons include a simple flintlock and his father's status."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Helmeppo has implied that he is able to use Kenbunshoku Haki. He commented on how impressive Koby's Haki was compared to his own, in that Koby was able to sense an underwater attack on the ships of the Prodence and Dressrosa Kingdoms when he could not."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Romance Dawn Arc", "level": 4, "content": [{"type": "paragraph", "text": "Helmeppo was Morgan's bratty son who lived off of his wealth. He unleashed his wolf, Soro, on the townsfolk of the nearby town one day and Zoro killed it to defend Rika. In anger, Helmeppo had Zoro arrested for killing his pet and promised to release Zoro after he starved for a month."}, {"type": "paragraph", "text": "Helmeppo caught Rika trying to give Zoro food twenty days later. He had her tossed over the wall of the Marine base after stomping on the onigiri she made. Later, Luffy overheard Helmeppo bragging about going back on his promise to Zoro and Luffy hit him."}, {"type": "paragraph", "text": "Helmeppo ran back to his father to get him to kill Luffy, only to have his father hit him for giving him orders. When Luffy invaded the base to get Zoro's swords back, he used Helmeppo as an unwitting guide and shield against the Marines that came after him until Helmeppo fainted. He later held Koby hostage in an attempt to stop Luffy from beating his father. The attempt failed and he was taken out by a punch from Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/Helmeppo_Threatens_Koby.png/revision/latest/scale-to-width-down/240?cb=20130411043927", "caption": "Helmeppo threatening to shoot Koby"}]}, {"title": "Diary of Koby-Meppo", "level": 3, "content": [{"type": "paragraph", "text": "After Morgan was defeated, Helmeppo did petty chores for the Marine Base in Shell Town along with Koby. Helmeppo was furious at the loss of a luxurious life and angrily stabbed a doll resembling Luffy."}, {"type": "paragraph", "text": "The two were later tasked with chore duty on a ship transferring the prisoner Morgan. As they cleaned the ship's weapons, Helmeppo was worried about his father possibly getting the death penalty. As Vice Admiral Garp was taking Morgan into his custody, Koby had to restrain Helmeppo. However, Morgan caught Garp off-guard and slashed him before taking Helmeppo hostage in the process. Morgan then escaped with Helmeppo on a small boat."}, {"type": "paragraph", "text": "On Morgan's escape vessel, Helmeppo finally made a decision and abandoned his father. Helmeppo swam back to the Marine ship, where he, Koby, and the other Marines apologized to Garp for the ruckus and called themselves worthless. Garp decided to take Helmeppo and Koby back with him to Marine Headquarters to train them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Morgan%27s_Escape.png/revision/latest/scale-to-width-down/240?cb=20130122224426", "caption": "Morgan takes his own son as a hostage."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Straw Hat Pirates returned from their raid on Enies Lobby, Helmeppo and Koby confronted Zoro and Luffy respectively at Water 7, but both Marines were easily defeated. While Luffy and Zoro remembered Koby, they had no idea who Helmeppo was until he reminded them and they briefly recalled him as the annoying spoiled brat, much to Helmeppo's dismay."}, {"type": "paragraph", "text": "Helmeppo was later shocked to hear from Garp that Revolutionary Monkey D. Dragon was his son and Luffy's father. He questioned how crazy the family was with so many infamous people in it."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Along with Monkey D. Garp and Koby, Helmeppo reported to Marine Headquarters to participate in the war against the Whitebeard Pirates. Three hours before Ace's execution, he was seen with Koby listening to Sengoku's speech about Ace's past. After hearing that Ace was Gol D. Roger's son, he and Koby came to a conclusion that Ace and Luffy were not real brothers. He ran away from the battle along with Koby and witnessed Akainu's wrath on a Marine who did the same. He and Koby then saw Luffy and company fall from the sky."}, {"type": "paragraph", "text": "Luffy's unconventional arrival at Marineford had both him and Koby stunned. When Sengoku announced that Luffy is Dragon's son, Helmeppo and Koby were shocked to see that the Fleet Admiral decided to reveal such information."}, {"type": "paragraph", "text": "Moments before the arrival of Red-Haired Shanks, he tried to help Koby get back on his feet while Koby was hearing voices in his head disappearing. When Koby tried to stop Admiral Akainu and the Marines from more needless fighting against pirates with no will to fight, Helmeppo panicked for the life of his friend, knowing that the Admiral would not accept something like that from an underling."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Koby_and_Helmeppo_at_Marineford.png/revision/latest/scale-to-width-down/210?cb=20140722071224", "caption": "Helmeppo and Koby at Marineford."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Koby was taken to the Marine Headquarters medical center along with other injured soldiers, and Helmeppo stayed at his bedside. Koby was still clearly traumatized by the events. Doctor Fishbonen told them that what Koby was feeling was Haki."}, {"type": "paragraph", "text": "Doctor Fishbonen informed Koby that all Vice Admirals are able to use Haki, and that Garp should be able to help him. Helmeppo expressed envy that Koby seemed to have advanced in skill, though Koby claimed to not have known about the ability in the first place."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Koby_Being_Treated_After_the_Battle.png/revision/latest/scale-to-width-down/240?cb=20130524221328", "caption": "Helmeppo listens as Dr. Fishbonen explains that Koby's Haki has awakened."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Z", "level": 4, "content": [{"type": "paragraph", "text": "After Firs Island was destroyed by Z, Helmeppo appeared on a Marine battle ship along with Koby and Garp, who revealed to him the existence of Zephyr. Later, after the destruction of Secon Island, Garp and Sengoku explained to him about Zephyr's past."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Helmeppo and Koby thwarted a pirate attack on the Dressrosa-Prodence Kingdom convoy to the Levely. After Koby stopped a torpedo launched by the pirates, Helmeppo attacked the pirates' submarine and defeated the pirates, freeing their prisoner in the process."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Helmeppo vs. Monkey D. Luffy", "elements": []}, {"text": "Helmeppo and Koby vs. Bogard", "elements": []}, {"text": "Helmeppo vs. Roronoa Zoro", "elements": []}, {"text": "Helmeppo vs. Komane's kidnappers", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Helmeppo and Koby vs. Morgan", "elements": []}]}], "images": []}, {"title": "Translation and Dubbing Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids version of the series, when Helmeppo holds a gun to Koby's head, the weapon was changed into a spring loaded hammer. However, the hammer was roughly edited and could be seen as a gun during a split-second."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Helmeppo was shown to have smoked in One Piece Green: Secret Pieces.", "elements": []}, {"text": "Helmeppo was the second fastest of promotion in two years as the first was held by Koby, from Seaman Recruit to Lieutenant Commander.", "elements": []}]}], "images": []}]}