{"sections": [{"title": "Buggy", "level": 1, "content": [{"type": "paragraph", "text": "Buggy the Star Clown is the captain of the Buggy Pirates as well as the co-leader of the Buggy and Alvida Alliance, and a former apprentice of the Roger Pirates. Shortly after the Battle of Marineford, he became a member of the Shichibukai and the leader of the pirate dispatch organization \"Buggy's Delivery\". He later lost his Shichibukai title when the Shichibukai system dissolved."}, {"type": "paragraph", "text": "He is the primary antagonist of the Orange Town Arc and can be considered the secondary antagonist of the Loguetown Arc. He has since become a highly recurring character in the series. Buggy also is the central character from Buggy's Crew Adventure Chronicles Cover Page Serial. Despite his rivalry with Luffy, he temporarily became one of his main allies during the Impel Down and Marineford Arcs."}, {"type": "paragraph", "text": "He is also the main antagonist in most episodes of \"Boss Luffy Historical Special\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Buggy is a slim blue-haired man with an appearance resembling that of a clown, as to mirror his epithet. The big, red nose on his face is, in fact, his real nose."}, {"type": "paragraph", "text": "Buggy's face is always covered with make up, just like a clown, and the motifs change from time to time: in his first appearance he had crossbones going down his face forming an X; he also had two blue lines near both of his eyes, red lipstick and his jolly roger on his hat. However, in later episodes after the Loguetown arc his look changes. First, a green star appears in the middle of the forehead, two half circles appear beneath the eyes, and there is a straight line on the middle of his chin. After that (when his crew meets Ace), he has two green dots on both sides of his head and four big green dots on the rim of his hat, which still has the jolly roger on it. He also has green eyeliner and green lipstick, with a curvy line going down both sides of his face. In the Impel Down saga, he has crossbones again going down his forehead to below his eyes, two pink lines pointing up, and red lipstick."}, {"type": "paragraph", "text": "In his pirate captain attire, he dons a striped white and red shirt with short sleeves, white gloves reminiscent of the ones worn by clowns, a sash around his waist like many other pirates, and a pair of loose pants reaching to his calves, just above a pair of striped socks and pointy shoes. He also has a scarf around his neck. Hanging from his shoulders there is an orange, fur-lined captain's coat. On his head he has an orange hat with his jolly roger on it, over a neckerchief with the same pattern of his shirt. While in the manga his scarf and sash are orange just like many other components of his attire, his pants are light-brown and the epaulets of his coat are simply gold, in the anime he was given a much more bright color scheme, with a purple scarf, green sash, light-green pants, and green epaulets."}, {"type": "paragraph", "text": "In Impel Down, he wore a striped prisoner outfit and wore his hair in a ponytail. After escaping from the Grand Prison, he changed his prisoner uniform with clothes like the one he normally wears, with salvaged Marine uniform pieces to recreate the effects of a pirate captain: a white coat and a white tricorn that had the Marine symbols crossed out."}, {"type": "paragraph", "text": "As a young man serving aboard Gol D. Roger's ship, he looked mostly the same; the only notable differences were his shorter hair and smaller stature. He wore a different outfit in each flashback but dressed similarly to how he does now, usually seen in striped T-shirts (or collared shirts), white gloves, baggy pants, pointed shoes, and donning a sash. He wore beanies rather than a captain's hat and he lacked the captain's coat."}, {"type": "paragraph", "text": "It was revealed in an SBS question that the blue tassels coming from the sides of Buggy's hat are his actual hair in the shape of two ponytails. While in the confines of Impel Down, Buggy's long hair is tied into just one ponytail."}, {"type": "paragraph", "text": "After the timeskip, Buggy's appearance has changed greatly. His hair is not tied anymore and now looks spikier. He wears a big red and white, stripped tricorn with a rim ornated with several golden little balls and his crew's Jolly Roger on the front. He wears a big, red cloak, using his Devil Fruit powers to make himself appear larger."}], "images": []}, {"title": "Non-canon", "level": 3, "content": [{"type": "paragraph", "text": "In the Boss Luffy Historical Special episodes, He has long pink hair, a green ribbon in the front, and a white face with red and blue lines. He wears an orange kimono, with blue shoulder pads that have his Jolly Roger drawn, with two yellow lines crossed behind, and a blue and red ribbon at the waist. He also wears white gloves (different from the canon storyline), and sandals."}, {"type": "paragraph", "text": "In the 3D2Y special, he dresses in a similar way to his appearance in Orange Town, with the difference of his shirt and handkerchief are with the colors in Marineford, and the shoulder pads in his coat are gold."}, {"type": "paragraph", "text": "In the video game One Piece: World Seeker, Buggy wears his hair in a ponytail, and sunglasses with star-shaped lenses. On his neck he wears a purple scarf and a gold collar, and he wears a green shirt with printed flowers, which he has unbuttoned, leaving his torso in sight, orange shorts with a red and white striped scarf at the waist, and sandals. He also wears his white gloves, and Captain John's armband on his wrist."}, {"type": "paragraph", "text": "In One Piece: Stampede, in his \"Star Clown\" appearance he is wearing an orange and white captain coat on the shoulders, and a pink cravat. In his original appearance, he is shown with yellow hair, and a black hat with a Jolly Roger. He wears a white shirt, pants with pink and yellow vertical stripes, fastened by light blue suspenders, and an orange coat on the shoulders. He also wears brown shoes and socks with white and light blue stripes."}], "images": []}]}