{"sections": [{"title": "Kokoro", "level": 1, "content": [{"type": "paragraph", "text": "Kokoro, an icefish mermaid, is the main conductor of the Sea Train, Puffing Tom, at the station just outside of Water 7. She has a granddaughter named Chimney, who accompanies her everywhere. She was Tom's secretary during the days of Tom's Workers. Kokoro poses as a human, hiding her mermaid physique because her tail fin forked in two around the age of thirty and allowed her to walk on land."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Her facial features make it look as if she is perpetually smiling regardless of her actual emotions. Her obese body shape, along with her strange smile, makes her look like a frog. She is, actually, an icefish mermaid, though she resembles more of a dugong in terms of appearance and shape due to her obese physique."}, {"type": "paragraph", "text": "When she was younger, she was much more beautiful, like a typical mermaid.  Following the incarceration of Tom and the apparent death of Cutty Flam, she fell into depression and developed a binge drinking addiction, letting herself go."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kokoro is a heavy drinker, and she speaks with a mild speech impediment whenever she is intoxicated that gives her dialogue a distinctive ring. In contrast, when Kokoro is sober, her voice is warm and gentle. While she does have a temper she tends to keep it under control and seems to remain happy no matter what events unfold remaining strangely relaxed and calm."}, {"type": "paragraph", "text": "She takes a liking to Luffy and eventually refers to him as the Pirate King. She is very curious about him because the events at Enies Lobby became very interesting. She came to the conclusion that if Tom were still alive, he would have built him a ship just as he had done to Gol D. Roger."}, {"type": "paragraph", "text": "Like many other characters she has a unique laugh which begins with \"Na\" and continues with \"ga\" (Nagagagaga)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kokoro is an experienced Sea Train Conductor who is adept at operating such vehicles. In fact, it was through her assistance that the alliance between the Straw Hats, Galley-La Foremen, and the Franky Family were able to reach Enies Lobby after chasing the Puffing Tom using the Rocket Man. Her skills were also noted to where she could spot the track even during the worst possible storm and land the Rocket Man on it. As a mermaid, she could swim at extremely high speed while grabbing onto the Straw Hats and her granddaughter and Gonbe with a long cloth, saving them in time from drowning from the flooding waves that Rob Lucci unleashed."}, {"type": "paragraph", "text": "It is revealed that she is a capable cook or at least know how to make ramen and curry as those are Tom and Iceburg's favorite dishes respectively."}, {"type": "paragraph", "text": "In spite of her elderly age and obese physique, Kokoro is physically strong."}, {"type": "paragraph", "text": "She has only shown one attack named Mermaid Kick (マーメイドキック, Māmeido Kikku), with which she kicks an opponent with her fishtail-like leg with enough strength to send a Marine flying far away."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early Life", "level": 4, "content": [{"type": "paragraph", "text": "She left Fish-Man Island to support Tom and met her human husband in Water 7. Together, they had a son who was half human and half merfolk."}], "images": []}, {"title": "Tom's Secretary", "level": 4, "content": [{"type": "paragraph", "text": "Kokoro became the \"lovely\" secretary of Tom and a matronly figure to his two apprentices, Iceburg and Franky."}, {"type": "paragraph", "text": "When Tom was taken to a trial for building Gol D. Roger's ship, Kokoro was watching the whole thing. After Tom was given a ten-year sentence to build the Sea Train (lengthened to fourteen years later on), Tom laughed about being given a chance, but Kokoro had been scared by Tom's brush with death and did not appreciate him laughing about it."}, {"type": "paragraph", "text": "At some point during the next fourteen years, Kokoro visited Enies Lobby with Tom and memorized some of its layout for future reference."}, {"type": "paragraph", "text": "When the sentence was nearly done, the judge was impressed with Tom's work and intended to pardon him. However, Spandam's CP5 interrupted his verdict by attacking the judiciary ship with the Battle Franky ships, thereby incriminating Tom's Workers."}, {"type": "paragraph", "text": "When Tom was captured by Spandam and his agents, Iceburg, Franky, Kokoro, and Yokozuna were brought to trial. To save Iceburg and Franky, Tom sacrificed himself by saying he was proud to help Gol D. Roger and wounded Spandam. After Tom was tranquilized, the Judge decided to take only Tom and free his workers. Kokoro hugged Franky and Iceburg as she explained that convicts never come back from Enies Lobby. Furious, Franky stole a rifle from a Marine and used the rifle butt to strike Spandam's face, permanently disfiguring it. After Franky was run over by the Sea Train, Kokoro announced that Franky died and she then became Iceburg's drinking buddy."}, {"type": "paragraph", "text": "After this, she took up a new job as a stationmaster of the Sea Train's Blue Station. During Franky's eight year hiatus, Kokoro grew with age, becoming a heavy drinker, bitter about losing Tom and angry towards the World Government. Later, her son left Chimney and Gonbe under her care."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "Eight years later, when the Straw Hat Pirates arrived at the Sea Train station, they met Chimney, Gonbe, and a drunken Kokoro. Kokoro told them about the Sea Trains and how they work, then offered them the Sea Train route to Pucci, San Faldo, or St. Poplar. Nami told her that they must only follow the Log Pose. Kokoro told them that Iceburg should be able to help them repair their ship and wrote a note to this effect, accompanied by a poorly-scrawled map intended as a guide to Water 7."}, {"type": "paragraph", "text": "She later appeared at a bar where Blueno worked when Franky was also there. During a conversation with Franky, Kokoro talked about an organization that was supposed to be secret, CP9. Later that night, Kokoro, Chimney, and Gonbe walked through the town as the Aqua Laguna approached to the island."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After CP9 took Nico Robin into custody and the Straw Hats resolved to rescue her, Kokoro volunteered to help the pirates. They were joined by Paulie, Peeply Lulu, Tilestone, and the Franky Family. She piloted the sea train, Rocketman, onto the train tracks. As the train headed toward a giant tidal wave, Kokoro witnessed Luffy and Zoro create a giant hole in the wave for the sea train to pass through. When they finally reached Enies Lobby, Luffy went ahead on his own and Kokoro commented on how impatient Luffy was. As the Franky Family and the Galley-La foremen were battling Oimo after defeating Kashii, Kokoro assisted them by crashing the Rocketman into the giant, knocking him out. When the train stopped in the Enies Lobby mainland, Kokoro became an onlooker of the battle."}, {"type": "paragraph", "text": "She later assisted the Straw Hats in entering the Tower of Justice with the Rocketman. After Chimney discovered the secret underground passage, she led Kokoro and the pirates to it after Luffy ran after Lucci and Robin. When Lucci flooded the passageway during his battle with Luffy, Kokoro revealed her mermaid form and carried the group through the tunnel, out into the sea, and on to the government ship that Franky and Robin had taken control of."}, {"type": "paragraph", "text": "Kokoro, Chimney, and Gonbe watched over an immobile Chopper as the other Straw Hats battled the Marines. When the Marines learned that the pirates were planning to use the ship to escape, they had their warships destroy it. Luckily, Sanji saved Kokoro, Chimney, Gonbe, and Chopper by carrying them off the ship in the nick of time. When the Marines had the group cornered, they heard the Going Merry. They jumped into the sea, boarded the Going Merry, and ultimately escaped Enies Lobby."}, {"type": "paragraph", "text": "After sailing far away from Enies Lobby, the group met up with Iceburg and the Galley-La workers. The Going Merry broke down and Kokoro attended its Viking funeral along with the rest of the group."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Kokoro_Rescues_Straw_Hats.png/revision/latest/scale-to-width-down/210?cb=20150612091251", "caption": "Kokoro saving the Straw Hats, revealing her mermaid tail."}]}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kokoro and the group then returned to Water 7 and stayed with the Straw Hats in the Galley-La headquarters. When Vice-Admiral Monkey D. Garp arrived to see Luffy, Kokoro was shocked to learn that Garp is Luffy's grandfather and that revolutionary Monkey D. Dragon is Luffy's father."}, {"type": "paragraph", "text": "Kokoro later swam in the Galley-La pool, as Nami eavesdropped on Luffy and Koby's conversation. She then attended the Straw Hats' big party."}, {"type": "paragraph", "text": "As the Straw Hats' Log Pose pointed to Fish-Man Island, Kokoro explained to the pirates that they would have to cross the Florian Triangle before they could reach Fish-Man Island. When Sanji started to lose his excitement of seeing mermaids after seeing Kokoro as a mermaid, she pointed out to the chef that there are younger mermaids. After Franky, Iceburg, and the Galley-La workers finished constructing the Thousand Sunny, Kokoro, Chimney, and Gonbe then saw the Straw Hats set sail on their new adventure."}], "images": []}, {"title": "Where Are They Now", "level": 3, "content": [{"type": "paragraph", "text": "Kokoro was then seen at the Sea Train station with Chimney and Gonbe, having fun with Yokozuna since he does not fight the Sea Train anymore."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Kokoro took a vacation with Yokuzuna. While drinking sake, she was seen riding on a shark. She was also holding a newspaper, appearing to celebrate the return of the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fb/Kokoro_on_Vacation.png/revision/latest/scale-to-width-down/210?cb=20131128044929", "caption": "Kokoro on vacation, reading the newspaper of the Straw Hats' return."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Franky's new wanted poster was released to the public, Kokoro was shown smiling while looking at the poster with Iceburg."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "She was originally planned to be male. Also in One Piece Green: Secret Pieces a beautified form of Kokoro is revealed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b0/Early_Chimney_and_Kokoro.png/revision/latest/scale-to-width-down/210?cb=20150404101935", "caption": "Early concept of Kokoro from One Piece Green."}]}, {"title": "Translations and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Kokoro\" translates from Japanese as \"heart\", in the emotional sense—such as \"follow your heart\", not the actual bodily organ.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her appearance led to a brief joke when the Straw Hats met Camie, a younger, much more attractive mermaid. When many of the male Straw Hat crew members see Camie, they seem to attempt to repress their memories of Kokoro being a mermaid, pretending that Camie is actually the first mermaid they ever met. Luffy also believes this at first, not having been present when Kokoro revealed herself as a mermaid at Enies Lobby, and considered the idea of Kokoro being a mermaid \"disgusting\", much to Nami's fury.", "elements": []}, {"text": "Despite being a mermaid, she is seen with scaleless ankles exposed early on in the manga. While this could be because she was still wearing stockings or socks, the anime showed her with flesh colored ankles, indicating her ankles were normal skin and not her mermaid tail.", "elements": []}, {"text": "Her appearance similar to a dugong could be a reference to real life, where dugongs were often mistaken as mermaids.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Salangidae (icefish) – Wikipedia article about the type of fish that Kokoro is.", "elements": []}, {"text": "Dugong – Wikipedia article about the animal Kokoro is mistaken for in her mermaid form.", "elements": []}]}], "images": []}]}