{"sections": [{"title": "Marshall D. Teach", "level": 1, "content": [{"type": "paragraph", "text": "Marshall D. Teach, most commonly referred to by his epithet \"Blackbeard\", is the admiral of the Blackbeard Pirates and one of the Yonko. He is also the only known person in history to wield the power of two Devil Fruits."}, {"type": "paragraph", "text": "He started out his pirate career as a member of the Whitebeard Pirates' 2nd division, until he murdered Thatch, the 4th division commander, for the Yami Yami no Mi and defected. Prior to the two-year timeskip, he briefly held the position of Shichibukai after defeating and handing Ace over to the Marines, before resigning upon returning from Impel Down with Level Six prisoners to strengthen his crew. His actions resulted in him being considered a part of the Worst Generation along with the Eleven Supernovas, and he received the title of Yonko after slaying Whitebeard during the Battle of Marineford and defeating the Whitebeard Pirates during the timeskip."}, {"type": "paragraph", "text": "Due to his actions, he can be considered the tertiary antagonist of the Impel Down Arc, and one of the main antagonists of the Marineford Arc, the Summit War Saga, and the remainder of the One Piece manga and anime overall."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Blackbeard is an extremely tall man, being exactly twice Luffy's (pre-timeskip) height. He has a massive build as his body is round with relatively thin limbs. He has a big mouth with several broken or missing teeth (though sometimes he does have a full set, which is an inconsistency error made by Oda), a pronounced crooked nose and a very large and hairy chest and torso. Long, thick, woolly black hair falls down the back of his neck, underneath a black bandana, and a small scruffy black beard (hence his epithet) grows around his jawline. As the series progresses, his beard becomes longer and scruffier."}, {"type": "paragraph", "text": "At his first appearance in Mock Town, Teach wore an open buttoned white shirt with rolled up sleeves, green trousers with black line patterns, a yellow sash around his waist and classic black swashbuckler boots complete with large bronze buckles."}, {"type": "paragraph", "text": "During his raid on Banaro Island, he had added a large black and gold captain's coat over his attire, along with white beads on each wrist as bracelets and rings with gemstones on all of the fingers of both his hands (similar to his predecessor, Crocodile)."}, {"type": "paragraph", "text": "At the Shichibukai meeting at the Marine Headquarters, he added a pair of necklaces of red as well as golden-yellow and blue beads to his dark orange sash(dark yellow in the anime) and a traditional black tricorne hat over his grey bandana, as well as switching to a red shirt, while wearing his captain's coat like a cape. He also has three flintlocks and a flask tied to his sash around his waist."}, {"type": "paragraph", "text": "In SBS Volume 63, Oda drew the Shichibukai as children. Teach is shown wearing a baseball cap with a rolled up long sleeve shirt and green shorts. He is also wearing black curled tip shoes, and unlike his usual cheerful expression, is crying for an unknown reason."}, {"type": "paragraph", "text": "After the time skip, Teach has grown a long beard that he has split into multiple sections, very much like his real life basis. He also wears a new hat with his Jolly Roger embroidered on it."}, {"type": "paragraph", "text": "His appearance on Hachinosu has Teach wear flamboyant pants, a belt instead of a sash, a new coat along with a feather cape, and new hat with a feather and his Jolly Roger."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Blackbeard's personality seems to be a strange mix of courage and cowardice, as well as high intellectual capacity and stupidity. While at times his character looks strong and fearsome, in others he will seem weak and ridiculous. He is very deceptive, joining the Whitebeard Pirates to find the Yami Yami no Mi and killing a fellow crewmate despite two decades aboard the ship. He also deceived the Marines by joining the Shichibukai in an elaborate and convoluted fashion for the sole reason of gaining access to Impel Down in order to find new crewmates and later resigning from it in front of the fleet admiral himself saying that he does not need it anymore. He is also exceedingly power-hungry and greedy, aiming to become the next Pirate King."}, {"type": "paragraph", "text": "His hunger for power lead him to fashion a very cruel way of recruiting only the best prisoners in Impel Down as comrades: he ordered them to murder each other, and would only take the strongest ones who survived. Though he betrayed the Whitebeard Pirates, Teach takes comradeship with the crew he formed to a high level, which is made evident when he was willing to make a trade with the Marines for a battleship big enough to hold all of them comfortably for the sake of one crew member, Sanjuan Wolf. Despite his obvious malevolent nature, he is also genuinely compassionate, caring, sympathetic and empathetic towards his crew's well-being and is willing to take assaults intended for his crew. He also has an extreme thirst for adventure, regularly traveling from place to place. However, he tends to play it by ear."}, {"type": "paragraph", "text": "Blackbeard, like others who carry the Will of D., has a strong belief in fate and the dreams of men, but unlike the others, is the only one who truly seems to take it to heart. He shares several attributes with Luffy, including having a voracious appetite, carefree attitude, as well as a competitive and reckless nature to the point of persevering even if there may be grave consequences, and huge ambitions to follow his dream of finding One Piece and become the new Pirate King. Despite that, there is also a great contrast between him and Luffy: primarily, Blackbeard fears death whereas other D. carriers embrace it if it comes, and was willing to betray his own friends for power. Just before his death, Whitebeard noted that Teach was not the one Roger had been waiting for and dismissed Teach as being incapable of continuing Roger's legacy."}, {"type": "paragraph", "text": "Perhaps because of his strong belief in fate, Blackbeard is highly amoral. He believes that there is no inherent \"good\" nor \"evil\" in the world, jeeringly mocking anyone who expresses such belief. He is also patient and conniving, having spent decades on Whitebeard's ship just to get his hands on the Devil Fruit he wanted, before killing Thatch and leaving the crew. His nihilistic tendencies are in line with the power of the Yami Yami no Mi he possesses, which is said to reduce everything to \"nothingness\". During his raid on Impel Down, he stated that his plans have not gone exactly as expected, but is willing to take these surprises in stride. He handed Portgas D. Ace to the World Government and finally killed his captain Whitebeard. Despite this, he still displayed respect for his superiors during the events, referring to Ace as his commander, and said that he aspired to be like Whitebeard. He showed his ruthlessness when he killed Thatch, and, with his crew's help, finished off his former captain, Whitebeard."}, {"type": "paragraph", "text": "Blackbeard is often very calm, composed, relaxed, easygoing, cheerful, and free-spirited, but he can be surprised and startled, such as when Koby told everybody present to stop the war, or when Whitebeard had held him by the throat. He is very politely sarcastic and mocking towards those around him, such as when he taunted Luffy about Ace's inevitable execution, or when he mocked Whitebeard for his age."}, {"type": "paragraph", "text": "He is also overconfident as, while very powerful, he tends to converse and/or taunt his opponents in the middle of battle. He has done this in every battle he has been shown in, and as a result, he always suffers a heavy, painful attack while his guard is down, such as when he taunted Whitebeard about not being able to use his powers, and nearly got cleaved in half with Whitebeard's bisento or when he boasted in front of Magellan and was nearly drowned by the Hydra attack, while only surviving because Shiryu gave him and his crew the antidote. His overconfidence also made him believe that he could do a trade with the Marines despite having betrayed them already, which once again proved to be a mistake. Since having acquired two Devil Fruit powers, he has developed a severe superiority complex, believing himself to be truly invincible and the strongest of them all while revealing his goal of world domination. Despite his arrogance, Blackbeard does show a sense of caution, as he refused to fight Shanks and his crew, as well as Admiral Akainu when he was aboard the Marine battleship that they wanted."}, {"type": "paragraph", "text": "Another sign of his overconfidence is the fact that he chose to recruit the worst criminals in Impel Down into his crew despite the high risks of them not being loyal to him such as Shiryu, who did not hesitate to betray and kill his fellow jailors of Impel Down and stated that he only joined the Blackbeard Pirates out of opportunism."}, {"type": "paragraph", "text": "Blackbeard is also an ungrateful man by nature as described by Marco. Despite the fact that Whitebeard took him in and treated him as a son like the rest of the crew for more than 20 years, Blackbeard did not hesitate to betray his father figure to acquire the Devil Fruit Thatch found. He then later went on to further show he never had an ounce of respect or care for the Whitebeard Pirates as a whole other than for his own selfish agenda by killing his former captain and claiming all his territories as his own."}, {"type": "paragraph", "text": "Blackbeard is a very patient and careful pirate, as stated by Shanks. Unlike other powerful pirates, he never gained renown and remained concealed, up to the point that he only makes his moves when he sees an opportunity for power."}, {"type": "paragraph", "text": "Many of One Piece's characters are given a distinct laugh. Blackbeard follows this tradition by starting his laughs with \"Ze\" (i.e. Zehahahahahaha!). This laugh is not present in the English Dub until the Banaro Incident."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Luffy_Meets_Blackbeard.png/revision/latest/scale-to-width-down/210?cb=20140801104300", "caption": "Teach and Luffy bickering during their first meeting in Mock Town."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crews", "level": 3, "content": [], "images": []}, {"title": "Blackbeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "In contrast to his obvious malevolent nature, Blackbeard has shown respect and leadership for his own crew, such as when he told them to stay away from Ace. He has even taken an attack meant for them, despite his Devil's Fruit's weakness of increasing incoming damage. He showed no problem in new recruits as he allowed Shiryu to join his crew after he saved him and the others. It was for that reason that he invaded Impel Down; so he could strengthen his crew with some of the deadliest criminals in the world."}, {"type": "paragraph", "text": "In true to his way of letting fate decide things, he will allow his crew to get in the way with his Devil Fruit powers. Of particular note, when he first gained the powers of the Gura Gura no Mi, his efforts put their own lives at risk. However, the crew were more than satisfied with things this way since all of them seem to believe in fate in some shape or form."}, {"type": "paragraph", "text": "After the Marineford war, it was implied that Blackbeard receives a fair amount of disrespect from his crew from time to time, especially from the new recruits, but he seems to get over it all, though he did get rather snappish at Sanjuan Wolf for whining so much. He was also willing to perform a trade with the Marines for the sake of one of his crewmates, despite making enemies from the Marine forces due to his actions."}, {"type": "paragraph", "text": "However, according to an executive of the Revolutionary Army, Blackbeard does not care for his allied pirates who are under his flag, as seen with Pinkbeard."}], "images": []}, {"title": "Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "However, in regards to his old crew the Whitebeard Pirates, of which he was a member of, none of them can forgive or forget the things he has done to them. Whitebeard himself refused to acknowledge Blackbeard as his son before his end and the whole crew witnessed the death of their captain at Teach's hands."}, {"type": "paragraph", "text": "Along with Teach mocking them about Thatch and Ace's deaths, it only angered them further. He had, however, previously been on good terms with them, having spent a few decades on their ship, even turning down the chance to be a commander amongst the crew, although that was most likely a measure not to make himself infamous before he was ready to reveal his plans. Still, the fact that he was not able to discern Luffy's relationship with Ace on their encounter (whereas many other Whitebeard Pirates did, as Ace spent much time telling them about Luffy) until it was pointed out by Ace himself showed his own ignorance in regard of his former crew."}, {"type": "paragraph", "text": "He also genuinely respected Whitebeard for his power, but did mock his old age. Despite all the seemingly great times they once had, and with all the outward respect Teach gave to them, his only reason for even joining the Whitebeard Pirates was just to acquire the Yami Yami no Mi; he promptly betrayed and murdered Thatch just to steal the fruit, and after his defection, he utilized the knowledge and experience he gained from the crew to arrogate Whitebeard's status of Yonko and annex nearly all of his territories, all of which shows that he exploited them for his selfish agenda for nearly two decades and had no genuine fellowship with the crew whatsoever."}, {"type": "paragraph", "text": "One year after the Battle of Marineford, Marco and the remnants of the Whitebeard Pirates confronted the Blackbeard Pirates in the \"Payback War\" and were ultimately defeated and have not been seen since. This event was what led Blackbeard to be recognized as one of the Yonko."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Originally having given Luffy sound advice on being a pirate, Blackbeard attempted to capture Luffy for his second bounty but failed. When he learned of the latter's third increase, he attempted to go after him but Ace caught up to him. Teach was surprised to learn Luffy was Ace's brother and the latter fought him to protect Luffy. In their second meeting, Luffy was shocked to see him but this later becomes anger and despair as Teach was the one who put Ace on his path towards death. Luffy himself almost forgot his original mission to save Ace and attacked Teach, only stopping because of Jinbe's intervention. While Luffy calmed his mind, Blackbeard had realized he underestimated Luffy as he found his strength impressive. The pair are considered enemies and with Ace's death taken into account, Luffy will never forgive Teach for what he has done. Despite this, Teach still seems to hold a strong respect for Luffy seeing that he is a fellow \"dreamer\" with an aspiration to find One Piece and become the Pirate King."}, {"type": "paragraph", "text": "Two years later, when Blackbeard was speaking to Jesus Burgess (through the den-den mushi) at the Corrida Colosseum, the latter told him of Luffy's presence which intrigued him as he greeted the young pirate who was angered to hear him. Blackbeard spoke to Luffy with a jovial tone telling him that Burgess would win the tournament and claim the Mera Mera no Mi before Luffy firmly told him that he would not allow them to claim his brother's power. It is shown that Luffy's hatred for Blackbeard has increased after learning he had his crew attack Baltigo (the revolutionary army base) which placed his father Dragon and other brother Sabo in danger."}, {"type": "paragraph", "text": "When news of the Straw Hats' actions in Big Mom's territory spread across the world, Blackbeard was deeply amused by the fact that Luffy challenged Big Mom, though he stated it was too soon for him to be called an Emperor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/Blackbeard_and_Luffy.png/revision/latest/scale-to-width-down/210?cb=20130426005132", "caption": "Teach and Luffy."}]}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Blackbeard appears to know Jinbe, having commented on his friendship with Ace. Jinbe was enraged at Blackbeard for causing Ace's arrest and death sentence by the Marines but was cautious about his disposition and abilities. After the Battle of Marineford, Jinbe kept tabs on Blackbeard as he informed Luffy of Blackbeard's usurping of Whitebeard's Yonko status and his relentless hunt for Devil Fruit users to absorb their abilities. He warned Luffy that Blackbeard would consider the Straw Hats to be invaluable targets."}], "images": []}, {"title": "World Government and Marines", "level": 4, "content": [{"type": "paragraph", "text": "Blackbeard joined the Shichibukai after defeating Ace and handing him over to the government. However, Blackbeard exploited the benefits the Shichibukai title grants him in order to enter facilities that would otherwise have been unreachable to a pirate. Blackbeard only wanted to be a Shichibukai so as to be able to reach Impel Down in order to liberate several Level 6 prisoners and create a stronger crew. He stole a Marine ship with his crew, using it to break into Impel Down. After he achieved this ambition, he resigned from his Shichibukai title upon reaching Marineford."}, {"type": "paragraph", "text": "Teach has also made enemies of the Marines after revealing his treachery when he went to Marineford during the Whitebeard War. The Marines hold themselves accountable for not only the potential power he wields, but also for the number of dangerous criminals he freed from Impel Down. Sengoku personally was furious over the latter's betrayal, and took it upon himself to fight Blackbeard when he bragged about sinking Marineford. Nevertheless, Teach tried to trade Bonney for a Marine battleship, which the Marines did not go through with, sending Akainu to deal with him instead."}], "images": []}, {"title": "Magellan", "level": 4, "content": [{"type": "paragraph", "text": "Teach's invasion of Impel Down and the liberation of Level 6 prisoners dealt a powerful blow to the then Chief Warden Magellan of Impel Down. During this incident, Magellan suffered near-fatal injuries, but Magellan claimed that worse was done to his pride."}], "images": []}, {"title": "Jewelry Bonney", "level": 4, "content": [{"type": "paragraph", "text": "Bonney bears a grudge against Marshall D. Teach for his role at triggering the Whitebeard War by defeating and handing over Portgas D. Ace to the World Government for the vacant Shichibukai position. This hatred seemingly became more intensified after he and his crew dealt the final killing blows to Whitebeard, whom Bonney admired. She does not seem to fear him, and even went as far as insulting him in front of his crew. Blackbeard offered her to become his \"woman\" and join his crew, but she refused. When Akainu approached the Blackbeard Pirates, they fled leaving Bonney behind."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Shanks has a watchful eye out for Teach. Although exact events are unknown, Shanks previously admitted to Whitebeard that his facial scar came from a direct attack from Teach."}, {"type": "paragraph", "text": "Even at Marineford, Shanks addressed Teach in a tense manner, and he only seems to regard Teach as a significant threat compared to the Marines or the Whitebeard Pirates and their New World subordinate crews. Teach was initially surprised at seeing him again but was amused at being called out by Shanks before he mocked him for the scars he gave him, which angered the latter. Having already proclaimed \"his\" era is beginning, unveiling the new members of his crew, and demonstrating control over two Devil Fruits, Teach said he had achieved his goal for the time being, while also stating that it was not yet time for his battle with Shanks."}], "images": []}, {"title": "Gecko Moria", "level": 4, "content": [{"type": "paragraph", "text": "They had no interaction when Blackbeard was a Shichibukai, though he was amused to be informed that the latter filled the vacant position left by Crocodile. After the timeskip, Moria showed hostility towards Blackbeard by attacking his personal island to rescue Absalom while shouting for Blackbeard to show himself despite him having become a Yonko. Even after Moria attacked his underlings, Teach still gave Moria the option to join him though he did so derisively."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "As a member of the Yonko that rule over the New World, Blackbeard is recognized as one of the four strongest pirates in the world."}, {"type": "paragraph", "text": "Even before becoming a Yonko, Teach was an immensely powerful pirate even for a former member of the Whitebeard Pirates and Shichibukai. At some point in his life, Teach once fought Shanks and gave him the scars on his left eye, with Shanks admitting that the injury did not occur because of carelessness. Their battle led Shanks to cautiously recognize Teach as an extremely dangerous menace. After the Battle of Marineford, Blackbeard proved to the Five Elders that he had a one-step lead to usurp the empty Yonko position that Whitebeard once held, which eventually came to fruition."}, {"type": "paragraph", "text": "During the timeskip, he has gained mass notoriety with his bounty being 2,247,600,000, showing how dangerous he has become. However it should be noted that out of the all the Yonko, his bounty is the lowest."}, {"type": "paragraph", "text": "The most prominent feats of Teach's power was defeating three commanders of the Whitebeard Pirates: Portgas D. Ace, Thatch, and later during the Payback War, Marco, the new Captain of the Whitebeard Pirates. After the time-skip, he and his crew fought against the Revolutionary Army and destroyed their base. It is also stated that they briefly fought against CP-0. Ace once stated that Blackbeard could have been a commander when he was recommended for the position, thereby proving that his strength was equivalent with any of the other commanders, which is extremely notable, as he had not yet eaten a Devil Fruit."}], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Blackbeard has shown himself to be an expert planner and a master at orchestrating manipulative schemes provided he has a sufficiently advanced period of time to prepare; he waited two decades aboard the \"Moby Dick\" with the Whitebeard Pirates and even integrated with the crew dynamic, solely to increase his opportunities of obtaining the Yami Yami no Mi (he also recruited future members of his personal crew during this time, indicating great charisma and leadership skills even as a regular crewmate). He also went for the capture of Monkey D. Luffy in order to guarantee an offer for the vacant position of the Shichibukai by the World Government, which in turn was simply sought for the free access across the Gates of Justice into the notoriously impenetrable Impel Down to recruit extremely powerful \"Level Six\" prisoners to strengthen his crew. This scheme completely deceived both Sengoku and Tsuru, the two greatest strategic masterminds of the Marines, with Sengoku realizing Teach's true intentions only after the Blackbeard Pirates appeared in Marineford. Marco also suggested Teach already made plans to steal the Gura Gura no Mi, from being on the crew for so long. Instead of taking Whitebeard head on to steal his Devil Fruit, Teach effectively manipulated Whitebeard and the entire military force of the Marines including the Admirals Sakazuki, Aokiji, and Borsalino into fighting each other during the former's attempt to rescue Ace. Eventually, Whitebeard became fatally injured and weakened enough for Teach and his crew to brutally overpower and ultimately kill Whitebeard to steal the Gura Gura no Mi, becoming the first person to wield two Devil Fruit powers. When confronted by Shanks and his crew, Blackbeard instead had his crew retreat as he deemed that it was not the right time to fight them, which showed a great sense of caution."}, {"type": "paragraph", "text": "Following his victory over the remnants of the Whitebeard Pirates, Teach used his previous knowledge of the latter's territory to conquer most of it, becoming one of the Yonko."}, {"type": "paragraph", "text": "However, for all his combat prowess and intellect, Blackbeard has a habit of concentrating too much on conversations with his opponents while fighting them, letting his guard down in the process, a weakness he has demonstrated in his battles against Whitebeard, Luffy, Ace, and Magellan. This usually results in him suffering some critical injuries. In fact, if not for Shiryu's help, Teach's entire crew would have died from Magellan's Poison Devil Fruit ability."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Teach has an immense amount of superhuman endurance, as demonstrated when he took a point-blank quake bubble attack from Whitebeard, and while being pinned to the ground by the former's feet on his hands, to his head and neck without losing consciousness, an incredible feat especially since his Devil Fruit makes him more vulnerable to receive even more damage. Prior to the above he took a hit from Whitebeard (albeit an indirect hit) and was more annoyed than actually injured. He has also taken a direct slash from Whitebeard's bisento without suffering any lasting damage and was able to shrug off a kick to his head from Supernova Jewelry Bonney."}, {"type": "paragraph", "text": "During his fight with Ace, he was engulfed in flames and pierced in the chest by two fire spears, but after putting out the flames, he was able to shake off the impact of the attacks. Another indication of his sheer endurance is that he took a point-blank Gear Second attack from an enraged Luffy, and was hit by Sengoku in his Daibutsu form only to come out with minor injuries both times."}, {"type": "paragraph", "text": "Teach also possesses tremendous physical strength even for his comparable size, which is demonstrated when he seriously injures Luffy and Ace, both who are exceptionally strong and powerful in just one hit, sending them both crashing back with incredible force and distance. In the anime, he was shown to be able to knock back and injure Whitebeard with a few punches, a feat that shocked the other members of the Whitebeard Pirates. He was able to stop an enraged Whitebeard's quake attack with his own physical strength and with the help of his Kurouzu technique.."}], "images": []}, {"title": "Devil Fruits", "level": 3, "content": [{"type": "paragraph", "text": "Blackbeard has become the first and, so far, only known person to wield the powers of two Devil Fruits at the same time. Through unknown means, he acquired the extremely destructive powers of the Gura Gura no Mi from the dead body of Whitebeard and is now able to create earthquakes like his old captain. Marco speculated that this was possible due to an unstated peculiarity unique to Blackbeard himself, having to do with an \"atypical body structure\" of some sort. He also pointed out that the other Whitebeard Pirates should be aware of this fact. Teach also appears to be knowledgeable enough to know how to use the Gura Gura no Mi powers straight away after extracting it."}, {"type": "paragraph", "text": "With the power of darkness (Yami Yami no Mi), which \"reduces anything to nothingness\", and the power of quakes (Gura Gura no Mi), which \"brings destruction to everything\", Blackbeard claims himself to be truly invincible and the strongest of them all. During the two years, the Blackbeard Pirates went on to hunt down powerful Devil Fruit users to kill them and absorb their abilities, thus Teach (and possibly his comrades) has likely added more abilities to his arsenal."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Blackbeard_with_Yami_Yami_no_Mi_and_Gura_Gura_no_Mi.png/revision/latest/scale-to-width-down/210?cb=20130131055706", "caption": "Blackbeard, wielding the powers of both the Yami Yami no Mi (right hand) and the Gura Gura no Mi (left hand)."}]}, {"title": "Yami Yami no Mi", "level": 4, "content": [{"type": "paragraph", "text": "Blackbeard has eaten the Yami Yami no Mi, a Logia-type Devil Fruit which allows him to create an ebbing shroud of darkness, shown to possess a strong gravitational pull. Teach demonstrates that the \"darkness\" is a void which devours anything, able to pull in (much in the manner of an actual black hole), and crush his surrounding environment into a pile of rubble. Due to the Yami Yami no Mi's gravitational ability, Blackbeard, unlike every other Logia user, is not intangible, drawing the attacks faster towards himself, meaning he takes more damage than an average human would."}, {"type": "paragraph", "text": "However, Blackbeard states that the deficiency this presents is well worth the advantages the fruit bestows upon him, such as the ability to \"absorb\" certain projectiles and then hurl them back at his foes using moves like \"Liberation\". The second, and the most frightening power of the fruit is to nullify other Devil Fruit abilities through physical contact, allowing Teach to physically hit Ace, whose body was composed of intangible flames, and injure Luffy, whose body was made of rubber. Teach states that this is because the Yami Yami no Mi truly holds the power of the devil. As such, Blackbeard's style revolves around getting close to his enemy and grabbing them, canceling out any defensive abilities they have, forcing their own natural resilience to take Blackbeard's massive strength."}, {"type": "paragraph", "text": "Blackbeard must, however, physically touch his enemy to cancel out their powers. This puts him at a huge disadvantage against enemies he cannot reach out and grab, even more so when the enemy can hurt him at a distance. However, this weakness can be rectified somewhat by his signature technique \"Kurouzu\", which utilizes his suction powers to drag his opponents towards him. This technique opens up another weakness since right after he uses it he is left open for an attack at close range."}], "images": []}, {"title": "Gura Gura no Mi", "level": 4, "content": [{"type": "paragraph", "text": "Blackbeard acquired this fruit after wrapping a black tarp over himself and the deceased Whitebeard, though the method of how he got it is still unknown. With the newly acquired powers of the Gura Gura no Mi, which is said to be the strongest Paramecia-type Devil Fruit, Blackbeard can create shock waves by shattering the air itself, creating devastating earthquakes that can even destroy the gargantuan Marineford main building. He can also focus his quake powers into a \"quake bubble\" on his fist, greatly increasing the damage in a single punch."}, {"type": "paragraph", "text": "Upon initially obtaining the power, he did not have great control over it. This was demonstrated when he chose not to directly confront Akainu, despite having two Devil Fruit powers at his disposal, whereas Whitebeard himself confronted the admiral directly. However, it should be mentioned that Blackbeard, who has a much more careless and vicious personality than Whitebeard, can be considered as a far greater threat to the world than Whitebeard himself. An example of this is when Teach was creating random earthquakes to test his acquired power in Marineford. He also sent a giant tsunami towards Sabaody Archipelago without even realizing it."}, {"type": "paragraph", "text": "After the timeskip, he seems to have more control of the power as he casually created an earthquake with no effort."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Blackbeard possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When the Whitebeard Pirates started protecting Fish-Man Island, he is seen with metal claws on his left hand."}, {"type": "paragraph", "text": "He was seen using a flintlock pistol when dealing the deathblow to Whitebeard along with the other Blackbeard Pirates, and also has three pistols tied in his sash. His accuracy with them is not completely shown, as he was only seen emptying his ammunition into Whitebeard at point-blank range yet Whitebeard was still briefly alive."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b6/WB_Commanders_at_FI.png/revision/latest/scale-to-width-down/210?cb=20130510050930", "caption": "Teach's claw weapon at age 20."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Riding with Whitebeard", "level": 4, "content": [{"type": "paragraph", "text": "Before meeting Whitebeard, Teach lived as an orphan. 28 years ago at age 12, he encountered Whitebeard and his crew and asked to join them, a request that Whitebeard granted. In truth, Blackbeard aspired to become the Pirate King. In order to do this, he wanted the Yami Yami no Mi and he joined the Whitebeard Pirates to search for it, thinking that he would have the best chance of obtaining the fruit that way. He would then serve under Whitebeard for at least 20 years before his betrayal. 22 years ago, after Shiki escaped Impel Down, Blackbeard at age 18 was present amongst Marco, Jozu, Vista, Blenheim, and Haruta while the Flying Pirate spoke to Whitebeard about his plan."}], "images": []}, {"title": "Blood and Betrayal", "level": 4, "content": [{"type": "paragraph", "text": "More than twelve years before the current storyline, Blackbeard and Shanks fought in a battle. During the battle, Blackbeard gave Shanks the three scars by his eyes. Blackbeard eventually became a member of the second division and encouraged Ace to seek the commander position, refusing it himself on the basis that he didn't \"have that kind of ambition\"."}, {"type": "paragraph", "text": "One day, Thatch, commander of the Whitebeard Pirates' fourth division, found a Devil Fruit. Recognizing it as the Yami Yami no Mi, the very reason he joined the Whitebeard Pirates for, Blackbeard killed Thatch to get the fruit and fled. For killing a crewmate and betraying his \"father\", Second Division Commander Portgas D. Ace went after Blackbeard to kill him, despite Whitebeard's reluctance to send Ace to his possible doom. The time Ace began to chase Blackbeard was around some time after Luffy left Arlong Park since in a flashback, Ace was showing Whitebeard Luffy's first bounty and being proud of it. By this point, however, Blackbeard had already gained a crew and began his own open acts of piracy."}, {"type": "paragraph", "text": "Blackbeard then assembled the Blackbeard Pirates, composed of Laffitte, a former policeman from the West Blue and the crew's navigator, Van Augur the sniper, Jesus Burgess the helmsman, Doc Q the doctor, and Stronger, Doc Q's horse. Some time after, his pirate crew pillaged the Drum Kingdom, causing its king, Wapol, to flee and ironically liberating Drum Kingdom from Wapol's tyranny."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Thatch_and_Yami_Yami.png/revision/latest/scale-to-width-down/210?cb=20130510051454", "caption": "Teach setting his eyes on the Yami Yami no Mi."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Luffy defeated Crocodile in Alabasta, Laffitte nominated Blackbeard to become one of the Shichibukai to take Crocodile's place. The World Government declined as Blackbeard did not have any reputation."}, {"type": "paragraph", "text": "In a bar, Luffy and Blackbeard sit next to each other and both suddenly made a remark about the cherry pie being served to them. Noticing that both their remarks oppose one another, Luffy and Blackbeard decided not to mind each other and just drink some soda. After drinking the soda, they both once again made opposing remarks. Really noticing each other this time around, both of them were starting to get mad at the other's preference. The two then decided to have some food for take out, with Luffy ordering pieces of meat and Teach ordering cherry pies. However, upon learning the number of food that the other was ordering, the two started competing about who can order more. At this moment, Luffy and Blackbeard decided to fight each other over the meaningless argument. Not wanting any trouble in his tavern, Terry gave Teach his pies and requested his departure. As Blackbeard was leaving the tavern, Bellamy entered much to the other customers' surprise."}, {"type": "paragraph", "text": "After Luffy and Zoro took a beating by Bellamy, Blackbeard told Nami that Skypiea exists. He then asked why Nami was sad when there was nothing to be sad about since Luffy and Zoro won that fight. Blackbeard said that the \"new age\" they talk of was nonsense and laughed that the age in which pirates dream will never end. While he went on with his speech, everyone wondered what he was yelling so loudly for. Blackbeard said that some battles are pointless and laughs. He later left and wished the Straw Hats good luck on their trip to Sky Island. Blackbeard then laughed, saying that his rum tasted good."}, {"type": "paragraph", "text": "After learning his identity, Blackbeard planned to capture Luffy, who had a 100,000,000 bounty on his head as well as Zoro, who had a 60,000,000 bounty. While the Straw Hats were preparing to ride the Knock-up Stream, he approached the crew on his raft-esque ship and showed the new bounties. Before he could capture Luffy and Zoro, his ship was destroyed when the Knock Up Stream shot the Straw Hats into the sky."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f1/Teach_Encourages_Luffy.png/revision/latest/scale-to-width-down/210?cb=20130705174701", "caption": "Teach encourages Luffy by telling him that \"the dreams of men will never die\"."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Blackbeard and his crew were seen again on Banaro Island. After pillaging a town, Blackbeard read a newspaper about the Enies Lobby incident and remarked that Luffy's bounty will surely rise. Before they could leave to pursue him, Ace appeared and challenged them."}, {"type": "paragraph", "text": "Blackbeard called him commander, but Ace told him to save it. Blackbeard continued to act friendly, saying it had been a long time since they have seen each other, but Ace reminded him that he killed one of his comrades and doing so is unforgivable. Blackbeard then offered Ace to join his crew, saying they would be invincible if he joined. He then went on to say that the reign of Whitebeard will soon end and their first step was Monkey D. Luffy. He suggested Ace to come with him to kill Luffy (as he was still in Water 7 at the time), but Ace said that Luffy is his brother and outright refused to join his crew."}, {"type": "paragraph", "text": "Van Augur attempted to shoot Ace who retaliated with Higan and shot fire bullets rapidly at Van Augur. Jesus Burgess tossed an entire house at Ace, but it was easily burned by a Fire Pillar. Blackbeard yelled at Augur and Burgess, telling them that Ace was way out of their league and that they should fall back. Suddenly, Ace used Hiken to burn Blackbeard. Blackbeard managed to survive the attack and got back up. He admitted that he killed Thatch as he had the Devil Fruit that he had been searching for. He recognized the fruit Thatch was holding since he had researched the size and shape of the fruit. He revealed that he spent decades on Whitebeard's ship, because he knew he had a better chance of finding the fruit. He waited there for so long until it finally came to him in his commander's hands. He said that getting the Devil Fruit was his fate, and with it, he will be the greatest. His hand began to dissolve into darkness as he said that even for a Logia, this fruit is very special. His whole body began to radiate in a black glow as he said that he is \"darkness\"."}, {"type": "paragraph", "text": "Ace questioned Teach's Devil Fruit abilities, but Teach stated that his fruit, the Yami Yami no Mi, is said to be the strongest of the Devil Fruits and that Ace cannot kill him. Meanwhile, the townspeople saw black smoke in the town and noted that the pirates were still present so they should run. The rest of the Blackbeard Pirates were fleeing, saying that Teach was about to go wild. Blackbeard sent tendrils of darkness in every direction, enveloping the buildings and scaring the escaping townspeople. Some citizens said that the smoke reminded them of a hole in the ground, but they continued through the forest and out to the coast. Teach explained that his darkness is infinite gravitation that sucks everything in including light. Ace commented that the darkness was not approaching him, but Teach stated that he was not attacking yet, but he was merely demonstrating. Suddenly, Teach activated his \"Black Hole\" and sucked all of the town's contents, including its buildings, into his darkness, making them disappear. Teach stated that the darkness will draw in any object and crush it and proceeded to tell Ace that he would show him the town in its ruined form. Teach then used \"Liberation\" to send the ruined pieces of the town flying out into a ring around Ace and Teach. The civilians were stunned by the destruction of their town, but Teach simply bragged about his ability."}, {"type": "paragraph", "text": "However, he realized too late the small points of flame from Ace's \"Hotarubi\" which exploded, coating him in flames. While Teach rolled around in pain, Ace stated that he understood the power of the Yami Yami no Mi, but said that if Teach was a Logia, he should have been able to avoid his attack. The darkness quickly absorbed the flames, and Teach stood back up, saying that his fruit can suck in everything, including punches, thunder, flame, and especially pain, meaning that he cannot fend off attacks like other Logia. Disregarding this flaw, Teach stated that there was one more thing he could do and proceeded to drag Ace towards him with gravitation. Seizing Ace's shoulder, Teach stated that Ace must have noticed the ability and punched Ace hard in the stomach."}, {"type": "paragraph", "text": "Ace was sent flying as Teach commented on how long it must have been since Ace was last punched. Teach explained that he can suck in the \"devil's power\" so that while he is touching a Devil Fruit user, they cannot use their powers. Teach stated that he has gained a power that cannot be defended against for Devil Fruit users who overrate their abilities. Ace replied that he could only neutralize Devil Fruit powers as long he touched the user. Teach stated that Ace could not escape and dragged him forward with his gravity again. Ace launched two flaming spears that pierced and burned Teach's chest, but Teach landed a powerful punch that nearly broke Ace's neck. Crossing his fingers, Ace fired a flaming cross, but Blackbeard merely grinned. Van Augur commented that he had thought that a Devil Fruit user would be weak and powerless without his ability, but that Ace's basic fighting power was amazing and had earned him a spot as Whitebeard's division commander, which was another one of fate's crossroads. The civilians watched as their island was destroyed and Banana Rock fell, stating that no human could do this much damage and put their entire island at risk."}, {"type": "paragraph", "text": "Ace fell as Blackbeard stated that nothing stands a chance in front of darkness and offered Ace another opportunity to join his crew as it would be a waste of his strength if he were to die. Ace refused, saying that if he gave in, there would be no point in living. Teach laughed, saying that survival is what matters in the world. Ace then gathered fire around him before forming it into a large flaming orb. Teach stated that only one of them could win while Ace declared his desire to make Whitebeard the king. Their attacks collided with no shown result. The only hint was Ace's trademark hat lying on the ground. This incident was described as the trigger for a later event coming soon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Duel_on_Banaro_Island_Infobox.png/revision/latest/scale-to-width-down/210?cb=20141206161245", "caption": "Blackbeard's crushing darkness and Ace's burning flames collide."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "He answered the call of the Shichibukai to battle Whitebeard and was joining the war. He was later shown dining with the other Shichibukai, except for Jinbe and Boa Hancock."}], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Prior to the war with Whitebeard, Teach took his entire crew to Impel Down and commenced an attack on the jailers. He excused himself by stating that he was on \"their\" side. On his way through Level 1, the Crimson Hell, he encountered Shiryu, whom Blackbeard initially misidentified as Magellan. He later inexplicably arrived at Level 4, where he and his crew took down both the Bazooka Unit and Hannyabal. Jinbe showed anger towards Blackbeard while Luffy realized that the man at Jaya who had told him to never stop dreaming is the same one responsible for his brother's imprisonment. Blackbeard taunted Luffy about Ace's oncoming execution, provoking his wrath."}, {"type": "paragraph", "text": "Though Blackbeard told Luffy to praise his good luck (as Blackbeard would surely have killed Luffy instead of just defeating Ace, had Ace let Blackbeard off the hook), Luffy angrily attacked the Shichibukai in Gear Second with Gomu Gomu no Jet Pistol. The two had a small skirmish, but it was stopped by Jinbe, who told Luffy not to waste time fighting Blackbeard now as he had to save Ace. Blackbeard noted Luffy's Haki has improved and admitted he had underestimated Luffy's strength. When Magellan showed up, Blackbeard allowed Luffy and the rest proceed to Level 3."}, {"type": "paragraph", "text": "Blackbeard even received a comment from Jinbe that his assault on the Great Prison proved instrumental for the breakout. Blackbeard then replied that he was also grateful for them, since a panic within Impel Down prior to him and his crew's arrival was exactly what they needed, right before stating that his crew and him would \"shake the whole world to its core\". The Blackbeard Pirates later came face-to-face with Magellan. During the confrontation, the warden quickly poisoned the entire crew with his Hydra. Blackbeard stated that the pain was unbearable and screamed, as Magellan walked past them to pursue Luffy."}, {"type": "paragraph", "text": "Blackbeard and his crew survived from Magellan's poison by receiving an antidote from Shiryu. Blackbeard then commented that Shiryu would make a fine addition to his crew and invited him to join his crew again. Shiryu accepted, stating that he was waiting for a man of his stature."}, {"type": "paragraph", "text": "After recruiting Shiryu, Teach made his way down to Level 6 where he invited anyone with the will to be free again to join his crew. However, there was one catch: the prisoners in their cells would have to kill each other in order to prove their strength to him and only the sole survivors of each cage would gain their freedom. It is unknown just how many prisoners died as the result, but Blackbeard got four more recruits: Sanjuan Wolf, Avalo Pizarro, Vasco Shot and Catarina Devon. With that, the newly reinforced Blackbeard Pirates left the prison and headed for Marineford, either not knowing or not caring that some other Level 6 prisoners survived and slipped out of prison."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/42/Luffy_and_Blackbeard.png/revision/latest/scale-to-width-down/210?cb=20130510051129", "caption": "Blackbeard and Luffy meet again."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/26/Luffy_Uses_Jet_Pistol_on_Blackbeard.png/revision/latest/scale-to-width-down/210?cb=20130401231143", "caption": "Blackbeard knocked back by Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/83/Blackbeard_Freeing_Prisoners.png/revision/latest/scale-to-width-down/210?cb=20160129131754", "caption": "Teach has the Level 6 prisoners fight to join his crew."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Blackbeard later appeared at Marineford, having snuck in to see his former captain's death. He was seen with the new recruits from Impel Down. Blackbeard then told Sengoku that the sole reason he obtained the title of Shichibukai was to gain the means to break into Impel Down and gloated that he no longer needed that title anymore."}, {"type": "paragraph", "text": "Acting as the vanguard of their attack, Blackbeard initiated his crew's assault by using his Devil Fruit powers to increase the gravity upon the ground from which Whitebeard stood, binding him in place, and then used Kurouzu to pull Whitebeard into his grasp to nullify the latter's Gura Gura no Mi powers. Unfortunately for Blackbeard, this did not completely deter the Yonko, who struck Teach down using his bisento, sending him to the ground. Whitebeard then proceeded to reprimand him that overconfidence and rashness were his weaknesses and continued by placing a strong grip around Teach's neck and sent a powerful shock wave bubble at point-blank range upon his head, once again sending a massive tremor throughout Marineford."}, {"type": "paragraph", "text": "Having lost his composure, Blackbeard ordered his men to fire everything they got on his former captain. Despite this, Whitebeard held his ground with his final words being that Blackbeard is not the one whom Roger is awaiting. After that, Blackbeard was shocked to see Whitebeard died standing."}, {"type": "paragraph", "text": "Blackbeard and his crew then quickly covered Whitebeard's body with a black cloth, which Blackbeard entered as well for a short time. After that, he emerged from the cloth and showed off not only the power of the Yami Yami no Mi, but also the Gura Gura no Mi as he inexplicably managed to extract that power from Whitebeard's body. With a mighty laugh, Blackbeard proclaimed to everyone present and everyone watching these events that from that moment on, this was his era."}, {"type": "paragraph", "text": "Overconfident with his newfound powers, he began to wonder if sinking down Marineford would be a good start. He and the rest of his crew were promptly sent flying by an enormous shock wave delivered by Sengoku in his Buddha form. The fleet admiral warned him about his cockiness, and Teach replied that he was looking forward to see Sengoku protecting Marineford, prepared to continue the fight. After he destroys more of Marineford, Blackbeard was warned by his crewmates to not destroy the ground they were standing on. Blackbeard admitted he was having some difficulty controlling the newfound power. He then taunted Sengoku and Garp, stating that he will end their age just like he ended Whitebeard's. He seemed to have been somewhat shocked by Koby's speech, and - upon Shanks's arrival - ultimately decided to leave Marineford, stating that he will fight the Red Hair Pirates another day."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/The_New_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/210?cb=20160322173214", "caption": "The Blackbeard Pirates arrive with five new recruits."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Whitebeard_vs_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/210?cb=20151018201408", "caption": "The Blackbeard Pirates ganging up and mercilessly attacking Whitebeard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/54/Sengoku_Attacks_the_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/210?cb=20130914170940", "caption": "Sengoku stops the Blackbeard Pirates."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Blackbeard made his move in the New World, defeating Jewelry Bonney in the process. At a burning island, the crew was seen bickering amongst each other. The Blackbeard Pirates' raft was brought close to the point of destruction due to Sanjuan Wolf's size, and they seemingly got in contact with the Marines to trade Bonney for a battleship. Teach said Bonney was too weak to survive in the New World. He offered her the chance to be his woman and let her stay, but she turned him down, kicking him in the head (due to only her hands being tied up). Van Augur alerted Teach that the battleship arrived, but not for trade because Akainu was on board. Knowing that the deal would not happen, the Blackbeard Pirates fled, leaving Bonney and her crew behind to be arrested."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d5/Jewelry_Bonney_As_Blackbeard%27s_Prisoner.png/revision/latest/scale-to-width-down/210?cb=20131108115338", "caption": "Blackbeard holds Jewelry Bonney prisoner."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "Blackbeard used his knowledge of Whitebeard's former territory to conquer it and become one of the Yonko. During this time, Teach also expanded the crew into a fleet, and with it the hierarchy of the crew was also changed - promoting all of his crewmates to \"captains\" of their own respective ships, while Teach himself ascended to the newly-formed position of \"admiral\", giving him command over all the captains and their ships. The Blackbeard Pirates are currently in the process of hunting down powerful Devil Fruit users in order to absorb their abilities."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Payback_War_Infobox.png/revision/latest/scale-to-width-down/230?cb=20190712004413", "caption": "Blackbeard vs. Marco."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the tournament for the Mera Mera no Mi at Dressrosa, Teach was heard discussing the possibility of recruiting Kuzan to join their crew with Jesus Burgess via Den Den Mushi, to which Burgess asserted that the former admiral could not be trusted. When Burgess announced that Luffy had arrived, Blackbeard greeted the young pirate and voiced surprise that he was a combatant as well. Knowing why Luffy entered the tournament, Teach assured him that Burgess would be the combatant to obtain the devil fruit and that it would be the same as having Ace join his crew since the latter rejected his previous offer. Luffy then angrily stated that he would never allow him to steal Ace's power."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates later attacked Baltigo, the Revolutionary Army's headquarters. Baltigo was destroyed by the time the Marines and Cipher Pol arrived but the revolutionary army was able to escape. However, Blackbeard and his crew fled after briefly clashing with Cipher Pol."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Teach read the newspaper and laughed while commenting that it was too soon for Luffy to be called an Emperor."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Gecko Moria was searching for Blackbeard and Absalom at Hachinosu when he was confronted by Shiryu and Catarina Devon. Teach called out to Moria through a loudspeaker, extending an offer for Moria to join his crew and remarking on current events in Wano and at Levely."}, {"type": "paragraph", "text": "After the Levely, Teach ordered his crew to set sail as he was planning to acquire someone or something before they could be taken by the Marines."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Marshall D. Teach vs. Shanks (details unknown, yet left Shanks with his scar)", "elements": []}, {"text": "Marshall D. Teach vs. Thatch (past unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Drum Kingdom", "elements": []}, {"text": "Marshall D. Teach vs. Portgas D. Ace", "elements": []}, {"text": "Blackbeard Pirates vs. Impel Down Guards (Level 1)", "elements": []}, {"text": "Marshall D. Teach vs. Hannyabal and Bazooka Unit", "elements": []}, {"text": "Marshall D. Teach vs. Monkey D. Luffy (interrupted by Jinbe)", "elements": []}, {"text": "Marshall D. Teach vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Fleet Admiral Sengoku", "elements": []}, {"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco) (unseen, during timeskip)", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the manga, it has not been explained how exactly Teach killed Thatch, but in the anime, it is shown that Teach literally stabbed him in the back.", "elements": []}]}, {"type": "list", "elements": [{"text": "In the anime, the fight between Blackbeard and Whitebeard is slightly extended, as Blackbeard punched Whitebeard several times while having the latter in his grip. He also shot Whitebeard in the heart with his flintlock and fired several more times before ordering his crew to join in; in the manga, he simply ordered them to attack right after surviving one of Whitebeard's quake bubbles. Also, the wound he received from the Whitebeard's bisento was not as brutal as it was in the original manga. In the manga, the Yami Yami no Mi was in Blackbeard's left hand and the Gura Gura no Mi was in his right. In the anime, they are reversed.", "elements": []}]}, {"type": "list", "elements": [{"text": "In the anime, the fight between Teach and Sengoku is also extended, with the former's quake punch and the latter's shockwaves tearing apart Marineford. Sengoku knocked Teach back with another shockwave, but he retaliated by tilting the island just as Whitebeard had done. Jesus Burgess jumped into the fight to assist, but was knocked back by the intervention of Garp.", "elements": []}]}, {"type": "list", "elements": [{"text": "When Blackbeard shifted the seas, the tsunami saved the Heart Pirates from a naval bombardment and a longer scene of people escaping Sabaody Archipelago is shown.", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "One Piece Green: Secret Pieces revealed an early concept of Blackbeard. He was originally named Everything D. Teach (エブリシング・・ティーチ, Eburishingu Dī Tīchi)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Early_Blackbeard.png/revision/latest/scale-to-width-down/185?cb=20150403174458", "caption": "Early concepts of Blackbeard from One Piece Green."}]}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "As a prominent character, Blackbeard has multiple pieces of merchandise. He has been featured with the Shichibukai in the series of One Piece Shichibukai Cellphone Strap and the One Piece Super Deformed Figures. He was also released along with Crocodile in the One Piece Super Effect - Devil Fruit User series. Blackbeard was released in the One Piece DX Figure models. He was also released in the One Piece World Collectable Figure series in July 2010 along with the rest of the Shichibukai."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fa/DXShichibukai-Blackbeard.png/revision/latest/scale-to-width-down/110?cb=20130223114750", "caption": "One Piece DX Blackbeard figure."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "Jump Force", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Grand Battle 3", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Blackbeard's real name, \"Marshall D. Teach\", is spelled differently in some English versions. The Viz Manga, Edited FUNimation dub, and Simulcast subtitles spell his name as \"Teech\", going with a more phonic spelling. It should be noted that though it is spelled differently, it is still pronounced the exact same. Once FUNimation's DVD release reached the point of Blackbeard's introduction, it was confirmed to now be spelled as \"Teach\" in the subtitles and translation of his name title card. Also, in the FUNimation dub, his distinct laugh (Zehahahahahahaha) was not present when they first dubbed One Piece during the Jaya Arc, but now they not only use Blackbeard's laugh, but everyone's distinct laugh in the newer dubbed episodes."}, {"type": "paragraph", "text": "Also, it should be noted that though his epithet, \"Kurohige\" is translated universally as \"Blackbeard\", a more accurate translation would be \"Black Facial Hair\" as the Japanese language uses the word \"Hige\" to refer to all facial hair, regardless of whether it is a full beard or just a mustache."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oda once stated that Blackbeard was his favorite historical pirate.", "elements": []}, {"text": "In Chapter 581, when addressing the prisoners of Level 6 of Impel Down, he is shown with a full mouth of teeth. This was likely a mistake on Oda's part.", "elements": []}, {"text": "Teach is the first Shichibukai without an animal motif.", "elements": []}, {"text": "Teach's favorite food is cherry pie, as well as kebab.", "elements": []}, {"text": "Curiously, in One Piece Blue: Grand Data File, that covers from the East Blue Saga to the middle of the Jaya Arc, Teach is not revealed as Marshall D. Teach or Blackbeard, but as \"Cherry Pie Man\", a regular customer of the Mock Town Pub.", "elements": []}, {"text": "Teach is the only known person to serve as both a Shichibukai and later a Yonko.", "elements": []}, {"text": "Teach is the only known Yonko to once serve under another Yonko's crew.", "elements": []}, {"text": "In the 6th fan poll, Teach ranked 49th.", "elements": []}, {"text": "Blackbeard's original name, Everything D. Teach, may come from 17th-century English pirate Henry Every, famous for becoming the richest pirate in the world at the time and getting the highest bounty in history placed on his head.", "elements": []}, {"text": "Blackbeard had the lowest former bounty among the Shichibukai (being none at all) and currently has the lowest bounty among the Yonko.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Blackbeard's epithet and first name comes from the infamous Edward Teach, the real-life Blackbeard. Edward Teach is not only the namesake of Blackbeard, but also of the character's former captain Edward Newgate and his crewmate and victim Thatch, as Edward Teach was also referred to as Edward Thatch.", "elements": []}, {"text": "Teach's birthday, August 3, comes from his Devil Fruit's name since 8-3 can be derived from ya-mi.", "elements": []}, {"text": "If One Piece was set in the real world, then Teach would be from Somalia.", "elements": []}, {"text": "If Teach was not a pirate, then he would be an archaeologist.", "elements": []}, {"text": "Teach's hobbies are gambling and researching history.", "elements": []}]}], "images": []}]}