{"sections": [{"title": "Alvida", "level": 1, "content": [{"type": "paragraph", "text": "\"Iron Mace\" Alvida is the former captain of the Alvida Pirates and the first antagonist encountered by Luffy in the anime present timeline (in the manga, Higuma was the first villain). Due to her actions, she can be regarded as the secondary antagonist of the Romance Dawn Arc and the tertiary antagonist of the Loguetown Arc."}, {"type": "paragraph", "text": "After her defeat against Luffy, she allies with Buggy and becomes one of the two captains of the Buggy and Alvida Alliance. She was the acting captain of the crew during Buggy's time in Impel Down and during the Battle of Marineford. After reuniting with Buggy, his army of Impel Down Convicts, and Galdino (and with the addition of Buggy becoming a Shichibukai), her alliance with him has evolved into the Underworld Organization known as Buggy's Delivery."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Originally, Alvida was a tall and very obese woman with long wavy black hair, and freckles on her cheeks."}, {"type": "paragraph", "text": "She wore a white cowgirl hat with a large red plume, a red neckerchief, a pink plaid shirt, and a blue captain's coat over it with the arms in the sleeves unlike many other pirates. She wore rings on her fingers and her long sharp fingernails had red polish. She had a purple sash with a flintlock pistol tucked in it and some jewels. She also wore graying pants and red shoes with gold buckles."}, {"type": "paragraph", "text": "By eating a Devil Fruit, Alvida has transformed by shedding the excess weight from her body. The Sube Sube no Mi makes Alvida very slippery and, aside from the cowboy hat she wears, Alvida looks totally different from her original form, being slim, well-endowed, with dark-green eyes (before is brown), while maintaining her original hair."}, {"type": "paragraph", "text": "She still has her cowboy hat, but she now dresses in a pearl necklace, a bikini top, and tight Capri-length pants. She sometimes has a purple coat draped over her shoulders. She wore a pair of sandals (shoes later in the Post-War Saga in the anime), and now tends to wear shoes that can slip off easily so she can use her Sube Sube Spur technique with the slippery soles of her feet. She still wears lipstick, polish on her now shorter fingernails, and her toenails are shown painted as well (something that before was not visible before due to her shoes). During her appearance in Loguetown, she also had a cape-like, pink cloak with red hearts on it."}, {"type": "paragraph", "text": "Most people that see her actually fall in love with her (as seen in Loguetown, even women), similar to Boa Hancock. Delusional (or, most likely, in denial) on her former appearance, Alvida comments that her change after eating the Devil Fruit was simply that it \"made her freckles disappear\"."}, {"type": "paragraph", "text": "After the timeskip, she replaced her cowboy hat with a red-and-white top hat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She sees herself as the most beautiful lady in all of the sea, even when she had a much more fat and neglected appearance. If someone would disagree, she would smash the offender with her iron mace."}, {"type": "paragraph", "text": "She does not like noise and dirty things, nor does she take to risking her life against overwhelming odds. She can be foreboding to men, especially subordinates and is not afraid to put her foot down firmly on things that go against her interests. When pushed, she can be cruel above all else."}, {"type": "paragraph", "text": "Disliking filth and laziness, her crew was forced to clean the entire deck of her ship. If there is even a hint of dust, she would smash that person with her club."}, {"type": "paragraph", "text": "Before she found and ate the Sube Sube no Mi, people used to say that she was the most beautiful woman in the world just to avoid getting hit by her iron club. After she ate her Devil Fruit, their comments became genuine thanks to her new beauty, even though Boa Hancock and the Mermaid Princess have also been called the most beautiful women in the world. After eating the Devil Fruit, she also underwent a personality change. She speaks in much softer tones and is somewhat less prone to hitting her crew with her iron mace, despite the fact that her men (and any other men) are too distracted by her appearance to care when they are hit by her mace."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Buggy Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Alvida at first traveled with Buggy, though only because they have a common person they wish to find (Luffy). She, however, did not seem to tolerate Buggy and his crew's constant noise making and asked his crew to not be so noisy. Also, she did not hesitate to abandon him when the crew met a dead end in their quest to free Buggy."}, {"type": "paragraph", "text": "In turn, the Buggy Pirates ended up serving her due to the loss of their captain. She seemed to have no problem with Buggy returning to being the other captain of the Alliance when the original Buggy Pirates found Buggy and his group of Impel Down ex-prisoners after the war."}, {"type": "paragraph", "text": "After Buggy became a Shichibukai, Alvida became a member of his Pirate Dispatch Organization."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Since Luffy was the first man to defeat her, Alvida became quite infatuated with him. However, unlike the Pirate Empress's schoolgirl-like crush for Luffy, Alvida's is more of an admiring love. She did show a little disappointment when Buggy tried to kill him in Loguetown though."}], "images": []}, {"title": "Koby", "level": 4, "content": [{"type": "paragraph", "text": "She is the prime enemy of Koby, who has not forgotten the years of hard labor and abuse she put him through. He had boldly stated it was pirates like her that he wished to arrest when he declared his rebellious words to her."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Initially, Alvida was only mildly formidable by East Blue standards. Though large and strong enough to captain her own crew and earn a minor bounty, she was quickly outfought and knocked unconscious by Luffy. She successfully landed only one blow, which was rendered completely ineffective by Luffy's rubber body and the angling of the spikes on her mace. Her intellect was also unremarkable and easily overtaken by her temper and vanity."}, {"type": "paragraph", "text": "Following her defeat by Luffy, she became noticeably more resourceful and judicious. With apparently no extrinsic help, she was able to navigate the East Blue and secure an alliance with Buggy, her coolheaded prudence counterbalancing his easily-excited crewmen."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Alvida ate the Sube Sube no Mi, a Paramecia-class Devil Fruit that grants her the ability to harmlessly \"slide\" virtually any physical attack off her skin. This also allows her to \"skate\" along level surfaces on her bare feet, though she apparently requires a ramp to build up initial momentum."}, {"type": "paragraph", "text": "In addition, the Sube Sube no Mi drastically changed her physique, eliminating her previous bulk and making her beautiful enough to charm whole crowds of men on sight. This new physique has apparently not affected any of her physical prowess, as she is still strong enough to wield her Iron Mace with ease."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Sube_Sube_no_Mi.png/revision/latest/scale-to-width-down/210?cb=20130312214009", "caption": "Combining her slipperiness with a ramp, Alvida prepares to escape Loguetown."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Alvida's trademark weapon is a heavy, spiked Iron Mace (金棒, Kanabō, \"Iron Club\" in the English versions), which can easily maim or kill an ordinary man in one swing. She can also throw it with enough accuracy - at least from short distances - to shatter an entire wooden shack."}, {"type": "paragraph", "text": "In addition to the mace, she also carries at least one flintlock pistol at all times, and was skilled enough to drive off a giant crab with one shot."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Alvida%27s_Iron_Mace.png/revision/latest/scale-to-width-down/120?cb=20130414030907", "caption": "Alvida's iron mace, from which her epithet originates."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Alvida had formed her own crew and terrorized the East Blue for some time when a young boy named Koby accidentally boarded her ship, the Miss Love Duck. On discovering him (and his considerable seafaring knowledge), Alvida forced him to be her cabin boy, keeping him cowed with constant threats and physical abuse."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Romance Dawn Arc", "level": 4, "content": [{"type": "paragraph", "text": "Approximately two years after \"recruiting\" Koby, Alvida crossed paths with the novice pirate Monkey D. Luffy (whom her subordinates had inadvertently saved from a whirlpool). Caring for neither her reputation nor her strength, Luffy openly defied her and her vanity, in the process rekindling Koby's courage and dream to join the Marines."}, {"type": "paragraph", "text": "Seeing Koby joining Luffy's defiance, Alvida attacked in a rage. To her (and Koby's) shock, however, Luffy's rubber physique easily withstood her strongest blow head-on. Before she could regain herself, Luffy knocked her unconscious with a Gomu Gomu no Pistol."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Luffy_Fights_Alvida.png/revision/latest/scale-to-width-down/210?cb=20130120053945", "caption": "Alvida ineffectively hits Luffy."}]}, {"title": "Buggy's Crew Adventure Chronicles", "level": 4, "content": [{"type": "paragraph", "text": "After her defeat, Alvida apparently abandoned her crew and began a search for Luffy. In the midst of her journeys, she ate the Sube Sube no Mi, a Devil Fruit that gave her slipping abilities and, as an after effect, made her slender and beautiful."}, {"type": "paragraph", "text": "Along her journey she also discovered the shrunken and defeated Buggy, whom she rescued from a giant crab and allied with due to their shared desire to locate Luffy. They worked together to reunite with the rest of the Buggy Pirates, defeated the Kumate Tribe who were preparing to eat the crew, and reclaimed the missing sections of Buggy's body that had been tied up by Nami."}], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "After arriving in Loguetown, she surprised Luffy who was busy admiring the scaffolding upon which Gol D. Roger was executed. She helped Buggy in the attempt to execute Luffy, but failed once more. It was during this time that she reveals to Luffy her transformation into a beautiful woman, and that she has fallen for him for being the first man willing to punch her."}, {"type": "paragraph", "text": "She and Cabaji watched as Buggy attempted to execute Luffy, and expressed slight disappointment when she thought Luffy could not escape from the situation. Lightning struck down Buggy and saved Luffy. When she and Buggy tried to pursue Luffy, she and the rest of the crew were captured by Smoker and put in a Seastone Net. However, they later escaped somehow and decided to head to the Grand Line to follow Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Alvida_even_women_love_her.png/revision/latest/scale-to-width-down/210?cb=20130312214512", "caption": "The men and women at the center of Loguetown are affected by her beauty."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "She decided to stay with the Buggy Pirates, with her own crew nowhere in sight. After Buggy mistook a cave for the place where Captain John buried his treasure, only to find some diggers working in it, Alvida complained about the noise the crew made as they partied onboard Big Top, and that they do not know where Luffy is."}, {"type": "paragraph", "text": "Portgas D. Ace appeared, offered his help, and helped himself to their food. Buggy explained his worry about messing with a member of the Whitebeard Pirates, and Alvida was impressed by his knowledge of Whitebeard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/89/Alvida_Complains.png/revision/latest/scale-to-width-down/210?cb=20191202122303", "caption": "Alvida complaining about the crew's party and not knowing where Luffy is."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime later, Buggy entered a Marine garrison thinking it was another cave with Captain John's treasure, and was captured and taken to Impel Down."}], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "After buying an Eternal Pose, the Buggy and Alvida Alliance sailed to the Calm Belt near Impel Down, where a Marine spotted ship but did not recognize the Jolly Roger so Vice Admiral Momonga decided to ignore the ship due to their tight schedule."}, {"type": "paragraph", "text": "The Buggy Pirates balked at the sight of a Sea King and the Calm Belt and begged for Alvida to help them rescue Buggy. They wished to complete their quest to find Captain John's hidden treasure, but Alvida threatened to keep the ship for herself and to make those who wished to rescue Buggy take a lifeboat to do so. After convincing the rest of the crew that attempting to rescue Buggy would prove futile, the crew members called out apologies to their imprisoned captain and sailed away. It is unknown if the crew acknowledged Alvida as their new captain, but they did respect her judgment and looked to her for orders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Alvida_Takes_Control_Over_Buggy_Pirates.png/revision/latest/scale-to-width-down/210?cb=20191203210610", "caption": "Alvida takes the leadership of the Buggy Pirates after Buggy's arrest."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "On an island in the Grand Line, the Buggy and Alvida Alliance reunited with Buggy. When the other pirates claimed that they never gave up on Buggy, Alvida pointed out that they abandoned him after his imprisonment in Impel Down. She commented on how many prisoners she recognized from their wanted posters. Buggy then showed Alvida the recently acquired treasure mark of Captain John, which left Alvida stunned and wondering how he got it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Buggy_and_Alvida_after_the_War.png/revision/latest/scale-to-width-down/210?cb=20160808174106", "caption": "Buggy shows Captain John's armband to Alvida."}]}, {"title": "Post-Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After Buggy became a member of the Shichibukai, Alvida is currently allied with Buggy's Pirate Dispatch Company. It is unknown if she received a pardon along with Galdino and the rest of Buggy's Crew due to Buggy's Shichibukai status."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "On Karai Bari Island at Buggy's Pirate Dispatch Company, she was sitting behind Buggy at a feast with Mohji, Richie, Cabaji, and Galdino as they celebrated the defeat of Donquixote Doflamingo and the positive effect it had on their business. Mohji then revealed that Hajrudin and his crew had quit the dispatch company to align themselves under the flag of the Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Buggy_Showing_Off_as_His_Crew_Feasts.png/revision/latest/scale-to-width-down/210?cb=20160807115245", "caption": "Buggy's dispatch company celebrates Donquixote Doflamingo's defeat."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the abolishment of the Shichibukai system, those on Karai Bari Island were confronted by a Marine fleet led by Stainless."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Alvida vs. Monkey D. Luffy", "elements": []}, {"text": "Alvida and Buggy vs. Marines", "elements": []}, {"text": "Alvida and Buggy vs. Smoker", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "According to her wanted poster in the anime, her name is spelled Aluvida, as seen in Episode 45 and Movie 9; however, in the manga her name is shown to be spelled \"Alvida\"."}, {"type": "paragraph", "text": "In Vivre Card - One Piece Visual Dictionary, her name is spelled \"Alvida\" in her card. But for unknown reason, in her wanted poster also shown in the same card, is spelled as \"Albida\"."}, {"type": "paragraph", "text": "In the 4Kids dub, Alvida speaks with a southern accent to go with her cowgirl hat."}, {"type": "paragraph", "text": "In the original version of the Loguetown arc, when Alvida explains her Devil Fruit powers, she claims that the only thing the Sube Sube no Mi did for her appearance was remove her freckles. In the 4Kids dub, she clearly admits that the fruit made her pretty."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/71/Alvida_Anime_Wanted_Poster.png/revision/latest/scale-to-width-down/210?cb=20121209052942", "caption": "Alvida's name misspelled on her bounty poster from Movie 9."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Alvida first meets Luffy at her hideout on Goat Island, and the encounter is relatively short and subdued; almost immediately after insulting her (and inspiring Koby to do the same), Luffy fells her with a Gomu Gomu no Pistol to the cheek."}, {"type": "paragraph", "text": "The anime changes this meeting to take place during a raid on a civilian vessel (which Koby has been forced to participate in). The general sequence of events remains unchanged, but is expanded with a short battle between Luffy and her crewmen, as well as a dialog where she acknowledges Luffy's Devil Fruit abilities but scorns his capacity to be a pirate. Her defeat is also embellished, with Luffy's Gomu Gomu no Pistol portrayed as a blow to the stomach that that launches her out into the distant sea."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "So far she has only appeared in the Anichara Heroes, Ichiban Kuji, One Piece DeQue, Gashapon Full Color Collection From TV Animation One Piece and World Collectable series."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Alvidafigure.png/revision/latest?cb=20150405142032", "caption": "Alvida in World Collectable."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "Treasure Battle!", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Set Sail Pirate Crew!", "elements": []}, {"text": "One Piece: Treasure Wars", "elements": []}, {"text": "One Piece - Big Secret Treasure of the Seven Phantom Islands", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Legend of the Rainbow Island", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She is the first female pirate in the series and also the first female Devil Fruit user.", "elements": []}, {"text": "Alvida's favorite food is berries that are good for her skin.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "She is named after the pirate Awilda, a woman who pretended to be a man in order to lead her crew and later became queen of Denmark. However most historians agree that she might never have existed.", "elements": []}, {"text": "According to Oda, the one luxury that her old ship lacked was a mirror.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Awilda – Wikipedia article on the female pirate Alvida is named after.", "elements": []}, {"text": "Article on the female pirate Awilda", "elements": []}]}], "images": []}]}