{"sections": [{"title": "Monkey D. Garp", "level": 1, "content": [{"type": "paragraph", "text": "Monkey D. Garp is an extremely famous and powerful Marine vice admiral. He is the father of Monkey D. Dragon, the paternal grandfather of Monkey D. Luffy, and the adoptive grandfather of Portgas D. Ace."}, {"type": "paragraph", "text": "He took charge of both Koby and Helmeppo's training. After the war, he became a Marine Instructor to train new recruits, though still retaining the rank of vice admiral. Notably, Garp was offered the rank of Admiral several times throughout his career, but he refused the offer of promotion every time."}, {"type": "paragraph", "text": "Garp is one of the major figures, along with Kong, Sengoku, Shiki, Silvers Rayleigh, and Whitebeard, from the times when the \"Pirate King\" was still alive."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Garp is a tall, tanned, broad-chested, muscular old man. He has a beard and a scar over his left eye. In the anime, his eye color is blue, and his hair is gray, whereas in the manga, it is white. Garp and Tsuru are the only two vice admirals to have special shoulder-pads; Garp is black and red while Tsuru is purple with white dot whereas the standard color is blue and red. During the Battle of Edd War, Garp's had two black stripes on his epaulettes and during his appearance at Water 7, it increased to three stripes and by the time of the Marineford War, it increased again to four stripes."}, {"type": "paragraph", "text": "The dog mask that Garp initially wore when introduced served to hide his identity as Luffy's grandfather, whose design had appeared in Romance Dawn, Version 2. After their relationship was revealed in the Post-Enies Lobby Arc, Garp is no longer seen wearing the mask."}, {"type": "paragraph", "text": "In his free time or vacation, Garp often wears sandals, a red tropical shirt and light-colored shorts. He sometimes pairs this shirt with black trousers and boots. When visiting Dadan during Luffy's childhood, he sometimes wear his official black suit without wearing his Marine cape."}, {"type": "paragraph", "text": "Thirty years ago, Garp’s hair and goatee were all black. He wore a dark suit with an orange striped undershirt and a black tie."}, {"type": "paragraph", "text": "Twenty-four years ago, Garp's hair and goatee were still black, with sideburns beginning to whiten. He wore a dark double breasted suit with a white shirt and a red tie."}, {"type": "paragraph", "text": "When he was a child and a young man, Garp resembled Luffy, though more muscular than his grandson. As a child, he had light brown hair, wore a tropical button shirt with shorts, and wielded a pipe staff. Garp already had the scar on his left eye in his childhood days."}, {"type": "paragraph", "text": "After the time-skip, his appearance has somewhat remained the same though he now wears a dark-colored suit."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Garp is an eccentric but caring man, who is loyal to both his criminal family and the Marine Headquarters, who he has served for decades. He is loud, boisterous, exuberant, and overall acts in a similar manner to his grandson. He has a habit of falling asleep during conversations and can be absent-minded. Luffy's crew noted his, apparently hereditary, selfishness during Garp's interaction with Luffy in Water 7."}, {"type": "paragraph", "text": "Unlike many Marines, Garp does not believe that a person's lineage determines their path. On a similar note, he does not believe that being labeled a criminal necessarily makes someone a bad person. Although Garp wanted his grandsons to become marines, he entrusted their care to a mountain bandit whom he had refused to turn over for prosecution."}, {"type": "paragraph", "text": "Garp believes that throwing children into harsh conditions will ultimately make them strong, and has no problem hitting children to drive home a point. Despite this, Garp is a supportive person. When Ace asked Garp whether he should have been born, Garp replies that Ace will find the answer if he continues living. When Momousagi mentioned Luffy being targeted by two Yonkos, Garp did not express much concern about it."}, {"type": "paragraph", "text": "Although Garp will ultimately comply with Marine HQ's most serious orders, he highly values his freedom and family, often to a point where he bends the rules to accommodate these values. He initially refused to capture Luffy in Water 7 until explicitly ordered to do so. Additionally, Garp is generally amused by Luffy's exploits as a pirate, and only seriously laments both of his grandsons' choices to become pirates after Ace is captured. He also ultimately allowed Luffy to hit him due valuing his family more than his duty as a Marine during the war at Marineford."}, {"type": "paragraph", "text": "Like Luffy, Garp is extremely blunt and honest when talking to people, as seen when he openly badmouthed Sterry, the current king of the Goa Kingdom, unafraid of the consequences in doing so. He considers the Celestial Dragons scumbags and is not afraid of expressing this aloud. The main reason he refused to become an admiral is because he does not want to be their direct subordinate. In one occasion, he also blurted out Monkey D. Dragon's name in front of Luffy, his friends, and his subordinates without any consideration at Water 7. When he realized he should not have said that, he just simply laughed it off, asking those who heard to forget about it."}, {"type": "paragraph", "text": "When Garp prepares to fight seriously, he often removes his Marine coat or suit jacket. Like his grandson, Garp is extremely fond of food, especially donuts and rice crackers."}, {"type": "paragraph", "text": "Garp has his own laughter style: Bwahaha or Wahaha."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Garp_Punches_Luffy.png/revision/latest/scale-to-width-down/180?cb=20150419214429", "caption": "Garp's \"Fist of Love\""}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "As the \"Hero of the Marines\", Garp is overall very well-respected for cornering the Pirate King multiple times. While Garp seems devoted to his duties, he has his own sense of justice and does not always obey orders which is given to him. Both Garp's immense popularity and achievements are noted by Sengoku to be the reason Garp was never disposed of for his rebellious attitude."}, {"type": "paragraph", "text": "Aokiji, in particular, has been indebted to Garp due to a certain incident that involved Garp saving his life, and is impressed that Garp refused several promotions, while Akainu has earned the vice admiral's hatred for killing Ace. He was requested to remain behind as an instructor due to his fame, which will be influential in recruiting."}, {"type": "paragraph", "text": "Garp has problems with respecting his superiors and such is the case with then-Fleet Admiral Kong 27 years ago and former Fleet Admiral Sengoku. Even including the fact that Garp was about to try to kill Akainu for killing Ace, it seems that none of this has affected Garp's standings in the Marines even after his relationship with both Dragon and Luffy went worldwide, as Kong insisted that Garp's title and records can be used to recruit new Marines."}], "images": []}, {"title": "Crew", "level": 4, "content": [{"type": "paragraph", "text": "Garp's crew often reacts with shock or uncertainty to his behavior. At times he seems to be unaware of the true extent of what is going on around him. After ordering his crew to rebuild a wall that Garp himself had just destroyed, his crew refused to do so unless he helped as well. This is insubordinate behavior displayed amongst a Marine crew, but Garp complied with their demand. Despite Garp telling his crew about his relationship with Luffy and Dragon, most Marines were unaware of it until the war with Whitebeard, suggesting that his men kept it a secret."}, {"type": "paragraph", "text": "Garp's right hand man is a Marine of unknown rank, who is usually seen with him. In the anime his name is Bogard, although his name has not been revealed yet in the manga so far. It seems that Garp and Bogard have been together for at least 27 years."}], "images": []}, {"title": "Koby and Helmeppo", "level": 4, "content": [{"type": "paragraph", "text": "Additionally, Garp is the mentor of Koby and Helmeppo, who both come to admire him. He was shocked when Koby shouted out to stop the killing at Marineford during the war with Whitebeard."}], "images": []}, {"title": "Sengoku", "level": 4, "content": [{"type": "paragraph", "text": "As a hero of the Marines, Garp has high respect amongst the Marines, even with Fleet Admiral Sengoku. In fact, in the past, Garp and Sengoku seemed to be very good friends, albeit that Sengoku was a little annoyed with Garp's tendency to act on his own accord whenever Roger was involved. However, currently, as with the revelation that both Monkey D. Luffy and Portgas D. Ace are Garp's grandsons (Ace being adopted), as well as Luffy's multiple actions in such a short time, Sengoku is losing patience with Garp, but the two Marines still share a close friendship even though Sengoku is often exasperated at Garp's antics, like his offering tea to Sengoku and Kuma while discussing Luffy's actions at Thriller Bark."}, {"type": "paragraph", "text": "Garp, on the other hand, seems to merely laugh it off and seems to enjoy getting on Sengoku's nerves. Notably, Sengoku's biggest annoyance was Garp's refusal to keep his family under control even when threatened with the consequences. Garp simply does not believe the life of an old man could ever atone for the actions of his family. When or how long Sengoku knew of Garp adopting Ace is unknown, but Sengoku found out that Ace is the son of Gol D. Roger. Also, how long Sengoku knew about Luffy and Dragon's familial relationship to Garp is unknown, but Sengoku had no problem revealing all of it worldwide."}, {"type": "paragraph", "text": "When Garp allowed Luffy to land a punch on him to save Ace, many of the surrounding Marines were shocked to see what they believe to be an impossibility: the legendary Garp easily defeated by a rookie. Sengoku, however, was able to tell of Garp's hesitancy, and was displeased that he chose family over duty."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f9/Garp_and_Sengoku.png/revision/latest/scale-to-width-down/210?cb=20160212210238", "caption": "A typical moment between Garp and Sengoku."}]}, {"title": "Tsuru", "level": 4, "content": [{"type": "paragraph", "text": "Garp is well acquainted with Tsuru, having known her for a long time. Before the Battle of Marineford occurred, she told him that he had done nothing wrong about Ace, which Garp replied with laughter, saying that she was supposed to be sympathetic towards him during this situation."}], "images": []}, {"title": "Sakazuki", "level": 4, "content": [{"type": "paragraph", "text": "Akainu did not show any respect to Garp despite the old vice admiral being a \"hero\" who was eligible for the position of admiral due to him being from the previous generation, but mostly for sharing the same lineage with Dragon and Luffy.​​ Garp in turn also has no respect for him even though he is now the fleet admiral nor he considers it. He even tried to murder Akainu for executing Ace, and had to be restrained by Sengoku, as he claimed if he had not done that, he would mercilessly kill Sakazuki."}], "images": []}, {"title": "World Government", "level": 3, "content": [], "images": []}, {"title": "Kong", "level": 4, "content": [{"type": "paragraph", "text": "Garp and Kong are well acquainted with each other, due to the latter being the former Fleet Admiral years ago. Kong respects Garp's abilities, as he always insisted that Garp accepts the promotion to Admiral, but Garp constantly declined. They still remain acquainted even after Kong became the Commander-in-Chief for the World Government. After the Marineford War, Kong reassigned Garp to the rank of Marine Instructor after he succeeded in persuading Garp to stay in the Marines."}], "images": []}, {"title": "World Nobles", "level": 4, "content": [{"type": "paragraph", "text": "Though he is a Marine and is loyal to the World Government, Garp is disgusted of the World Nobles and refused the promotion to admiral due to the fact it would make him their direct subordinate. He had no hesitancy in degrading the Celestial Dragons in front of others of importance, such as towards King Sterry, only halfheartedly taking back the insult. The only reason why the World Nobles did not dispose of him for his rebellious personality was due to his popularity and merits."}], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Dragon", "level": 4, "content": [{"type": "paragraph", "text": "Dragon is Garp's son. No direct interactions have been shown, but he seems casual about the idea of his own son being a Revolutionary and wanted by the World Government. There appears to be some sort of understanding between the two, as Garp was aware that the reason Dragon was in Loguetown was to see Luffy set off for the Grand Line. After the Battle of Marineford, he was not fazed by the fact that his relationship with Dragon became public knowledge. It also seems his reputation as a hero hasn’t been tarnished by this revelation."}, {"type": "paragraph", "text": "Garp and Dragon have different assessments of the East Blue. While Garp perceives it as a rather peaceful place, Dragon expresses his disgust with Garp's view of \"peace\" as nothing more than a form of oppression authorized by the law in places, such as Tequila Wolf and the Goa Kingdom, where common people that are put into horrible living conditions."}, {"type": "paragraph", "text": "Ultimately, Garp has an extremely different ideology from his son. While Garp takes pride and contentment in being a Marine serving the World Government, Dragon absolutely despised the World Government to the point of becoming a Revolutionary and seeking to overthrow them. However, they do have one common ground, their disdain toward Celestial Dragons."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Garp raised Luffy and holds high standards for his grandson Luffy, and gets mad at the slightest mistake he makes, even when his own are sometimes no better (i.e. telling off Luffy for falling asleep only to fall asleep himself). This often leads Luffy to receiving the force of Garp's punches, and due to these experiences, he has become afraid of his grandfather. Garp also claims Luffy was poisoned by Shanks with ideas of becoming a pirate, as Garp wanted Luffy to be a great Marine like him. However, Luffy claims and told Garp that even as a child he wanted to be a pirate. Nevertheless the two get along quite well. As Nami stated at the time of Garp's departure, there seems to be an amazing ego that runs in Garp's family. Garp left Luffy in Dadan's care as a child, which is how he met Ace."}, {"type": "paragraph", "text": "Garp appears proud when Luffy commits outrageous acts. Garp found it amusing when he learned that Luffy had infiltrated the great prison, Impel Down, in an attempt to rescue Ace. However, when he learned that Luffy broke out of Impel Down (taking many infamous prisoners along with him) and headed straight to Marineford, where the Marines are currently waging war against Whitebeard and his crew, Garp's was shocked. He was even more shocked when Luffy, along with an entire battleship of prisoners fell off a frozen tsunami and into the warfront."}, {"type": "paragraph", "text": "This implies that he cares for his grandson's well-being. He later calmed himself as the battle went on and simply watched as Luffy fought the marines. When Sengoku made Luffy's relationship to Dragon public, Garp simply states that Luffy already has such a notorious reputation that his connection to Dragon is irrelevant. Garp expressed surprise at Luffy's ability to use Haoshokou Haki before commenting that Luffy inherited it after all. However, when Luffy was on the verge to saving Ace, Garp blocked him and refused to move, citing his Marine duties. Despite this, Garp allowed Luffy to hit him without fighting back."}, {"type": "paragraph", "text": "After the timeskip, Garp does not seem to be troubled by his grandson's increasing infamy. This was shown when he was not the least bit concerned that two members of the Yonko are after him. He even laughed at the thought of the pirates actually teaming up over something."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/Ace%2C_Dragon%2C_Garp%2C_and_Luffy_on_Newspaper.png/revision/latest/scale-to-width-down/210?cb=20130822031753", "caption": "Garp appears on the news about Luffy's return."}]}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "Garp adopted Ace from Gol D. Roger, who requested Ace does not deserve to be treated as a criminal just because of his family ties. While Garp initially thought of adopting Ace as a preposterous idea, he eventually agreed to Roger's final wish, as the latter pointed out that after multiple confrontations, he trusted the vice admiral as much as a friend. Indeed, Garp was troubled when Ace was about to face death and claimed he had no pity for a pirate but believed family is different. He cares about him deeply, crying for his grandson as he's about to be executed for being a pirate and desperately asking why he could not have just been a Marine. In fact, Garp wanted to kill Akainu as revenge for killing Ace."}, {"type": "paragraph", "text": "When Ace was an infant, Garp would use his vacation and often visit the village and pull funny faces to cheer him up. Later when Ace was a troubled child that beat anyone up that insulted his father, Garp seemed amused with Ace, yet Garp never scolded Ace for his actions as a part of him felt sad that the child did not fully accept Roger as his father. After Luffy, Sabo and Ace got along well, Garp would sometimes visit them and train them by beating them up and destroying most of the forest in the process."}, {"type": "paragraph", "text": "As well as Luffy, Garp had high expectations for Ace to be a strong Marine, but is disappointed that he chose the life of piracy, which incidentally sent him to Impel Down where they were talking about the issue. However, Ace refused the idea that he and his younger brother could have ever been Marines, with their fathers' restless blood in their veins."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Ace_and_Garp_in_Impel_Down.png/revision/latest/scale-to-width-down/180?cb=20141206175432", "caption": "Garp visiting an imprisoned Ace."}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Gol D. Roger", "level": 4, "content": [{"type": "paragraph", "text": "Back when Gol D. Roger was alive, Garp managed to corner him many times. As such, they have a long history against each other with the exception to the Rocks Pirates. However, when Roger was about to be executed, after turning himself in due to his terminal illness, he made a final request to Garp. He asked Garp to take care of his unborn child, as he did not deserve to be condemned as a criminal because of his father's crimes, something they both agreed on."}, {"type": "paragraph", "text": "Due to their countless clashes, Roger came to see Garp as much of a friend as the rest of his crew. Garp too seemed to have some form of respect for him as he not only protected Ace but showed signs of disappointment from Ace's decision to disregard Roger as being his father. Also, Garp acknowledged Roger's strength, stating that although Roger was extremely reckless, that's what made him into the pirate king. Garp also told Dadan that although he is a Marine, he could never come to hate Roger."}, {"type": "paragraph", "text": "While Garp had initially wanted to make Ace into a Marine, rather than a pirate like Roger, he still wanted Ace to be proud of his biological father, though in the end, Garp had no success on this either."}], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard respected Garp and acknowledged his strength when he called him as Garp and not \"brat\" unlike Crocodile, Akainu, Aokiji, Kizaru, and many others (though Garp was more in the same age group as Whitebeard, being 4 years older than him). Garp did not let Marco pass through to get to Ace's execution platform meaning he did not care how fearsome Whitebeard could be after seeing that, which is probably due to not only having fought Whitebeard's rival the Pirate King but also Whitebeard himself during the God Valley Incident in the past."}], "images": []}, {"title": "Chinjao", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao was an infamous pirate who took deep pride in his pointed head. After a confrontation, Garp dented Chinjao's head, depriving him of the means to access all of his stored treasures. This led to Chinjao holding a grudge so strong against Garp that it extended to all of his descendants and lasted over 30 years. Chinjao lifted his grudge and forgave Garp when the latter's grandson, Luffy, punched his head hard enough to return it to its former glory.  Chinjao also reveals that in Garp's younger days, he was like a \"demon\" to pirates."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Garp bears a grudge against Shanks, because Garp believes he is the one who influenced his grandson, Monkey D. Luffy, to become a pirate.  When seeing him at Marineford, Garp was greatly angered to see him and brought up him being responsible for Luffy's \"corruption\". Despite his resentment, Garp did not stop Shanks from giving his late grandson Ace a proper burial after he requested it."}], "images": []}, {"title": "Rocks D. Xebec", "level": 4, "content": [{"type": "paragraph", "text": "Before Roger’s era, Rocks was his enemy. There was a conflict at God Valley that required Garp to team up with Roger in order to put an end to his reign of terror."}], "images": []}, {"title": "Other Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Over his many years as a Marine hero, Garp has made many enemies with pirates over the sea, such as Shiki and Shakky. He felt neither remorse nor pity for any of these pirates, as they are criminals."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Curly Dadan", "level": 4, "content": [{"type": "paragraph", "text": "It is unknown how they met, but they have known each other for at least 22 years, since Garp was seen entrusting a newborn Portgas D. Ace to her."}, {"type": "paragraph", "text": "As Curly Dadan is the leader of a bandit group, Garp blackmailed her to watch over Ace and Luffy as their foster mother, in exchange that he will turn a blind eye on their criminal activities, which is said to equal the numbers of stars in the sky. Despite Dadan having a fear and irritation against the vice admiral for leaving two children at her care, Garp claims that Dadan is a friend of his. This is ironic, as Garp claimed that he has no sympathy for criminals, and will arrest them at ease. Even in more recent times, Garp and Dadan continue to show a violent relationship that likewise harbors respect for each other and for the work they had in connection to both Luffy and Ace."}, {"type": "paragraph", "text": "Even though Dadan usually fears him, she did not have a problem attacking Garp for not managing to save Ace."}], "images": []}, {"title": "Sabo", "level": 4, "content": [{"type": "paragraph", "text": "Little is known about Garp's relationship with Sabo, beyond the fact that Garp trained him along with Luffy and Ace. Sabo noted that Garp tried to keep the three brothers on a short leash, implying that he gave Sabo similar treatment to Ace and Luffy. This is expanded in the anime when Luffy told Garp he, Sabo, and Ace had exchanged cups of sake. He then declared that there were three fools in need of a lesson and decided to \"train\" Sabo alongside Luffy and Ace."}], "images": []}, {"title": "Z", "level": 4, "content": [{"type": "paragraph", "text": "Z and Garp were once friends, until Z resigned from the marines after the World Government allied with pirates. Garp stood for his former friend while learning that Z was going to destroy the New World, and commented sadly that the last thing he wanted was to become enemies."}], "images": []}, {"title": "Sterry", "level": 4, "content": [{"type": "paragraph", "text": "As the ruler of the Goa Kingdom, Sterry expected absolute obedience and respect from Garp since he is one of its citizens. However, the old Marine showed neither to the young king, not even knowing who he was and even telling him to get lost and calling him ugly. When he was told of Sterry's position, he only half-heartedly took back much of what he said. He even looked down on Sterry's desire to become a Celestial Dragon and bluntly expressed this aloud."}], "images": []}, {"title": "Neptune Family", "level": 4, "content": [{"type": "paragraph", "text": "Garp became acquainted with Neptune's family, notably Neptune and Shirahoshi due to being Luffy's grandfather. When they parted, Garp happily waved goodbye to the mermaid princess."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "Garp is easily one of the most powerful Marines and one of the strongest characters seen in the series."}, {"type": "paragraph", "text": "A testament to his strength is that he was one of the very few people to be considered a rival to the \"Pirate King\" Gol D. Roger and he was offered the rank of Admiral several times throughtout his life. It should be noted that those who hold the rank of Admiral are regared as the World Government's \"Greatest Military Powers\" and are the strongest individual fighters within the World Government structure and the Marines."}, {"type": "paragraph", "text": "In terms of combat, Garp has had several decades worth of experience, in both combat and navigating the harshest oceans within the volatile \"New World\". Alongside Roger, he fought and prevailed against the very powerful Rocks Pirates , which consisted of three future Yonkos, earning him the epithet of \"Hero of the Marines\". He was also well known for cornering and fighting Roger many times. Roger also stated that he and Garp had almost killed each other on numerous occasions. As another true testament of sheer power, Garp defeated and nearly killed Don Chinjao in the past with a single punch, whose bounty was worth over 500,000,000 in his prime and was said to be able to split a continent with a headbutt."}, {"type": "paragraph", "text": "The extent of Garp's power and fame is evident round the time of the Battle of Edd War, three years before the future Pirate King died. It was revealed that he was offered the promotion to the rank of admiral more than once, but repeatedly refused the promotion. Garp's subordinate at that time, Kuzan (later promoted to admiral), commented on how cool Garp was for refusing such an irresistible promotion, to which he answers by stating that he does not need a higher position, and that it would reduce his liberty to do what he wants."}, {"type": "paragraph", "text": "Another example of Garp's strength is when he was shown to easily strike down Marco of the Whitebeard Pirates and knock him back, despite having his Devil Fruit abilities activated at the time, which was something that both Kizaru and Akainu seemed unable to do."}, {"type": "paragraph", "text": "Similarly, when it was revealed worldwide that Luffy is Garp's grandson, Luffy's fame rose based on that fact, as Demaro Black attempted to use that as one of the strong points in his impersonation of Luffy. Charlotte Linlin referenced Garp when Luffy challenged her."}], "images": []}, {"title": "Leadership", "level": 3, "content": [{"type": "paragraph", "text": "As a vice admiral of the Marine Headquarters, Garp has command over all lower ranking soldiers, as seen when he took two of Ripper's subordinates (Koby and Helmeppo) and made them his own subordinates instead due to his higher rank. Also, as a vice admiral, he has the potential to be called upon to be one of five vice admirals leading a fleet of ten battleships during a Buster Call."}, {"type": "paragraph", "text": "Being a Marine vice admiral and the commanding officer of the 153rd Marine Branch, Garp possesses leadership skills and is well respected by many among the Marines, having mentored many other prominent figures in the Marines, including former Admiral Kuzan."}, {"type": "paragraph", "text": "He is a great teacher, as he was able to make Koby and Helmeppo capable fighters in a short period of time, and he was also selected to be an instructor. He was also the one who trained Luffy and Ace into being strong enough to set sail on their own. "}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Despite his advanced age, Garp still posseses tremendous physical strength. He is able to throw iron canonballs like baseballs at speeds higher than if they were fired from an actual cannon, break through brick walls and cannon stands with his fists, and both carry and throw a gigantic ball and chain many times bigger than the Thousand Sunny. Garp also has a monstrous punching power at his disposal, with his epithet, \"Garp the Fist\", vouching for the tremendous power of his punches. He claimed to have crushed eight mountains during his training to face Chinjao. Enhanced with Haki, Garp could even dent Chinjao's Haki enhanced drill-shaped head, which was powerful enough to split the Jewel Ice Sheet."}, {"type": "paragraph", "text": "In addition to his legendary strength, he also has incredible durability and pain-tolerance, as seen when he was slashed by Captain Morgan's axe hand, only to recover only seconds later, with no obvious pain and apparently oblivious to the fact that he was struck at all. In fact, when informed by one of the Marines that he was nearly killed, he mistook this for one of the men being killed. It was only when he saw the wound did he realize what happened, as he fell asleep before being attacked. He was able to get back on his feet after allowing himself to be punched by Luffy in Gear Second at point-blank range without losing consciousness, and was still able to fight the Blackbeard Pirates along with Sengoku."}, {"type": "paragraph", "text": "He has also been shown to be extremely fast, as he managed to bypass all of the Straw Hats in order to get to a sleeping Luffy. It is evident Whitebeard respects Garp's strength, as he mentioned him during his talk with Shanks. "}, {"type": "paragraph", "text": "Aside from the cannonballs he throws and a gigantic iron ball he keeps on a chain, Garp is also a tremendously powerful and skilled hand to hand fighter. Garp has a particular emphasis on using powerful punches. The greatest testament of his skill is defeating Chinjao, a immensely powerful master of Hasshoken, in a single Haki-enhanced punch. Even in old age, Garp retained his strength. During the Battle of Marineford, he easily struck down Marco, a Mythical Zoan Devil Fruit User and one of the most powerful members of the Whitebeard Pirates, and in the anime, Garp knocked down Jesus Burgess, a master wrestler with titanic physical strength without effort. In fact, Sengoku had to personally restrain Garp before he attempted to kill Akainu out of fury."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "In the Pirate Warriors game series, Garp makes use of a fighting style that incorporates a variety of grapple attacks, ranging from suplexes, backbreakers, and even his iconic headbutt collar lift (to where he promptly displays his usual sleepiness)."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "As a vice admiral, Garp is fully capable of using Haki. Aside from his mastery over Busoshoku Haki, Garp is also knowledgeable about Haoshoku Haki. Although not demonstrated to be a user of it, Garp commented that Luffy has \"inherited\" it when he subconsciously released it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/40/Garp_vs._Chinjao.png/revision/latest/scale-to-width-down/210?cb=20150823101215", "caption": "Garp uses Busoshoku Haki to flatten Chinjao's head."}]}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Garp demonstrates extremely proficient skill in Busoshoku Haki, being able to injure Luffy several times, bypassing his rubber body. He could harden his fist and turned it obsidian black, allowing him to counter and even crush Chinjao's Haki-enhanced drill shaped head 30 years ago, proving his superior mastery compared to Chinjao, who himself is a powerful expert Busoushoku Haki user in his own right. During the Battle of Marineford, he managed to punch and hurt Marco, despite the latter being in his regenerative phoenix form."}, {"type": "paragraph", "text": "Garp uses a gag technique called Ai aru Kobushi (愛ある拳, Ai aru Kobushi, literally meaning \"Fist of Love\"), which is a simple but powerful punch to strike Luffy on his head, imbued with Busoshoku Haki to hurt him. He had been shown to have used this on Ace during his childhood as well. In Pirate Warriors 2 and Pirate Warriors 3, the game adds the visual effect of a giant fist coming down on the enemies and is Garp's first Special Attack in both games. In the FUNimation sub, it is called Fist of Love."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Garp possesses the ability to use Kenbunshoku Haki. When Koby awakens Kenbunshoku Haki, Dr. Fishbonen recommended that Koby ask Garp how to master it, suggesting he has enough expertise in it to mentor others."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Garp throws cannonballs with his bare hands. The cannonballs soar much faster than when fired from a cannon, due to Garp's strength. He also wields a giant iron ball, mounted on a chain, which dwarfs the size of his own Marine battleship."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3d/Garp_Iron_Ball.png/revision/latest/scale-to-width-down/210?cb=20130619223103", "caption": "Garp preparing to throw a giant iron ball."}]}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Genkotsu Meteor (拳骨, Genkotsu Meteo, literally meaning \"Fist-Bone Meteorite\"): Garp throws a cannonball at an enemy ship. Due to Garp's superhuman strength, he can throw them like baseballs, and the impacts are more powerful than when being fired from an actual cannon. In the FUNimation dub, this is called Meteor Fist. The literal reading of the kanji is actually Genkotsu Inseki.", "elements": []}]}, {"type": "list", "elements": [{"text": "Genkotsu Ryuseigun (拳骨流星群, Genkotsu Ryūseigun, literally meaning \"Fist-Bone Meteor Swarm\"): Garp throws one thousand iron cannonballs at enemy ships. The cannonballs are supplied by conveyor belts on either side of him. In the FUNimation subs this is called Meteor Fist Shower.", "elements": []}]}], "images": []}, {"title": "Video Game Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Genkotsu Satellite (拳・骨・, Genkotsu Sateraito, literally meaning \"Fist-Bone Satellite\"): Garp throws a large cannonball at his opponent. The size of the cannonball is slightly larger than his upper body. The attack first appeared in Pirate Warriors 2 as Garp's third Unique Action, and is also usable in Pirate Warriors 3. In the English version it is translated as Satellite Fist. The literal kanji reading for satellite is eisei.", "elements": []}]}, {"type": "list", "elements": [{"text": "Tokudai Tekkyu (特大鉄球, Tokudai Tekkyū, literally meaning \"Extra-large Iron Ball\"): Garp throws an enormous cannonball at his enemies. The cannonball is several times larger than his body, and its name comes from what the Straw Hats said when Garp threw his ship-sized cannonball at the Thousand Sunny just before they escaped from Water 7. The attack is usable in Pirate Warriors 3 as Garp's Special Kizuna Attack. In the English version it is translated as Oversized Iron Ball.", "elements": []}]}, {"type": "list", "elements": [{"text": "Cho Tokudai Tekkyu (超・特大鉄球, Chō Tokudai Tekkyu, literally meaning \"Super Extra-large Iron Ball\"): A slightly larger version of Tokudai Tekkyu. The attack first appeared in Pirate Warriors 2 as Garp's second Special Attack, and is also usable in Pirate Warriors 3. In the English version it is translated as Super Oversized Iron Ball.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Before the Great Age of Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Monkey D. Garp was born in the Goa Kingdom in the East Blue. He joined the Marines 56 years ago at the age of 22 along with Tsuru and Sengoku. Over the years, Garp would rise up through the ranks of the Marines, eventually achieving the rank of Vice Admiral."}, {"type": "paragraph", "text": "At the age of 23, Garp became a father as his son, Monkey D. Dragon was born to him and an unknown woman. "}, {"type": "paragraph", "text": "Around 40 to 38 years ago, he earned his epithet \"Hero of the Marines\" during the time known as the \"Era of Rocks\" by defeating Rocks D. Xebec in God Valley, through joint forces with Gol D. Roger. However Garp rarely discusses the God Valley Incident as he feels shame about this event. Around this time Garp also chased other pirates like Shakuyaku as part of his duties. "}, {"type": "paragraph", "text": "Thirty years ago, he fought Chinjao and got his epithet as \"Garp the Fist\" and also earned his hatred after denting his pointy head, which was the strongest head of that time, and robbing him of the means to acquire the treasure from the Ice Continent. He became famous for cornering and fighting the late Pirate King, Gol D. Roger, numerous times in his career. Garp was offered a promotion to admiral position many times from Fleet Admiral Kong, but he declined every time. The main reason was because he refused to work under authority of the Celestial Dragons, according to Sengoku's statement."}, {"type": "paragraph", "text": "Prior to Roger's execution, the Pirate King requested Garp to take care of his then-unborn child, as he thought the child did not deserve to be branded a criminal due to being born to a pirate."}, {"type": "paragraph", "text": "When Shiki the Gold Lion attacked Marineford a week before Roger's execution, Garp and Sengoku challenged him together. After a grueling battle that devastated half of Marineford, they managed to defeat him. A number of months after the Pirate King's death, Garp went to Baterilla and visited Portgas D. Rouge. He was present at Ace's birth and Rouge's death afterward. Honoring Roger's last request, Garp took Ace to Dawn Island to be raised by Dadan. Garp would visit Ace during his vacations."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/34/Garp_30_Years_Ago.png/revision/latest/scale-to-width-down/210?cb=20141017093536", "caption": "Garp 30 Years Ago."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Roger_Asks_Garp_to_Protect_Ace.png/revision/latest/scale-to-width-down/210?cb=20130223223518", "caption": "Roger asking Garp to protect his child."}]}, {"title": "The Three Brothers", "level": 4, "content": [{"type": "paragraph", "text": "Early on in Luffy's life, Garp trained him to become a strong Marine. Luffy was thrown into valleys, left alone in dangerous forests, and tied to balloons over high altitudes, all for the sake of making him stronger. After this, he left Luffy in the care of Dadan. Despite Dadan not wanting to take care of another one of Garp's children, she complied. When Dadan voiced her displeasure of Garp's irresponsibility to take care of them himself, he became angered, making Dadan immediately take back what she said."}, {"type": "paragraph", "text": "Throughout his visits, he would often hold \"training sessions\" with Luffy and Ace and on one occassion with Sabo. When Garp first read in the newspaper that Ace had become the captain of the Spade Pirates, he was furious."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Garp_Delivers_Luffy.png/revision/latest/scale-to-width-down/210?cb=20130223220810", "caption": "Garp sending Luffy to live with Dadan."}]}, {"title": "Diary of Koby-Meppo", "level": 3, "content": [{"type": "paragraph", "text": "Garp was first introduced as the Marine Officer in charge of escorting Captain Morgan. However after Garp fell asleep, Morgan made his escape by striking Garp and taking Helmeppo as a hostage, fleeing on a small boat. Garp then woke up unfazed and broke a cannon while waking up."}, {"type": "paragraph", "text": "After Koby returned with Helmeppo, they offered themselves to be punished, but Garp decided to take charge of the pair. He took them back to Marine Headquarters and oversaw their training."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After arriving at Water 7, he went to the small house where Luffy was recuperating from his battles at Enies Lobby. Vice Admiral Garp marched to the front of the temporary Galley-La headquarters, and tells two subordinates in specific to wait outside. Garp broke through the wall and into the Straw Hats' room. He asked if they were the Straw Hats as everyone prepared to fight, but before they could do anything, Garp bypassed them and punched a sleeping Luffy's head into the floor, telling him to wake up. To everyone's surprise, Luffy screamed in pain. Garp then said that no one can escape his Fist of Love. He then removed his mask and told Luffy he heard he had been doing reckless things. Luffy was shocked to see that the man behind the mask was none other than his grandfather, and everyone else were even more surprised that Luffy's grandfather is a high ranking Marine."}, {"type": "paragraph", "text": "Garp told Luffy that he owed him an apology as he was causing trouble. Luffy told the others not to fight with his grandfather because Garp had nearly killed him on many occasions. Garp snapped at Luffy for making him sound like a bad guy for what he did in the past and claimed those incidents were aimed at turning Luffy into a strong man."}, {"type": "paragraph", "text": "Garp reminded Luffy that he wanted him to be a strong Marine, which Luffy countered by claiming he had always told him he wanted to be a pirate. Garp then responded by saying that Luffy was influenced by Shanks, to which Luffy took offense because Shanks saved his life. Garp suddenly grabbed Luffy, asking if he was trying to tell his grandpa what to do. Luffy's crew panicked over what to do until they found the pair have fallen asleep. Garp, being the first of the two to wake up, punched Luffy awake for falling asleep on him, while the others pointed out Garp did the same. Garp then ordered his men to repair the wall he damaged. The men said that Garp should help repair the wall as he destroyed it. Garp explained he did so because he thought it looked cool."}, {"type": "paragraph", "text": "As Garp repaired the wall, he said he heard that Luffy met his father at Loguetown. Luffy did not have a clue about it as he did not even know he had a father. Garp then announced that Luffy's father is the revolutionary Monkey D. Dragon, causing a sudden shock amongst all those around him. After Robin explained to Luffy about Dragon, the Revolutionary Army, and their goals, Garp turned around and said that he should not have said that, asking them to forget he said anything, causing even more shock amongst everyone."}, {"type": "paragraph", "text": "Garp told Luffy that he would let him go since he is his grandson, and would use that as an excuse when informing his superior officers. However, his advisor Bogard told Garp it would be better to lie and say the Straw Hats got away. Garp then said that he mostly came for his students and announced his departure. Luffy said good bye and Garp punched him, saying he was letting him leave too easily and berated him for being too casual about saying goodbye to his grandfather whom he had not seen in a while. Luffy complained by saying the only thing Garp has ever done was hit him to which Garp replied he just wanted to show love to his grandson."}, {"type": "paragraph", "text": "Some days later, Fleet Admiral Sengoku ordered Garp to return to Water 7 to capture Luffy. Garp's ship picked up Aokiji along the way, but only because he did not want to ride his bicycle. After returning to Water 7, Garp announced to Luffy that he was going to die there. Luffy argued that he said he would not attack, but Garp simply said he got his orders and proceeded to attack by throwing a cannonball at breakneck speed at them. The Straw Hats were amazed, but prepared to defend the ship and started to set sail. Garp then asked for one thousand cannonballs, intending to throw them all at them. Garp began to get flustered and threw another cannon ball, but Luffy knocked it out of the way. Luffy said he really had to run and hoped they would see each other again sometime."}, {"type": "paragraph", "text": "Garp then took out an enormous iron ball and tossed it at the Thousand Sunny. Before it could crush the Thousand Sunny, Franky activated Coup de Burst to launch the ship up into the sky. The Straw Hats got away, but Garp just laughed."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Strong World", "level": 4, "content": [{"type": "paragraph", "text": "When Shiki returned from his 20-year disappearance, he attacked Marineford Headquarters by using his powers to levitate and hurl fleets of ships at the island. Garp identified Shiki right away, recognizing his abilities from past encounters. Garp wondered if he had returned to get revenge on the world."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a5/Garp_Recognizes_Shiki%27s_Ability.png/revision/latest/scale-to-width-down/210?cb=20130226184300", "caption": "Garp during Shiki's attack on Marineford Headquarters."}]}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "After his grandson's assault on Thriller Bark, he was seen at Mary Geoise with Bartholomew Kuma and Sengoku, where he laughed at how Luffy had avoided capture by Kuma and annoyed Sengoku by talking about tea and crackers."}, {"type": "paragraph", "text": "Recently, Garp found out that Silvers Rayleigh was to be sold as a slave on the Sabaody Archipelago, whom he assumed let himself get captured to pay off a gambling debt. Due to the Marines being busy with the incident regarding Whitebeard and the execution of Portgas D. Ace, Garp remarked that he would take care of the situation."}], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "He later visited Ace in Impel Down. Upon Ace's request to die, Garp merely told him that his death would not stop Whitebeard. They later discussed family issues such as Ace and Luffy's turning to the life of piracy instead of becoming Marines. Ace also told Garp that he only considered Whitebeard as his true father."}, {"type": "paragraph", "text": "Back at Marineford, Garp was informed that Luffy broke into Impel Down and was rather amused about it, even proud. Sengoku was furious and said that if Garp was not a hero to the Marines, he would have him punished for his family's actions. Garp just laughed and stated that an old man's life could not atone for his family's actions."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5f/Sengoku_Blames_Garp_For_Luffy%27s_Actions.png/revision/latest/scale-to-width-down/210?cb=20150120185544", "caption": "Sengoku blaming Garp for Luffy's actions in Impel Down."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three hours before Ace was to be executed, Garp walked with Sengoku to the execution platform. Sengoku told him that he would tell the public everything and Garp did not express any objections. As Sengoku began his public announcement on the execution platform, Tsuru told Garp that it was not his fault. Garp just laughed and said that women get so sentimental at times like these. Once Sengoku revealed that Ace was truly the son of Gol D. Roger, Garp remembered the time when Roger personally begged him to protect his unborn child."}, {"type": "paragraph", "text": "After the war began, Garp sat with Ace and Sengoku on top the execution platform, upset at the present events. He stated that while he felt no sorrow for scoundrels, he felt differently when it came to Ace, who was family. Garp bitterly lamented that both Ace and Luffy did not become Marines."}, {"type": "paragraph", "text": "Upon Luffy's arrival at Marineford, Garp was utterly shocked. Nevertheless, he managed to calm down long enough to comment on the viability of the motley little band that Luffy had assembled at Impel Down as part of Ace's rescue effort. Later, when Sengoku revealed Luffy's status as the son of Dragon the Revolutionary, Garp stated that with the infamy and power Luffy had acquired, such knowledge being brought to the general public hardly made a difference."}, {"type": "paragraph", "text": "After Luffy was hurled over the siege wall and stood before the three admirals, Garp was shown to be worried about his grandson. He was later seen with Sengoku, getting ready to participate in the battle. Garp later punched Marco, who had transformed into his Phoenix form, while he was trying to save Ace. Garp then challenged the Whitebeard Pirates, saying that they would have to kill him before they could reach Ace. When Luffy released a massive burst of Haoshoku Haki, Garp said he knew his grandson had that kind of power inside him."}, {"type": "paragraph", "text": "When Luffy came close to reaching Ace, thanks to Inazuma's powers, Garp himself confronted him. He smashed part of the bridge in the process, saying that he could not let Luffy pass. He again complained about Luffy and Ace becoming pirates instead of Marines, and declared that he considered them enemies."}, {"type": "paragraph", "text": "As he was about to hit Luffy, he recalled Ace's renewed desire to live and reminisced about when Ace and Luffy were both young. Finding himself unwilling to resist, Garp closed his eyes, missing his punch. Thus, he allowed Luffy to land a Gear Second punch that sent him flying and smashing into the ground, much to the shock of the Marines watching him."}, {"type": "paragraph", "text": "Garp later dislodged himself, more or less unfazed, and rejoined the battle. After witnessing Ace being pierced from behind by Akainu's magma fist, Garp flew into a rage, prompting Sengoku to stop him, grabbing his head from behind and slamming him to the ground. Coughing up blood, Garp snarled that Sengoku should keep him down tight or he would murder Sakazuki. Sengoku responded by calling Garp a fool. When Ace died, Garp wept over the loss of his grandson."}, {"type": "paragraph", "text": "When Whitebeard began attacking Marineford Headquarters after the death of Ace, Garp commented that Newgate was putting an end to this era, which he welcomed. As Whitebeard lost his life at the hands of the Blackbeard Pirates, Garp watched with a grim expression. After acquiring the Gura Gura no Mi from Whitebeard's corpse, Blackbeard commented to both Garp and Sengoku that their age was over, much like Whitebeard's."}, {"type": "paragraph", "text": "Later, he heard someone yelling to everyone. He saw Koby standing in front of Admiral Akainu, calling for an end to the war. Upon seeing Shanks making an appearance at Marineford, Garp made a snarling comment about the pirate who influenced Luffy into the path of piracy. When Sengoku announced that the war was over, Garp stand down along with the rest of the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Garp_Grieving_Over_Ace%27s_Condition.png/revision/latest/scale-to-width-down/210?cb=20130204222942", "caption": "Garp grieving about how Ace ended up."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a4/Garp_Punches_Marco.png/revision/latest/scale-to-width-down/210?cb=20130206014009", "caption": "Garp punching Marco in his phoenix form."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/99/Garp_and_Sengoku_vs_Blackbeard.png/revision/latest/scale-to-width-down/210?cb=20130307084551", "caption": "Garp and Sengoku battling Blackbeard."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "With the end of the war, Garp took up a station in Foosha Village on Dawn Island, seeing it as necessary to protect the island with the increase in pirate activities. After returning to the village, he took a beating from Curly Dadan for letting Ace die until Makino intervened. Makino tried to tell Dadan that Garp was suffering the most from Ace's death, but Dadan replied that the one suffering the most was Luffy. After Dadan calmed down, Garp informed Woop Slap that Luffy escaped Marineford in a submarine."}, {"type": "paragraph", "text": "It was later revealed that both him and Sengoku stepped down from the Marines. However, both would remain for the sake of rearing up new young Marines."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/79/Garp%27s_Homecoming.png/revision/latest/scale-to-width-down/210?cb=20120831104859", "caption": "Garp, Makino, and Dadan reflecting over the war."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "One Piece Film: Z", "level": 4, "content": [{"type": "paragraph", "text": "After Firs Island was destroyed by Z, Garp appeared on a Marine battle ship along with Koby and Helmeppo, and revealed to them the existence of Z. Later, after the destruction of Secon Island, he and Sengoku explained to them Z's past."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6a/Garp_Firs_Island.png/revision/latest/scale-to-width-down/210?cb=20140722072332", "caption": "Garp at Firs Island."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Marine Rookie Arc", "level": 4, "content": [{"type": "paragraph", "text": "Garp was in his office when he received a call from Vice Admiral Prodi, who was angry about the new transfer Grount's actions in his base on Fron Island. Garp simply asked Prodi to take care of Grount."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Neptune Family arrived at the surface to the Red Port at the Red Line, Garp escorted them to the bondola. He commented on Shirahoshi's beauty that exceeds everyone's expectations when the media was taking pictures of her. When he met Sterry, Garp claimed that he did not know him and openly insulted him before half-heartedly taking it back after he was told that Sterry was the king of Goa Kingdom. As the Neptune Family rode on the bondola, Garp waved one last time to Shirahoshi."}, {"type": "paragraph", "text": "After the Marines intercepted a communication between Big Mom and Kaido, Garp remained calm despite the fact that both Yonko had a grudge against Luffy. He then spoke with Hina about a pirate group prominent before Roger's era during which suggested that he got the distinction of \"Hero of the Marines\" from dealing with them while Garp noted that he could not imagine what the Marines would do if said crew were to come back into power."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, Garp went to Fish-man Island with Neptune and his family. While conversing with Neptune, Garp mentioned an incident involving Alabasta that occured after they left Mary Geoise. While leaving Fish-Man Island, Garp read a report, being informed of the alliance between Kaido and Big Mom, much to his annoyance."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, the Marines accompanying Garp identified him, not Nami immediately and she only calls him that after hearing his name."}, {"type": "paragraph", "text": "In the anime, Garp attacks Jesus Burgess when he moves to strike Sengoku while he is distracted. After the war ended, he orders the soldiers to gather the wounded so no one else would die."}, {"type": "paragraph", "text": "In the anime, a young Luffy blurted out that the trio shared a promise over a shared drink. Garp overheard them boasting of their dreams to become pirates, leaving him infuriated. Garp then chases them out into the night, breaking down trees and rocks and beating them all to a pulp. Sabo exclaimed he was a monster. Afterwards, he casually leaves them, saying that he will not be so merciful next time. This was not shown in the manga. In the manga version, Garp was shown saying hello first before \"training\" them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b9/Garp_Punishes_Luffy_and_Ace.png/revision/latest/scale-to-width-down/210?cb=20110628043054", "caption": "Garp about to punish (or in this case, train) Luffy and Ace."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Monkey D. Garp and Gol D. Roger vs. Rocks Pirates", "elements": []}, {"text": "Monkey D. Garp vs. Gol D. Roger (none seen, multiple times)", "elements": []}, {"text": "Monkey D. Garp vs. Chinjao", "elements": []}, {"text": "Monkey D. Garp and Sengoku vs. Shiki", "elements": []}, {"text": "Monkey D. Garp vs. Straw Hat Pirates", "elements": []}, {"text": "Monkey D. Garp vs. Marco", "elements": []}, {"text": "Monkey D. Garp vs. Monkey D. Luffy", "elements": []}, {"text": "Monkey D. Garp and Sengoku vs. Marshall D. Teach", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Monkey D. Garp vs. Jesus Burgess", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "While unnamed, Garp was introduced in Romance Dawn, Version 2 (featured in Weekly Shonen Jump magazine itself) as Luffy's grandfather. For a long time, it was first thought that Luffy's unnamed Grandfather was a sole addition to Romance Dawn V.2."}, {"type": "paragraph", "text": "Some aspects of his character remain from Romance Dawn V.2. He is as hot tempered as ever and intolerant of Luffy's antics. Like the final version, he was determined to make Luffy follow in his footsteps, however here he is a pirate captain, the complete opposite of his current occupation. Both stories have in return Luffy completely rejecting the idea of following in his grandfather's footsteps. Garp now occasionally wears a dog hat and compared to his chubby Romance Dawn V.2 version, his upper body is much more muscular."}, {"type": "paragraph", "text": "One feature carried over from Luffy's grandfather from V.2 to the final version of Garp was the scar on his left eye. Also, Luffy got both his hat and the Devil fruit he ate from his grandfather in V.2, not Shanks. According to Oda the reason for not featuring Shanks was that he wanted Shanks to be kept a secret until One Piece was serialized so he would have a greater impact."}, {"type": "paragraph", "text": "When V.2 was adapted into Episode 907 of the anime as a celebration of the series' 20th anniversary, he had Garp's muscular physique instead of the chubby appearance he had in the manga. He also had Garp's voice actor."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece: Burning Blood (DLC)", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Garp's wife has not been named, but the supplement Grand Line Times left a \"?\" in place of her.", "elements": []}, {"text": "Garp smoked cigars, but in recent appearances, he stopped doing it.", "elements": []}, {"text": "In the anime, Garp said he has eaten 842 donuts without sleeping or taking a break because he was trying to beat a world record.", "elements": []}, {"text": "Aside from Luffy himself, Garp is the only Romance Dawn V.2 character to actually appear in the storyline.", "elements": []}, {"text": "Garp's laughter style is that he adds either \"Bwa\" or \"Wa\" before the haha part. This is somewhat unique as most characters only stick with one laughter style (the only other character sharing this distinction being Dracule Mihawk).", "elements": []}, {"text": "Garp appears to have a dog animal-theme, as shown by his mask and his ship.", "elements": []}, {"text": "In an SBS question on Volume 59, a fan pointed out the fact that despite Garp's few appearances, his trademark scar has disappeared 25 times if counted up to Volume 58. In response to the statement above, Oda joked that \"if an enemy he hates is around, his scar tingles, and it will float up\" and that Garp's \"true form\" may be the scar-less one, but he also points out that this is not proved anywhere.", "elements": []}, {"text": "In the 5th fan poll, Garp ranked 74th.", "elements": []}, {"text": "In the Volume 45 cover, Garp's epaulettes are golden and blue stripes while in the original series, his epaulettes remain red and black stripes.", "elements": []}, {"text": "In the One Piece Magazine Vol.5, Oda drew a what-if of Ace, Luffy, and Sabo as Marines. Garp was seen wielding a pair of katana swords.", "elements": []}]}], "images": []}]}