{"sections": [{"title": "Jorge", "level": 1, "content": [{"type": "paragraph", "text": "Jorge was the head of the judicial ship that sailed to Water 7."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jorge was an elderly man, with a large white mustache and beard. He has a wrinkled face, and sported a purple cap that matches his judge robes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He was willing to let Tom build the Sea Train, so it can be inferred that he cares about the greater good of Water 7, and quite possibly is a caring person."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a judge, his decision carries immense weight. He had the power to sentence even an influential shipwright such as Tom to death."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "He judged Tom twice: first sentencing him to death in Enies Lobby for building Gol D. Roger's ship, the Oro Jackson, but pardoned him after hearing Tom's plan for the sea train, and asked if he could connect it to Enies Lobby. He pardoned Tom, thus allowing him to build it."}, {"type": "paragraph", "text": "After fourteen years, he returned to Water 7 and was positively fascinated with the sea train, planning to pardon Tom permanently. However, his ship was attacked on the orders of Spandam, then leader of CP5, using Franky's battleships, and afterwards made Tom and his apprentices responsible for the crime. The judge pardoned Tom for the original offense, but sentenced him and his apprentices for what Spandam had done. At the last moment, Tom managed to bargain that the building of the sea train may pardon the crime committed that day instead, and confessed to aiding Gol D. Roger, hoping to save Franky and Iceburg from death. The judge agreed, and Tom was taken away by CP5 on the Sea Train he built."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 37 Chapter 353 and Episode 248, Jorge arrives to Water 7 to judge Tom.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 213), His name is revealed.", "elements": []}]}], "images": []}]}