{"sections": [{"title": "Bell-mère", "level": 1, "content": [{"type": "paragraph", "text": "Bell-mère was a former Marine and the adoptive mother of Nami and Nojiko, introduced in a flashback during the Arlong Park Arc. She raised the two girls until she was murdered by Arlong."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bell-mère was a relatively slim woman with long fuchsia hair tied in a ponytail, grey eyes, and a rather unique hairstyle similar to a mohawk known as a chelsea hawk (that Oda jokingly named \"Women have guts!\")."}, {"type": "paragraph", "text": "She wore a green checkered shirt with the word \"MACE\" on it, indigo trousers and brown sandals. She was also rarely seen without a cigarette."}, {"type": "paragraph", "text": "Back in her days as a Marine, she wore the simple uniform with the officer's jacket draped over like a cape."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In her youth she was a renowned trouble maker. While her decision to join the Marines shocked all the villagers, they all cared deeply for her welfare despite the trouble that she had always given them. Due to her past, her decision to adopt her daughters led them to fear the children's own welfare. However Bell-mère was determined to show them that she had grown into a mature adult who was capable of such responsibilities."}, {"type": "paragraph", "text": "As a Marine, Bell-mère was quite confident, her reaction to Shiki's escape from Impel Down being to state that she will stop him herself should he attack the East Blue. Her fellow marines note that she is very reliable, indicating she was likely a very effective member of the Marines."}, {"type": "paragraph", "text": "Bell-mère retains some of her mischievous nature upon her return to Cocoyasi, offering to pay Genzo for Nami's thefts \"with her body\" (this most likely explaining where Nami got her personality from, as Nami even used the phrase when Genzo captured her, much to his frustration), despite knowing how he reacts. She occasionally acts impulsively, such as when she hits Nami for suggesting that Nojiko is not her real sister, and hits a boy for saying that her tangerines taste bad moments after Bell-mère stated to Nami she shouldn't have hit the boy. She admits that Nojiko is sometimes more mature than she is."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e0/Bell-m%C3%A8re_During_Shiki%27s_Breakout.png/revision/latest/scale-to-width-down/210?cb=20130527010724", "caption": "Bell-mère as a member of the Marines at age 18."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [{"type": "paragraph", "text": "She had an interesting relationship with Genzo above all other villagers. She was able to manipulate him through a few seductive moves that leave him extremely embarrassed, even saying that she'd pay him back with \"her body\" (heavily implying to him an offer of sexual advancement). Genzo knew her past and dubbed her the \"Little Thug\" in response to her troubles. He did of course care about her, and enough to save her from being killed by the Arlong Pirates and to prevent them from knowing about Nami and Nojiko's existence, but Bell-mere revealed her secret to the pirates anyway, not wanting to deny the existence of her daughters. Genzo was horrified after seeing Arlong mercilessly kill her."}], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Nami and Nojiko", "level": 4, "content": [{"type": "paragraph", "text": "Her history gave her an advantage in dealing with Nami's own antics at times, however she could not change the fact that she and her daughters were not related by blood and therefore was unable to handle Nami rejecting her family completely. Nevertheless, she cared about her daughters deeply, she would give her daughters as much as she could afford to, often at her own expense. This was proven when times were harsh she ate only the fruit she grew in her grove, thus saving enough money to keep feeding her daughters on suitable meals and would lie about being on a \"diet\" to hide it. Her only regret she had was she could not give them everything they wanted in life. However, she loved them both as though they were her own. To this end, she died claiming Nami and Nojiko as her daughters even though pretending they did not even exist would have protected the lives of all 3 of them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Bell-m%C3%A8re%2C_Nami%2C_and_Nojiko_Together.png/revision/latest/scale-to-width-down/210?cb=20140727104234", "caption": "Nami, Bell-mere, and Nojiko together."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Bell-mère has fought many pirates throughout her time as marine and gathered enough battle experience to survive. She was perceptive enough to notice that Arlong and his crew were coming for her, despite being distracted by cooking. She also acrobatically managed to pin Arlong on the ground and place a rifle in his mouth, before he or anyone in his crew could react."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During her time as Marine she was wielding a rifle and appeared to be quite proficient in using it. She learned how to execute surprise attacks with it, as she managed to place the rifle in Arlong's mouth and leave him in a lethal position (though he managed to free himself thanks to his unexpected fish-man power)."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Early Life", "level": 3, "content": [{"type": "paragraph", "text": "Bell-mère was a trouble maker throughout her entire life, causing everyone to refer to her as a \"thug\". They cared deeply for her well being despite her reputation and when she chose to join the Marines were completely shocked by her sudden decision. Though they tried to convince her to change her mind, she was set on fighting \"bad\" pirates. It is unknown what her rank was exactly, but a flashback shows her in an officer's coat, indicating that it may have been fairly high up."}], "images": []}, {"title": "Bell-mère the Marine", "level": 3, "content": [{"type": "paragraph", "text": "One day she and fellow Marines were sent to the Oykot Kingdom to fight some pirates causing trouble there. The fight was bloody, leaving many dead and destroying the village which the two sides were fighting in. Bell-mère lay wounded and dying, she decided that it was alright to let herself die there and then. However just as she was giving up and letting herself go, Nojiko appeared carrying Nami. Bell-mère took the two back to her village (with Nami too young to be aware of what happened)."}, {"type": "paragraph", "text": "Upon arrival, a storm had broken out over Bell-mère's home island and the two children had grown ill. She insisted the two girls get treatment before her. Later, after all three of them were better again, she asked the other villagers not to register the girls for adoption with the World Government. She declared (with many protests from the other villagers) that she was old and mature enough to look after the girls herself."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Bell-m%C3%A8re_Saves_Nami_and_Nojiko.png/revision/latest/scale-to-width-down/210?cb=20130902211623", "caption": "Bell-mère arriving at Cocoyasi Village during a storm with Nami and Nojiko."}]}, {"title": "After the Storm", "level": 3, "content": [{"type": "paragraph", "text": "Bell-mère lived on her tangerine grove in Cocoyasi Village on Conomi Islands with the girls. While Bell-mère had very little income, she gave everything to her girls and survived by eating the tangerines she grew. One day Bell-mère scolded Nami when she got caught stealing (Nami stole a book because she knew they could not afford it), shortly after Nami revealed to Bell-mère why she stole the book - she was studying navigation. Bell-mère applauded Nami's first drawing of the island as the first step of her dream to map the world and put faith into Nami that she really could do it. While Nami and Nojiko were growing up, Bell-mère advised them that they had to be as strong as boys, and if they survived, good times would come."}, {"type": "paragraph", "text": "In one year in which the price of tangerines fell due to a large supply, Bell-mère had to eat only tangerines and give most of the food to Nami and Nojiko, but did not let on how bad the situation was to Nojiko and Nami. One day Nami was given one of Nojiko's dresses by Bell-mère (who simply turned the sunflower on it into a lion) and Nami was offended. Nami wanted her own clothes not Nojiko's hand-me-downs. During the argument, Nami said she did not consider Nojiko a real sister because they weren't blood related, causing Bell-mère to slap her. Nami then ran off, saying that she wished she were adopted by rich people. Bell-mère realized she wasn't acting like an adult back there, so she decided to spare some money and prepare Nami's favorite meal even though it would hit her budget. She sent Nojiko to fetch her while she prepared the meal."}], "images": []}, {"title": "Arrival of Arlong", "level": 3, "content": [{"type": "paragraph", "text": "That same day Arlong invaded the island and found her home, Bell-mère tried to fend them off but was quickly subdued. When asked for the fee needed to stay alive, it turned out all the money Bell-mère had would either save herself or her two daughters. Things likely would have been okay if she had followed Genzo's advice and paid for herself, as Arlong was unaware of their existence."}, {"type": "paragraph", "text": "However, Bell-mère declared the money was for her daughters, as she would rather die than not call herself a mother. To that end, Arlong shot her right in front of the eyes of her two adopted daughters, but not before Bell-mère apologized to Nami for not being richer, and not being able to buy the girls whatever they wanted, but the two insisted that it was not the case and urged her to stay alive. Before she died, she told the girls, \"I love you.\""}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Bell-m%C3%A8re_Protects_Nami_and_Nojiko.png/revision/latest/scale-to-width-down/210?cb=20130902204936", "caption": "Bell-mère trying to protect her daughters."}]}, {"title": "Postmortem", "level": 3, "content": [{"type": "paragraph", "text": "After her death, her advice that \"If you can survive, then happy times... lots of them... will come your way\" encourages Nami to work to buy Cocoyasi Village from Arlong, believing that once she freed the village, she could pursue her dream and find happiness."}, {"type": "paragraph", "text": "The villagers, and especially Bell-mère's daughters, would visit her grave every so often. Eight years after her death, Arlong met his defeat at the hands of Nami's new found friends, the Straw Hat Pirates, thus setting the entire island free. Genzo celebrated by pouring wine on her grave marker, while Nami set sail alongside the Straw Hats, having a renewed view on pirates."}, {"type": "paragraph", "text": "On the night that Nami prepared to leave her hometown to become a true member of the Straw Hat Pirates, she said her good-byes to Bell-mère inside her old house, imagining that she was speaking to her face directly. Nami felt some regret about departing Cocoyasi Village for a long term journey on the Grand Line, remembering how much it meant to her, and it was hard to let it go so easily. However, when Nami walked out of her house, she received a forceful nudge on her back from a hand as she stepped out of the doorway. It was the spirit of Bell-mère encouraging Nami to get going already. Nami smiled, knowing who pushed her, and left the village the next day eager to begin her quest to chart the world."}, {"type": "paragraph", "text": "In the Punk Hazard arc, when Nami left the care of the giant children to the Marines, particularly Tashigi, because she trusted Marine women, Usopp remarked this was because she was raised by one."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Arlong killed Bell-mère by gunshot in both the anime and the manga. However, while he shot her in the chest in the anime, he shot her in the head in the manga."}, {"type": "paragraph", "text": "Episode of East Blue, an abridged retelling of the East Blue Saga, follows the manga version of the scene."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The word \"MACE\" was removed from her shirt and all images of her smoking were erased (\"Mace\" is a slang term for hallucinogens). When first attacking Arlong, she wielded a shovel instead of a gun, but holds it in the same way."}, {"type": "paragraph", "text": "Although Bell-mère's role in the story was very important, in the 4Kids English version of the anime, Bell-mère's role was toned down to being merely a background character, removing the flashbacks in which she gives Nami and Nojiko encouragement that girls can be as strong as boys and persevere in hopes of better times. Arlong's gun was edited out by enlarging his hand to make it appear as if he was pointing at her and his lines were changed so he implied that she will be sent to a dungeon. She still dies in the 4Kids dub since Nojiko mentions her dying when she meets Usopp."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b9/Arlong_Sends_Bell-m%C3%A8re_to_a_Dungeon_in_the_4Kids_Dub.png/revision/latest/scale-to-width-down/210?cb=20140814211809", "caption": "Arlong merely sentences Bell-mère in the 4kids version."}]}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Bell-mère has been the choice character in many forms of merchandise. She has been featured in the series of models Portrait of Pirates. She was issued alongside Nami in a One Piece Block Figures set featuring the Straw Hats and their past mentors/loved ones."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bell-mère's grave was originally a makeshift one with two sticks tied in a cross serving as the marker. Some time before or during the timeskip, she was given a proper grave with her name inscribed on the headstone.", "elements": []}, {"text": "Belle-mère is French for \"mother-in-law\" and for \"stepmother\" (in replacement of the word marâtre, that has gotten the meaning of \"cruel mother\" over time, due to the stereotype that many stepmothers are mean with their stepchildren) and literally means \"beautiful mother\". However, her gravestone after the timeskip spells her name as \"Bell-mère\".", "elements": []}, {"text": "In the fifth One Piece Popularity Poll, Bell-mère ranked 81st.", "elements": []}, {"text": "While still a Marine, Bell-mère was wearing the Marine's jacket that is commonly seen on officers ranking no lower than Captain, suggesting that she was a high-ranking officer.", "elements": [{"text": "Bell-mère is also the first female Marine and female Marine officer to be shown in the series.", "elements": []}]}, {"text": "The tangerine part of Nami's tattoo represents Bell-mère while the pinwheel part represents Genzo, paying homage to her adoptive mother and father figure respectively.", "elements": []}, {"text": "Bell-mère's favorite food is tangerines.", "elements": []}]}], "images": []}]}