{"sections": [{"title": "Nojiko", "level": 1, "content": [{"type": "paragraph", "text": "Nojiko is the owner of a tangerine farm in Cocoyasi Village, and is the adoptive older sister of Nami. They were raised together by their adoptive mother, Bell-mère. She is an ally of the Straw Hat Pirates during the Arlong Park Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nojiko is an average-sized young woman with light blue hair and tanned skin."}, {"type": "paragraph", "text": "Her right arm and chest are heavily tattooed - a gesture of sympathy and condolence towards Nami, who was ashamed of her tattoo of Arlong's jolly roger. In the manga, she also used to wear a bracelet which she gave to Nami. She is usually seen wearing a beige sleeveless shirt (sometimes a green button-up shirt with yellow stripes), blue trousers and purple sandals. Furthermore, she appears to wear pink lip gloss."}, {"type": "paragraph", "text": "After the timeskip, her hair has grown longer, she wears lipstick and she seems to have become slimmer. Much like her sister, her hourglass features have become more pronounced."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nojiko is Nami's levelheaded older sister. She is highly supportive of Nami, her adoptive sister, and generous to Genzo, who she and Nami had seen as a father figure. Unlike her sister, she seemed to keep herself out of trouble, although she apparently had a habit of upsetting boys. As she grew older, she also became partly responsible for the well being of others on the island. During the years of Arlong's rule, she would try to prevent others from raising up against Arlong while Nami worked hard towards honoring her deal with him."}, {"type": "paragraph", "text": "She does not like people who would throw away their lives recklessly. She also has a belief that if you no longer have the will to live and wish to die, so long as you try hard enough, whether adult or child, it will not matter."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Nojiko always had a fairly content relationship with Bell-mère and never saw a problem with being adopted. Unlike Nami, she was aware of the situation she was found in by her and she laughed alongside Bell-mère about how Nami had been unaware of the bloodshed that happened around them."}, {"type": "paragraph", "text": "Growing up, she often supported Nami's bad habits of stealing, much to Bell-mère's annoyance. She was deeply angry at Nami's original recruitment into Arlong's crew, but at the same time knew her sister enough to realize that she would not join the crew without reason. Nami's forever hatred of her tattoo led Nojiko to get her own and at the time she told her adoptive sister she got her tattoos because she wanted some body art like Nami's, something Nami never forgot about when it came round to finally remove Arlong's tattoo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Bell-m%C3%A8re%2C_Nami%2C_and_Nojiko_Together.png/revision/latest/scale-to-width-down/210?cb=20140727104234", "caption": "Nojiko with her adoptive mother and sister."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Nojiko was born in the Oykot Kingdom. She had a tragic past. When she was two years old, everyone around her was killed in a battle between pirates and the Marines. After the fighting had stopped, young Nojiko found a baby girl who still alive and began to wander around until she came across Bell-mère. Using what little strength she had, Bell-mère pulled herself over to the two children and to the relief of both Nojiko and Bell-mère, the baby laughed, seemingly unaware of the bloodshed that had happened."}, {"type": "paragraph", "text": "Soon afterwards, Bell-mère set sail for her home town with the two children and arrived back home during a storm. She handed over the two girls to the village doctor even though she was hurt. Much to the villagers' surprise, Bell-mère announced after all three were better that she was adopting the two girls, Nojiko and the baby (who had been dubbed \"Nami\" by then), something Nojiko was apparently happy about."}, {"type": "paragraph", "text": "Their life together was a struggle as Bell-mère was poor. Being the elder of the two sisters Nojiko had everything bought for her first and Nami would end up with her hand-me-downs. After scolding Nami for denouncing them as a family causing Nami to run off, Nojiko was sent after her."}, {"type": "paragraph", "text": "That same day, Arlong invaded the island and found her home, Bell-mère tried to fend the fish-man off but was quickly subdued. When asked for the fee needed to stay alive, it turned out all the money Bell-mère had would either save herself or her two daughters. Things would have been okay, as Arlong was unaware of the two girls' existence, but Bell-mère gave it to her two girls as she would rather have died than not call herself a mother. To that end, Arlong shot her right in front of the eyes of her two adopted daughters, but not before Bell-mère apologized to Nami for not being richer, and not being able to buy the girls whatever they wanted. With that, she said her final words to the girls: \"I love you.\""}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Bell-m%C3%A8re_Protects_Nami_and_Nojiko.png/revision/latest/scale-to-width-down/210?cb=20130902204936", "caption": "Bell-mère trying to protect Nojiko and Nami from the Arlong Pirates."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Arlong Park Arc", "level": 4, "content": [{"type": "paragraph", "text": "In the present storyline, she saved Usopp and a boy called Chabo from the hands of the fish-men. Upon awakening, she explained Nami's past and her allegiance with the Arlong Pirates. Usopp could hardly believe the woman he had trusted had betrayed them. When Usopp prepared to take off, a group of fish-men arrived and announced that Genzo would be punished for possession of weapon. Nojiko explained to Usopp that they had periodic payments to make to Arlong as a form of tribute. In return, he would not destroy their villages. As Genzo was about to be slaughtered, Usopp was inspired into action and distracted the fish-men as they chased him down. At the same time, Nami suddenly reappeared at the village. Everyone ignored her and treated her with a cold shoulder while Nojiko brought her back to her home."}, {"type": "paragraph", "text": "Later, the Straw Pirates became distraught as they realized Nami was not the person they thoughts she was. Nojiko arrived and revealed Nami's past to the Straw Hats in return for them to leave the island. After trying to stop Nami from attacking captain Nezumi, a Marine officer who tries to take the money Nami raised for her deal with Arlong, Nojiko was shot by him in the back. However, she survived."}, {"type": "paragraph", "text": "She, along with the rest of the villagers of Cocoyasi Village decided to revolt against Arlong. When the arrived at the gate, they found it was blocked by Johnny and Yosaku. They urged the villagers to wait for the Straw Hat Pirates to fight their battle for them. When the Straw Hats arrived, they began attacking Arlong and his crew. However, Luffy found himself in a vulnerable situation and was thrown into the water and was unable to move due to his Devil Fruit powers. Nojiko and Genzo agreed to dive into the pool to save the Straw Hat as it was the only thing they could think of to help the warriors. They used Luffy's Devil Fruit powers and stretched his head out of the water and took turns attempting to free him from the pinning rock. After Nojiko performed CPR, Luffy regained consciousness and spouted water into the air, providing a symbol of hope for the Straw Hats who found themselves outclassed by Arlong. Sanji and Zoro agreed they needed to free Luffy in order to defeat Arlong."}, {"type": "paragraph", "text": "Sanji dove into the pool to free the rock with Nojiko. However, Hatchan appeared and attempted to attack Sanji. Nojiko dove in the way and took the brunt of Hatchan's punches. As a result of the strain, Hatchan had not healed his injuries from Zoro and his wounds opened and halted his attack. Sanji finally destroyed the rock and Luffy was freed. She joined the villagers in watching Luffy defeat Arlong, and destroy his building."}, {"type": "paragraph", "text": "Their celebration was almost cut short as Nezumi arrived to spoil the fun. He ordered the riches of Arlong Park now belonged to the Marines. However, Zoro stepped in and Nami helped push Nezumi out of town so that the villagers could keep the money. The town gathered at the docks to bid adieu to the Straw Hats. However, Nami was nowhere to be found at first as she had secretly left the money in Nojiko's house. She announced for the ship to take off and ran off without taking time to say goodbye to Nojiko directly. The pirates headed off to the Grand Line as Nojiko and the village waved goodbye."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "She is later seen after Nami received her first bounty, apparently content with the idea that she is at least smiling in the photo. She was confused with the ironic fact that Genzo became outraged by the picture on Nami's bounty poster, in which she is only wearing a bikini, even though he possessed an enlarged copy of said picture."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the Straw Hats reunited, Nojiko is seen by Bell-mère's grave with Genzo, Chabo, and Nako. She and Chabo were both wearing aprons displaying Nami's tattoo and tangerines, suggesting they made it into a business."}], "images": []}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the events at Dressrosa, Nojiko and Genzo received Nami's new wanted poster. Nojiko seemed amused watching Genzo complaining about the new photo."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In a response to a fan about whether Kuina and Tashigi's names come from birds, Oda also mentioned that Nojiko's name too comes from a bird, a Japanese yellow bunting.", "elements": []}, {"text": "Nojiko's favorite food is tangerines.", "elements": []}]}], "images": []}]}