{"sections": [{"title": "Miss Monday", "level": 1, "content": [{"type": "paragraph", "text": "Miss Monday is the code name of a former frontier agent of Baroque Works and partner to Igaram (Mr. 8 at the time) during his infiltration of Baroque Works. After the fall of Baroque Works, she stayed at Whisky Peak, and had a child with Mr. 9."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Miss Monday is a tall, muscular woman with dark skin and pink hair pulled into short twin-tails. She wears a short dress with a magenta and white diamond pattern, and three green flowers."}, {"type": "paragraph", "text": "A distinctive feature of hers is her soft high-pitched voice more commonly associated with small, frail girls (which helps when it comes to disguising, as seen when she posed as a nun without her true size and strength being noticed)."}, {"type": "paragraph", "text": "After the timeskip, she has let her hair down and seems to have a generally slimmer physique, though still very muscular."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Miss Monday is very self-confident, impulsive, and relies heavily on her strength, despite this, she is a loyal person who appreciates friendship, as she was willing to risk her life to save one of her former Baroque Works companions: Miss Wednesday."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Miss Monday has incredible strength compared to a normal human as evidenced by her muscle mass and size and by the fact that the Millions from Whisky Peak along with Mr. 8, Mr. 9 and Miss Wednesday were really surprised when someone overpowered her in strength. This strength still pales before foes such as Roronoa Zoro. Miss Monday uses her strength in battle, typically attacking with her fists or nearby objects."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Miss_Monday%27s_Brass_Knuckles.png/revision/latest/scale-to-width-down/185?cb=20130513044648", "caption": "Miss Monday´s great strength is demonstrated with her punch."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "list", "elements": [{"text": "Metal Sheath: Miss Monday uses a metal sheath on her right hand in combat.", "elements": []}, {"text": "Musket: After the time-skip, she is shown with a musket strapped to her back. It is unknown if she knew how to use it before the events of Whisky Peak or if she learned how to use it afterwards.", "elements": []}]}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Kairiki Meriken (カイリキメリケン, Kairiki Meriken, Superhuman Knuckle-duster): Miss Monday puts a metal sheath onto her knuckles, then delivers a punch. In the Viz Manga, 4Kids and FUNimation dubs, this is called Superhuman Brass Knuckles.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whisky Peak Arc", "level": 3, "content": [{"type": "paragraph", "text": "Miss Monday, under the alias \"sister\" confronts Nami in a drinking competition as the pirate's 15th opponent. After Zoro fell asleep from too much drinking Miss Monday told Nami that the pirate should also stop drinking for the sake of Nami's health. Nami falls asleep so Miss Monday wins."}, {"type": "paragraph", "text": "After all the Straw Hat Pirates fell asleep Miss Monday got out of the house and took out her costume. Miss Monday commended the pirates on the amount they could drink and eat and revealed that she was only drinking Sparkling Tea. Miss Monday asked Igarappoi why did they have to stage the welcome party, arguing that the Straw Hat pirates look weak. Miss Monday argued that they should have crushed the pirates in the harbor because the town is already short enough on food and they wouldn't be able to get the whale's meat. This caused Mr. 9 and Miss Wednesday to get mad and defend themselves. Miss Monday was surprised to see Luffy's bounty poster shown by Igarappoi. Miss Monday apologized for misjudging the pirates' strength from their appearances."}, {"type": "paragraph", "text": "After Roronoa Zoro showed how powerful he is against the millions, Miss Monday, alongside Mr. 8, Mr. 9, and Miss Wednesday (Princess Vivi) decided they have to deal with the pirate hunter themselves. Miss Monday was surprised to see that Zoro decided to take on all the Baroque Works agents on Whisky Peak all by himself. While Zoro was occupied with 4 Millions, Miss Monday threw a barrel at him, but Zoro managed to cut it in 4 parts defeating the 4 Millions. Miss Monday was surprised to see that."}, {"type": "paragraph", "text": "After a few moments, Miss Monday appeared again and attacked Zoro with a ladder, but Zoro dodged it and the ladder broke in half when it hit the wall. Miss Monday put on a metal sheath on right hand knuckles, caught Zoro by his neck and hit him in the face with the move \"Superhuman Brass Knuckles\". Zoro caught Miss Monday by her head and overpowered her and deemed her unconscious. For Miss Monday to lose a contest of strength was something that surprised the Millions and the 3 officers, enough that they started to doubt that Luffy is the captain and to think that the bounty was meant for Zoro."}, {"type": "paragraph", "text": "Later after Vivi is exposed by Mr. 5 and Miss Valentine, Miss Monday tries to hold the officers off because she will be punished anyway for failing to defeat the swordsman so if she has to go down she wants to do that while helping a friend. Miss Valentine said that it is a joke that Miss Monday tries to hold them off and Mr. 5 said that Miss Monday alongside Mr. 9 disgraced the name of Baroque Works and quickly defeated her with an explosive arm."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c8/Miss_Monday_Defeated.png/revision/latest/scale-to-width-down/210?cb=20130513044819", "caption": "Miss Monday is easily overpowered by Zoro."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Miss Monday is shown two years later alive and well, still living in Whisky Peak. She now has a child with Mr. 9."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Miss_Monday_and_Mr._9_Post_Timeskip.png/revision/latest/scale-to-width-down/210?cb=20130724084839", "caption": "Miss Monday reads about the Straw Hats while Mr. 9 plays with their child."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids dub, she was voiced by a male voice actor, in contrast to the more feminine-sounding voice in the original. However, in the FUNimation dub, she is voiced by a female voice actor. Her nun costume is also edited into a black robe."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Miss Monday vs. Roronoa Zoro", "elements": []}, {"text": "Miss Monday vs. Mr. 5", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Legend of the Rainbow Island", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The pair have a \"deception\" theme as such. Miss Monday dressed in a nun costume that hid her muscular body and Mr. 8 had guns hidden in the rolls of his hair.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 107 (p. 9) and Episode 64, Ms. Monday debuts.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga — Vol. 64 Chapter 632, cover story: From the Decks of the World Vol. 17, After time skip, still living in Whisky Peak with her husband Mr. 9.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 13 Chapter 111 (p. 9-11) and Episode 66, Miss Monday sacrifices herself for Vivi and her defeat to Mr. 5 and Miss Valentine", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 108 (p. 17-18) and Episode 65, Zoro defeats Miss Monday.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 13 Chapter 110.", "elements": []}, {"text": "↑  One Piece Anime  - Scottie Ray -  http://en.wikipedia.org/wiki/Scottiem Ray  - Miss Monday's male voice actor, 4KidsTV anime dub version.", "elements": []}]}], "images": []}]}