{"sections": [{"title": "Kureha", "level": 1, "content": [{"type": "paragraph", "text": "Dr. Kureha is an extremely elderly doctor who works on Drum Island. She is referred to as \"witch\" by some people. She is Tony Tony Chopper's mentor and adoptive mother. She is also head of the Isshi-100."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Despite her exceptionally advanced age and apart from her well-wrinkled faced, Kureha is a slender woman in her prime. Dr. Kureha dresses in a style more suited to women one-seventh her age. This includes a navel ring, a shirt that bares her midriff, a purple blazer and purple low-riding pants. She has a pair of small sunglasses that, when they're not over her eyes, she wears on her forehead even when she's using glasses. She wears bracelets and rings on her left hand."}, {"type": "paragraph", "text": "In the past, she wore her hair in bunches with pink ties. Her pale yellow shirt had an alternating solid green line and purple dotted line pattern."}, {"type": "paragraph", "text": "During the Drum Island arc, she wore pants with a pink design on the left leg and a blazer with a yellow line along the shoulders and down each arm. She wore a white shirt with a pink cherry blossom on the front and green sleeves and borders."}, {"type": "paragraph", "text": "When Dalton informed her of the Straw Hats' bounties after Enies Lobby, her blazer and pants were solid purple. Her blazer had a fur collar and trim, and orange shirt with a thin bull-head silhouette. Her belt buckle had either a sun or flower design on it."}, {"type": "paragraph", "text": "After the time skip, she does not look different from two years before. Her blazer had an orange flame pattern along the bottom and on the edge of the right sleeve. Her pants had the same pattern on the left leg. Her shirt had a top hat in front of an X (likely representing Hiriluk and Chopper respectively), which is the symbol of the Isshi-100."}, {"type": "paragraph", "text": "She was later seen wearing a shirt with a heart. In the Levely Arc, Kureha wears her blazer and pants, similar to her time skip outift. She had a white shirt that said WANTED 100."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Dr. Kureha has often been called a witch for several reasons. The first is her eccentric treatment of patients whom she will violently threaten if they do not follow her orders. The second is her forceful method of checking for injury for example deliberately prodding the ailing area, causing her patients pain and then having Chopper knock them out as a form of anesthetic. The next is her age, a 'too young' 141. The final reason is her reclusive nature. She hates being called \"old\" or a \"hag\" and her response is generally to punch or kick the offender across the room, and often begins conversations by asking if whoever she's speaking to wants to know the secret of her youth. Kureha seems to have a drinking habit, judging by the bottle of plum sake (梅酒, umeshu) that she always keeps close at hand."}, {"type": "paragraph", "text": "She is, however, a legitimate and extremely skilled practitioner of medicine, managing to cure a disease Nami had which was caused by a bug thought to be extinct."}, {"type": "paragraph", "text": "Kureha takes utmost pride in preserving her supreme health and constitution in her prime despite being a centenarian. She would frequently misunderstood people asking her for the secret of her youth during conversations as shown with Nami and later with Wapol at Mary Geoise. Kureha takes great offense to people calling her old or any term directly related to being called an elderly and would violently assault them in retaliation as shown with Sanji and Luffy. Kureha is also sometimes referred to as being a pirate because she takes what ever she wants as payment for her medical treatments. She apparently likes pickled plums, as stated by Dalton."}, {"type": "paragraph", "text": "Despite her cold demeanor, she does have a loving side to her personality, as she considers Chopper a son and was gravely depressed when Dr. Hiriluk died."}, {"type": "paragraph", "text": "Kureha also appears to incredibly thoughtful carefully deducting Luffy having the initial D would make him a dangerous man and being able to correctly say the Pirate King's real name as Gol D. Roger rather than Gold Roger. She then showed some familiarity with the Will of D. which made her the first person in the series to mention it as most have no idea of its meaning."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Tony Tony Chopper", "level": 3, "content": [{"type": "paragraph", "text": "Chopper is her adoptive son. Having reluctantly agreed to one of Hiriluk's last requests, she trained Chopper in medical science, claiming she taught Chopper \"everything she knew\", and was fairly impressed by the young reindeer's skill. She only once complimented Choppers skill in a filler episode, after Chopper cured her of a life threatening illness without any of Kureha's medical advice. While she often hides her feelings towards him, such as when she put on an act of tough love to encourage Chopper to leave Drum Island and travel the world, she considers Chopper to be her son. She is very happy to know he is currently doing well."}], "images": []}, {"title": "Hiriluk", "level": 3, "content": [{"type": "paragraph", "text": "Dr. Kureha had an odd relationship with Dr. Hiriluk, seeming to enjoy the camaraderie of a fellow \"doctor\", but dismissing most of his ideas as those of a quack. The two of them seems to have known each other for a long time. When she realized that Hiriluk is dying, she agreed (reluctantly) to his last requests: to make his life's work come to fruition and to train Tony Tony Chopper in medicine."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Medical Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Dr. Kureha possesses genius skills and immense medical knowledge as one of the finest doctors in the world. Her understanding of medicine and the art of healing is exceptional even among the medically advanced doctors of the Drum Kingdom as shown as she could not only live well beyond the normal human life expectancy unaided, but also retain an immensely robust health at the same time. She managed to create an antibiotic to cure Nami when she was bitten and infected by the ancient tick, Kestia, which was thought to be extinct, and as such, the cure would be difficult to find. She is also one of the few doctors around the world authorized to use the highly restricted drug, NHC10. She passed on many of her skills and knowledge to Chopper, who became a great doctor in his own right. After establishing a medical academy, she taught and trained at least eighty students who became skilled enough to join the Isshi-20, expanding their members to a hundred under her leadership. She is also extremely good at telling temperatures, deducing Nami's exact temperature simply by poking her forehead with her index finger."}], "images": []}, {"title": "Physical Abilities ", "level": 3, "content": [{"type": "paragraph", "text": "Outside of her medical expertise, she possesses a significantly high level of superhuman strength and speed to match her vast longevity. She was shown to crush stone walls with ease and carry around and throw entire arsenal of heavy weapons effortlessly. She had immense resistance against the cold, as she is often seen walking through the extremely cold climate of Drum Island with very loose clothing. She could easily beat up Luffy and Sanji when both insulted her as as old, sending them crashing towards walls with powerful kicks."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Doctor Stop! (ドクターストップ, Dokutā Sutoppu): A technique Kureha used for physical therapy. Whenever she sees a patient about to do something she believes might compromise her medical treatments or interrupt their recovery process, she 'stops' them by any means necessary whether it is to pin them down with her body or stomp them down into the ground. While her methods appear to be brutal and painful, she actually stops the patient from sustaining far worse injury than if she had let them go. For example, stomping on Sanji's damaged spine to immobilize him was a safer option than letting him fight which would have strained his injury to a point that may have prevented him from walking ever again.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Not much is known about Kureha's past, but she lived enough to know that the pirate king Roger's name was correctly spelled as \"Gol D. Roger\", instead of \"Gold Roger\", as well as possibly having some knowledge of the Will of D, although the full details behind these are currently unknown."}, {"type": "paragraph", "text": "When the selfish king Wapol declared any doctor on Drum Island not under his authority to be felons, Kureha and the quack doctor Hiriluk were the only free doctors left. However, unlike Kureha, Hiriluk ended up doing more damage than good to his patients by accident."}, {"type": "paragraph", "text": "One year later, when Hiriluk learned that he was dying, he begged Kureha to give him more time so that he can complete his Sakura powder research. Kureha mocks him and tells him that his one time cure that he believed helped him in his past life as a thief will not cure Drum Island. While Kureha argues with Hiriluk, she notices Hiriluk's adoptive son, the reindeer Tony Tony Chopper, is spying on them from the window."}, {"type": "paragraph", "text": "Some time later, Hiriluk heard news that Wapol's personal 20 doctors, the Isshi-20, were gravely ill and planned to rush to Wapol's Drum Castle. He first headed toward Kureha's house and begged her to complete two things: to continue his research on the Sakura powder and to teach Chopper medical knowledge so that he can become a good doctor. Kureha is angered by the favors and the request for them to be completed for free and kicks Hiriluk out."}, {"type": "paragraph", "text": "However, Kureha wondered why Hiriluk was in such a hurry while he had still two weeks to live. When she rushes into his house, she encounters Chopper who said that Hiriluk got better thanks to his mushroom soup. Finally understanding the reason for Hiriluk's hurry, Kureha angrily smacks Chopper, revealing that his mushroom is a deadly poisonous one and Hiriluk has only one hour left before he dies. Confused, a crying Chopper states that the \"jolly roger\" sign next to the mushroom picture he found in a book was a symbol of a magic cure. Understanding the good intention of the reindeer, who was unaware of what that sign meant medically due to Hiriluk's praising of pirates and the Jolly Roger, Kureha tells Chopper that he can do nothing without learning medical knowledge first and that Hiriluk has probably reached Wapol's castle so that he could die there. Shocked, Chopper hurried to the castle."}, {"type": "paragraph", "text": "While Hiriluk drank one of his failed medicines to die (in order to keep Chopper's poison from being the cause of his death), Kureha drank her bottle at the same time, bidding farewell to Hiriluk in her thoughts. Later, Chopper went to Kureha, waving Hiriluk's Jolly Roger outside her house and sobbing heavily, wanting her to take him in, vowing that he would become a great doctor capable of curing any disease."}, {"type": "paragraph", "text": "As one of Hiriluk's last wishes, Kureha took Chopper in and taught him \"real\" medicine for the next six years. Following the Blackbeard Pirates' attack on Drum Island and Wapol and his forces cowardly fleeing, Kureha and Chopper would take up residence in the abandoned Drum Castle, coming down the mountain occasionally to seek out anyone in need of medical attention (although Kureha demanded extravagant payments for her services)."}, {"type": "paragraph", "text": "As Chopper's studies grew, he eventually developed the Rumble Ball which could modify the wavelengths in a Zoan Devil Fruit's transformation abilities, giving him four extra forms. However, during one experiment where he took three Rumble Balls at once, he inadvertently took on an uncontrollable 'monster' form that went on a rampage and nearly wiped out an entire village, though fortunately nobody was killed. Chopper woke up in one of Kureha's hospital beds, bandaged and having no memory of what happened once he had eaten the Rumble Balls. After getting a lecture from Kureha to be more careful and that this form posed a danger to his friends, foes, and even himself, he promised never to unleash his monster form again."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Drum Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kureha is first seen with Chopper while seeking out and treating a child in Cocoa Weed. She noted inflammation in the child's limbs and diagnosed a bacterial infection in his bones. As payment she demanded various supplies and 50% of the bar's money, but when Tamachibi thanks her, she lowers it to 49%."}, {"type": "paragraph", "text": "Luffy arrived at the castle doors and passed out. Kureha had Chopper bring the pirates in for treatment. She informed Nami, after she woke up, she had saved her from a rare insect bite that would have killed her in two days time. She then offered her a free pass at attempting to convince her assistant, Chopper, to join her crew, but warned her that convincing him to join would be difficult due to Chopper mistrusting others."}, {"type": "paragraph", "text": "Soon, Chopper returned and announced that Wapol had returned as he could smell him. They peered outside and found Wapol and his men ready to storm the castle. Luffy challenged Wapol and nearly punched him off the mountain as Chopper had emotions stirred up inside him and recalled his past of how Wapol had killed his previous master. However, they were soon assaulted by Wapol and his men. Luffy, Sanji, and Chopper fought against Wapol until he unleashed his ultimate form. Kureha watched and told them she would fight if she was required to step in. When Sanji became injured, she stood next to him as they watched Luffy and Chopper continue the fight. When Sanji attempted to rejoin, she stepped in the way and swore an oath as a doctor to make sure she took care of her patients, even if it means restricting them from fighting."}, {"type": "paragraph", "text": "Knowing that Chopper would do well to gain real-world experience, Kureha encouraged Chopper (by forbidding him from it) to leave the island with the Straw Hat Pirates. Standing on the ramparts of Drum Castle, she gave her wayward student a tearful send-off of gigantic proportions, setting off the \"cure\" that Dr. Hiriluk envisioned for the island: pink sakura snowflakes falling from the sky to warm the island's frosted heart. She apparently did not have her navel ring at this time. She was the first person in the current storyline to mention the Will of D. and also the first to refer to Gol D. Roger by his real name, instead of Gold Roger."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "She appears again later in the story using a Lapahn to pull her sleigh. She is called by Dalton to look at the new wanted posters of the Straw Hat Pirates. She makes note of Chopper's wanted poster of 50. While Dalton suggests that the value is a mistake, Kureha states that she is simply happy to have seen his face. She does not appear to mind that Dalton has become the new king of Drum Island, even offering him a room in \"her\" castle. The two now appear to be friends."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Dr. Kureha had taken command of the Isshi-20 and formed a medical academy at Drum Castle. Two years later, Kureha was seen with the Isshi-20, which had increased to 100. Her castle seemed to have become the island's medical center with her as the head-doctor. Their new doctor flag is made up of the \"X\" on Chopper's hat with Hiriluk's top-hat inside it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/01/Isshi-100_Manga_Infobox.png/revision/latest/scale-to-width-down/185?cb=20130116005520", "caption": "Kureha with Sakura Kingdom's other doctors."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "Dr. Kureha and Dalton later received news of the Straw Hats' accomplishment at Dressrosa."}], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "For the trip to the Levely at Mary Geoise, Kureha decided to accompany Dalton as his ship's doctor, despite his protests."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Kureha read about it on a newspaper. Kureha and Dalton later arrived at Mary Geoise. At the castle, they had a brief unpleasant reunion with Wapol and got reacquainted with Vivi. After Donquixote Mjosgard stopped Charlos from enslaving Shirahoshi, Kureha stood next to Vivi as Mjosgard promised to protect Shirahoshi during the Levely."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids dub, the bottle of umeshu Dr. Kureha drinks from is changed to \"bug juice loaded with sugar\". She was also changed from being 139 years old (at the time) to \"a young 99 and a half year-old\". As opposed to her nickname \"Doctorine\" in the Japanese version, the 4kids dub changes this to \"Dr. K\", a possible reference to 4Kids' other series Cubix: Robots for Everyone, which also features a character named Dr. K voiced by Maddie Blaustein."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the manga she has a very dark shade of grey hair color instead of light white/yellow.", "elements": []}, {"text": "In the anime she encounters a freezing Zoro on her way back to the castle, who she refuses to give him a ride in her sleigh for calling her an old lady.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In an SBS, a reader asks Oda if Dr. Kureha will be alright on the next year as Oda discussed that in One Piece world, a normal human can only live up to 140 years, though she is already 141 years old; Oda said she is still superhuman (in the sense that she goes beyond other people), so she will be okay.", "elements": []}, {"text": "At 141 years old, she is the oldest known human in the series.", "elements": []}, {"text": "In the 4th Japanese Fan Poll, Dr. Kureha is ranked the 54th-most popular character in One Piece.", "elements": []}, {"text": "Kureha has her own distinct laugh; she starts her laughs with \"Hee\" (i.e. Heeheeheehee!), reinforcing her similarity to a witch. However, in the anime, her laugh sounds exactly like the eerie laughter of Kitaro from the 2008 horror remake of the classic anime \"Ge Ge Ge no Kitaro\" called \"Hakaba Kitaro\". Masako Nozawa voices both Dr. Kureha and Kitaro as well as Kitaro from the 1968 and 1971 versions of the \"Ge Ge Ge no Kitaro\" anime.", "elements": []}, {"text": "Kureha's favorite foods are alcoholic drinks and umeboshi.", "elements": []}]}], "images": []}]}