{"sections": [{"title": "Hiriluk", "level": 1, "content": [{"type": "paragraph", "text": "Dr. Hiriluk was a quack doctor from Drum Island, as well as Tony Tony Chopper's father figure."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hiriluk wore mottled pink pants and a black coat over a green shirt. Over his bizarre white hair resembling a cross, he wore a black hat that matched his coat. He had long gray hair arranged in three standing outs, one to each side and one at the top, the latter of which is covered by his hat. He also had a black goatee and mustache."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hiriluk was a very eccentric man, who would test his experimental medication on unsuspecting patients only for it to backfire, causing the quack doctor to flee. However he was very caring towards others, as he honestly tried his best to cure them of their afflictions, and never desired any rewards. This also extended to animals, as upon meeting the heavily wounded Chopper, his first instinct was to help the injured soul. Even when Chopper retaliated with violence, Hiriluk did not back down and ended up taking on a fatherly role to the abandoned reindeer. The quack doctor's compassion showed itself when he chose to sacrifice himself rather than let Wapol have his way, as he knew that the country he lived in would eventually recover, with his actions having a lasting effect on many people who knew of his true caring intentions."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Thievery", "level": 3, "content": [{"type": "paragraph", "text": "In his past, Hiriluk was a thief, and while his skills and professionalism are unknown, it can be assumed he was good enough to survive in this profession for several years. During his work on Drum Island, he charged and took money from his patients despite not curing them at all and even caused them more harm, making the citizens labeled him as a thief."}], "images": []}, {"title": "Medical Expertise", "level": 3, "content": [{"type": "paragraph", "text": "As he believed that he was cured from his disease, Hiriluk studied the arts of medicine. His full knowledge in the subject is unknown, but he was able to provide Chopper with some first aid and diagnose himself when his illness returned."}, {"type": "paragraph", "text": "While it is unknown where he learned his skills, Hiriluk worked solely on Drum Island, where he was considered a quack doctor by everyone. After his death and despite his lack of knowledge, his beliefs on medicine awoke the Isshi-20's work ethics."}], "images": []}, {"title": "Chemistry", "level": 3, "content": [{"type": "paragraph", "text": "Hiriluk's main strength was his scientific experiments and despite being far from medically beneficial, he was able to create several concoctions with varying results. He shared his work with his friends and entrusted it with them after his death. Shortly before his death, he intensified his work, vowing to complete it before that happened."}], "images": []}, {"title": "Weapons", "level": 3, "content": [], "images": []}, {"title": "Firearms", "level": 4, "content": [{"type": "paragraph", "text": "Hiriluk used several firearms during his stay at Drum Island. He used a tranquilizer gun, which he also used to fool people into thinking he has a pistol,  and a rifle. He showed some marksmanship skills with his firearms, hitting a moving target with a tranquilizer and intentionally missing Chopper with his rifle."}], "images": []}, {"title": "Bombs", "level": 4, "content": [{"type": "paragraph", "text": "Hiriluk also used bombs to escape his pursuers."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Wapol", "level": 3, "content": [{"type": "paragraph", "text": "When Wapol declared a Doctor Hunt, he saw Hiriluk as one of the two main threats to controlling the kingdom, despite the doctor being a quack. Upon Hiriluk's suicide, Wapol and his loyal subordinates Chess and Kuromarimo laughed, they being the only three to do so, having no respect for the doctor whatsoever."}], "images": []}, {"title": "Tony Tony Chopper", "level": 3, "content": [{"type": "paragraph", "text": "Tony Tony Chopper was very close to Hiriluk ever since the doctor saved him and adopted him as a surrogate son, despite the two arguing almost constantly. Despite being short, their relationship was extremely strong, with Hiriluk being Chopper's first friend. Hiriluk in return loved Chopper and even ate a poisonous mushroom to encourage Chopper to became a doctor. That showed how strong Hiriluk's love was, as he took the deadly dish despite his life's work not yet proven to be completed. Chopper was devastated by his death and decided to become the best doctor he could through the teachings of Kureha. Despite the superior skills of Kureha and other doctors, Chopper would forever memorialize Hiriluk as the \"greatest doctor in the world\"."}], "images": []}, {"title": "Kureha", "level": 3, "content": [{"type": "paragraph", "text": "Being the only remaining free doctors on Drum Island under Wapol's rule, Hiriluk and Kureha share a friendly connection. Hiriluk trusted Kureha, and regularly came to her for medical advice. Knowing he was about to die, Hiriluk came to Kureha and asked her to continue his work in curing the kingdom and training Chopper. Kureha was shown to deeply care for Hiriluk, and even drank to the charlatan's final moments, and complied to his last wishes of teaching Chopper the medical arts and spreading the cherry powders to Drum island."}], "images": []}, {"title": "Dalton", "level": 3, "content": [{"type": "paragraph", "text": "Dalton originally thought of Hiriluk as a simple quack doctor, though after seeing him come unhesitatingly to save the so-claimed sick Isshi-20, even knowing it was an obvious trap, Dalton came to see Hiriluk as a brave and noble man. After the doctor's final motivating speech and suicide, Dalton finally brought out his courage to defy Wapol's despotic actions once and for all."}], "images": []}, {"title": "Isshi-20", "level": 3, "content": [{"type": "paragraph", "text": "While the twenty doctors possess skills and talent much superior to Hiriluk, they see him as an inspiration and role model after he came unhesitatingly when he heard they were ill, despite knowing it was a trap set by Wapol. This, coupled with his motivating speech before death, led them to dedicate their research for the betterment of Drum Island, despite working for Wapol in fear, in their own proclamation of not wanting to lose to the quack."}], "images": []}, {"title": "Sakura Kingdom", "level": 3, "content": [{"type": "paragraph", "text": "It took Hiriluk thirty years to complete his research, which was to create cherry blossoms that would bloom in the snow, in hopes of curing the hearts of the country's people. His work was not realized until after his death when Kureha blasted the powder he created into the sky, making the falling snow resemble cherry blossoms by turning it pink. For this, the people of Drum Island renamed their kingdom \"Sakura Kingdom\"."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "In his early days, Hiriluk was a thief who was diagnosed with a fatal illness. What he believed cured him was the serene vision of a grove of cherry trees. After being cured, he came to believe that there is no disease in the world that cannot be cured. He had a complete change of heart and returned to Drum Island, the island he was born on, to help cure a dire illness. Hiriluk's main dream was to cure the people on the island of their frozen hearts which had formed because of Wapol's selfishness. After Wapol declared any doctor not under his authority to be felons, he and Doctor Kureha were the only free doctors left. However, unlike Kureha, Hiriluk ended up doing more damage than good to his patients by accident."}, {"type": "paragraph", "text": "While traveling home in a blizzard, he found Chopper wounded on the ground after he was attacked by villagers. At first Chopper tried to knock him away, but Hiriluk earned his trust by stripping naked in the cold, showing that he did not have any weapons or intention of hurting Chopper. From then on, the two slowly formed a sort of father/son relationship, traveling (and in a way terrorizing) the island trying to cure patients and generally resulting in them having to literally run for their lives from angry patients or their associates."}, {"type": "paragraph", "text": "After one year had passed, Hiriluk reluctantly kicked Chopper out of his house, as he was going to die from his terminal illness. Hiriluk did not want his friend to worry about him. After Chopper learned the truth, he went on a journey for an Amiudake mushroom. Sadly, unknown to the reindeer, the mushroom turned out to be poisonous. Hiriluk took it because he was so moved by Chopper's concern for his well-being (Hiriluk had always called the Jolly Roger a symbol of vitality, which Chopper took literally, not realizing that the skull and crossbones symbol in the medicine book he read meant that the mushroom was poisonous). Soon after, he realized that his 30 year-long experiment was finally complete, and declared that the country would finally be saved."}, {"type": "paragraph", "text": "Afterward, Hiriluk heard news that Wapol's personal 20 doctors, the Isshi-20, were gravely ill and rushed to the castle, only to find out it was a trap by Wapol to draw Hiriluk out and kill him. However, he began crying out of joy at seeing that the doctors were well. When Wapol ordered him executed, Hiriluk asked not to waste their ammo and gave out a inspiring speech."}, {"type": "paragraph", "text": "He then declared that even if he should die, his dream of curing the kingdom's sickness of the heart will still come true, which deeply impacted a crying Dalton. With his time coming to an end, he poured another failed medicine, with which he will use to kill himself in order to keep Chopper's poison from being the cause of his death. He then shouted to the heavens that he has had a wonderful life, and thanked Chopper for all of it. He then drank the medicine, causing him to die in a huge explosion, leaving only his trademark hat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/33/Hiriluk_with_Research.png/revision/latest/scale-to-width-down/210?cb=20121124232450", "caption": "Hiriluk with his research."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7f/Hiriluk_Hugs_Chopper.png/revision/latest/scale-to-width-down/210?cb=20130218232322", "caption": "Hiriluk hugs Chopper after he brought back the Amiudake mushroom."}]}, {"title": "Post-Mortem", "level": 3, "content": [{"type": "paragraph", "text": "Chopper was initially shocked to the core at seeing his mentor and father-figure die and, after hearing Wapol laugh at his demise, became so enraged and attempted to attack the corrupt king. However, Dalton stopped him and begged him not waste his life for revenge. Chopper then left, taking Hiriluk's hat to make a grave marker, while Dalton finally spoke against Wapol for his heartless ways. Kureha then took in Chopper as her apprentice and held on to his cherry-blossom powder, as is the quack doctor's final wish."}, {"type": "paragraph", "text": "After Wapol's self-exile to escape a terrible enemy, Kureha and Chopper took residence within the abandoned castle and hung Hiriluk's personal Jolly Roger over the tallest tower as tribute to him."}, {"type": "paragraph", "text": "After Wapol's defeat, Chopper went out to become a pirate. But just before he left, Kureha began shooting Hiriluk's dust into the sky, causing the snow to turn pink like cherry-blossoms, thus finally accomplishing the doctor's 30-year dream at last."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hiriluk's last words were modified in the 4kids Entertainment dub. In the Japanese version, his last words are \"Oh, what a great life I've had! Thank you Chopper!\". This was changed to \"I am a doctor!\" in the 4Kids dub.", "elements": []}, {"text": "In the 4Kids dub, the scene where Hiriluk was running to the castle, the bombs were edited out of his hands.", "elements": []}, {"text": "In the 4Kids dub, the scene where he explodes is edited out, with just his hat flying in the air, making it seem that he had merely fallen over dead.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He was issued alongside Chopper in a One Piece Block Figures set featuring the Straw Hats and their past mentors/loved ones."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the 6th Japanese fan poll, Hiriluk is ranked the 76th most popular character in One Piece.", "elements": []}, {"text": "The shape of Hiriluk's head is modeled after a medical cross.", "elements": []}, {"text": "His name comes from the Ancient Greek term \"Chirurg\", meaning \"surgeon\" or literally \"one working with his hands\".", "elements": []}, {"text": "During the sequence when Hiriluk commits suicide in the anime, a musical chorus of Ellens dritter Gesang is played as he confronts Wapol and his entourage.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Quackery – Wikipedia article about what Hiriluk was doing instead of practicing actual medicine.", "elements": []}, {"text": "Ellens dritter Gesang – Wikipedia article about the lied played during Hiriluk's suicide in the anime.", "elements": []}]}], "images": []}]}