{"sections": [{"title": "Baby 5", "level": 1, "content": [{"type": "paragraph", "text": "Baby 5 is the alias of a member of the Happo Navy who is married to Sai, the Happo Navy's 13th leader. She is a former servant and assassin of the Donquixote Pirates serving as an officer in the Pica Army. Her real name has not been revealed."}, {"type": "paragraph", "text": "Due to her actions, she is a minor antagonist during the Punk Hazard Arc, and a supporting antagonist during the Dressrosa Arc, before becoming an ally of the Straw Hat Pirates after her engagement with Sai in the same Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Baby 5 is a young woman of above average height. She has a slim but curvaceous well-endowed figure. She wears lipstick, a burgundy French maid outfit with white frills, matching high heel shoes, and various tan belts for carrying weapons. She has been seen smoking a cigarette on multiple occasions and sometimes carries heavy weapons on her back, including a large rifle, an axe, and a sword. She has long black hair, which she wears slightly curled and adorned with a white lace headband."}, {"type": "paragraph", "text": "When she arrived at Punk Hazard, she wore goggles around her eyes, which started filling up with tears when she cried. Upon her arrival at Punk Hazard, she was seen carrying new weapons on her back: a large bazooka and a large Gatling gun."}, {"type": "paragraph", "text": "At eight years old, she had much shorter hair and wore a yellow ribbon on top of it. At 14 years old, her hair seemed less wavy, she lacked lipstick, her hair ribbon was red, and she wore simple brown gloves."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Having been abandoned by her mother, who called her useless before parting, Baby 5 is unable to turn down any favors asked of her. She seems delighted at the notion that she is needed whenever she is asked to do something, even if the person made it clear that it was a mere joke right afterward."}, {"type": "paragraph", "text": "This behavior can make her want to marry, help, lend money to, or buy things from anybody who asks. She is known to even buy weapons from someone, despite their uselessness to her in particular, while naively believing the salesman in that the owner of the weapons would be blessed with happiness. As a result, she has a debt of 98,000,000 and eight late fiancés. Her naïve nature was highlighted in her battle with Sai, as she mistook his words as flirtations and even offered to be of use to him, despite him being an enemy of her crew."}, {"type": "paragraph", "text": "When she is unable to help a person, she deeply regrets it to the point that she wants to commit suicide. Even when someone explains that she needs to stop granting favors to everyone she meets, she always ends up overwhelmed by the feeling of being needed. Outside of her desire to be needed, Baby 5 is an incredibly emotional person, once losing control and attacking Donquixote Doflamingo, her superior, for murdering her fiance. She has repeatedly gotten angry at Law, only to cry and seek comfort from Buffalo moments later when he glares at her."}, {"type": "paragraph", "text": "During her childhood, Baby 5 was something of a prankster, playing tricks on the ever-clumsy Corazon and getting a chuckle at the officer's expense, such as delivering scalding tea to him that burnt his tongue, despite being struck across the face in return."}, {"type": "paragraph", "text": "After Sai married her, she was happy to finally become a wife as she happily clung to her husband's arm."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Baby_5_Feels_Needed.png/revision/latest/scale-to-width-down/200?cb=20141206165956", "caption": "Baby 5 getting the impression that she is being needed."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/Baby_5_Willing_To_Commit_Suicide.png/revision/latest/scale-to-width-down/210?cb=20150923194440", "caption": "Baby 5 willing to commit suicide for Sai."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Biological Mother", "level": 4, "content": [{"type": "paragraph", "text": "Baby 5 did not appear to have a good relationship with her mother, who abandoned her at a young age in a mountain area. After being called useless by her mother, Baby 5 became extremely determined to be needed by others in order to keep them from abandoning her."}], "images": []}, {"title": "Sai", "level": 4, "content": [{"type": "paragraph", "text": "Baby 5 initially fought against Sai at Dressrosa due to being on opposite sides. During her fight with him, she had a misunderstanding where she interpreted his words as a series of romantic pick-up lines. In his opposition to her tendency to do whatever is asked of her, he told her to kill herself, which she almost did but he was quick to stop her. Lao G challenged Sai in an attempt to thwart the supposed proposal. Realizing she had spent her life feeling useless, he vowed to make her his wife if he won, much to her joy. He defeated Lao G and Baby 5 conceded, sealing their engagement. After the battle with Lao G, Baby 5 started to refer to Sai as \"darling\" when discussing their wedding, much to the latter's vexation. After Sai officially broke off the engagement with Uholisia, he married Baby 5 and helped achieve her dream of becoming a wife."}], "images": []}, {"title": "Chinjao", "level": 4, "content": [{"type": "paragraph", "text": "At first, Chinjao and Baby 5 were enemies given their respective association with Luffy and Doflamingo. During the Birdcage game, Chinjao thought that Sai was \"proposing\" to Baby 5 due to a misunderstanding and miscommunication. Chinjao would allow Baby 5 to commit suicide, going as far as to prevent Sai from saving her. However, after Sai managed to bend Chinjao's drill-shaped head with a kick, Chinjao became less antagonistic towards Baby 5 though he became irritated with her when she commented that they would have to hold two ceremonies, a wedding and a funeral for Chinjao. Chinjao permitted Sai to call off his engagement to Uholisia so he could marry her and was later shown celebrating Sai and Baby 5's wedding, indicating that he accepted her as his granddaughter-in-law."}], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Baby 5 has been a long member of the Donquixote Pirates, but even as an active member, she has had a grudge against her captain for killing eight of her previous boyfriends. She continuously tries to attack him with fatal blows because of this, albeit without success. However, Doflamingo does not consider it a rebellion or a threat to him, as he assigned her to go to Punk Hazard with Buffalo to assist Vergo right after she attacked him. Buffalo says that Doflamingo thinks of her as a younger sister, and that he is merely protecting her from her own \"personality flaws.\""}, {"type": "paragraph", "text": "However, when Doflamingo asks her to do something, the feeling of being needed implores her to help him again, and she considers any inability to respond to his need to be a failure on her part."}, {"type": "paragraph", "text": "When infuriated by the deaths of her fiancés, she refers to him as \"Joker\" rather than his true name or, as some other members refer to him, \"young master.\" At times when she wants to help him, she refers to him as \"young master\" like the others."}, {"type": "paragraph", "text": "Doflamingo has yet to find out of Baby 5's eventual betrayal, and it is assumed that she will be regarded, like Law, as a traitor. Thus, the Donquixote Pirates are theoretically enemies of Baby 5."}], "images": []}, {"title": "Pica", "level": 4, "content": [{"type": "paragraph", "text": "Not much is known about her relationship with Pica, but as an elite officer of the Donquixote Pirates and the leader of Baby 5's division, she treated Pica with great respect to the point of shooting a grunt for laughing at Pica's high pitched voice. However, after agreeing to marry Sai, which effectively meant defecting from the Donquixote Pirates, Baby 5 was attacked by Pica for her betrayal. She was saved by Sai and bore witness to Pica's defeat from Zoro's hands."}], "images": []}, {"title": "Trebol", "level": 4, "content": [{"type": "paragraph", "text": "Trebol seems to be quite uncaring and casual with Baby 5 and enjoys making fun of both her quirk of accepting every marriage proposal that comes her way and the fact that Doflamingo keeps killing off her fiancés. He even jokingly asks for her hand in marriage, despite knowing that she'll take it seriously, and simply laughs it off, showing that he has little respect for her. Baby 5 does not seem very fond of him either, chiding him for getting too close to her when they talk and for his crude remarks."}], "images": []}, {"title": "Gladius", "level": 4, "content": [{"type": "paragraph", "text": "The two are seen talking casually shortly after he shot her, indicating a strange relationship and also her of being forgiving towards Gladius. Baby 5 showed worry when he got angry, fearing that his head would explode."}], "images": []}, {"title": "Buffalo", "level": 4, "content": [{"type": "paragraph", "text": "Baby 5 and Buffalo are already well acquainted since childhood, as both were prominent child recruits who did not flee from the extreme regimen that scared off 100 others. The two enjoyed playing pranks on Corazon together."}, {"type": "paragraph", "text": "Baby 5 was partnered with Buffalo during the Punk Hazard Arc, and they demonstrated good teamwork. She also sought comfort from him when she got freaked out during Law's interrogation. However, he is still willing to selfishly take advantage of her helpful nature, asking her for a loan of 2,000,000 in order to spend the money at a casino, despite knowing that she already has a heavy debt to deal with. On Dressrosa, Baby 5 showed great concern for Buffalo when he was defeated by Kyros and thrown out the palace window by the former gladiator."}], "images": []}, {"title": "Lao G", "level": 4, "content": [{"type": "paragraph", "text": "Lao G is shown to have very little respect for Baby 5, getting annoyed by her naivete and only considering her a \"convenience\" due to her willingness to follow orders and throw her life away if commanded. When called \"convenient\" by Lao G, Baby 5 appeared to be deeply hurt by his words."}], "images": []}, {"title": "Donquixote Rosinante", "level": 4, "content": [{"type": "paragraph", "text": "Baby 5 and Buffalo enjoyed poking fun at Donquixote Rosinante, who they knew as the second Corazon and referred as \"Cora-san\", when they were young, setting up pranks that he would always fall for due to his clumsiness. In return, Rosinante put up a front of disliking children, becoming physically abusive in the hopes of driving them out of the crew without compromising his true intentions."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "Baby 5 and Law have been acquainted with one another since childhood, as Law was a fellow new recruit who journeyed to Spider Miles to join up with the Donquixote Pirates. The two initially didn't get along very well, with Baby 5 scolding Law for his boldness in threatening Corazon. Law, in turn, had a tendency to glare menacingly at her when annoyed and make her cry, sending the tearful Baby 5 scurrying to Buffalo for comfort. However, after learning of the Amber Lead Syndrome and Flevance's doom from Gladius, Lao G, and Senor Pink, Baby 5 became more sympathetic towards Law."}, {"type": "paragraph", "text": "She expressed worry over Law's fate when he was summoned by Doflamingo, as well as his advancing disease. At one point during the three year training period, she fought alongside Law whilst attempting to claim Wellington's bounty (albeit unsuccessfully). She, Law, and Buffalo would often socialize together when not on missions, as seen when the trio discussed their real names with each other. She felt comfortable enough to reveal her true name to Law, indicating a degree of trust. It is unknown how Baby 5 felt when she learned of Law's betrayal, but it can be assumed the news strongly affected her, judging by her emotional response during Law's interrogation. She also continued to be frightened of his glare as an adult, once again to the point of crying and clinging to Buffalo. However, after reforming they appear to have returned to friendlier terms having joined the same coalition of pirate crews."}], "images": []}, {"title": "Fiancés", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Baby 5 was proposed to by eight men, the last one being a sloppy-looking vagrant who she just met, giving her a simplistic flower as a present. Due to her knack of accepting every request ever made to her, Baby 5 believed that every proposal made was sincere and true love, causing Doflamingo to kill all eight proposers and their hometowns to protect Baby 5 from their true intentions. She became distraught at their deaths to the point of tearing up."}, {"type": "paragraph", "text": "When Trebol asked for her hand in marriage simply to poke fun at her, and then immediately retracted it for that reason, Baby 5 took the proposal seriously and had to be told off by Lao G and Giolla."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/21/Baby_5%27s_Eighth_Fianc%C3%A9.png/revision/latest/scale-to-width-down/200?cb=20140520024053", "caption": "Baby 5's eighth fiancé."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a member of a Shichibukai's crew, she has been shown to be a formidable fighter. She and Buffalo were already capable members of the crew as children, whereas as many as 100 recruits had left after two days from inability to keep up with the training regimen."}, {"type": "paragraph", "text": "She also appears to have a decent level of durability as shown when she was shot with a pistol, only to appear completely unharmed afterwards. She was durable enough to withstand the attacks from Franky Shogun and Nami's homing lightning bolt, taking only a short time to recover."}, {"type": "paragraph", "text": "She has the strength to carry several heavy weapons larger than herself as well as superior jumping abilities, as shown when she jumped off of Buffalo in midair to allow him to blow away the lethal gas weapon, landing safely on his back when he was done."}, {"type": "paragraph", "text": "She appears to be a decent cook, as her husband's favorite meal is a bento made from her."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Baby 5 ate the Buki Buki no Mi, a Paramecia-class Devil Fruit that allows her to change her entire body or parts of her body into any kind of weapon she likes. According to the fruit description, all of her body is made of weapons. She can transform parts of her body into either blades or firearms, or her entire body into a giant sword, missile or sickle for her partner Buffalo to wield or launch as appropriate."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Buffalo_Launches_Missile_Girl.png/revision/latest/scale-to-width-down/210?cb=20150530203907", "caption": "Baby 5 transforming into a missile and having Buffalo launch her."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Alongside the versatile range of weapons she can produce from her own body, in all of which she shows great proficiency, she carries on her back what appears to be a Gatling gun and a large flamethrower, as well as a sword strapped to her thigh. She showed great skills in using the Gatling gun, having aimed at the Franky Shogun from a distance, with the rounds causing quite some accumulative impact, despite the robot's durability blocking any damage. She bought these on a whim due to her personality flaw and the salesman's sweet talk, despite the fact that, as noted by Buffalo, she is a weapon herself and does not need them. While storming the Dressrosa palace, she was wielding a grenade launcher."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Baby 5 was born in Kuen Village where her family only saw her as a burden. Her mother abandoned her in the mountains, saying that she was useless. Since then, Baby 5 became obsessed with serving others, in order to feel being needed by others."}, {"type": "paragraph", "text": "When Baby 5 was eight years old, she was in Spider Miles, a port town in North Blue. She was already with the Donquixote Pirates when Trafalgar Law approached Doflamingo's crew with the resolution to kill as many people as he could in the three years he had left to live. She and Buffalo informed Trebol and Diamante that Corazon had returned. The children laughed at Corazon's clumsiness when he fell over upon entering the room and were struck by the officer in return. Baby 5 laughed again when he scalded his mouth after drinking hot tea that she offered him. She and Buffalo were shocked when Corazon threw Law out the window, thinking that the impact had killed him."}, {"type": "paragraph", "text": "A week after Law joined the crew, she and the rest of the crew discovered that Law is a survivor of Flevance, commonly known as \"The White City\", and that he was sick with the Amber Lead Syndrome. After Law declared that he would have his revenge on Corazon even after being informed of the crew's blood law, Baby 5 slapped him on the head and warned him of the consequences, which included torture. He merely glared at her, causing her to cry and leaving her defeated. Later on, while raiding with the to-be officers, Baby 5 learned about Law's hometown and his horrific past from Lao G, Gladius, and Senor Pink."}, {"type": "paragraph", "text": "When Law was brought before Doflamingo by Giolla and Machvise, Baby 5 thought that Law was going to receive punishment and started feeling bad for him. Instead, Doflamingo announced that he was going to make Law an official member of the crew. During the next two years, Baby 5 was shown participating in several activities with the crew, such as looting, making business deals, and collecting bounties; one such occasion was when she teamed up with Law to take down Wellington, but both had to be rescued by some of the executive officers. Eventually, she revealed her real name to Law and Buffalo and insisted that Law revealed his too. She also noticed that Law's Amber Lead Syndrome was starting to become more prominent through his body. After learning Law's real name and getting scolded for her insistence, she witnessed Corazon carrying a protesting Law away, thinking that the officer was going to pick on him."}, {"type": "paragraph", "text": "Baby 5 and Buffalo later witnessed Law tripping Corazon and making him fall into a garbage dump. Law asked Baby 5 for money so he could buy ice cream for Buffalo as a bribe to keep him quiet. The crew was later engaged in a battle with the Marines out at sea when Law and Corazon suddenly left."}, {"type": "paragraph", "text": "Six months after Corazon and Law left the crew, the Donquixote Pirates plotted to steal the Ope Ope no Mi from pirates who were going to sell it to the Marines. They later arrived at Minion Island and were informed by Vergo of Corazon's treachery."}, {"type": "paragraph", "text": "While Doflamingo covered part of the island in his birdcage, Baby 5 and Buffalo scouted the island from the sky. After Corazon's capture, Baby 5 and Buffalo informed Doflamingo that the Marines stationed at the island took custody of a boy. Thinking that the boy was Law, the Donquixote Pirates left Corazon for dead and prepared for departure. Before leaving the island, they found themselves under fire by Tsuru's squadron."}, {"type": "paragraph", "text": "Baby 5 participated in Doflamingo's takeover of Dressrosa. After Monet opened the gates to the royal palace, she and the Donquixote Pirates stormed the palace."}, {"type": "paragraph", "text": "In the past, she had eight fiancés. Doflamingo killed all of them and destroyed every city they lived in."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Donquixote_Pirates_16_Years_Ago.png/revision/latest/scale-to-width-down/210?cb=20150712150319", "caption": "Baby 5 eating dinner with the family."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "She was first seen on Dressrosa when Doflamingo was talking to Vergo. She was upset with Doflamingo and kept trying to kill him, calling her captain a \"lowlife bastard\" while Machvise tried to calm her down. She was stopped when Gladius shot her, and when she tried to shoot Doflamingo once more, he used his powers to turn her gun back at her own head. Doflamingo then sent her and Buffalo to Punk Hazard to retrieve Caesar Clown."}, {"type": "paragraph", "text": "Off the coast of Punk Hazard, Baby 5 and Buffalo were seen heading to the island. Baby 5 vowed that she would kill Joker for what he did to her fiancé once she returned to Dressrosa. She went on to say that that was the eighth time Doflamingo has killed the man she loved, destroying eight towns in the process. She wondered aloud why he wanted her to be miserable. Buffalo told her that it is Doflamingo's way of being protective, like a big brother. He went on to say that she needed to learn to say \"no\" more often. She then has a flashback to a sloppy-looking man giving her a flower, calling it love at first sight and asking her to marry him. Baby 5 told Buffalo that no one can say no to a marriage proposal. Buffalo then told her that she gets attached too easily, citing the fact that she subscribes to fifty different newspapers, is too quick to lend money, and is just as quick to spend it. He then asked her how much debt she was in, and Baby 5 responded that she only owes 98,000,000 and told Buffalo to drop the issue. Buffalo then asked if she could lend him 2,000,000, which made her think that he needed her, although he may have just wanted to make it an even 100,000,000. Buffalo told her that he wanted to go to the casino after they went back, and Baby 5 responded by saying that she would give him the money as soon as they finish the mission."}, {"type": "paragraph", "text": "As she said this, Punk Hazard appeared below them. Baby 5 wondered if the gas would go away if she fired one of her weapons. Buffalo responded by saying that he would take care of it. Baby 5 then jumped off of him, and he then he used his rotating abilities to act as a fan and dispel the gas. This uncovered the tanker ship, and the two decided to wait there for Monet, Caesar, and Vergo, when all of a sudden, the tanker exploded. At first, they thought it blew up, but then they realized something had hit it. They were even more surprised when that something turned out to be Caesar Clown."}, {"type": "paragraph", "text": "Buffalo called Doflamingo to report the incident, and Doflamingo, who was surprised at first, smiled and ordered Buffalo and Baby 5 to recover Caesar and return to Dressrosa immediately. Buffalo then wondered about Monet and Vergo, to which Baby 5 responded that Joker must have his reasons. While going to collect Caesar, Baby 5 saw someone on the deck of the tanker. Even though Buffalo thought that anyone surviving the gas was an impossibility, the person was revealed to be Franky using his Franky Shogun."}, {"type": "paragraph", "text": "Baby 5 and Buffalo engaged Franky in battle after he tried to shoot them down. Baby 5 mistook the Franky Shogun for a Pacifista at first but remembered that Caesar had no interest in human weapons. While fighting Franky, she used her Missile Girl technique and caused a huge explosion. She reformed and walked away, and asked how Franky liked the flames of her passion. However, Franky got back up unfazed and continued fighting her. After fighting Franky for a while, unable to cause him damage, Baby 5 transformed into a sickle, which Buffalo used to pierce Franky Shogun's left arm. Undeterred, Franky blew them away with General Cannon."}, {"type": "paragraph", "text": "Buffalo and Baby 5 managed to get back up, but upon seeing Law, the Marines, and the Straw Hat Pirates approaching, they decided to grab Caesar and run. As they fled through the sky, Nami struck them down with Lightning Breed Tempo and the pair was finished off by Usopp's Totsugeki Ryuseigun. Later, the three were briefly shown tied up before the Straw Hats, the G-5 Marines, and the former Punk Hazard soldiers started their party."}, {"type": "paragraph", "text": "After the Straw Hats, the G-5 Marines, and Law were done celebrating their success, Law decided to decapitate Buffalo and Baby 5. Both heads were put on a raft and sent towards the direction that Doflamingo was coming from. Once Doflamingo noticed them, Baby 5 confirmed that Law really did betray their crew, and expressed her disappointment at being unable to serve her captain when he needed her. Despite their failure, Doflamingo forgave them both, saying they were just following orders."}, {"type": "paragraph", "text": "She then listened to the conversation between Doflamingo and Law. When Law told Doflamingo to resign from his position as a Shichibukai, Baby 5 was shocked and told him that Doflamingo could never return to Dressrosa again. After the conversation ended, she seemed to fear Doflamingo's wrath over the negotiation."}, {"type": "paragraph", "text": "While the G-5 Marines and Caesar's former test subjects looked for their comrades who were petrified and left behind, some of the Marines came across the decapitated bodies of Baby 5 and Buffalo. While the baffled Marines pondered on what to do with them, their heads came flying down from the sky and attached themselves to the bodies. Doflamingo accompanied the two back to Punk Hazard, to look for Law and the Straw Hat Pirates. She left with Doflamingo and Buffalo after Kuzan's sudden appearance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Baby_5_Attacks_Doflamingo.png/revision/latest/scale-to-width-down/210?cb=20140610185329", "caption": "Baby 5 attacking Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bd/Baby_5_and_Buffalo_Are_Defeated_by_Nami.png/revision/latest/scale-to-width-down/210?cb=20140925233730", "caption": "Baby 5 and Buffalo are electrocuted by Nami's attack."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Doflamingo was unable to relocate Caesar himself, he supposedly decided to resign as a Shichibukai, causing pandemonium in Dressrosa and the world beyond. He then had Baby 5 call for Trebol, who made fun of Baby 5's fiancés before he jokingly asked her for her hand in marriage. Despite his rude intrusion into her personal space, she found his proposal irresistible, which led Lao G and Giolla to chastise her."}, {"type": "paragraph", "text": "Baby 5 later had a conversation with Gladius concerning Violet's betrayal."}, {"type": "paragraph", "text": "When she heard that some intruders, including Luffy, have breached the palace rampart tower, she was momentarily confused since Luffy was believed to be at the Corrida Colosseum as Lucy."}, {"type": "paragraph", "text": "She and Buffalo were later seen in the second floor suit room as Doflamingo interrogated Law about the Straw Hats' objectives. She slapped Law and demanded that he answer Doflamingo. Law gave her a glare and she started crying and seek comfort from Buffalo, mirroring what happened when they were children."}, {"type": "paragraph", "text": "When Sugar's curse broke, all the toys in Dressrosa transformed back into their original forms. As the Donquixote Family's hold on Dressrosa started to crumble, Baby 5 screamed in terror when Kyros appeared to have decapitated Doflamingo."}, {"type": "paragraph", "text": "As Kyros struck down Doflamingo's subordinates and defeated Buffalo, Baby 5 was unable to stop him. After Gladius and Pica arrived at the suit room, Baby 5 was shocked to see Doflamingo still alive."}, {"type": "paragraph", "text": "It was revealed that the Doflamingo that was decapitated was only a copy. When the real Doflamingo appeared and sliced the palace apart, Baby 5 watched his brief skirmish with Luffy and Kyros. After Pica threw Luffy, Law, Kyros, Viola, and Riku Doldo III out of the palace, Baby 5 stood next to Doflamingo while he initiated his Torikago."}, {"type": "paragraph", "text": "Sometime after Pica relocated the royal palace to the top of the Flower Hill, Doflamingo and some of his officers (including Baby 5) and lower-rank subordinates had a gathering to discuss plans concerning the Straw Hats and the Marines. When one of the grunts laughed at Pica's voice, Baby 5 shot him."}, {"type": "paragraph", "text": "She was later seen on the second level of the new King's Plateau, guarding the palace alongside Machvise, Gladius, Lao G, and Dellinger. When Dellinger wondered why Issho and his Marine platoon were not stopping Luffy and his allies from going up the new King's Plateau, Baby 5 looked through her binoculars and discovered that Sabo was standing in the Marines' way."}, {"type": "paragraph", "text": "After the colosseum fighters reached the second level, Baby 5 attacked Dagama with Revolver Leg."}, {"type": "paragraph", "text": "When the colosseum fighters banded together, Baby 5 came face to face with Sai. She transformed her right leg into a sword and kicked him, but Sai blocked her attack with his staff. As her battle with Sai continued, she was seen having transformed both her hands into sais."}, {"type": "paragraph", "text": "Having misunderstood Sai's words during their battle, Baby 5 thought that he was hitting on her, which she interpreted as being needed by him."}, {"type": "paragraph", "text": "Sai tried to make it clear that he had no intention of marrying his enemy. When Lao G's life force was leaving his body while he was being ignored by Chinjao, Baby 5 cried out to Lao G, prompting his life force to return back to his body. Still thinking that Sai needed her, Baby 5 tried to please Sai, but he rebuffed her advances and mockingly asked her to die."}, {"type": "paragraph", "text": "Baby 5 accepted his request literally and happily prepared to commit suicide. Sai, who meant only to taunt her, rushed to prevent her from killing herself. Infuriated that Sai was helping an enemy, Chinjao attempted to attack both Sai and Baby 5, but Sai kicked Chinjao and bent his prized head before slapping Baby 5 back to her senses. After Lao G knocked out Chinjao, Baby 5 was shocked to hear Lao G calling her \"convenient\" but overjoyed when Sai promised to marry her after defeating Lao G."}, {"type": "paragraph", "text": "While Sai was tending to Chinjao after Lao G's downfall, Baby 5 remarked that Sai had two ceremonies to prepare for, a wedding and a funeral, which irritated both Sai and Chinjao as the latter wasn't dead."}, {"type": "paragraph", "text": "After most of the Donquixote Pirates' officers were defeated, Pica preyed on the wounded, then later attempted to crush Baby 5 for betraying the crew, but Sai pushed Baby 5 out of the way and got crushed instead. Baby 5, Sai, and Chinjao then watched Pica head towards the Old King's Plateau. She then witnessed Pica's defeat at the hands of Zoro, and was awestruck by Zoro's feat of strength."}, {"type": "paragraph", "text": "Baby 5 is then seen watching as the Torikago starts to shrink. She then commented to Sai about the horror of the Birdcage."}, {"type": "paragraph", "text": "Since Baby 5 defected from the Donquixote Pirates prior to their downfall, she was not seen being arrested by the Marines after Doflamingo's defeat."}, {"type": "paragraph", "text": "Sometime after the Torikago game aftermath, Baby 5 was seen at the palace sleeping next to Sai."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. Baby 5 assisted the Straw Hats in escaping Dressrosa along with the Corrida Colosseum gladiators."}, {"type": "paragraph", "text": "She was later seen on the Yonta Maria with her fiancé, celebrating the birth of the Straw Hats Grand Fleet."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/31/Baby_5_Shoots_Dagama.png/revision/latest/scale-to-width-down/210?cb=20141225053440", "caption": "Baby 5 shoots Dagama."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Sai_vs_Baby_5.png/revision/latest/scale-to-width-down/200?cb=20141219044015", "caption": "Baby 5 fighting Sai."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/82/Corrida_Competitors_and_Baby_5_Post-Battle.png/revision/latest/scale-to-width-down/250?cb=20160425220708", "caption": "Baby 5 snuggles up beside Sai as everyone rests off their injuries from battle."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "After the Happo Navy returned to the Kano Country, Baby 5 was still clinging to Sai as he spoke to his former fiancee, Uhoricia. When Sai broke up his engagement to Uholisia and received a beating, Baby 5 sat next to Sai while crying for him. After Sai was covered in bandages, he and Baby 5 had their wedding ceremony."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Sai_and_Baby_5%27s_wedding.png/revision/latest/scale-to-width-down/200?cb=20171009200626", "caption": "Baby 5 and Sai's wedding."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Baby 5 and Trafalgar Law vs. Wellington", "elements": []}, {"text": "Baby 5 vs. Donquixote Doflamingo", "elements": []}, {"text": "Baby 5 and Buffalo vs. Franky", "elements": []}, {"text": "Baby 5, Buffalo, and Caesar Clown (while escaping from Punk Hazard) vs. Nami and Usopp", "elements": []}, {"text": "Donquixote Pirates vs. Corrida Colosseum gladiators", "elements": [{"text": "Baby 5 vs. Dagama", "elements": []}, {"text": "Baby 5 vs. Sai", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Baby 5 vs. Kyros", "elements": []}, {"text": "Baby 5 vs. Chinjao and Orlumbus", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Baby 5's favorite food is baby castella.", "elements": []}]}], "images": []}]}