{"sections": [{"title": "Humans", "level": 1, "content": [{"type": "paragraph", "text": "Human beings are the dominant race in the world, as they outnumber most other races, and are usually among the most technologically advanced and organized of the races. Most islands are inhabited by humans, even in the Grand Line, where most of the stronger races such as the fish-men and giants are found."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Humans come in a range of sizes, ranging from \"normal\" to much taller (such as Jerry). Some, such as Gecko Moria and Charlotte Linlin, are extremely large for human standards; Linlin is 880 cm (28'10\") tall, far surpassing an average human's height by roughly six times. However, these humans remain small compared to giants, who have a minimum height of 12 meters (around 40 feet). These large humans are roughly the same size as Wotans. Some humans have features that are unique, such as Usopp's long nose, which led to people mistaking him for a fish-man in Cocoyasi Village."}, {"type": "paragraph", "text": "Further physical differences between humans vary greatly; islands not allied with the World Government form a number of tribes including (but not exclusive to) the dwarves, Mink Tribe, Longarm Tribe, Longleg Tribe, and Snakeneck Tribe. Some humans have an ape-like appearance such as Masira, Shoujou, the Utan Divers, Hamburg and the Coffee Monkeys; Masira claimed openly to be human and not ape, although he was not insulted when called a \"monkey\". Humans with demonic features have also appeared in the storyline (mainly in the Impel Down Arc) and have traits such as pointed ears, sharp teeth and intimidating facial features; Gecko Moria is notably demonic in appearance, having white skin, pointed ears and even small horns on his forehead. A few humans have even been seen with goat or sheep-like horns growing on their heads, such as Merry and Caesar Clown. Even amongst families, size and proportional differences may occur, the most prominent example being the Gorgon Sisters. Some humans can be born with abnormally long skulls, as shown by the likes of Strawberry and Chinjao, with the top of their heads being quite tall, however it appears this trait is not hereditary as Chinjao's own grandchildren lack this feature."}], "images": []}, {"title": "Biology", "level": 2, "content": [{"type": "paragraph", "text": "\"Normal\" overall lack any distinction from the various races of tribes in their world. However, humans, fish-men, and merfolk also share the same blood types and can have transfusions, provided that the blood type matches."}, {"type": "paragraph", "text": "Humans can often vary in size. Boa Sandersonia and Marigold were normal-sized humans when young, but currently stand noticeably above the size of normal humans, while their oldest sister, once only a little shorter than them, remained normal, if above-average, human size. Amongst the Kuja in particular, there is a notable phenomenon that every child born is female and no males are ever produced, although whether this is due to biology or gender specific culling is unknown. The alterations of other tribes' biology like this have yet to be explained."}, {"type": "paragraph", "text": "Human children may also drastically differ in size from their parents. One such example is Charlotte Linlin, who stood three times the height of her normal-sized parents at just five years old. This also works the other way around, as many of Linlin's own children, including Lola and Chiffon, who are born to Pound, an abnormally large man, only grew to average size as adults. "}], "images": []}, {"title": "Hybrids", "level": 3, "content": [{"type": "paragraph", "text": "Generally, humans can breed with other races seen in the One Piece world, like merfolk, fish-men, longlegs, three eyed, longarms, and snakenecks, with the offspring inheriting its non human parent features (merfolk's tail, fish-men's appearance, longleg's legs, etc.)"}, {"type": "list", "elements": [{"text": "A Human-Fish-Man hybrid, such as Sapi and Dellinger.", "elements": []}, {"text": "A Human-Merfolk hybrid, such as Charlotte Praline.", "elements": []}, {"text": "A Human-Snakeneck hybrid, such as Charlotte Mascarpone and Charlotte Joscarpone.", "elements": []}, {"text": "A Human-Longarm hybrid, such as Charlotte Myukuru and Charlotte Mobile.", "elements": []}, {"text": "A Human-Longleg hybrid, such as Charlotte Smoothie.", "elements": []}, {"text": "A Human-Three Eye hybrid, such as Charlotte Pudding. The hybrid won't necessarily have the Three Eye Tribe's ability to hear the Voice of All Things as it may not manifest in such a person.", "elements": []}, {"text": "A Human-Dwarf Hybrid, such as Charlotte Normande.", "elements": []}]}, {"type": "paragraph", "text": "Some traits are retained even after continuous breeding with normal humans, such as Chimney's swimming abilities though she is one quarter mermaid. However, she displays no other mermaid traits."}], "images": []}, {"title": "Inter-species Relationships", "level": 2, "content": [{"type": "paragraph", "text": "The apparent weakness of the humans in the One Piece world often makes other races, such as the fish-men, think poorly of them. This can result in heavy amounts of racism towards humans, although not all fish-men share this belief. Often, this is met by humans with returned racism towards the fish-men, sometimes leading to bloodshed. As a result of a long history of bad inter-species relations, humans tend to think of fish-men and mermen as nothing more than fish, and ignoring any chance of them being viewed as equals with humans. Fish-men children have been seen to view humans as \"scary\", and in one case an adult fish-man attempted to blame their vast numbers as a reason for their species ruling the world."}, {"type": "paragraph", "text": "There is an apparent problem with the non-World Government allied tribes. Their freakish appearances (such as having long arms or legs) are often a lure for kidnapping crews (who are usually humans) at Sabaody Archipelago, who sell them as slaves because their prices are much higher than a regular human. The tribes and races caught up in the slave trade are often sold for a higher price than \"normal\" humans. Humans themselves are worth an average of 500,000 in the slave market. Members of these subdivision tribes may also face discrimination and racism from humans in general, such as members of the Three-Eye Tribe, who's signature third eye tends to be considered \"ugly\" by the average human. Conversely though, members of these tribes may even regard \"normal\" humans as freaks due to the fact that where they come from, their own appearances are normal and that of \"normal\" humans is not."}, {"type": "paragraph", "text": "The dwarves of Tontatta Kingdom are widely regarded by the citizens of Dressrosa to be 'fairies', and no real attention is paid to them. In the past, they were enslaved by the king of Dressrosa, but when that king left, the new ruler allowed the dwarves freedom and helped the people believe that they were only a myth (although the citizens actually knew and simply feigned ignorance out of respect for the dwarves). However, when Donquixote Doflamingo took control, he enslaved the dwarves again."}, {"type": "paragraph", "text": "Despite the issues of racism between humans and the various tribes, there are parts of the world where they coexist peacefully. Several fish-man-human hybrids are known to exist (such as Dellinger or Sapi), and the unique features of the various tribes are not regarded as \"freakish\" by all humans. Sanji, a human, considered the third eye of Charlotte Pudding to be \"beautiful\"."}, {"type": "paragraph", "text": "Even among regular humans, they have various tribes that have differing views on the rest of humanity, either due to isolationism or personal habits. The Kumate Tribe were known to commit cannibalism to outsiders, leading them to antagonistic actions against their fellow humans. The all-women Kuja mostly never saw a man, leading to curiosity and distrust."}, {"type": "paragraph", "text": "There are certain humans who also have unnatural appearance, either due to birth, modifications or transformations. While some (such as Merry and Magellan) are minor and do not incite much reaction from others, some have very noticeable abnormalities that cause various reactions from many others, whether humans or other races. Franky's modifications brought much curiosity and admiration from children, though several adults would consider his appearance to be eccentric to the point of perversion. Brook's current form as a skeleton made many mistook him as a different life-form, leading to either fear, curiosity, amusement, and popularity. Charlotte Katakuri was born with an abnormal mouth that made those who saw it compare him to a pelican eel, leading them (even his family) to insult and make fun of him; Monkey D. Luffy was perhaps the first person to have not discriminated him on sight."}, {"type": "paragraph", "text": "World Nobles are no different from any normal humans. However, in their delusive arrogance of global diplomatic immunity and their esteemed heritage of being the descendants of the twenty kings who founded the World Government, they see themselves as above humans, believing themselves as gods. They are so detached from humanity that they wear special helmets to prevent themselves from breathing the same air as humans. The Donquixote Family, who forfeited their World Noble statuses, were condemned as traitors to their blood and derogatorily regarded by the other World Nobles as humans; Homing believed himself as one, which was the reason he brought his family away from Mary Geoise to embrace their humanities. Even so, his elder son Doflamingo believes to this day that he is above humanity, deriding his father's ideals of living as normal humans. The other World Nobles never accepted the Donquixote Family again for fraternizing with humans, stating that the sacred status they abandoned cannot be regained. Because of their attitude, World Nobles see not just humans, but all races, as nothing more than inferior beings compared to themselves, a reason for the business boom in slave trades."}], "images": []}, {"title": "Overall Strength", "level": 2, "content": [{"type": "paragraph", "text": "Most of the inhabitants of the One Piece world are normal humans, and are one of the weakest races on the planet. While the average human is as weak as in real life, with enough training, they are able to become Superhumans- normal humans with high levels of physical strength. They can also train to gain incredible abilities. Some humans like Koala have demonstrated that humans can learn Fish-Man Karate, despite not being Fish-Men themselves. Many humans have developed a variety of martial arts styles to defend themselves with such as Black Leg Style & Hasshoken. Additionally humans often wield swords and other weapons to compensate. Several human swordsmen are shown to be extremely powerful individuals such as Zoro, Shanks, Kyros, Ryuma (when he was alive), and world's strongest swordsman Dracule Mihawk. In addition, normal humans are more likely to consider eating Devil Fruits to compensate for their lower physical abilities."}, {"type": "paragraph", "text": "There is also a Zoan Devil Fruit called Hito Hito no Mi which grants any animal that eats it human abilities such as intelligence, speech, and the ability to take a human hybrid form and full human form, as seen with its current user the Drum Island reindeer, Tony Tony Chopper. Using his human intelligence the fruit granted him, Tony Tony Chopper developed the Rumble Ball to grant him further transformations."}, {"type": "paragraph", "text": "Humans are also known for their intelligence and as a result can compensate for their lower physical abilities by out witting their opponents or use their intelligence to figure out how use their opponents' weaknesses/strengths against them. Several humans are geniuses in science and engineering, allowing them to develop unique powerful weapons & gadgets, or use their knowledge of various sciences (from biology to meteorology) offensively. Some humans like Vegapunk and Franky have demonstrated the ability to convert humans (and animals in Vegapunk's case) into Cyborgs, to further increase their abilities or repair damage to their physical bodies (like in Franky's case). Vegapunk's research in devil fruits discovered exactly how Devil Fruit powers are transferred over to a user, allowing him to develop Artificial Devil Fruits and figure out a method to feed devil fruits to inanimate objects, such as swords and guns. Several humans are shown to be geniuses when it comes to particular fields or expertise, even the human hating Arlong considered Nami's skills as a cartographer on par with the fish-men \"superiority\" since they were superior to any fish-men's."}, {"type": "paragraph", "text": "Additionally by using knowledge of Lineage Factor, humans can be altered genetically to increase their capabilities as shown by Vinsmoke Judge's experiments on his children."}, {"type": "paragraph", "text": "Some humans are even more than twice the size of a normal human being. Naturally, even with no training, these tall humans are among the strongest in the world. The greatest example is Charlotte Linlin, who was not only abnormally large even as a child, but possess strength that is far superior to giants. However, compared with true giants, there can still be a massive difference between strength. When the Kairiki Destroyers of the Franky Family (enormous by human standards) face off against the giants Oimo and Kashi, they were completely outmatched. Compared to this, Whitebeard, roughly three times the size of a normal human, blocked an attack from John Giant with little effort."}, {"type": "paragraph", "text": "While the normal human is physically much weaker than races like giants and fish-men, their wide range of attacks, skills, and abilities allow them to become versatile fighters. Even with the physical strength of other races taken into account, there are a handful of humans that can become strong, whether through physical prowess or tactical thinking. Arlong blamed the fact they had numbers as a reason for them ruling over Fish-Men, who are noted to be physically stronger overall than humans, as he believed that humans were the weakest species overall. However some extremely strong humans like Zoro and Kyros are shown to be strong and skilled enough to defeat a fish-man underwater, a place where normally fish-men have an advantage over humans."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the world, humans can live up to at least 141 years old, such as Kureha is, though her case was more likely due to her medical expertise to maintain such good health.", "elements": []}, {"text": "Tony Tony Chopper classifies himself as a \"man\" because of his Devil Fruit abilities from the Hito Hito no Mi, although he is a reindeer by species.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 501 and Episode 395, New tribes revealed by auction house price list.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 88.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 8 Chapter 70 (p. 11-12) and Episode 31.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 65 Chapter 644 (p. 4-5) and Episode 564, Hody and his future officers are taught by Arlong to hate humans.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 86 Chapter 862, Pudding notes that no human has ever been nice about her third eye before.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 76 Chapter 763 (p. 2-9) and Episode 702, Doflamingo had a nightmare of his past.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 625 and Episode 545, Mjosgard sees himself above all the fish-men and merfolk, even in their home kingdom.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 56 (p. 66), Oda confirms that Kureha is still alive at age 141.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 47 (p. 66), Oda confirms that Chopper inherited human traits from his fruit, but remains a reindeer.", "elements": []}]}], "images": []}]}