{"sections": [{"title": "Kuina", "level": 1, "content": [{"type": "paragraph", "text": "Kuina was the late childhood friend and rival of Zoro. She was the daughter of Koushirou and was the reason why Zoro developed the Santoryu technique."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "She had short, dark blue hair and dark brown eyes. She wore a white sleeveless shirt and green pants."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When first introduced (in a flashback), she was cocky and confident in her ability as a swordsman. However, she was always living with the knowledge that since she was a woman, it would only get harder as she got older for her to compete with men and had been informed by her father of her future woes. She covered her hesitation and fear with cockiness and acted confident instead of fearful and weak, trying to prove to her father that she could become the world's greatest swordsman. Her gender would force her to give up the swordsman's life as she grew, and she would not be allowed to inherit her father's dojo. When she reached puberty, her fears intensified. Eventually, Zoro made her believe that it's willpower and skill, not strength, that makes one a swordsman."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Kuina was the strongest among her fellow trainees in her father's dojo, being able to overpower even the adults despite her young age. She was also capable of overpowering the young Zoro, who even then was capable of lifting boulders bigger than him for training."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Kuina was a formidable child prodigy in swordsmanship, being the best student of the Isshin Dojo, despite her young age. She could overpower even adults in a sword fight. With a single sword she could defeat the young Zoro 2001 consecutive times without ever losing to him."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Eleven years before the current storyline, she was seen briefly, training outside her father's dojo, attacking a pole with her sword."}, {"type": "paragraph", "text": "Zoro fought Kuina regularly, but found that after 2000 fights he could never beat her. Zoro challenged her into fighting with real swords, in which she used her family's Meito Wado Ichimonji."}, {"type": "paragraph", "text": "Kuina had come to the conclusion that Zoro would soon pass her in skill and strength. This is because she believed that boys grow up to be stronger than girls, and she noticed just how much Zoro had already caught up to her current skills. So, when she started growing breasts, she became discouraged. Zoro then told her that if he ever beat her, it was because of his skills. The fact that he was a boy and she was a girl did not matter. It was his goal to be as good as her. They promised that one of them would become the greatest swordsman in the world."}, {"type": "paragraph", "text": "However, the day after making their vow, Zoro learned she had fallen down the stairs and died. Zoro was angry with her, accusing her of running away from their promise. Finally, Zoro asked her father for the honor of taking the Wado Ichimonji with him. With this, Zoro promised to fulfill their shared dream of becoming the greatest swordsman to fruition."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Zoro_and_Kuina%27s_Promise.png/revision/latest/scale-to-width-down/210?cb=20130210001900", "caption": "Zoro and Kuina making their promise to become the world's greatest swordsmen."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d5/Kuina_When_She_Died.png/revision/latest/scale-to-width-down/200?cb=20190504155417", "caption": "Kuina's body after her death."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kuina vs. Zoro (2001 times)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime expansion of the flashback, when Zoro was young, he challenged every dojo he came across and claimed their signs (in Japan, the sign signifies the dojo is to be respected). When he came across Kuina and her family's dojo, he finally met his match."}, {"type": "paragraph", "text": "In the anime, her progress against adults and other students is shown more. It is also stated by her father that she began to surpass her status as a female because of Zoro's rivalry with her, although no such statement was made in the manga. In the manga, her dead body was seen with the face covered by a cloth, but in the anime a proper funeral was seen being held during Zoro's flashback. Although in an episode later the scene with her dead body is seen."}, {"type": "paragraph", "text": "Kuina's grave is not seen in the manga until Chapter 617's cover. However, at the end of the flashback in the anime, Zoro is seen praying in front of it before leaving on his journey. It should be noted that the two gravestones are different, since Oda only showed it much later."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/46/Kuina%27s_Grave.png/revision/latest/scale-to-width-down/200?cb=20110309225351", "caption": "Kuina's grave in the manga."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids dub, because 4Kids cannot allow deaths, she was said to have been injured by the friends of a man she defeated, and could never fight again. However, despite this change of storyline by 4Kids, many media based sources, such as One Piece: Grand Adventure, still referenced the fact that she died in the original storyline."}, {"type": "paragraph", "text": "Another dub error was the flashback Zoro had where Kuina said \"You're weak Zoro, nothing ever changes\". 4kids changed this to \"You've got to try harder\", making a big mood change for Kuina in the anime."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "She was issued alongside Zoro in a One Piece Block Figures set featuring the Straw Hats and their past mentors/loved ones."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She is a playable character in the U.S. and Australian-only video game, One Piece: Grand Adventure. Her appearance in the game is said to be an illusion that Zoro (and later Tashigi in Smoker's storyline) experiences during Luffy's story.", "elements": []}, {"text": "Speculations have been around for a very long time within the fandom based on her appearance matching Tashigi, but this was proven false when Tashigi was drawn as a child in SBS Volume 68.", "elements": []}, {"text": "Kuina and Tashigi are both voiced by Monica Rial in the FUNimation dub.", "elements": []}, {"text": "Like Tashigi, her name comes from a flightless bird. The fact she is named after a flightless bird is a reflection of herself. In regards to the bird itself, Oda stated: \"though a bird cannot fly, it does not mean it never will\".", "elements": []}, {"text": "Given she was born two years after Roger's death (as of Chapter 0), that would have made her one year older than Zoro when she was alive.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 5 and Episode 2, Kuina is introduced.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Kuina's information is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 0 Chapter 0 (p. 19) and Episode 0, Kuina's parents talk about her shortly after her birth.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 81.", "elements": []}, {"text": "↑  One Piece Anime — Episode 2, Zoro's challenge against Kuina is expanded in the anime.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 16, The source of Kuina's name is given.", "elements": []}]}], "images": []}]}