{"sections": [{"title": "Krieg", "level": 1, "content": [{"type": "paragraph", "text": "Don Krieg is the admiral of the Krieg Pirates and an infamous pirate of East Blue. Because of his underhanded methods and domination over a fleet of 50 pirate ships, he is infamously known as Foul-Play Krieg and Pirate Fleet Admiral. Due to his actions and role, he is the primary antagonist of the Baratie Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Krieg is a tall, muscular man, with short cut purple-gray hair and long sideburns (though his wanted poster indicates his hair was once long and wild). During his appearance in the storyline, his head was wrapped in gauze (due to injuries from his encounter with Dracule Mihawk). His attire features many fur-lined elements."}, {"type": "paragraph", "text": "The most notable aspect of Krieg's appearance is his golden wootz steel armor, which is fur-lined like the rest of his attire. Consisting of a chest plate, shoulder guards, and elbow guards, it is Krieg's main offense and defense against his foes. It is loaded with a variety of weapons. His Jolly Roger is painted on the shoulder guards. Under those, he has a brown shirt, and his hands are covered by a pair of fur-lined gloves. He has a golden gas mask somewhere inside the armor, to prevent his deadly MH5 gas from affecting him."}, {"type": "paragraph", "text": "On casual occasions, his armor and mass is hidden behind regal attire consisting of a fur-lined coat (which seems to become his cape when he reveals his armor) over a yellow vest with black spots-like motifs. Around his thick neck there is a big golden chain. He retains his pants and shoes even after taking off his clothes for battle, due to his armor not covering anything below the waist."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Krieg showcases the typical attributes of a tyrannical leader, displaying cruel and oppressive tendencies using a huge arsenal of weapons and overwhelming odds. He is incapable of any sense of honor nor can he be sympathetic for anyone."}, {"type": "paragraph", "text": "Krieg is characterized by cruelty, dishonesty and arrogance. He is confident in his own superiority, despite any failures he might experience, and believes wholeheartedly that his armada and arsenal of weapons can overcome any foe. Even in the face of his obvious inferiority, Krieg refused to accept or learn from his mistake, instead turning to underhanded methods to get by and believing that there was some sort of trick to overcoming such foes. Witnessing Dracule Mihawk's devastatingly powerful swordsmanship, Krieg accused him of simply having a Devil Fruit power."}, {"type": "paragraph", "text": "However, his constant victories and reliance on weapons and odds made him overconfident. His superiority complex makes it very easy for him to lose his temper if his orders are not fulfilled, usually taking it out on his subordinates. This led to his failed attempt to conquer the Grand Line, believing his reputation built on sheer numbers and military weapons were enough to get him by; he suffered an utter defeat when Mihawk almost completely annihilated his entire fleet."}, {"type": "paragraph", "text": "Krieg lives up to his nickname, \"Foul Play\", as he believes in winning above all else, and will stoop to any level to achieve it. Examples include flying a white flag of surrender and posing as Marines to get the drop on them. Due to his philosophies, he considers concepts like pride and sympathy to be pathetic, and will go to any lengths to win, resulting in his willingness of killing subordinates who fall in line with such emotions, disregarding their loyalty and strength. He has no attachments to either his crew or his ships, easily preparing to rebuild his fleet with the various pirate crews scattered in East Blue instead of mourning the loss of his previous one, and plotting to sink his own flagship to get a new one due to the damage it has incurred. His lack of morale led him to ungratefully assault the Baratie when they gave food to him and his starving crew, intending to take over their ship and kill all the chefs who remained. Intolerant of failure and loss, Krieg lost all hold on his composure when Luffy defeated him, and stood up demanding a rematch despite his critical injuries."}, {"type": "paragraph", "text": "Krieg keeps his crew together principally using fear. Despite how mad and ridiculous some of his orders may seem, his crew will follow them out of fear of death, which is another factor that limits their strength. Overall, he rules his crew with draconian might and expects utter obedience for his overbearing demands. However, some members like Gin have genuine respect for Krieg, while Pearl shares the same beliefs of skullduggery is the key to victory and survival."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b3/Krieg_Angry.png/revision/latest/scale-to-width-down/210?cb=20130120104909", "caption": "Krieg when angered."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Despite his cruel tendencies, Krieg is pragmatic enough to realize that he needs a crew to support him. He thus made sure they are fed to regain their full strength after Mihawk's onslaught. However, Krieg does not care for his crew and rules over them with fear and any who opposes him is typically punished with death. He is very proud of his rank as captain, and gets very mad when someone disobeys him, or even hesitates to carry out his orders, as he believes it is their duty to obey him unquestionably. During the attack on the Baratie, Krieg expressed his desire to conquer the Baratie and go back to the Grand Line. This shocked the crew because they were feeling gratitude towards the chefs and did not want to go back to that pirate graveyard, but they complied out of fear of their captain and that one member was shot for voicing his opinion."}], "images": []}, {"title": "Gin", "level": 4, "content": [{"type": "paragraph", "text": "Gin is fiercely loyal to Krieg, carrying out whatever orders he may be given from him no matter how inhumanly brutal or ruthless without protest or hesitation, thus earning himself the alias of \"Gin the Demon Man\". This is partly due to a great fear of Krieg, which is evidenced when he obeyed his orders to throw away his gas mask and breathe the deadly MH5 poison gas because he feared Krieg's wrath for disobeying more than death itself. After Krieg was defeated by Luffy, the Pirate Admiral went into an insane rampage, refusing to acknowledge defeat, but Gin punched him in the stomach, knocking the man out, stating that they must admit defeat and start over. He then carried away Krieg and the crew in a small boat given by Baratie."}], "images": []}, {"title": "Pearl", "level": 4, "content": [{"type": "paragraph", "text": "Pearl, despite his overconfidence in his own so-called unbreakable defense, also acknowledged his captain, but unlike Gin, Pearl does not have a sense of honor, instead falling in the lines of Krieg's ideology of foul play being essential in victory and survival."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Dracule Mihawk", "level": 4, "content": [{"type": "paragraph", "text": "Mihawk also became an enemy of Krieg, destroying Krieg's entire fleet when he attempted to conquer the Grand Line. However, Mihawk claims he only attacked the crew to kill time and did not consider Krieg a threat. Upon sighting Mihawk, Krieg's anger led him to attack Mihawk, despite having witnessed Zoro's defeat and his own ship having been sliced apart. Mihawk did not even bother to retaliate, instead merely slashing Krieg's ship again and departing during the distraction."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "As a famous pirate with a bounty on his head, Krieg is an enemy of the marines. In the past, he also killed a marine captain and took over his ship to start his pirate career."}], "images": []}, {"title": "Baratie", "level": 4, "content": [{"type": "paragraph", "text": "Krieg saw the value of stealing the harmless looking restaurant as a ploy for his pirate crew. However, at first, Krieg lied by telling that he only wanted food for him and his men. When Krieg recovered his strength, he revealed his intentions to steal the Baratie for his new flagship, rebuild his armada with other pirate crews found littered within the sea, and then return to the Grand Line with Zeff's logbook as a guide. The chefs fought against the revived Krieg’s crew to maintain their restaurant."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Krieg became an enemy of Monkey D. Luffy for his desire to take the Baratie as well as his ambition to become the pirate king. Krieg was blinded by his arrogance and Luffy and his crew's seemingly harmless looks, and mocked Luffy for his statements. After witnessing the \"Pirate Hunter\" Zoro and Luffy's Devil Fruit powers, Krieg came to believe that Luffy will just be another pirate in the Grand Line, as the place is filled with ability users like him, and tried to take full advantage of Luffy's weakness of the ocean during their battle. After a long battle, Luffy manages to defeat Krieg, but even after the battle is over, Krieg unconsciously gets up and demands to continue the battle, only to be knocked down by Gin."}, {"type": "paragraph", "text": "Also despite the fact that Sanji (who was not part of the crew at the time) was willing to help Krieg and his hungry men, when he regained his strength, Krieg immediately attacked him. He also ordered Gin to kill him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Krieg was considered (in military strength) the most powerful pirate in the East Blue and had a terrible reputation. Although Krieg had a lower bounty than Arlong (especially with the fish-man bribing the Marines to keep it low), his fleet of 50 ships and over 5,000 pirates, combined with active pillaging, forced the Marines to view Krieg as a greater threat. Despite this, however, it was commented by Luffy that Krieg's fleet was not all that powerful, they were just using sheer numbers alone to overwhelm their opponents."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Krieg also claimed to be the strongest man in the world and, while this is clearly a vast overestimation on his part, he is certainly formidable in physical combat, possessing massive physical strength. He could break Gin's arm with a grip and could defend against cannonballs without moving an inch, and easily lifted and threw the Sabagashira No. 1 a massive boat through far distances into the Baratie restaurant with a single hand. He can also lift the one-ton Great Battle Spear single-handedly and swing it around freely while wearing his golden wootz armor."}], "images": []}, {"title": "Master Strategist", "level": 3, "content": [{"type": "paragraph", "text": "Krieg is also a sound tactician and expert strategist, realizing the material value of his subordinates and requiring them to be at perfect health, as well as using decoys and disguises to avoid unnecessary battles (such as disguising his flagship as a Marine vessel to enter village harbors easily, or dressing up his first-mate as himself to distract pursuers). His dishonest and unethical behavior, despite showing his lack of honesty, is a testament of his strategic aptitude. His plans to steal Baratie as a suitable replacement for his damaged ship due to its ridiculous and nonthreatening appearance would proved crucial for his future pirate ambitions. He also has knowledge of Devil Fruits, as shown when he witnessed Luffy's ability to stretch and planned to throw him into the water in order to disable him, noting that the Grand Line is supposed to be filled with such people. However, Krieg's most potent weapon has always been his talent for skulduggery, which seemed to know no bounds. He lies and pretends to beg for mercy, and then strikes when the opponents lower their guards. His methods have earned him the nickname \"Foul Play\"."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Befitting his moniker \"Foul Play\", Krieg's fighting style revolves around hidden firearms and incendiary devices built-in to his wootz steel armor, which itself is hidden underneath normal clothes, to provide a surprise and unseen defense until after a strike has been made. Krieg relies on using surprise and large numbers of rapid and high firepower attacks to overwhelm his adversaries. When Carne explained Krieg's reputation and initation in piracy he was depicted using a sword."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Krieg%27s_Arsenal.png/revision/latest/scale-to-width-down/210?cb=20130215202852", "caption": "Krieg unveiling his Gun Array from his Wootz Steel Armor."}]}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Wootz-Ko no Yoroi (ウーツ鋼の鎧, Ūtsu-Kō no Yoroi, literally meaning \"Wootz Steel Armor\"): Krieg's supposedly invincible armor. He could use his shoulderplates to augment his already powerful punches, and it has many weapons and defenses built into it. It should be noted that the armor does not protect his face, his head, or anything below his waist from attack. However, he makes up for this by his quick reflexes to guard these areas, as demonstrated when he protected his face with his arms from Patty's Meatball of Doom. It was ultimately shattered when Luffy bombarded it with multiple Gomu Gomu no Bazooka attacks.", "elements": []}]}, {"type": "list", "elements": [{"text": "Dia no Kobushi (ダイヤの拳, Daiya no Kobushi, literally meaning \"Diamond Fists\"): Diamond embedded gauntlets hidden by his gloves (similar to brass knuckles), to enhance his physical strikes to the point of supposedly being able to shatter anything.", "elements": []}]}, {"type": "list", "elements": [{"text": "Dangan (弾丸, Dangan, literally meaning \"Gun Array\"): Krieg flips open the mantles on his armor to reveal 10 gun barrels, then takes out two dual-pistols and proceeds to pump the enemy's body full of lead. His large ammo supply and rapid firing rate enable Krieg to fire about 14 rounds a second. In One Piece: Pirate Warriors 3, his known technique with this is Full Burst where he sprays a number of bullets forward onto enemies.", "elements": []}]}, {"type": "list", "elements": [{"text": "Morning Star (モーニングスター, Mōningu Sutā): An enormous spiked ball on a chain that Krieg swings at people.", "elements": []}]}, {"type": "list", "elements": [{"text": "Sakuretsu Shuriken (炸裂手裏剣, Sakuretsu Shuriken, literally meaning \"Shuriken Bomb\"): A fake version of the MH5, Krieg fires from his shoulderplates. This detonates and sends shuriken in every direction, slicing the opponent. This attack was not seen in the anime.", "elements": []}]}, {"type": "list", "elements": [{"text": "Bakudan (爆弾, Bakudan, literally meaning \"Bombs\"): Tiny bombs that explode on contact with anything (even water). Despite being strong enough alone, they are usually thrown en mass.", "elements": []}]}, {"type": "list", "elements": [{"text": "Needle Machine Gun (ニードルマシンガン, Nīdoru Mashingan): Stakes that Krieg fires out of his shoulder-plates in a machine gun-like fashion, capable of skewering wood and flesh; they were very effective against Luffy's rubber-body, which would have deflected normal bullets. In the 4Kids dub, these were replaced with Poison Suction Cup Darts in a poor attempt to detract from the violence, but when they are fired, they are still seen as stakes. In the American version of Grand Battle Rush!, they are still seen as stakes, but are referred to in the move list as \"nails\" (however, Luffy refers to them as spears in Story Mode).", "elements": []}]}, {"type": "list", "elements": [{"text": "Modoku Gas Dan MH5 (猛毒ガス弾 M・H・5, Mōdoku Gasu Dan MH5, literally meaning \"Deadly Poison Gas Bomb: MH5\"): A bomb containing an extremely potent deadly poison gas fired from Krieg's shoulder-plates. It creates a very large cloud of poison upon impact, and the gas is usually fatal to those without a gas mask. Krieg claims that he could destroy an entire village with one bomb, and uses it sparingly. Krieg holds a gas mask to prevent himself from succumbing to the poison, and all members of the fleet also carry one each for the same reason.", "elements": []}]}, {"type": "list", "elements": [{"text": "Kenzan Mantle (剣山マント, Kenzan Manto, literally meaning \"Sword Mountain Mantle\"): A cape with spikes on one side, used to psychologically prevent his opponents from using melee attacks; the cape is folded under his left shoulder plate when not in use. In the Viz Manga and 4Kids and FUNimation dubs, this is called the Porcupine Cape.", "elements": []}]}, {"type": "list", "elements": [{"text": "Daisenso (大戦槍, Daisensō, literally meaning \"Great Battle Spear\"): A spear formed when Krieg puts his shoulder plates together that explodes when it hits an opponent. It is supposed to weigh 1 ton, and the more force that is put in the swing, the bigger the explosion. The spear will still explode on impact even if its tip is broken off making it a giant \"bomb on a stick\" when Luffy broke the tip. This is considered to be Krieg's most powerful weapon.", "elements": []}]}, {"type": "list", "elements": [{"text": "Kaen Hosha (火炎放射, Kaen Hōsha, literally meaning \"Flamethrower\"): A wrist-mounted flamethrower, it is capable of burning a mast to cinders instantly.", "elements": []}]}, {"type": "list", "elements": [{"text": "Tetsu no Ami (鉄の網, Tetsu no Ami, literally meaning \"Iron Net\"): An iron net shot from Krieg's wrist. When bound, the opponent can be thrown into the ocean and be left to drown as the iron net drags the opponent down.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Mighty_Battle_Spear.png/revision/latest/scale-to-width-down/180?cb=20140119043332", "caption": "Krieg's signature weapon, the Daisenso."}]}, {"title": "Video Game Only Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Krieg Kantai Delta Explosion (クリーク艦隊・デルタエクスプロージョン, Kurīku Kantai Deruta Ekusupurōjon, literally meaning \"Krieg Fleet Delta Explosion\"): Working in tandem with Gin and Pearl, the three charge an opponent simultaneously. Gin strikes with his tonfa, Krieg with his Daisenso, and Pearl with one of his handheld shields. This attack can focus on a single enemy or damage multiple enemies at once. The technique appears in One Piece Treasure Cruise.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Beginning", "level": 4, "content": [{"type": "paragraph", "text": "When he was first starting out as a pirate, he stole a Marine ship and, under the guise of a Marine flag, approached towns without suspicion. Krieg's massive armada gave him the title, \"Pirate Admiral Don Krieg\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b8/Krieg_Pirates_Return_from_Grand_Line.png/revision/latest/scale-to-width-down/210?cb=20130215203336", "caption": "Gin posing as Krieg to lure Fullbody away."}]}, {"title": "Attempt to Conquer the Grand Line", "level": 4, "content": [{"type": "paragraph", "text": "Krieg made a trip to the Grand Line with his fleet, hoping to find the One Piece. However, on his seventh day in the Grand Line, his ships were completely destroyed by Dracule Mihawk, one of the Shichibukai. With only one ship escaping through sheer luck but in terrible condition, Krieg returned defeated to the East Blue."}, {"type": "paragraph", "text": "He then had his right hand man, Gin, disguise himself as the Pirate Admiral and act as a decoy in order to lure away the Marine ship that had Lieutenant Commander Fullbody on it, in order to save the remaining members of the severely exhausted crew."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Baratie Arc", "level": 4, "content": [{"type": "paragraph", "text": "Gin made it back to the crew and told his boss, Krieg, that he could take the crew to the Baratie."}, {"type": "paragraph", "text": "Two days later, Krieg and his crew arrived at the Baratie with his ship. The chefs and clients were at first terrorized because of Krieg's terrible reputation. However, it quickly appeared that the ship was in a pitiful shape and it was an agonizing Krieg that entered the restaurant with the support of Gin."}, {"type": "paragraph", "text": "After Krieg and Gin entered the restaurant, everyone was shocked that Krieg was begging for food and water. Krieg then fell to the floor and Gin begged them to help his captain but Patty laughed at him. Gin continuously begged for food, saying they had money to pay and that made them their customers. Patty denied them and the other chefs commented on how dreadful Krieg really was. Krieg then bowed his head and begged for food. Gin stopped him and was seen crying."}, {"type": "paragraph", "text": "Sanji arrived with food and kicked Patty out of the way. All of them were shocked that Sanji was offering food to Krieg. Krieg quickly devoured the food and after he finished eating, he attacked Sanji immediately and Gin was shocked by his captain's actions. Krieg broke Gin's shoulder and the customers evacuated the restaurant in a panic."}, {"type": "paragraph", "text": "Krieg gazed at the whole restaurant and said that he liked it. He explained that his ship was battered and wanted the Baratie as its replacement. He also demanded food for his crew as to which the chefs refused. He explained that he was not ordering food, and that he was giving them an order. Krieg roared and said that nobody has ever disobeyed him."}, {"type": "paragraph", "text": "Before Sanji went to prepare food for Krieg's crew, Patty smashed him into the floor and offered Krieg a dessert and brought out a cannon and attacked Krieg with Shokuatari Meatball. Krieg complained how awful the dessert was and revealed his arsenal of weapons and began attacking the chefs. Krieg explained why he was the strongest before Zeff brought food for a hundred people. However, upon hearing Zeff's name, Krieg was shocked."}, {"type": "paragraph", "text": "Krieg told the story of Zeff the Red Leg, who was supposed to have died in an accident, but he only lost a leg which made him unable to fight anymore and forced him to retire from his career as pirate and became a chef of a restaurant. Since Zeff once went to the Grand Line and returned safely, Krieg wanted the journal written at that time. However, he would have to take it by force since Zeff decided not to lend it, given his feelings to the remnant of his former life."}, {"type": "paragraph", "text": "Krieg then left the restaurant to feed his crew, leaving the chefs the choice to flee or die. After returning to his ship, Krieg gave the food to his crew, enabling them to recover. Krieg told them of his plan to steal the Baratie ship and return to the Grand Line. When he saw the lack of motivation in his men to return to that place, he shot the man who criticized his decision, which appeared to quickly change their mind. When they started attacking the restaurant, their galleon was suddenly cut in half. They then saw that the Shichibukai, Dracule Mihawk, followed the Krieg Pirates all the way to East Blue. After Zoro was defeated by Mihawk, Krieg tried to attack him only to be completely ignored. Mihawk sliced the galleon once more before departing. The Krieg pirates resumed their attack on the Baratie. Krieg wanted to take over the ship so that they could travel more incognito, in addition to taking Zeff's journal so that they could learn about the powers of Grand Line and how to fight them. However, the chefs were ready to fight and they released a wood platform in front of the restaurant, so that they did not have to fight inside the restaurant and damage it. Patty and Carne drove a secret weapon hidden in the fish head of the Baratie, but Krieg got rid of it easily and threw it back toward the chefs, but Sanji kicked it back just as easily, showing his true strength."}, {"type": "paragraph", "text": "While Luffy was watching Sanji’s fight against Pearl, Krieg treacherously attacked Luffy. Luffy was tossed into the back of Pearl's head, forcing Pearl to smash his face against his own armor. In order to stop a berserk Pearl from destroying the ship he was after, Krieg threw a knob toward Sanji and Pearl but Luffy was able to deflect it. The knob instead destroyed Krieg's ship mast which, by falling, knocked out Pearl. However, the Krieg Pirates had not said their last word. While they were fighting, Gin took Zeff down and was threatening his life with a gun."}, {"type": "paragraph", "text": "When Krieg asked Luffy the question of who was stronger, Luffy naturally said that he was the stronger one there. In order to make him realize the difference between the two of them, Krieg threatened Luffy with one of his strongest weapon: poison gas MH5. When Luffy tried to bounce it back, it was revealed to be a shuriken bomb. Luffy admitted that he was tricked, but continued to say he was the strongest. As his anger rose, Krieg asked Gin to take care of Sanji, while he would deal with Luffy personally."}, {"type": "paragraph", "text": "Luffy tried to attack Krieg, but Krieg shot Luffy with bombs and spears. That spears harmed Luffy at his foot, and he almost fell into ocean. Luffy then asked if Krieg was not serious in fighting with him. Krieg answered that the important thing in fighting was strategy to kill the opponent. Krieg said that Luffy was a monkey because he just attacks without strategy."}, {"type": "paragraph", "text": "When Gin refused to kill Sanji because he helped him, Krieg was disappointed with Gin because he was the person whom he trusted the most. Gin requested to let the Baratie go, angering Krieg."}, {"type": "paragraph", "text": "Because of that, Krieg planned to shoot MH5 poison gas. Not seeing Gin as his crewmate, Krieg demanded him to throw away his mask."}, {"type": "paragraph", "text": "Meanwhile, Luffy tried to stop Krieg, but he did not succeed. Gin threw away his mask before Krieg unleashed his MH5. The Baratie's chefs escaped by diving and Krieg's crew used their masks. After five minutes, the gas dispersed and it was revealed that Gin gave Luffy his mask. Krieg angered Luffy and Sanji by saying that Gin was garbage and it was proper for him to die by his own hands as his commander."}, {"type": "paragraph", "text": "Luffy was really angry at Krieg and said that Gin may not die and has to survive. However, because of the poison, Gin would die in one hour. Luffy promised to defeat Krieg and started his attack at Krieg's front. Krieg affronted if he was more foolish than a monkey, because monkeys will not challenge people who are impossible to beat. Luffy replied by saying that he is a monkey who does not know the word of surrender."}, {"type": "paragraph", "text": "Krieg attacked with a hail of spears fired from his weapon. Luffy, without hesitation, ran straight into the attack with the intent of reaching Krieg. Realizing the rookie pirate wasn't stopping, Krieg revealed a robe made of dangerous spikes to deter any attacks. However, to the surprise of everyone, Luffy still attacked despite the injury inflicted to his hand, knocking Krieg to the ground."}, {"type": "paragraph", "text": "Standing back up, Krieg revealed his final weapon, a large spear with an explosive end that detonates upon impact. Continuing the battle, the surrounding wreckage was eventually reduced to sunken rubble with both combatants having very little room to move on. Determined, Luffy began striking the spear itself and eventually broke the end. Grinning with confidence, Luffy told Krieg to prepare himself."}, {"type": "paragraph", "text": "Krieg was knocked down once again by Luffy. When one of Krieg's crewmates stated that he believed Luffy to actually be stronger than Krieg, he arose, telling them to shut up before combining his shoulder plates together to form his \"Giant Battle Spear\", which he slammed into the ground next to Luffy, creating an explosion."}, {"type": "paragraph", "text": "While Luffy wondered how the spear made an explosion, Krieg swang it again, sending Luffy flying over the ocean, but luckily, he stretched towards a platform floating. However, due to the fact that he had lost lots of blood thanks to Krieg, and that the platform he was standing on was unstable, he soon fell to his knees. Krieg continued his assault on Luffy, who was dodging for his life."}, {"type": "paragraph", "text": "Finally, Luffy lost balance and jumped over Krieg's blow, but this made him wide open for an attack. However, just in the nick of time, Luffy grabbed the lance before it could hit him. Enraged, Krieg slammed the lance into the ground, forcing Luffy to let go. Krieg proceeded to ram his lance into Luffy, who grabbed the tip, but Krieg merely whipped it around, creating an explosion which sent Luffy flying. As Krieg swang again, Luffy was hit head-on. Krieg then proceeded to tell that he was stronger than Luffy."}, {"type": "paragraph", "text": "However, Luffy answered by slamming his foot into the ground, breaking the spear's tip, much to Krieg's confusion and horror. Luffy told him that he hit the tip five times, and that with the wide area they had landed in, Luffy could beat him."}, {"type": "paragraph", "text": "Krieg attacked Luffy again and wanted to execute him because he was brave to challenge \"The Most Powerful Captain\" in East Blue. Luffy dodged the attack and hanged onto a mast. Krieg then sliced the mast, but his attacks did not hurt Luffy. Luffy threw the mast at him, but Krieg destroyed it by shooting fire at it. Luffy countered with a \"Gomu Gomu no Gatling\", but Krieg's armor protected him. Luffy continued by trying \"Gomu Gomu no Pistol\" and sent Krieg flying, but the armor still did not break. Krieg planned to throw bombs from top of the mast. Luffy tried to stop him and ran faster. Finally, he destroyed the armor by using \"Gomu Gomu no Bazooka\" and made it cracked into pieces."}, {"type": "paragraph", "text": "Even though Krieg lost his spirit, he attacked Luffy in the air by shooting an iron net at him. Unfortunately for Luffy, he was trapped in it and below them was the ocean. If still in that condition, Luffy would sink and because of that, Krieg was really satisfied. However, Luffy planned to use his hands and feet for one last attack. Anticipating Luffy's next move, Krieg asked his crew to shoot at Luffy, but they were stopped by Sanji. Luffy was successful in using \"Gomu Gomu no Tsuchi\", smashing Krieg's head into the dock, causing him to lose consciousness."}, {"type": "paragraph", "text": "After losing the battle, Krieg stood up again and went berserk. Before he could continue, Gin punched Krieg in the stomach. Gin then departed the Baratie with Krieg and the rest of his crew."}, {"type": "paragraph", "text": "Krieg is still alive, but his current status and recent actions are unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Zeff_Gives_Krieg_Food.png/revision/latest/scale-to-width-down/210?cb=20161104032317", "caption": "Krieg meets with Zeff."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f1/Luffy_Hits_Krieg.png/revision/latest/scale-to-width-down/210?cb=20130425031606", "caption": "Luffy hits Krieg."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/70/Luffy_Breaks_Krieg%27s_Armor.png/revision/latest/scale-to-width-down/210?cb=20130120054358", "caption": "Luffy breaks Krieg's armor."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Krieg vs. a Marine captain", "elements": []}, {"text": "Krieg Pirates vs. Dracule Mihawk", "elements": []}, {"text": "Krieg vs. Baratie chefs", "elements": []}, {"text": "Krieg vs. Sanji", "elements": []}, {"text": "Krieg vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Krieg means \"war\" in German, alluding to Krieg's massive naval fleet and numerous personal weaponry."}, {"type": "paragraph", "text": "Due to bloodshed caused by his stakes in the original, the English dub by 4Kids censored the scenes involving this attack. They were renamed \"Poison Suction Cups\" and the stakes were edited into suction cups to match their name. However, the cup parts were missing in some of the frames in which they were initially fired and Luffy's wounds bled in others. Furthermore, many wondered how Luffy was poisoned by a suction cup, or how they are even supposed to hurt a rubber man. Also, they changed size more than once."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces was revealed an early concept of Krieg; he was originally going to be a cyborg named \"Krieg - 9000\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cb/Early_Don_Krieg.png/revision/latest/scale-to-width-down/210?cb=20150404102114", "caption": "Early concept of Krieg in One Piece Green."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Krieg's hair has a deep blue color as opposed to its purple hue in the anime."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the first version of Opening 1, Krieg's hair was shown as long, causing confusion among fans. It was later revealed this look was taken from his wanted poster, rather than his more recent appearance.", "elements": []}, {"text": "The name Krieg comes from the German word meaning war. This fits his reputation of having an incredibly large crew and the general array of weapons he possesses.", "elements": []}, {"text": "He shares the same Japanese dub voice actor with Sakazuki.", "elements": []}, {"text": "He shares the same Funimation dub voice actor with Wapol.", "elements": []}, {"text": "Krieg is one of three major antagonists whose fate after encountering the Straw Hat Pirates has yet to be shown. The others are Kuro and Foxy.", "elements": []}, {"text": "Krieg's favorite food is roasted Sea King.", "elements": []}]}], "images": []}]}