{"sections": [{"title": "Shirahoshi", "level": 1, "content": [{"type": "paragraph", "text": "Princess Shirahoshi, known as the Mermaid Princess (人魚姫, Ningyo Hime), is a giant smelt-whiting mermaid and the youngest of King Neptune's children. She was first mentioned by Pappag, claiming he knew her and even promised to introduce the Straw Hat Pirates to her when they arrived on Fish-Man Island (though later this is revealed to be a lie). She is also the current form of Poseidon."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Shirahoshi is a giant-sized mermaid, approximately the size of her pet Megalo but shorter than her father, and is described as \"cute but huge\" in her introduction; this makes her roughly eight to ten times the size of Luffy, an average human, excluding the length of her tail; she can hold and hide Luffy in one hand alone. According to Caribou's estimation, he put her about seven to eight times the size of a human-sized mermaid. Even as a baby, she was larger than her mother and brothers."}, {"type": "paragraph", "text": "She has very long, flowing pink hair with a taiyaki-shaped hairgrip. Her breasts are large, even relative to her giant-like size, and much of her upper body is exposed. Her broadly striped tail ends in a ruffle around her waist. She tends to have blush marks on her cheeks due to her shyness. Shirahoshi has been noted for her beauty, which has been said to rival that of Boa Hancock, and Garp stated that her appearance alone was beyond everyone's expectations."}, {"type": "paragraph", "text": "She wears a cleavage-baring yellow halter top covered in pearls with a strap that widens and sticks out on the back of her neck. She also wears clam earrings and belly chains with a cloth hanging down in front. She has a very long light red and pink striped tail."}, {"type": "paragraph", "text": "When she and her family arrived at the Red Port for the Levely, she wore a light colored shirt."}, {"type": "paragraph", "text": "As a four-year-old, she wore a polka dot crop top with straps that floated behind her head and her tail alone was larger than her mother. As a six-year-old, she wore a light-colored crop top with floating straps."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Despite her size, Shirahoshi has a very fragile personality. She is easily frightened, and quickly breaks out into crying fits whenever she gets upset, such as the time when Megalo disappeared, when Luffy startled her during their first meeting, and when Luffy says that he does not like her. She is greatly pampered by her family, as she claimed that nobody ever yelled at her before, and cried at the fact that Luffy was the first to do so. Whenever someone yells at her, she will interpret this as anger towards her and will start crying, while saying that the offender is scary. In fact, Shirahoshi easily tears up whenever she expresses her emotions such as joy, fear, or sadness."}, {"type": "paragraph", "text": "She can be grateful since she willingly hides Luffy from the guards after he saved her from being struck by an axe thrown by Vander Decken IX and also thanks him for rescuing Megalo. She is very considerate of her family and kingdom, saying that leaving Hard-Shell Tower even if she wants to would be a selfish thing for her to do. She is also very polite and addresses everyone with \"-sama\". She even politely rejected Decken's proposal by saying that \"he wasn't her type\"."}, {"type": "paragraph", "text": "Because of her ten years of solitude, she has very limited knowledge of the world outside her tower, so she is rather curious about it as she asks Luffy about the sun, the animals, and forests, even asking him how he can eat so much despite being so small. She also does not seem to know about Devil Fruits as she called the powers of Vander Decken IX as a curse (although Decken himself also refers to his power as such). Much like the citizens of Kuja, she takes Luffy to be the norm for human males. Also due to being locked up she has a very low stimulation level, and often becomes overly stimulated due to the events during her time with Luffy, causing her to become emotionally worked up. Because of her inexperience with proper communication, Shirahoshi accidentally offended some royals who were trying to get her attention."}, {"type": "paragraph", "text": "She seems to be naive, believing a balloon dummy to be her father and only realizing that it wasn't when she looked at it closer right before being captured (although it was part of their plan to be captured intentionally). Even though she knew Hody was behind her mother's death when Megalo confided her, she did not tell anyone because she wants to honor her mother's last wish of not holding any hatred against the killer, but this ends up being a big mistake since this allows Hody to execute his plans, despite Jinbe arguing otherwise."}, {"type": "paragraph", "text": "However, regardless of her fragile personality, she is sweet and innocent like a child which is evident when she promised to return to the castle by dinner time after leaving her tower. Shirahoshi is extremely kind as she does not bear any anger or resentment even towards people who have hurt her and her family, as despite Hody killing Otohime and later brutalizing her father and brothers right in front of her, Shirahoshi only tearfully wept. Even though not telling everyone about Hody was a dangerous mistake, this shows that Shirahoshi has a strong and gentle spirit since not hating her mother's killer even though it's her mother's last wish would be impossible for most people as noted by Jinbe, who is deeply impressed by her resolve and kindness. When Decken nearly destroys Fish-Man Island with Noah, Shirahoshi shows her bravery for the first time, putting the lives of her people ahead of her own. Even as a World Noble tried to enslave her, Shirahoshi still begged her father not to hate when he prepared to attack the noble."}, {"type": "paragraph", "text": "When the Straw Hats left Fish-Man Island, Shirahoshi shows a determination to change, promising Luffy that she will stop being a crybaby."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/39/Shirahoshi_Crying.png/revision/latest/scale-to-width-down/250?cb=20130217140558", "caption": "Shirahoshi crying."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "She has a pet shark named Megalo who was formerly a military pet who served the Neptune Army, whom she loves and doted on very much. Megalo was the only friend she can talk to while being locked up in Hard-Shell Tower. When her beloved shark went missing, Shirahoshi got deeply upset and cried continuously. Megalo himself reciprocates Shirahoshi's affections and is extremely protective of her as Megalo was mad at Luffy for making Shirahoshi cry and wasted no time trying to comfort her. Prior to Hody publicly revealing himself as Otohime's assassin, Megalo was the only one who is aware of the truth behind Otohime's death, having secretly confided it in Shirahoshi."}, {"type": "paragraph", "text": "Her father, King Neptune, and her brothers, Fukaboshi, Ryuboshi, and Manboshi, all care for her well-being. They gathered an army to hunt down Vander Decken IX, a criminal who kept pestering Shirahoshi with love letters and threatening marriage proposals. King Neptune considers Shirahoshi his treasure. That is the reason they protect her in the hard-shell tower from Vander Decken IX, and the royal guards cannot stay in her room more than five minutes for the same reason. When a World Noble tried to take Shirahoshi during the Levely, Neptune prepared to fight for his daughter even if it means giving up on Otohime's dream."}, {"type": "paragraph", "text": "Shirahoshi also greatly missed her deceased mother, Otohime, wanting to visit her grave since it was built. Her love for her mother was so great, the princess went through great turmoil to honor her mother's final wish by not hating Hody for killing Otohime."}, {"type": "paragraph", "text": "Her family apparently had been too easy on her since Shirahoshi never had been yelled at until she met Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Neptune_Family.png/revision/latest/scale-to-width-down/262?cb=20130425033019", "caption": "Shirahoshi with her family."}]}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "At first, Shirahoshi thought that Luffy was an assassin aiming for her life and feared him. However, when he blocked a flying axe that was aimed at her and figured out that he was the one who saved Megalo, she warmed up to him. She even hid him from the guards when they were searching for Luffy after he and his crew were wrongly accused of kidnapping mermaids and after Madam Shyarly's claim of envisioning Luffy destroying Fish-Man Island. When Shirahoshi poked Luffy's face while he was eating, Luffy snapped at her for it. Shirahoshi started crying and tearfully stated that Luffy is the first person to ever yell at her. After seeing how fragile Shirahoshi's personality is, Luffy bluntly called her a crybaby and a weakling. However, after getting along with Luffy, Shirahoshi does not show any resentment towards him for calling her names and she was able to leave the tower for the first time in ten years when Luffy offered to protect her. Luffy also stood between her and Vander Decken IX."}, {"type": "paragraph", "text": "Luffy's treatment of Shirahoshi is similar to how Ace treated Luffy during their childhood, and how Luffy treated Koby when they first met: harsh and blunt, but shows some kind of care, and then friendly. She trusts in Luffy's abilities, acting very carefree out in the open while he is around. After learning how Shirahoshi was able to honor her mother's last wish for so many years, Luffy acknowledged that Shirahoshi is not as weak as he had originally thought. He then calls her \"Weakhoshi\" since he still considers her a crybaby. Shirahoshi also shows deep concern for Luffy such as when Luffy lost a lot of blood from the wound he received from Hody and when Luffy went after Caribou for the stolen treasures. As the Straw Hats leave, Shirahoshi promises that the next time they meet, she will no longer be a crybaby. Luffy also promises that he will take her to a real forest on the surface."}, {"type": "paragraph", "text": "Though she was initially afraid of going to the Levely, Shirahoshi decides to go because she does not want Luffy to call her weak again."}], "images": []}, {"title": "Nami", "level": 4, "content": [{"type": "paragraph", "text": "Because they share similar backgrounds, Shirahoshi was quick to befriend Nami. Because she heard Camie refer to Nami as Nami-chin, Shirahoshi believes that it is actually her real name and calls her Nami-chin-sama instead of just Nami-sama."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Shirahoshi has become good friends with all the Straw Hats and appreciates them all for saving her, her family, and the kingdom from the New Fish-Man Pirates. She even wished for them to stay on the island longer so she can get to know them better. As she gave them all a tearful farewell, the Straw Hats (minus Zoro and Franky) promise to take Shirahoshi to the surface someday."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Shirahoshi has known Jinbe since she was little and always had respect for him. Jinbe has come to greatly admire Shirahoshi's devotion towards her mother, Otohime, for keeping her promise for not hating Otohime's killer, Hody. Jinbe also states that he will protect Shirahoshi and her ideals."}], "images": []}, {"title": "Friends of the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "At Mary Geoise, Shirahoshi quickly bonded with Vivi and Rebecca due to having a mutual friend that they are indebted to. When Charlos tried to make Shirahoshi his slave, Vivi and Rebecca protested against his actions, and Leo and Sai tried to save her. After returning home upon the conclusion of the Levely and learning from Garp about a huge incident concerning Alabasta, Shirahoshi became worried for Vivi's safety."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Shirahoshi%2C_%E2%80%8B%E2%80%8BVivi_and_Rebecca_Become_Friends.png/revision/latest/scale-to-width-down/200?cb=20190925183946", "caption": "Shirahoshi, ​​Vivi, and Rebecca become friends."}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Vander Decken IX", "level": 4, "content": [{"type": "paragraph", "text": "Shirahoshi is terrified of Vander Decken IX for sending her threatening marriage proposals. Decken is completely obsessed with the Mermaid Princess and will do anything to get her. His obsession has mounted to the point where he plans on killing her if she refuses him, in order to ensure that nobody else could have her except him. Ultimately, she rejects Decken because he wasn't her type. With her rejection, Decken became hell-bent on killing her. She only survived thanks to Luffy's swift counterattacks."}], "images": []}, {"title": "Hody Jones", "level": 4, "content": [{"type": "paragraph", "text": "Because of Shirahoshi's ability to summon Sea Kings, Hody Jones considers her as a threat to his plans. Therefore, she is one of the people that he wants to eliminate the most. On the contrary, despite knowing that Hody was the one who murdered her mother, Shirahoshi did not bear a grudge against him nor report his crime to anyone, due to the princess following her mother's final wish of not hating the person who committed the murder. Hody, in return, ridiculed Shirahoshi for her kindness and mercy."}], "images": []}, {"title": "Charlos", "level": 4, "content": [{"type": "paragraph", "text": "When the World Noble Charlos saw Shirahoshi in Mary Geoise, he attempted to make her his slave and would have succeeded had it not been for the intervention of Mjosgard."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Shirahoshi is on good terms with Garp due to him being Luffy's grandfather as they were friendly with each other as she asked him questions and waved to him as she left with her family to the Levely."}], "images": []}, {"title": "Donquixote Mjosgard", "level": 4, "content": [{"type": "paragraph", "text": "When Shirahoshi was six years old, a shipwrecked Mjosgard threatened her mother with a pistol, which caused great emotional stress that caused the unintentional summoning of a group of Sea Kings.  A decade later, Mjosgard rescued her from being enslaved by another World Noble in order to repay his debt to her mother. Mjosgard also promised to protect Shirahoshi and her family throughout the Levely."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Mermaid Princess and King Neptune's daughter, Shirahoshi has some level of authority over the kingdom her family rules, however it is unknown how much level of influence she has overall. It was stated by the Minister of the Right that her sudden disappearance from the Ryugu Palace could potentially trigger a nation-wide crisis."}, {"type": "paragraph", "text": "Being a giant-sized mermaid, Shirahoshi is able to easily lift a normal-sized person with one hand, as she had done with Luffy and Nami. Like all mermaids, she is one of the fastest swimmers in the ocean."}], "images": []}, {"title": "Poseidon", "level": 3, "content": [{"type": "paragraph", "text": "Shirahoshi has inherited from her ancestor the original Poseidon the power to command the Sea Kings. While merfolk and Fish-Men can summon and communicate with normal fish and marine life via sonar waves, Shirahoshi alone has the uncanny ability to call sea kings via the same method. By screaming, she emits sonar waves that summon the sea kings to her. While she was unaware of her power during her childhood, Otohime thought that if she receives a huge shock, she might subconsciously send sea kings on a giant rampage. However, it is later shown that sea kings are intelligent creatures so this is speculative. Otohime also described this as the most fearsome ability in the world, and that it can change the whole world in great ways. However, in the wrong hands, Shirahoshi's powers can sink the entire world into the ocean. While Luffy was destroying Noah to keep it from crashing into Fish-Man Island, Shirahoshi fully awakened the ability, as she unknowingly summoned the Sea Kings to help save both the ship and the island. Also, when compared to the time she summoned them as a child, Shirahoshi was able to communicate with the Sea Kings perfectly, having briefly spoken to the Sea Kings. The Sea Kings then stated that they were called by Shirahoshi's strong desire to help Luffy. It appears that Shirahoshi can summon them through her will and feelings even though she wasn't directly calling for them. This ability is what classifies her as one of the Ancient Weapons that the World Government fears so much; she is the current incarnation of the weapon Poseidon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/aa/Shirahoshi_Summons_Sea_Kings_as_a_Child.png/revision/latest/scale-to-width-down/240?cb=20141206185238", "caption": "Shirahoshi unintentionally summons some Sea Kings."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Like her mother before her, Shirahoshi possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Childhood", "level": 4, "content": [{"type": "paragraph", "text": "Sixteen years ago, Shirahoshi was merely a baby. But despite this, she was larger than her mother and older brothers. While her mother was away preaching to her people, her brothers would look after her at the palace."}, {"type": "paragraph", "text": "When Shirahoshi was four years old, she was seen comforting her exhausted mother and attending her classes when Otohime was teaching about the surface world."}, {"type": "paragraph", "text": "When Shirahoshi was six years old, an uproar had occurred when a World Noble arrived to the island in a wrecked ship. Otohime quickly dashed off to where the ship was docked. The four children of the royal family soon followed her to the scene. When Shirahoshi saw her mother being threatened by the noble she was protecting, she cried and unknowingly called forth Sea Kings, stunning all those present and making the noble pass out from extreme shock. Shirahoshi, however, was completely oblivious to the Sea Kings. When Otohime decided to accompany the noble to the surface, Shirahoshi and her brothers looked worried. For one week, she waited in the palace while Neptune tried to cheer her up."}, {"type": "paragraph", "text": "Otohime returned safe and sound and she held a piece of paper that could make a difference. Shirahoshi and her family were overjoyed that Otohime finally succeeded in getting people's signatures. But that excitement was short-lived."}], "images": []}, {"title": "Threats of Hody Jones and Vander Decken IX", "level": 4, "content": [{"type": "paragraph", "text": "One day in the Gyoncorde Plaza, the box containing all of the signatures caught fire. While the soldiers tried to save the signatures, Otohime was shot. Amidst the chaos, Vander Decken IX marked Shirahoshi with his Mato Mato no Mi powers. Shirahoshi, who was stunned seeing her mother get shot, did not noticed his presence. She was about to scream, but Ryuboshi and Manboshi managed to calm her down by dancing and singing in spite of their grief, thus preventing her from summoning Sea Kings subconsciously. As their mother passed away, Shirahoshi and her brothers touched pinky fingers with her for the last time. Megalo was the only one who witnessed Otohime's true murderer, and told Shirahoshi. The princess, however, did not tell anyone, in order to fulfill her mother's wish of not hating the culprit."}, {"type": "paragraph", "text": "Vander Decken IX, who set his sights on marrying Shirahoshi after witnessing her power, started sending letters to her. Before Otohime's funeral, the four children of the royal family told their father, Neptune, about the love letters that kept flying to Shirahoshi. Neptune told Shirahoshi and her brothers to not to go out to the funeral since danger still lurked around. During Otohime's funeral, Shirahoshi and her brothers were seen on a visual broadcast as Fukaboshi gave his speech."}, {"type": "paragraph", "text": "Decken kept sending letters to Shirahoshi once a week. Soon, those letters grew into packages. When he started sending threatening marriage proposals, she became so terrified of him that she could not ignore him anymore. Shirahoshi was locked in Hard-Shell Tower for ten years for her safety. For ten years, she wanted to visit the grave of her mother and had many things that she wanted to say to her."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/80/Vander_Decken_IX_Marks_Shirahoshi.png/revision/latest/scale-to-width-down/200?cb=20110812133338", "caption": "Decken marking Shirahoshi amidst the confusion of her mother's assassination."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Her pet shark, Megalo, had been missing for some time, having been captured and held in the Kraken's tentacles. Shirahoshi continued to cry until the shark returned to her, having been freed by Luffy after he defeated the Kraken."}, {"type": "paragraph", "text": "When the Straw Hat Pirates were taken to the Ryugu Palace, Monkey D. Luffy wandered off on his own in pursuit of food that smelled good to him. Eventually, he stumbled upon her room, where Princess Shirahoshi was sleeping."}, {"type": "paragraph", "text": "Luffy unknowingly walked across her stomach, fell between her breasts, and bounced on them, thinking they were coral due to the coarse material in her top. When she woke up, she became greatly distressed, thinking that Luffy was an assassin targeting her life. She said that she was not scared since she is the daughter of Neptune, but she started crying to no end while calling for help."}, {"type": "paragraph", "text": "As she continued crying, an axe thrown by Vander Decken IX came flying into her room aiming for the princess. Luffy deflected the axe, saving Shirahoshi's life. When the guards came to Shirahoshi's room, the princess hid Luffy from them. She told the guards that the noise they heard coming from her room was her having a bad dream. The Minister of the Right explained the situation with the Straw Hats."}, {"type": "paragraph", "text": "Once the guards left, Shirahoshi spoke with Luffy. Shirahoshi explained that she had been staying in Hard-Shell Tower for ten years because Vander Decken IX possesses some kind of \"curse\" which enables him to hit his targets from anywhere. While Luffy was eating, Shirahoshi asked him many questions about the outside world and wondered how Luffy could eat so much while poking him in the cheek. Luffy snapped back and Shirahoshi started to cry, saying that no one had ever yelled at her before. Luffy pointed out that Shirahoshi was a big crybaby, causing her to cry even more. Luffy then offered to take a walk with her outside the castle with him being the bodyguard."}, {"type": "paragraph", "text": "Luffy asked Shirahoshi about where she wanted to go. The princess said that she wanted to go to the Sea Forest. When she started crying again, Luffy started to refer to her as \"weakling\". Knowing that Shirahoshi's size would draw attention, Luffy came up with a plan. As Brook and the Minister of the Right arrived at her room, Megalo bursted through the doors with Shirahoshi hiding in his mouth."}, {"type": "paragraph", "text": "As Shirahoshi, Luffy, and Megalo were leaving, the Mermaid Princess, while thinking to herself, apologized for leaving without permission and promised that she would be back by dinner. Once they left the palace, she then told Luffy how exciting it felt to be outside again, saying it was an adventure. Shirahoshi then told Luffy that in the Sea Forest, there is a grave that she wanted to visit. Shirahoshi and Luffy were then seen laughing together."}, {"type": "paragraph", "text": "While hovering above Coral Hill, Luffy saw Chopper, Sanji, and a bandaged Hatchan. Once Luffy jumped down to meet them, he was met with accusations from the Fish-Man Island citizens for mermaid kidnappings. Megalo had finally reached his limit and spited out Shirahoshi. The Fish-Man Island citizens instantly interpreted this as a Mermaid Princess kidnapping."}, {"type": "paragraph", "text": "When Luffy asked her why she got out of Megalo's mouth, she apologized, asking him not to get mad at her. She tried to tell the citizens of Coral Hill that Luffy was only helping her, but they tied him up anyway, along with Sanji, Hatchan, and Chopper. She looked frightened when Vander Decken IX showed up. When Decken proposed to her, she rejected him, saying that he was not her type. Enraged, Decken prepared to kill her, and she began to run away, but Luffy told her if she ran away, then he would not be able to protect her."}, {"type": "paragraph", "text": "When Decken attacked Shirahoshi, Luffy intercepted his attack while still tied up. She then watched Luffy's fight with Decken which ended with Luffy smashing Decken into the ground. After the fight, Luffy told her to get ready to go, calling her a scaredy cat. Shirahoshi asked him not to yell at her as she was all worked up from the excitement. She then untied Luffy. When the locals asked why she freed him, she apologized to them and promised to be home for dinner. Shirahoshi, Luffy, and his three other friends hopped onto Megalo and headed for the Sea Forest."}, {"type": "paragraph", "text": "The group eventually reached the Sea Forest, much to Shirahoshi's delight. They soon met Franky, Den, and Jinbe. Luffy introduced the Mermaid Princess to Franky and Jinbe was surprised to see Shirahoshi out of Hard-Shell Tower."}, {"type": "paragraph", "text": "After Luffy deflected an axe thrown by Decken, Shirahoshi sat by Queen Otohime's grave and paid her respects. Nami and Camie arrived bearing terrible news and Shirahoshi cried when she heard that her father had been captured."}, {"type": "paragraph", "text": "Jinbe told Shirahoshi not to worry, saying that he would save her father from the clutches of the New Fish-Man Pirates. Shirahoshi then listened to Jinbe as he explained to the group the back stories of Queen Otohime and Fisher Tiger."}, {"type": "paragraph", "text": "When he finished his account, Shirahoshi began to talk with Nami and Chopper, brushing back her tears. She explained that she tended to cry whenever she thinks about her mother. She mentioned that she felt strangely comfortable around Nami, who noted that it might be because they have similar backgrounds (both having lost a mother and were tormented by a Fish-Man)."}, {"type": "paragraph", "text": "When Hatchan started revealing Hody's plan, a visual Den Den Mushi appeared and the group watched a visual broadcast by Hody Jones himself. After Hody explained his plan of creating the new Ryugu Kingdom, which included executing King Neptune, Shirahoshi was about to go back with Megalo, but Jinbe stopped her. Hatchan also told the princess not to go since Hody was using her father as a hostage to safeguard against her ability to summon Sea Kings. After Luffy resolved to fight Hody, Shirahoshi then watched Luffy and Jinbe trying to settle their dispute on how to deal with Hody."}, {"type": "paragraph", "text": "Shirahoshi was later seen riding on Megalo with Jinbe, heading to Gyoncorde Plaza to save the king. They then saw what barely appeared to be Neptune, floating in the air. As they approached it, it became evident that it was nothing more than a dummy set as a trap, and the three of them got ensnared in a large net. Jinbe, Shirahoshi, and Megalo were then tied up in chains and taken to the plaza. Shirahoshi tearfully apologized to Jinbe for making him fall into such a trap. After Hody revealed to everyone that he was the one who truly killed Otohime, he started gloating about her death right in Shirahoshi's face. The princess, by no means surprised, said that she knew all along."}, {"type": "paragraph", "text": "She knew the truth behind her mother's death because Megalo witnessed the murder at the time, and relayed the information to her. However, she concealed the dark secret from everyone because she knew that it would engender more hatred towards Hody, and more importantly she wanted to honor her mother's last wish."}, {"type": "paragraph", "text": "Hody laughed and ridiculed her, calling her kindness stupidity. Hody then gloated that because Shirahoshi kept the truth to herself, her father, her brothers, and the citizens of Fish-Man Island were in danger of facing death. When he prepared to kill Neptune, Shirahoshi cried out to Luffy for help and he jumped out of Megalo's mouth and kicked Hody a great distance away. When the rest of the Straw Hats appeared and lined up, Shirahoshi was seen standing behind them."}, {"type": "paragraph", "text": "Nami then gave Shirahoshi the World Noble's letter. Luffy commented that Shirahoshi was not as weak as he thought. Jinbe told Shirahoshi that he would help protect her ideals. The princess tearfully thanked everyone for their help. She was then amazed when Luffy defeated half of Hody's forces with Haki."}, {"type": "paragraph", "text": "Hody and his crew then tried to kill Shirahoshi, but their attempts were thwarted by Jinbe and the Straw Hats. She was then left in the hands of Surume, who changed sides due to Luffy being a friend. However, Hody blackmailed Surume using his brothers and the kraken started squeezing Shirahoshi. Luffy then stepped in by saying he was going to protect Surume's brothers and Surume stopped squeezing."}, {"type": "paragraph", "text": "Vander Decken IX later arrived at Fish-Man Island while riding on Noah with the intention of crashing the ship into the island. Before the massive ship broke the bubble surrounding Fish-Man Island, Shirahoshi left the plaza and appeared in front of Noah. Shirahoshi offered her own life in exchange for the safety of her people. Vander Decken IX responded by throwing a knife into her shoulder."}, {"type": "paragraph", "text": "Despite the wound, she fled to the sea to get Noah away from Fish-Man Island. Since the main entrance was too far away, she went through the gateway to Ryugu Palace where she took the straight path into the ocean. Noah followed her without destroying the bubble. Out in the sea, Vander Decken IX once again demanded that she marry him. Shirahoshi refused and Decken threw knives at her. Ryuboshi and Manboshi blocked the knives in the nick of time. The two brothers then tried to lead Shirahoshi to safety."}, {"type": "paragraph", "text": "After Hody dealt a devastating blow to Decken, he attempted to attack Shirahoshi and knocked Ryuboshi and Manboshi away. Hody grabbed onto Shirahoshi and prepared to kill her. Shirahoshi was saved when Luffy grabbed Hody and swung him away. After learning that the ship would fall on Fish-Man Island if Decken died, Shirahoshi changed her course. Unfortunately, Decken passed out and the ship no longer followed Shirahoshi and began to fall. She swam toward Noah, asking Vander Decken IX to make the ship continue to follow her. Hody tried to attack her using Fish-Man Karate, but Manboshi jumpped in front of her, taking the attack, much to her disbelief. While Fukaboshi was fighting Hody, she held Luffy's bubble watching the fight. Later, after the Ammo Knights arrived, Shirahoshi carried Luffy to Noah while Luffy was talking to Fukaboshi on the baby Den Den Mushi. Hody tried to attack Shirahoshi, but Luffy got between them and intercepted the attack, knocking him away."}, {"type": "paragraph", "text": "After Luffy defeated Hody onboard Noah, Luffy started destroying the ship. Shirahoshi got scared seeing Luffy's wounds opening up. As Luffy continued his barrage, Sea Kings suddenly appeared and held on to Noah, keeping it from falling any further. Luffy, unaware of the Sea Kings, continued his attack until Shirahoshi yelled at him to stop. As Luffy fainted from his open wound, the Sea Kings told Shirahoshi that they were summoned by Shirahoshi's feelings."}, {"type": "paragraph", "text": "The Sea Kings took Noah to the Sea Forest while Shirahoshi carried Luffy to the plaza. She was frantic since Luffy had lost a lot of blood. She wanted to help Luffy, but she does not have the same blood type as him."}, {"type": "paragraph", "text": "Jinbe volunteered to be Luffy's blood donor and the Straw Hat captain recovered. Jinbe and the Straw Hats quickly left the plaza while Shirahoshi followed them. She begged them to stay a little longer when a royal guard caught up with them. Through a Den Den Mushi, Neptune invited the pirates to a banquet."}, {"type": "paragraph", "text": "Shirahoshi attended the banquet with her family and new friends and partook in the celebration. Since she does not normally drink, the alcohol made her feel dizzy, so she went to her room. Caribou appeared and attempted to kidnap her after finding out that she is the Ancient Weapon Poseidon. Luffy, Zoro, and Sanji showed up and caught Caribou in the act. After Luffy dispatched Caribou by sending him flying outside the palace, Shirahoshi hugged him and thanked him for saving her. She was still shaken from the ordeal when the Straw Hats and the Minister of the Right discussed the disappearance of the palace treasure."}, {"type": "paragraph", "text": "Later, when the Monster Trio returned to the palace, they informed everyone that Luffy declared war against Big Mom. Shirahoshi cheered on Luffy for being strong and got yelled at by Usopp. Shirahoshi started crying and commented on how scary Usopp was."}, {"type": "paragraph", "text": "Later when the Straw Hats were departing Fish-Man Island, Shirahoshi tearfully wished for Luffy to stay longer, which caused Luffy to scold her for crying so much and she apologized. As they left, Shirahoshi swore to Luffy that she would stop being a crybaby. Furthermore, Luffy promised her that if they met again, Luffy would take her to the surface and all the Straw Hats (minus Zoro and Franky) made the same promise as well and Shirahoshi said farewell to all of them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/Luffy_Encounters_Shirahoshi.png/revision/latest/scale-to-width-down/250?cb=20130524132052", "caption": "Shirahoshi finds Luffy in her tower."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Shirahoshi_and_Luffy_Leave_the_Tower.png/revision/latest/scale-to-width-down/240?cb=20151206204430", "caption": "Shirahoshi leaves inside Megalo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Shirahoshi_Visits_Otohime%27s_Grave.png/revision/latest/scale-to-width-down/225?cb=20130522125617", "caption": "Shirahoshi visits her mother's tomb."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Shirahoshi_Befriends_Nami.png/revision/latest/scale-to-width-down/250?cb=20160130165911", "caption": "Nami befriends Shirahoshi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/Straw_Hats_and_Allies_Confront_the_New_Fish-Man_Pirates.png/revision/latest/scale-to-width-down/255?cb=20130210065344", "caption": "Shirahoshi with Jinbe and the Straw Hats as they confront the New Fish-Man Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f5/Shirahoshi_Pleads_with_Decken.png/revision/latest/scale-to-width-down/200?cb=20130514102112", "caption": "Shirahoshi pleads to Decken to spare her people."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/85/Hody_Attacks_Shirahoshi.png/revision/latest/scale-to-width-down/180?cb=20130514050622", "caption": "Hody attempting to kill Shirahoshi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dd/Caribou_Attempts_to_Capture_Shirahoshi.png/revision/latest/scale-to-width-down/250?cb=20130521161247", "caption": "Shirahoshi nearly abducted by Caribou."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fa/Straw_Hat_Crew_Pinky_Swears_with_Shirahoshi.png/revision/latest/scale-to-width-down/250?cb=20130813051728", "caption": "The Straw Hats making a promise with Shirahoshi."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Shirahoshi was asked to accompany her father and brothers. Shirahoshi initially refused, saying that she was too scared and not wanting to break her promise to Luffy. Fukaboshi told her that she should come for their mother's sake."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "Before leaving Fish-Man Island, Shirahoshi and Fukaboshi passed by some children who were wearing \"hero hats\"."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Neptune Family prepared to depart Fish-Man Island, Shirahoshi decided to accompany them, not wanting Luffy to call her weak again."}, {"type": "paragraph", "text": "The Neptune Family later arrived at the surface to Red Port. As Garp escorted them to the bondola, Shirahoshi was showered with attention due to her beauty. The Neptune Family then reached the bondola, and as it ascended to Mary Geoise, Shirahoshi waved to Garp before gazing and marveling at the sun and the sky."}, {"type": "paragraph", "text": "Shirahoshi and her family later reached the top of the Red Line and they made their way to the Mary Geoise castle. At the socializing plaza, several royals tried to get Shirahoshi's attention and she was overwhelmed as she accidentally offended them. She then befriended Vivi and Rebecca after hearing them talk about Luffy."}, {"type": "paragraph", "text": "Later, Charlos tried to take Shirahoshi by force. Before Neptune did anything drastic, Mjosgard intervened on Shirahoshi's behalf and knocked out Charlos with a spiked club before ordering for Shirahoshi to be set free. After Charlos was taken away, Mansherry healed Shirahoshi's bruises."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Shirahoshi_Sees_Paradise.png/revision/latest/scale-to-width-down/210?cb=20190505023706", "caption": "Shirahoshi sees the surface."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely ended, Shirahoshi thanked Garp for escorting her and the Neptune Family back to Fish-man Island. When Garp prepared to tell them about a grave incident regarding the Alabasta Kingdom that occured shortly after they departed, Shirahoshi began to worry about Vivi."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Her name can be translated as \"white star\" and may come from Shiro-gisu (シロギス), the Japanese whiting."}, {"type": "paragraph", "text": "When Shirahoshi told Luffy her name, he said it was hard to pronounce. This is probably because of the Japanese linguistic convention rendaku, a vocal phenomenon that tends to morph the pronunciation of certain words when they are used in compound words. For instance, \"hoshi\" is usually changed to a \"B\" (boshi), which is what happened with the names of Shirahoshi's brothers."}, {"type": "paragraph", "text": "In the FUNimation Dub, Luffy referred to Shirahoshi as “Weepyhoshi” instead of “Weakhoshi” after he heard her speech."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "After her father mentions the fact that she is big, Brook (before meeting her personally) imagines her as being big both in size and in width.", "elements": []}, {"text": "In One Piece 15th Anniversary: Dive to Grand World, Shirahoshi's height was estimated to be 17 meters. However, Vivre Card - One Piece Visual Dictionary gives Shirahoshi a specific height of slightly under 12 meters.", "elements": []}, {"text": "The largest species of smelt-whiting is the King George whiting, growing to a length of 72 cm and 4.8 kg in weight. Overall the smelt-whitings are a relatively small fish averaging about 20 cm in length and 100g in weight; in contrast to Shirahoshi's size, which is on par with giants.", "elements": []}, {"text": "Shirahoshi is the second character introduced that Luffy has befriended to whom he has openly stated he \"does not like\" for being easily scared and cowardly, the first being Koby in the second chapter. Coincidentally, both happened at the beginning of their respective \"halves\" of the story. The first time happened shortly after Luffy began his journey and the second shortly after he resumed it.", "elements": []}, {"text": "Shirahoshi actually shares the same fish species as Mero, as both are smelt-whiting. They are the only merfolk known to share the same fish species besides the Medaka Mermaid Quintuplets.", "elements": []}, {"text": "In the 5th fan poll, Shirahoshi ranked 28th. In the sixth poll she ranked 32th, making her the most popular mermaid in the series.", "elements": []}, {"text": "Shirahoshi shares many similarities with Rebecca.", "elements": [{"text": "They have both been sixteen year-old princesses of their respective countries.", "elements": []}, {"text": "Their respective mothers were murdered by an antagonistic force opposing their countries.", "elements": []}, {"text": "They share similar physical characteristics such as hair color and facial features.", "elements": []}]}]}, {"type": "paragraph", "text": "Shirahoshi's character has several references to fairy tales:"}, {"type": "list", "elements": [{"text": "Some stories have kings with multiple sons and a single daughter. The only sister is usually the one who protects/saves her brothers, such as in \"Ancilotto, King of Provino\" and \"The Wild Swans\". \"Childe Rowland\" is one of the few exceptions where at least one of the brothers saves the sister.", "elements": [{"text": "In \"The Frog Prince\", a spoiled princess was disgusted by a frog but reluctantly befriends him after he retrieves her golden ball for her. Shirahoshi was initially afraid of Luffy but quickly befriends him when he saves her, she then learns that he was the one who rescued her pet shark.", "elements": []}, {"text": "\"The Maiden in the Tower\" is type 310 of the Aarne–Thompson system for classifying folk tales. One of the the most famous is \"Rapunzel\". King Neptune locked his daughter away to protect her; why a maiden is locked up varies, but it is usually for selfish reasons from her caregiver (such as jealousy).", "elements": []}]}, {"text": "Neptune protecting Shirahoshi from an unwanted suitor is a reversal of most type 510B stories, \"The Unnatural Father/Love\", where the father either wants to marry his own daughter or marry her off to someone she does not want to be with. In \"The Bear\", the king was overprotective of his daughter and locked her up (not necessarily in a tower) to keep her from any harm (and by extension, any suitors at all).", "elements": [{"text": "\"The Little Mermaid\" grew curious about the surface world after each of her six older sisters told her what the world above was like. Shirahoshi is also the youngest of her siblings (except she only has three brothers) and is curious about the world beyond her tower, finally leaving the tower after meeting Luffy who had traveled to many places. Also, Shirahoshi being tormented by an unrequited love is similar to the original version by Hans Christian Andersen, except Shirahoshi is the receiver while the story's mermaid is the giver (to a prince who later marries another woman).", "elements": []}, {"text": "In most fairy tales (especially type 510A \"The Persecuted Heroine\" and 510B), the death of a parent figure, often of the same gender as the protagonist, brings about unpleasant situations for the hero/heroine. Queen Otohime's death and Shirahoshi's imprisonment (due to her deadly stalker) happening at about the same time frame (ten years ago) recalls this trend. Some stories such as Andersen's \"Little Mermaid\" have one parent absent to begin with without explanation. In an English dub of Hans Christian Andersen's The Little Mermaid (also a Toei production) the Sea King tells his daughters that their mother was killed in an \"accident\".", "elements": []}, {"text": "The fact that Vander Decken IX wants to kill Shirahoshi (rather violently) because she will not do what he wants, regardless of how enamored he claims to be with her, is similar to \"Bluebeard\" and its variants. Bluebeard's wife was rescued by her brothers, just as Shirahoshi's brothers raised an army to protect her. A husband or suitor who wants to kill his bride is made more monstrous than a regular murderer because he breaks the taboos associated with these roles, thus creating a very effective antagonist.", "elements": []}]}, {"text": "Shirahoshi’s character design shares striking resemblance with Matsya, the fish avatar of Vishnu in Hinduism. Additionally, Matsya is a main part of the Hindu ‘flood myth’ (similar to the one in Christianity) which draws parallels with Joy Boy, Ancient Poseidon, and the Noah.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d1/Brook_Imagines_Shirahoshi.png/revision/latest/scale-to-width-down/300?cb=20120218224535", "caption": "Brook imagining Shirahoshi."}]}]}