{"sections": [{"title": "Portgas D. Rouge", "level": 1, "content": [{"type": "paragraph", "text": "Portgas D. Rouge was the mother of Portgas D. Ace and the lover of Gol D. Roger."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rouge was a slender woman with long, wavy strawberry-blonde hair. She wore a pink hibiscus flower in her hair on the left side of her head, and had freckles on her face that were passed on to her son. She also wore a long, short-sleeved, light blue dress that reached down to her feet, and sandals. The anime version shows that her eyes were brown. In Episode 460 and before her introduction in the anime, her hair color was depicted as blonde."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Very little is known of Rouge's personality but she seemed to be very kind and loving, sacrificing herself so that her baby boy could be born. She also displayed the typical traits of the Will of D. such as a strong will and smiling shortly before death."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Gol D. Roger", "level": 4, "content": [{"type": "paragraph", "text": "She seemed to love Roger, as he cared about her and their child. She even named Ace using his surname, and cried at the realization of his death."}], "images": []}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "She sacrificed herself so he could be born without the World Government knowing of his birth, and cradled the infant before perishing. Ace cherished his mother's sacrifice and used her surname as a sign of respect."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Despite their brief meeting, like Roger, Rouge had apparently trusted Garp to take care of Ace after her death. Garp, out of deep respect for Rouge's sacrifice and love for her child, had agreed to take care of both Roger's and her child without reporting Ace's bloodline to the Marines."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "She was living on Baterilla in South Blue when she was pregnant with Ace before Roger died. She held her pregnancy for twenty months through sheer willpower in order to deceive the world of Ace's connection to the Pirate King. When the child was finally born, Rouge held him in her arms and named him \"Gol D. Ace\". The result of holding Ace for so long however led to her death from exhaustion after giving birth."}, {"type": "paragraph", "text": "As a result of this sacrifice to save his life from the World Government, Ace claimed that he owed her a debt and took Portgas as his surname."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Portgas D. Rouge's face is fully shown in the anime while it was never fully visible in the manga."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She is the first and so far only known female to have the initial \"D\" appear in her name.", "elements": []}, {"text": "Her name appears to derive from the term \"Jolly Roger\", as one supposed origin of the word jolly roger was the words \"jolie\" and \"rouge\" (especially as her lover, Gol D. Roger, also has his name derived from this). \"Rouge\" is also the French word for \"red\".", "elements": []}, {"text": "Not only is Ace named after the first ranked card in standard playing cards but \"Rouge et Noir\" (French red and black) is a name that several card games possess.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 550 (p. 16) and Episode 459, Rouge is first mentioned.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 164), Portgas D. Rouge's birthday is given.", "elements": []}, {"text": "↑  One Piece Anime — Episode 459, Rouge is seen in the anime.", "elements": []}, {"text": "↑  One Piece Anime — Episode 460, Rouge is seen in the anime.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 56 Chapter 551, Rouge gives birth to Ace and dies shortly after, with Vice Admiral Monkey D. Garp fulfilling his promise to adopt Ace.", "elements": []}, {"text": "↑  Ace taking Portgas as his surname.", "elements": []}]}], "images": []}]}