{"sections": [{"title": "Jango", "level": 1, "content": [{"type": "paragraph", "text": "The subject of this article is sometimes called Django."}, {"type": "paragraph", "text": "\"Double-Crosser\" Jango is a hypnotist and Marine seaman recruit under Rear Admiral Hina. He was formerly the Captain of the Black Cat Pirates and Captain Kuro's first mate."}, {"type": "paragraph", "text": "Due to his actions, Jango can be considered the secondary antagonist of the Syrup Village Arc. He is also the protagonist of the Jango's Dance Paradise Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jango is a skinny, gray-haired man who appears to favor strange, flamboyant clothes; the most notable of these are his red, heart-shaped glasses, which disguise his heart-shaped eyes and matching eyebrows. According to Eiichiro Oda, the striped, beard-like growth on his chin is actually the stem of a mushroom that grew while he was sleeping (Jango having eaten the cap, but finding it so disgusting that he left the rest alone)."}, {"type": "paragraph", "text": "As Kuro's first mate, he was known to favor a simple sleeveless shirt and blue bandanna. After being \"promoted\" to captain, he favored a blue, wide-brimmed hat, olive-green trousers (with similarly colored gloves), and black shoes with tall white socks. He combined these with a simple blue jacket when travelling incognito, but wore a larger, more imposing overcoat lined with ring-like decorations when acting in his \"official\" capacity as captain."}, {"type": "paragraph", "text": "Once he joined the Marines, Jango began wearing even gaudier articles - most notably a bright purple-and-yellow giraffe-patterned shirt - with the standard Marine Seaman cap."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jango is a powerful yet somewhat bumbling hypnotist. He is mostly carefree and was fully aware of Kuro's tendency to lash out at even his own crew mates (leaving Jango to feel uneasy being around him). Jango was loyal to Kuro, even knowing his Captain could kill him at any moment and went along with any plans of his."}, {"type": "paragraph", "text": "Jango seems to love dancing, often implementing dance moves in his routine, such as moonwalking instead of walking regularly. While in disguise at Mirrorball Island, he recklessly entered a local dance contest, forgetting that he had to avoid attention from the Marines. As a dancer, he was shown to be competitive and passionate enough to win the contest in the end, earning Fullbody's respect in the process."}, {"type": "paragraph", "text": "As a Marine, he takes the role of Hina's admirer and Fullbody's friend. While they have become friends through a rather bizarre set of circumstances, Fullbody and Jango have become inseparable and are always together on appearances. Often Jango and Fullbody will copy each other or dance beside each other in sync."}, {"type": "paragraph", "text": "Like many characters, Jango has a unique Laughter Style: Uhyahahya."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Originally, Jango was loyal to his former pirate captain, Kuro, as Jango was willing to take over captaincy of the crew, and return three years later to instigate the plan, despite seemingly knowing of his captain's darker personality. As for the rest of the crew, they seem to respect him enough to follow his orders, and Jango seems to show no cruelty towards them. Now, as a Marine, the Black Cat Pirates and Jango are enemies."}], "images": []}, {"title": "Friends", "level": 3, "content": [{"type": "paragraph", "text": "Jango is currently good friends with Fullbody, as they participated in the dance competition together and cooperated to defeat invading pirates. Fullbody also helped save Jango from his death sentence. Jango is romantically attracted to his commanding officer, Hina, but she rebuffs his advances."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "Jango is the Straw Hat Pirates' enemy, both because he threatened Kaya's life as a pirate and his duty to fight against and arrest pirates as a Marine. Usopp, in particular, bears a grudge against him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Having been a prominent member of the Black Cat Pirates for several years, Jango is decently athletic and possesses some combat ability. In melee, he has been seen using long, exaggerated kicks not unlike dance moves."}, {"type": "paragraph", "text": "Even by East Blue standards, however, Jango is not particularly formidable; notably, it took Usopp only one Gunpowder Star to fell him. It is unknown what (if any) improvements he has made as a Marine, as during the Battle of Marineford, he proved weak-willed enough to succumb to Luffy's burst of Haoshoku Haki."}], "images": []}, {"title": "Hypnotism", "level": 3, "content": [{"type": "paragraph", "text": "Jango can influence and control others through his hypnosis, as long as he makes them watch the swinging of his pendulum and listen to his command phrase One, Two, Jango (ワン・ツー・ジャンゴ, Wan, Tsū, Jango). When successful, this has proven a quick and easy method of incapacitating enemies (usually via commands to fall asleep) as well as aiding allies (via commands to tap into subconscious reserves of strength)."}, {"type": "paragraph", "text": "However, his hypnosis is largely useless against anyone aware of its dangers, as even Kaya was able to protect herself simply by closing her eyes. Conversely, Jango himself often forgets to close (or drop his hat-brim in front of) his eyes when issuing commands, resulting in frequent and embarrassing episodes of self-hypnosis."}, {"type": "paragraph", "text": "In any case, the full capacity of his hypnosis is unknown, as most of his successful commands were rudimentary, and performed on either the simpleminded (e.g. himself, Luffy) or willing subjects (e.g. his subordinates). His initial meeting with Fullbody, however, implied that he could manage something as complex as erasing all memory of an individual (i.e. himself) from another's mind."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/93/Jango_Hypnotism_Side_Effect.png/revision/latest/scale-to-width-down/210?cb=20130204013201", "caption": "Demonstrating for Ninjin, Piiman, and Tamanegi, Jango inadvertently falls under his own spell."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "The pendulum that Jango uses to perform his hypnosis is, in fact, a chakram (チャクラム, Chakuramu) on a string. It is made of sturdy metal, with an edge sharp enough to cut through tree trunks in one swing; Jango can wield it in one hand, spin it on a forefinger, or fling it as a projectile. He also makes sure to carry several spares in case something happens to the first."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Before he was a pirate, Jango was a wandering dancer. Unfortunately, he was usually poor. When Jango was sleeping, a mushroom grew on his chin. Finding the taste disgusting, he ate only the cap and left the trunk on there. Eating the cap is apparently what gave him his powerful hypnotism."}, {"type": "paragraph", "text": "Jango served as the first mate of the Black Cat Pirates, until one day his captain Kuro grew tired of constantly being on the run from justice, and decided to retire and give captaincy to Jango. Jango hypnotized Nugire Yainu, the crew's shipwright who bears sufficient similarities to Kuro, into believing that he was Kuro, and also hypnotized Morgan, the sole surviving Marine whose platoon was slaughtered by the Black Cat Pirates' captain, into believing he captured the real Kuro (Yainu) and took him to execution, so Kuro may have his bounty retracted and leave the pirate life. Jango then took the mantle of captaincy and trained by Kuro to survive without him, but was instructed to return to Syrup Village with the crew three years later as a ploy for Kuro to inherit an estate from a rich girl. What the crew was not informed was that Kuro intended to murder them all as well, to ensure his true identity would remain in the dark."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Syrup Village Arc", "level": 4, "content": [{"type": "paragraph", "text": "Jango first appeared walking strangely backwards through Usopp's hometown of Syrup Village. Later, he met with his former captain, Kuro, to help carry out his 3 year plan to kill Kaya and inherit her wealth. When Usopp and Luffy overheard the plan, Jango put Luffy to sleep and allowed Usopp to escape under Kuro's orders, because no one would believe him as he was the village liar."}, {"type": "paragraph", "text": "Jango was ordered by Kuro to hypnotize Kaya into writing her will, then kill her after it is done, so that Kuro inherits everything. Jango was put in charge of the Black Cat Pirates who were to invade the village and kill Kaya to remove any suspicion from Kuro. However, the Straw Hat Pirates intervention delayed the Black Cat Pirates and Kuro, unable to wait any longer, headed for the shore to take matters into his own hands. Kaya arrived to convince Kuro to leave, but failed and Usopp ordered the Usopp Pirates to take her into the forest. Jango pursued them, and planned on killing them before Kaya threatened to kill herself if they were harmed any further. Jango agreed to let them go if Kaya wrote the will, but warned them that they would most likely not survive with Kuro willing to kill everyone who knows his true nature. Kaya signed the will, but before Jango could kill her, Zoro cut a small tree branch out of the way so Usopp could shoot him with an Kayaku Boshi, knocking him out. While Luffy threw Kuro to his retreating crew, Jango was left where he fell."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Kuro_plots_with_Jango.png/revision/latest/scale-to-width-down/230?cb=20130504200246", "caption": "Kuro and Jango go over the plan."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/10/Jango_Defeated.png/revision/latest/scale-to-width-down/210?cb=20131214220533", "caption": "Jango is defeated by Usopp."}]}, {"title": "Jango's Dance Paradise", "level": 3, "content": [{"type": "paragraph", "text": "Jango woke up, too late to get on the ship, and the Usopp pirates chased him off the island. He made his way to a nearby island and, disguising himself, entered and won a dance contest. He celebrated his victory with Fullbody, who did not recognize him, and realized that he is a Marine. When pirates attacked the town and Fullbody fought against them, Jango initially fled to avoid the danger the pirates presented and to avoid being captured by Fullbody. The pirates took a woman hostage to prevent Fullbody from fighting back, but Jango saved the woman and defeated the pirates together with Fullbody. His identity revealed, Jango surrendered and was sentenced to death as a pirate, but Fullbody's \"friendship dance\" managed to secure an acquittal. Jango then went to hypnotize Fullbody into forgetting the friendship, but the sight of Hina stopped him before he could. He and Fullbody went on to enlist in her Marine unit out of admiration for her."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Jango joined the battle against the Straw Hats as they attempted to escape Alabasta, but accidentally destroyed two of the Marines' ships while trying to stop them."}], "images": []}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "He helped Hina in her search for Baroque Works agents. He was seen trying to fight Mr. 2."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Jango reported to the summoning of the Marines to reinforce Marineford."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three hours before Ace's execution, he was seen behind Hina listening to Sengoku's speech about Ace's past  and then he was alongside Fullbody watching the two tsunamis created by Whitebeard. When Luffy and his fellow Impel Down escapees arrived at Marineford, Jango noticed that Luffy's crew was not present with him."}, {"type": "paragraph", "text": "After Luffy released his Haoshoku Haki, Jango fainted, foaming at the mouth."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6a/Jango_and_Fullbody_at_the_Battle_of_Marineford.png/revision/latest/scale-to-width-down/230?cb=20160825123420", "caption": "Jango and Fullbody witness Whitebeard creating a tsunami with his Devil Fruit powers."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Nefertari Family departed Alabasta for the upcoming Levely, Jango accompanied Hina as they escorted the family to Mary Geoise."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Jango and Fullbody were present at the Red Port when the Marines intercepted a communication between Big Mom and Kaido."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jango vs. Usopp Pirates (interrupted by Usopp)", "elements": []}, {"text": "Jango vs. Usopp (with Zoro who knocked a tree branch out of the way to help Usopp aim successfully)", "elements": []}, {"text": "Jango and Fullbody vs. Tulip Pirates", "elements": []}, {"text": "Jango, Fullbody and Hina vs. Straw Hat Pirates and Mr. 2 Bon Kurei", "elements": []}, {"text": "Jango, Fullbody and Hina vs. Mr. 2 Bon Kurei (Alabasta Sea)", "elements": []}, {"text": "Jango, Fullbody and Hina vs. Mr. 2 Bon Kurei (during Miss Valentine's execution)", "elements": []}, {"text": "Marines and Shichibukai vs. Whitebeard Pirates and allies", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Jango and Fullbody vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Jango and Fullbody spring into action and attack Luffy as he charges forward. Jango attempts to hypnotize Luffy into falling asleep but due to a distant cannon fire distracting Luffy at the last moment, it failed. The attempt also backfires on Fullbody and himself, causing them to get kicked aside by Hina for their incompetence. Later in the anime, the scene of Jango fainting when Luffy unleashed a burst of Haki was omitted."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b0/Jango_and_Fullbody_at_Marineford.png/revision/latest/scale-to-width-down/210?cb=20130204013411", "caption": "Jango and Fullbody at Marineford."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the English manga and 4Kids dub, Jango's name is romanized as \"Django\" with a silent \"D\". However, it's spelled as \"Jango\" in the FUNimation dub. In the 4Kids dub, Jango speaks with a beatnik accent and uses words like \"groovy\"."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Songs", "level": 3, "content": [{"type": "list", "elements": [{"text": "1, 2 Jango!", "elements": []}]}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jango makes an appearance in a featurette during the 2nd One Piece film, entitled Jango's Dance Carnival. In the short, Jango performs a dance routine very reminiscent of those by late performer Michael Jackson, even going as far as to execute Jackson's signature moonwalk and mimicking his typical grunts and yells. Furthermore, several of Jango's overall characteristics (slender figure, eccentric personality, manner of dress, penchant for walking backwards, etc) seem to be homages to Jackson as well.", "elements": []}, {"text": "In the fourth popularity poll, Jango received 18 votes, making him the 66th most popular character in One Piece.", "elements": []}, {"text": "Jango, Bentham, and Franky all share the same Japanese voice actor, Kazuki Yao.", "elements": []}, {"text": "Jango is the third member of a pirate crew to join the Marines, the first being Vergo of the Donquixote Pirates as a spy, and the second is Koby from the Alvida Pirates.", "elements": [{"text": "He is the first captain to become a member of the Marines.", "elements": []}]}, {"text": "He is the second pirate/criminal to be pardoned for his crimes, the first being Tom.", "elements": []}, {"text": "He is the first and so far only person to have his bounty retracted.", "elements": []}, {"text": "In One Piece: Pirate Warriors 3, Jango is replaced with generic Pirate Captain during the meeting with Kuro that leads to Usopp and Luffy learning about Kuro's plan to steal Kaya's fortune and planned attack on Syrup Village. This is due to Jango not appearing in the game.", "elements": []}, {"text": "Jango's favorite food is spaghetti with mushrooms.", "elements": []}]}], "images": []}]}