{"sections": [{"title": "Arlong", "level": 1, "content": [{"type": "paragraph", "text": "Arlong the Saw is a sawshark fish-man. He was the captain of the all fish-man crew, the Arlong Pirates, a former member of the Sun Pirates, and the older half-brother of Madam Shyarly. He had the highest bounty in the East Blue before being defeated by Monkey D. Luffy. Due to his actions and role, he is the primary antagonist of the Arlong Park Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Arlong is a large, muscular, light blue saw-shark fish-man whose most distinctive trait is his saw-shaped nose. He has long, black hair with a widow's peak reaching down to his shoulders, under a brown ushanka. He has a fin on his nape, surrounded by his hair, and the gills are located on both the sides of his neck. His Sun Pirates tattoo is on the left side of his chest, while his own Jolly Roger is on his left forearm. Other notable features include thin, fierce light-blue eyes and a long, angular jaw."}, {"type": "paragraph", "text": "Arlong's attire is composed of fashionable, light clothes, reflecting his rich status as well as his background as a thug. He wears a short-sleeved, unbuttoned yellow cabana shirt decorated by many black lightning-like spots, Bermuda shorts which are brown in the manga and green in the anime, a purple sash around the waist and simple sandals. He also sports a lot of jewels: he has a golden chain bracelet around his left wrist and two golden bracelets around each ankle, with straw-like decorations hanging from them. On his hands are what appear to be rings, decorated by colorful gems. However, according to Oda in response to a fan about these rings, these aren't rings at all, but piercings that go straight through Arlong's fingers, as his hands are webbed and are incapable of wearing rings."}, {"type": "paragraph", "text": "As a member of the Sun Pirates, he wore an A-shirt, sometimes changed to a sleeveless, unbuttoned shirt decorated by flower-like motifs, a bowler hat, and loose pants reaching down below his knees, first a light-colored pair with a line of similarly light spots on each leg's inner part, and later a similar pair, but darker in color and with spots on both sides of the legs. He already sported the straw decorations around his ankles and the sandals, and also donned a pair of large circular earrings."}, {"type": "paragraph", "text": "During his first raid on the Conomi Islands, he had a long, light green scarf hanging from his shoulders, and wore a dark green coat and a pair of beige Barmuda shorts with a chain-like pattern on them paired with a green sash around his waist. Also, instead of the ushanka he currently wears, he had a simple, dark grey hat on his head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like many other One Piece characters, he has his own unique laugh, which is \"Shahahahaha\"."}, {"type": "paragraph", "text": "Arlong considers humans to be inferior beings and is very cruel to them. He is keen to separate his race from humans, and is constantly struck by this mentality that his people are superior to humans in every way. He thinks nothing of killing a town full of humans, although he seems to prefer controlling people with money and deals (like Nami and Nezumi)."}, {"type": "paragraph", "text": "Despite (or probably because of) his love for money and his ideology of money making the world spin, he is known to be very cheap, as Hyouzou refused to join his crew because Arlong refused to compensate him for his service. He does not seem frightened by anything, and his fish-man strength has made him extremely confident that he and his crew are virtually invincible. After Nezumi told Arlong that he as a Marine would not stay for fear of being seen in Arlong Park, Arlong invited the Marine to a meal and offered to kill anyone who dared report him."}, {"type": "paragraph", "text": "He has an eye for spotting exploitable talent that he can use for his ambitions and is an excellent planner. He spent eight years using Nami and her maps to plan his conquest of the East Blue. Nevertheless, any promise about money he makes, he keeps. The best example is when his crew urged him to keep Nami even if she brings the 100,000,000. However, even though Arlong states he cannot go back on his word, he has no qualms about exploiting loopholes in his deals to unfairly get his way. Like with Nami he said he would free her village if she brought him 100,000,000 but is more than willing to cheat her by having his corrupted marines find her remaining amount to keep her in his services."}, {"type": "paragraph", "text": "He angers rather easily, as he nearly goes on a rampage after being attacked by Usopp and has to be dragged back to his base by his crew to prevent him from destroying the whole town. During his fight with Luffy, the boy's constant fighting back made Arlong mad, to the point where it drove him into a deep anger. Arlong himself had expected Luffy to die quickly, but his anger made him become reckless and destructive, even seriously damaging his own headquarters building while attacking Luffy."}, {"type": "paragraph", "text": "He has been ill-tempered since his younger years. However, he was not always entirely brutal. During a battle with the Marines, Arlong told Jinbe to leave the unconscious Marines alone. However, it was later shown that he had grown more arrogant over time to the point that he completely had no sympathy for humans. Tiger's death led to his hatred hitting rock bottom. He also failed to understand Fisher Tiger's reason for letting humans that they attacked live. As a result, when Arlong led his own crew and had committed murder, humans came to view him as a \"monster\". He was loathed for the actions of him and his crew. In the end, he enslaved humans just as the humans once enslaved many fish-men."}, {"type": "paragraph", "text": "Though his opinions and his ideals were extreme, he displayed a high level of brotherhood with his crew and even towards Nami despite her species divide. Arlong looked after his subordinates and even though he betrayed Nami, he did so because he did not want to lose her talent. On top of this, in the final moments of the battle with Luffy, he stated that Nami was his crewmate and would be forever, and while he never displayed any regard for her as a friend he was prepared to fight to keep her in the crew. If humans insulted their group, Arlong would react to the insult, and due to the high level of concern amongst his officers they would attempt to keep his temper under control. When weaker members of his crew were hurt, Arlong would seek out revenge on those who had committed the act against those crew members. He cared for his crew to a level that when Luffy used one of them as a shield, Arlong became extremely angry."}, {"type": "paragraph", "text": "Ironically, Arlong is a hypocrite, having accused Koala of being raised to look down on fish-men and think of humans as better than everyone else, when Arlong looked down on humans and preached fish-men superiority himself, making him no better than the humans. Surprisingly despite his hatred of humanity according to Hatchan, Arlong would never harm his fellow fish-men no matter the circumstance."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crews", "level": 3, "content": [], "images": []}, {"title": "Arlong Pirates", "level": 4, "content": [{"type": "paragraph", "text": "He cares for his own crew (shown when he apologizes for accidentally biting them and becoming enraged at Luffy for using one as a fish-man shield), while many of his crew share his ideals. They would call him \"Arlong-san\" while Arlong would call his crew his \"brethren\". He can be very angry when someone hurts his crew rather similarly to Luffy's feelings towards his crew. However, this is exclusive to fish-men."}], "images": []}, {"title": "Sun Pirates", "level": 4, "content": [{"type": "paragraph", "text": "In their youth, Arlong and Jinbe were both friends who grew up together as orphans in the Fish-Man District. They once saw each other as brothers but they later became rivals when Arlong became a pirate and Jinbe became a soldier. While Arlong apparently wanted to be on friendly terms with him, Jinbe, who hated pirates, often argued with him. When Fisher Tiger took on the World Government, Arlong and Jinbe teamed up and got recruits from the Fish-Man District and joined the Sun Pirates. The circumstances of Jinbe letting Arlong loose into the East Blue are revealed to be a fight that took place between the two of them, with Arlong expressing distaste towards Jinbe for becoming a \"government dog\", seeing it as an insult to Fisher Tiger's memory, accepting sanction from the people who orchestrated their former captain's demise, so he ultimately wanted to separate from Jinbe's crew and reform his former Arlong Pirates with the intention of becoming the \"rage\" of the fish-men. Arlong's relationship with Jinbe ended on bad terms."}, {"type": "paragraph", "text": "Arlong looked up to Fisher Tiger as a hero and a big brother; in fact, Tiger's hatred of humans may have rubbed off on Arlong. Despite this he and Tiger often had arguments about this; Arlong wanted to slaughter the humans they came across to make the world fear fish-men while Tiger did not want to kill anyone because they would be stooping to their oppressors' level. When Tiger was betrayed and killed, a heartbroken Arlong cried and attempted to get even by attacking the people who committed the treason, and lying to the Marines about how Tiger's circumstances of death in order to preserve his big brother's honor and reputation. Despite his enormous respect for Tiger, Arlong was unable to fulfill his final wish of being at peace with humans; if anything, Tiger's death is what led Arlong's relationship with humans to corrode even further. Tiger was the only reason why Arlong remained in the Sun Pirates, as when Jinbe took over and became a Shichibukai, Arlong departed."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "As a pirate with a bounty, he is the enemy of the Marines and had the highest bounty in the East Blue until the Straw Hat Pirates were announced to the world. As he had been paying off the Marines to keep quiet, it's likely that his bounty did not fully reflect neither all of his crimes nor his true power/threat level. Also, during his time with the Sun Pirates, he fought against the marines many times, including rear admiral Kadar and his crew and Borsalino (being a vice admiral at that point)."}], "images": []}, {"title": "Cocoyasi villagers", "level": 4, "content": [{"type": "paragraph", "text": "After enduring Arlong’s tyranny for ten years the villagers decided once and for all they had had enough and head off to Arlong Park to fight with the pirates much to Nami's tearful plea. Genzo kept the town together after Arlong took over the island, making sure everyone was safe and able to pay Arlong's tax. When her 10 years of hard work to save them fell apart after Arlong's betrayal, he decided enough was enough. If they were going to die, they would die trying to fight Arlong even with Nami pleading that she can just start all over again. Having endured Arlong and his crew for many years, Genzo began to put various plans of rebellion into place. Things go wrong and the weapons the villagers are hiding are discovered. He barely escapes death until Usopp steps in and interferes."}], "images": []}, {"title": "Nami", "level": 4, "content": [{"type": "paragraph", "text": "Of humans, the only one he ever had respect for was Nami. In particular, he cut away from his normal human discrimination to humans for her, since her navigation skills were superior to any fish-man's. After he mentioned fish-men and their superiority over humans, Nami responded how tired she was of hearing it, leading Arlong to acknowledge her skills in the only witnessed incident in his appearance. He then apologized saying that she simply could not help what species she was. However, this was simply because of her skill to draw maps and he mistreated her constantly while she was on his crew, i.e. locking her in the tower and never properly feeding her."}, {"type": "paragraph", "text": "Despite his treatment, Arlong considered her as one of his brethren and always celebrated her return to Arlong Park. He would even have his crew celebrate when Nami 'came home' as greeting their returning sister."}, {"type": "paragraph", "text": "Nami was expected to act how he wanted her to. However this led him to misjudge her character. This was mostly because of his own ideals based on materialistic values. He could not see how she would not be happy unless she had clothes, money and a place to sleep. He also did not see her betrayal happening until it was too late. Even at the final stages of his fight against Luffy, he still stated that he regarded her a friend."}, {"type": "paragraph", "text": "His cruelty against Nami and her village has assured him an enemy to all of them, as well as to the Straw Hats, who defeated him. Arlong and his pirates were her enemies for a long time. Despite Arlong taking her into his crew, she showed no love for them due to what they did to her village and for killing Bell-mère. Arlong had fought Luffy claiming that she was his crewmate in his fight, even admitting she was \"cute\" for a human and admitted he had no respect for humans yet she was one of about 2 humans he was seen to show respect for, the other being Nezumi. Despite his treatment, Arlong considered her as one of his brethren and always celebrated her return to Arlong Park. He would even have his crew celebrate when Nami 'came home' as greeting their returning sister. Nami while apart of his crew would always attempt to escape from his grasp through different means, such as poisoning him, hiring someone, sneak attacks, and building enough money to buy her freedom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/85/Arlong_Mocking_Nami.png/revision/latest/scale-to-width-down/200?cb=20131020073659", "caption": "Arlong mocking Nami, after she discovers his betrayal through a loophole."}]}, {"title": "Humans", "level": 3, "content": [{"type": "paragraph", "text": "When dealing with Nezumi, Arlong tells him that he does not like humans, with the exceptions of Nami due to her navigation skills and those who understand how to do business like Nezumi. However, Arlong's hatred for humanity is harsh, as he did not sympathize Koala's past as a slave. When humans betrayed Fisher Tiger which led to his death, Arlong noted the true colors of humans, and tried to kill the ones who committed betrayal."}], "images": []}, {"title": "Koala", "level": 4, "content": [{"type": "paragraph", "text": "Arlong objected to her presence on the Sun Pirates' ship due to her being an human, even hitting her once due to being angry at her smile, even when other members of the crew came to accept her."}], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Shyarly", "level": 4, "content": [{"type": "paragraph", "text": "Madam Shyarly of the Mermaid Cafe is Arlong's younger half-sister. The two were not seen interacting with each other, but they have different views on humanity, as Arlong was bitterly hateful against them, yet Shyarly was more accepting."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Hody Jones", "level": 4, "content": [{"type": "paragraph", "text": "During his childhood, Hody Jones looked up to Arlong. While Hody was growing up in the Fish-Man District, Arlong preached to him and his friends about fish-men superiority and taught them to hate all humans with extreme prejudice. Thus, Arlong's influence was one of the factors that shaped Hody into a monster. Hody did not join Arlong when he first wreaked havoc on the seas since Hody was very young at the time."}, {"type": "paragraph", "text": "Hody Jones mentions at the time when the Straw Hat Pirates defeated the Arlong Pirates he was gathering strength at Fish-Man Island in order to be his right hand man. Hody claims to have learned from his hero's mistakes, dismissing Arlong as a barbarian and that the \"Arlong Pirates\" are nothing more than an empty symbol for the unity of fish-men who hate Humans."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Arlong is one of the fish-men, massive humanoids that are taller and stronger than any normal human. Arlong, however, is a giant even among fish-men. His power was remarked to be greater than Don Krieg, the strongest (military) force in the East Blue, with only Krieg's military might and massive armada forcing the Marines to deem him the bigger threat."}, {"type": "paragraph", "text": "Arlong was not bothered by Luffy having a Devil Fruit power and took advantage of his weakness to the effects of the sea. With the Marines focusing their attention on the Grand Line and the incapacitation of all other major East Blue pirate bands by the Straw Hats, there would have been nothing to stop them from taking over East Blue if the Straw Hat Pirates had not intervened."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a fish-man, he is physically ten times stronger than a common human, and even more underwater. However, he seems to possess amazing physical strength even for fish-man standards: he was seen lifting a house with his bare hands in pursuit of Usopp, and his powerful shark-like jaws are capable of bending metal, crushing stone, and ripping through flesh alike. Arlong's fortitude was also displayed when he was able to withstand most of Luffy's attacks. Although Luffy unleashed most of his techniques and forced Arlong back, he was mostly unfazed after each attempt."}, {"type": "paragraph", "text": "He also has incredible endurance to pain: during his fight with Luffy, he ripped off many sets of his rapidly re-growing teeth, and he rearranged his broken nose without a grimace. Arlong is also capable of entering a kind of berserker mode upon angered. When this happens, his eyes take on an appearance similar to those of Sea Kings. While in this state, both his strength and his speed grow exponentially, making him far more dangerous than previously stated."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Arlong's weapons are mostly natural features of his saw-shark fish-man body. With his fish-man strength, something as harmless as throwing a handful of water can strike as hard as a bullet. This attack is similar to the Uchimizu technique of Fish-Man Karate. He was also seen killing Bell-mère with a flintlock."}], "images": []}, {"title": "Nose", "level": 4, "content": [{"type": "paragraph", "text": "Even his nose is a weapon. It is over a foot long and lined with razor-sharp points, and more than sturdy enough to use as a melee weapon. Swinging his head back and forth, Arlong defeated Zoro (who was weakened by the massive wound given to him by Mihawk previously and his fight with Hatchan) in a sword fight with this natural blade. He is very proud of his nose and claims his nose is unbreakable. However, Luffy managed to twist his nose in another direction during the fight. This unbreakable-ness is particularly evident by the fact that when he flew directly into the concrete section portion of his park and got up without any damage done, causing others look on in pure shock and comment on its toughness. When Luffy snapped it to another direction, Arlong twisted it back to it's original position without any noticeable pain or discomfort."}], "images": []}, {"title": "Teeth", "level": 4, "content": [{"type": "paragraph", "text": "He can remove his massive teeth and snap them at opponents like castanets, almost like hand-held foothold traps. The teeth are replaced by a new set in mere moments, each regrown mouthful stronger than the one before. Luffy demonstrated, however, that these teeth can also be used against Arlong, either by holding them in his hands or as he chose, fitting them in his mouth and biting his opponent with them. However, Arlong states that only a fish-man can fully utilize the strength of the teeth as he possesses greater strength than a human."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/37/Arlong%27s_Teeth.png/revision/latest/scale-to-width-down/210?cb=20130314222340", "caption": "Arlong's baring three sets of teeth; one in each hand and one in his mouth."}]}, {"title": "Kiribachi", "level": 4, "content": [{"type": "paragraph", "text": "In the last phases of his fight with Luffy he used a giant saw-like sword, the Kiribachi, with great proficiency, as he was able to cut even a building with it. He has had such weapon since his younger days, as he was already seen wielding it during his time in the Sun Pirates. Predictably, as formidable an opponent as Arlong is on land, in the water he is twice as powerful."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Shark on Darts (, Shāku On Dātsu): Arlong shoots himself at his opponent like a torpedo, piercing them with his sharp and apparently unbreakable nose. When used from water, the speed of the attack is greatly increased. This attack is simply called Shark Darts in the Viz Manga and FUNimation dub and Shark and Awe in the 4Kids dub.", "elements": []}, {"text": "Tooth Gum (ガム, Tūsu Gamu): Arlong pulls out his own teeth and uses them as weapons with his hands. He immediately grows another set of teeth after pulling the previous ones, so he can bite his opponent with both his mouth and his hands. In the Viz Manga and FUNimation dub, this is called Tooth Attack.", "elements": []}, {"text": "Same no Ha (サメの歯, Same no Ha, Shark Teeth): Arlong use his extremely sharp teeth equipped jaw to bite his opponent. Arlong's bite power is strong enough to rip off meat with a single bite and even crush solid concrete.", "elements": []}, {"text": "Shark on Tooth (, Shāku On Tūsu): An enhanced version of his Shark on Darts attack, Arlong fires himself at his opponent spinning with his mouth open, trying to bite them down and tear them to pieces. The kanji used for Tooth is that of Haguruma which means \"gear\" in Japanese in the manga. This is called Shark Tooth Drill in the Viz Manga and FUNimation dub and Shark and Destroy in the 4Kids dub.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "A Broken Family", "level": 4, "content": [{"type": "paragraph", "text": "At a very young age, Arlong was abandoned by his father in the Fish-Man District and soon forgets his father's face. However, at the age of 15 he was then approached by a man claiming to be his father who left Arlong with a young girl, born to a different mother."}], "images": []}, {"title": "Fisher Tiger's Time", "level": 4, "content": [{"type": "paragraph", "text": "During his childhood, Arlong grew up in the Fish-Man District along with Jinbe, Macro, and Fisher Tiger. When he was 25 years old, he formed his own crew. On Fish-Man Island, Arlong would usually spend his time teaching younger fish-men, such as Hody, to hate humans or harassing the citizens of Fish-Man Island for befriending humans, much to Jinbe's scorn. Jinbe severely disliked Arlong for his brutish actions and behavior, often stepping in when he was causing trouble. Whenever Fisher Tiger returned from an adventure, both Arlong and Jinbe would give him a warm greeting. After Fisher Tiger attacked Mary Geoise, became an enemy of the World Government, and formed the Sun Pirates, Arlong and his crew integrated with Tiger's crew. During a battle with the Marines, Arlong was surprised at Jinbe's brutality towards them, continuing to beat them long after they had lost consciousness. In the aftermath of the battle, Arlong commented on how brutal it was."}, {"type": "paragraph", "text": "During their time roaming the Grand Line, the Sun Pirates battled numerous Marines including those led by Rear Admiral Kadar. Arlong, who had become completely ruthless, killed a Marine simply because he was human. After the battle, Tiger had a discussion with Jinbe and Arlong telling them not to kill humans. Otherwise, they will stoop to their level. Tiger went on saying that their ultimate goal was freeing the oppressed and not becoming cold-blooded murderers much to Arlong's dismay. When Arlong brought up the suggestion of instilling fear in humans by using ruthlessness, Jinbe smacked him in the head. The Sun Pirates later visited an island where a former slave of Mary Geoise named Koala resided. The inhabitants there had no way of returning the girl to her homeland so they asked the Sun Pirates to take her. After she boarded the Sun Pirates ship, Arlong hit her for being a human and had to be restrained by Hatchan."}, {"type": "paragraph", "text": "Even though most of the Sun Pirates warmed up to Koala, Arlong remained antagonistic towards her. He believed that Koala was no different from the cruel humans, but Jinbe disagreed with him. Eventually, Koala was returned to her home, Foolshout Island and Arlong merely commented that Koala was just going to grow up into the humans he known and hated. Not long after Koala returned to her family, the Sun Pirates realized that the citizens there betrayed Tiger and the crew by summoning the Marines in exchange for ignoring Koala's status as property of the World Nobles. In the ensuing battle with the Marines led by Rear Admiral Strawberry, Fisher Tiger was badly wounded. The Sun Pirates lost their ship, but they were able to steal a Marine ship and escaped."}, {"type": "paragraph", "text": "On board the stolen Marine ship, the crew tried to save Tiger's life with a blood transfusion using human blood, but Tiger firmly refused the transfusion. Tiger told the crew that he was in truth a slave who escaped Mary Geoise, and that he could never truly love humans due to all that happened. He ultimately died from blood loss."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/The_Sun_Pirates.png/revision/latest/scale-to-width-down/210?cb=20150823164431", "caption": "Arlong and the Sun Pirates."}]}, {"title": "After Tiger's Death", "level": 4, "content": [{"type": "paragraph", "text": "Arlong, enraged by the treachery that led to his captain's death, returned to Foolshout Island in an attempt to murder all its citizens in revenge, but Vice Admiral Borsalino defeated and captured him."}, {"type": "paragraph", "text": "Arlong was then brought to G-2, where he was interrogated. Arlong lied about Fisher Tiger's death to preserve his honor. Arlong was then imprisoned in Impel Down. Some time later, following the recruitment of Jinbe into the Shichibukai, Arlong was released. Arlong then expressed his resentment towards Jinbe for becoming a \"government dog\" and told him that he was going to go back to being captain of the Arlong Pirates."}, {"type": "paragraph", "text": "At an island, Arlong told Jinbe to kill him if he wanted to stop him or Arlong would do as he pleased. Arlong's arrogance then lead him into a fight with Jinbe. This resulted in Arlong being beaten to a pulp and was carried off afterward. Jinbe left Arlong alone as the two went their separate ways. Jinbe allowed the Arlong Pirates to run loose in East Blue, and this was a decision that the Shichibukai would later regret. Arlong had also attempted to recruit both Hyouzou and Vander Decken IX, the first turned down Arlong since he had a tight-wallet and the second refused to be the subordinate of another."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Borsalino_Defeats_Arlong.png/revision/latest/scale-to-width-down/175?cb=20141206185546", "caption": "Borsalino captures Arlong."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1e/Jinbe_Punches_Arlong.png/revision/latest/scale-to-width-down/210?cb=20140727194154", "caption": "Jinbe and Arlong's last scuffle."}]}, {"title": "Subjugating East Blue", "level": 4, "content": [{"type": "paragraph", "text": "When Arlong and his crew (including Hatchan, Chew, and Kuroobi) first arrived on the island that would someday become Arlong Park, the first village he encountered was Cocoyasi Village, the home of Nami. Arlong then proceeded to extort money out of the residents of Cocoyasi Village. Adults would have to pay 100,000 and children would pay 50,000 or be executed by Arlong's men. Bell-mère (Nami's adoptive mother) only had 100,000 so she decided to pay for Nami and Nojiko and sacrifice herself. Arlong shot her in front of her children as an example of disobedience."}, {"type": "paragraph", "text": "As the pirates began to leave, Arlong learned about Nami's skill in regards to creating maps. He forced Nami to become part of his crew as a map maker and told her that he would free her village and everyone in it, including her adoptive sister Nojiko, if she brought him 100,000,000."}, {"type": "paragraph", "text": "Arlong set up his domain on Cocoyasi Village, with a number of smaller villages in the vicinity under his control. Arlong dismantled his original galleon and used the materials to build Arlong Park, an eight-story building that served as his headquarters. From Arlong Park, Arlong hoped to conquer all of East Blue using superior underwater tactics through maps drawn by Nami that charted underwater terrain."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1e/Fish-Men_Infobox.png/revision/latest/scale-to-width-down/210?cb=20140727103926", "caption": "Arlong and his crew raid Cocoyasi Village."}]}, {"title": "Arlong Park Arc", "level": 3, "content": [], "images": []}, {"title": "Encountering Nami's New Friends", "level": 4, "content": [{"type": "paragraph", "text": "Arlong and his crew were first introduced when Nami returned after her travels with the Straw Hats. In Arlong Park, Arlong bribed a Marine known as Nezumi."}, {"type": "paragraph", "text": "Later, Zoro was taken to Arlong Park where he was being questioned by Arlong. Zoro insulted Arlong by calling him a half-fish mutant and restated that he was looking for a girl. Arlong said that he would forgive Zoro once for the insult and said that fish-men are superior to humans. Shortly after, Nami appeared much to Zoro's surprise seeing her here with Arlong. Arlong said that she was an exception and revealed that she was the Arlong Pirates' cartographer. When Zoro questioned why Nami was with the fish-men, Arlong asked if they knew each other. Nami answered by saying that he was just another victim. Zoro asked Nami if this was her \"true self\" and she answered yes and that she had been with Arlong all along. After Nami's statement, Arlong laughed and called her a \"cold-blooded witch\" who only wanted money, much to Nami's dislike. Zoro noticed this and jumped into the pool. Nami reacted to this by diving in and saving Zoro. Afterwards, Nami told the fish-man to lock up Zoro and she would kill him later. Shortly after, a fish-man approached Arlong, saying that a longed nose human got away. Arlong said that the human was probably in Cocoyashi Village and said that he had business to attend over there anyway."}, {"type": "paragraph", "text": "Arlong later arrived at Cocoyasi Village and began questioning Genzo on possession of weapons. Genzo answered that it was a hobby to collect weapons. Arlong said that he could not possess any weapons since all they do was bring violence. Arlong threatened Genzo by stating back when he destroyed Gosa Village due to no one paying tributes. Before leaving, Arlong told the town to work hard for money since tribute was coming up. Since possessing a weapon might be seen as a start of rebellion against the Arlong Pirates, Arlong decided to execute Genzo to make an example of the inferiority of humans against fish-men."}, {"type": "paragraph", "text": "When Arlong was about to give Genzo the final blow, he was hit by an explosion. It was Usopp who targeted him from a roof nearby and tried to act bravely. This caused Arlong to go berserk, and in retaliation, he destroyed the house that Usopp was perched on. Afraid that their leader would destroy the entire village for which they need to receive money, the fish-men restrained him and promised to catch Usopp and drag him back to Arlong Park."}, {"type": "paragraph", "text": "Arlong returned to Arlong Park and found that Zoro had struck down all of his men. His mood quickly shifted when his men announced that Usopp had been captured. In order to regain the trust of the pirates who started to think that she let the swordman escape, Nami started to fight with Usopp. She even stabbed him and plunged him into the sea. Satisfied by this behavior worth of a true Arlong Pirate, the fish-men congratulated her. However, she told Arlong that she only did that so that she could buy her village back."}, {"type": "paragraph", "text": "Meanwhile, a Marine ship led by Commodore Pudding Pudding arrived to try to liberate the inhabitants of the island. The ship fired a cannon ball against the Arlong Park. Arlong easily broke it with his teeth. The pirates got rid of them easily with only three of Arlong's officers. With the strength of the fish-men and Nami's skill with maps, they believed they would conquer the East Blue. Later, Arlong had some Marines led by a Nezumi take away all the money Nami collected over the years. After her money was taken away, Nami ran back to Arlong and accused him of sending the Marines to look for her money. However, Arlong denied it, claiming that he never broke their deal and told her that if she wanted her village back, she would just need to start again from scratch. Nami ran off both in fury and anguish as he laughed."}, {"type": "paragraph", "text": "Yosaku and Johnny then attempted to fight the Arlong Pirates but were easily defeated. Just when the villagers were about to start a rebellion, Luffy, Zoro, Sanji, and Usopp marched into Arlong Park and challenged the Arlong Pirates. After Luffy's explosive entrance, Luffy threw a huge punch into Arlong's face."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Luffy_Punches_Arlong.png/revision/latest/scale-to-width-down/210?cb=20150317170039", "caption": "Luffy strikes Arlong for making Nami cry."}]}, {"title": "Destruction of Arlong Park", "level": 4, "content": [{"type": "paragraph", "text": "After this declaration of war, the fish-men started attacking Luffy, but they were easily knocked out by Sanji. Hatchan then summoned Momoo to deal with Luffy and his comrades. However, when the giant sea cow appeared, he expressed fear after his previous encounter with Sanji and Luffy. Arlong then blackmailed Momoo, prompting him to attack the Straw Hats. Luffy, thanks to a new attack, used Momoo to blow Arlong's grunts away. The officers of the Arlong Pirates did not seem to be worried at all. Chew requested Arlong to calm down and they would fight the Straw Hats. Hatchan attacked the Straw Hats with his Jet Ink. However, all of the Straw Hats (with an exception of Luffy, who's feet was stuck in the ground from the last attack) were able to dodge the attack, leaving Luffy doused from head to toe with ink. Arlong took advantage of Luffy's weakness of the sea and uprooted a portion of the concrete surrounding Luffy's implanted feet and tossed him into the nearby pool."}, {"type": "paragraph", "text": "After Arlong's officers had been defeated, Sanji and Zoro fought Arlong in order to gain some time for Luffy’s rescue, but they were no match for his strength as they were easily defeated. Nami arrived and she bravely told Arlong that she would kill him. This made Arlong laugh as he even tried to make a deal with her. He gave her a choice: to be his eternal navigator and spare the villagers, but have Sanji and Zoro die for causing too much trouble, or have all the villagers killed. While Zoro kept Arlong distracted, and with minor interference from Hatchan, Sanji dove back into the water and freed Luffy's body. Back on land, Arlong ripped off the bandages on Zoro’s chest, injuring him even more and shocking everybody. Before he could kill the swordman, he realized that Zoro's wounds were not ordinary ones, due to the wound being able to kill a normal human."}, {"type": "paragraph", "text": "After Luffy got out of the water, he saved Zoro by switching places with him and started a few attacks on Arlong. They were ineffective against Arlong, but Luffy stated that it was just the warm-up. Arlong told Luffy about the innate superiority of fish-men on the humans and provided a direct demonstration. Luffy was only barely able to avoid the fatal attacks of a shark. When Luffy showed him that he has a different type of strength, Arlong mocked him since Luffy was unable to get out of the water without help. Luffy then told him that needing help is not a sign of weakness, and without his friends, he would be helpless, but he would be the one who could defeat Arlong. Arlong attempted to bite off Luffy's head, but he took out a chunk of the pillar behind him. Luffy continued to mock him and he took up two swords to fight with, but Arlong effortlessly took them away. Annoyed with his antics, Arlong was caught off guard when Luffy delivered a powerful blow which shatters his teeth."}, {"type": "paragraph", "text": "Within seconds, his teeth regrew and using this, he pulled his teeth out to create hand-held castanet weapons for each hand. When he went to attack Luffy again, he used one of his crew as a human shield taking the blow. This upset Arlong further at his dirty tactics. Luffy broke his teeth out again and stole one of his castanet teeth to use against him. Arlong hit Luffy in his side with the remaining weapon as Luffy retaliated by stuffing his own teeth in his mouth to use as a weapon and bite down on his neck."}, {"type": "paragraph", "text": "Arlong stated that the power of the bite did not come from the teeth but from the jaw muscles as he bit through Luffy's arm. Luffy freed himself by slamming him to the ground, releasing his hold on his arm. Arlong then took to the water to fight, gaining the advantage of speed. Launching himself like a torpedo, his attack's increasing speed was able to break through all solid objects. Luffy was able to catch him and critically injured him with a powerful kick to his stomach. Arlong snapped and his eyes changed, resembling that of a Sea King before it attacks. Seeing that direct attacks would not work on Luffy, Arlong decided to use the giant saw sword, Kiribachi."}, {"type": "paragraph", "text": "Swinging the Kiribachi to attack Luffy, Luffy retreated to a room on the top floor of the Arlong Park building, making Arlong commented that Luffy had no place to run. Luffy noticed and commented that the room was filled with papers. Arlong told him they were not just any papers and the room was where Nami was used to draw maps. Arlong further acknowledged Nami's talents and told Luffy that Nami was his friend. Luffy then responded by telling Arlong that Nami is the Straw Hats' navigator. In turn, Arlong told Luffy that Nami's talent would be wasted by being with them. Arlong kept declaring that Nami would continue to draw maps for his world domination and he would use her better than Luffy could ever do so himself. Luffy, enraged from hearing Arlong's words, crushed one of the teeth from the Kiribachi, causing Arlong to hesitate."}, {"type": "paragraph", "text": "Arlong continued by telling Luffy that Nami got all she needed by being with the Arlong Pirates and she would forever remain his tool or rather his \"friend\". Luffy, upon hearing this statement, began to destroy the room. Arlong got angry, saying that Luffy was destroying his ambitions along with the room. Luffy and Arlong continued to battle and Luffy told Arlong that the only thing he understood was that he needed to help Nami. With that being said, Luffy commented that he could not let that room exist and he would destroy it all. Using the full power of his attack Gomu Gomu no Ono, Luffy managed to send the full force of Arlong's attack, Shark On Teeth, through to the bottom of Arlong Park, destroying the building in the process and defeating the fish-man. As the battle concluded, Arlong lied buried in the rubble."}, {"type": "paragraph", "text": "Later, Arlong and the rest of his crew were arrested by the Marines. Hatchan, the most benevolent of them, was the only one to escape, while it is unknown where the rest of them are being held. His defeat echoed through the ranks of other fish-men who were colleagues or associates of his."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/79/Arlong_Picks_Luffy_Up.png/revision/latest/scale-to-width-down/210?cb=20121210024418", "caption": "Arlong about to throw Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Arlong_Tries_to_Kill_Luffy.png/revision/latest/scale-to-width-down/210?cb=20121121110914", "caption": "Arlong draws his Kiribachi on Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/30/Arlong_Lies_Defeated.png/revision/latest/scale-to-width-down/210?cb=20140831215328", "caption": "Arlong is finally defeated by Luffy."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sun Pirates vs. Marines (numerous times at sea)", "elements": []}, {"text": "Sun Pirates vs. Marines (Foolshout Island)", "elements": []}, {"text": "Arlong vs. Vice Admiral Borsalino", "elements": []}, {"text": "Arlong vs. Jinbe", "elements": []}, {"text": "Arlong vs. Bell-mère", "elements": []}, {"text": "Arlong vs. Genzo", "elements": []}, {"text": "Arlong vs. Usopp", "elements": []}, {"text": "Arlong vs. Monkey D. Luffy", "elements": []}, {"text": "Arlong vs. Sanji and Roronoa Zoro", "elements": []}, {"text": "Arlong vs. Roronoa Zoro", "elements": []}, {"text": "Arlong vs. Monkey D. Luffy (Second time)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Arlong, Jinbe, and other Fish-Man District citizens vs. Fisher Tiger", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Arlong's brutality was censored in the 4Kids dub, as seen when he threatened to imprison Bell-mère instead of murdering her for not paying her tribute. He does not offer to spare everyone except the other Straw Hats if Nami rejoins, or threaten to kill everyone in Cocoyashi if she leaves. During the climax of the battle, scenes of him slamming Nami's head against a desk for drawing a picture of Bell-mère instead of a map, and threatening to kill someone from Cocoyashi Village if she disobeyed him, as well as Luffy destroying the maps, are removed."}, {"type": "paragraph", "text": "He was also given a gargly sound to his voice in the 4Kids dub, and he refers to humans as \"Pew-mans\"."}, {"type": "paragraph", "text": "Much of the blood Arlong gave and received from Luffy during the fight had to also be removed so it could comply with TV standards."}, {"type": "paragraph", "text": "In the FUNimation dub, Arlong's dialogue was made much more believable and accurate to the original translation. However, Arlong's unique laugh \"Shahahaha\" is not kept."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b9/Arlong_Sends_Bell-m%C3%A8re_to_a_Dungeon_in_the_4Kids_Dub.png/revision/latest/scale-to-width-down/210?cb=20140814211809", "caption": "In the 4kids version, Arlong sends Bell-mère to a dungeon."}]}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Arlong has so far appeared in just a few series of merchandise. He has been featured in the CharaColleCan, Anichara Heroes, One Piece Amazing Log Collection, One Piece DeQue, One Piece Imagination Figure, Gashapon Full Color Collection From TV Animation One Piece, Super Deformed World Series and in World Collectable."}, {"type": "paragraph", "text": "He is further set to appear this year in One Piece Styling Figures and in both the Portrait of Pirates and the Figuarts Zero line."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/30/Arlong_dx_figure.png/revision/latest/scale-to-width-down/180?cb=20130217114408", "caption": "Arlong in World Collectable."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In a panel containing a small flashback scene of Hatchan's, Arlong's silhouette is seen alongside Hatchan's, Kuroobi's, and Chew's as they look upon Sabaody Park in a distance from the water.", "elements": []}, {"text": "In the 4th Japanese fan poll, Arlong is ranked the 48th most popular character in One Piece.", "elements": []}, {"text": "According to One Piece 10th Treasures, Arlong's hat costs 100,000.", "elements": []}, {"text": "Arlong is the only known individual to have been released from Impel Down.", "elements": []}, {"text": "Shark on Tooth is similar to the way the cookiecutter shark spins fast in a circular direction to latch off a piece of flesh from their prey.", "elements": []}, {"text": "Arlong's favorite food is roasted cow.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ushanka – Wikipedia article about type of hat Arlong wears.", "elements": []}, {"text": "Sawshark – Wikipedia article about the type of fish Arlong is.", "elements": []}]}], "images": []}]}