{"sections": [{"title": "Centaurs", "level": 1, "content": [{"type": "paragraph", "text": "Centaurs are a race of artificial creatures that lived on Punk Hazard, and were originally humans who got animal parts due to Trafalgar Law's Devil Fruit ability. They once constituted Caesar Clown's army before his capture by the Straw Hat Pirates."}], "images": []}, {"title": "Appearances", "level": 2, "content": [{"type": "paragraph", "text": "Centaurs seem to have different variations, not following the ancient Greek and Roman myths of being half horse from the waist down, but instead having the lower half being any kind of animal. Some like Smooge follow the traditional myths by being a horse centaur."}], "images": []}, {"title": "Other artificial creatures of Punk Hazard", "level": 2, "content": [{"type": "paragraph", "text": "Besides centaurs, there were other modified humans in Punk Hazard. They include satyrs and a harpy."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Formation", "level": 3, "content": [{"type": "paragraph", "text": "Almost all the current centaurs were originally full human pirates who got caught by Marines and deported to Punk Hazard as Vegapunk and Caesar Clown's test subjects."}, {"type": "paragraph", "text": "Due to the first explosion of Caesar's experiment on H2S gas of four years prior the present, they lost the use of their lower bodies. When Trafalgar Law arrived on the island, he used his Devil Fruit ability to give them new legs, creating the centaur army for Caesar."}, {"type": "paragraph", "text": "Exceptions are constituted by Brownbeard and his crew, who lost their lower bodies use due to their fight against Basil Hawkins."}], "images": []}, {"title": "Disbandment", "level": 3, "content": [{"type": "paragraph", "text": "After Caesar was defeated and captured by the Straw Hat Pirates and Law, the centaurs who were petrified by Caesar's new H2S gas experiment were saved by their comrades, and were all arrested by G-5. However, one centaur was apparently captured by the Big Mom Pirates and imprisoned in Big Mom's book of rare creatures via Mont-d'Or's Devil Fruit powers."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Franky used a technique called \"Franky Centaur\".", "elements": []}, {"text": "A carriage driver and a General Zombie at Thriller Bark were centaurs.", "elements": []}, {"text": "Just before meeting the real centaurs, Luffy used Kin'emon's lower body to make up a fake-centaur.", "elements": []}, {"text": "While in Wano Country, Law used his powers to turn one of Basil Hawkins' men into a lizard centaur.", "elements": []}, {"text": "Speed uses her SMILE Devil Fruit abilities to take on the appearance of a centaur.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/15/Zombie_Carriage_Drivers.png/revision/latest/scale-to-width-down/180?cb=20180717114521", "caption": "The zombie centaur (right)."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 67 Chapter 661 (p. 2-11) and Episode 586, The Centaur Patrol Unit attack the Straw Hats at the lake.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 67 Chapter 664 (p. 11-15) and Episode 589, Brownbeard explains to the Straw Hats how the centaurs and satyrs came to be.", "elements": []}, {"text": "↑  One Piece Anime — Episode 622.", "elements": []}, {"text": "↑  One Piece Anime — Episode 624.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 847 (p. 6) and Episode 567.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 67 Chapter 657 (p. 2) and Episode 581.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 918 (p. 9, 15) and Episodes 906–908.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Centaurs – Wikipedia article about Centaurs", "elements": []}, {"text": "Satyrs – Wikipedia article about Satyrs", "elements": []}]}], "images": []}]}