{"sections": [{"title": "Nugire Yainu", "level": 1, "content": [{"type": "paragraph", "text": "Nugire Yainu was the shipwright of the Black Cat Pirates and the crew member who was killed three years prior to Luffy's visit to Syrup Village by the Marines."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yainu has a square-shaped face with small, round glasses with his black hair combed back neatly. He wears a red shirt with his crew's jolly roger on the front, with regular pants and shoes."}, {"type": "paragraph", "text": "He was given the captain's jacket to wear, which was black with red interior and the crew's symbol on the shoulder pads when he was handed over to the Marines. Overall, Yainu has a passing resemblance to his captain, Kuro, to the point where the Marines were not able to tell the difference."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Nugire_Yainu%27s_Outfit_Before_Hypnotized.png/revision/latest/scale-to-width-down/210?cb=20131003020341", "caption": "Nugire Yainu's outfit before he was hypnotized."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little was known about Yainu’s personality, but, like most members of the Black Cat Pirates, he most likely didn’t care much for the well-being of innocent citizens. He was shown to be feeble-minded enough to fall victim to Jango’s hypnotism."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Yainu was the shipwright of the crew, and as such, he was responsible for repairing and maintaining the Bezan Black. In the anime, he was seen wielding a standard cutlass for battle."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Three years prior to the start of the series, when Kuro had decided to give up on his life as a pirate due to the constant assaults by the Marines, Jango saw Yainu to be a perfect sacrificial lamb for Kuro's plan. Because Yainu bore a passing resemblance to his captain, he was hypnotized by Jango into believing he was Kuro, and was captured by Morgan, the only member of a Marine crew to survive Kuro's wrath. Morgan was also hypnotized to believe that Yainu was Kuro. Yainu was then brought to the Shells Town Marine Base and executed under the name of Captain Kuro of a Hundred Plans, thus freeing the real Black Cat captain of his unwanted pirate life."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is an anagram of \"Nureginu Iya\" (濡れ衣いや, \"Nureginu Iya\"), which means \"[I] do not like a false charge\". Ironically, a 'false charge' is technically how he met his end.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  https://twitter.com/translatosaurus/status/1180540544805552129", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 5 Chapter 37 and Episode 10, Nugire Yainu makes his debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Nugire Yainu's name and occupation revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Nugire Yainu's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 5 Chapter 37 and Episode 15, Jango hypnotizes Nugire Yainu to believe he was Kuro.", "elements": []}]}], "images": []}]}