{"sections": [{"title": "Kuroobi", "level": 1, "content": [{"type": "paragraph", "text": "Kuroobi is a ray fish-man, an officer of the Arlong Pirates, and a former member of the Sun Pirates. He is one of the major antagonists of the Arlong Park Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kuroobi has the typical appearance of a martial artist with a dark blue gi, a black belt, and his hair is tied into a straight ponytail. His Sun Pirates tattoo is on the right side of his chest. Whether this tattoo does or does not cover a slave mark is currently unknown."}, {"type": "paragraph", "text": "Fifteen years ago, when he was part of the Sun Pirates, his hair was afro-like."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kuroobi is one of the strictest members in his crew and has always been wary of Nami's supposed allegiance to Arlong."}, {"type": "paragraph", "text": "Kuroobi’s attitude is similar to his captain as he loathes all humans but does not share Arlong's care for Nami and he dislikes and distrusts the navigator. He even searched her room for evidence he could use against her."}, {"type": "paragraph", "text": "Kuroobi does have respect for other people's strength as seen with Arlong though he did complement Sanji's strength saying he is above \"average human\" but still mocked the cook for throwing his life away for one girl. Kuroobi is very cruel and unforgiving, as he sliced up Genzo for protecting Bell-mere and for trying to rescue Nami and later, he mocked Sanji, saying he was too \"weak\" to protect Nami and his friends (though Sanji proved this wrong by defeating him)."}, {"type": "paragraph", "text": "Kuroobi will take every advantage he can get in battle. During the Arlong Park battle, he punched Sanji through a wall when the latter was not focusing on the fight and tried to attack a weakened Zoro from behind. Kuroobi took advantage of Sanji’s attempt to save Luffy by diving into the sea and promptly tortured the cook underwater, due to his fish-man-enhanced ability while submerged. When Sanji turned the battle around by beating the karate fish-man to a pulp, Kuroobi was so furious he could not see straight, cursing the cook before being taken out. "}, {"type": "paragraph", "text": "Like many other characters he has a unique laugh, being \"Kuhahahahaha\""}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a fish-man, Kuroobi possesses great strength. As one of Arlong's direct subordinates, he holds great authority over his crew."}], "images": []}, {"title": "Fish-Man Karate", "level": 3, "content": [{"type": "paragraph", "text": "Kuroobi practices Fish-Man Karate to fight his opponents. He is a level 40 practitioner of this martial art, causing great injury to Sanji in their battle. As a fish-man, Kuroobi has an advantage underwater. Kuroobi states his ultimate technique is Senmaigawara Seiken but it is unknown actually how strong this punch is, as Sanji beat Kuroobi into submission before Kuroobi actually executed the move."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is also an adept swordsman. Eight years ago, when Arlong was about to kill Bell-mère and abduct Nami, Kuroobi blocked the bullets from Genzo and swiftly slashed his body with a cutlass."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Kuroobi, Chew, and Hatchan planned to open a takoyaki store when they were younger. At some point, they had given up this dream to become members of the Arlong Pirates. After Fisher Tiger attacked Mary Geoise and formed the Sun Pirates, the Arlong Pirates integrated with Tiger's crew. During their time roaming the Grand Line, the Sun Pirates battled numerous Marines. One day a former human slave named Koala boarded their ship to return to her home in Foolshout Island. After returning her to her home, the Sun Pirates were ambushed by the Marines. They lost their ship and Tiger was badly wounded during the battle. Tiger soon died from his wounds and Arlong was later captured. Kuroobi was then under the command of Jinbe. One day, Jinbe received an invitation to join the Shichibukai. After Jinbe accepted the position, Arlong was released."}, {"type": "paragraph", "text": "When the Sun Pirates split up, Kuroobi went with Arlong's crew. The Arlong Pirates then head for East Blue. At the arrival of the Arlong Pirates to Conomi Island, Kuroobi was following orders of his captain, Arlong, by wreaking havoc in the island and raiding its towns. The Arlong Pirates then took over Nami's village, killing Bell-mère in the process. During the the raid in Nami's house, he was the one who cut Genzo, giving him the scars he has in the present time."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Kuroobi_Sun_Pirates_Portrait.png/revision/latest/scale-to-width-down/180?cb=20190805170241", "caption": "Kuroobi as a member of the Sun Pirates."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Arlong Park Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Arlong Pirates briefly had Zoro imprisoned until Nami freed him when they weren't looking. After Chew dragged Usopp to Arlong Park, Kuroobi questioned Nami's loyalty. showing everybody a map to the village from her room, Nami was angry he took her belongings. After Nami supposedly stabbed Usopp and pushed him into the pool where they thought he drowned, Kuroobi apologized to Nami for doubting her."}, {"type": "paragraph", "text": "As one of Arlong's officers, Kuroobi aids Chew and Hachi in defeating the contingent of Marines from Naval Base 77."}, {"type": "paragraph", "text": "During the battle with the Straw Hats at Arlong Park, he fights against Sanji. After a strong blow from Kuroobi that he announced was fish-men Karate, Sanji could only smirk and laugh. He told Kuroobi his attacks were nothing compared to Zeff's kicks. Kuroobi nearly defeats him when the cook headed underwater to save Luffy. During the battle, Kuroobi taunts Sanji about his chivalry saying he won't be able to protect his \"girlfriend\" (Nami) and rest of his friends, stating to the drowning Sanji that he will \"kill all of them\". Sanji manages to force Kuroobi up to dry land by blowing air into his gills."}, {"type": "paragraph", "text": "Once out of water, Sanji yells to Kuroobi \"Get your ass up here , I want to fight were I can breathe\" but Kuroobi was confident he could still beat Sanji even on land. But having enraged the cook with his taunts, Sanji promptly beat Kuroobi into submission with his kicks, not giving the fish-man any time to counter attack. Ultimately ending with Sanji kicking Kuroobi into and through Arlong Park, where he laid defeated on the other side of the building."}, {"type": "paragraph", "text": "Kuroobi was later arrested along with the entire crew, though his fellow crewmember Hatchan later escaped."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e2/Collier.png/revision/latest/scale-to-width-down/210?cb=20130121041205", "caption": "Kuroobi being beaten by Sanji."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sun Pirates vs. Marines (numerous times at sea)", "elements": []}, {"text": "Sun Pirates vs. Marines (Foolshout Island)", "elements": []}, {"text": "Kuroobi vs. Genzo", "elements": []}, {"text": "Kuroobi, Chew and Hatchan vs. Marine 77th Branch", "elements": []}, {"text": "Kuroobi vs. Sanji", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kuroobi (黒帯, Kuroobi) means \"black belt\".", "elements": []}, {"text": "Kuroobi was the only fish-man in the Arlong Pirates who distrusted and disliked Nami. His suspicions were proven true when Nami refused to join Arlong again when he requested.", "elements": []}, {"text": "Kuroobi was the first fish-man martial artist shown in One Piece, the second being Jinbe.", "elements": []}, {"text": "Kuroobi's favorite food is shrimp sashimi.", "elements": []}]}], "images": []}]}