{"sections": [{"title": "Chew", "level": 1, "content": [{"type": "paragraph", "text": "Chew is a smelt-whiting fish-man and an officer of the Arlong Pirates. He is also a former member of the Sun Pirates. He is one of the major antagonists of the Arlong Park Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chew is muscular, blue skinned, and has thick lips."}, {"type": "paragraph", "text": "His Arlong Pirates tattoo is seen on his right shoulder. He wears a necklace, a striped blue vest, dark-brown leather pants, and sandals."}, {"type": "paragraph", "text": "While he was with the Sun Pirates, he wore a dark colored t-shirt with a circle on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Chew is one of the more cool-headed officers in Arlong's crew."}, {"type": "paragraph", "text": "Like Arlong and the rest of his crew, he strongly looks down on humans, seeing them as inferior. Unfortunately, his arrogant personality caused him to underestimate Usopp when he chased him down, causing him to lose his temper and ultimately lose to him."}, {"type": "paragraph", "text": "He has a habit of finishing his sentences by saying Chu (チュウ, Chu)"}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a fish-man, Chew is at least ten times stronger than an average human. He can spit water out of his mouth as if it were a bullet. He can also suck in a large amount of water and cause a great amount of damage with his Mizu Taiho. He later fights with the apparently-outmatched Usopp, but he is ultimately beaten after Usopp wears him down by running away and setting him on fire, before repeatedly hitting him over his head with his Usopp Hammer and Usopp Wagomu to knock him out. He was also seen wielding a pair of katana during his time when the Sun Pirates stole a Marine battleship after their own ship was sunk."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Mizudeppo (水鉄砲, Mizu-deppō, literally meaning \"Water Gun\"): Chew spits a shot of water from his mouth at such speed and pressure that it has the same affect on his opponent as being shot by a pistol. This is called Water Gun (and sometimes Lip-o-Blaster) in the Viz Manga and Squirt Gun in the FUNimation dub. It is unnamed in the 4Kids dub.", "elements": [{"text": "Hyappatsu Mizudeppo (百発水鉄砲, Hyappatsu Mizu-deppō, literally meaning \"Hundred-Shot Water Gun\"): Chew fires many shots of Mizudeppo at his target, but more rapidly, like a machine gun. This is called Lipowertzer in the Viz Manga, Spitfire Soaker in the 4Kids dub, and Squirt Machine Gun in the FUNimation dub.", "elements": []}]}]}, {"type": "list", "elements": [{"text": "Mizu Taiho (水大砲, Mizu Taihō, literally meaning \"Water Cannon\"): Chew sucks up so much water that it causes his body to expand like a balloon. He then spits it all at once in one big shot that explodes like a cannonball on impact. This is called Lip-o-Cannon in the Viz Manga and Squirt Cannon in the FUNimation dub. In the 4Kids dub, it is unnamed.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In their younger years, Chew, Hatchan, and Kuroobi planned to open a takoyaki store. At some point, they had given up this dream to become members of the Arlong Pirates. After Fisher Tiger attacked Mary Geoise and formed the Sun Pirates, the Arlong Pirates integrated with Tiger's crew. During their time roaming the Grand Line, the Sun Pirates battled numerous Marines. One day a former human slave named Koala boarded their ship to return to her home in Foolshout Island. After returning her to her home, the Sun Pirates were ambushed by the Marines. They lost their ship and Tiger was badly wounded during the battle. Tiger soon died from his wounds and Arlong was later captured. Chew was then under the command of Jinbe. One day, Jinbe received an invitation to join the Shichibukai. Chew suggested taking an opportunity to make an infamous name for themselves, but Jinbe told the crew that he was thinking about accepting the government's offer. After Jinbe accepted the position, Arlong was released."}, {"type": "paragraph", "text": "When the Sun Pirates split up, Chew went with Arlong's crew. The Arlong Pirates then head for East Blue. The Arlong Pirates then took over Nami's village, killing Bell-mère in the process."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Chew_Sun_Pirates_Portrait.png/revision/latest/scale-to-width-down/180?cb=20190805170213", "caption": "Chew as a Sun Pirate."}]}, {"title": "Arlong Park Arc", "level": 3, "content": [], "images": []}, {"title": "Destruction of Arlong Park", "level": 4, "content": [{"type": "paragraph", "text": "Usopp, Zoro, and Johnny arrive at Conomi Islands to find Nami. The Arlong Pirates briefly had Zoro imprisoned until Nami frees him when they were not looking. After Usopp angers Arlong, Chew finds Usopp and drags him back to Arlong Park. Nami proved her loyalty by supposedly stabbing Usopp and drowning him in the pool. As one of Arlong's officers, Chew aids Hachi and Kuroobi in defeating the contingent of Marines from the 77th Branch."}, {"type": "paragraph", "text": "When Luffy and his crew appear at Arlong Park to defeat the Arlong Pirates, Chew challenges Usopp, who runs away in terror. When Chew threatens the villagers, however, Usopp declares that he is Chew's opponent, and attacks him with his Kaen Boshi. When Chew turns to fight him, Usopp runs again. The ensuing fight is shown partially off panel; when Sanji and Zoro have finished their own fights, Usopp is seen lying in what appears to be a pool of blood, later revealed to be ketchup. Chew begins to leave, believing he has won."}, {"type": "paragraph", "text": "Usopp plans to lie to the crew about his battle, but becomes ashamed of his own cowardice, and once again challenges Chew. Chew easily deflects Usopp's next Kaen Boshi attack and punches Usopp, pinning him down. Usopp then strikes Chew's leg with his hammer, then uses Usopp Wagomu to distract Chew while he hides in the woods. Chew attacks by blasting the trees with water projectiles. Eventually Usopp defeats Chew by throwing a bottle of highly-alcoholic sake, using his Namari Boshi to break the bottle and splatter Chew's body with alcohol, and then igniting the liquid with his Kaen Boshi. Chew attempts to flee to the water to put the flames out, but Usopp completely defeats him by whacking him in the head with his hammer and rubber band until he passes out."}, {"type": "paragraph", "text": "He was eventually arrested by the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/52/Usopp_Defeats_Chew.png/revision/latest/scale-to-width-down/230?cb=20131020072503", "caption": "Chew defeated by Usopp."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sun Pirates vs. Marines (numerous times at sea)", "elements": []}, {"text": "Sun Pirates vs. Marines (Foolshout Island)", "elements": []}, {"text": "Chew, Hatchan and Kuroobi vs. Marine 77th Branch", "elements": []}, {"text": "Chew vs. Usopp", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "His name was written in the One Piece Red data book as \"Chew\". However it is common for fans to say the similar Japanese word 'Chuu'. In the English versions, his name is spelt as \"Choo\"."}, {"type": "paragraph", "text": "In both the Japanese version and the FUNimation dub, Chew has a habit of saying \"chu\" (an onomatopoeic kissing-noise) after each sentence. In the Viz Manga, \"chu\" is translated as \"smeck\". In the 4Kids dub, he does not add any kissing-noises to the ends of his sentences."}, {"type": "paragraph", "text": "In the 4Kids dub, the alcohol that Usopp throws at Chuu and later uses for his pyro tech-tics was changed to Oil. FUNimation made it Sake, while in the Viz Manga it was wine."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Chew.png/revision/latest/scale-to-width-down/120?cb=20080925081826", "caption": "Chew's name by Oda."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The origin of his fish-man species comes from kisu (鱚, kisu \"smelt-whiting\") and kiss (キス, kisu).", "elements": []}, {"text": "His ability to spit water at a distance mimics the archerfish's water spitting ability.", "elements": []}, {"text": "Chew was the first opponent Usopp defeated without the aid of anyone else. This happened a second time with Perona.", "elements": []}, {"text": "Chew, like Hatchan, is not shown directly hurting Nami or the villagers, unlike Arlong and Kuroobi, though Chew was prepared to kill the villagers he found spectating the battle but fortunately was stopped by Usopp.", "elements": []}, {"text": "Chew's favorite food is clam miso soup.", "elements": []}]}], "images": []}]}