{"sections": [{"title": "Hatchan", "level": 1, "content": [{"type": "paragraph", "text": "Hatchan, nicknamed \"Hachi\" (ハチ, Hachi) by most characters, is an octopus fish-man, a former officer of the Arlong Pirates, and a member of the Sun Pirates before that."}, {"type": "paragraph", "text": "After the rest of the Arlong Pirates were arrested, Hatchan was the sole escapee, and underwent many adventures which ended in him opening a floating takoyaki restaurant and meeting up again with the Straw Hat Pirates."}, {"type": "paragraph", "text": "He was one of the major antagonists of the Arlong Park Arc. He also is the central character from Hatchan's Sea-Floor Stroll Cover Page Serial. Later, along with Camie, he is one of the main supporting characters for both the Sabaody Archipelago and Fish-Man Island Arcs as an ally of the Straw Hat Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hatchan, being an octopus fish-man, has eight appendages (six arms and two legs) and an octopus-like face. He has pink skin and grey hair styled with five spikes (although this number increased by the time he had become a takoyaki salesman due to him growing a second row of spikes). He has a muscular build and has suction cups on his six arms, which he can use to cling on to walls. Hatchan has a tattoo in the shape of a sun on his forehead, which is to represent that he was a part of the Sun Pirates."}, {"type": "paragraph", "text": "While most fish-men have webbed hands, octopus fish-men and women do not, as neither Hatchan nor Octopako have webbed hands."}, {"type": "paragraph", "text": "When first arriving at Cocoyasi Village, Hatchan wore a diamond-checkered outfit. In the Arlong Arc, he wore a striped outfit."}, {"type": "paragraph", "text": "Hatchan usually wears heavy clothing and shirts made especially for octopus fish-men. During the Sabaody Arc, he wore a jacket to cover his four extra arms and a bandage to cover his tattoo to prevent him from being captured and sold at the Human Auctioning House."}, {"type": "paragraph", "text": "When the Straw Hats arrive at Fish-Man Island, Hatchan wears a shirt from the Criminal brand."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hatchan is not very intelligent and can be easily duped, such as when he failed to recognize who Roronoa Zoro really was, and mistakenly begins to introduce himself while asking other people their names. He initially fails to understand Zoro's words during his battle about the difference in \"weight\" between their swords (he assumed Zoro meant weight as in \"heavy\", but Zoro was referring to weight as in \"burden\"). In his fight against Zoro, he made many misjudgments and even at some points allowed himself to get angry, which partly contributed to his defeat."}, {"type": "paragraph", "text": "By the time he meets the Straw Hats again near Sabaody Archipelago, his personality seems to have changed. He seems to be significantly more intelligent and very knowledgeable about the Sabaody Archipelago, but it's likely because he's quite familiar with it (though he did think Duval and Sanji looked the same, and was still easily tricked by Sanji into revealing his true identity), and wisely cautions Luffy against provoking the World Nobles in spite of their cruelty."}, {"type": "paragraph", "text": "He has also become very ashamed for what he and the Arlong Pirates did to Nami and her village and is genuinely sorry for what he did. Since then he has tried to atone for all of his past sins."}, {"type": "paragraph", "text": "Hatchan is also rather humble in comparison to other fish-men, often accepting that things are how they are and not wanting to upset others."}, {"type": "paragraph", "text": "He seemed to respect Arlong as a friend, going as far to support his ambitions, since he willingly joined his crew, a band of fish-men who hate humans, despite Hatchan himself not particularly despising or discriminating against humans."}, {"type": "paragraph", "text": "Hatchan is extremely kind and caring, as he frequently protected Camie and Pappag from being abducted by the Macro Pirates. During his time as a member of the Sun Pirates, he also restrained Arlong when he violently assaulted Koala out of annoyance. Hatchan also readily helped a town of catfish who were suffering from a famine by selling all his newly acquired treasure to buy cooking equipment and ingredients to feed them. Due to his kindness, Hatchan recognizes humans by their character instead of their race as during his childhood, he saved Rayleigh from drowning in a shipwreck, becoming close friends with him and his wife Shakuyaku ever since. While he supported Arlong as his crewmate, Hatchan personally never engaged in any sort of cruel abuse towards the people of Cocoyasi Village like the rest of the Arlong Pirates, and even Nami vouched that Hatchan was the better one of the Arlong Pirates and that they should save him."}, {"type": "paragraph", "text": "Hatchan's childhood dream was to be accepted into the human society and he admitted that Arlong's tyranny was going too far. Unlike Kuroobi and Chew, Hatchan alone was not corrupted by Arlong's ideals. After Luffy accepted Hatchan as a friend, he outright opposes Arlong's ideals much to Hody Jones' disappointment."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Sun Pirates and Arlong Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Hatchan is good friends with Chew and Kuroobi, having known them since childhood, a time when they all shared a dream to open a takoyaki stand. He befriended a former slave named Koala. Hatchan kindly reminded her that she was no longer a slave and that she did not need to clean floors like a servant. Like many members of the Sun Pirates, Hatchan cried over Tiger's death."}, {"type": "paragraph", "text": "Hatchan was also very loyal to Arlong since he had been his crewmate even before Fisher Tiger formed the Sun Pirates. After the Sun Pirates separate into smaller fractions, Hatchan went with Arlong's crew."}, {"type": "paragraph", "text": "He was formerly friends with Macro, Gyaro, and Tansui of the Macro Pirates, having known Macro from his times as a Sun Pirate, until he destroyed their ship for supposedly selling him a fake map."}, {"type": "paragraph", "text": "Jinbe also showed concern over Hatchan's well-being, despite the former Shichibukai feeling guilty releasing the Arlong Pirates into East Blue."}], "images": []}, {"title": "Camie and Pappag", "level": 4, "content": [{"type": "paragraph", "text": "Since his escape from a prison ship, he has also befriended Camie, the mermaid and Pappag, the starfish and runs a Takoyaki stand with them. Since then he is very close towards the two. Both Camie and Pappag care for Hatchan's well being, such as when he was shot by Charlos, Camie was horrified and desperately tried to help him, while Pappag tended to Hatchan with Chopper."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/ff/Hatchan%2C_Camie_and_Pappug_Working_Together.png/revision/latest/scale-to-width-down/210?cb=20130209210505", "caption": "Hatchan with Pappag and Camie."}]}, {"title": "Rayleigh and Shakky", "level": 4, "content": [{"type": "paragraph", "text": "He is also well acquainted with Silvers Rayleigh whom he saved from a shipwreck as a child. Since then, the two were on good terms, though they fell out of contact after Hatchan joined Fisher Tiger's Sun Pirates. Hatchan knew Shakuyaku for twenty-two years, but they have not spoken to each other for twelve years before the current storyline. Hatchan treasured his friendship with the pair as he would tell the young children of the Fish-Man District about his association with humans who were accepting of him."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Hatchan was originally an enemy of the Straw Hats when they fought against Arlong for Nami's sake. During that time, he bore a grudge against Zoro for tricking him, and volunteered to fight him himself. The newer members of the crew (Chopper, Franky, Robin and Brook), are unaware of what happened, though, until Usopp explained it. He managed to befriend the Straw Hat Pirates after they saved him while he was held hostage by the Flying Fish Riders, despite being one of their old enemies. After that, Hatchan has been on friendly terms with them, serving them takoyaki and guiding them throughout Saboady Archipelago. At first, Nami stated that she had not forgiven him but later saw that Hatchan was honestly trying to atone for what happened. Luffy called Hatchan a friend and protected him from one of the World Nobles. After this, any lingering animosity the crew had towards him has all but vanished after he helped them. While the Straw Hats were scattered all over the world for two years, Hatchan helped protect the Thousand Sunny until he was too injured to continue. During an argument with Hody Jones, Hatchan mentioned that Luffy called him a friend and explained that he could not bring himself to face him as long as Hody followed Arlong's legacy."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "While a member of the Sun Pirates, Hatchan fought against the marines when they were after Fisher Tiger's head for assaulting Mary Geoise. After the fall of the Arlong Pirates, Hachi was arrested alongside the crew, and was to be sent to prison. However, he alone managed to escape the Marines' ship."}], "images": []}, {"title": "Macro Pirates", "level": 4, "content": [{"type": "paragraph", "text": "The Macro Fish-Men Pirates also harbor a grudge against him for destroying their ship and saving Camie. The Macro Pirates would attempt to kidnap Camie time and time again only to have their plans foiled by Hatchan."}], "images": []}, {"title": "New Fish-Man Pirates and Flying Pirates", "level": 4, "content": [{"type": "paragraph", "text": "He made enemies with the New Fish-Man Pirates for siding with humans and with the Flying Pirates since they ally themselves with the New Fish-Man Pirates. Hody Jones and the other fish-men who follow Arlong's ideals all lost respect for Hatchan, as they believed his friendship with humans to be disgraceful. With Hatchan unable to sway Hody Jones, Vander Decken IX used him for a demonstration of his \"curse\". Hatchan on the other hand, much like Jinbe, is well aware that Hody Jones through his ideals and methods is in fact even more dangerous and insane than Arlong ever was."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Hatchan can shoot streams of ink from his mouth like a true octopus in order to blind the enemy, and to assist his combat style by striking down the enemies while they cannot see. He also covered himself with it in the failed attempt to conceal his identity from the Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/13/Takohachi_Black.png/revision/latest/scale-to-width-down/210?cb=20130422232253", "caption": "Hatchan spitting out ink."}]}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Hatchan has massive amount of strength, being one of the top members of the Sun Pirates and an officer of the Arlong Pirates. He easily defeated the Macro Pirates, who were fish-men themselves, single-handedly and sending them flying with a three armed punches. His strength allows him to easily wield six extremely heavy cutlasses, each weighing over 300 kg while maintaining speed. He was the only one of the entire Arlong Pirates to escape the Marines' prison convoy. He is also aware of the existence of Haki, but admits that he knows very little about it."}, {"type": "paragraph", "text": "As a fish-man, Hatchan is an expert swimmer. Even as a child, he managed to save Rayleigh from drowning at sea during a shipwreck. Even after being seriously injured during timeskip, that it required him to use crutches, Hatchan still displayed great swimming prowess, being able to swim a considerably far distance before being struck down by the barrage of arrows that Decken sent at him after he marked Hatchan as his target. Even when brutally pierced by Decken's arrows in a heavily injured state, Hatchan still managed to swim back to Fish-Man Island to warn the Straw Hats of Hody's invasion."}, {"type": "paragraph", "text": "Hatchan seems to have incredible endurance as he was able to survive getting slashed by Zoro's three swords and Sanji's kick. Both are great deeds especially since Hatchan also got up sooner than any of the other fish-man after getting beaten by Zoro. However, during both times, he was at the advantage as Zoro had been badly injured by Mihawk, and Sanji's kick was under water, reducing his power and speed. Even when seriously injured, he was the only fish-man from the Arlong Pirates to escape. Even after being assaulted by Decken, having been pierced by several arrows and losing a lot of blood, he still survived and was able to swim to the surface and later warn Sanji and Chopper of Hody and Decken's plans."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Hatchan is a highly skilled swordsman and a master of the Rokutoryu. As an Octopus Fish-Man with six arms, Hatchan can simultaneously wield six swords with great dexterity and versatility. He has stated that he is the number two swordsman in all of Fish-Man Island. Hyouzou stated that if Arlong did not have a \"tight-wallet\", he would not have settled for Hatchan. If he was still the second strongest swordsman on Fish-Man Island during the Fish-Man Island Arc, then he would become the new strongest swordsman on Fish-Man Island when the Energy Steroids made Hyouzou's body old and weak. Even Zoro had trouble when he fought him and barely won (though he was greatly limited by the wound he sustained from Mihawk). Using Rokutoryu, Hatchan could cut down members of the Flying Fish Riders while they are flying in mid air. For two years, Hatchan could fend off the Marines to protect the Thousand Sunny with Duval, the other members of the Rosy Life Riders, and Bartholomew Kuma."}, {"type": "paragraph", "text": "In the anime, he was able to create a tornado by flailing his swords wildly, similar to Zoro's Tatsumaki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Each of his swords is a cutlass that weighs over 300 kg (661.387 lbs), totaling to over 2 tons worth of metal, which is far more than a normal human's limit."}, {"type": "paragraph", "text": "During his adventures, Hatchan was given a golden trident by the Goldfish Princess for returning her ring. He showed proficiency in its usage by defeating a sea monster that was chasing a Seaboar."}], "images": []}, {"title": "Culinary Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Hatchan is a highly skilled chef, having once roasted an entire pig to feed the Sea Cow Momoo. He is particularly masterful in cooking takoyaki, with his takoyaki being deeply appreciated by the Straw Hat Pirates including Sanji, a master chef. Hatchan cooks takoyaki with great speed and dexterity. With his six arms, he could make large numbers of takoyaki to feed the Straw Hats, particularly Luffy, who has an enormous appetite."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early life", "level": 4, "content": [{"type": "paragraph", "text": "Hatchan was friends with Chew and Kuroobi since childhood, and they dreamed of opening a Takoyaki stand. Hatchan was with Arlong, Chew, and Kuroobi when they saw the Sabaody Ferris Wheel."}, {"type": "paragraph", "text": "At one point during his childhood, Hatchan saved Silvers Rayleigh from drowning in a shipwreck. Some time after Gold Lion Shiki's escape from Impel Down, Hatchan visited Shakky's bar. Shakky offered Hatchan a drink when he found Rayleigh reading a newspaper about Shiki's escape."}, {"type": "paragraph", "text": "When he grew older, he joined the Arlong Pirates, which was basically a group who bullied the islanders for siding with Otohime's speech of promoting inter-species relationship. After Fisher Tiger attacked Mary Geoise, became an enemy of the World Government, and formed the Sun Pirates, the Arlong Pirates integrated with Tiger's crew."}, {"type": "paragraph", "text": "During his time as a Sun Pirate, he befriended Macro and worked his way up the crew. Hatchan's main contribution to the Sun Pirates was to alert the crew of enemy ships. The Sun Pirates later visited an island where a former slave of Mary Geoise named Koala resided. The inhabitants there had no way of returning the girl to her homeland so they asked the Sun Pirates to take her. Hatchan befriended Koala and tried to encourage her to stop cleaning floors like a servant."}, {"type": "paragraph", "text": "Eventually, the Sun Pirates returned Koala to her home, Foolshout Island. However, not long after Koala returned to her family, the Sun Pirates were ambushed by marines led by Rear Admiral Strawberry. In the ensuing battle, Fisher Tiger was badly wounded and the Sun Pirates lost their ship, having to use a captured marine ship to escape. On board the stolen marine ship, the Sun Pirates tried to save Tiger's life with a blood transfusion using human blood, but Tiger firmly refused the transfusion. When Fisher Tiger died, Hatchan grieved over his death."}, {"type": "paragraph", "text": "After Arlong was captured trying to avenge Fisher Tiger, Hatchan found himself under the command of Jinbe. One day, Jinbe received an invitation to join the Shichibukai. After Jinbe accepted the position, Arlong was released much to the joy of Hatchan. When the Sun Pirates split up, Hatchan went with Arlong's crew, though looking back with some apparent reluctance."}], "images": []}, {"title": "Service Under Arlong", "level": 4, "content": [{"type": "paragraph", "text": "Hatchan became an officer and the caretaker of Momoo, the Sea Cow of the Arlong Pirates. Originally, Arlong wanted to take Hyouzou into the crew as his swordsman, but could not afford his price and settled on Hatchan instead."}, {"type": "paragraph", "text": "The Arlong Pirates then headed for East Blue and invaded Conomi Island, immediately subjugating Cocoyasi Village. After Arlong killed Bell-mère, Hatchan went into her house and found a map. Nami charged at him, telling him that it was her map, which she drew herself, and demanded it back. Arlong read the map and was amazed at her talent and ordered Hatchan to bring her with them. Hatchan grabbed Nami and went to where Arlong Park would stand."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d9/Hatchan_And_Arlong_Pirates.png/revision/latest/scale-to-width-down/250?cb=20130217120548", "caption": "Hatchan as a member of the Arlong Pirates."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Arlong Park Arc", "level": 4, "content": [{"type": "paragraph", "text": "Ten years later, Hatchan was shown making a comment on how Nezumi's mouse face made him laugh, which Arlong scolded him for. Hatchan then went on to escort Nezumi out of Arlong Park in his Octopus Pot."}, {"type": "paragraph", "text": "Later, he was seen again after Arlong went to Cocoyasi Village. He was alone cooking a giant boar for Momoo. He called out for him with his mouth as a horn, but Momoo did not come. Zoro, who was in Arlong Park, noted the call and found Hatchan. Unknown to Hatchan, Zoro had recently struck down his crewmates. Thinking Zoro was a guest, Hatchan escorted him to Cocoyasi to find Arlong."}, {"type": "paragraph", "text": "Hatchan went back to Arlong Park and met Arlong, who had returned and angrily asked where he had been. Hatchan saw many of his comrades injured, prompting him to swear revenge. However, when Kuroobi asked him if he had seen someone like Zoro, Hatchan started to describe the guest's appearance, finally realizing the guest's true identity, much to his comrades' chagrin. He then started to explain himself that he believed Zoro to be one of Arlong's guests like Nezumi."}, {"type": "paragraph", "text": "Later, a Marine squad from Branch 77 under Commodore Pudding Pudding came to rescue the Goza citizens, but wrongfully decided to attack Arlong Park. Chew, Kuroobi, and Hatchan went to handle them. Hatchan's job was to move a cliff under the Marine ship, which passed over it with tremendous speed (thanks to Kuroobi), causing a maelstrom that sank the ship."}, {"type": "paragraph", "text": "After Nezumi took Nami's money,Monkey D. Luffy broke down the gates of Arlong Park together with Usopp, Sanji, and Zoro (whom Hatchan immediately recognized). Once again, he called forth Momoo, only to find it with a giant bump on its head and a severe fear of Luffy and Sanji (whom had previously beaten it). After it had been defeated with the rest of the crew, save for Arlong, Hatchan, Chew, and Kuroobi, the fish-men prepared to fight the Straw Hats."}, {"type": "paragraph", "text": "Hatchan started off the fight by firing a jet spray of ink at Luffy (who had stuck himself in order to defeat the lesser fish-men), before slamming a piece of debris at him, only for Sanji to destroy it with a single kick. As he attempted another debris throw, Zoro taunted him into a fight, leaving Luffy, Sanji, and Usopp to the others."}, {"type": "paragraph", "text": "After Luffy was thrown into the ocean by Arlong, Hatchan squared off against Zoro. He had the advantage at first due to Zoro's previous injuries from Dracule Mihawk, making Zoro unable to fight at full strength. Zoro charged at Hatchan, cutting his hair after the fish-man ducked from the incoming blow. After an unsuccessful attempt at catching Zoro's sword, Hatchan clung himself to the roof of Arlong Park, intending to stall Zoro, making it difficult to rescue Luffy. However, Zoro soon collapsed due to his wound, prompting Hatchan to rapidly punch the pillar he stuck himself to in an attempt to crush Zoro beneath it. However, Zoro responded by throwing Hatchan beneath the crumbling structure, before collapsing once again."}, {"type": "paragraph", "text": "Hatchan then emerged from the rubble, now wielding six swords for his Six-Sword Style in order to vanquish Zoro for humiliating him. However, Zoro was undaunted and asked Johnny and Yosaku to lend him their swords in order to use his Santoryu."}, {"type": "paragraph", "text": "Johnny and Yosaku threw their swords towards Zoro but because of his increasing fever, he was unable to move to catch them. At this moment, Hatchan attempted to cut Zoro into pieces with his Six-Sword Style, but Zoro reversed it with his Tou Rou Nagashi, repelling all of Hatchan's swords, whilst cutting the fish-man's abdomen."}, {"type": "paragraph", "text": "Enraged, Hatchan tried to explain that his six swords automatically outrank Zoro's three swords. However, Zoro responded by saying that his swords are heavier than Hatchan's. Not understanding what Zoro meant, Hatchan performed a pot-stance attack on Zoro, who blocked it, until Hatchan released the swords from their stance, allowing him to land a devastating headbutt to Zoro's chest, re-opening the wound from Mihawk."}, {"type": "paragraph", "text": "While Zoro was in the air, Hatchan started spinning his blades, in an attempt to grind Zoro into pieces once he came in contact with them. However, Zoro managed to masterfully evade every single blade, whilst cutting the fish-man's hands. Enraged, the fish-man attempted the pot-stance again, but it was repelled by Zoro's Oni Giri, which destroyed all of his swords. Smiling, Zoro asked Hatchan if he knew what he meant when he said that his swords were heavier than Hatchan's."}, {"type": "paragraph", "text": "In one last attempt to defeat Zoro, Hatchan tried to punch Zoro into submission, but this was stopped by Zoro's \"Tatsu Maki\", which sent him flying. Defeated, Hatchan wondered how three swords could beat six swords, before slamming into the ground."}, {"type": "paragraph", "text": "However, after Kuroobi and Chew were defeated by Sanji and Usopp respectively, Hatchan arose from his place of defeat as Luffy was receiving recovery. However, Hatchan's intention was not to defeat Zoro, but to kill Luffy and those who were on the ocean bed."}, {"type": "paragraph", "text": "At the bottom of the sea, Hatchan encountered Sanji and Nojiko. In a last-ditch effort to stop them, Hatchan tried to punch Sanji with his multiple arms, but Nojiko swam in the way of the punches. However, before he could do any harm, his wounds re-opened, just like Zoro predicted, allowing Sanji to release Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/Zoro_vs._Hatchan.png/revision/latest/scale-to-width-down/240?cb=20190328224742", "caption": "Hatchan vs. Roronoa Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Hatchan_Defeated.png/revision/latest/scale-to-width-down/210?cb=20121210014251", "caption": "Hatchan sent flying by Zoro's Tatsu Maki."}]}, {"title": "Hatchan's Sea-Floor Stroll", "level": 3, "content": [{"type": "paragraph", "text": "Shortly after Arlong's defeat, Hatchan was brought on a Marine prison ship. He escaped and decided to go home to Fish-Man Island. He initially did some simple good deeds, including removing a hook from a panda shark, giving food (which was given in gratitude by the panda shark he rescued earlier) to a stranded islander, and finding a ring for the Goldfish Princess. Gaining a trident from the goldfish kingdom, he used it to stab a monster attempting to eat a sea boar."}, {"type": "paragraph", "text": "After saving the boar, it unexpectedly spit out a mermaid named Camie and a starfish named Pappag, whom Hatchan befriended with little problem. However, he later betrayed Camie when the Macro Pirates gave him a map to help him find the artifacts needed to create his most prized talent: takoyaki. Unfortunately, the map merely directed Hatchan to the octo-creature Mash, whom he defeated but helped him in no way towards making his takoyaki."}, {"type": "paragraph", "text": "Feeling betrayed by the Macro Pirates and soon encountering a saddened Pappag still wanting Camie back, Hatchan attacked their ship and reunited the starfish and mermaid. When he returned to the creature, he discovered that the creature helped him after all: under his shell (which opens like a lid) was a massive jar of the best takoyaki-cooking sauce."}, {"type": "paragraph", "text": "Taking the creature, the sauce, and a ton of treasure stolen from the Macro Pirates, Hatchan continued his journey until he arrived at a town of catfish, ruined and desolate and particularly hungry. Hoping to help them out, Hatchan sold off all his treasure for cooking equipment and a cart, using it to create enough takoyaki not just to help the catfish but to propose to Octopako. Octopako turned him down, but the catfish were grateful and in love with the takoyaki created by Hatchan."}, {"type": "paragraph", "text": "While originally dejected by his initial failure, but with some encouragement from Camie, his original dreams and a new ship built in gratitude by the catfish let Hatchan decide to stay true to himself. In the end, he decided to open up a new floating takoyaki stand Takoyaki 8, with the mermaid and starfish occasionally helping on support."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Hatchan%27s_Sea-Floor_Stroll.png/revision/latest/scale-to-width-down/210?cb=20180711030522", "caption": "Hatchan meets Camie and Pappag."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Hatchan was being held as a hostage by the Macro gang and Flying Fish Riders. Upon hearing that the Straw Hat Pirates are coming with Camie for a rescue, he panicked, fearing that the crew, particularly Nami, would still hold a grudge against him."}, {"type": "paragraph", "text": "The Straw Hat crew rescued him, without realizing who it was they are trying to rescue, though Zoro, Sanji and Nami have made references on how he seems to be familiar. Upon reaching him, Hatchan attempted to conceal his identity by coating himself with his ink. Unfortunately, his voice was recognized by Zoro along with his silhouette and even Nami found him suspicious. Sanji tricked the fish-man into admitting his identity by asking him about Arlong. When the Straw Hats found out that he's the Hatchi that served Arlong, they changed their mind about rescuing him (Hatchan actually encourages this, warning the crew it is a trap and that they should leave him) but Nami decides to rescue Hatchi because he's harmless and they already made a promise with Camie."}, {"type": "paragraph", "text": "After being freed by Zoro, Hatchan effortlessly punches Macro and his crewmates away from the island, before finally (sort of) reconciling with Zoro (whom had just moments ago saved Hatchan, Camie and Pappag from an incoming Flying Fish Rider). Later, he would aid in the fight against the Flying Fish Riders using his Rokutou, mainly protecting Brook and Zoro while they were recuperating (Zoro from his earlier wounds from Kuma, and Brook whom had worn himself out by running on the water for too long), before the pair returned the favor."}, {"type": "paragraph", "text": "Later, when Duval had let his Fish Riders throw Sanji in the sea, Hatchan was quick to stop both Luffy and Zoro from jumping in after him, claiming that he could catch up with them (as he is a fish-man), but Duval soon stopped him from doing anything by saying that the Flying Fish are even faster than fish-men underwater, which would mean that Hatchan would never catch Sanji in time before it was too late. Nonetheless, Camie helped Sanji from his trap, resulting in Duval receiving an extreme facial makeover."}, {"type": "paragraph", "text": "As the Straw-Hats, Hatchan, Camie and Pappag left Duval's ruined base, the latter trio rewarded the Straw-Hats with the takoyaki Camie had promised them earlier. Even though the situation got a little tense when Hatchan asked Nami how it was, she replied that even though she had not forgiven the fish-man, she found the takoyaki tasty, which was more than good enough for him."}, {"type": "paragraph", "text": "He accompanies them to Sabaody Park, a place Camie had always wanted to visit. Hatchan and the group decided to enjoy the many rides and attractions the park offered enjoying themselves. He helped the Straw Hats find a coating mechanic to coat the Thousand Sunny with resin from the Yarukiman Mangrove so that the ship may sail underwater. Hatchan claimed to know a mechanic in the Sabaody Archipelago that he would trust with his life and has promised to take the Straw Hats to that mechanic, in exchange for the Straw-Hats to not to defy the World Nobles."}, {"type": "paragraph", "text": "Camie was then later revealed to be missing and so Hatchan, Pappag and the Straw-Hats all met up at the Human Auction at Grove Number 1 so they could save her by buying her off the slave auction. However, the World Noble Saint Charlos bought her for 500,000,000, crushing any hopes of rescuing Camie that way."}, {"type": "paragraph", "text": "As fate would have it, Luffy and Zoro crashed through the door of the Auction House, and Luffy, seeing Camie, decided to rescue her. Hatchan, however, did not want Luffy to do anything rash, and tried to stop him, accidentally revealing himself as a fish-man, due to him trying to restrain Luffy with his remaining arms. At that moment, he was shot by Saint Charlos, who believed that he could take Hatchan as an additional slave for free."}, {"type": "paragraph", "text": "As Luffy advanced towards Charlos in anger, Hatchan attempted to stop Luffy from harming the World Noble, claiming that as he had been a pirate, this was exactly what he had deserved. He also added that all he wanted to do was to make up for what his former crew had done to Nami these past eight years, and apologized for not being unable to screw things up, which moves Nami to tears. However, his pleas went on deaf ears, as Luffy ruthlessly punched the World Noble in the face before the Noble could silence Hatchan."}, {"type": "paragraph", "text": "Afterwards, he was seen recovering in Rayleigh's house, and promised to lead the Straw Hats to Fish-Man Island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Hatchan_Tied_Up.png/revision/latest/scale-to-width-down/210?cb=20130521210359", "caption": "Hatchan captured."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Hatchan_vs._Flying_Fish_Riders.png/revision/latest/scale-to-width-down/210?cb=20130406085449", "caption": "Hatchan battles the Flying Fish Riders."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Enjoyment_at_Sabaody_Park.png/revision/latest/scale-to-width-down/240?cb=20130622012536", "caption": "Hatchan and his companions enjoying Sabaody Park."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/54/Hatchan_Shot.png/revision/latest/scale-to-width-down/240?cb=20100815142016", "caption": "Hatchan shot by Saint Charlos."}]}, {"title": "Post War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Hatchan was seen again on the Thousand Sunny with Camie, Pappag, Shakky, and the Rosy Life Riders. Hatchan discussed with Camie and Pappag about the places on Fish-Man Island that the Straw Hats should visit. His suggestion was the Fish-Man Karate Dojo."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the Straw Hats' separation, the Marines located the Thousand Sunny and attempted to destroy it. Hatchan, Duval, the Rosy-Life Riders, and Bartholomew Kuma fought a great battle against the Marines in an effort to protect the Thousand Sunny. Hatchan and Duval sustained serious injuries and were forced to retire, leaving Kuma to guard the ship. Before the Straw Hats reunite, Hatchan returned to the Fish-Man District at Fish-Man Island to recover from his injuries."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Hatchan appeared at Noah and attempted to talk the New Fish-Man Pirates out of attacking Fish-Man Island and destroying the current regime. Hody Jones expressed his disappointment in him, who he thought had fallen so far from Arlong's ideals, which he still believed in."}, {"type": "paragraph", "text": "Vander Decken IX then revealed his cursed abilities, which allow him to hit anyone from anywhere with a throwing projectile (such as the dagger he threw over Hatchan's shoulder, which turned around and stabbed the octopus fish-man's back) even when he deliberately misses. Decken then got a load of arrows and prepared for another demonstration of his ability. Hatchan ran for his life from a swarm of thrown arrows and dived into the water only to discover that it was pointless. He got pierced by the arrows but remained conscious long enough to reach Coral Hill and warn Chopper and Sanji of the upcoming attack."}, {"type": "paragraph", "text": "He then received medical treatment from Chopper while the doctor and Sanji were met with accusations from the Fish-Man Island citizens for mermaid kidnappings. Hatchan refused to tell Chopper and Sanji about who was responsible for his wounds and kept telling them to leave Fish-Man Island. While hovering above Coral Hill on top of Megalo, Luffy spotted them and jumped down to meet them."}, {"type": "paragraph", "text": "After Megalo spit out Shirahoshi, the Fish-Man Island citizens stated that this was a Mermaid Princess kidnapping. The citizens then tied up Hatchan and his friends. Their celebration was interrupted by the arrival of Vander Decken IX. After Luffy pummeled Decken and Wadatsumi, Hatchan and the group headed towards the Sea Forest on top of Megalo."}, {"type": "paragraph", "text": "They soon reached the Sea Forest where the group got acquainted with Franky, Den, and Jinbe. Jinbe was surprised to see Hatchan, who was supposed to be captured with the Arlong Pirates. Nami and Camie soon arrived bearing terrible news about Hody Jones' rampage in the Ryugu Palace. As Camie went to Hatchan's side, Jinbe decided to explain the situation as quickly as he could. Hatchan then listened to Jinbe with a worried look as the former Shichibukai revealed that he himself was the one responsible for allowing Arlong to run wild in the East Blue."}, {"type": "paragraph", "text": "While having conversation with Jinbe, Nami explained that she noticed that Sabaody Park resembled Arlong Park. Hatchan stated his regret for Arlong's brutality and said that ever since he and Arlong were kids, they wanted to be part of the human world. Hatchan went on explaining the humans' continued hatred towards fish-men and some history such as Fish-Man Island becoming a member of the World Government and the beginning of the Great Pirate Era. When Hatchan finished, Jinbe proceeded to explain the ideals of Queen Otohime and Fisher Tiger."}, {"type": "paragraph", "text": "After Jinbe finished his story, Hatchan was overjoyed to hear Nami saying that she forgave Jinbe and that she does not hate fish-men kind as a whole. Hatchan began explaining Hody's plans but was interrupted when a visual Den Den Mushi appeared and broadcasted Hody Jones' speech."}, {"type": "paragraph", "text": "After Hody explained his plan of creating the new Ryugu Kingdom, which included executing King Neptune, Shirahoshi was about to go back with Megalo, but Jinbe stopped her. Hatchan also told the princess not to go since Hody was using Neptune as a hostage to safeguard against her ability to summon Sea Kings."}, {"type": "paragraph", "text": "While Luffy and Jinbe argued over how they should deal with Hody, Sanji asked Hatchan if Hody was the one who gave him his wounds, but Hatchan did not give a straight answer. Jinbe came up with a plan that would make Luffy look like a hero instead of a villain. When Jinbe explained his plan, Hatchan and Camie agreed with Jinbe."}, {"type": "paragraph", "text": "Hatchan, Camie, and Den remained in the Sea Forest as Jinbe and the Straw Hats battled against the New Fish-Man Pirates."}, {"type": "paragraph", "text": "After the battle for Fish-Man Island ended, Hatchan, Den, and Camie were shocked to see Sea Kings bringing Noah to the Sea Forest. Hatchan was later seen attending the banquet at Ryugu Palace with the Straw Hats."}, {"type": "paragraph", "text": "After the celebrations were over, he was seen with Camie and Pappag, bidding the Straw Hat Pirates farewell. Hatchan proclaimed that he would help repair the Candy Factory before the pirates sailed away from Fish-Man Island."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Hatchan_Tries_to_Reason_with_Hody.png/revision/latest/scale-to-width-down/210?cb=20130217120700", "caption": "An injured Hatchan trying to reason with Hody Jones."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Hatchan%2C_Keimi_and_Pappug_Saying_Goodbye_to_the_Straw_Hats.png/revision/latest/scale-to-width-down/210?cb=20140722072707", "caption": "Hatchan, Camie, and Pappag bidding the Straw Hats farewell."}]}, {"title": "One Piece: Stampede", "level": 3, "content": [{"type": "paragraph", "text": "Hatchan and Camie were present at the Pirates Expo, selling their takoyaki. After the Marines tried to enact a Buster Call on the Expo, Hatchan and Camie successfully escaped and took Ann aboard their ship from the Revolutionary Army."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sun Pirates vs. Marines (numerous times at sea)", "elements": []}, {"text": "Sun Pirates vs. Marines (Foolshout Island)", "elements": []}, {"text": "Hatchan, Chew and Kuroobi vs. Marine 77th Branch", "elements": []}, {"text": "Hatchan vs. Roronoa Zoro", "elements": []}, {"text": "Hatchan vs. Macro Pirates (several times)", "elements": []}, {"text": "Hatchan and Straw Hat Pirates vs. Flying Fish Riders and Macro Pirates", "elements": []}, {"text": "Hatchan and Duval vs. Marines (unseen)", "elements": []}, {"text": "Hatchan vs. Vander Decken IX", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces was revealed in an early concept of the Arlong Pirates that Hatchan would have originally been a squid fishwoman. Her name was supposed to be Maple Read (メイプル・リード, Meipuru Rīdo)."}, {"type": "paragraph", "text": "Also, in Buggy's original crew there was a messenger bird named Hatchan. This character was scrapped and its name later became Hatchan's nickname."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9f/Early_Arlong_Pirates.png/revision/latest/scale-to-width-down/210?cb=20150404102027", "caption": "Early concept of the Arlong Pirates from One Piece Green."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name came from Hachi (八), the Japanese word for \"eight\"; the number of limbs an octopus has.", "elements": []}, {"text": "Despite being an octopus fish-man, Hachi sells takoyaki, which is fried octopus covered in batter. However this is not all that surprising as octopus are known to be cannibalistic.", "elements": []}, {"text": "Hatchan's name is quite strange. In the Japanese language, chan is a diminutive suffix, added to the end of someone's name, giving it the meaning of \"cute\" or \"little\". However, Hatchan insists that his name is Hatchan and that Hachi is just a nickname. When questioned on this, Oda replied that the chan is similar to the last name of \"Chan\" common in Chinese, rather than the suffix -chan. He is the one of two characters to have a Japanese honorific problem with the word \"Chan\" in the name, the other being Sadi whose name caused confusion for the Marines.", "elements": []}, {"text": "Hatchan's favorite foods are takoyaki and takoyaki rice crackers.", "elements": []}]}], "images": []}]}