{"sections": [{"title": "Rockstar", "level": 1, "content": [{"type": "paragraph", "text": "Rockstar is a member of the Red Hair Pirates, being relatively new in the crew two years ago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rockstar is a fairly tall and burly man with dark skin and a red liberty-spikes-like hairstyle. He wears a colorful attire composed of a dark-purple, double-breasted coat (with buttons similar to Magellan's), left open on his chest to reveal a light-orange, wide-collared shirt, and a red foulard around his neck. He has a yellow sash tied around his waist, that instead of hanging only on one side, like seen on most of the other pirates, hangs down on both sides. He wears light-blue pants and brown boots and carries around a green-hilted saber, hanging on his left hip from a belt he has over the right shoulder."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Rockstar_Anime_Concept_Art.png/revision/latest/scale-to-width-down/135?cb=20180930233440", "caption": "Rockstar concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "A confident man, Rockstar demonstrates a great sense of pride. When he was insulted by Whitebeard's men, he wanted to fight them because they had damaged his honor. He also tried to use the strength of his captain to back up the importance of the letter he delivered to Whitebeard. He seems very loyal to his captain, sticking up for him in front of Whitebeard."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Even though little is known about him, it can be assumed he is quite powerful since he has a 94,000,000 bounty. However, he is still considered to be a rookie within his crew."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Like most of Shanks' crew members, little is known about him. However he claimed to have once been a famous and big-time pirate."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Shanks sent him to deliver a message to Whitebeard, which the pirate captain promptly ripped up, going along with Shanks' prediction anyway. Whitebeard was also insulted by the fact that Shanks did not talk to him in person and instead sent a newcomer from his crew. Even so, Rockstar wanted to fight Whitebeard to reclaim his honor, but Shanks told him it was not a big deal and to pull back."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Shanks arrives on Whitebeard's ship, there is a scene in the manga of Lucky Roo, Benn Beckman and Yasopp with Rockstar visible in the background."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Rockstar and members of the Red Hair Pirates were seen attending a wedding at the ruins of a certain island."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In One Piece: Grand Battle 3, Rockstar is seen being sent to deliver a message to Luffy's home town. He is also called 'Chibi' by Benn Beckman and was seen sweeping the snow on their ship. He was sent by his captain to deliver a message to Whitebeard. Unfortunately, he misunderstood his captain's orders and took it to the wrong Whitebeard.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 234 (p. 10) and Episode 151, Rockstar is seen and formally introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 203), Rockstar's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 234 (p. 10) and Episode 151, Rockstar's bounty is revealed in his infobox.", "elements": []}, {"text": "↑  Eternal Log, Rockstar's wanted poster is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 234 (p. 10-14) and Episode 151, Rockstar's reaction to the Whitebeard pirates.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 434 and Episode 316, Shanks' visit to Whitebeard.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 83 Chapter 838, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 25.", "elements": []}]}], "images": []}]}