{"sections": [{"title": "Monkey D. Dragon", "level": 1, "content": [{"type": "paragraph", "text": "Monkey D. Dragon, commonly known as \"Dragon the Revolutionary\", is the infamous Supreme Commander (総司令官, Sōshireikan) of the Revolutionary Army who has been attempting to overthrow the World Government. He is the World Government's greatest enemy, considered to be the most dangerous, most wanted man in the world."}, {"type": "paragraph", "text": "He is the father of Monkey D. Luffy and the son of Monkey D. Garp."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dragon is a tall middle-aged man with spiky black hair with a widow's peak and a tattoo on the left side of his face, which is colored dark red in the anime and bright red in the manga. He has a bit of stubble on his chin. He is usually dressed in a long green cloak (colored black in the manga), underneath which he wears the garb of a revolutionary, colored white in the anime and orange in the manga. He is most often seen sporting a grin. Only on rare occasions, such as at Roger's execution, has Dragon not been seen smiling."}, {"type": "paragraph", "text": "22 years before the start of the series, at Gol D. Roger's execution, Dragon did not have his tattoo or his stubble on his face."}, {"type": "paragraph", "text": "After the timeskip, Dragon's hair has grown slightly longer - reaching down his back past his shoulders."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Dragon's personality is mostly unknown due to the many mysteries that are surrounding him, save for an apparent love for freedom and a belief in fate, traits of a \"D\". Despite this, he is completely serious about his crusade, warning his subordinates that the conflict against the World Government will be protracted and arduous."}, {"type": "paragraph", "text": "Unlike the members of his family, Dragon has a stern demeanor. However, he is often seen with a confident grin on his face."}, {"type": "paragraph", "text": "Dragon bears strong concern for common people and dedicatedly fights against the World Government's oppression towards them, as shown when he rescued the denizens of the Gray Terminal and offered them a position in the Revolutionary Army."}, {"type": "paragraph", "text": "Dragon is a strong devoter of freedom and liberalism, having formed the Revolutionary Army for the main purpose of overthrowing the World Government and their tyrannical oppression of the innocent. He is also a righteous, trustworthy, and compassionate man, as he sympathized with Sabo's plight and was silently enraged at Jalmack for trying to kill Sabo for his unreasonable arrogance."}, {"type": "paragraph", "text": "Dragon is completely fearless in the pursuit of his ideas as he is willing to oppose even the most powerful enemies such as the World Nobles as he intended to declare war on them."}, {"type": "paragraph", "text": "He speaks as though he is a mystic and apparently does not like to speak of, or be asked about, his past. He also has a habit of always looking towards the East Blue when the wind changes. His revolutionary comrade Emporio Ivankov speculates that this is because he has family in the East Blue."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Revolutionaries", "level": 3, "content": [{"type": "paragraph", "text": "The Revolutionaries show him respect and follow his orders to liberate islands under oppression. After the Marineford war, they were relieved to find out that their mysterious leader is, in fact, a \"human\" when they heard that he is the father of Luffy and son of Garp. This shows that the Revolutionaries are loyal to Dragon since no one deserted him due to the learning of his heritage."}], "images": []}, {"title": "Emporio Ivankov", "level": 4, "content": [{"type": "paragraph", "text": "Emporio Ivankov is one of Dragon's comrades and one of the commanders of his revolutionary army. Ivankov apparently understands Dragon's habit of looking at the direction of East Blue whenever the winds blow, as though he is homesick. However, Ivankov had no knowledge of Dragon's family until after he met Luffy years later, which led the commander to protect him at all cost. It is unknown how Dragon met Ivankov."}, {"type": "paragraph", "text": "Following the end of the Battle of Marineford, Dragon contacted his subordinate and they caught up. Ivankov remarked on Dragon's family ties being revealed while Dragon expressed surprise that Ivankov protected his son and sounded grateful to him."}, {"type": "paragraph", "text": "After the Blackbeard Pirates destroyed Baltigo, Dragon and the other revolutionaries are allowed by Ivankov to relocate to Momoiro Island. They are still on good terms with Ivankov remarking on Luffy's raise in infamy and comparing it to Dragon, something he takes in stride."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Dragon_and_Ivankov.png/revision/latest/scale-to-width-down/220?cb=20130224085632", "caption": "Dragon speaking to Ivankov at the HQ."}]}, {"title": "Bartholomew Kuma", "level": 4, "content": [{"type": "paragraph", "text": "Bartholomew Kuma was once a member of Dragon's crew and the Revolutionary Army, as shown in a flashback when Dragon rescued the people of the Gray Terminal in the Goa Kingdom. His relationship with Dragon is still a mystery, though he knew that Luffy is Dragon's son, a fact that even Ivankov did not know until he met Luffy at Impel Down. Though Kuma was working with the Revolutionary Army in secret as a Shichibukai, his final modification into a full Pacifista placed him fully under the World Government's control. Dragon is seemingly aware of Kuma's deal with the Marines."}], "images": []}, {"title": "Sabo", "level": 4, "content": [{"type": "paragraph", "text": "Dragon's hatred of the nobles does not seem to include Sabo. In fact, Dragon was shocked to hear the boy's shame of being born a noble, and listened to what he had to say. Following the boy's confession to the plot, Dragon and the Revolutionary Army rescued the citizens of the Gray Terminal. He later saved Sabo's life after the latter's boat was shot and burned down by a World Noble. Because Sabo lost his memories of Luffy and Ace after this incident, Dragon was not aware that Sabo was a sworn brother to his son while Sabo was unaware of Dragon being Luffy's father. When Sabo refused to return to his family, Dragon allowed him to join the Revolutionary Army, and later personally trained Sabo himself until Sabo became his second-in-command."}, {"type": "paragraph", "text": "However, due to Sabo regaining his memories during the aftermath of the Marineford War, Dragon was made aware of the relationship between Sabo and his son. In return, Sabo was made aware that Dragon was Luffy's father."}, {"type": "paragraph", "text": "Sabo refers to Dragon as \"Dragon-san\" and appears to be loyal to him and is trusted enough to lead the Revolutionary Army's investigation of Dressrosa's weapons trade. He also granted Sabo permission to obtain and consume Ace's Mera Mera no Mi. Upon Sabo's return to Baltigo following his mission to Dressrosa, Sabo personally informed Dragon about how Luffy was doing during his report."}, {"type": "paragraph", "text": "Dragon also appeared to be concerned for Sabo's safety after a recent incident regarding him at Levely was revealed in the newspaper."}], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Dragon is the son of the famous Vice-Admiral Monkey D. Garp. No direct interaction has been seen between the two. However, Garp was casual about telling Luffy about Dragon's criminal status, even picking his nose while saying this. He even laughed when he realized he should not be telling people that kind of information. There appears to be some sort of understanding between the two, as Garp was aware that the reason Dragon was in Loguetown was to see Luffy set off for the Grand Line. When Dragon's connection to Garp was revealed to his army, he was unfazed by it since it put his men at ease that he was human."}, {"type": "paragraph", "text": "It is clear that both Garp and Dragon have different assessments of the East Blue. While Garp perceives it as a rather peaceful place, Dragon expresses his disgust with Garp's view of \"peace\" since it was nothing more than a form of oppression authorized by the law in places, such as Tequila Wolf and the Goa Kingdom, evidently forcing common people to inhabit horrible living conditions."}, {"type": "paragraph", "text": "Ultimately, Dragon has an extremely different ideology from his father. While Garp takes pride and contentment in being a marine serving the World Government, Dragon absolutely despised the World Government to the point of becoming a revolutionary and seeking to overthrow them. Despite this, the two at least share the same mutual hatred and disdain towards the World Nobles."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Luffy is Dragon's son. Like his own father, Garp, he seems to hold high expectations for Luffy. Although he has yet to formally introduce himself to Luffy, Dragon appears to support his son's actions thus far. He appeared in Loguetown to see Luffy off to the Grand Line  and stopped Smoker from capturing him, showing that he cares for his son's well-being, though he did not seem to have participated in raising Luffy himself. Even after his men learned of their connection, Dragon just casually confirmed it."}, {"type": "paragraph", "text": "Dragon also appears to be incredibly proud of his son because of all the trouble Luffy has been causing for the World Government and looks forward to the day they would meet face to face. His unusual habit of standing in the wind and facing East Blue (where he had left Luffy), apparently means that he misses his son. When he was informed about Luffy's second intrusion in Marineford, he decided to focus on his own goals, thinking that Luffy was old enough to take care of himself."}, {"type": "paragraph", "text": "It appears that he keeps up with the news of his son as shown when Sabo informed him of Luffy's progression after the Dressrosa incident. As the news of the Straw Hats' accomplishment at Dressrosa spread throughout the world, Dragon was seen looking at the new bounty poster of his son. He also kept up with the news of Luffy's exploits in Totto Land."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/Ace%2C_Dragon%2C_Garp%2C_and_Luffy_on_Newspaper.png/revision/latest/scale-to-width-down/180?cb=20130822031753", "caption": "Dragon appears on the news about Luffy's return."}]}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Nico Robin", "level": 4, "content": [{"type": "paragraph", "text": "10 years before the Battle of Marineford, Dragon had ordered his men to locate the sole surviving Archaeologist of Ohara, Nico Robin who became known as the \"Light of the Revolution\" among the Revolutionaries. Though his exact reasons for doing so remain unknown, it is known that he wanted to meet Robin for a long time (even before she became a member of his son's crew). After the Revolutionaries liberated Nico Robin from Tequila Wolf after she was sent there by Kuma, Robin decided to meet with Dragon after receiving Luffy's message to wait 2 years in the newspaper. During those 2 years, Nico Robin became acquainted with Dragon and the other Revolutionaries like Sabo and Koala. Dragon shows some concern about Robin's well-being as he asked Koala about Robin after the Revolutionaries had returned from their mission to Dressrosa, due to rumors that she had been captured on Sabaody."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Due to the fact that he is the leader and main center of the largest anti-government organization in the world, Dragon has been dubbed the most-dangerous and the most-wanted man in the world by the World Government. As Robin has said, many people and organizations (especially pirates) try to steer clear of disrupting the World Government and drawing attention to themselves."}, {"type": "paragraph", "text": "However, the organization led by Dragon does the exact opposite. Although many people call him a revolutionary, the World Government feels that his ideals and goals can collapse the strength and justice of the World Government. So far, it seems the World Government is the only known enemy of Dragon. Regardless, just being the son of Dragon is enough to make Luffy a target for \"justice\"."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "The Marines being the World Government's primary military force have much disdain for Dragon and his ideals, especially Akainu for unknown reasons. Sakazuki was also one of the only people who (before Sengoku made it public) was aware that Luffy is Dragon's son and that Dragon is the son of Garp. It is unknown if that was simply common knowledge amongst high ranking Marines or not. However, the marine soldiers were very shocked when they learned Straw Hat Luffy's father was none other than the Revolutionary Dragon and prioritized his elimination as a threat. Smoker, then-captain of Loguetown's base, was surprised to see Dragon there, and even more confused and angry when Dragon saved Luffy from capture; it was not until the Battle of Marineford that Smoker fully understood why Dragon intervened, at that point, he saw Luffy as an even more potent threat than ever."}], "images": []}, {"title": "Nobles", "level": 4, "content": [{"type": "paragraph", "text": "Dragon seems to hold much hatred towards the Goa nobles for destroying the Gray Terminal and he saved the residents of the junkyard as an act of defiance to the nobles who tried to kill them. Dragon's hatred of the nobles does not seem to include Sabo. In fact, Dragon was shocked to hear the boy's shame of being born a noble and listened to what he had to say."}], "images": []}, {"title": "World Nobles", "level": 4, "content": [{"type": "paragraph", "text": "Dragon completely despises the World Nobles for their immense tyranny and cruel oppression of civilians. After saving Sabo from the wreckage caused by Saint Jalmack, Dragon was furious at the latter's actions. Dragon fully intended to declare war on the World Nobles during the Levely, showing that he is not afraid to openly oppose them despite their privilege of summoning Marine Admirals for protection."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "It is unknown if Dragon knew that Portgas D. Ace was the son of Gol D. Roger prior to Sengoku making it public to the world, or if he was aware of Ace's adoption into the family (though his subordinate Kuma did know). However, Ace was aware that Dragon is Luffy's father (before it was announced to the world by Sengoku)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the leader of the Revolutionaries, he has full control of the organization and the World Government has dubbed him as the \"World's Most Wanted Man\". Political powers aside, it is currently unknown how strong Dragon really is, but there have been some hints that Dragon is extremely powerful."}, {"type": "paragraph", "text": "After Luffy tells Emporio Ivankov that Ace is his brother, the okama queen greatly fears the possibility of the World Government warring against Dragon along with Whitebeard."}, {"type": "paragraph", "text": "Dragon is already a powerful threat in his own right, as well as having powerful subordinates such as Sabo, Ivankov, Bartholomew Kuma, and Inazuma who are in comparison, lower in rank. This only speaks volumes of Dragon's true power."}, {"type": "paragraph", "text": "In Loguetown, it was worth noting Smoker and his soldiers made no attempt to arrest Dragon. When Sengoku told everyone of his relationship with Luffy, most people were stunned, including Gecko Moria of the Shichibukai and members of the Whitebeard Pirates. This reputation alone was enough for Luffy to be marked as a dangerous potential to the future, and for Demaro Black to take advantage of via impersonation."}, {"type": "paragraph", "text": "Ivankov has been seen commenting on how Luffy's will to live and his phenomenal strength only helps to prove the idea that he is indeed Dragon's son, implying that Dragon has similar strength and will."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Very little is known of Dragon's early life, other than he is the son of Monkey D. Garp and was born in the Goa Kingdom 53 years before the start of the story."}, {"type": "paragraph", "text": "Twenty four years ago, Dragon was shown to have witnessed Roger's execution, but he had not yet acquired his facial tattoo at this point. Some time after, he became a revolutionary and formed the Revolutionary Army between 24 and 19 years ago, with aim of opposing the World Government. As time past, his ideals slowly spread throughout the world and one by one, countries slowly began to support him, athough sometimes through conflict, causing many countries to fall. Eventually, Dragon would be regarded as the world's most wanted man. "}, {"type": "paragraph", "text": "Nineteen years before the the start of the story, Dragon and an unknown woman bore a son, Monkey D Luffy, who was left to be raised in East Blue."}, {"type": "paragraph", "text": "Twelve years before the current storyline, Dragon returned to his home in the Goa Kingdom and witnessed the burning of the Gray Terminal. After witnessing the sorrow of its own people by way of Sabo, with the boy begging for help and claiming shame of his heritage, Dragon enacted a plan in order to save the people and embarrass the government by creating a causeway to allow for those on Trash Mountain to escape and join him. Due to his actions, the nobles merely noticed that the charred remains from their burning of the mountain was far less than anticipated."}, {"type": "paragraph", "text": "When Sabo was leaving home to become a pirate, his ship was obliterated by a World Noble. Dragon saved him from the wreckage and brought him to the revolutionaries' ship."}, {"type": "paragraph", "text": "Sometime later, the Revolutionary Army docked in Shimotsuki Village for food and supplies, coincidentally close to where Roronoa Zoro was currently training. There, Dragon was seen on his ship, being scolded by Ivankov for being late."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "In the anime, Ivankov asked Dragon where he had been, to which he replied that he had been at the World Noble's reception ceremony on Dawn Island. When Ivankov indignantly asks why he was not invited, Dragon told him that he attracted too much attention."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "Dragon asked if they had enough food. When he heard that the local dojo had resupplied them, he nodded before announcing that they would be returning to Baltigo."}, {"type": "paragraph", "text": "After Sabo regained consciousness, he was noted to suffer from memory loss. Dragon explained that he was part of a noble family from Goa, but Sabo insisted on staying with the revolutionaries, not wanting to return to his family. Dragon began directly training Sabo three years later, as Hack had nothing left to teach the boy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Dragon_Saves_Sabo.png/revision/latest/scale-to-width-down/180?cb=20161221122501", "caption": "Dragon saves Sabo."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "Dragon was walking the streets of Loguetown as a storm broke out and stated that Luffy being the Pirate King was fine with him. When the Marine Captain Smoker had his son Luffy pinned to the ground, Dragon intervened and a massive gust occurred that blew away the Marines and freed Luffy. As the Straw Hat Pirates sailed off, Dragon watched and told Luffy to go on to make his dream happen before asking Smoker what reason he had to prevent a man from setting sail."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Dragon_Saves_Luffy_from_Smoker.png/revision/latest/scale-to-width-down/220?cb=20111113232156", "caption": "Dragon saves his son Luffy from Smoker."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "On Baltigo, Dragon was looking at Luffy's new bounty when one of his men was about to tell him that Luffy was Vice Admiral Garp's grandson. However, Dragon interrupted him by leaving the room and said he will stay in the wind for a while. He walked out into the castle's balcony where he remarked that the true nature of the world will be answered and that he will meet Luffy again."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Whitebeard's death and the liberation of the slaves at Tequila Wolf, Dragon expressed the desire to see one of the slaves: Nico Robin, the archaeologist of his son's crew and the sole survivor of the Ohara Incident."}, {"type": "paragraph", "text": "Also after the Battle of Marineford, some of the revolutionaries questioned Dragon if he is really the father of Monkey D. Luffy just as the recent newspapers said. Dragon casually confirmed that fact, much to the shock of his followers."}, {"type": "paragraph", "text": "In his headquarters, Dragon talked to Ivankov through the Den Den Mushi. Ivankov told Dragon about a newspaper article about Luffy and commented on how much he is like him. In turn, Dragon told the Okama that Luffy's no longer a child that one should keep an eye on, but did not expect the boy to be under Ivankov's protection during the war, and was somewhat grateful as a result. Dragon informed Ivankov that as Whitebeard had died, they would soon have to gather the Revolutionary leaders spread around the world as the world's balance was beginning to shift. Dragon then went on to tell Ivankov about Kuma."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat, Dragon received reports that rebel armies were succeeding all across the world. He then spoke to Koala, who informed him that the weapons they retrieved from Dressrosa contained a special mineral known as Liquor Iron Ore, which could provide a clue on where the weapons were made. After a small conversation concerning Luffy, Sabo, and Robin, Dragon requested Koala to gather all the revolutionary leaders."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of the Straw Hats' accomplishment at Dressrosa spread throughout the world, Dragon, Sabo, and Koala read about the pirates' new bounties."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime later, a newspaper explained about Blackbeard's attack on Baltigo. The island was destroyed by the time the Marines and Cipher Pol arrived."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Revolutionary Army escaped the destruction of Baltigo and they moved their base to Momoiro Island. While waiting for all the revolutionary commanders to arrive, Dragon spoke to Sabo and discussed their plan to declare war on the World Nobles during the Levely."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, the revolutionaries read some distressing news concerning Sabo. Dragon then told his subordinates that they needed to confirm the news themselves."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Revolutionary Army vs. Blackbeard Pirates (unseen)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Monkey D. Dragon vs. Sabo", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Monkey D. Dragon is in the first anime opening \"We Are!\", showing his face for a brief second.", "elements": []}, {"text": "Whether it is a foreshadowing on Oda's part or a coincidence, Luffy appeared in the short Mugiwara Theatre - Monster Time as a dragon years before he was revealed to be Dragon's son.", "elements": []}, {"text": "All members of the Monkey Family have shown to have a noticeable mark on the left side of their faces. Both Luffy and Garp have a scar while Dragon has a large tattoo.", "elements": []}, {"text": "So far, the few times he was seen in the series outside of Baltigo, there was always at least the suggestion of a storm coming, if not one already there. This happened when he saved Luffy in Loguetown, at Gol D. Roger's execution, and in Goa Kingdom when the residents were saved by a wind tunnel through the flames. In the anime, he arrives onto the ship after rescuing Sabo with a gust of wind seemingly appearing from nowhere. This is referenced in his appearance as a support character in One Piece Gigant Battle and its sequel, where he can help his Leader or blow his opponents away with a gust of wind.", "elements": []}, {"text": "In the 6th fan poll, Dragon ranked 85th.", "elements": []}, {"text": "Dragon's favorite food is bocaditos, Cuban slider-like sandwiches that are typically served on soft rolls.", "elements": []}]}], "images": []}]}