{"sections": [{"title": "Smoker", "level": 1, "content": [{"type": "paragraph", "text": "Smoker the White Hunter is a Marine officer and the Base Commander of G-5 Marine Base. He was first introduced as a captain in Loguetown, where he made it his mission to capture Luffy, and was later promoted to the rank of commodore, due to the events in Alabasta. At some point during the timeskip, he was promoted to the rank of vice admiral. He is also since his debut the superior of Tashigi, also serving as her mentor."}, {"type": "paragraph", "text": "He is a recurring adversary of Luffy. Due to his actions against Luffy at Loguetown, Smoker can be considered as the main antagonist of Loguetown Arc, and acts as a minor antagonist during the Marineford Arc. Despite his rivalry with Luffy, for reasons of encountering common enemies they ended up helping each other during the Alabasta Arc, and forming a temporary alliance during the Punk Hazard Arc, returning after both events to their relationship as enemies."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Smoker is a muscular, white-haired (light blue-green in the pre-timeskip anime) and brown-eyed man, with a distinct trait of always being seen smoking two cigars at once. He wears a large thick white and blue specialist marine jacket which he keeps open, with greenish fur lining the neck, wrists, and hem. The jacket bears the kanji for \"justice\" (正義, Seigi) written on the back of it. Many cigars are strapped to the jacket. He carries a Seastone-tipped jitte as his weapon, although it has been broken twice: once during the Battle of Marineford by Boa Hancock, and once on Punk Hazard by Vergo. He also wears brown leather gloves, blue jeans with a brown belt, and large military-issue brown leather boots. Furthermore, during his time in Alabasta, he also sported goggles. The fact that he rides a custom made motorbike gives off the impression of a delinquent marine."}, {"type": "paragraph", "text": "In the manga, his hair has a white tone and the fur on his coat was initially blue, later changed to dark green, and ultimately modified to follow the anime, albeit with a much lighter green tone, and with green zips as well."}, {"type": "paragraph", "text": "During his stay on an unknown island of the Grand Line, he was seen without his jacket, which he had a subordinate carry for him. During this time, he was seen keeping his jitte strapped to his back via a series of belts. A scar was visible on the right side of his chest."}, {"type": "paragraph", "text": "After the timeskip, his hair is now longer, slicked back, and the sides have been shaved. He now sports a pair of sunglasses. He has a scar that extends from his forehead to his right eye and tapers off to the side of his face. He also added the traditional Marines' military coat over his attire, draped over his shoulders like a cape with his jitte, which has either been replaced or repaired since the Battle of Marineford, hanging on the back; he is one of the few high-ranking marines (more specifically, a vice admiral) to not wear a conventional suit."}, {"type": "paragraph", "text": "As a child, he sported the same hairstyle as his pre-timeskip appearance. His face is depicted as being dirty, with a runny nose and a band-aid on his forehead, looking as if he just had a brawl with someone. He wore a plain blank white shirt and had a pair of goggles around his neck. He wore a pair of simple black pants and a pair of simple black boots. He also wore a pair of mittens or boxing gloves and carried around a baseball bat with nails in it, and was accompanied by an exhausted-looking dog."}, {"type": "paragraph", "text": "During his time as a cadet, his hair was styled into a classic military buzz cut, and he was already smoking cigars, though only had one in his mouth at a time."}, {"type": "paragraph", "text": "In One Piece: Stampede, he wears an unbuttoned white shirt, black pants with a pink sash tied around his waist, and brown boots. He also wears a black pirate captain jacket, with the red inside."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Smoker is a seasoned Marine, who when first introduced, was trying to track down Luffy in Loguetown. Unlike many other Marines in One Piece, Smoker does not follow the rule of Absolute Justice and follows his code of justice, which he later preaches to Tashigi. Smoker's perception of justice also allows the Straw Hat Pirates to remain at liberty, despite being pirates during the Alabasta Incident. He let Luffy go after he found out that Zoro was ordered by Luffy to save him from drowning. However, he quickly lost his temper after Luffy made a stupid comment. He warned Luffy that as a marine, he would have to try and arrest him the next time they encounter each other."}, {"type": "paragraph", "text": "Smoker also did not like taking credit in Alabasta for the Straw Hats' work in defeating Crocodile, even cursing the World Government when they attempted to reward him for it."}, {"type": "paragraph", "text": "Furthermore, Smoker is very perceptive. He quickly became interested in Luffy, because he saw parallels with Gol D. Roger in the young pirate. This also led him to pursue Luffy, to which he continually does, even up to the present time. In Loguetown, he frequently wondered if it was just a coincidence that on the anniversary of Roger’s execution, Luffy appeared and made such a vortex."}, {"type": "paragraph", "text": "Smoker is merciless against pirates and fights them with all his might. However, he expects that pirates also show no mercy towards him; he was even more surprised when Zoro saved him from drowning as per Luffy's orders. In return, he had to move on and leave Luffy and his crew alone."}, {"type": "paragraph", "text": "On the other hand, Smoker is dedicated to the pursuit of global justice against criminals and pirates, and will not forget those that forsake the law and manage to escape his grasp, though he appears to share Garp and Kuzan's \"moral justice\", and recognizes that not all marines are as noble as their image suggests, nor should all allies be trusted blindly."}, {"type": "paragraph", "text": "He also tends to hold grudges toward pirates who have escaped him. For example, he prepares to capture Portgas D. Ace and is prepared for a difficult battle. However, after Luffy unexpectedly interrupts them and throws them through several walls, Smoker, as soon as he sees Luffy, barely acknowledges Ace. He merely shoves him into the ground and prepares to go after Luffy, who is his primary target."}, {"type": "paragraph", "text": "Smoker treats his subordinates with the same respect as his peers and never abuses his position. He also is brusque towards his subordinate Tashigi."}, {"type": "paragraph", "text": "Smoker's disposition of being obstinate comes out when he decides he will abandon what he is doing and go after Luffy no matter the cost. Smoker tends to not adhere to the standard idea of justice, but rather lives up to his code of justice. The unique aspect about the encounter between him and Luffy is that this is the first time Luffy actively flees, as opposed to fighting."}, {"type": "paragraph", "text": "Smoker is an extremely serious and gruff man, and has very rarely been shown to smile, if at all. He is often sharp and caustic towards people who come off as nuisances to him, and gets irritated and angered at silly antics and stupidity which disturb his peace. However, he is profoundly dedicated and driven to protecting innocent people and his subordinates from harm, and will become immensely angry at anyone in a position of power who claims to protect people but is deceiving or manipulating them for their selfish interests."}, {"type": "paragraph", "text": "Smoker seems to have a hobby in rock balancing first shown in Loguetown. As such, he does not seem to like people who make too much noise around him, as he claims that it breaks his focus. Smoker also does not trust the Shichibukai, as he believes them as nothing more than pirates. In fact, he has been betrayed by Shichibukai four times so far in the series."}, {"type": "paragraph", "text": "Despite his somber manners, he does seem to have a benevolent personality. In Loguetown, when a little girl bumped into him and dropped her ice cream on his trousers, he takes it in good heart by poking fun at the situation. He even gave her money to buy a new cone. He also shows respect and even protective empathy to his subordinate, Tashigi."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d5/Smoker_Stacking_Stones.png/revision/latest/scale-to-width-down/210?cb=20191211163004", "caption": "Smoker stacking stones as entertainment."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Smoker_Comforts_Yu.png/revision/latest/scale-to-width-down/200?cb=20191208160057", "caption": "Smoker shows his kindness by comforting Yu after she bumped into him."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "Smoker is not afraid to openly challenge the higher ranking echelons within the Marines or the World Government, going as far as to use a brutal insult in an attempt to reject a promotion that he did not want. He has close ties with Hina as she is a personal friend from their days of training. Because they have known each other for a long time, Hina calls him Smoker-kun (a Japanese honorific used usually for younger peers) while Smoker addresses Hina by her name alone (which, in Japanese, shows either a sign of disrespect or closeness)."}], "images": []}, {"title": "Tashigi", "level": 4, "content": [{"type": "paragraph", "text": "He has a close relationship with his subordinate Tashigi. However, he appears to act very harshly to her mistakes, such as confusing another soldier for Smoker due to her not wearing her glasses. Despite this, he has shown that he trusts her judgment, as seen when he tells her to follow her own sense of justice when she goes to Alabasta. In turn, she calls him Smoker-san (a simple Japanese honorific) as opposed to by his rank that other soldiers call him (i.e. Vice Admiral Smoker). Recently, she has demonstrated some defiance towards her superior, Smoker. When Smoker berated her for begging for her life, she retorted at Smoker because it was the only way they could save their subordinates and the abducted children from Vergo. She later glares at him angrily for wearing her shirt unbuttoned, when he was in her body."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Tashigi_Cries_For_Smoker%27s_Encouragement.png/revision/latest/scale-to-width-down/200?cb=20191208154956", "caption": "Tashigi cries after receiving stimulus phrases from Smoker."}]}, {"title": "Kuzan", "level": 4, "content": [{"type": "paragraph", "text": "Smoker also seems to be on good terms with Kuzan, as he requested Aokiji to pass a message to Monkey D. Luffy, and later negotiate with Sengoku for a transfer to the more dangerous G-5 station in the New World. Although both Sengoku and Aokiji resigned before either could grant Smoker his request, the new Fleet Admiral, Sakazuki, was benign enough to transfer Smoker there. Even after Kuzan's departure, he would later save Smoker from being killed by Donquixote Doflamingo on the basis they are still friends."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Kuzan_Treats_Smoker.png/revision/latest/scale-to-width-down/210?cb=20191212045635", "caption": "Kuzan treats Smoker after being defeated by Doflamingo."}]}, {"title": "Issho", "level": 4, "content": [{"type": "paragraph", "text": "Smoker appears to have become well acquainted with Fujitora, as he, like Kuzan, believes the Shichibukai system should be dissolved. He later expressed both his shock and gratitude to have learned that Fujitora did not let the government cover up the ordeal in Dressrosa as they did in Alabasta to which Smoker was grateful for and even admitted that if he were in Fujitora's position, he would not be able to do what Fujitora did."}], "images": []}, {"title": "G-5", "level": 4, "content": [{"type": "paragraph", "text": "Currently, as the base commander in charge of G-5, Smoker had command of the personnel stationed there. The soldiers were sadistic and cruel, ignoring regulations, but obeyed Smoker. Smoker, in turn, shows contempt for them due to their blatant disregard for laws. After Smoker was captured by Caesar, they tried to break into Caesar's research facility to save him. Smoker was shocked when some of his men were blown up because of Smiley's power and he orders Tashigi to make sure they are kept safe and escorted to safety after reuniting with them in the research facility. Smoker was also enraged when Vergo insinuated that he attacked the G-5 marines previously and told Vergo not to harm them."}, {"type": "paragraph", "text": "When he was still base commander, Vergo seemed to be concerned about Smoker's transfer to G-5, as he mentions that from the day Smoker was transferred, he had to put up the largest possible guard to prevent Smoker from finding out his true affiliation. Vergo also expressed the desire to murder both Smoker and Tashigi \"by accident\", since they now know his secret identity. After being released from his confinement, Smoker expresses disdain for his colleague's felonies and intends to battle him alone in retribution for his treason against the Marines."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "He has a strong desire to arrest Luffy dating back to when Luffy was about to be executed by Buggy in Loguetown. Smoker saw the smile Luffy gave off to mirror that of Gol D. Roger's twenty-two years ago, and considered Luffy to be a potential danger to the world. Smoker has always wondered why Dragon would rescue Luffy in Loguetown, until Sengoku made it public that Dragon is Luffy's father, which intensified Smoker's thought about Luffy's dangerous potential."}, {"type": "paragraph", "text": "Ever since witnessing Luffy's smile during his aborted execution, Smoker has been relentless in trying to pursue Luffy and arrest him. Despite Luffy ordering Zoro to save Smoker from drowning after escaping the Rainbase Casino, Smoker still had the ambition to someday capture Luffy, only recouping him by letting him go that one time. Smoker is even willing to go as far as to the New World to capture Luffy, and has waited two years for Luffy to finally arrive. Smoker is Luffy's longest running Marine adversary to date."}, {"type": "paragraph", "text": "Due to Smoker's desire to apprehend Luffy for such an extended period, he seems to have learned of Luffy's habits based on the various encounters with him as well as information from news reports. Smoker was able to correctly predict Luffy's desire to go to Raijin Island due to the Log Pose pointing at the island being the most turbulent and would fit Luffy's reckless nature. Indeed, Luffy was originally planning to go there, were he not diverted by a distress call from Punk Hazard. Smoker was also willing to enter Punk Hazard to pursue Luffy, despite the Government placing the island off limits. When he saw Luffy, he immediately attacked him despite Smoker being stuck in Tashigi’s body, due to Law’s abilities. He was also very embarrassed when Luffy laughed at him, because of his peculiar situation, and became infuriated when Luffy refused to battle him based on Smoker's and Tashigi's \"handicap\". Due to the situation, when Trafalgar Law and Luffy allied with each other and defeated Caesar Clown, Smoker once again let Luffy go."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Smoker_Facing_Luffy_in_Marineford.png/revision/latest/scale-to-width-down/210?cb=20191212042428", "caption": "Smoker facing Luffy in Marineford."}]}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "He made an enemy of Ace during the Alabasta Arc while Smoker was trying to capture Luffy. While Smoker simply stated that he could not let a pirate such as Ace go so easily, he still prioritized capturing Luffy as once he saw Luffy again, he went after him while ignoring Ace. He only clashed against Ace when he stood in his way."}], "images": []}, {"title": "Crocodile", "level": 4, "content": [{"type": "paragraph", "text": "Crocodile imprisoned Smoker along with the Straw Hat Pirates in a Seastone Cage. Also, Crocodile called Smoker a coward when he met Tashigi. During the Battle of Marineford, Smoker was very surprised to see Luffy cooperating with Crocodile."}], "images": []}, {"title": "Boa Hancock", "level": 4, "content": [{"type": "paragraph", "text": "Hancock considers Smoker a personal enemy after he pinned down and attempted to kill Luffy. Hancock swore to rip him to shreds and feed him to beasts. Hancock intercepted Smoker when he tried to attack Luffy and she also broke his jitte. During the Battle of Marineford, Smoker warned Hancock that her actions might lead to her Shichibukai status being revoked."}], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "When Donquixote Doflamingo arrived at Punk Hazard looking for Law and the Straw Hats, he began attacking the Marines. He demanded Smoker to tell him where the pirates went, which he refused. Doflamingo then attacked and nearly killed him. After the intervention of Aokiji, Doflamingo spared Smoker's life."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "When Smoker encountered Trafalgar Law at Punk Hazard, he demanded answers from Law, some regarding on who Law was working for, indicating a hidden agenda. They battled each other, and Law managed to gain the upper hand by stealing Smoker's heart with his Mes attack. While Smoker yielded in defeat, Law commented that he did not have to tell him anything. Law also switched Smoker and Tashigi's personalities in their bodies. However, Smoker and Tashigi formed a temporary alliance with the Straw Hat Pirates and Trafalgar Law to defeat Caesar Clown and Vergo on the condition that they do not mention Law or Joker's complicity to the Marines."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Smoker is a formidable combatant, as on top of his sheer strength, his Logia Devil Fruit abilities set him apart from most marines. In Loguetown, he was on the verge of arresting Luffy during their first encounter, and would have succeeded had it not been for Luffy's father, Monkey D. Dragon, interfering."}, {"type": "paragraph", "text": "After the Enies Lobby events, he was shown unsatisfied in capturing a pirate with a bounty of 50,000,000. When Luffy confronts him again in Marineford, he comments that Smoker has gotten far stronger before being pinned to the ground. Smoker's overall strength has granted him enough confidence to request a transfer to G-5 in the highly fearsome New World. It is said that the marines of this branch are insane, cruel, and merciless who stick needles into pirates, feed them to sharks, or use them for kindling. They are known for not following orders, but Smoker managed to earn their obedience."}, {"type": "paragraph", "text": "He is one of the few marines that has ever beaten Luffy, the others being the two high-ranking Admirals Aokiji and Kizaru as well as Sentomaru (although Luffy was injured at the time). As a result, Luffy resorts to running away from Smoker if he ever sees him, however, Luffy could not use Busoshoku Haki at this time."}, {"type": "paragraph", "text": "After the timeskip, Smoker was able to easily cross the New World entrance and to arrive at Punk Hazard. Smoker and his crew managed to capture some pirates who were liberated from Hody’s control. During his time on Punk Hazard, he managed to give Trafalgar Law a hard time before he was ultimately defeated. Even when he was switched to Tashigi’s body, he managed to strike Luffy. Also, despite him not being in his original body he easily defeated some of Caesar’s subordinates. He was also able to battle Vergo on relatively equal terms despite Vergo's superior mastery of Haki, and Smoker's actual goal being to retrieve Law's heart from the rogue Marine. However, he was easily defeated by another Shichibukai Donquixote Doflamingo."}, {"type": "paragraph", "text": "Smoker has both excellent hearing and memory, as shown during the Alabasta Arc when he tells Sanji to attack the third Bananawani that entered the room, since \"that growl just now was the same as the one who ate the key\". He has also shown great strategic capabilities, as he was able to plan in mere minutes the efficient assault on the pirates in the plaza during Buggy's attempt to execute Luffy, and utilize his abilities in what seemed to be erratic methods to divert Vergo's attention and retrieve Law's heart."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As evident of his strong build, Smoker possesses incredible physical strength: during their confrontation in Loguetown, he was able to jump about two stories high without difficulty while holding Luffy and hold him down with him being unable to retaliate, a noteworthy feat, considering Luffy's inhuman physical power."}, {"type": "paragraph", "text": "After the 2 year timeskip, Smoker has become significantly more powerful in both physical strength and fighting skills, as a Marine Vice-Admiral, he could survive against the fearsome dangers of the New World, he could hold his own against Trafalgar Law in battle and also supplemented with his Devil Fruit powers he could fight against Vergo one of the strongest members of the Donquixote Pirates, even send the latter flying with Haki enhanced strikes."}, {"type": "paragraph", "text": "He also has vast endurance and resistance, as he was able to stand back up with no visible damage and without effort after receiving a Haki-enhanced kick from Boa Hancock, whose attacks are strong enough to shatter stone and Pacifistas armor (though Hancock's kick was primarily to get him off Luffy)."}, {"type": "paragraph", "text": "He could repeatedly withstand powerful blows from Vergo multiple times, and in a heavily injured state, he even survived Vergo's Demon Bamboo attack head on which is powerful to smash steel with the aftershock."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Smoker has eaten the Moku Moku no Mi, a Logia type Devil Fruit which allows him to create, control and become smoke. He can manipulate the smoke's density to make it thick or thin, allowing him to hold and constrict others within it. Like most Logia users, he can fly by turning his lower body into smoke and propelling himself like a rocket."}, {"type": "paragraph", "text": "At this point, he does not appear to have any exploitable weakness (aside from the standard Devil Fruit weaknesses), due to his ability to be intangible. This was the main reason why Luffy could not beat him before the timeskip, as unlike most of the opponents he faced, Luffy was not prepared for or had much experience with Devil Fruit users of the Logia class, as he was unable to touch or hurt Smoker (and could not use Busoshoku Haki at the time). Because Luffy was at a great disadvantage at the time, his encounters with Smoker usually involved him running from and avoiding him, as he was well aware that he had no winning chance against him. With his current mastery over his powers, the only reliable way to injure Smoker is through the use of Haki or standard Devil Fruit weaknesses."}, {"type": "paragraph", "text": "Using his smoke powers, Smoker can power up the engines of his motorbike, the Billower Bike, for on-land transportation."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Moku_Moku_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20120619065937", "caption": "Smoker reflexively uses the Moku Moku no Mi to get unscathed by a pirate from Whitebeard Pirates."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Smoker's main weapon is a large jitte that is quite long and is tipped with Seastone, a material that affects Devil Fruit users in a similar way to the sea (a person who consumes a Devil Fruit becomes weak and unable to move his or her body in the water, and Seastone is, in Smoker's own words, \"a solidified form of the sea\"), which he uses to subdue criminal Devil Fruit users."}, {"type": "paragraph", "text": "Since only the tip is Seastone, it does not affect Smoker himself. He keeps the tip hanging in the air at all times, and his thick clothing provides further protection. When he turns into smoke, the weapon does not turn into smoke with him because of the Seastone. Instead, he carries it with him while in smoke form."}, {"type": "paragraph", "text": "Smoker seems to be very proficient in wielding the jitte, taking enemies by surprise and using the weapon to deliver strong blunt attacks. The jitte was broken in half when Boa Hancock kicked it, which led it to crumble. After the timeskip, the jitte has shown to have been repaired. Its hilt is white in the manga, but red in the anime. Also, in the manga and its related merchandise and products, it seems to be much longer than in the anime, almost reaching down to Smoker's feet."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ab/Nanashaku_Jitte_Infobox.png/revision/latest/scale-to-width-down/160?cb=20100109224849", "caption": "Smoker's jitte strapped to his back."}]}, {"title": "Billower Bike", "level": 4, "content": [{"type": "paragraph", "text": "The Billower Bike is used for in-land transportation. It is a wide bike with three wheels (two big ones in the rear, and a smaller one in front) and its engines are powered by his Moku Moku no Mi powers. Additionally, Smoker can traverse water with the bike."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Before the timeskip, Smoker was not able to use Haki, although he had some knowledge of it."}, {"type": "paragraph", "text": "During the timeskip, Smoker was promoted to vice admiral, confirming that he can use the ability."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Vergo_vs._Smoker.png/revision/latest/scale-to-width-down/210?cb=20141206213851", "caption": "Smoker using Busoshoku Haki to empower a left punch."}]}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Smoker possesses the ability to use Busoshoku Haki. During his battle with Vergo, he landed a punch where his hand and part of his arm were completely black, demonstrating the use of Busoshoku Haki. He later did the same with his elbow when striking Vergo in the face. He can also imbue his Nanashaku Jitte with his Haki."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Smoker possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Very little has been said about Smoker's past. What is known is that he was born in the Grand Line, but was at Loguetown on the day that the Pirate King, Gol D. Roger, was executed. He personally witnessed Roger smiling right before his demise, and still remembers it to this day."}, {"type": "paragraph", "text": "At some point afterwards, he joined the Marines the same time as Hina. However, it appears that Hina had to help Smoker before in situations where he was almost expelled from the Marines. In the movie \"Film: Z\", it was stated that he was trained by the former Admiral \"Black Arm\" Zephyr. Some time before the current storyline, Smoker managed to acquire the rank of Marine Captain, and was charged with the protection of Loguetown, the city in which the Pirate King was born and executed."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "Many citizens and subordinates fear Smoker, most likely because of his smoke powers, his imposing appearance and his sharp manners. The captain, however, cares deeply for the inhabitants of the city. He did not become angry when a little girl accidentally bumped into him, spilling her ice cream on one of his pant legs. He instead gave the girl money to buy a bigger ice cream. He was known for never letting pirates escape his town. Ipponmatsu, the weapons store owner where Zoro bought his new swords, complained to Tashigi on how her new Marine captain Smoker has ruined his business with pirates."}, {"type": "paragraph", "text": "In the Marine base, Captain Smoker was informed about the chaos caused by the pirates at the plaza. He ordered the Marines to close all the roads that lead to the execution platform and to surround the port. Soon, Tashigi sergeant of the Marines, met up with Smoker and they went to the execution platform. The marines reported three wanted pirates on the execution platform, one being Alvida the Iron Mace, the other being Buggy the Clown and finally Straw Hat Luffy. Smoker stated he had never heard of Luffy but he thought that it could be a tough job."}, {"type": "paragraph", "text": "While Buggy was preparing for Luffy's execution, Smoker reached the plaza with his men. The Marines were not sure what to do, as the pirates were fighting each other. Smoker told the marines to let them fight, that way they will have the strength to capture Alvida and Buggy as soon as they had cut Luffy's head off. Buggy was about to cut Luffy's head off when Zoro and Sanji showed up to save Luffy. Smoker and Tashigi were surprised to hear that Pirate Hunter Zoro now belonged in the same crew of Straw Hat Luffy. Luffy then apologized to his crew saying that this was the end for him, smiled and accepted his fate. Shocked, Smoker recalled Gold Roger's execution 22 years ago. Suddenly, a lightning bolt struck Buggy when he was about to kill Luffy. Smoker asked a marine if he has ever seen somebody laugh at the execution platform knowing they will die. The marine replies with saying that even the wicked kind of pirate would cower in the face of death. Smoker then said that that was exactly what Luffy, just like the pirate king did on his execution 22 years ago."}, {"type": "paragraph", "text": "After realizing Luffy is escaping, he ordered the first unit to take care of them, however, their gun powder was wet due to the sudden storm, leaving the port free for them to escape. Smoker decided to capture Luffy even if it was the last thing he'd do. Buggy used his Bara Bara car mode and headed off to the harbor, closely followed by Alvida who took off her sandals, and slipped down a ramp to follow using her abilities. However, they were caught by Smoker before they could get too far. After the Marines had succeeded in catching the Buggy Pirates and Alvida, Smoker chased after Luffy. Alvida commented on how her Devil Fruit powers did not work on the net. Buggy replied that the net was made out of a special material made specifically to capture devil fruit users."}, {"type": "paragraph", "text": "Smoker caught up to Luffy and Sanji and blocked the way to the harbor. Smoker grabbed Luffy, causing Sanji to leap into action, but with no effect to Smoker due to his Devil Fruit. Smoker used his White Blow and blew Sanji to a building, Luffy tried to fight back, but he ultimately failed. As Smoker was about to deliver the finishing blow, a mysterious man called Dragon suddenly appeared. Smoker stated that the whole world government was looking for him, to which he replied \"waiting for our answer\". After that, a gust of wind suddenly blew everyone away, giving Luffy and his crew a chance to escape."}, {"type": "paragraph", "text": "As the crew escaped, Smoker demanded to know why Dragon helped them. Dragon replied by stating he saw no reason to stop a man's destiny. Nevertheless, Smoker set out after Luffy, along with his subordinate, Tashigi, abandoning his post in Loguetown. A marine tried to stop him and tried to remind him of his duties to the higher-ups. He replied with saying he could tell them to not order him around. After that, he set sail to the Grand Line in pursuit of Straw Hat Luffy and his crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Dragon_Saves_Luffy_from_Smoker.png/revision/latest/scale-to-width-down/210?cb=20111113232156", "caption": "Just when he is about to capture Luffy, Smoker is stopped by Dragon."}]}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Little Garden Arc", "level": 4, "content": [{"type": "paragraph", "text": "Smoker had managed to intercept the conversation between Mr. 0 and Sanji after the events on Little Garden using a black Den Den Mushi. He was able to note 4 keywords of the conversation: Princess Vivi, Straw-Hat, Mr. 0 and orders. Tashigi asked him if Mr. 0 could have something to do with Mr. 11, which they had caught yesterday. Smoker says that this is possible and that it might even point to a secret criminal organization. Mr. 11 denied these claims, saying that they were looking in too deep. Smoker then asked him what the note in his pocket meant. Mr. 11 then got nervous and thought to himself that he was sure he had burned 'that' note. He tried to explain the note, but before he went further Smoker said that they never found any note in his pocket, which shocked Mr. 11, who had realized had blown his cover."}, {"type": "paragraph", "text": "Smoker then remembers that Vivi was the princess of the kingdom named Alabasta, he also noted that she is currently missing. Tashigi remembered that Alabasta is in the middle of a coup d'état, then she asked Smoker if the Straw Hat pirates and the criminal organization are possibly related to that. He replied that he did not know yet, saying that this was their only lead on the Straw Hat pirates. Smoker then orders a marine to request an Eternal Pose from Marine Headquarters and made his way to Alabasta."}], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "He is later seen on Alabasta in the town called Nanohana. Smoker notes that the restaurant called Spice Bean is especially noisy today. Tashigi notes that a customer had apparently died there, then a marine came running towards then, saying that they would not believe who is in town. Smoker later entered the restaurant asking what the commander of the second division of the Whitebeard Pirates, Portgas D. Ace, was doing in this country. Ace then said he was looking for his younger brother. Ace then asks Smoker what he should do, Smoker tells him to let him arrest Ace. He rejected that offer by saying he could not let him do that. Smoker then said that he was looking for a different pirate and had no interest in him; Ace asks if he just could let him go in that case. Smoker replied by saying that he could not do that, as long as he is a marine and as long as he is a pirate. Ace said that it was a dumb reason and prepared to fight with Smoker. Luffy suddenly entered the restaurant however by using his Gomu Gomu no Rocket, blowing both Smoker and Ace right out of the wall."}, {"type": "paragraph", "text": "After an abnormal amount of time, Luffy realized his situation and flees the restaurant, hence not realizing the presence of Ace. While Smoker and the marines were pursuing Luffy, the rest of the crew had bought some local clothes (much to Sanji's delight) to remain anonymous. Unfortunately for them, their captain soon gave their location forcing everyone to flee. While Smoker was about to catch Luffy with his Moku Moku no Mi, Ace interposes. Ace, who ate the Mera Mera no Mi, a Logia type Devil Fruit, could combat Smokers abilities to a draw. Though this was because their powers have no real effect on the other as they naturally go hand in hand, making them about equal. Smoker later looked concerned, not because he was not able to catch the Straw Hat, but rather because he saw that the princess of Alabasta was among them."}, {"type": "paragraph", "text": "Later, the Straw Hats finally arrived at Rainbase. Unfortunately, while they were buying some water, Luffy and Usopp bumped into Smoker and Tashigi. The marine captain was suspicious about Crocodile’s activities and decided to come to Rainbase as well. A pirate hunt started. Cornered by the marines, the Straw Hat Pirates (except Chopper who left for a personal break) decided to split and meet up at Crocodile's casino. After the chase, Luffy, Usopp, Nami, and Zoro arrived at the casino followed by Smoker. Making a ruckus into the casino, Luffy, Usopp, Zoro, and Nami were invited to a V.I.P. room by Crocodile. Smoker was chasing them, but was locked up in the same cell as the rest of the Straw Hat crew. Smoker then revealed to them that the cell they are shut into is made of Seastone, a material that has the power to drain devil fruit power like the sea does. Then, a sarcastic Crocodile showed himself mocking their helplessness."}, {"type": "paragraph", "text": "When Vivi appeared, she could not control herself at the sight of her enemy and tried to attack him. But she was powerless against Crocodile who ate the Suna Suna no Mi. Crocodile announced the beginning of his plan to destroy Alabasta: Utopia. It would start at 7 o' clock. Crocodile told Vivi that he and Miss All Sunday are about to meet her father. Sanji, who nicknamed himself as Mr. Prince, fooled Crocodile by letting him go outside of the casino by pretending to be have been killed at the hands of a subordinate of Crocodile. Usopp and Luffy yelled at Smoker asking why he was so calm in such a situation, but Smoker responded by asking how much of Crocodile's plan the Straw Hats knew. He told them that Crocodile and Miss All Sunday, who has a bounty over 70 million, pairing up might shake the entire world, but Luffy said that no reasons are needed to beat Crocodile up. When Smoker asked how they are going to escape, the Straw Hats remembered their situation and start panicking again, and Luffy started to feel faint because of the seawater touching him."}, {"type": "paragraph", "text": "Sanji finally appeared, defeating a Bananawani with a single kick, to everyone's surprise. As more Bananawani’s closed in, Smoker told the Straw Hats that the third Bananawani that came in is the one that ate the key. When Luffy asked how he knew, Smoker says the voice is the same as the one who ate the key. Later, Mr. 3 who had survived into the Bananawani stomach by putting himself into a wax ball was ejected thanks to one of Sanji's kicks. He found the key attached to his Doru Doru ball, and he quickly deduced that it belonged to the cage the prisoners were in by analyzing the situation. He quickly threw away the key and prepared to face Sanji. Usopp noted that they could use Mr. 3's powers to make a new key. Thanks to Sanji, they were able to force Mr. 3 creating a key that open the gate. When they were about to escape, the room collapses but everyone managed to swim to the surface safely. Even Smoker, who was carried by Zoro, when Smoker asked the swordsman about the reason for his action, Zoro told him it was an order from Luffy. Surprised by the Straw Hat captain illogical behavior, Smoker did not arrest them but warned Luffy when they meet again he will not hesitate to capture them. Before they escaped, Luffy said to Smoker that he did not really hate him. Afterwards, he ordered his subordinates to contact Marine Headquarters for reinforcements. A marine told him that they will probably not send them just to fight a small crew. But Smoker told him that he did not care about the opinion of his superiors."}, {"type": "paragraph", "text": "While Luffy was fighting Crocodile for the first time in Rainbase, people talked about the sandstorm they see. Tashigi told Smoker about it, which he simply looked on at. Smoker told Tashigi to go straight to Alubarna by herself and do whatever she feels is her own justice there, he also told her to keep the communication lines open. Smoker told her to watch closely how this place will end up, whether it gets destroyed or not, as he felt that something would happen that would begin the start of the New Age (this actually being the defeat of Crocodile and being kicked out of the Shichibukai), before driving away."}, {"type": "paragraph", "text": "After the war in Alubarna and the fall of Baroque Works, Smoker was seen on the ship that contained the Dance Powder and he was joined by another captain, called Hina, and she asked him if he used the dance powder to make the rain. Smoker replied that he knew the difference between right and wrong, and that he would not use something that is prohibited by the World Government. Smoker requested that she bring the ship and the apprehended Crocodile to the marines in his place."}, {"type": "paragraph", "text": "When Tashigi rejoined Smoker and Hina the next day, she reported her failure in capturing the Straw Hats, instead of blaming the swordswoman, he asked her to become stronger. Just then, Marine Headquarters contacted Smoker and said that Marines and the World Government officially declared Smoker as the one who defeated Crocodile. This was done to suppress the fact that Crocodile had, in fact, been defeated by a pirate. Smoker, however, angrily and on bad terms, refused both the medals and promotions the marines offered him and Tashigi. He even openly admitted that it was Luffy and his crew that defeated Crocodile and Baroque Works. While this was going on, Hina told Smoker to accept the medals and promotion, telling him that it was obvious that the World Government planned to cover up the entire incident and that if he disobeyed the top brass, he could risk getting court-martialled. However, Smoker stated that it would be better than living a lie and, before hanging up, told the person on the other end to tell the \"old geezers\" at Marine Headquarters to go to hell."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Smoker_Let%27s_Luffy_Run_Away.png/revision/latest/scale-to-width-down/210?cb=20191208155506", "caption": "Smoker decides to let Luffy and his crew escape."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Long Ring Long Land Arc", "level": 4, "content": [{"type": "paragraph", "text": "Aokiji was going to give Luffy a message from Smoker after he had incapacitated Luffy (Luffy did not hear it anyway since he was frozen at the time), but he did not relay the message to Luffy, saying it was too stupid."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "The new bounties of the Straw Hat crew went out to the world after the Enies Lobby incident. And on an island somewhere in the Grand Line, Smoker had just caught a pirate worth 50,000,000, although he had no difficulty with it whatsoever, and even asked himself what happened to the Marines' standards. Tashigi, who was promoted to Ensign, came up to him and asked him if he had seen the new wanted posters for the Straw hat pirates, or so she thought. She was actually talking to a random marine soldier because she did not have her glasses on. Smoker then told Tashigi that what they really needed was status to widen their limits; he also noted that pirates over the whole world started to recognize the Straw Hat pirates. Then he said he would bet on his pride that he would crush them, in the \"New World\"."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Smoker reported to the summoning of the marines to reinforce Marineford."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three hours before Ace's execution, he was seen with Tashigi listening to Sengoku's speech about Ace's past. He is stunned along with Tashigi to see Crocodile amongst the members of Luffy's newly-gathered expedition to save Ace. Sengoku's revelation of Luffy being Dragon's son had finally made Smoker understand why the Leader of the Revolutionaries saved the Straw Hat pirate in Loguetown."}, {"type": "paragraph", "text": "Later, Smoker decided to confront Luffy, as Luffy continued to battle marine soldiers, Smoker burst towards him, with the intent on settling the score. Smoker managed to strike Luffy with his Seastone Jitte, dealing more damage than Luffy would usually take. Luffy struck back with Gomu Gomu no Jet Gatling, but the attacks slipped right through Smoker's smoke. As Smoker and Luffy commented on how the other has become stronger, the former pins the latter to the ground with his jitte."}, {"type": "paragraph", "text": "Smoker went on about how he finally understood why Dragon saved Luffy back at Loguetown, while Luffy struggled to free himself from Smoker's restraint. Hancock suddenly kicked Smoker away, using her Haki to make contact with Smoker. When Smoker asked why Hancock is not fulfilling her duty as Shichibukai, Hancock stated that she has never felt that angry in her life, and that she would not let anyone harm her beloved Luffy. Onlooking marines confused the interaction as Luffy knocking Hancock down. Smoker, however, is not deterred, preparing to take chase after Luffy again; Hancock interfered once more, though, with a Perfume Femur kick, causing Smoker's jitte to snap in two. Hancock then looked down on Smoker to the point of looking up, telling him that she will not let him pass. When Smoker asks if Hancock realized the consequences of getting in the way of the marines, she says that whatever she does she will be forgiven."}, {"type": "paragraph", "text": "Smoker and Tashigi were later seen retreating to the plaza as Sengoku was about to execute the final stages of his plan. After the death of Portgas D. Ace, he was seen condemning the marines still fighting against the pirates as their objective had been completed. After the arrival of Shanks, Smoker was seen standing down with the other marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Smoker_Subdues_Luffy_at_Marineford.png/revision/latest/scale-to-width-down/210?cb=20130224105706", "caption": "Smoker attacking Luffy at Marineford."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, he was seen in Aokiji's office, talking with him and asking about his reassignment to G-5 Marine Base in the New World, in order to keep track of his target, while brushing off the recent news of Luffy infiltrating Marineford to ring the Ox Bell sixteen times."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e4/Kuzan_and_Smoker.png/revision/latest/scale-to-width-down/210?cb=20131011025112", "caption": "Smoker and Aokiji discuss the recent events."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "When Smoker and Tashigi were first transferred to the G-5 base, Vergo was telling them how the soldiers are rowdy and not too bright, but they were overall good people."}, {"type": "paragraph", "text": "At some point, Smoker spoke to Admiral Fujitora and revealed to him about what happened at Alabasta and the World Government covered-up the incident."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Smoker (promoted to vice admiral) and Tashigi (promoted to captain) are now in charge of G-5 Unit 01. They were seen capturing some pirates who came up from Fish-Man Island after they were freed from Hody's clutches. As Tashigi scolded her subordinates for goofing off during a battle, Smoker told her to be quiet as he was in the middle of an interrogation. Smoker turned toward his prisoners, reiterating that pirates were being enslaved by Hody Jones, citing that as the explanation why no rookies came through Fish-Man Island in the last month. But now, they are coming out of the sea practically non-stop. The captured pirates then went on to say that there was a pirate group who stopped the New Fish-Man Pirates' uprising, ultimately liberating them. One pirate said that he will not tell Smoker about the man who freed them. Another pirate then urged him to talk, saying that they are dealing with G-5 and explained rumors of their torture methods. When the other marines asked Smoker if they could have the prisoners, one pirate blurts out that it was the Straw Hat Pirates who saved them. Smoker told them that he already knew that."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later, Smoker and Tashigi were wondering why the Straw Hats had not chosen one of the three islands near Fish-Man Island that the needles pointed at, which were Raijin Island, Mystoria Island, and Risky Red Island. Instead, the Straw Hats had chosen to go to Punk Hazard. Tashigi briefly tried to tell him that the island was basically deserted since the \"incident\" that occurred four years ago, but Smoker did not seem to notice. Afterwards, Smoker decided to go to Punk Hazard as well. After arriving there, Smoker commented on how the island turned out to be a wasteland from one of Vegapunk's failed experiments four years ago and how this was the island that Akainu and Aokiji fought on for the position of fleet admiral and how their powers changed the weather on Punk Hazard. After arriving onshore on the frozen side of the island, the group found a facility called PH-006. Before Smoker entered the building, Trafalgar Law came out of the entrance, and Smoker identified him as a new Shichibukai. Smoker told him that this island is off limits even to the government and Law just replied that the same edict applied to Smoker also."}, {"type": "paragraph", "text": "Smoker then played the recording of the conversation between Luffy and the man who was cut down by a samurai. He also said that he knew that he and Luffy fought alongside each other at Sabaody against the marines, and that he rescued Luffy during the war two years ago. Law insisted that he had nothing to do with the distress call. Smoker then asked to see inside the research facility, but Law did not let Smoker in, saying that the facility is just his vacation home. Then, a group of the Straw Hats and giant children broke out of the facility, surprising Law, Smoker, and the G-5 marines. After seeing who they ran into, they immediately fled back into the building. Smoker, clearly under the impression that he had been deceived, asked Law why he told them that he was \"alone\". Law could only reply that he also was not aware that the Straw Hats were there. As the marines from G-5 were about to chase after the Straw Hats, Law stood in their way and told them that they could not be allowed to leave the island. After Law lifted the marine battleship with his \"Room\", Smoker got ready to fight him."}, {"type": "paragraph", "text": "Law destroyed the battleship and dropped it on the marines. Smoker then attacked him with his Devil Fruit powers. Law evaded and attacked the marines, whom Smoker had told to retreat outside the range of the Ope Ope no Mi. Tashigi charged at Law, and Smoker told her that with Haki of her level, she could not withstand Law's strength. After Tashigi was cut in two, Smoker prevented Law from further attacking her. The Vice Admiral then clashed against the Shichibukai. As they fought, Smoker demanded answers from Law. However, Law managed to remove his heart with his \"Mes\" technique. While Smoker kneeled down, Law commented that he did not have to tell him anything right before Luffy arrived at the scene."}, {"type": "paragraph", "text": "When Tashigi returned to where Law and Smoker were fighting, after the G-5 marines helped reassemble her, she was horrified to see her superior lying unconscious and defeated on the ground. She noticed a hole in his chest, and realized that his heart was stolen by Law, just like he did to a hundred pirates before. Enraged, she tried to attack Law again, but he responds by switching her \"heart\" with Smoker's, putting Smoker into Tashigi's body. After Luffy's group left the scene, Smoker and Tashigi were then brought to safety in a nearby cave. While resting, Smoker told his men that he saw the initials \"CC\" and explained about a former colleague of Vegapunk's known as Caesar Clown."}, {"type": "paragraph", "text": "Tashigi mentioned several incidents of children kidnappings that happened in the seas close to Punk Hazard, but these incidents were not correctly stated in the newspaper. Smoker then suspected a mole within G-5 that was trying to cover up these incidents. Smoker stated that he could not leave the island until he got his heart back and that he intended to expose the mastermind. He then talked more about Caesar. Smoker explained that Vegapunk and Caesar were rivals and he suspected Caesar to be the cause of the \"accident\" on Punk Hazard. Smoker then told his men that Caesar needed to be stopped before another incident occurs. Later on, Smoker, Tashigi and the rest of the G-5 Marines were fighting some satyrs and centaurs. Tashigi recognized some prisoners and asked Smoker how they could be here, since the survivor count was zero. Smoker told her that he does not know and that they had to send a ship to report what was happening on Punk Hazard."}, {"type": "paragraph", "text": "Smoker, still in Tashigi's body, was seen fighting alongside Tashigi and the G-5 marines in an attempt to break into the front of the research facility. While she was struggling to control the Devil Fruit powers, Smoker scolded her and commented on how he could easily infiltrate the facility in his own body. When Luffy arrived with Robin and Franky, Smoker appeared to be aggravated by their presence."}, {"type": "paragraph", "text": "Tashigi attempted to attack Luffy, finally managing to make a conscious transformation with Smoker's Logia abilities. However, Luffy easily dodged her attack, grabbed her arm, and then pinned her to the ground, questioning how 'Smoker' had become so weak after the time-skip. Annoyed that Tashigi was losing while in his body, Smoker (in Tashigi's body) quickly moved in to strike Luffy, hitting him with a barrage of attacks using his seastone-tipped jitte. Confused, Luffy did not understand how 'Smoker' became so weak, while his second-in-command (to whom Luffy has forgotten the name of) had become so powerful. Declaring himself as the real Smoker, the Marine again lunged towards Luffy who narrowly dodged the blow, stunned at this claim. Robin then interjected, explaining the possibility of Law having something to do with the change which helped Luffy understand. He then broke into laughter right after realizing the situation. Not impressed by the pirate captain's attitude, Smoker attacked out of anger. Luffy managed to dodge again, entered Gear Second, and quickly moved in front of Smoker, stating that he would postpone their fight until the Marine was in his original body and at full strength. After the brief scuffle with Luffy he noticed the slime appearing on the Marine warship and asked one of the G-5 marines what it was. Some marines tried to burn the slime and Smoker then witnessed it explode, killing the marines onboard the warship. Tashigi then suggested that they go find a safe place with a roof, to which Smoker agreed too. As more pieces of slime fell from the sky, Caesar Clown revealed himself to both the G-5 Marines and Luffy's group. Smoker and Tashigi then watched the battle between Luffy and Caesar. He was rather surprised when Luffy suddenly fainted after taking down Caesar. Smoker, Tashigi, Robin, and Franky later fell into unconsciousness without Caesar even touching them."}, {"type": "paragraph", "text": "Smoker was then locked up in a cell alongside Luffy, Robin, Franky, Tashigi, and Law. Smoker yelled at Vergo, telling him that all the marines outside were also his subordinates. Robin asked if it felt nostalgic, since Luffy and Smoker were locked up before in a cell at Alabasta, but Smoker then told her to shut up. Tashigi asked Smoker about the feeling she was experiencing due to the Seastone weakening her. Smoker started talking about Joker and how he let Vergo slip right under his nose. Vergo told Smoker that ever since he transferred to G-5, he had his guard up the entire time and now that he knew his true identity, he planned to eliminate both him and Tashigi, while making it look like an accident. Smoker then listened in on Luffy and Law's conversation and heard Law reveal that Joker was actually Doflamingo."}, {"type": "paragraph", "text": "While Caesar was giving out his broadcast to the underworld brokers about his experiment with his chemical mass destruction weapon, Smoker and the other captives witnessed the destructive effects of the poison cloud released by Smiley. Caesar proceeded to move the cell outside of the facility so the captives could die of the poison."}, {"type": "paragraph", "text": "Smoker then watched as Law began their escape plan, directing Franky to launch his Franky Fireball at the segregated battleship down below. Setting the wood ablaze, the smoke then rose up to the cage, which allowed for them to discreetly take action, Law quickly revealed that he had replaced some of the Seastone Chains with regular ones allowing him to escape easily. Once Luffy and the others were freed, Smoker and Tashigi are then coerced by Law into cooperating after he returned them to their own bodies."}, {"type": "paragraph", "text": "They were later teleported into the laboratory thanks to Law's ability. They opened the shutters, allowing everyone outside to escape the poison gas."}, {"type": "paragraph", "text": "Once everyone was together, Law told Smoker and Tashigi not to get in his and Luffy's way. Law then told everyone present about a way off the island but had two hours to escape. Smoker ordered the G-5 Marines to go rescue the abducted children and searched for the \"R Building 66\". He said that they would seize the tanker at the harbor and escape. Everyone split up, but Smoker went alone to confront Vergo. Tashigi wanted to go with him, but Smoker told her to look after the G-5 Marines and help everyone escape."}, {"type": "paragraph", "text": "Smoker and Luffy then passed Building B and reached Caesar's location. Before entering Caesar's broadcasting room, Smoker assured Luffy that he would not get in the way of his fight with Caesar, as he wished to defeat Vergo. Smoker observed Luffy's initial assault on Caesar and remembered that before Law freed him from his chains, he ordered Smoker not to touch Caesar since he still had his heart. Smoker left the room to search for Vergo and found him in the SAD production room where Law was also present. He then prepared to fight Vergo, saying that he could not stand to look at trash for too long. Smoker began fighting Vergo, and landed a few hits, sending Vergo to the ground. Smoker then stated that he is the unit commander of G-5, and Vergo should have never laid a hand on his subordinates."}, {"type": "paragraph", "text": "The battle continued until the apparent defeat of Smoker, when he showed to have only acted as a diversion for Law to retrieve his heart and defeat a full body Busoshoku Haki hardened Vergo with one powerful cut from his nodachi. He later left the SAD room with Law after he dismembered Vergo and attached his parts to a railing. Smoker and Law then found a rail car in the corridor between Building R and D. They were soon reunited with the Straw Hats, the kidnapped children, and the G-5 Marines."}, {"type": "paragraph", "text": "Once everyone reached Building R safely, they boarded the rail car and made their escape. Before they reached the outside, it is revealed that Smoker got his heart back. He asked Law what made Caesar think that he had his heart. Law revealed that he never gave Smoker's heart to Caesar in the first place and he gave Monet's heart instead."}, {"type": "paragraph", "text": "The lab escapees finally reached outside where they found Buffalo and Baby 5. Seeing themselves outmatched, Buffalo and Baby 5 grabbed Caesar and tried to make a hasty retreat. Law prepared to stop them himself, but Nami and Usopp insisted Law to allow them to deal with the escaping pair. They successfully defeat Buffalo and Baby 5, and Caesar is captured by Seastone handcuffs fired by Usopp.  After Caesar's downfall, Smoker contacted the G-5 base to send a ship to Punk Hazard. After Law cured the children of the NHC10 and Sanji prepared a meal, everyone then had a feast together. During the party, Smoker's men inform him that they managed to force Caesar to explain how to neutralize the gas. While sitting next to Law and drinking a bowl of soup, Smoker commented that he must be planning on taking advantage of the Straw Hats. Law told him that he was starting to wonder who was using who. Law then told Smoker that their next destination would be Green Bit. Smoker commented if the lives of the Straw Hat crew would ultimately fall at his hands."}, {"type": "paragraph", "text": "After the feast ended, he asked Luffy if he and his crew weren't going to use the tanker. Luffy answered by telling him that they would let the kids use it to get home. While Smoker's subordinates escorted the kids to the tanker, they put up banners and started saying things like: \"The marines are justice and pirates are scum\". The kids, however, said that those pirates were the only people who ever came to help him and want to say their goodbyes to them. The marines respond by pointing their guns at them and continued praising the marines. The kids still insisted that those pirates were good guys. The marines still continued with their own propaganda until Tashigi interrupted them by saying that they are a disgrace. The marines then revealed that if they do not continue to badmouth the pirates, they will come to respect and admire them, much to Smoker's annoyance."}, {"type": "paragraph", "text": "After Law and the Straw Hats left, Smoker allowed Brownbeard and his G-5 marines to go on the island and rescue their remaining comrades. Sometime later, Doflamingo suddenly arrived, restoring Baby 5 and Buffalo's heads to their bodies and proceeding to attack the G-5 marines. After taking out some of the G-5 marines with Haoshoku Haki, Doflamingo demanded Smoker to tell him where Law and the Straw Hats had gone to. Smoker replies that he had no knowledge of it. Unsatisfied with Smoker's answer, Doflamingo promptly attacked and overpowered him and threatened to kill him and the rest of his marine crew. However, before Doflamingo could deliver the killing blow, Kuzan arrived telling Doflamingo to get off of Smoker as the vice admiral is his friend."}, {"type": "paragraph", "text": "Doflamingo ignored Kuzan and attempted to finish off Smoker anyway, but Kuzan quickly froze Doflamingo solid. Doflamingo broke out of the ice and remained unfazed by Kuzan's attack. Having no interest in fighting Kuzan, Doflamingo left Punk Hazard with Buffalo and Baby 5. Smoker then discussed with Kuzan about the latter's current status. Smoker also asked him if he was involved in the underworld, which he neither denied nor confirmed. Instead, he stated that he's still himself, seemingly reassuring Smoker. He told Smoker to be wary of Doflamingo and to ask the Fleet Admiral to dispatch the Admirals as soon as possible. After that, Kuzan also left Punk Hazard after asking everyone to keep quiet about their meeting. A short while later, Smoker filed a report about the events at Punk Hazard to his superiors at Marineford."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1b/Law_Defeats_Smoker.png/revision/latest/scale-to-width-down/210?cb=20131013153102", "caption": "Smoker's heart is removed by Law."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Smoker_in_Tashigi%27s_Body.png/revision/latest/scale-to-width-down/210?cb=20140801104933", "caption": "Smoker in Tashigi's body."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Caesar_Clown_Defeats_The_Straw_Hats_and_The_Marines.png/revision/latest/scale-to-width-down/210?cb=20131010151107", "caption": "Caesar stands triumphantly over Smoker, Tashigi, and three of the Straw Hat Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/50/Punk_Hazard_Counter_Attack_Begins.png/revision/latest/scale-to-width-down/210?cb=20190829214730", "caption": "The counterattack begins."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/42/Smoker_Elbows_Vergo.png/revision/latest/scale-to-width-down/210?cb=20131014190851", "caption": "Smoker's fight with Vergo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Kuzan_Stops_Doflamingo.png/revision/latest/scale-to-width-down/210?cb=20131208022308", "caption": "Kuzan preventing Doflamingo from killing Smoker."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat at Dressrosa, Smoker and Tashigi received the news of Luffy and Law's exploits and were pleased that Issho did not allow the incident to be covered up like with Alabasta."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 3, "content": [{"type": "paragraph", "text": "Smoker and Tashigi went to Delta Island to attend the Pirates Expo undercover. When the Expo's main event began, Smoker went off to investigate Buena Festa."}, {"type": "paragraph", "text": "Smoker infiltrated Festa's lair, where he encountered Law, Sanji, Robin, and Brook. He immediately confronted them and attempted to capture Robin, but was forced away by Sanji. He and Sanji battled for some time, until Sanji questioned him about the Marines working with Festa to send a Buster Call on Delta Island. Smoker was unaware of this plot and was shocked to hear it, and immediately departed for the surface."}, {"type": "paragraph", "text": "Smoker came to the surface, where the legendary pirate Douglas Bullet had torn apart the island and the Buster Call fleet to form a massive colossus. With a second Buster Call on the way, Smoker went to Tashigi, Hina, Koby, and Helmeppo and told them to evacuate the island, though he elected to stay behind."}, {"type": "paragraph", "text": "Later, Smoker ran into Boa Hancock and Buggy and confronted them, but was confronted by Sabo soon afterward. Smoker fought Sabo for a brief period of time, with their powers canceling each other out. Smoker, Sabo, and Hancock were then joined by Law and Luffy, and Law told the group about his plan to take down Bullet's colossus. Luffy, Hancock, and Crocodile proceeded to attack the colossus, allowing Law to cut through its Haki. Smoker and Sabo then unleashed a combined attack on the colossus' shoulder, with unexpected help from a bystanding Rob Lucci, causing the colossus' arm to be severed. Luffy then overwhelmed the colossus' other arm with a massive attack, allowing the group to unleash another combined attack that successfully forced Bullet out of the colossus. Smoker then watched as Luffy defeated Bullet."}, {"type": "paragraph", "text": "With Bullet defeated, Smoker contacted Admiral Kizaru to stop the Buster Call from attacking, allowing all the Marines to leave Delta Island safely."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Smoker vs. Buggy Pirates and Alvida", "elements": []}, {"text": "Smoker vs. Monkey D. Luffy and Sanji (interrupted by Monkey D. Dragon); Luffy fights Smoker by himself in the anime.", "elements": []}, {"text": "Smoker vs. Portgas D. Ace", "elements": []}, {"text": "Smoker and Tashigi vs. Unnamed Pirate with a 50,000,000 Bounty (unseen)", "elements": []}, {"text": "Marines and Shichibukai vs. Whitebeard Pirates and their allies", "elements": [{"text": "Smoker vs. Monkey D. Luffy (interrupted by Boa Hancock)", "elements": []}, {"text": "Smoker vs. Boa Hancock", "elements": []}]}, {"text": "G-5 Unit 01 Marines vs. the Freed New Fish-Man Pirates' Slave Pirates", "elements": []}, {"text": "G-5 Unit 01 Marines vs. Trafalgar Law", "elements": []}, {"text": "G-5 Unit 01 Marines vs. Centaurs", "elements": []}, {"text": "Smoker (in Tashigi's body) vs. Monkey D. Luffy", "elements": []}, {"text": "Smoker (in Tashigi's body), Tashigi (in Smoker's body), Nico Robin, and Franky vs. Caesar Clown (unseen)", "elements": []}, {"text": "Smoker vs. Vergo", "elements": []}, {"text": "Smoker vs. Donquixote Doflamingo (interrupted by Kuzan)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Smoker vs. Gally", "elements": []}, {"text": "Smoker vs. Monkey D. Luffy (Town Square; Loguetown)", "elements": []}, {"text": "Smoker vs. Sanji", "elements": []}, {"text": "Smoker vs. Sabo", "elements": []}, {"text": "Smoker, Luffy, Law, Sabo, Boa Hancock, Crocodile, Buggy, and Rob Lucci vs. Douglas Bullet", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Appearance", "level": 3, "content": [{"type": "paragraph", "text": "In the manga, his hair color is pure white, as opposed to his greenish-grey color in the anime. The fur on his jacket was initially blue, but was later changed to green to follow the anime."}], "images": []}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, the subplot on Smoker's backstory he mentions about Gold Roger is expanded on in Loguetown. However, in the manga, Smoker's comments on Roger were merely just a passing comment and only Roger's face is seen."}, {"type": "paragraph", "text": "Instead of learning about Luffy when he was about to be executed by Buggy and Alvida, Smoker learns about him earlier. He is informed that some pirates are creating havoc in the harbor. Thinking that this crew is the Straw Hat Pirates, Smoker prepares to go there. There he finds an elderly pirate called Crescent Moon Galley who has a bounty of 3,450,000. He and his crew are seen raiding buildings at Loguetown before being captured by Captain Smoker, who was disappointed that Galley was not Luffy since that was the pirate Smoker was hoping to find. Luffy then appears, asking Smoker where the execution gallows are. Not knowing who he is, Smoker shows him the way, using his smoke. Figuring out his true identity later, he heads to the execution platform where he challenges Luffy to a fight. Even without using his Devil Fruit powers, Smoker manages to gain the upper hand against Luffy, who then manages to accidentally send himself flying into another part of town."}, {"type": "paragraph", "text": "Later, Daddy Masterson is seen talking to then-Captain Smoker and asking him to sign a release. Smoker asks him about his daughter and claims it is sad how the Marines' best sniper is reduced to a common bounty hunter. Just as he is about to leave, Smoker tells him to say hi to Carol for him at which Daddy replies; \"I'll tell her Uncle Smoker said hello.\" Immediately after he leaves the room Tashigi asks him if the man was Daddy Masterson and Smoker replies with great praise and from there he refers to him as an equal. In the anime during the race back to the Going Merry, Luffy fights Smoker alone and the Marines attack the ship forcing Nami to pull the Going Merry away from the docks. Sanji's role is placed here rather than the fight with Smoker as he fights the Marines attacking the ship."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Young_Smoker_in_the_Anime.png/revision/latest/scale-to-width-down/210?cb=20131013031434", "caption": "Young Smoker witnesses Gold Roger's execution, as seen in the anime."}]}, {"title": "Jitte", "level": 3, "content": [{"type": "paragraph", "text": "During Episode 488, Smoker was shown using his jitte, even though Hancock had destroyed it earlier."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids version of the anime, Smoker's cigars are removed, and smoke comes out of his mouth due to the power of the Smoke-Smoke Fruit, although his mouth is almost always opened a little where the cigars should be. Because of this, he is renamed 'Chaser'. However, Smoker in the English video games One Piece: Grand Battle and One Piece: Grand Adventure has his cigars strapped to his coat, despite the previous editing. Additionally, his power was changed from smoke to steam."}, {"type": "paragraph", "text": "Another change made to Smoker in the 4Kids dub was removing the kanji for \"justice\" on the back of his jacket, which is also left in the video games."}, {"type": "paragraph", "text": "One final change made to Smoker was during the Loguetown Arc. While hunting for Luffy, Smoker stopped by at Raoul's bar called Gold Rodger and instead of asking for alcoholic drinks like rum, he asked for juice so it could comply to a younger audience."}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "list", "elements": [{"text": "Smoker is shown during the One Piece Premier Show 2012 as one of Chameleone's transformations.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/29/Smoker_Premiere_Show.png/revision/latest/scale-to-width-down/180?cb=20130806055055", "caption": "Smoker as he appears in the show."}]}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Smoker has been the choice character in many forms of merchandise. He has been featured in the series of models Portrait of Pirates."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}, {"text": "Set Sail Pirate Crew!", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "One Piece: Treasure Wars", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the Japanese anime, Smoker was originally voiced by Ginzō Matsuo. However, Matsuo died on August 25, 2001 of an acute sub-arachnoid hemorrhage. Subsequently, Mahito Ōba (the voice of the Narrator) took over the role of Smoker, beginning with Episode 94.", "elements": []}, {"text": "Smoker has cornered Luffy on three occasions before the time-skip, each time the latter was saved by a relative or ally; Dragon, Ace and Hancock. This is similar to how Garp cornered Roger multiple times but was unable to capture him.", "elements": []}, {"text": "In the 5th Japanese fan poll, Smoker was ranked the 24th most popular character.", "elements": []}, {"text": "His birthday is March 14, a Japanese holiday called White Day (coinciding with his smoke powers, and \"white\" theme to his attack names).", "elements": []}, {"text": "Smoker is the first Logia-type Devil Fruit user to be introduced in the series. Coincidentally, he is also the first Marine introduced in the series to possess a Devil Fruit.", "elements": []}, {"text": "Along with Tashigi, Smoker has appeared in more sagas than any other character outside the Straw Hat Pirates.", "elements": []}, {"text": "Smoker shares some similarities with Admiral Fujitora.", "elements": [{"text": "Both of them are Marine officers.", "elements": []}, {"text": "Both hated the Shichibukai as they wanted to abolish the system.", "elements": []}, {"text": "Both of them arrested a Shichibukai after they were defeated by Luffy (Crocodile for Smoker and Doflamingo for Fujitora).", "elements": []}, {"text": "They have also received assistance from Luffy at some point. Smoker was saved from drowning after Luffy ordered Zoro to rescue him, and Issho was informed by Luffy about the thugs deceiving him.", "elements": []}, {"text": "Both ultimately let the Straw Hats escape (Smoker let Luffy go at Alabasta and Fujitora let the Straw Hats escape Dressrosa).", "elements": []}]}, {"text": "Smoker's favorite food is smoked chicken.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Smoker – Wikipedia article about smokers in general, in which Smoker's name is derived from.", "elements": []}]}], "images": []}]}