{"sections": [{"title": "Makino", "level": 1, "content": [{"type": "paragraph", "text": "Makino is a bartender from Monkey D. Luffy's home town, Foosha Village. She is the owner of Partys Bar."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Makino is a young woman with brown eyes and black hair (dark green in the anime) that goes up to just above her shoulders. When she was first introduced, ten years before the current storyline, she wore a yellow kerchief, an orange blouse with black sleeves and a long light blue skirt and orange sneakers with white soles. Although her clothing changes with her appearances, they are usually similar to the ones she was introduced with. By the time she met Ace, she wore a white blouse with no sleeves, and underneath it a pink-striped shirt."}, {"type": "paragraph", "text": "Twenty two years ago, her appearance was the same as it is now except her bandana around her head was yellow and covered her forehead more."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Makino is a very kind person, and was a close friend of Shanks, his crew, and Luffy. Makino appears to be a very prominent figure in Foosha Village."}, {"type": "paragraph", "text": "Her fondness for Luffy makes her appear as an adoptive mother or sister, showing interest in and supporting whatever Luffy's dream is. She seems content with whatever lifestyle Luffy chooses so long as he is happy and amongst friends. She also gave him food under the joke about him running up a \"treasure tab\". She seems to have a listener's ear and often appears alongside Woop Slap whenever he discusses Luffy's dream while the rest of the village seems too busy celebrating his success as a pirate."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Makino is well acquainted with Luffy, having known him since he was a child. After Ace's death, Makino was deeply upset when Dadan told her that he was suffering the most. After the timeskip, Makino was pleased to hear that Luffy returned and a short time later when his bounty had risen."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Makino is on good terms with Shanks and his crew, having them once as guests at her bar."}], "images": []}, {"title": "Curly Dadan", "level": 4, "content": [{"type": "paragraph", "text": "Makino treats Dadan as one of the regular customer at the Partys bar and often paid a visit to her house during Luffy and Ace's childhood times, often delivery imported ale and even food for Dadan's group. She also stopped Dadan from harming Garp further after the Marineford War, saying that Garp also grieved over Ace's death."}], "images": []}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "Wanting to thank Shanks properly, Ace turned to Makino to learn proper manners. Makino felt amused although he was quite aggravated by her response. She was also saddened over Ace's death."}], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Makino is on good terms with Garp as well as she often saw Garp disciplined Luffy and Ace at Dadan's house during his vacation. Makino defended Garp from Dadan after the Marineford War, stating that Garp also grieved over Ace's death."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Run-in with Higuma", "level": 4, "content": [{"type": "paragraph", "text": "Makino first appeared in the story serving Luffy, Shanks, and his crew at Partys Bar. She was one of the only two villagers who dared approach the bandit Higuma when he took Luffy after she ran to look for the mayor, the other being the mayor himself."}], "images": []}, {"title": "Meeting Ace", "level": 4, "content": [{"type": "paragraph", "text": "During Ace and Luffy's childhood under Curly Dadan's care, she appeared to have brought some new clothes for them and Sabo. In the background, there seemed to be several males looking at her (in a manner similar to Sanji when he meets a pretty lady) implying she was very popular in the town and seemed to spoil Luffy as she told Luffy to keep things a secret from Garp."}, {"type": "paragraph", "text": "Later, while bringing some imported ale to the bandit's hideout, Ace asked her the proper way to make an introduction since he wanted to meet Shanks after hearing so much about him from Luffy. After Ace explained his reason to her, she just rested her head in her hand and looked at him endearingly, causing Ace to blush and asked what she was doing. She then laughed and started to answer Ace's question. Makino saw Ace leave on a small boat off the coast of Mt. Corvo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Ace_Annoyed_at_Makino.png/revision/latest/scale-to-width-down/210?cb=20130523012927", "caption": "Ace aggravated at Makino's amusement."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Romance Dawn Arc", "level": 4, "content": [{"type": "paragraph", "text": "Makino was also present at Luffy's departure from their village via a small dinghy. She stated how much she would miss him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4b/Makino_and_Woop_Slap_at_Luffy%27s_Departure.png/revision/latest/scale-to-width-down/210?cb=20170827173347", "caption": "The villagers watch as Luffy departs."}]}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Luffy received his first bounty of 30,000,000 for defeating East Blue's most fearsome pirates such as Buggy, Don Krieg, and Arlong, the newspaper report arrived in Foosha Village where Makino was working at an inn. At first, the citizens cheered that a local citizen was famous, but Woop Slap quelled the cheering, saying it was shameful."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Makino was seen once again talking to the mayor when Luffy earned his 300,000,000 bounty. She remarked that Luffy's \"pet\" is cute and that he had found great friends and seemed to be having fun."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Garp established a Marine Headquarters at Foosha Village to protect the town from the sudden rise in pirate and bandit violence after the Battle of Marineford, Makino stopped Dadan from beating Garp over the death of Ace."}, {"type": "paragraph", "text": "She commented on how Garp was suffering from Ace's death worse than anyone. Dadan responded by saying that Luffy was the one who was suffering the most. This triggered a memory of a time with Ace and Luffy when she commenting on Ace's rudeness. This caused her to break into tears and run off."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ab/Makino_Protects_Garp.png/revision/latest/scale-to-width-down/210?cb=20130523014056", "caption": "Makino stops Dadan from hitting Garp."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "During the Straw Hats' absence, Makino had a child. She was seen in Foosha Village holding her baby while the citizens rejoiced about Luffy's return."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the news of Luffy's new bounty after his victory over Doflamingo reached Dawn Island, the people of Foosha Village celebrated along with the Dadan Family."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "She appeared looking towards the sea, with her child in her arms, while she wondered how Luffy would do. At that moment, Woop Slap appeared complaining that Luffy had reappeared in the newspaper, surprising her when he showed the news about the events in Totto Land."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, Makino read some distressing news concerning Sabo. She was so upset that she closed her bar for the day."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She makes an appearance in Shanks's story mode ending in One Piece: Grand Battle 3 when Rockstar delivers a message for Whitebeard to Woop Slap and is seen laughing at his error in the background.", "elements": []}, {"text": "Oda stated that the father of Makino's son is \"probably that person\". It is currently unknown who this person is.", "elements": []}, {"text": "Makino's favorite foods are juice and cake (things that you can enjoy with children).", "elements": []}]}], "images": []}]}