{"sections": [{"title": "Higuma", "level": 1, "content": [{"type": "paragraph", "text": "Higuma was a mountain bandit and the leader of the Higuma Bandits. He was the first antagonist to be introduced in the series, and the first of three in the Romance Dawn Arc (third of three in the anime)."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Higuma was a tall, dark-skinned man with black hair, a black goatee, and an X-shaped scar above his right eye. He wore a long red coat over a white shirt, black trousers, and a golden necklace."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Higuma was an arrogant man who was used to getting his own way. He walked about as though he owned the world, and was prepared to kill if needed. He showed his low opinion of pirates, calling them cowards who sail with their ships on the sea. If anyone resisted him, he would threaten them with his status as a killer and a wanted man. In truth, he was a coward, and proved this twice; when his men were wiped out, and when he faced the Lord of the Coast."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Higuma was the leader of his own pack of bandits, and managed to earn a bounty of 8,000,000, which is higher than the average 3,000,000 of East Blue. He also had some strategic sense, as he used his own insult towards pirates sailing the sea to his advantage to hide out in the sea, believing that nobody would look for him there, and knew about the existence of Devil Fruits and their weakness, while most in the East Blue would dismiss them as myths."}, {"type": "paragraph", "text": "However, for all of his limited fame that he tended to flaunt, he was rather weak, having turned to taking a child hostage and using a smoke bomb as cover the moment the pirate crew that he bullied defeated all of his men. His strategy of hiding out in the sea to evade pirates was negated as he was ignorant about the Sea King that lived near the coast, which, coupled with his helplessness when his escape plan backfired, cost him his life."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Higuma carried a sword with him, although his skill as a swordsman is unknown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in his life, Higuma became a mountain bandit and earned a bounty of 8,000,000 for killing 56 people."}], "images": []}, {"title": "Romance Dawn Arc", "level": 3, "content": [{"type": "paragraph", "text": "While the Red Hair Pirates were staying in Foosha Village during Monkey D. Luffy's childhood, Higuma and his bandits entered the Partys Bar looking for sake. After commenting on how stupid the pirates looked, Higuma told Makino that he and his bandits simply wanted ten barrels of sake and were not there to cause trouble, only to be surprised when Makino told him that they had no more sake. When Higuma asked her what the pirates were drinking, Makino admitted it was sake before stating that was all they had, prompting Shanks, who was sitting nearby, to offer Higuma the last bottle of sake as an apology. However, not content with this much sake, Higuma angrily smashed the bottle, sending its contents flying all over Shanks, before showing Shanks his wanted poster and bragging about having a bounty of 8,000,000 and how he had killed 56 people. Higuma warned Shanks to not mess with him again, and when Shanks attempted to clean up the mess, Higuma slashed the rest of his food with his sword, dirtying Shanks even more, before leaving the bar with his bandits, whom he told that they were going to the next town in search of sake."}, {"type": "paragraph", "text": "Later, as Luffy was sitting in the Partys Bar and talking about Shanks's action with Makino, Higuma and his bandits returned, with Higuma noting that it is quiet without the pirates around. After sitting down with his bandits, Higuma demanded that Makino bring them some sake, While drinking, Higuma stated that he wanted to kill cowards like Shanks on sight and claimed that pirates only know how to act cool, which prompted Luffy to berate him for underestimating Shanks like this."}, {"type": "paragraph", "text": "This angered Higuma, who dragged Luffy outside before he and his bandits tried to beat him up. However, they found that punches and kicks would not hurt Luffy, and upon stretching Luffy's cheek, Higuma surmised that he was a \"Rubber Man\". After throwing Luffy away, Higuma noted that he could make a lot of money by selling Luffy to a circus before stomping on Luffy's head and forcing him to the ground when the latter tried to attack him. Higuma asked Luffy if they said something that made him mad, and as Luffy told him to apologize immediately, Woop Slap arrived and begged Higuma to release Luffy in exchange for money. Noting that elders like Woop Slap know how to deal with this sort of situation, Higuma proclaimed that it was too late to save Luffy because he hated weaklings insulting him. When Luffy claimed it was his fault, Higuma unsheathed his sword and prepared to kill him, only to be interrupted by the arrival of Shanks."}, {"type": "paragraph", "text": "Questioning why Shanks had returned, Higuma told him to not come any closer unless he wanted to get shot. After Lucky Roo killed a bandit who put a gun to Shanks's head and Shanks proclaimed that he would never forgive someone who hurt his friends, an amused Higuma claimed they would destroy pirates like Shanks who float around on a ship all day before having his bandits attack the pirates, only for Benn Beckman to effortlessly defeat them. Higuma nervously claimed that Luffy is the one who started this, but Shanks stated that it did not matter because there is a bounty on Higuma's head. Realizing he was outmatched, Higuma threw down a smoke bomb and grabbed Luffy before escaping. Soon afterward, Higuma got a boat and set sail on the ocean with Luffy in tow. After congratulating himself for his strategy of escaping via boat, Higuma decided that he no longer needed Luffy and kicked him into the ocean. However, he was caught off guard by the arrival of the Lord of the Coast, who devoured him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Higuma_Mocks_Shanks.png/revision/latest/scale-to-width-down/210?cb=20130708223112", "caption": "Higuma mocks Shanks."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Lord_of_the_Coast_Eats_Higuma.png/revision/latest/scale-to-width-down/210?cb=20130301083359", "caption": "Higuma meets his demise."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "His name refers to a species of bear indigenous to regions of northeast Asia, most notably Hokkaido. It is generally understood that Viz Media implemented his English epithet \"The Bear\" to retain the character's original name while also informing the English-speaking audience of its meaning."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Before his death, Higuma bragged about having an 8,000,000 bounty on his head and even carried around his own \"Wanted\" poster to prove it. This is the first mention of bounties in the manga.", "elements": []}, {"text": "He was the first mountain bandit to appear in the series.", "elements": []}, {"text": "Higuma shares some similarities with Agotogi: both are bandits and both served as the main villain of another character's childhood flashback (Luffy and Vivi respectively).", "elements": []}, {"text": "Higuma's favorite foods are sake, mountain vegetables, and bear meat.", "elements": []}]}], "images": []}]}