{"sections": [{"title": "Woop Slap", "level": 1, "content": [{"type": "paragraph", "text": "Woop Slap is the mayor from Monkey D. Luffy's hometown, Foosha Village."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Woop Slap has a cleft chin, wears oval glasses, and has a mustache and a beard. During his younger days, his facial hair is medium-amounted and black, but currently they have grown long enough to become a thick mustache and a goatee, as well as turning grayish-white. He wears simple clothes and a hat that changes with his appearance, but they are similar to each other. He currently wields a walking cane from old age."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "His criticism of the most notorious citizen of the village seems to come more from the fact Woop Slap is a government official himself, thus he finds Luffy and by extension, his father, inciting war against the World Government and Marines as absurd. Regardless of thinking that Luffy's choice in piracy would bring shame to the village and criticizes it from time to time, he does care for those from his village, as he questioned about Luffy's welfare. He seems to be a nice and admired person within his own village, as he managed to maintain his position as mayor for a decade."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 3, "content": [{"type": "paragraph", "text": "Although Woop Slap often criticizes Monkey D. Luffy's choice to become a pirate and his growing infamy, he seems to actually care for his well-being, such as when he pleaded for Higuma to spare Luffy's life when he was a young boy. He believed that Luffy is better than the choice of his crew who became infamous with him, referring to them as \"freaks\". Woop Slap knows of how Luffy was born and his origin. Woop Slap also questioned Garp on what happened to Luffy after the battle, worrying about the boy's safety. However, he does not seem pleased to learn that the Straw Hat Pirates have revived two years later."}], "images": []}, {"title": "Monkey D. Garp", "level": 3, "content": [{"type": "paragraph", "text": "He is familiar with Vice Admiral Monkey D. Garp and his family (including Dragon, who few people knew about until recently), stating how he thinks all three generations of Garp's family are crazy. He also knows about Garp leaving his grandsons at the care of Curly Dadan, a mountain bandit boss, something that only he and Makino in the village knew about. Regardless, they seem to be close friends, as the mayor asked about how Luffy was upon Garp's return."}], "images": []}, {"title": "Makino", "level": 3, "content": [{"type": "paragraph", "text": "Woop Slap seems to talk to Makino often about Luffy as she appears to be the only one in the village willing to listen to him."}], "images": []}, {"title": "Dadan", "level": 3, "content": [{"type": "paragraph", "text": "He appears to be on good terms with Curly Dadan. He is the first one to mention her existence by wondering if Dadan knew about the Enies Lobby incident."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Shiki's Breakout", "level": 4, "content": [{"type": "paragraph", "text": "Twenty-two years ago, Woop Slap appears to be wearing a Rastafarian hat and talking with Makino about Garp."}], "images": []}, {"title": "Run-in with Higuma", "level": 4, "content": [{"type": "paragraph", "text": "Twelve years ago, Woop Slap objected to Luffy's choice of being a pirate, saying it would bring shame to their village, but was the first person to stick up for Luffy during his tussle with Higuma."}, {"type": "paragraph", "text": "When Luffy later left the village as a beginner pirate, the mayor once again voiced his opposition."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4b/Makino_and_Woop_Slap_at_Luffy%27s_Departure.png/revision/latest/scale-to-width-down/210?cb=20170827173347", "caption": "The villagers watch as Luffy departs."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Luffy received his first bounty of 30,000,000 for defeating East Blue's most fearsome pirates—Buggy, Don Krieg, and Arlong—and the newspaper report got to Foosha Village, Woop Slap tried to stop the citizens from cheering, saying that this infamy will bring shame to their village, but noted that Luffy's first high crime act is perhaps due to fate."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Luffy and his crew attacked Enies Lobby and earning his third bounty of 300,000,000, Woop Slap claimed that Luffy's crew, who all have their own bounties, are freaks compared to Luffy himself. He also questioned if Dadan knew about Luffy's challenge to Enies Lobby."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war between the Marines and the Whitebeard Pirates, the news had reported that Portgas D. Ace and Edward Newgate had both died, and Luffy's whereabouts were unknown. When Garp returned to the village to put up protection against the rise of pirates due to the war's results, Woop Slap asked the vice admiral about Luffy, and Garp informed him that Luffy escaped Marineford in a submarine."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Two years later, as the news of the Straw Hats' return spread across the world, Woop Slap was seen again in Foosha Village. As the citizens rejoiced, Woop Slap did not seem amused, just like how he was with Luffy's previous bounties."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the news of Luffy's new bounty after his victory over Doflamingo reached Dawn Island, the people of Foosha Village celebrated along with the Dadan Family. Once again, Woop Slap was the only person to be unamused."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "He appears complaining to Makino that Luffy has reappeared in the newspaper, surprising her when he shows the news about the events in Totto Land."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece Grand Battle 3", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Woop Slap makes a cameo appearance in One Piece: Grand Battle 3 in the story mode ending for Shanks when Rockstar delivers a letter to the wrong Whitebeard.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 1 and Episode 4, Woop Slap makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 28), His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Woop Slap's name and knowledge about Luffy's birth and origin.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 440 and Episode 324, Woop Slap assesses Luffy's crew and his family.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 96 and Episode 45.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 590 and Episode 505.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 62 Chapter 614, cover story: From the Decks of the World Vol. 2.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 806.", "elements": []}, {"text": "↑  One Piece Anime — Episode 878.", "elements": []}]}], "images": []}]}