{"sections": [{"title": "Rika", "level": 1, "content": [{"type": "paragraph", "text": "Rika is a girl who lives in Shells Town. She currently serves as a waitress at the 153rd Marine Branch."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rika is a young girl with black eyes and brown hair with pigtails. She wore a striped turquoise and purple shirt with a white hood."}, {"type": "paragraph", "text": "After two years, her hair looks longer than before, and she has grown taller. She wears a dark colored apron with the Marine symbol and a striped dress with a hood. She wears black shoes and a bandanna tied over her head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Rika is a gentle and kind girl, as she offers Zoro some food, but is angered when her friends are threatened."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "She is a cook, and she makes a \"sweet and mild curry\" that is extremely popular among the marines at her branch."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Romance Dawn Arc", "level": 4, "content": [{"type": "paragraph", "text": "Rika first appeared when she tried to thank Zoro by offering him onigiri while he was imprisoned, but he refused and told her to go away. Helmeppo then came in and took them away from her rudely, saying that if she gave them to Zoro it would be as if she were the accomplice of a criminal, but he then spit them out complaining that the onigiri had sugar in them instead of salt. Rika replied saying she thought it would make them taste better. Helmeppo then ordered a marine standing behind him to throw her out and he reluctantly does so, but luckily, Rika was caught by Luffy before anything bad could happen."}, {"type": "paragraph", "text": "The reason Zoro was imprisoned by the Marines was because he defended Rika when she was nearly attacked by Helmeppo's pet wolf. Because Helmeppo saw this as a crime towards himself, he ordered Zoro to stay imprisoned for thirty days. Zoro, not wanting to cause any more trouble, accepted."}], "images": []}, {"title": "Diary of Koby-Meppo", "level": 4, "content": [{"type": "paragraph", "text": "Rika later becomes friends with both Helmeppo and Koby during their stay in Shells Town, and becomes upset when the two leave with Vice Admiral Garp."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, she appears to be more mature, and is training at the Marine base in Shells Town to become a waitress. She seems to be much better at cooking, and is popular among the Marines. She also has a bounty poster of Monkey D. Luffy hanging on her workplace."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In Episode 2, Rika is seen bringing food to Zoro which the food in the original anime was Riceballs. However in the 4kids' edits, the riceballs were changed to three cookies. Also, when Helmeppo took one and ate it, the third cookie was still in place when she offered them to Zoro."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Belly", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She later appeared in a filler episode as well as TV Special 4 where she is friends with Ninjin, Piiman and Tamanegi.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 3 and Episode 2.", "elements": []}, {"text": "↑  https://one-piece.com/news/detail/20171102_6345/", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 78, Oda reveals that Rika's curry is well-liked.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 10 Chapter 85, cover story: Diary of Koby-Meppo Vol. 3, Rika appears on the cover page eating onigiri along with Helmeppo and Koby.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 14 Chapter 118, cover story: Diary of Koby-Meppo Vol. 29, Rika appears on the cover page. She gets upset when the marines inform her that Koby and Helmeppo left.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 616, cover story: From the Decks of the World Vol. 4.", "elements": []}]}], "images": []}]}