{"sections": [{"title": "Cabaji", "level": 1, "content": [{"type": "paragraph", "text": "Cabaji the Acrobat is the Buggy Pirates Chief of Staff, and a member of the Buggy and Alvida Alliance. He is an acrobat swordsman. He is currently a member of Buggy's Delivery."}, {"type": "paragraph", "text": "Due to his actions, he can be considered the tertiary antagonist of the Orange Town Arc, and a minor antagonist in the Loguetown Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cabaji is a tall slender man with a unique hairstyle that covers half of his face. In the manga, his hair appears black. However, in the anime his hair is light green where it is shaved and dark green where it is longer. He is usually seen wearing a large blue and white checkered scarf that covers the lower portion of his face, a sleeveless brown coat (purple in the anime) reaching down to his knees, white pants larger near the end and held up by a white sash (light blue in the anime), and white shoes. His hair is particularly interesting in its design, long on one side and a parallel shaved design on the other."}, {"type": "paragraph", "text": "During the Zou Arc, he shows off wearing a white top hat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Cabaji is always serious, mysterious, and elegant. He is a proficient acrobatic fighter as well as somewhat formidable as an opponent. He appears to be concerned somewhat for his captain, along with Mohji. He is usually by Buggy's side, unlike Mohji, who is ordered to do other things. Cabaji does not seem to care for Mohji's pet lion, Richie, at all, he even used it as a shield from the Buggy Ball just to prevent himself from getting dirty."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Buggy Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Mohji shows respect and loyalty for his captain, Buggy, and also shows great appreciation for him, such as when he cried in sadness when he thought Buggy was dead or when he was taken to Impel Down, or also great joy when he returned after the Marineford war."}, {"type": "paragraph", "text": "He has a constant rivalry with Mohji, both wanting to show who is the best in the crew. When Alvida took over the crew after Buggy was arrested, he showed fear towards her."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "After Zoro beat him, like the rest of the crew, he has a grudge over the Straw Hat Pirates after being defeated by them."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Cabaji has significant physical strength, shown when he was able to lift Richie with one arm and send Mohji flying with a single kick. In combat, he fights with a combination of swordplay and acrobatics (mostly on a unicycle) to fight his enemies, (he has also shown skills with sword swallowing) that he calls Carnival Tricks (曲技, Kyokugi, Acrobat Techniques in the Funimation dub). Most of his attacks have names based on circus acts. He is not afraid to play dirty and take advantage of weakened foes and will strike a wounded man when he is already hurt without a second thought. He attacks Zoro in this very manner."}], "images": []}, {"title": "Various Tricks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Kyokugi! Kaji Oyaji (曲技! 火事おやじ, Kyokugi! Kaji Oyaji, literally meaning \"Acrobatics! Old Man's Flame\"): Cabaji breathes fire. This was first used against Roronoa Zoro when they fought. This attack is called The Breath of Death in the Viz Manga, Blazing Breath in the 4Kids dub, and Arsonist Technique in the FUNimation dub.", "elements": []}, {"text": "Kyokugi! Yukemuri Satsujin Jiken (曲技! 湯けむり殺人事件, Kyokugi! Yukemuri Satsujin Jiken, literally meaning \"Acrobatics! Murder Case in the Hot Spring's Steam\"): By spinning his sword around quickly, a cloud of dust is formed. Cabaji then pulls a \"sneak attack\" on the opponent. This is called Murder at the Steambath in the Viz Manga and FUNimation dub and Extreme Wrath at the Steambath in the 4Kids dub.", "elements": []}]}, {"type": "list", "elements": [{"text": "Kyokugi! Kamikaze Hyakkoma Gekijo (曲技! カミカゼ百コマ劇場, Kyokugi! Kamikaze Hyakkoma Gekijō, literally meaning \"Acrobatics! Theater of One Hundred Kamikaze Tops\"): Cabaji releases hundreds of tops at his opponent, used as a distraction and later they have explosives put in them. This is called Dance of 100 Kamikaze Tops in the Viz Manga and FUNimation dub and Dance of 100 Tumultous Tops in the 4Kids dub.", "elements": []}, {"text": "Kyokugi! Noryo Uchiage Hanabi (曲技! 納涼打ち上げ花火, Kyokugi! Nōryō Uchiage Hanabi, literally meaning \"Acrobatics! Cool Evening Firework Launch\"): After performing Acrobatics! Let's Climb a Mountain, Cabaji leaps off of the top of the wall, high into the air. In the English versions, this is called Fireworks in the Cool Summer Breeze. Usually followed by Wheel Stab.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d9/Kyokugi%21_Kamikaze_Hyakkoma_Gekij%C5%8D..png/revision/latest/scale-to-width-down/230?cb=20130810202853", "caption": "Kyokugi! Kamikaze Hyakkoma Gekijō."}]}, {"title": "Anime Only", "level": 4, "content": [{"type": "list", "elements": [{"text": "Kyokugi! Sotennenshoku Carnival (曲技!　総天然色カーニバル, Kyokugi! Sōtennenshoku Kānibaru, literally meaning \"Acrobatics! All Natural Color Carnival\"): A projectile attack, waves of several colors shoot from his sword. This is called Carnival of Colors in the 4Kids and FUNimation dubs.", "elements": []}, {"text": "Kyokugi! Sarumawashi (曲技! 猿回し, Kyokugi! Sarumawashi, literally meaning \"Acrobatics! Monkey Spinning\") This is called Acrobat Technique! Monkey Showmen in the FUNimation dub.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Along with his acrobatic skills, which he uses to glide to enormous heights on his unicycle, he has displayed a fondness for using both daggers and a sword during his fights, not unlike his captain. He also uses razor-sharp spinning tops and has a flame breath. He can also swallow swords with ease, as witnessed when he pulls out a sword from his mouth when the town mayor comes to challenge Buggy. Also, if necessary, in Chibi Buggy Pirate Adventure, he has shown to be fairly skilled in hand to hand combat after his sword was broken."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Orange Town Arc", "level": 4, "content": [{"type": "paragraph", "text": "Cabaji is at Buggy's side when he first appears. When Boodle appeared before them and challenged Buggy, Cabaji wanted to slice him up, but Buggy told him to stand down, since the mayor had challenged Buggy. However, after Luffy successfully bounced back a Buggy Ball and destroyed much of Buggy's crew, Cabaji was forced to use Richie the Lion as a shield in order to survive the ricocheted cannonball's effects. He then jumped back into the fray to execute Luffy, but was halted by Zoro, who challenged him to a duel."}, {"type": "paragraph", "text": "He proceeded to fight with Zoro and played dirty by striking Zoro's wounds whenever he had the chance. He also created flames through his breath and breathed directly into Zoro's face. However, once Cabaji was knocked off his unicycle, he became angered and attacked with a slew of spinning tops and more deadly acrobatic maneuvers. Buggy tried to help him by sending his arm to help hold Zoro in place for Cabaji's strike, but Luffy did not allow Buggy to interfere in Zoro's duel. Zoro then took his own sword and slit his own side to ensure that he can battle Cabaji even when he was greatly injured. Cabaji recognized Zoro's honor and thought of this as the perfect opportunity to take him down."}, {"type": "paragraph", "text": "Zoro declared that if he cannot topple all men who call themselves swordsmen, such as Cabaji, then he should give up his own dream to become the greatest swordsman. Cabaji was defeated by Zoro's \"Oni Giri\" which cut open his chest. After Cabaji fell to the ground, Zoro also fell, claiming that he needed a rest after the grueling struggle. As he fell to the ground, Cabaji is stunned that he, along with Buggy's deadly crew were all defeated by \"common thieves\". Zoro responded by saying they are not common thieves; they are pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Zoro_vs._Cabaji.png/revision/latest/scale-to-width-down/210?cb=20121215004708", "caption": "Cabaji kicking Zoro's stab wound."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/Zoro_Defeats_Cabaji.png/revision/latest/scale-to-width-down/210?cb=20130205201234", "caption": "Cabaji defeated by Zoro."}]}, {"title": "Buggy's Crew Adventure Chronicles", "level": 4, "content": [{"type": "paragraph", "text": "After Buggy was defeated by Luffy, Cabaji and the rest of the crew fled Orange Town and then mourned the loss of their captain. Cabaji and Mohji fought for the title of the next captain but were both knocked out by a sleepwalking Richie, who gained the title (though lost it just as quick). After Buggy resurfaced, Cabaji returned to his former position. Despite their frequent bickering, Cabaji and Mohji team up to defeat the Kumate Tribe and rescue the other crew members."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8a/Richie_Beats_Cabaji_and_Mohji.png/revision/latest/scale-to-width-down/210?cb=20130719115816", "caption": "Cabaji and Mohji defeated by Richie."}]}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Loguetown attack, Cabaji accompanied Buggy and Alvida to fight against the Straw Hats and the Marines. Cabaji quickly pinned down Luffy right on top of the execution stand where Gold Roger had been killed. He sat on top of and taunted Luffy, asking him where Zoro is. However, despite wanting to have a rematch with Zoro, this duel did not happen. He and Alvida are seen together and watching as Buggy was about to slice off Luffy's head. In that instant, as Nami had predicted, the stormy weather electrocuted Buggy through his sword and he was fried along with the execution stand."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Cabaji celebrated alongside the rest of the crew when Portgas D. Ace joined their party. They then partied together."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Cabaji is seen again with Alvida and the rest of Buggy's pirates, pleading with Alvida to go to Impel Down to rescue Buggy. However, he and the rest of the crew eventually decided to proceed on while honoring Buggy's death after Alvida told them to rescue Buggy by themselves, and noted they will die trying."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Buggy returned to the crew, Cabaji lied that he and Mohji never gave up on him. Cabaji rode a unicycle while introducing himself to the Impel Down prisoners along with Mohji."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After Buggy became a member of the Shichibukai, Cabaji along with the rest of Buggy's crew were pardoned."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "3D2Y", "level": 4, "content": [{"type": "paragraph", "text": "Immediately after Buggy became a new Shichibukai, the Buggy Pirates received the summons to fight against the World Pirates. Coincidentally, they happened to come upon the World Pirates' ship and saw that Luffy and Boa Hancock were fighting with Sebastian. Under Buggy's command, Cabaji and the rest of the crew invaded the enemy ship. On board the ship, they watched as Byrnndi World fought and defeated Luffy. Buggy then ordered them to help revive him."}, {"type": "paragraph", "text": "Later, they encountered Gairam who then attacked them with his Kyubu Kyubu no Mi Cube Booster attack. Alongside Buggy and Mr. 3, Cabaji was caught in the middle of the attack and was forced to continuously dodge to onslaught of cubes. Later, when the Tightrope Walking Funan Bros began crying because they were moved by Buggy's supposed words of encouragement for Luffy, Cabaji and Mohji noticed that something was up and that Buggy was only thinking about himself. However, when the whole crew began cheering Buggy's name, Cabaji asked Mohji what they should do, to which Mohji responded that they should just go with the flow. Hearing that Cabaji joined in with the rest of the crew in their cheering. However, when Gairam began attacking again, the crew made a run for it while Mr. 3 fended off the attack. Cabaji stood in surprise when Buggy was turned into a cube by Gairam. When Buggy said he still had a trick up his sleeve that could destroy a town, Cabaji asked him if it was the Buggy Ball, to which Buggy then screams at him for revealing the surprise. Buggy then used the Muggy Ball which created a smoke cloud which allowed Hancock to attack Gairam. Upon the smoke clearing up, the crew saw Gairam defeated and believed that Buggy had been the one to do so; however, Cabaji and Mohji had their doubts. But instead of questioning them, the two thought it would be best to go with the flow again and joined in on the cheering."}, {"type": "paragraph", "text": "The crew then made it outside the enemy ship and saw a fleet of Marine ships approaching. The Marines began firing and as such, Cabaji and the rest of the crew escaped back to their ship."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/Buggy_Pirates_see_Luffy_on_the_Groseade.png/revision/latest/scale-to-width-down/210?cb=20191202151947", "caption": "Cabaji and the rest of Buggy Pirates surprised to see Luffy and Boa Hancock fighting together on the Groseade."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Cabaji made his first appearance after the timeskip at Karai Bari Island at Buggy's Delivery, where he was sitting behind Buggy at a feast with Mohji, Richie, Alvida, and Galdino as they celebrated the defeat of Donquixote Doflamingo and the positive effect it had on their business. Mohji revealed that the New Giant Warrior Pirates had quit the dispatch company to align themselves under the flag of the Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Buggy_Showing_Off_as_His_Crew_Feasts.png/revision/latest/scale-to-width-down/235?cb=20160807115245", "caption": "Buggy's dispatch company celebrates Donquixote Doflamingo's defeat."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the abolishment of the Shichibukai system, those on Karai Bari Island were confronted by a Marine fleet led by Stainless."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cabaji vs. Roronoa Zoro", "elements": []}, {"text": "Cabaji vs. Mohji", "elements": []}, {"text": "Cabaji, Mohji, Buggy, and Alvida vs. Kumate Tribe", "elements": []}, {"text": "Cabaji vs. Marine soldiers", "elements": []}, {"text": "Buggy and Alvida Alliance vs. Smoker", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids dub, Cabaji speaks with a French accent."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Legend of the Rainbow Island", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cabaji was voted as the 25th most popular character in One Piece in the first Japanese popularity poll.", "elements": []}, {"text": "Cabaji's favorite food is popcorn.", "elements": []}]}], "images": []}]}