{"sections": [{"title": "Mohji", "level": 1, "content": [{"type": "paragraph", "text": "Mohji the Beast Tamer is a pirate and the first mate of the Buggy Pirates and a member of the Buggy and Alvida Alliance. He is a pet tamer, usually accompanied by his pet lion Richie. He is currently a member of Buggy's Delivery."}, {"type": "paragraph", "text": "Due to his actions, he can be considered the secondary antagonist of the Orange Town Arc, and a minor antagonist in the Loguetown Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mohji is a man with muscular torso and thick lips. He wears a white fur vest that covers the area of his chest, green pants (blue in the anime) held up by a black sash (yellow in the anime), and shoes in the shape of animal white fur feet."}, {"type": "paragraph", "text": "Every time Mohji appears in the series for an arc, his hairstyle changes. During the Orange Town Arc, his hair was shaped like a teddy bear. In the Loguetown Arc he wears a pink helmet with bunny ears sticking out. When the group makes it into the Grand Line, during the Jaya Arc his hair is shaped like a lion's mane. In the Impel Down Arc, his hairstyle causes him to resemble a ram, somewhat similar to Merry."}, {"type": "paragraph", "text": "After the timeskip Mohji, along with his pet Richie, had apparently gained much weight where Mohji now has a very plump appearance. He also wears a dark blue fur suit."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mohji is quite pompous and, at times, silly. He has also displayed a strong rivalry with Cabaji, Buggy's second mate, during the Buggy mini-arc. He tends to treat Richie better than most other people and adores the big lion. He even takes it offensively when Richie is used as a shield by Cabaji against Luffy, Zoro and Nami."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Buggy Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Mohji shows respect and loyalty for his captain, Buggy, and also shows great appreciation for him, such as when he cried in sadness when he thought Buggy was dead or when he was taken to Impel Down, or also great joy when he returned after the Marineford war."}, {"type": "paragraph", "text": "He has a constant rivalry with Cabaji, both wanting to show who is the best in the crew. He shows great affection to his pet lion, Richie. When Alvida took over the crew after Buggy was arrested, he showed fear towards her."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "After Luffy beat him and Richie, like the rest of the crew, he has a grudge over the Straw Hat Pirates after being defeated by them."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Mohji claims to have the ability to control any animal he wishes. However, he was not able to tame Chouchou, who bit Mohji when he tried. He has yet to prove his ability in the series outside of his pet, a lion named Richie (who seems to have an emphatic link with him). Mohji usually opts to use him in battle rather than fight himself. He is, however, fast and agile, and very skilled with a whip."}, {"type": "list", "elements": [{"text": "Special Sideshow: He swings his whip around his opponent's waist before making them spin around by tugging on the whip. This was shown in his fight against Cabaji.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Orange Town Arc", "level": 4, "content": [{"type": "paragraph", "text": "In his first appearance, Mohji was sent by Buggy to capture Roronoa Zoro. Upon encountering Luffy, he became overzealous and ordered Richie to attack him in the iron cage. The cage was easily smashed and Luffy was smacked through a building. However, Luffy was uninjured due to his rubber man status. Upon seeing Chouchou stand up against the lion to protect his treasure, the pet store Mohji burned down, Luffy challenged Mohji and Richie to a duel. He used his Gomu Gomu no Hammer to spin Richie around and slam him into the ground and knocked him out. Mohji escaped, without his loyal guardian. Upon returning to Buggy, he barely had enough time to warn him about Luffy being a Devil Fruit user before Luffy and his crew arrived to challenge Buggy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Luffy_Knocks_Out_Mohji.png/revision/latest/scale-to-width-down/210?cb=20130524221925", "caption": "Luffy defeats Mohji."}]}, {"title": "Buggy's Crew Adventure Chronicles", "level": 4, "content": [{"type": "paragraph", "text": "After Buggy's defeat, Mohji and Cabaji fought over leadership of the group. They were equally matched, and fought for several hours. The battle ended when a sleep-walking Richie knocked them both unconscious, taking over leadership himself. However, Richie and the pirates were kidnapped by a cannibalistic group, the Kumate Tribe. They were saved by Buggy, Alvida, Mohji, and Cabaji."}], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mohji later participated in the attack on Loguetown. It was his job to burn down the Straw Hat's boat, which he failed to do as soon as it started to rain. Usopp found him and Richie. Before Mohji could do anything, he slipped and bump his head on the ship's hull, getting knocked out. After the Straw Hat pirates escaped, he reunited with his crew."}], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "Much later, Mohji reappeared with the group as they travel in the Grand Line. He is seen wandering in a cave with Buggy and Cabaji, Buggy believing it to hold the treasure of Captain John, only to find a crew of diggers working in it. He is later seen aboard the ship having a party when a mysterious man named Ace appears, having heard the party and smelled the good food."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mohji is seen again with Alvida and the rest of Buggy Pirates, pleading with Alvida to go to Impel Down to rescue Buggy. However, he and the rest of the crew eventually decide to proceed on while honoring Buggy's death after Alvida tells them to rescue Buggy by themselves, and notes they will die trying."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Buggy is reunited with his crew, Mohji is seen crying happily over the reunion, lying that he and Cabaji never gave up on him, and then was seen introducing himself to the Impel Down prisoners along with Cabaji."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After Buggy became a member of the Shichibukai, Mohji along with the rest of Buggy's crew were pardoned."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "3D2Y", "level": 4, "content": [{"type": "paragraph", "text": "Immediately after Buggy became a new Shichibukai, the Buggy Pirates received the summons to fight against the World Pirates. Coincidentally, they happened to come upon the World Pirates' ship and saw that Luffy and Boa Hancock were fighting with Sebastian. Under Buggy's command, Mohji and the rest of the crew invaded the enemy ship. On board the ship, they watched as Byrnndi World fought and defeated Luffy. Buggy then ordered them to help revive him."}, {"type": "paragraph", "text": "Later, they encountered Gairam who then attacked them with his Kyubu Kyubu no Mi Cube Booster attack. Mohji successfully jumped to the side and avoided being in the path of the attack. Later, when the Tightrope Walking Funan Bros began crying because they were moved by Buggy's supposed words of encouragement for Luffy, Mohji and Cabaji noticed that something was up and that Buggy was only thinking about himself. However, when the whole crew began cheering Buggy's name, Mohji told Cabaji that they should just go with the flow, and so they then joined the crew in cheering. However, when Gairam began attacking again, the crew made a run for it while Mr. 3 fended off the attack. Mohji stood in surprise when Buggy was turned into a cube by Gairam. When Buggy told Mr. 3 that he still had a surprise attack that could destroy a town, Mohji and Cabaji asked if it was the Buggy Ball, only to be scolded by Buggy for revealing too much. Buggy then used the Muggy Ball which created a smoke cloud which allowed Hancock to attack Gairam. Upon the smoke clearing up, the crew saw Gairam defeated and believed that Buggy had been the one to do so; however, Cabaji and Mohji had their doubts. But instead of questioning them, the two thought it would be best to go with the flow again and joined in on the cheering."}, {"type": "paragraph", "text": "The crew then made it outside the enemy ship and saw a fleet of Marine ships approaching. The Marines began firing and as such, Cabaji and the rest of the crew escaped back to their ship"}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/Buggy_Pirates_see_Luffy_on_the_Groseade.png/revision/latest/scale-to-width-down/210?cb=20191202151947", "caption": "Mohji and the rest of Buggy Pirates surprised to see Luffy and Boa Hancock fighting together on the Groseade."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mohji made his first appearance after the timeskip at Karai Bari Island at Buggy's Delivery, where he was seen sitting behind Buggy at a feast with Richie, Cabaji, Alvida, and Galdino as they celebrated the defeat of Donquixote Doflamingo and the positive effect it had on their business. However, Mohji spoiled the mood when he revealed that the New Giant Warrior Pirates had quit the dispatch company to align themselves under the flag of the Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Buggy_Showing_Off_as_His_Crew_Feasts.png/revision/latest/scale-to-width-down/235?cb=20160807115245", "caption": "Buggy's dispatch company celebrates Donquixote Doflamingo's defeat."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the abolishment of the Shichibukai system, those on Karai Bari Island were confronted by a Marine fleet led by Stainless."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mohji and Richie vs. Chouchou", "elements": []}, {"text": "Mohji and Richie vs. Luffy", "elements": []}, {"text": "Mohji vs. Cabaji", "elements": []}, {"text": "Mohji, Cabaji, Buggy, and Alvida vs. Kumate Tribe", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In Oda's early sketches of Mohji, Mohji was depicted having completely different designs than his final one. One sketch depicted him as having a panda theme and another depicted him as having a lion theme. While both designs were scrapped because they looked too ordinary at the time, the lion themed one however got included in the manga in Mohji's third appearance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/46/Early_Mohji.PNG/revision/latest/scale-to-width-down/230?cb=20111009180814", "caption": "Some of Oda's early designs for Mohji."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Legend of the Rainbow Island", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mohji's favorite food is pickled vegetables.", "elements": []}]}], "images": []}]}