{"sections": [{"title": "Gaimon", "level": 1, "content": [{"type": "paragraph", "text": "Gaimon is a former pirate who lives as a hermit on the Island of Rare Animals."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gaimon has a green afro hairstyle, a black beard, a chubby face and a big mouth. He has been stuck inside a treasure chest for twenty-two years, and his body's shape has grown accustomed to it over time, making it virtually impossible for him to get out."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is hostile to those who try to hurt the animals or steal the treasure chest he has been guarding for twenty years (ironically, unbeknownst to him until the Straw Hats arrived, the chests were empty). However, once he learns that someone visiting the island is not interested in the animals or the treasure, he becomes very friendly."}, {"type": "paragraph", "text": "Gaimon was originally a greedy pirate. His lust for treasure caused him to be stuck in the empty chest he still lives in. He has since realized his arrogance and ignores wealth as he now protects his island and animals despite having no monetary gain from it."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Rare Animals", "level": 3, "content": [{"type": "paragraph", "text": "Gaimon treats the rare animals as treasures of the island, and defends them from possible invaders. He has great affection for them and they are family to him, so he does not want to leave the island and abandon them."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Although he tried to attack the Straw Hat Pirates at first, he ends up making friends with them after telling them about his past, and they tried to help him get the treasure chests he had been wishing for. However, with the chests empty, Luffy asked him to join his crew, but Gaimon declined the invitation to stay with the animals."}], "images": []}, {"title": "Buggy", "level": 3, "content": [{"type": "paragraph", "text": "He is good friends with Buggy despite battling him when the pirate first crashed onto the island. Ironically, neither of them knows the other's relationship with Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/13/Buggy_Befriends_Gaimon.png/revision/latest/scale-to-width-down/180?cb=20181030100500", "caption": "Gaimon befriends Buggy."}]}, {"title": "Sarfunkel", "level": 3, "content": [{"type": "paragraph", "text": "Gaimon seems to have an affectionate relationship with Sarfunkel, the barrel woman, since she appears feeding him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Gaimon seems to be proficient in using a gun, as he was able to hit Luffy by surprise, in the forest. Gaimon can also pretend to be a bush or his treasure chest in order to hide from his enemies and maintain stealth and surprise. He has managed to be somewhat agile despite being stuck in a chest. However, he has no superhuman abilities and believes that his body cannot survive without being supported by the treasure chest as his body became too adjusted to it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Gaimon's life changed when he was searching for treasure on the island as part of an unnamed pirate crew. While searching, he fell from a high cliff and directly into an empty treasure chest at the bottom. His crew, considering him a lost cause, left Gaimon stranded on the island."}, {"type": "paragraph", "text": "Over the next twenty years, the treasure chest became a part of his body and could not be removed without killing him. However, he can still use his hands, head, and feet. Because Gaimon shrank to fit the size of the small chest, he could no longer scale the cliff to find the treasure. He managed to befriend the strange animals on the island and developed a close bond with them. To protect his treasure and his \"friends\", he did not allow any visitors on his island. If any sailors came ashore there, he would hide and tell them to leave in a spooky voice, claiming to be the island guardian (\"island god\" in the anime). If this failed, he took the more direct route of shooting them with a pistol (which he apparently keeps hidden inside his afro)."}], "images": []}, {"title": "Syrup Village Arc", "level": 3, "content": [{"type": "paragraph", "text": "Twenty years after he was first stranded, Monkey D. Luffy and his crew arrived on the island. They survived his deterrent tactics, and after he realized that they were not there to steal from him, they became friends. However, when Luffy finally got to the top of the cliff, Gaimon realized that the treasure chests were empty too and he had been protecting a nonexistent \"treasure\" for twenty years. He then considered the animals as his treasures and vowed to protect them."}], "images": []}, {"title": "Buggy's Crew Adventure Chronicles", "level": 3, "content": [{"type": "paragraph", "text": "Chibi Buggy eventually met and befriended Gaimon after getting sent flying to the Island of Rare Animals."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Gaimon was seen again still living on the island of strange animals. Gaimon was seen acquainted with a new inhabitant, Sarfunkel, a woman who is coincidentally trapped in a barrel. They were seen living happily together."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Gaimon_and_Sarfunkel.png/revision/latest/scale-to-width-down/210?cb=20140909131720", "caption": "Gaimon and Sarfunkel after the timeskip."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The introduction to Gaimon is different in the anime and manga. In the manga, they have not recruited Usopp and attained the Going Merry yet, and only Luffy and Nami met Gaimon while Zoro slept on the boat the entire time. In the anime, Usopp had already joined and they had the Going Merry, so all four of the Straw Hats met Gaimon (though Zoro spent time sleeping on the island and as a result, met him later than the others)."}, {"type": "paragraph", "text": "He first appeared in the manga between the Orange Town Arc and the Syrup Village Arc, while in the anime he appeared in between the Syrup Village Arc and the Baratie Arc."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the original Japanese version, there is a running gag in which other characters ask Gaimon if he's a hakoirimusuko (箱入り息子, hakoirimusuko literally meaning \"boxed son\"), to which he responds with \"Yes, my father held me back when I was a boy\" and then irritably snaps back to reality. This is a pun off of the Japanese term hakoirimusume (箱入娘, hakoirimusume literally meaning \"boxed daughter\"), which refers to a girl who's been sheltered throughout her life. Since the joke probably would not make sense to most American readers and viewers (it's based on Japanese history circa the late 19th century), Luffy instead calls Gaimon a \"boxer\" in the Viz Manga. The joke became a \"Jack-in-the-Box\" in the FUNimation dub, which he says ironically that he is in a box and presumably nearly says that his name is Jack, before coming back to reality and calling whoever that asked if he was a Jack-in-the-Box an idiot. 4Kids turned the joke into \"heart of gold\" as a reference to the treasure normally held within a treasure chest."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "One Piece: Grand Battle!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "One Piece: Grand Battle! 2", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Eiichiro Oda stated that Gaimon was his favorite character in an interview from One Piece Color Walk 1 (published in 2001).", "elements": []}, {"text": "His pairing with Sarfunkel is a possible spoonerism of the singing group Simon and Garfunkel.", "elements": []}, {"text": "Gaimon's favorite food is the melons that can be harvested on the Island of Rare Animals.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 22 and Episode 18, Gaimon makes his debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Gaimon's information is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 43), his birthday is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Gaimon's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 5 Chapter 43, cover story: Buggy's Crew Adventure Chronicles Vol. 7 and Episode 46, Gaimon and Buggy meet.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 6 Chapter 47, cover story: Buggy's Crew Adventure Chronicles Vol. 9 and Episode 46, Buggy and Gaimon become friends.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 620, cover story: From the Decks of the World Vol. 7, Gaimon and Sarfunkel are seen together.", "elements": []}, {"text": "↑  One Piece Color Walk 1 (p. 104), Akira Toriyama: Oda-kun, who is your favorite character in your manga?", "elements": []}]}], "images": []}]}