{"sections": [{"title": "Buchi", "level": 1, "content": [{"type": "paragraph", "text": "Buchi is an officer of the Black Cat Pirates. Along with his partner Sham, he is also the protector of the crew's ship, the Bezan Black, and together they are known as the Nyaban Brothers (ニャーバン・, Nyāban Burazāzu)."}, {"type": "paragraph", "text": "Due to his actions, he is a supporting antagonist during the Syrup Village Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Buchi is an overweight man who wears an outfit based loosely on a black and white cat. He has pale skin, sharp teeth, tiny eyes, and wears cat ears on his head. His pants are striped black and white, with a yellow sash, and also wears dark brown shoes. He wears a cape on his back, that is striped light and dark-purple, with a white fluffy brim. He also wears a shoulder pad on his left arm, and pale blue gloves with claws at the end."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like Sham, Buchi has a sneaky and devious mind. This is shown when he pretended to be weak, lacking in confidence in his abilities, and scared of Zoro, in order to get the latter to lower his guard. He is also very vicious and proud of his powers and like his appearance, Buchi acts like a cat."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The Nyaban Brothers try to act cowardly when first approaching an opponent, but show their true colors once their opponent's guard is down. The two usually work together to overpower their opponents, and can surpass Jango when doing so. Their primary weapons are the clawed gloves they wear, and uses them to slash their opponents. Buchi is the strength of the duo, using his heavy weight to crush his opponents while Sham distracts and restrains them."}, {"type": "paragraph", "text": "Even without any boost, Buchi was strong enough to crack rocks with a hard stomp. However, after being defeated, Jango hypnotizes Buchi into becoming even more powerful, being able to shatter rock with one jump. Despite this increase in strength, he is defeated once again by Zoro."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/22/Buchi_Hypnotized.png/revision/latest/scale-to-width-down/200?cb=20130204151712", "caption": "Buchi hypnotized."}]}, {"title": "Attack List", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cat the Funjyatta (キャット・ザ・フンジャッタ, Kyatto Za Funjyatta, literally meaning \"The Cat Stomp\"): Buchi takes a flying leap into the air and stomps on his opponent. It is strong enough to crack the stone ground. After being hypnotized by Jango, it leveled the area. In the Viz Manga and 4Kids and FUNimation dubs, this is called Cat-a-Pult Cat-astrophe.", "elements": []}]}, {"type": "list", "elements": [{"text": "Neko-Yanagi Daikoshin (ネコ柳 大行進, Neko-Yanagi Daikōshin, literally meaning \"Grand March of the Pussywillows\"): Sham and Buchi team up and rapidly slash the opponent.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time in the past, Buchi joined the Black Cat Pirates and eventually met Sham, with whom he eventually joined together to become the Nyaban Brothers. Afterwards, the two of them rose up the ranks and became officers of their crew."}, {"type": "paragraph", "text": "Together, Buchi and Sham served as the ship's protectors so they usually stayed on the ship and guarded it. Three years prior to their planned invasion of Syrup Village, they sailed towards the Marine ship that Kuro had decided to attack alone, only to find that Kuro had killed everyone on board except a lone Marine. They then watched as Kuro initiated his plan to abandon his pirate life."}], "images": []}, {"title": "Syrup Village Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Monkey D. Luffy and Roronoa Zoro defeated the Black Cat Pirates as they tried to run up the slope leading to Syrup Village, Jango called down Buchi and Sham to finish the fight. Upon hearing their names, Buchi wondered why their crew were still there and then leapt off the ship after seeing that their crew had been defeated. After being ordered by Jango to take out the ones blocking their path, both Buchi and Sham complained that their enemies looked to powerful, with Buchi further saying that they didn't want to be part of the battle."}, {"type": "paragraph", "text": "Despite their cries, Jango made Sham go on the offensive and, while Sham was attacking Zoro, Buchi watched as his partner revealed their true capabilities. As soon as Sham gained the upper hand and restrained Zoro, Buchi sprung into action and jumped into the air to slam Zoro to the ground with his Cat the Funjyatta attack. However, before he could strike down on Zoro, the swordsman dodged the attack, causing the ground to split instead. With his attack dodged, Buchi complained to Sham about how he should have held him down better. The two then charged at Zoro while using their Neko-Yanagi Daikoshin attack, which proved to be a struggle for Zoro as he only had one sword. They kept attacking and eventually got a cut in when Zoro got distracted defending Usopp and Nami. However, before the two could continue their duel with Zoro, they paused in fear after their former captain arrives."}, {"type": "paragraph", "text": "An enraged Kuro then called the entire crew useless for being held up by a bunch of kids. Hearing this, the Nyaban Brothers became angered that they were being called useless and then started to question Kuro's own capabilities. Upon hearing this, Buchi demanded that Kuro not look down at them and pointed out that they had attacked many villages and ships. He then stated how Kuro could not possibly be stronger than them after three years of inactivity. Claiming that he was no longer their captain, the two then charged at Kuro and attempted to get an attack in. To their horror, Kuro disappeared behind them, and before they could properly respond, Kuro had already wrapped his cat claws around their necks. Kuro then began slowly shoving his sword into Buchi's neck, to which Buchi cried out in pain. However, Kuro then granted them five minutes to finish off Zoro and the others, or otherwise, he would kill all of them. Hearing this, Buchi recalled how Zoro was no match for them just minutes ago, and as such became confident in their abilities to finish him off. The two leapt towards Zoro and, upon seeing him regain his two other swords, stated how he would be no match for them even with three swords. However, before they could strike Zoro, the swordsman slashed through them with his Tora Gari, sending the two spiraling down towards the ground."}, {"type": "paragraph", "text": "Although Sham had been knocked unconscious, Buchi immediately got back up, albeit severely injured, and asked Jango to hypnotize him. After his hypnosis, Buchi became even stronger than before and was ordered by Jango to finish off Zoro. He eventually attacked Zoro with his signature flying stomp, but was dodged yet again, and instead, shattering the entire cliff. He then rammed Zoro into the side of the cliff wall using one arm, but Zoro easily defended against it and kicked him backwards in the face."}, {"type": "paragraph", "text": "When Usopp began approaching Kuro, Kuro ordered Buchi to take him out, but before he could, Zoro held Buchi back and slammed him to the ground. In response, Buchi then flung Zoro off him and sent the latter flying into the cliffside. Buchi then charged at him again, but by now, Zoro had become impatient and demanded that he get out of the way. Zoro then slashed straight through Buchi, defeating him once again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/76/Sham_and_Buchi_Attack_Zoro.png/revision/latest/scale-to-width-down/200?cb=20190128022224", "caption": "Sham and Buchi attack Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Sham_and_Buchi_Lose_to_Kuro.png/revision/latest/scale-to-width-down/200?cb=20190127201800", "caption": "Kuro sneaks up behind the Nyaban Brothers."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Nyaban Brothers vs. Roronoa Zoro", "elements": []}, {"text": "Nyaban Brothers vs. Kuro", "elements": []}, {"text": "Nyaban Brothers vs. Roronoa Zoro", "elements": []}, {"text": "Buchi vs. Roronoa Zoro", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Buchi's favorite food is fish and chips.", "elements": []}]}], "images": []}]}