{"sections": [{"title": "Sham", "level": 1, "content": [{"type": "paragraph", "text": "Sham is an officer of the Black Cat Pirates. Along with his partner Buchi, he is also the protector of the crew's ship, the Bezan Black, and together they are known as the Nyaban Brothers (ニャーバン・, Nyāban Burazāzu)."}, {"type": "paragraph", "text": "Due to his actions, he is a supporting antagonist during the Syrup Village Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sham is a very skinny man of fairly tall height, standing at over six and a half feet. He also has a hunched back, making him look smaller than he actually is. He has green hair that is parted to the side and curls at the end, with two other parts of hair on the sides of his head growing downwards in a curly-looking way. He also has cat ears sticking out from the top of head. He has green, cat-like eyes, and is usually seen with a grin."}, {"type": "paragraph", "text": "He wore a navy blue shirt, with light grey buttons and a magenta bow tie. He also had light-blue shorts, brown shoes and white socks that stick out of them. He is also seen having dark brown gloves, with claws growing out at the end."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sham, like Buchi, has a sneaky and devious mind. This is shown when he pretended to be weak, lacking in confidence in his abilities, and scared of Zoro, in order to get the latter to lower his guard. He is also a very vicious fighter and like his appearance, Sham acts like a cat."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The Nyaban Brothers try to act cowardly when first approaching an opponent, but show their true colors once their opponent's guard is down. The two usually work together in order to overpower their opponents, and can surpass Jango when doing so. Their primary weapons are the clawed gloves that they wear, which they use to slash their opponents. Sham is the swift one of the duo, and he usually distracts and holds down the opponents while allowing his partner to crush them."}], "images": []}, {"title": "Attack List", "level": 3, "content": [{"type": "list", "elements": [{"text": "Neko Baba (ネコババ, Neko Baba, literally meaning \"Cat Snatch\"): Sham very quickly steals a piece of the opponents equipment.", "elements": []}, {"text": "Nekoze (ネコ背, Nekoze, literally meaning \"Hunchback\"): Using his strange posture and body structure, Sham is able to quickly avoid an attack.", "elements": []}, {"text": "Neko-Yanagi Daikoshin (ネコ柳 大行進, Neko-Yanagi Daikōshin, literally meaning \"Grand March of the Pussywillows\"): Sham and Buchi team up and rapidly slash the opponent.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time in the past, Sham joined the Black Cat Pirates and eventually met Buchi, with whom he eventually joined together to become the Nyaban Brothers. Afterwards, the two of them rose up the ranks and became officers of their crew."}, {"type": "paragraph", "text": "Together, Sham and Buchi served as the ship's protectors so they usually stayed on the ship and guarded it. Three years prior to their planned invasion of Syrup Village, they sailed towards the Marine ship that Kuro had decided to attack alone, only to find that Kuro had killed everyone on board except a lone Marine. They then watched as Kuro initiated his plan to abandon his pirate life."}], "images": []}, {"title": "Syrup Village Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Monkey D. Luffy and Roronoa Zoro defeated the Black Cat Pirates as they tried to run up the slope leading to Syrup Village, Jango desperately called down Sham and Buchi to join in the fight. Upon hearing their names, Sham informed Buchi that their captain was calling them and then leapt off the ship after they saw that their comrades had been defeated. Jango then ordered them to take out the ones that had been blocking their path, only for Sham and Buchi to complain about how it would be impossible for them to do anything. After more complaining, Jango yelled at Sham and forced him to go attack, to which Sham obeyed in what appeared to be a reluctant manner. He then ran straight towards Zoro and told the latter to be careful of his sharp claws. However, because Sham had been acting weak and cowardish, Zoro hesitated in attacking and gave Sham some time to think it over. It was in that split second that Zoro lowered his guard that allowed Sham to take advantage of the moment and pounce onto Zoro. In the confusion, Sham stole two of Zoro's katana and revealed that he had only been pretending to be a coward. He then claimed he had no idea where Zoro's katana went, and when Zoro demanded that he give them back, Sham simply tossed the swords down the slope. Angered by this, Zoro charged Sham and seemingly cut straight through his stomach."}, {"type": "paragraph", "text": "Thinking that he had killed him, Zoro focused on getting his swords back, only to be taken off guard and restrained by Sham. With Zoro held down, Sham shouted out to Buchi to attack, but before Buchi could land a hit, Zoro shook off Sham and narrowly dodged the hit. Sham then apologized to Buchi and said that he wouldn't let him escape the next time. The two then charged at Zoro while using their Neko-Yanagi Daikoshin attack, which proved to be a struggle as Zoro only had one sword. They kept attacking and eventually got a cut in when Zoro got distracted defending Usopp and Nami. However, before the two could continue their duel with Zoro, they paused in fear after their former captain arrives."}, {"type": "paragraph", "text": "An enraged Kuro then called the entire crew useless for being held up by a bunch of kids. Hearing this, the Nyaban Brothers became angered that they were being called useless and then started to question Kuro's own capabilities. Sham commented on how Kuro was once powerful, but that, for the past three years, he had been leaving a peaceful village life, implying that Kuro was no longer a match for them. Sham then stated that rather than being killed by Kuro for a failed plan, it was best if they killed him instead. The two then charged at Kuro, only for him to disappear behind them. Kuro then swiftly snuck up behind them and held his cat claws to their necks, which caused Sham and Buchi to fall into a state of fear and panic."}, {"type": "paragraph", "text": "Afterwards, Kuro gave them five minutes to finish off Zoro and the others, or otherwise, he would kill all of them. Hearing this, Sham said that it would take them only five seconds to kill Zoro and the two of them sprang into action. Seeing as how Zoro had regained his two other katana, the two Nyaban Brothers warned him that he was still no match for them even with three swords. However, as soon as they got close enough to land a hit, Zoro cut straight through them with his Tora Gari, leaving Sham bloodied and unconscious on the ground."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/50/Sham%27s_Cowardly_Running.png/revision/latest/scale-to-width-down/230?cb=20190127102102", "caption": "Sham acting cowardly while running towards Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/76/Sham_and_Buchi_Attack_Zoro.png/revision/latest/scale-to-width-down/180?cb=20190128022224", "caption": "Sham and Buchi attack Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Sham_and_Buchi_Lose_to_Kuro.png/revision/latest/scale-to-width-down/180?cb=20190127201800", "caption": "Kuro sneaks up behind the Nyaban Brothers."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Sham_and_Buchi_Lose_to_Zoro.png/revision/latest/scale-to-width-down/180?cb=20190127221741", "caption": "Zoro finishes off the Nyaban Brothers."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Nyaban Brothers vs. Roronoa Zoro", "elements": []}, {"text": "Nyaban Brothers vs. Kuro", "elements": []}, {"text": "Nyaban Brothers vs. Roronoa Zoro (round 2)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sham's favorite food is grilled fish.", "elements": []}]}], "images": []}]}