{"sections": [{"title": "Zeff", "level": 1, "content": [{"type": "paragraph", "text": "Zeff is the head chef and owner of Baratie, former captain of the Cook Pirates (in which he was known as \"Red-Leg\"), and was also Sanji's cooking mentor and adoptive father."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "While still a pirate, Zeff had short blonde-hair, which was somewhat unkempt, a mustache that he tied with light blue ribbons on each end, and a slight stubble."}, {"type": "paragraph", "text": "22 years before the story, he wore a simple red-and-white vertical stripped shirt with gold buttons on the collar. By the time he raided the Orbit, he changed to a purple and red, horizontally stripped overall and braided his mustache. In either case, he wore dark pants with a light green pirate's sash and a captain's coat draped over his shoulders like a cape."}, {"type": "paragraph", "text": "When he became the head chef of Baratie and was teaching Sanji his chivalry, his moustache has not been braided as it is seen in the current timeline and his goatee has also been shaved off."}, {"type": "paragraph", "text": "As the head chef of Baratie, Zeff is an elderly-looking man who still retains his blonde-colored hair, which he keeps underneath his extra-long chef's hat. His mustache has grown considerably long, and he grew a beard. He wore his chefs uniform, with a blue ascot, and white apron. Also, since he lost his right leg, he has a peg leg and he seems to have no trouble walking with it."}, {"type": "paragraph", "text": "After two years, he wears a horizontally striped dark colored and light colored shirt, dark colored pants, and a white chefs uniform draped over his shoulders, with his ascot. He still has the same braided mustache style, and peg leg."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Zeff was a tough former pirate. He is hard on those around him and is always serious (at times appearing frighteningly serious) about everything. Zeff normally does not show emotions other than a hot temper and has a firm hold of authority at the Baratie."}, {"type": "paragraph", "text": "Despite his fierce temper, Zeff is also very compassionate. When he and Sanji were shipwrecked on a rocky island at sea, he chose to hand over all the remaining food supply to Sanji and resort to amputating his own leg to feed himself, despite the fact that such an action would completely shatter his own dream to find the All Blue by ending his career as a pirate (which he lost all desire to continue anyway, since he lost his treasured crew). Due to his great compassion, Sanji even believed that Zeff will be completely digusted with him if Sanji had chosen to abandon his biological family to die by Big Mom's hands and even laugh at their demise despite how corrupt his family was along with the fact they had coerced Sanji by threatening Zeff's safety."}, {"type": "paragraph", "text": "As a chef at sea, Zeff respects food to a very high degree. When he ordered his crew to plunder the Orbit, he kicked one of his crew for stealing food, the one thing he refuses to take. Also, when Sanji was still in-training at the Baratie, when his food was unsatisfactory for customers, Zeff forced Sanji to eat it himself, rather than throw it out. He also gave Krieg food for his starving crew, understanding the pain of hunger at sea, despite knowing that feeding the crew would bring a battle."}, {"type": "paragraph", "text": "Zeff also strongly dislikes any violence against women. For this reason, he refuses to hire any female chefs, as he tends to make his point in the kitchen using violence."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Cook Pirates", "level": 3, "content": [{"type": "paragraph", "text": "One of Zeff's most precious possessions is his journal from his days as a pirate. He considers it valuable because it contains the memories of him and his crews journey in the Grand Line. This means that while his days of a pirate are long past, he still holds them dear and was not prepared to just let Don Krieg take this away. Zeff was a tough but compassionate captain, as he would enforce his creed of never taking food from others by kicking any member who attempt to do so, yet mourned their demise to the point that he ceased wanting to be a pirate once he lost them to the wave."}], "images": []}, {"title": "Baratie Cooks", "level": 3, "content": [{"type": "paragraph", "text": "Zeff has also earned the respect from the other chefs of Baratie, as everyone there would stay and fight against the Krieg Pirates, and they were visibly upset that Gin would break Zeff's peg leg and hold him hostage."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "While Zeff was always harshly critical towards Sanji, he did this to make Sanji into the great chef and tough fighter he is now. Despite objecting to it at first, Sanji seems to come to understand what Zeff was up to. Zeff also seems to be responsible for Sanji's strict code of never using any form of violence against women, threatening to beat up Sanji or even castrate him if he ever forgets this. Zeff raised Sanji as his adopted son, as he believed it was his duty as \"Sanji's parent\" to instill knowledge in him, including helping him develop his cooking skills and teaching him the value of a cook's hands. Sanji's signature fighting style was developed as a result of this teaching, which included Zeff beating him up whenever he threatened his hands in combat. Despite deeply caring about Sanji as his own son, Zeff tends to get particularly irritated with Sanji's lustful weakness towards beautiful women. When Sanji was a kitchen boy in Baratie, he would be instantly love struck by attractive female customers and end up making mistakes in his job such as dropping a dish. Zeff even once angrily kicked Sanji in the face for his unrepentant perverted behavior."}, {"type": "paragraph", "text": "While Zeff seems to spend most of his time (besides cooking) provoking Sanji into leaving the Baratie, most see this as an attempt to encourage Sanji to leave so he could fulfill the dream that he and the old pirate shared together nine years ago. This shared dream proves to be a very deep and private connection between them, as the other Baratie cooks had no idea as to why Sanji remained at the Baratie, despite his constant bickering with Zeff. When Sanji finally set out to pursue their common dream, Zeff found himself crying, and he was overjoyed to hear that Sanji had a bounty even when his face was drawn hilariously."}, {"type": "paragraph", "text": "During the Whole Cake Island Arc, the Vinsmoke Family threatened to kill Zeff if Sanji refused to cooperate with the wedding with Charlotte Pudding. Sanji, seeing Zeff as the father figure that Vinsmoke Judge failed to provide, could not defy his birth family in fear for the head chef's life."}, {"type": "paragraph", "text": "However, after Sanji rescued his father and siblings from Big Mom's clutches, Sanji explained that he did not want Zeff to be disappointed before disowning Judge once again, making him promise never to interfere in his life nor threaten Zeff as well."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Right after meeting him, Zeff forced Luffy to work as a chore boy on the Baratie as payment for the damage inflicted by unintentionally deflecting Fullbody's cannonball into the roof of the restaurant. However, Luffy's tendency to eat food meant for customers and clumsily breaking every dish that he was supposed to be washing was causing more trouble than help, and Zeff did not hesitate to accept Luffy's offer of dropping the debt in exchange for defeating the Krieg Pirates. Zeff was impressed by Luffy's determination and thought he would make it to the top in the Grand Line. Luffy understood how Zeff saved Sanji (comparing to how Shanks saved Luffy at the cost of his arm), and berated Sanji for nearly throwing it all away by being willing to die. After Krieg was defeated, Zeff wanted Luffy to forcibly take Sanji away with him, but Luffy politely declined, stating that while he wanted Sanji as his ship's cook, he would only accept Sanji if he agreed to leave the Baratie with him. When the Big Mom Pirates and Vinsmoke Family held Zeff's life as hostage against Sanji, Luffy claimed that he would not let them harm the head chef nor the others at Baratie."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Krieg", "level": 4, "content": [{"type": "paragraph", "text": "Hoping to rebuild his fleet after it had been devastated by Dracule Mihawk, Don Krieg attempted to capture the Baratie and obtain Zeff's log book from his days as a pirate. Krieg even ordered his crew to attack the Baratie despite the fact that they felt gratitude towards Zeff and the chefs for feeding them."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "When Zeff was a pirate, he was renowned for being both a great chef and a powerful pirate captain. Zeff also retains a fair amount of knowledge of the Grand Line and piracy from his days as captain, as displayed when he knew about \"The Hawk-Eyes Man\" that Gin was talking about, and the fact that he knew some people referred to the first half of the Grand Line as Paradise. He also knows perfectly well about Devil Fruits and the weaknesses that come with them."}, {"type": "paragraph", "text": "He is a highly capable teacher as he could pass on most of his fighting skills onto Sanji."}], "images": []}, {"title": "Culinary Expertise", "level": 3, "content": [{"type": "paragraph", "text": "As the founder and head chef of Baratie a famous sea restaurant of the East Blue, Zeff is a master chef who possess an extremely high level of skill in cooking. He is also the one that taught Sanji all his culinary skills and knowledge about cooking.He was able to skillfully cook enough food to feed one hundred men of Kreig's crew singlehandedly within a short period of time. According to himself, Zeff has culinary experiences that extends from the four seas to the Grand Line and Sanji is still an amateur compared to himself."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Zeff possess incredible superhuman leg strength. He could easily break through rock and leave footprints on hard iron and overpower all his enemies effortlessly. At the Baratie, the force generated from one of his kicks was great enough to strike a number of Pearl's fire pearls in mid-air, and even extinguish their fire and fall to the ground. He remains extremely agile despite his old age, able to perform one hand stand acrobatic maneuver while kicking Luffy. Zeff also has immense stamina and endurance. After feeding himself his own amputated leg, he could still withstand hunger for eighty-five days without any sustenance. "}], "images": []}, {"title": "Fighting Style", "level": 3, "content": [{"type": "paragraph", "text": "In his prime, Zeff was renowned as a master of extremely powerful kicks. Because of the immense power of his lethal kicks, his shoes were left covered in the blood of his enemies, leading to his nickname of \"Red-Leg.\" Even with a peg leg, Zeff's kicks can still kill a man and overpower physically strong combatants such as Fullbody, Sanji, and even Luffy."}, {"type": "paragraph", "text": "During Sanji's fight against Kuroobi, after receiving a Hundred Tile True Punch from the fish-man, Sanji, who is already used to being kicked by Zeff, commented that Zeff's kicks must be a \"Thousand Tile\" if placed in the same category. This proved that, even in his old age, Zeff's kicks are, at the very least, still more powerful than Kuroobi who is very strong even for a fish-man."}, {"type": "paragraph", "text": "Zeff's attacks can be seen being used against Luffy during their discussion about Luffy's compensation:"}, {"type": "list", "elements": [{"text": "Ryoricho Gisoku Kick (料理長義足キック, Ryōrichō Gisoku Kikku, literally meaning \"Head Chef Peg-Leg Kick\"): A powerful horizontal kick with the tip of his peg leg. In the Viz Manga, this is called Chef's Special Peg-Leg Kick.", "elements": []}, {"text": "Ryoricho Drop (料理長ドロップ, Ryōrichō Doroppu, literally meaning \"Head Chef Drop\"): A kick from his peg leg done by jumping in the air. Zeff destroyed his ceiling in the process. In the Viz Manga, this is simply called Chef Drop, and in One Piece: Grand Adventure, which was dubbed by 4Kids Entertainment, it is called Head Chef Drop.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Zeff originally made a name for himself as captain on a pirate ship. He became great at being both a skilled chef and a powerful pirate. His dream of finding the \"All Blue\" led him to the Grand Line. After one year of traveling around the Grand Line, he left that sea."}, {"type": "paragraph", "text": "Zeff and pirate crew raided a cruise ship called the Orbit. While Zeff and his crew had no initial desire to harm anyone onboard and only attacked the ship for loot and nothing else (Zeff even kicked one of his crewmates for attempting to take a bag of food), the kitchen boy Sanji (thinking otherwise) had the guts to attack Zeff himself, claiming that he wanted to live in order to find the All Blue, which was Zeff's own dream as well. During the skirmish, a fierce storm wiped out both Sanji's ship and the pirate ship, nearly drowning Sanji. Zeff went into the water to save the boy because they shared the same dream."}, {"type": "paragraph", "text": "After the storm, Zeff and Sanji found themselves washed up and stranded on a tall, rocky island. Zeff gave Sanji all his food and lied to the boy that the larger bag that he kept himself were his rations (knowing that the boy would never accept it if he found out that he had no food with him at all, only treasure). Sometime afterwards, Zeff smashed his own leg off with a large rock and ate it to stay alive."}, {"type": "paragraph", "text": "After eighty-five days with little food in their possession (forty-seven days in the anime), Sanji went to Zeff with the intent to kill the pirate and steal his food and was horrified to discover what he did to his leg. Zeff swore that if he made it off the island alive, he would open a restaurant on the sea and serve anyone who was hungry, whether they be marines or pirates. Moments after revealing his dream, Zeff and Sanji were rescued by a passing ship. Years later, Zeff made good on his promise and opened a restaurant known as the Baratie, a floating restaurant shaped like a fish and famous for its amazing food and fighting cooks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Zeff_on_the_Cooking_George.png/revision/latest/scale-to-width-down/210?cb=20130527011129", "caption": "Zeff standing on the Cooking George's figurehead."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f2/Sanji_Discovers_Zeff%27s_Missing_Leg.png/revision/latest/scale-to-width-down/210?cb=20130118031727", "caption": "Sanji discovers Zeff's condition."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Baratie Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Luffy came to the Baratie after accidental damage to the restaurant from the cannonball he repelled from Fullbody's ship, Zeff forced him into labor as a chore boy for a full year to pay for the damages. However, Luffy continuously messed up in his chores."}, {"type": "paragraph", "text": "Soon, Don Krieg attacked the Baratie. Zeff offered Krieg the food and water he had demanded in exchange for Krieg to leave the restaurant. However, Krieg took the food but also demanded they turn the Baratie over to him as he planned on using it to sail the Grand Line and attack other ships. Zeff graciously accepted Luffy's offer for his debt to be repaid in exchange for Luffy's help against Krieg, so Luffy would not cause further accidental harm to his restaurant."}, {"type": "paragraph", "text": "Later after Pearl almost accidentally burned down the restaurant, Gin took Zeff hostage to prevent any further potential problems. Gin ordered the cooks to lay down their weapons or he would murder Zeff. Sanji refused, telling him that he would not allow any more harm to come to Zeff as he owed the man for taking everything from him earlier. Sanji then revealed their past and how Zeff had attacked a ship he was working on as a small boy."}, {"type": "paragraph", "text": "As Luffy battled, Zeff told Sanji that he believed Luffy would win. He told him that only those who have no fear of death on the battlefield can truly call themselves the strongest. As Luffy refused to give in, he delivered a crushing blow to Krieg at the expense of sending himself into the ocean. Zeff explained to Sanji that Luffy is a true warrior without fear. As an afterthought, he told Sanji that Luffy would die as he cannot swim. Sanji could hardly believe how callous Zeff was to wait to share this information as he dove in to save Luffy, the restaurant's savior."}, {"type": "paragraph", "text": "After the battle, Luffy continued to press Sanji to become his chef on his journey to the Grand Line. Sanji continued to turn him down as he told Luffy he must remain to repay his debt to Zeff. Zeff overheard Sanji's commitment and later after Luffy declined his offer to forcibly take Sanji with him, Zeff encouraged Sanji to leave the restaurant and pursue his dream for both their sakes. Sanji finally agreed and the two barely exchanged any emotions, despite their long history. As Sanji's ship pushed off, Zeff wished him luck. Sanji broke down in tears and bowed in respect as he bid farewell to his previous life as a Baratie cook and began his new one as a Straw Hat Pirate."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ca/Gin_Holds_Zeff_at_Gunpoint.png/revision/latest/scale-to-width-down/210?cb=20140727110244", "caption": "Gin holding Zeff as a hostage."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Sanji got his first bounty, Zeff and his chefs were so overjoyed that they would tell customers that Sanji came from the Baratie in an attempt to give the restaurant more popularity (although the crying laughter was more likely attributed to Sanji's horribly drawn portrait)."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Two years later, Zeff read the newspaper about the Straw Hats' return while his office was being remodeled."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/49/Zeff_Two_Years_Later.png/revision/latest/scale-to-width-down/210?cb=20140727110619", "caption": "Zeff reading about the Straw Hats' return."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events at Dressrosa, Zeff and the chefs of the Baratie received Sanji's new wanted poster, with Zeff pondering on the reason Sanji's bounty claim was changed to 'Only Alive'."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Gally Pirates visited the restaurant and demanded food. Even though the other chefs wanted to kick them out, Zeff cooked a meal for them, declaring that he would feed anyone who wishes to eat."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Zeff's Severed Leg", "level": 3, "content": [{"type": "paragraph", "text": "The background on how Zeff lost his leg differs between anime and manga. In the manga, he severed it with a rock and ate it to survive. In the anime, he lost it during the ship wreck in an attempt to save Sanji. Zeff's leg got caught in the wreckage and he tied the metal chain of a ship's anchor around it, causing the leg to be ripped off when the ship was thrown around by the tides and the chain tightened. The change was due to censorship, as it was considered too much of a shock for young children."}, {"type": "paragraph", "text": "The new adaption of the events in Episode 801 also follows the original anime scenario. However, Episode of East Blue, an abridged retelling of the East Blue Saga, leaves out the non-canon anime scenes and implies that Zeff ate his leg."}], "images": []}, {"title": "Baratie Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Zeff offered to give Luffy his log book that records the days he spent on the Grand Line, but was turned down because Luffy wanted to have his own journey rather than copy someone else's."}, {"type": "paragraph", "text": "In the manga, when the chefs of Baratie pretend that they hated Sanji's soup and break their soup bowls in disgust, Zeff does so as well. In the anime, he criticizes the chefs for breaking their bowls and states that they should not waste a single drop of soup and finishes his serving of Sanji's soup before insulting it."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Also, in the anime, it is revealed that when Zeff was young, he had some kind of relationship with a chef named Banban."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ab/Young_Banban_with_Zeff.png/revision/latest/scale-to-width-down/180?cb=20150414132143", "caption": "Zeff wrestling with Banban"}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, his name was writen as \"Zefu\" in a newspaper during one of the Loguetown Arc filler episodes."}, {"type": "paragraph", "text": "In the English manga, Zeff has a tendency to call Sanji \"Little Eggplant\" and Sanji calls him \"Shitty Geezer\" in return. In the 4Kids dub of the anime, Zeff has a tendency to call Sanji \"String Bean\" and in return Sanji calls him \"Ol' geezer\". In the FUNimation dub Zeff calls Sanji \"Little Brat\" while Sanji refers to him as \"Old Geezer\" or just \"Geezer\" in return. He also has a vague Bronx accent in the 4Kids dub, similar to the one Sanji was given."}, {"type": "paragraph", "text": "He was part of the rewrite used by 4Kids to cut out Laboon in the Reverse Mountain Arc. After Usopp found the log pose that his father left him, Sanji recalls that Zeff had told him the secrets of the Grand Line before he left, calling on the knowledge that he had noted down in his log book; in the original version, this explanation was given by Crocus."}, {"type": "paragraph", "text": "His nickname is \"Red-Shoes\" in the Viz Manga and 4Kids dub and \"Red-Foot\" in the FUNimation dub."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He was issued alongside Sanji in a One Piece DeQue set featuring the Straw Hats and their past mentors/loved ones."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Before Luffy left, Zeff told him that the first half of Grand Line is called \"Paradise\", hinting that Zeff may have gone to the New World, since that is a name commonly used by pirates who faced the New World. This fact is also pointed out in the One Piece Green databook.", "elements": []}, {"text": "In the sixth Japanese popularity poll, Zeff was ranked at 90th place.", "elements": []}, {"text": "His nickname may have come from Red Legs Greaves.", "elements": []}, {"text": "Zeff cut off his right leg because he uses his left leg to support his weight when he kicks.", "elements": []}, {"text": "Zeff is the second father figure Sanji has pulled a knife on while he was a child, as a desperate form of self-defense. The first was his own father, Vinsmoke Judge.", "elements": []}, {"text": "Zeff shares some similarities with Shanks:", "elements": [{"text": "Both of them do not have a Devil Fruit power.", "elements": []}, {"text": "Both were a role model to a member of the Straw Hat Pirates during their childhood (Zeff for Sanji and Shanks for Luffy).", "elements": []}, {"text": "Both sacrificed a limb to save their protégé (Zeff's right leg for Sanji and Shanks' left arm for Luffy).", "elements": []}]}, {"text": "He is similar to Long John Silver, from the novel Treasure Island, being both pirate cooks with a missing leg.", "elements": []}, {"text": "Zeff's favorite food is extremely spicy chicken wings.", "elements": []}]}], "images": []}]}