{"sections": [{"title": "Daz Bonez", "level": 1, "content": [{"type": "paragraph", "text": "\"The Killer\" Daz Bonez is a former bounty hunter who joined Baroque Works and was the highest ranked male Officer Agent and the strongest under Crocodile himself. His codename was Mr. 1 and his partner was Miss Doublefinger."}, {"type": "paragraph", "text": "He was a major antagonist during the Alabasta Arc, and after these events he was captured and sent to Impel Down. He escaped during the Impel Down Arc and is now traveling together with Crocodile in the New World."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Daz is a tanned man with long, thin limbs and fingers. He is tall and very muscular and his head is shaven. His most striking feature is probably the black unibrow, right over his round eyes. He has big lips and the archaic Japanese symbol of the number \"1\" (壱, ichi) tattooed on his torso."}, {"type": "paragraph", "text": "In Alabasta, he sported an oriental-looking attire consisting of a sleeveless dark coat with golden edges and white motifs on the front, over very loose beige pants held up by a white sash around the waist, with some light brown fur sprouting from it. His pants were tucked inside some bandages wrapped around his calves and in part around his shoes."}, {"type": "paragraph", "text": "In Impel Down, like most prisoners, he wore striped prisoner clothing. He gained a scar to the right of his right eye, likely a result of something that occurred while or after he was taken to Impel Down. (Due to the fact that he lacked such a scar or any sort of facial injury during the Miss Goldenweek mini arc, it is impossible for him to have obtained the scar during his fight with Zoro.) During his break-out of his cell, he was bare-chested, with his shirt tied around his waist."}, {"type": "paragraph", "text": "After the Battle of Marineford, he sports a dark suit over a plain open shirt, with a tie kept loose around his neck."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Daz is very stern, calm, focused, disciplined, self-assured and confident. Due to his Devil Fruit abilities, he has come to think of himself as unbeatable. He is serious at all times and does not tolerate weakness or frivolity. Daz also has the belief that having friendships makes one weak. Surprisingly, he does not seem to care for grudges either; he assisted Luffy in the escape from Impel Down due to Crocodile's orders, barely noting the fact that Zoro and Luffy are companions."}, {"type": "paragraph", "text": "Mr. 1 was notorious within West Blue for his previous profession as an assassin (under his real name \"Daz Bonez\"), implying he was (and still is) highly skilled at stealth and killing efficiently. He also demonstrated to be merciless to those that dare challenge him to combat, and is not concerned with the swordsmen code of conduct as he attacked Zoro while in a vulnerable and defenseless position. However, he demonstrates high loyalty to those that treat him with respect (Sir Crocodile), and is not a petty man clouded by past bias or judgements."}, {"type": "paragraph", "text": "In battle, he is utterly merciless, such as hitting Roronoa Zoro while the pirate was wounded and unable to defend himself. Nevertheless, Daz does have some sense of honor, as he accepted his defeat at Zoro's hands."}, {"type": "paragraph", "text": "While in Impel Down Level 4 he was placed in a high temperature environment where he was forced to do intense labor. A runaway prisoner knocked him in the head and he proved his level of indifference even when in Hell by pushing the prisoner into a boiling blood pot."}, {"type": "paragraph", "text": "While Daz is generally a cold-hearted person, as a child, he secretly had a dream of becoming a super hero. When Miss Goldenweek materialized this dream, his face showed great discomfort, but was actually quite delighted in secret."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Baroque Works", "level": 3, "content": [{"type": "paragraph", "text": "Much like his boss, Crocodile, Daz generally views allies as hindrances rather than assets. His relationship with Miss Doublefinger is a professional partnership, with both of them working together to accomplish any task set before them."}, {"type": "paragraph", "text": "While Mr. 1 generally has mostly the same type of indifferent professional relationship with a majority of the Baroque Works Agents, he however is on bad terms with Mr. 2 Bon Kurei. Because Mr. 2's flamboyant nature conflicts with his static cold-heartedness, the two of them would often fight with each other, a lot like their later opponents, Roronoa Zoro (who had beaten Daz) and Sanji (who had beaten Mr. 2). Ever since first meeting each other in Spiders Cafe, they have had this type of rivalry relationship, even in Impel Down's breakout."}, {"type": "paragraph", "text": "Nevertheless, Daz has shown loyalty towards Crocodile, as when most of their colleagues left prison, Daz stayed behind with his boss and awaited transfer to Impel Down. He then later joined the riot in Impel Down stating it was because Crocodile asked. He even fought Dracule Mihawk, the world's greatest swordsman, on Crocodile's command. However, his loyalty was rewarded when Crocodile himself saved both Daz and Luffy's lives from Mihawk."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Formerly a bounty hunter from the West Blue known as \"The Killer\", Daz Bonez is a proficient hand to hand martial artist."}, {"type": "paragraph", "text": "Even without his Devil Fruit powers, he is a very dangerous, extremely strong man, as seen when he was incarcerated in Impel Down and simply gave a headbutt to a fellow prisoner (who was larger than him) that proved strong enough to knock the man over a great distance. Mr. 1 was also most likely wearing seastone shackles at the time, and was punched by the prisoner hard in the head, but simply shrugged the pain off before retaliating."}, {"type": "paragraph", "text": "Mr. 1 was approximately equal to Roronoa Zoro physically in Alabasta, where the latter managed to lift up a largely intact building off the ground with his bare hands."}, {"type": "paragraph", "text": "His power was great enough to put him in Level 4 of Impel Down, and the intense heat there seemed to have very little or no effect on him."}, {"type": "paragraph", "text": "He has knowledge in assassination, as seen when he started targeting Nami before Zoro in Alubarna, saying that the first rule of assassination is \"pick off the weakest target first\"."}, {"type": "paragraph", "text": "In fact, his reputation was great enough to be recognized by one of the Marine officers during Impel Down's breakout attack. He is also strong enough to defeat many Whitebeard Pirates members and their allies from the New World. His strength has earned Crocodile's respect, something that most Baroque Works members and even Crocodile's right hand woman, Nico Robin, did not get. Crocodile went out of his way to free Daz from his cell to assist him in the upcoming war."}, {"type": "paragraph", "text": "His skills are good enough to be recognized by the world's greatest swordsman, Dracule Mihawk, who does not bother to remember the names of every weakling that he crushes. Daz even managed to block a slash of Mihawk, however the following attack cut him down instantly. He is strong enough to be unafraid of the New World as he has no problem going there."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Daz ate the Supa Supa no Mi, which is a Paramecia-type Devil Fruit which gives him the ability to turn any part of his body into sharp steel blades. He was able to combine his martial arts skill with this fruit. Daz Bonez is a fighter that can literally become a living weapon. Besides giving him an endless variety of bladed weapons, his Devil Fruit powers make him almost immune to damage by turning his entire body into blades, thus making it as hard as steel. These powerful offensive and defensive abilities combined with his formidable martial arts skills were such that he was practically unharmed after enduring a good number of strikes from Zoro. An example of a transformation is changing his arms into spinning saw wheels, and he is also able to create a small but powerful tornado, similar to Zoro's Tatsumaki technique. Although all of these qualities give Daz the status of a [swordsman]], he refuses to be classified as one."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f9/Supa_Supa_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20160925122350", "caption": "Daz Bonez wielding the Supa Supa no Mi."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Before joining with Baroque Works, Daz was an infamous bounty hunter from West Blue and was known as \"The Killer\" for his deadly skills. He was one of the most well known bounty hunters in West Blue to the point where even Zoro, who was on the other side of the Red Line, had heard of him."}], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "After joining and working for Baroque Works for an unspecified amount of time, he got the nickname \"Mr. 1\" and was called to assemble with the other Officer Agents for the fulfillment of Baroque Works' ultimate goal, Operation Utopia. Arriving at Spiders Cafe in Alabasta, the designated meeting place, Mr. 1 came across a bunch of suspicious guys dancing outside. Beating and throwing them into the cafe, he learned that they were Mr. 2 Bon Kurei's subordinates. Despite leaving them barely alive, this action caused a brief scuffle between him and Mr. 2. Before it could get out of hand, Mr. 1's partner, Miss Doublefinger, stopped them so that they could meet their mysterious boss, Mr. 0, in Rainbase."}, {"type": "paragraph", "text": "After being transported to Rainbase by Banchi, Mr. 1 and his fellow Officer Agents were led to a room that was submerged underwater. There they were greeted by Miss All Sunday, who revealed to them not only that they were under the casino of Rain Dinners, but also the identity of their boss, the Shichibukai Crocodile. After a brief revelation, Mr. 1 and his fellow agents were informed of the goal of their final plan and what they had to do to achieve it. Just as they were finishing up the meeting, a new complication however arose before Mr. 1 and his fellow agents. Mr. 3, a fellow agent who snuck into the meeting, revealed to them that he had failed in his mission to assassinate Princess Vivi and her pirate companions. With this new information and some faces provided by Mr. 2 who happened to have met the pirates in question, Mr. 1 and his fellow agents were ordered by Crocodile to be on the look out for Vivi and the pirates. As Vivi was a friend of the leader of the rebellion that was happening in Alabasta, Koza, their meeting with could spell ruin for Operation Utopia. With this final order, Mr. 1 and his fellow agents went to fulfill their parts in their final mission."}, {"type": "paragraph", "text": "As the mission commenced in Nanohana, Mr. 1 and his partner took over a gigantic weapons ship and crashed it into the port town. With the damage caused by the ship and the farce perpetuated by Mr. 2 masquerading as the the king of Alabasta, Nefertari Cobra, at the same time, Mr. 1 and his fellow agents had set off a series of events that would provoke the rebels into fighting against the king and his army. As Mr. 1 and Miss Doublefinger were leaving, they found out that a little boy, Kappa, had discovered the truth behind Mr. 2's trick. Seeing the potential danger, they messed the boy up so he would not ruin the mission before leaving with Mr. 2 to Alubarna, the capital of Alabasta."}, {"type": "paragraph", "text": "Regrouping with the rest of the Officer Agents at the western most gate of the city, Mr. 1 and his fellow agents were told to wait there for Vivi and her pirate companions which they learned would be coming. Soon enough, they saw the princess and her companions arriving on Super Spot-Billed Ducks. To their surprise, Mr. 1 and his fellow agents noticed there were six cloaked figures heading toward them, all wearing the same type of cloak. Since the six cloaked figures were all riding Super Spot-Billed Ducks, the quickest animal in Alabasta, Mr. 1 and his fellow agents unfortunately could not catch the group as it split up and passed them heading to one of the five city gates. Not knowing which one of the was Vivi, Mr. 1 and his fellow agents split up as well to catch the cloaked figures. Following two cloaked figures who passed through the westernmost gate with his partner, Mr. 1 caught up with them. However much to his and his partner's surprise, not one of the two they followed was Vivi. Instead they were Zoro and Nami."}, {"type": "paragraph", "text": "Seeing that Nami was the weaker of the two, Mr. 1 and his partner decided to get rid of her first. However, in the midst of an attack against her, Mr. 1's attack was blocked by Zoro. Recognizing the pirate as the one who had defeated the one hundred Millions agents who worked at Whisky Peak and the one who had killed the previous Mr. 7, Mr. 1 soon got into a battle with the pirate hunter while his partner went off to battle Nami. Having a body as hard as steel thanks to his Devil Fruit powers, Mr. 1 was able to withstand all of Zoro's attacks. Despite this, Mr. 1's opponent was able to withstand his attacks as well. As the battle continued, Mr. 1 attacked Zoro more brutally with each attack. Much to Mr. 1's surprise, no matter what he did, his opponent would not fall down regardless of the wounds Mr. 1 inflicted on him. In the apex of the battle with his opponent completely covered with blood and wounds, Mr. 1 decided to finish Zoro once and for all. However, at that very moment, his opponent was finally able to slash through Mr. 1's metal body."}, {"type": "paragraph", "text": "Completely wounded from the slash, Mr. 1 admitted his defeat and fell unconscious. After Operation Utopia failed with Luffy beating Crocodile, Mr. 1 was found and arrested by the Marines headed by Tashigi. He, along with the other arrested Baroque Works agents were then sent to prison."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/Baroque_Works_Officer_Agents_Burn_Orders.png/revision/latest/scale-to-width-down/210?cb=20130912233713", "caption": "Mr. 1 and his fellow Officer Agents burning their orders in order to keep secret ceremoniously."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Mr._1_and_Miss_Doublefinger_vs._Nami_and_Zoro.png/revision/latest/scale-to-width-down/210?cb=20130510014252", "caption": "Mr. 1 and Miss Doublefinger face off against Zoro and Nami respectively."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c8/The_Defeat_of_Mr._1.png/revision/latest/scale-to-width-down/210?cb=20110821053432", "caption": "Mr. 1 defeated by Zoro."}]}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "After being arrested, Daz, along with Crocodile and the other arrested Officer Agents were imprisoned in a Marine base. There, he, Crocodile, and Mr. 4 established themselves as the strongest amongst the male prisoners there. As time passed, they were soon visited by the most unexpected of visitors, Miss Goldenweek and the Mr. 5 team. With a mission to free their imprisoned colleagues, Miss Goldenweek and her group infiltrated the Marine base and freed Daz and the others from their cells. Though he was offered freedom, Daz, along with Crocodile, decided to voluntarily stay behind in their cell."}, {"type": "paragraph", "text": "As they remained in the ruins that their fellow agents made for their escape, Daz and Crocodile were affected by a hypnotic technique from Miss Goldenweek that materialized their deepest dreams. Though Crocodile was annoyed by this, Daz on the other hand, was secretly delighted that his past dream of becoming a \"Super Hero\" was materialized. Continuing to refuse freedom, they were soon greeted by Mr. 2 and Mr. 3 who were both just captured by Captain Hina. Together, the four Baroque Works members were sent to Impel Down."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Daz was incarcerated in the Level 4 \"Blazing Hell\" of Impel Down, seen carrying a huge piece of wood for the fire pit. He seemed unfazed by the immense heat and labor being put through, a testament of his power. He also headbutted a prisoner who tried to push him aside to run away into the boiling blood pot, much to the annoyance of the guards. He also noticed the attempt that Luffy was making to reach level 5."}, {"type": "paragraph", "text": "When Crocodile was freed and escaped from Level 6 along with Luffy, Ivankov, Inazuma, and Jinbe, he offered to free Daz to provide him some backup and he agreed. Later, he joined the main force alongside Luffy and Mr. 2 Bon Kurei. As Blackbeard caused the leaders of this main force to stop, Magellan was able to follow them once taking out Blackbeard and his crew without much effort. Although Ivankov and Inazuma tried to stop Magellan, he still overcame them and as soon as Daz, along with the other rioters, joined with Buggy's forces, Magellan attacked them. Fortunately, they were saved by Mr. 3's wax abilities."}, {"type": "paragraph", "text": "As Luffy decided to take on Magellan with Mr. 3's abilities, Daz, Crocodile, Jinbe, Mr. 2, Buggy, and the other rioters made their way to the main entrance in order to get a ship. Although they expected Marine ships to attack them, instead they were sailing away. As it seemed to be too late to get a ship, Daz, Crocodile and Buggy rode on a makeshift raft carried by Jinbe and were easily able to get onto one of the marine ships with the help of Jinbe's fish-man abilities. He and Crocodile alone managed to defeat all the Marines on the battleship. He then mocks Buggy for being completely useless during the battle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Impel_Down_Makeshift_Raft.png/revision/latest/scale-to-width-down/210?cb=20130522003651", "caption": "Daz, Buggy, and Crocodile all ride on the makeshift raft carried by Jinbe."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Once everyone managed to board the ship, the Marines reveal that Buggy was a member of Gol D. Roger's crew. Daz asked him why he is so weak if it is true. He was then seen alongside the other Impel Down fugitives, falling from the sky to Marineford, to support Crocodile and to assist in the Whitebeard War. He is later seen alongside Crocodile fighting the Whitebeard Pirates."}, {"type": "paragraph", "text": "Later in the battle, Daz, under Crocodile's orders, helped Luffy by stopping Dracule Mihawk's attacks with his powers. Mihawk seemed to know about him, but his abilities weren't enough to stand up to the Shichibukai, and he was easily defeated. Crocodile himself intervened in the fight, saving both Mr. 1 and Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8b/Daz_Protects_Luffy_From_Mihawk.png/revision/latest/scale-to-width-down/210?cb=20130226155459", "caption": "Daz protects Luffy from Mihawk."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three weeks after the war, he and Crocodile are shown on an unknown island in the Grand Line. After reading a newspaper article concerning Luffy, Daz comments on how crazy the Straw Hat captain is. Daz adds that Luffy was wounded and wounds do not heal quickly. Crocodile contradicts Daz' remark saying that he himself is healed and decides to head out to the New World as proof. Crocodile then invites Daz to go with him. Daz naturally accepts the offer without hesitation."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/86/Crocodile_and_Daz_Bonez_Post_War.png/revision/latest/scale-to-width-down/210?cb=20130510015738", "caption": "Daz with Crocodile after the war."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mr. 1 vs. Mr. 2 Bon Kurei, Akumai, and Billions", "elements": []}, {"text": "Mr. 1 vs. Roronoa Zoro", "elements": []}, {"text": "Daz Bonez, Crocodile, and Jinbe vs. Marine soldiers", "elements": []}, {"text": "Daz Bonez and Crocodile vs. Whitebeard Pirates", "elements": []}, {"text": "Daz Bonez vs. Dracule Mihawk", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids English adaptation, Daz's tattoo is removed. In the battle with Zoro, the vast amounts of blood shed are also removed in the 4Kids version."}, {"type": "paragraph", "text": "In the FUNimation dub, Smoker incorrectly states that Zoro killed Daz while discussing Zoro's new bounty with Tashigi."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "All of Daz's Devil Fruit techniques contain \"Supa\" somewhere in the name (Sparkling Daisy, for example, would be romanized directly as \"Supakuringu Deijī\").", "elements": []}, {"text": "Miss Goldenweek's Rainbow Color Trap reveals that his dream was to become a \"Super hero\" (\"Supa Hero\"). This is a play on his Devil Fruit name being the Supa Supa no Mi.", "elements": []}, {"text": "Daz and Miss Doublefinger were paired together in Baroque Works due to both being cold-blooded and efficient killers.", "elements": []}, {"text": "He is the only known bounty hunter that has eaten a Devil Fruit (along with the non-canon Accino).", "elements": []}, {"text": "Daz's favorite food is raw ham, while his least favorite food is baked pork.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Daz_Bones_Superhero.png/revision/latest?cb=20080705092903", "caption": "Daz Bonez's dream materialized."}]}]}