{"sections": [{"title": "Bentham", "level": 1, "content": [{"type": "paragraph", "text": "Bentham of the Wild, alias Mr. 2 Bon Kurei, is a former officer agent of Baroque Works and an okama."}, {"type": "paragraph", "text": "He was a major antagonist during the Alabasta Arc, and one of the central characters from Miss Goldenweek's \"Operation: Meet Baroque Works\", along with the rest of Baroque Works Officer Agents."}, {"type": "paragraph", "text": "While he was once an enemy of Luffy's as a member of Baroque Works, the two became quick friends, leading Bon Kurei to sacrifice himself for Luffy both at Alabasta and later at Impel Down, being one of his main allies during that Story Arc. He is currently the new queen of Newkama Land."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bentham is a relatively tall male cross dresser who wears flamboyant ballet clothes with a swan theme. He generally dresses in a pink overcoat and blue medieval clothes. He wears heavy makeup, and he often sports a distinct wide grin which often carries over when he changes his appearance. His legs, being exposed, are hairy. Underneath these clothes, his physique is fairly muscular, as seen during the Impel Down Arc, possibly as a result of his training in Okama Kenpo."}, {"type": "paragraph", "text": "Like all Baroque Works agents, he bears his number in his appearance. Mr. 2 Bon Kurei's number 2 is seen in the form of his swans, which are posed into a shape resembling the number \"2\". When he was impersonating Nefertari Cobra, he wore the king's robes and sandals. The back of his over coat bares the kanji for \"Bon Festival\" (盆暮れ, Bonkure)."}, {"type": "paragraph", "text": "During Miss Goldenweek's \"Operation: Meet Baroque Works\", he wears a dark suit with a dress shirt covered in 2's underneath with dark pants. Later in the cover story, he wears Mr. 3's attire, which is a dark hoodie with two number 3's on it, striped pants that only extend a little bit past the knee, and light colored shoes."}, {"type": "paragraph", "text": "Later, in Impel Down, he wears a striped, rag-like prisoner's outfit. He also wore Hannyabal's headdress and pants when he was disguised as him. After entering Level 5.5, he wore bandages on his arms, abdomen, and neck, and purple pants that cut off below his knees and black boots. When he let his fellow prisoners escape, he was disguised as Magellan, wearing his coat and pants."}, {"type": "paragraph", "text": "Two years later, when he becomes the new Queen of Newkama Land, he is shown wearing a slightly different version of his ballet clothes with some features such as bigger wings and furry collar."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bentham has a flamboyant attitude which includes singing, dancing, and spinning, much to the annoyance of the other Officer Agents. Despite being an assassin, he prioritizes friendship above all else."}, {"type": "paragraph", "text": "He's the only higher up that lacks a female partner of the same rank. Possibly because he believes he is both male and female, probably due to his powers and lifestyle as a self-proclaimed okama, despite never actually wearing women's clothing besides the make up smeared on his face. He is assigned both a number and a holiday for his code name."}, {"type": "paragraph", "text": "As opposed to the ideas of his fellow agents, Mr. 1 and Mr. 5, Mr. 2 Bon Kurei greatly values friendship, as evidenced by his selfless sacrifice to allow the Straw Hats to escape Alabasta when they where ambushed by Captain Hina, later when he once again attacked Hina to save Miss Valentine, and finally when he risked his life to open the Gates of Justice for everyone in Impel Down."}, {"type": "paragraph", "text": "This also shows that he is incredibly selfless and righteous, and is extremely proud of himself for it (telling Magellan he had no regrets for his sacrifice). He will often motivate such actions by saying that abandoning his companions goes against \"the okama way\". This did not hinder him from attacking Vivi during the face-off at Alubarna, though."}, {"type": "paragraph", "text": "He always finishes a sentence with a \"wa yo\", which in Japanese reflects a feminine (if assertive) speech pattern. He also often says \"Jodan janai wa yo!\" (冗談じゃないわよ, Jōdan janai wa yo, translates as \"It's not a joke!\" or \"Not joking around!\") as his catchphrase. He also says \"un deux trois\" (one, two, three in French) while asking others what four is. According to himself, his favorite word is vague."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Baroque Works", "level": 3, "content": [{"type": "paragraph", "text": "His openly emotional and poetic attitude can get on the nerves of others, particularly the other male Baroque Works agents, who are often annoyed at his presence."}, {"type": "paragraph", "text": "He is disrespectful to Mr. 4 and Miss Merry Christmas as he called them \"fat\" and \"old hag\" respectively."}, {"type": "paragraph", "text": "He also addresses Crocodile as \"Zero-chan\", even after learning his identity. He seems to have a knack for making people follow his lead, and can get others to ballet dance with him. Bentham seems to enjoy teaching others about the \"okama way\" more than anything, and will gladly show others how to ballet, such as the Billions put under his command."}, {"type": "paragraph", "text": "The relationship he has with his Billions is complicated. Although he attacks them and abuses them, he considers them friends and is visually enraged when they are attacked by Mr. 1."}, {"type": "paragraph", "text": "While Mr. 2 generally has an indifferent professional relationship with most of the Baroque Works Agents, he is however, on bad terms with Mr. 1. Because Mr. 2's flamboyant nature conflicts with Mr. 1's static coldheartedness, the two of them would often clash with each other. Ever since first meeting each other in Spiders Cafe, they've had this type of rivalry relationship. It is notably similar to the rivalry between Sanji (who defeated Mr. 2) and Zoro (who defeated Mr. 1)."}, {"type": "paragraph", "text": "While Galdino initially viewed Mr. 2 Bon Kurei as an idiotic nuisance, the okama's actions in Impel Down deeply moved Mr. 3; he felt that his actions in Marineford helped avenge, as he put it, his \"fallen friend\"."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Emporio Ivankov", "level": 4, "content": [{"type": "paragraph", "text": "Bentham worships Ivankov for being the greatest okama, as well as for saving his and Luffy's lives. Iva, in return, was moved by Luffy and Bon Kurei's strong friendship, and was among the many prisoners who were crying after learning of Bon Kurei's sacrifice to get the Gates of Justice open for them."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Bentham is a close friend of the Straw Hats after helping them escape Hina in Alabasta and once again in Impel Down. Oddly, he addresses Luffy's crew by a key part of their appearance, followed by (even though it is meant for a childish aspect) the honorific \"-chan\" (i.e. Luffy: Straw-Chan (Mugi-chan), Usopp: Nose-Chan, etc.). Luffy returns this affection by referring to him as \"Bon-chan.\""}, {"type": "paragraph", "text": "He aided the Straw Hats by hiding their ship, the Going Merry, when there were Marines searching around Alabasta, and by disguising himself and his men as the Straw Hat pirates in order to draw away the Marines pursuing them. In return, four members of the Straw Hats are in tears while Luffy screamed that they will never forget him."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Luffy became good friends with Bentham after he apologized for causing them trouble in Alabasta. Later, after breaking out of his cell and reuniting with Luffy in Impel Down, Bentham fought alongside Luffy to reach Ace. Throughout their reunion, Mr. 2 aided Luffy greatly through the various dangers of the prison, and ultimately aided Luffy and several other prisoners by sacrificing himself in order to open the way to their freedom. While he was later determined to be alive, Luffy is unaware of his friend's condition."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Luffy_hugging_Bentham.png/revision/latest/scale-to-width-down/210?cb=20150403170535", "caption": "Bentham hugs Luffy after meeting."}]}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Bentham's relationship with Sanji is a more complicated manner. While he does refer to the cook as \"pretty boy\" when being friendly, he still fought fiercely with Sanji when he stopped him from attacking Vivi along with the Super Spot-Billed Duck Troops. When Bentham turned into Usopp to gain the advantage, he was shocked that Sanji kicked him regardless, but Sanji stated that a person's true character came from the heart. This statement moved Mr. 2 and when turning into Nami, he mused that even she would not make Sanji hesitate. This was not the case and Bentham exploited Sanji's newfound weakness, saying that he was easy to read. When Sanji eventually defeated him, Bentham asked the cook to finish him off, saying that Baroque Works would kill him anyway, but Sanji declined and offered a hand, saying it was a good fight. Moved to tears again, Bentham accepted this newfound friendship only for Sanji to kick him again, knocking him out and retrieving Usopp's goggles, which Mr. 2 had taken."}, {"type": "paragraph", "text": "Afterwards, the friendship he created with Sanji was purely one-sided on Bentham's part as when he called the Straw Hats on a Den Den Mushi, Sanji hung up the second he heard his voice. However, Sanji was seen as one of the four Straw Hats who cried over his sacrifice, viewing Bentham in a more positive light for it."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Magellan", "level": 4, "content": [{"type": "paragraph", "text": "Bentham has gained the wrath of the former warden Magellan for staying behind during the escape to let the other escapes break out, and for copying his face to fool the other staff. As he copied Magellan to fool the Impel Down staff and destroyed the controls to make sure they could not go after Luffy and the others, a furious Magellan prepared to unleash his wrath on Bentham, asking if he had any last words. Bentham proudly responded by saying he had no regrets for his sacrifice. Magellan was unsuccessful in killing Bentham, and seems to still hold that grudge to this date."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an okama, Bentham has no shortage of tricks in his arsenal. While fond of singing and dancing, he is also an accomplished martial artist, even though his real threat does not come from his fighting ability."}, {"type": "paragraph", "text": "Bentham possesses a strong will, being able to resist Luffy's Haoshoku Haki before succumbing to his injuries from the wolves in Level 5."}], "images": []}, {"title": "Deception and Trickery", "level": 3, "content": [{"type": "paragraph", "text": "Despite his flamboyant and fun-loving personality, he has an exceptional prowess in trickery, deception, and mimicry, which makes him an extremely difficult opponent to deal with, as he can as easily escape pursuit as well as cause devastating confusion to whatever side he opposes. He managed to successfully infiltrate the seemingly secure Alubarna royal court and mimic Nefertari Cobra, creating further dissension and unrest among the poor villagers outside the capital's walls with scandalous words. He has also used his formidable tactical wits to even bypass the extremely high security defenses of the notorious Impel Down once he was released from his cell. Bentham has a strong caution for extreme danger, as he thought of many ways he could fight Magellan before correctly deducing its impossibility, thus choosing to reluctantly abandon Luffy in his battle with Magellan, opted to find and use other possible ways to help Luffy in his extremely dangerous mission to break Ace out of Impel Down. Using his Devil Fruit powers, Bentham can disguise himself as an attractive woman, specifically Nami, to allow him to gain a psychological advantage in his fight against Sanji and again against Hannyabal, both who are extremely perverted despite their powerful fighting prowess. In the case of Hannyabal, Bentham was successful in subjugating him using sheer wits instead of direct brute force. He also managed to trick the vigilant Magellan into letting his guard down by disguising himself as Hannyabal and feigning unconsciousness, allowing him to touch Magellan's face up close to copy his visage, a feat which is normally impossible due to the lethal nature of Magellan's Doku Doku no Mi. By further posing as Hannyabal, Bentham was able to deceive the entire Impel Down Staff into thinking that he has escaped into Level 3, allowing him to enter Level 5 and search for Ivankov without any detection at all. Ultimately, he helped Luffy and the other prisoners to escape completely from Impel Down, by tricking the staff by disguising as Magellan to open the Gate of Justice, as well as closing it after Luffy and the others escaped, eluding their pursuers of a fleet of warships."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Due to his extremely hard training in Okama Kenpo, which Bentham described as painstaking, Bentham has incredible superhuman physical prowess. He has an extremely high level of agility, able to easily match Sanji, as well as perform a wide variety of acrobatic flips, twirls, somersaults, and cartwheels, including ballet rotation at high speed for increased momentum to enhance the power of his kicks. His immense acrobatic prowess also makes him extremely evasive, able to swiftly counter or evade fast attacks such as Sanji's kicks or Hannyabal's trident thrusts. He has incredible leg strength, as his kicks are extremely powerful, easily knocking out the Sphinx, a giant beast and boss of Level 2, and knock away the Minotaurus who is an awakened Zoan Devil Fruit user (whom Crocodile noted to be far superior to regular Zoan users). In a combined assault with Buggy, Luffy, and Galdino, Bentham unleashed a spinning kick to its head where the immense force significantly damaged it, causing the Minotaurus to hold its head in intense pain despite his extremely increased endurance. The aftershock of the attack caused the floor underneath its feet to break in pieces."}, {"type": "paragraph", "text": "He has an incredibly strong amount of stamina and endurance, being able to recover quickly enough to escape being captured by the Marines after his fight with Sanji while his fellow officers were arrested. During the battle of Alabasta, he was able to keep up with Karoo, an animal known to run faster than a leopard (though Karoo was injured at the time) and while in pursuit, he was even able to run up a wall that went straight upwards and had no foothold. While he is confined in the Level 3 prison of Impel Down, Bentham continued to sing and dance energetically, completely unfazed by the extremely hot temperatures, a feat that Buggy complimented as it would be impossible for normal people to even stand due to the extreme heat. Shortly after reuniting with Luffy, Bentham took a very brutal hit from the Minotaurus's club that caused him to yell in pain, and quickly shrugged off the pain to retaliate when Minotaurus attacked Luffy. After Luffy sent the Minotaurus flying, Bentham quickly recovered from the damage he received. While in Level 5, Bentham could continuously drag Luffy in a sleigh for a long while enduring against the immense cold temperatures bare chested. He also retains sufficient strength to fend off a large Wolf Unit by himself, despite receiving heavy injuries in the extreme cold during the fight. Bentham also survived a fight with Magellan, who had previously beaten Luffy with little effort."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Bentham ate the Mane Mane no Mi, a Paramecia-type Devil Fruit that allows him to turn into someone who he touches. This ability makes him a perfect master of disguise. He can memorize the entire physical appearance of his target when he touches them with his right hand. And when he changes, he can also perfectly replicate the copied person's flexibility, strength, and other physical aspects such as stature and voice. He can switch back to his normal state by touching his own face with his left hand."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Mr._2_changes_his_appearance.gif/revision/latest/scale-to-width-down/180?cb=20181011103625", "caption": "Mr. 2 changes his appearance."}]}, {"title": "Okama Kenpo", "level": 3, "content": [{"type": "paragraph", "text": "Bentham is a very powerful martial artist and a master of a unique, dance-based martial arts style known as Okama Kenpo (\"Ballet Kenpo\" in the Alabasta Arc Japanese anime and FUNimation dub, \"Oh Come My Way Karate\" in the Viz Manga, \"Crazy Karate\" in the 4Kids dub, and \"Crossdresser Kenpo\" in the FUNimation dub of Movie 8), which combines forceful and acrobatic kicks and sometimes punches with ballet dancing. His hard training in this fighting style made Bentham powerful enough to kick Mr. 1, an infamous assassin and a extremely proficient hand-to-hand fighter in his own right, through a stone wall during their brief fight, and to be a match for Sanji's Black Leg Style. With Okama Kenpo, Bentham can use a wide array of powerful kicks for offense, as well as acrobatic dance-like maneuvers for evasion. This enables him to easily defeat large numbers of prison guards who were fully armed with trident spears and firearms in Impel Down, knock out a Demon Guard, and briefly hold his own against Hannyabal, the second strongest fighter in Impel Down after Magellan."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "The two swans on his back are not just for show. Bentham can take them off at the midpoint of their necks and slip them onto his toe shoes. When he has these swans on his feet, Bentham's kicks become as powerful as rifle shots (due to the steel beaks) and gain a farther range (due to the swans' necks extending every time that he kicks)."}, {"type": "paragraph", "text": "Although used only once, Bentham can detach and throw his (presumably false) mascara Matsuge as boomerangs, which fly out in an arc and return to his face."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Not much is known about his past. At some point, he was recruited into Baroque Works and carried out the most important tasks for the organization's ultimate plan: Operation: Utopia. One of these jobs was apparently getting close to and imprinting the face of Vivi's father Cobra."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Little Garden Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mr. 2 was sent out shortly after Mr. 3's defeat on Little Garden to kill him for his failure to eliminate the Straw Hat Pirates."}], "images": []}, {"title": "Drum Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "By the time he arrived at Little Garden, Mr. 3 was nowhere to be found, leading Mr. 2 to fear being killed by Daz Bonez. He then ordered his men to sail back to Alabasta at top speed and intercept any ships they encounter."}], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Straw Hats first encountered Bon Kurei on their way to return Princess Vivi to the desert kingdom of Alabasta. His antics immediately amused them, and Luffy, Usopp, and Chopper fell head over heels for his ability. Bon Kurei revealed that he ate the Devil Fruit, Mane Mane no Mi, which allows him to transform into an exact copy of anyone he has touched. He further demonstrated that his powers also copy the body. To Nami's dismay, he once transformed into her and allowed Luffy, Chopper, and Usopp to view her breasts. She responded by punching his skull inwards (in the remake movie, he shows Nami's entire body to them as well as Sanji causing Nami to hit all of them). When his crew found him, Bon Kurei bid farewell to the Straw Hats. As he left, his crew called him by his Baroque Works codename, surprising all of the Straw Hats - even Vivi did not know who he was, despite being told about what he looked like."}, {"type": "paragraph", "text": "Bon Kurei traveled to Spiders Cafe to meet with the other Officer Agents. Bon Kurei briefly fought with Mr. 1 because he attacked Bon Kurei's subordinates. From there the agents rode Banchi to Rainbase."}, {"type": "paragraph", "text": "At the meeting in Rain Dinners, Mr. 0 revealed himself to be Crocodile and gave the agents their orders for Plan Utopia. Mr. 3's report revealed to Bon Kurei that his friends were really the enemies, thus forcing him to combat them. At Nanohana Nefertari Cobra - actually Bon Kurei in disguise - claimed to have stolen the country's rain and planned to destroy the harbor. He had Koza shot and then had the harbor set on fire. He then proceeded to Alubarna with Mr. 1 and Miss Doublefinger. At the capital's West Gate, the agents discussed their plan to stop the Straw Hats."}, {"type": "paragraph", "text": "When the Straw Hats and the Super Spot-Billed Duck Troops rushed into Alubarna, Bon Kurei chased down Usopp and Matsuge. He easily defeated Usopp and Matsuge in 2 seconds. He stole Usopp's sniper goggles and attempted to trick Vivi in Usopp's form. Thanks to the failsafe plan the Straw Hats devised to avoid being fooled by his powers, Vivi easily figured out the truth and she and Karoo ran with him in hot pursuit. Bon Kurei chased them up the cliffside and into the city. After Karoo fell, Sanji and the ducks Cowboy and Ivan X intercepted Bon Kurei, allowing Vivi and Karoo to get away."}, {"type": "paragraph", "text": "Bon Kurei and Sanji clashed in a very intense battle. Just as Sanji looked set to be the victor, Bon Kurei discovered Sanji's weakness: Nami. He impersonated her, using her form to drive Sanji into a crazy fanboyish state which allowed him to even the playing field. Eventually, Sanji realized that Bon Kurei must revert to his own form to unleash his stronger attacks. He took advantage of this and forced Bon Kurei to revert to his form so that he could pummel him. Bon Kurei then pulled out his iron-tipped swans from his shoulders and put them onto his shoes. With the swans on his shoes, his kicks were strong as a rifle shot and could reach further. This created more problems for Sanji, and the playing field was even once more. However, Sanji eventually managed to defeat Bon Kurei. Bon Kurei begged Sanji to finish him off, believing that he would be killed for his failure, but Sanji offered to shake his hand for a good fight. Just as Bon Kurei took his hand, overwhelmed with emotion, Sanji kicked him in the head and took back Usopp's goggles."}, {"type": "paragraph", "text": "When the Straw Hats prepared to leave Alabasta after thwarting Crocodile's scheme, Bon Kurei called them up on a Den Den Mushi and told Luffy that he had their ship. He hid it from the marines docked in the harbor (Smoker, Hina, Jango, Ironfist Fullbody, Tashigi, etc.) and exclaimed that he did it because they were friends. Now that he was no longer a member of Baroque Works (and a pawn of Crocodile), he wanted to be a close friend, perhaps even a shipmate."}, {"type": "paragraph", "text": "As the Straw Hats and Bon Kurei left Alabasta on the Going Merry, Hina, Jango, and Fullbody attacked. Bon Kurei came up with a plan that would allow them to escape. He and his own shipmates impersonated the Straw Hats, thus luring Hina's squadron to them. This allowed the Going Merry to escape as Bon Kurei stayed behind with his crew. After giving his famous speech of friendship and humanity, he and his crew boarded the Marine ships and unleashed hell upon the Marines. As the Going Merry drew further away, Luffy exclaimed that he would never forget Bon Kurei and his crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Mr._2_vs._Sanji.png/revision/latest/scale-to-width-down/210?cb=20130420055627", "caption": "Bon Kurei and Sanji fight."}]}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "Bon Kurei was captured by Hina, but escaped from prison with a 32,000,000 bounty on his head He reappeared sporting a more refined, more masculine look than his ballerina outfit."}, {"type": "paragraph", "text": "Later on, he challenged Hina to a rematch in an attempt to save Miss Valentine from execution. After Miss Goldenweek, Miss Valentine, and Mr. 5 broke out Mr. 4, Miss Doublefinger, Miss Merry Christmas, and Lassoo, Bon Kurei was seen tied to Mr. 3 and thrown in jail with Crocodile and Daz Bonez so it could be assumed that he was defeated by Hina. He, along with Crocodile, Daz Bonez, and Galdino, were later transferred to Impel Down for a life sentence."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Bentham_Operation_Goldenweek.png/revision/latest/scale-to-width-down/180?cb=20130526132149", "caption": "Mr. 2 in Miss Goldenweek's Operation."}]}, {"title": "Impel Down Arc", "level": 3, "content": [{"type": "paragraph", "text": "Bentham was discovered by Buggy and Galdino dancing in his cell on Level 3 of Impel Down (despite having a bounty far lower than 50,000,000), seemingly unaffected by the heat and starvation. He immediately expressed his surprise at seeing Mr. 3 in Impel Down too. Galdino seemed initially hesitant at releasing Bentham from his cell, but was seemingly opted otherwise by Buggy, under the impression that Luffy would function more as their scapegoat if Bentham was with him. Later, when Luffy was attacked by the Sphinx and several guards, Bentham (disguised as Zoro) came to fight at Luffy's side. After defeating the sphinx and a tearful reunion, Bentham agreed to help Luffy reach Level 5, as he also wished to go there to see someone: Emporio Ivankov, the queen of Kamabakka Kingdom and the idol of okamas worldwide."}, {"type": "paragraph", "text": "As they tried to get to Level 4, Minotaurus stopped them. Bentham recognized the danger immediately and warned Luffy about its strength. However, before they could make a move, Minotaurus used its speed and physical strength to send Bentham flying. As Minotaurus tried to hit Luffy with its mace, Bentham used a strong kick to save Luffy, although he was already in great pain. As he was just about to get killed by him, Luffy saved him using his Jet Bazooka technique to send Minotaurus flying. Bentham immediately recognized how powerful Luffy had become."}, {"type": "paragraph", "text": "Upon reaching the exit to Level 4 of Impel Down, Bentham warned Luffy of the great danger ahead: he would only have one chance to land safely in Level 4 or die. It was then that Galdino and Buggy caught up with them with Minotaurus hot on their heels. Bentham contributed to the defeat of Minotaurus by using his Okama Kenpo. Only a short while later, Bentham along with Luffy, Buggy, and Galdino came to realize that they were falling into the boiling pot of Level 4 because their combined attacks against Minotaurus had weakened the floor beneath them."}, {"type": "paragraph", "text": "To their fortune, the falling debris allowed them to jump off it before they landed in the boiling pot. After Bentham complained the most about the heat in Level 4, Luffy started to run in a random direction without considering the dangers. The fact that Bentham could come to the conclusion that Luffy was running towards the kitchen showed how well Bentham knew the map of Impel Down. As he assumed the kitchen to be stuffed with lots of food, he followed Luffy, saying that he was starving."}, {"type": "paragraph", "text": "However, only after a short while, they were stopped by an angry Magellan, who appeared suddenly to block their path. Bentham, knowing of Magellan's nigh impregnable poisonous defensive capabilities, warned Luffy to run, but as Magellan began targeting Luffy seriously, Bentham left tearfully, apologizing that he could not do any more. As a result, Bentham tactically retreated from the battle, feeling sorry for abandoning Luffy, yet knowing it wiser to survive and fight another day."}, {"type": "paragraph", "text": "Some time afterwards, with a poison-drenched Luffy on the brink of death and imprisoned on the level below, Bentham decided to put his plan into action. He rallied up his two allies and then decided to disguise himself as Hannyabal after eliminating the real one. Bentham used his powers and changed into one of the most attractive women in his arsenal, Nami. As Nami, he first enticed Hannyabal and then invited him to the weapons storage room to help \"Nami\" undress. After entering, he attacked and bound him down, keeping him away from everyone and being able to freely impersonate him."}, {"type": "paragraph", "text": "Bentham, now successfully masquerading as Hannyabal, along with a hesitant Buggy and Galdino, began their descent to Level 5 to save Luffy. When asked as to why he would do such a thing, he bluntly replied that he and Luffy \"are friends! There's no need for any other reasons!\" signifying his ideal to stick to his okama way."}, {"type": "paragraph", "text": "Before beginning their downward trek, Bentham (still under the guise of Hannyabal) urged a medical team to help cure Luffy, giving them the impression that the Marines needed him alive. The team however reported that anything they try could only hasten his death, confirming what Magellan had stated earlier. Bentham panicked, and Galdino and Buggy simply told him to leave Luffy, saying to live after fighting Magellan was a miracle. This quip suddenly reminded him of Iva-san, who is rumored to perform medical miracles."}, {"type": "paragraph", "text": "With that, a newly emboldened Bentham set off for level 5, the Freezing Hell, to rescue Luffy. Buggy and Galdino accompany him as prisoners he was personally transferring. On the way down, it was discovered the man whom he sought had mysteriously disappeared from the his cell, and he was not the only one. A significant portion of inmates were rumored to have been 'demoned' away. While what happened was unknown, the superstitious chalked it up to hellspawn coming and claiming the damned. After reaching their destination, they were confronted by wolves, the strongest beasts in Impel Down so far."}, {"type": "paragraph", "text": "Although his companions flee, Bentham faced the beasts head on in an unseen skirmish. Having apparently bested his canine adversaries, he appeared at the cell where Luffy was kept, shirtless and covered in blood, determined to rescue his comrade. He then began asking inmates for directions to Iva, refusing to believe that he was \"demoned away\". One of the inmates erroneously directed him to the forest, fully aware that a hungry wolf pack resided there. As the spiteful inmate had planned, wolves began attacking him."}, {"type": "paragraph", "text": "Once again, he held his ground and began to fend them off, coming between them and an incapacitated Luffy, who would make for quite an easy prey. However, their numbers were too great and he began to falter. Before any fatal hits could be delivered, Luffy, in a defensive rage, bit one of the wolves. He then angrily but involuntarily unleashed his Haki, screaming at the wolves for attacking his friend. The wolves scattered in fear, and Bentham was confused as to what Luffy just did. Before he could ask though, he passed out. He was then shown lying next to Luffy unconscious when a mysterious figure appeared."}, {"type": "paragraph", "text": "When Bentham woke up, he found himself heavily bandaged and lying in a closed building, filled with gleeful folk cheering, drinking, eating, and having a good time. He was shocked beyond all means, wondering where he was, how he got there, and most importantly the condition and location of Luffy. His questions were answered by the mysterious figure from before, now appearing more as a woman then as a man as she did before, her name is Inazuma. Inazuma told Bentham that they were in Newkama Land, hidden within the bowels of Impel Down, where the prisoners live in comfort directly below the Freezing Hell."}, {"type": "paragraph", "text": "Bentham then saw Iva, whom he had been impatiently waiting for. Iva was about to speak with him but was interrupted by a burly prisoner barging in, who wished to take revenge on Iva for the Kamabakka Kingdom turning the man's father into an Okama. Iva appeared to be intimidated by his threats and seemed reluctant to fight, but then the man proceeded to angrily shoot a cannon at Iva, who repelled it by merely batting his Matsuge, revealing his fear to be a sarcastic ruse. Iva then turned the man into a woman, using the Horu Horu no Mi Devil Fruit ability, saying people have the right to be whatever they want to be."}, {"type": "paragraph", "text": "As the newly changed woman fled, Bentham immediately begged Iva to help Luffy. Iva said that he was a prisoner in Impel Down, and may not be kind enough to do that. However, he then revealed how a near-death Luffy's selfless plea to save Bentham moved him, so he decided to help them by giving Luffy a fighting chance against the toxins in his body using the healing aspects of his Horu Horu no Mi powers. Bentham's elation towards the news quickly turned into horror when Iva revealed that his friend was confined in a heavily-barricaded room, where Luffy was undergoing the excruciatingly painful medical treatment to purge the poisons from his body, a procedure that should take up to two days, potentially making him late for Portgas D. Ace's execution (scheduled to take place sixteen hours from then)."}, {"type": "paragraph", "text": "Bentham was deeply disturbed by the suffering Luffy endured alone and yearned for some way to share in his agony, feeling guilty doing anything while Luffy endured such a hellish torture, but Iva told him that it was up to Luffy whether to survive or not. With this in mind, Bentham set it upon himself to shout support for Luffy for hours on end, continuing to scream bloody long after his throat was completely raw and he had nearly exerted himself to the point of physical collapse."}, {"type": "paragraph", "text": "This touching display of dedicated friendship and devotion eventually inspired the initially skeptical Newkamas and even Ivankov himself to join in the act as a group and took up the slack for the drained and injured Bentham. After their constant cheering for the better half of a day, at long last a fully healed Luffy burst forth, and in only a fraction of the time Iva had predicted, yelling for \"Foooooooooood!!!!!!\", to the amazement and massive relief of all those present. With Luffy effectively recovered, Bentham finally collapsed in exhaustion, after some celebration of Luffy's recovery, much to Luffy's shock."}, {"type": "paragraph", "text": "Later, when Luffy, Inazuma, and Ivankov returned from Level 6, he was given some Tension Hormones by Ivankov to enable him to fight. During Luffy's stand off against the Blackbeard Pirates, Bentham was surprised by the recovery of Minotaurus, which Crocodile explains as the Jailer Beasts being Awakened Zoans. When Ivankov and Inazuma broke off to slow down Magellan, Bentham convinced Luffy to believe in them and to keep moving up. After a long and arduous battle through all the floors alongside the rest of the Impel Down breakout crew, he managed to reach Level 1, joining up with the other group of escapees and immediately gave Galdino and Buggy (the ad hoc leaders of the latter group) a kick for abandoning them way back at Level 5. While Luffy and Galdino fought Magellan, the other prisoners cleared the way to the entrance but found the ten battleships had left. Bentham waited while Jinbe, Daz Bonez, Crocodile, and Buggy went out to steal a battleship. With Magellan's Kinjite forcing them out the door, the prisoners are propelled out of the door by Ivankov's Death Wink. They are saved by a group of whale sharks summoned by Jinbe."}, {"type": "paragraph", "text": "Once Luffy and the others made it onto the battleship, they came across the issue of the Gates of Justice standing shut before them. Before they could decide the best course of action, though, the gates began to open. It was then that the others realized that Bentham was missing. Jinbe hesitantly revealed to Luffy that Bentham had decided to stay behind disguised as Magellan in order to open the Gates of Justice, knowing it was the only possible way, and sacrificing himself for the group, but did not want the others to be aware of this until after the fact. Jinbe begrudgingly broke this promise to Bentham by telling all this to Luffy and giving him a Baby Den Den Mushi to contact him with."}, {"type": "paragraph", "text": "After completing his mission by opening the gates and destroying the mechanism that controls it, Bentham was confronted by the real, and shocked, Magellan. He reverted to his normal self, ready to take Magellan's judgment. However, before Magellan could attack, Luffy's voice came over the Baby Den Den Mushi, asking why he always sacrificed himself to save Luffy, but Bentham stoically attempted to remain silent. Luffy finally struggled to say that they were going, and sadly thanked him. Sobbing profusely, Bentham grabbed the Baby Den Den Mushi and told Luffy to make sure that he saved his brother. Luffy and his band of escapees commend him, admitting they would have never survived if not for Bentham and tearfully cried out to him until they passed through the Gates of Justice."}, {"type": "paragraph", "text": "Bentham then fought against an enraged Magellan, who asked him if he had any last words. Bentham, showing no fear and great pride in his actions, proudly responded by saying that he had no regrets."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Bon_Kurei_and_Luffy_Team_Up.png/revision/latest/scale-to-width-down/210?cb=20130330195151", "caption": "Bentham reunites and teams up with Luffy in Impel Down."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c5/Minotaurus_Chasing_Luffy%27s_Group.png/revision/latest/scale-to-width-down/210?cb=20130223112512", "caption": "Bentham and co. flee from the Minotaurus."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c3/Bentham_Fights_Wolves.png/revision/latest/scale-to-width-down/210?cb=20130330195632", "caption": "Bentham fighting with wolves from Level 5 to protect Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/Magellan_vs._Bentham.png/revision/latest/scale-to-width-down/210?cb=20130622044709", "caption": "Bentham faces Magellan after staying behind to open the Gates of Justice."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Bentham survived his fight against Magellan, but remained in Impel Down. He then became the new queen of Newkama Land in Impel Down, Level 5.5, and he was shown dancing in front of his followers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Bon_After_time-skip.png/revision/latest/scale-to-width-down/180?cb=20130912235528", "caption": "Bentham as the new queen."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bon Kurei vs. Mr. 1 (more of a squabble)", "elements": []}, {"text": "Bon Kurei vs. Usopp and Matsuge (Unseen)", "elements": []}, {"text": "Bon Kurei vs. Sanji", "elements": []}, {"text": "Bon Kurei vs. Hina (Alabasta Sea)", "elements": []}, {"text": "Bon Kurei vs. Hina (Rematch, disguised as Mr. 3)", "elements": []}, {"text": "Bentham and Monkey D. Luffy vs. Sphinx", "elements": []}, {"text": "Bentham, Luffy, Mr. 3, and Buggy vs. Minotaurus", "elements": []}, {"text": "Bentham vs. Wolf Unit", "elements": []}, {"text": "Bentham vs. Magellan (Unseen)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bentham (as Nami) vs. Hannyabal", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Mr. 2 Bon Kurei was originally going to be another pair, consisting of \"Mr. 2\" (who resembled Mr. 4) and \"Miss Obon\"."}, {"type": "paragraph", "text": "In an early concept of Mr. 2, he was originally \"Mr. 2 Happy Birthday\"."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Originally in the manga, the Japanese words for Okama are written on his pink coat. In the anime however, Bon Kurei is written instead."}, {"type": "paragraph", "text": "This change also carries over to the dialogue. During the Alabasta Saga, Mr. 2 is never referred to as an \"Okama\" at all, instead every mention of the word \"Okama\" was replaced with \"Ballet\". His fighting style was likewise changed to \"Ballet Kenpo\" by Toei. However, he still yells \"Okama Way!\" as he bids the Straw Hats farewell at the end of the arc. This censorship was lifted from Bon Kurei in the Impel Down arc in the anime."}, {"type": "paragraph", "text": "Bon Kurei's color scheme is slightly different between the manga and anime. In the anime, he wears greenish-colored mascara and his headband is yellow-green. However, in the manga, his headband is white and the mascara he wears is a light-purple color."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the manga, during the Meet Baroque Works Mini title page arc, Mr. 2's wanted posters are shown with the words \"Bon Kurei\" written on them; but his name is most often translated as Bon Clay, even in the Japanese One Piece video games. Most fans also say his name is Bon Clay, mostly due to the way the anime pronounces the name. 4Kids, Viz and FUNimation also chose Bon Clay over Bon Kurei. Another change was to his fighting style which was dubbed as \"Crazy Karate\" in the 4Kids version instead of Okama Kenpo and as \"Oh Come My Way Karate\" in the English manga by Viz Media. In the 8th Movie, due to being a theatrical film Toei lifted their censorship, so in the Japanese version, Mr. 2 was an \"Okama\" again, and practices \"Okama Kenpo\". Likewise, when FUNimation dubbed the movie, they correctly translated this over as \"Crossdresser\" and \"Crossdresser Kenpo\". However, FUNimation used \"Ballet Kenpo\" in their dub of the TV Anime, in keeping with the Japanese version and also omitted him saying \"Okama Way\" when he was going to delay Hina.", "elements": []}, {"text": "In some fan translations, as well as the FUNimation simulcast, 'Okama' is omitted and replaced with 'Queer', which is incorrect as 'Okama' does not refer to a person's sexuality.", "elements": []}, {"text": "In the Viz Manga, the word \"Okama\" is still omitted and any instance is substituted with the phrase \"Oh Come My Way\" (the back of his coat is translated as \"Oh Come My Way\"), and characters calling him an \"okama\" is changed (Luffy and Usopp said they pulled up a \"weird fish\" in the Viz Manga, and a \"man-lady\" in the English version of the eighth movie). He is also sometimes referred to as a \"queen\", a \"swan\", and \"iffy\".", "elements": []}, {"text": "Instead of not having a female partner due to being both a man and a woman in the Japanese version, it is instead said that \"he does not want one\".", "elements": []}, {"text": "While Bon Kurei's original Japanese voice is somewhat nasal and petulant, he speaks with a high pitched southern United States accent in the 4Kids dub. He also speaks in rhymes.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Mr. 2 appeared as a figurine in the Portrait of Pirates series in the \"Neo\" wave 3."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Songs", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oh, Come My Way", "elements": []}, {"text": "Mori no Miyako no Oka March", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the sixth Japanese fan poll, Bentham is ranked at 25th place, making him the most popular of the okamas.", "elements": []}, {"text": "Mr. 2 Bon Kurei is the only Officer Agent in the Baroque Works megastructure without a female partner. This stems from the fact that he is an okama and plays both the male and female part (Mr. 2 for the male and Bon Kurei for the female). His original song from the One Piece Character Song Carnival CD is 'Oh Come My Way', which can be orally interpreted as 'Okama Way' (in fact, he says both \"oh come my way\" and \"okama way\" while singing during his trip to the Spiders Cafe), which means 'Transvestite Way'.", "elements": []}, {"text": "Because of being an Okama, he receives two names: a male name with a number, and a female name with a holiday. His female name, Bon Kurei, is a name referring to a specific night in the Obon (お盆) festival. His Devil Fruit also refers to his status as an Okama as he is able to take on both genders as he pleases.", "elements": []}, {"text": "Bentham is seen amongst the audience of the theatre in a trailer for Movie 6 even though he himself has no part in the story.", "elements": []}, {"text": "When fighting with Sanji and taking off his swans for the first time, he notes that the left one is female and the right one is male.", "elements": []}, {"text": "Nami imitated his way of talking as she was fighting Lola in Thriller Bark Arc, when she said \"Jodan Janai Wa Yo!\" to convince Lola that she was a man.", "elements": [{"text": "This is somewhat ironic given Bon Kurei's use of Nami's form via his Mane Mane no Mi powers in both the Alabasta Arc and Impel Down Arc.", "elements": []}]}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Transvestism – Wikipedia article about transvestism", "elements": []}, {"text": "Okama – Wikipedia article about the term okama", "elements": []}, {"text": "Drag Queen – Wikipedia article about drag queens", "elements": []}, {"text": "Ballet – Wikipedia article about ballet", "elements": []}]}], "images": []}]}