{"sections": [{"title": "Terracotta", "level": 1, "content": [{"type": "paragraph", "text": "Terracotta is Igaram's wife and the royal head chef who appeared very late in the Alabasta Arc. She is also the royal seamstress. Her friend and helper is Maidy."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Terracotta is a large woman with curly blonde hair. She looks almost identical to Igaram which prompts some characters to accuse her of being Igaram in drag. Zoro said, \"A couple can only look so much alike!\" when he first saw her. Terracotta wears a dark red tunic, with a orange lining, that has a white stripe. Under her tunic is a light blue shirt with white buttons. She also wears bright red lipstick."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She has a very determined personality and is quite dedicated to her duties. She was determined not to be beaten by Luffy's appetite when she was feeding the crew after their initial recovery."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the royal head chef with over 30 years of experience, she is an exceptionally skilled cook, being able to quickly cook massive portions of food to feed the Straw Hat Pirates and keep up with Luffy's appetite."}, {"type": "paragraph", "text": "Also, as the royal seamstress, it can be assumed she has great sewing skills as well."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "She first appeared at the end of the Alabasta Arc, bringing food to the Straw Hats and Vivi in the medical bay. She admired Luffy's appetite and was determined to keep up with it until it was satisfied. Later, she and Maidy are making a dress for Vivi's speech. When Igaram came in to talk to Vivi, she kicked him out, saying that no one was allowed in."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, she is seen along with Maidy taking Chaka's measurements to make new clothes for him in time for the upcoming Levely."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/RoyalPalace2YL.png/revision/latest/scale-to-width-down/240?cb=20130806233429", "caption": "Terracotta fitting Chaka for the Levely."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Terracotta is Italian meaning \"baked earth\" and is a type of earthenware.", "elements": []}, {"text": "While Igaram's hair curls outwards, Terracotta's hair curls inwards.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 213 (p. 10) and Episode 128, Terracotta is mistaken by Zoro as Igaram, her husband.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 86.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 215 and Episode 129.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 65 Chapter 639, cover story: From the Decks of the World Vol. 23.", "elements": []}]}], "images": []}]}