{"sections": [{"title": "Igaram", "level": 1, "content": [{"type": "paragraph", "text": "Igaram is the captain of the Alabasta royal guard (captain of Alabasta security in the English dub). He aided Nefertari Vivi in infiltrating Baroque Works and took on the codename Mr. 8. He was partnered with Miss Monday. He is also Terracotta's husband."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Igaram is a tall man with a small red nose and has blonde hair in a style that resembles a powdered wig."}, {"type": "paragraph", "text": "Under the guise of Mr. 8, he dressed like a gentleman. Reflecting his codename Mr. 8, he has the number 8 at the tips of his collar. The curls in his hair also look similar to the number 8."}, {"type": "paragraph", "text": "After the timeskip Igaram was seen with a small mustache. He also sported a black coat, over a spotted light colored shirt, under a sash around his stomach, which is striped around the edges."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Igaram is extremely loyal to Vivi and he is prepared to give his life for her. He is also extremely worried about her when her life is threatened and in those cases can be very overprotective."}, {"type": "paragraph", "text": "Igaram has a unique way of speaking. Whenever his voice gets tired, he clears it by going \"Ma~ma~ma~\" (\"Mi~mi~mi~\" in the English manga) like an opera singer."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Nefertari Vivi", "level": 4, "content": [{"type": "paragraph", "text": "Igaram takes very good care of Vivi to a point that he is like a second father to her. While taking the role as Mr. 8, Igaram acted as the superior to Vivi's cover identity of Miss Wednesday."}, {"type": "paragraph", "text": "Igaram tends to worry over Vivi's antics during the journey to Levely at Mary Geoise."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Igaram was initially hostile towards the Straw Hats while he was posing as Mr. 8 of Baroque Works. After he and his fellow agents at Whisky Peak were defeated by Zoro, Igaram told Nami about Baroque Works and begged Nami to ensure Vivi's safely returned to her kingdom."}, {"type": "paragraph", "text": "After Crocodile's defeat, Igaram was grateful to the crew for their actions and helped provide shelter for them from the Marines. He was later surprised to read in a newpaper that Nico Robin joined the crew."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Baroque Works", "level": 4, "content": [{"type": "paragraph", "text": "As Alabasta suffered due to Crocodile's machinations, Igaram and Vivi infiltrated his organization in order to uncover his identity. After they achieved this due to Nico Robin (also known as Miss All Sunday) allowing this, Crocodile took action against them and sent agents to eliminate them. After the Straw Hats agreed to escort Vivi back to Alabasta, Igaram decided to use himself as a decoy only to be seemingly killed in an explosion. Igaram survived and he returned to his kingdom to reveal Baroque Works' ploy to the people."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the head of the Alabasta Royal Guards, Igaram has command over the entire force under the Nefertari family. He would leave his position of power to Chaka when he is absent. As he is capable of becoming a frontier agent of Baroque Works, Igaram is considered to be a powerful fighter himself. He is also good with disguises."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Igaram's abilities are based on firearms hidden in non-conspicuous places on his person. He fights with a saxophone that shoots bullets when played, and he also has small guns hidden in his hair that fire when he pulls on his neck tie."}], "images": []}, {"title": "Attack List", "level": 3, "content": [{"type": "list", "elements": [{"text": "Igarappa (イガラッパ, Igarappa): Igaram attacks with his saxophone, which fires a blast of bullets when played, like a giant shotgun. The name is possibly a portmanteau of Igaramu (イガラム, Igaram) and rappa (ラッパ or 喇叭, a trumpet or horn). In the 4Kids dub, it is mistakenly called Igarappappa.", "elements": []}]}, {"type": "list", "elements": [{"text": "Igarappappa (イガラッパッパ, Igarappappa): After pulling his necktie strings to expose the gun barrels hidden in the curls of his hair, he attacks by pulling the loops of his necktie to fire explosive bullets. According to Zoro, this technique (along with his rather unorthodox saxophone shotgun) makes Igaram seem like an action figure. It is mistakenly called Igarappa in the Odex dub.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Igarappappa.png/revision/latest/scale-to-width-down/250?cb=20140627000634", "caption": "Igaram shooting with Igarappappa."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He and Princess Vivi infiltrated Baroque Works and manage to become Frontier Agents in order to learn the organization's true boss and objectives. He was known as Mr. 8 by most of Baroque Works before being exposed."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Whisky Peak Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the Straw Hat Pirates arrived at Whisky Peak, Igaram greeted them under the guise of Igarappoi and invited them to party with the townsfolk. When Nami asked him how long it would take for their Log Pose to record the island's frequency, Igaram claimed he would discuss this with her after the pirates had rested before telling the townspeople to welcome the Straw Hats. As the celebrations progressed, Igaram proclaimed that the Straw Hats' happiness was all that mattered to them."}, {"type": "paragraph", "text": "After the Straw Hats had all seemingly passed out or fallen asleep, Igaram looked at Cactus Mountain while telling them to sleep soundly before he was greeted by Mr. 9 and Miss Wednesday, who called him a poet. When asked about the status of the pirates, Igaram stated they had fallen to Hell. After Miss Monday arrived and began bickering with Mr. 9 and Miss Wednesday over their failure to obtain whale meat for the town, Igaram told them to calm down before showing them Monkey D. Luffy's bounty of 30,000,000, which shocked the trio. Igaram reprimanded Miss Monday for judging the strength of the Straw Hats based on their appearance alone before telling her, Mr. 9, and Miss Wednesday to tie them up and confiscate all valuables from their ship. However, they were interrupted by Roronoa Zoro, who asked them to let the Straw Hats continue sleeping and claimed that a true swordsman never allows alcohol to control him when an incredulous Igaram asked him how he was awake after drinking so much. When Zoro mentioned Baroque Works by name and explained how he was scouted out by one of its members before, Igaram proclaimed that they must kill him if he knew their secret and ordered the bounty hunters to attack, only to find Zoro was gone. After causing some of the bounty hunters to shoot each other, Zoro appeared behind Igaram with his sword in the latter's hair, causing the remaining bounty hunters to prepare to attack both of them, but Igaram blew the attackers away with Igarappa."}, {"type": "paragraph", "text": "After Zoro disappeared, Igaram wondered if he was actually planning to take on all of them by himself. When Miss Monday seemingly defeated Zoro, Igaram noted that the latter had made them waste a lot of him, only to be shocked when Zoro suddenly knocked Miss Monday out by squeezing her head with his hand. Seeing this, Igaram assumed that the Marines had made a mistake in assigning the 30,000,000 bounty to Luffy and that it was actually Zoro's bounty. Igaram told Mr. 9 and Vivi that they had a matter of responsibility to worry about after being defeated to this extent by only one swordsman before attacking Zoro with Igarappa. After Vivi failed to finish Zoro off due to Karoo's misdirection, Igaram attacked Zoro with Igarappa again, but Zoro cut a hole in the roof he was standing on to dodge, which led Igaram to decide to show Zoro his true strength. Soon afterward, Mr. 9 managed to restrain Zoro and Vivi held Luffy hostage, allowing Igaram to attack Zoro with Igarappappa. However, Zoro threw Mr. 9 into Vivi and launched himself toward Igaram using Luffy's stomach before cutting him down."}, {"type": "paragraph", "text": "However, Igaram soon got up while noting he could not simply die here before completing his mission, only to be surprised when Mr. 5 and Miss Valentine appeared behind him. When the duo insulted the performance of the defeated agents, an angered Igaram asked them if they had only come to laugh, and was surprised when Mr. 5 refused to help them defeat Zoro. After Mr. 5 and Miss Valentine revealed that they had been sent to dispatch spies from a certain kingdom who had infiltrated Baroque Works, Igaram wondered if this was the end, and when Mr. 5 was about to reveal the names of the spies, Igaram attacked him with Igarappappa before telling Vivi to run away. However, he was defeated by Mr. 5, who hit him with an explosion. However, Igaram regained consciousness and found Zoro, whom he begged to protect Vivi in his stead before promising that he would be greatly rewarded by the kingdom of Alabasta for doing so. Hearing this, Nami asked Igaram if they would reward the Straw Hats with 1,000,000,000."}, {"type": "paragraph", "text": "Shocked by such an enormous sum of money being requested, Igaram admitted that he could not guarantee this amount because he was only a single soldier. When Nami asked him if Vivi is worth less than this amount despite being the princess of Igaram's kingdom, Igaram told her that she could most likely negotiate with Vivi herself to receive this money after escorting her back to Alabasta. Nami noted that he was asking them to save Vivi first, but Igaram proclaimed that there was no time to negotiate because Vivi's life was currently in danger. After Nami sent Zoro off to protect Vivi, Igaram noted that it would be the end of Alabasta if anything happened to Vivi."}, {"type": "paragraph", "text": "After the Straw Hats were informed of Mr. 0's identity by Vivi, Igaram showed up while dressed as Vivi and informed them that Baroque Works would be sending assassins after them now that they knew this secret, especially since they were able to defeat Mr. 5 and Miss Valentine. When Igaram asked Luffy if he had decided to take Vivi back to Alabasta, Luffy agreed to do so. Igaram asked Vivi to give him the Eternal Pose to Alabasta and explained what it was to Nami before revealing that he would be setting off for Alabasta with three dummies and pretend to be Vivi and the Straw Hats, which would cause their pursuers to follow him instead. Later, at the port, Igaram told Vivi to take care on her dangerous journey ahead before setting sail. As Igaram expressed his confidence that Vivi would be able to save their kingdom, his ship was blown up by Miss All-Sunday, seemingly killing him."}], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Igaram survived the incident at Whisky Peak and hurried back to Alabasta in order to stop the civil war."}, {"type": "paragraph", "text": "After the defeat of Crocodile, Igaram arrived at Nanohana (which appeared to be what Robin intended). He finally caught up with the rebellion carrying a witness, Kappa, who saw Mr. 2 Bon Kurei removed his disguise as Nefertari Cobra, the king of Alabasta, which was proof that the rebellion was started by Baroque Works and not by the king. He was again seen posing as Vivi, during a speech to the people of Alabasta, so she could sneak away secretly to say goodbye to the Straw Hats."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Rainbow Mist Arc", "level": 4, "content": [{"type": "paragraph", "text": "In a filler scene in the Rainbow Mist Arc, he was seen placing Rainbow Mist Volume X on a shelf in Alabasta."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events of Enies Lobby, Igaram noticed that Robin joined the Straw Hat Pirates while looking at the Straw Hats' new wanted posters."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Luffy's second appearance in Marineford, Igaram was seen with King Cobra in the throne room as he was informed that the pirates that were attacking the country were driven out."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Igaram was seen with Pell and Chaka as they were being fitted for new clothes for the upcoming Levely. He was showing them the story about the Straw Hats, laughing as he pointed it out to them."}, {"type": "paragraph", "text": "He was later seen standing by Cobra's bedside, smiling as the king read the newspaper."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/RoyalPalace2YL.png/revision/latest/scale-to-width-down/235?cb=20130806233429", "caption": "Igaram cheering over the news about the Straw Hats' return after the timeskip."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Igaram accompanied the Nefertari Family to Mary Geoise alongside Chaka, Karoo, and Pell. Vivi's antics caused Igaram to worry deeply for her."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the way to the Levely, Igaram received the news of Luffy's exploits at Totto Land."}, {"type": "paragraph", "text": "The Alabasta Kingdom participants later arrived at Mary Geoise. At the socializing plaza in the Pangaea Castle, Igaram noticed that Vivi was getting along well with the Mermaid Princess."}, {"type": "paragraph", "text": "After Mjosgard stopped Charlos from enslaving Shirahoshi, Igaram stood next to the Neptune Family as Mjosgard promised Neptune that he would protect Shirahoshi during the Levely."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Legend of the Rainbow Island", "elements": []}, {"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He and his partner in Baroque Works have a \"deception\" theme. Miss Monday dressed in a nun costume that hid her muscular body and Igaram had guns hidden in the rolls of his hair and in his saxophone.", "elements": []}, {"text": "He shares the same Japanese and 4kids dub voice actors with his wife.", "elements": []}]}], "images": []}]}