{"sections": [{"title": "Kaya", "level": 1, "content": [{"type": "paragraph", "text": "Kaya is a young woman who lives in the largest mansion in Syrup Village on the Gecko Islands. She is a close friend of Usopp and is currently studying to become a doctor."}, {"type": "paragraph", "text": "She is an ally of the Straw Hat Pirates during the Syrup Village Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kaya is a slim and pale-skinned girl with blonde hair. She has wide brown eyes, that are of a sort of lighter shade. In the 324th episode, right after finally recovering, she was shown to have now gotten taller and somewhat more womanly."}, {"type": "paragraph", "text": "Despite her fortune, she is rarely seen in anything but simple neat clothing, be it a plain long dress or \"common\" clothing such as a skirt and jacket."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When Kaya was first introduced she was a rich yet sickly young girl. It later turns out she was just worrying herself into sickness. She was also rather sensitive and against violence, as she was horrified when Usopp attacked Klahadore, while angry when she thought Usopp was trying to ruin the butler's reputation; when Klahadore revealed his true colors and brutally insulted her memories, she broke down into tears."}, {"type": "paragraph", "text": "Kaya is also shown to be caring for people, as she refused to pull the trigger on her gun and was willing to kill herself to protect children."}, {"type": "paragraph", "text": "She now leads a happy and healthy life, working hard toward her dream of becoming a doctor. She is carefree and very trusting towards others."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "According to Kuro, Kaya's father loved his daughter very much and wished nothing but the best for her."}, {"type": "paragraph", "text": "Kaya may have other family, but the storyline never touched on this. Klahadore mentioned that if Kaya died without signing a will that would leave her fortune to him, the mansion and assets would go to relatives."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Usopp", "level": 4, "content": [{"type": "paragraph", "text": "Kaya is indebted to her friend Usopp and has grown very fond of him since he has indirectly saved her life through the tales that was told to her, more so than she ever had been in the past. She was willing to listen to Usopp's various tall tales despite knowing he was a liar, yet she was incapable of accepting some of the grim realities when the stories become serious about Klahadore, believing the butler to be loyal and faithful to her."}, {"type": "paragraph", "text": "Since the Kuro incident, she understands he wants her only to be safe and happy, which is why he told his outrageous stories to her while he was in the village. She made a promise never to tell anyone about the Black Cat Pirates' attack."}, {"type": "paragraph", "text": "She keeps up to date on any information that is released about him in the newspapers and vows that no matter what condition he is in when he returns, she will nurse him back to health. A small running gag is that, even though Usopp's face has not been shown in either of the wanted posters he has appeared on, Kaya always recognizes him."}, {"type": "paragraph", "text": "Usopp has developed a deep liking for Kaya as well, and it was partially because of her that he refused to give up on the Going Merry despite it was already doomed to sink soon, to the point of nearly severing his bond with the Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/da/Usopp_Tells_Kaya_His_Stories.png/revision/latest/scale-to-width-down/190?cb=20140626002814", "caption": "Usopp telling Kaya about one of his many \"adventures\"."}]}, {"title": "Usopp Pirates", "level": 4, "content": [{"type": "paragraph", "text": "She also keeps in touch with the former Usopp Pirates and talks to them whenever an update on the Straw Hats - Usopp in particular - gets around to them."}], "images": []}, {"title": "Merry", "level": 4, "content": [{"type": "paragraph", "text": "Merry is Kaya's butler, and is truly loyal to her, seeing her well being as a priority to the point of willing to die for her sake. In turn, she was very shocked and horrified to find him with near-fatal injuries left by Klahadore (Kuro). After Kuro's defeat, Merry seems to have become the servant she turns to. It is shown that Merry is also very dedicated to Kaya, who is thankful and kind to him, as near the beginning of the series Merry traveled a far distance in order to get a gift for Kuro, whose identity was at the time unknown."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Klahadore/Kuro", "level": 4, "content": [{"type": "paragraph", "text": "Until his deception was revealed, Kaya had always been fond of Klahadore, even leading her to dismiss Usopp's claims about Klahadore being a pirate as hurtful lies. However, she did have an occasional argument with Klahadore when he expressed his low regards for her friendship with the town's troublemaker, Usopp. Klahadore refused to let Kaya see Usopp under the basis that he would never be able to face her father if he let anything happened to her."}, {"type": "paragraph", "text": "When she discovered what Usopp had told her was the truth, she became upset and could do nothing as Kuro betrayed her feelings on purpose, upsetting her, yet she was unable to pull the trigger of the flintlock that she aimed at him. It was during this encounter that Kuro revealed his true hatred and contempt for her, and she even found it very chilling when he made no attempts to deny nor regret his attempt in murdering Merry."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Kuro_Destroys_Kaya%27s_Present.png/revision/latest/scale-to-width-down/180?cb=20130321215742", "caption": "Kuro's contempt for Kaya represented when he destroys her heartfelt gift without even trying them on."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Having inherited her parents' fortune and estate, Kaya is a wealthy person. She is currently studying to become a doctor."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Kaya was rather frail in health, mainly because she worried herself to sickness. Once she regained her confidence, her health improved. Despite her poor health at the time, she managed to force herself to the shore in order to confront Kuro."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During her confrontation with Kuro, Kaya brought along an ordinary flintlock, though she could not pull the trigger when he proceeded to attack her emotionally."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Syrup Village Arc", "level": 3, "content": [], "images": []}, {"title": "Arrival of the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "Kaya is a rich girl who received an inheritance after her parents died. After their death, Kaya fell ill, and her caretaker Klahadore took care of her. Secretly, the town liar Usopp visited Kaya in her mansion to tell her tall tales to make her laugh and feel better."}, {"type": "paragraph", "text": "However, Klahadore was against this and eventually kicked Usopp out and told Kaya that he was a bad influence. The same day, Usopp and Luffy overheard a conversation between Klahadore and Jango. Klahadore was in fact Captain Kuro, and revealed that he planned to kill Kaya and take her inherited money. Usopp tried to warn Kaya about the plot, but Kaya did not believe him and she even slapped him for \"lying\" about Klahadore being a pirate after her life and fortune."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Kaya_Greeting_Usopp.png/revision/latest/scale-to-width-down/230?cb=20150802013337", "caption": "Kaya lights up upon greeting Usopp."}]}, {"title": "The Murderous Plot", "level": 4, "content": [{"type": "paragraph", "text": "Merry, a servant of hers, later informs Kaya that all this is true, after he himself had been grievously wounded by Klahadore. Despite the risk, Kaya runs and confronts Kuro during a battle between him and his men against Luffy, Usopp, Nami, and Zoro. Kuro reveals that he had indeed tried to kill Merry. Kaya aims a gun at Kuro, but she drops it and cries after Kuro tells her about how he was publicly at her side for so long, and how much he wanted to kill her during all of it, and how soon he was going to. Usopp gave an order to the Usopp Pirates to protect Kaya no matter what happened."}, {"type": "paragraph", "text": "Ninjin, Tamanegi, and Piiman flee with Kaya to the forest, and Jango chases after them. When the children try to sneak up on Jango, he attacks them and threatens to kill them. Kaya threatens to kill herself unless the children are kept alive. As she has not yet signed a will that states that Kuro gets Kaya's inheritance after her death, Jango would be in serious trouble if she dies, so he agrees to leave the children alone."}, {"type": "paragraph", "text": "The children pretend to be knocked out when Jango forces Kaya to sign the will. Right before Jango is able to slice her throat apart, Usopp's Pirates ram him with a shovel. After Jango knocks them away, Usopp and Zoro appear. Zoro slices off a branch with his sword so Usopp can hit Jango with his Secret Technique Shooting Star attack and save Kaya's life. Later she and Usopp Pirates make a promise not to tell the rest of the village about the Kuro incident. Usopp's reason is that Syrup Village is so small and remote that most pirates have no reason to come. Usopp believes that the village's peace would be shattered if they learned that someone (Klahadore) they trusted for three years was a pirate, and had planned an attack on them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Kaya_Points_Gun_at_Kuro.png/revision/latest/scale-to-width-down/210?cb=20130927191412", "caption": "Kaya confronts Kuro."}]}, {"title": "Thanks and Farewell", "level": 4, "content": [{"type": "paragraph", "text": "After the incident, Kaya gave the Going Merry to the Straw Hat Pirates as a gratitude for saving her life. Later on Kaya decided that she must study to become a doctor one day, and hopefully help Usopp when he will come back injured."}], "images": []}, {"title": "Keeping Track on the Straw Hats", "level": 3, "content": [{"type": "paragraph", "text": "She is mentioned many times when the Straw Hat Pirates talk about the Going Merry."}, {"type": "paragraph", "text": "She made another appearance when she saw Sogeking's wanted poster. She and the Usopp Pirates recognized Usopp despite his disguise."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Kaya is seen again studying while Merry protects her from a group of suitors. She also has a picture of Sogeking on her stack of medical books."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/37/Merry_protecting_Kaya.png/revision/latest/scale-to-width-down/180?cb=20181108181617", "caption": "Merry protecting Kaya while she studies."}]}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the events at Dressrosa, Kaya and the former Usopp Pirates were overjoyed to see Usopp's new wanted poster."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, she makes an appearance when Luffy receives his first bounty. However, when Merry shows her the bounty poster, she only notices that Usopp appears in the background."}, {"type": "paragraph", "text": "Also, like several other characters, she was seen reading the news about Luffy's second intrusion to Marineford along with Ninjin, Tamanegi, and Piiman."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Kaya_and_Usopp_Pirates_Read_Newspaper.png/revision/latest/scale-to-width-down/210?cb=20130625104048", "caption": "Kaya reads the news about Luffy with the former Usopp Pirates."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the original anime and manga, Kaya threatened to cut her throat with Jango's Chakram to make him stop hurting the boys. However in the 4Kids dub, they had Kaya struggle with the Chakram as if it had a mind of its own, Jango told her amateurs should not be using it. Also, in the scene in which she points a gun at Kuro the 4Kids dub edited it into Usopp's slingshot instead."}, {"type": "paragraph", "text": "In the credits of Episode 17 on the FUNimation DVDs, her name was accidentally written as Maya, but this was only a typo on FUNimation's part."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kaya is another name for the Japanese Nutmeg-yew, a slow growing tree native to Japan and South Korea.", "elements": [{"text": "Kaya also means \"rich\" in Malay and Indonesian.", "elements": []}]}, {"text": "In the 5th Japanese fan poll, Kaya ranked at 88th place.", "elements": []}, {"text": "In Episode 64, Usopp builds a snow woman that resembles Kaya.", "elements": []}, {"text": "Kaya's favorite food is seafood.", "elements": []}]}], "images": []}]}