{"sections": [{"title": "Donquixote Doflamingo", "level": 1, "content": [{"type": "paragraph", "text": "Donquixote Doflamingo, nicknamed \"Heavenly Yaksha\", was the captain of the Donquixote Pirates, a former Shichibukai with a frozen bounty of 340,000,000, the most influential underworld broker under the codename \"Joker\", and is a former World Noble of the Donquixote Family descent."}, {"type": "paragraph", "text": "He is the first son of the late Donquixote Homing and the older brother of the late Rosinante, both of whom he killed out of feeling betrayed by them. Doflamingo became the king of Dressrosa after taking the throne from Riku Doldo III eight years before the start of the series. He ruled the country tyrannically until he was stripped of his positions as a Shichibukai and king after he was defeated by Monkey D. Luffy near the end of the Dressrosa Arc, being arrested alongside most of his crew members by Admiral Fujitora and locked up at Impel Down Level 6."}, {"type": "paragraph", "text": "He is a major antagonist in the Marineford Arc where he took part in the Battle of Marineford and sided with the Marines, along with most of the other Shichibukai, and the primary antagonist of the Dressrosa Arc and the Dressrosa Saga as a whole, being the impetus for the entirety of the saga's events."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Doflamingo is a very tall (standing at 10', and as a comparison taller than Kuzan as shown in their confrontation), light blond-haired, very lean and muscular man with tan skin. He generally dresses in flamboyant clothes. In reference to his animal theme, the flamingo, his clothes are brightly colored, with his light pink feather coat most distinctly of all. Doflamingo sports a pair of curved, thin white sunglasses, which appear to serve as his eyesight with red or purple lenses. He also walks with an odd, bow-legged waddle (though he does not always walk like this), which is also a reference to his animal theme."}, {"type": "paragraph", "text": "He has a white shirt with red stripes, a green belt, and orange pants with white stripes. He also wears black dress shoes that are somewhat pointed. Originally in the anime, Doflamingo had a red shirt with black stripes, a purple belt, and black pants with red stripes. However, when he reappeared during the events of Sabaody, his color scheme was switched to its manga depiction, with the exception of his glasses. In the manga, he has orange-tinted glasses, while in the anime (pre-timeskip) he has purple-tinted ones. He is also seen often, if not always, smiling."}, {"type": "paragraph", "text": "Two years after the war, Doflamingo's outfit is somewhat less elaborate, wearing a plain, open shirt that has small, dark Jolly Rogers as cufflinks, a different belt, and pink striped pants. However, he still wears his trademark sunglasses which have changed from purple to red lenses and dress shoes. Post-timeskip, he drapes his feathered coat on his shoulders instead of leaving his arms in the sleeves, similar to many high ranking Marines and pirates alike. He also now wears a golden hoop earring on each ear."}, {"type": "paragraph", "text": "Even as a child, Doflamingo already had a liking for sunglasses, though he had not yet acquired his trademark ones. Before leaving Mary Geoise, Doflamingo wore the typical garb of the Celestial Dragons, and his hair fashioned the same style. After the family left Mary Geoise, his hair was changed to a simply neat and tidy in a bowl cut and his wardrobe consisted of simple fine clothes: a low-neck button up shirt with black striped and a frilled cravat. However, due to the harsh life on the run from angry citizens, Doflamingo's appearance started to turn more disheveled; in a depiction, his shirt and hair grew messier and unkempt, going barefoot, sitting on a tattered chair near palm trees, smoking a cigarette."}, {"type": "paragraph", "text": "At age 10, after gaining loyalty from his four closest childhood friends, he changed out of his tattered noble clothes for a more simple, yet cleaner, black shirt and white shorts. From this point onward, Doflamingo began to look more threatening. He eventually took on the appearance of a mob boss, wearing a black coat like a cloak over a pale lavender shirt with an unbuttoned collar, bole-colored shorts. His hair took on a spiky appearance, and he replaced his ordinary sunglasses with the trademark pair with spiral-shaped red lenses that he has now."}, {"type": "paragraph", "text": "At age 17, his hair was longer than it is currently, he had two earrings on his left ear, and he sported a pair of goggles that he wore on his forehead. In addition, he also wore sunglasses similar to the ones he wears today, but they had a different temple design, and his signature feathered-mantle."}, {"type": "paragraph", "text": "At age 25, when Law first came to him requesting membership in the crew, Doflamingo seemed to have done away with the goggles, but otherwise seemed the same in appearance; he wore a black dress shirt with a red tie and white pants with a bright red design, with his signature mantle over it, At age 28, during his trip to Minion Island he briefly wore a blood-red double-breasted suit with yellow-gold buttons, with matching blood-red dress pants and shoes, a pair of (dark green in the anime, black in the manga) gloves and changed his sunglasses to the ones he wears currently."}, {"type": "paragraph", "text": "By the time he was 31, he had his hair cut down to the current length. Currently, after his defeat at Dressrosa, Doflamingo now has Seastone shackles on his arms, legs and entire chest, while chained to the floor of Tsuru's ship, he is also wearing a standard Impel Down prison uniform, with a few white bandages on his forehead as well. He was also given a new set of sunglasses."}], "images": []}]}