{"sections": [{"title": "Bartholomew Kuma", "level": 1, "content": [{"type": "paragraph", "text": "Bartholomew Kuma is a former Shichibukai, the former king of the Sorbet Kingdom, and a former officer of the Revolutionary Army with a bounty of 296,000,000."}, {"type": "paragraph", "text": "Once feared as an extremely vicious pirate, earning himself the title \"Tyrant\", he is now a human weapon called \"Pacifista\", developed by Vegapunk. Once Vegapunk finished his modifications on Kuma, the Shichibukai was converted into the first complete Pacifista cyborg, with the serial PX-0, and figuratively died in the process. Currently, he is a slave-to-rent for the World Nobles."}, {"type": "paragraph", "text": "He is also a major antagonist in the Marineford Arc where he took part in the Battle of Marineford and sided with the Marines, along with most of the other Shichibukai."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kuma is an enormous man, being 689cm tall. He is the tallest remaining Shichibukai (being three centimeters shorter than former member Gecko Moria) and is usually seen carrying a Bible. His overall appearance resembles that of a bear, though there are a few key differences. His eyes are strangely covered by either a pair of glasses or clear-mirrored lenses. While initially he will give the impression of wearing glasses, it seems that, based on the Pacifista that were destroyed, those are actually his own eyes."}, {"type": "paragraph", "text": "His hat features a pair of rounded ears, and, along with the dark blue fabric of his pants, is covered in brown spots. His jacket contains a large white design reminiscent of a target cross-hair or a coda sign. There are also several white paw prints lining the bottom hem of his coat. He also has a long protruding chin. He bears the tattoo \"PX-0\" on the left side of the base of his throat, after the final touches were done on him becoming a complete cyborg before the Battle of Marineford."}, {"type": "paragraph", "text": "In the anime, Kuma's hair and jacket are black, and his hat is gray with black paw-like prints. In the manga, Oda originally intended for Kuma to have a completely different color scheme. Kuma's hair was shown to be brown, his jacket bright orange, and his hat yellow with green spots. Later in the manga chapters, his coat was changed from orange to blue, though the rest of his design remained untouched. In Unlimited Cruise, Kuma's jacket is brown."}, {"type": "paragraph", "text": "After the timeskip, Kuma's cybernetic armor has become heavily damaged, with several weapons jutting out of his body, fruit of his mission to protect the Thousand Sunny from attackers for two years. Due to his subsequent enslaving at Mary Geoise, he now wears rags similar to the ones Jean Bart once wore when he was a slave as well. It's unknown if he has the \"Hoof of the Soaring Dragon\" burnt into him like all other slaves of the World Nobles have."}, {"type": "paragraph", "text": "In SBS Volume 63, Oda drew the Shichibukai as children. Kuma had short hair and was missing his bear ears hat, glasses, and cybernetic enhancements he receives later on. He wore tattered clothing and wooden sandals carrying a heavy load of chopped firewood on his back while reading a book called \"Ninokin\"."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Despite his imposing figure and his past reputation, Bartholomew Kuma is a very calm and quiet person."}, {"type": "paragraph", "text": "When talking, Kuma customarily uses the word target in his sentences. He also tends to ask a person where they would like to go on a holiday before he sends them away with his Devil Fruit ability, often honouring the recipient's request, but will occasionally send them to a place of his own choosing regardless of whether or not he received a reply."}, {"type": "paragraph", "text": "Although he obeys the commands of the World Government, Kuma disagrees with what his superiors deem \"good\" and \"evil\" in the world. Instead, Kuma strives to uphold his own ideals (described as Moral Justice) whenever possible. He even goes so far as to speculate that Blackbeard's acceptance into the Shichibukai ranks had been a very poor decision by the government, despite the fact that it filled the position left by Crocodile's defeat. However, Kuma's loyalty does not extend to the Marines. This can be seen when he declines to answer a direct question from Admiral Kizaru during the Sabaody Archipelago Arc. Due to his refusal to assist the Marines without a direct order, Kuma did not hesitate to lie when it came to his victory over the Straw Hats at Sabaody Archipelago."}, {"type": "paragraph", "text": "There are still several mysteries behind Kuma's character. The details behind his transformation into a \"Pacifista\" and what exactly it entails are still unknown. He also whispered a message to Silvers Rayleigh during the battle at the Sabaody Archipelago, which the old pirate believes puts the other man at risk. It was revealed much later."}, {"type": "paragraph", "text": "Kuma was shown to be a brilliant agent of deception, managing to successfully manipulate the World Government from discovering his true affiliation towards the Revolutionary Army for several years, managing to be appointed to the position of Shichibukai (though it does appear that they did eventually become suspicious enough of Kuma to compromise his identity as a double-agent and force him to accept a permanent lobotomy). Despite being perceived as the most dutiful of the Shichibukai, Kuma still held enough of his convictions to adamantly refuse to directly address Marines as high-ranked as Admiral Kizaru. He was generally calm and composed in any situation, and is subtle in his attaining of goals (such as not revealing to the Straw Hats the exact reasons for testing their power twice and then separating them across the world for future preparation). He also demonstrated great loyalty and honor to his cause in defending the \"Thousand Sunny\" from a continuous stream of assault over the course of two years, not moving to even recover from his injuries. His combat abilities are also demonstrated with expert use, Kuma using it for offense, defense and travel and often in quick succession of the previous action."}, {"type": "paragraph", "text": "According to Sabo, Kuma was a gentle man whose kindness earned him great respect from his fellow revolutionaries as proven when he spared the lives of the Straw Hats once and also later saved them from being killed by Kizaru by teleporting them to safety From his friendship with Luffy's father, Kuma requested Vegapunķ to aid Luffy and his crew one last time by protecting their ship for two years after being fully converted into a Pacifista."}, {"type": "paragraph", "text": "However, at present, the modifications have been completed. In the finalization of the Pacifista project, Kuma (as the original model and the only one to have self-awareness) eventually lost his free will, personality and memory to the modifications, in order to ensure his reliability and continuing services towards the World Government. In this stage, Kuma shares the same mindless intelligence of his fellow Pacifista models, only recognizing individuals as either enemies or allies to the World Government. Doflamingo refers to the original personality as being \"dead\", though it was later revealed that Kuma and Dr. Vegapunk (the man responsible for his cybernetic implants) made a secret deal to allow for Kuma to have a temporary relapse by rendering his final \"free thought\" as defending the \"Thousand Sunny\"."}, {"type": "paragraph", "text": "After the timeskip, Sentomaru noted that Kuma had been acting strange ever since he had lost free will. This was a result of his deal with Vegapunk to have his final form protect the Thousand Sunny until one of the Straw Hats arrived."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Bartholomew_Kuma_Talks_to_Rayleigh.png/revision/latest/scale-to-width-down/210?cb=20130702030948", "caption": "Kuma delivers his message to Rayleigh."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Revolutionaries", "level": 3, "content": [{"type": "paragraph", "text": "Prior to receiving his final modifications, Kuma told Rayleigh that he was a member of the Revolutionary Army, as shown in a flashback when Dragon rescued the people of Trash Mountain in the Goa Kingdom. This was further supported by his past membership of the organization and acquaintance with Dragon and Ivankov. Kuma is deeply respected by his fellow revolutionaries as Sabo, Morley, Karasu, and Lindbergh plan to rescue Kuma from his torturous slavery during their infiltration of Mary Geoise."}], "images": []}, {"title": "Monkey D. Dragon", "level": 4, "content": [{"type": "paragraph", "text": "His relationship with Monkey D. Dragon is still a mystery. Though Kuma was working with the Revolutionary Army in secret as a Shichibukai, his final modification into a full Pacifista now places him fully under the World Government's control. Dragon is seemingly fully aware of Kuma's deal with the Marines. Kuma also had knowledge of Luffy being Dragon's son (something that even Ivankov was unaware of until he met the boy) and he subsequently spared the Straw Hats' lives on two occasions, as well as guarding their ship for 2 years from the likes of pirates and Marines due to their common connection."}], "images": []}, {"title": "Emporio Ivankov", "level": 4, "content": [{"type": "paragraph", "text": "It was stated by Ivankov that he and Kuma knew each other, and that he is no longer the man he once was. Ivankov knows Kuma very well, one clue of this is Ivankov's comment about how Kuma hated the World Government."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Kuma also knew a lot about Monkey D. Luffy, as he at least knew that Portgas D. Ace and Monkey D. Dragon are his adoptive brother and biological father, respectively. Both relationships were not public matters, and as such, very few people actually know about them, until the then Fleet Admiral Sengoku made it public during the war. He gave Luffy one final farewell before sending him to Amazon Lily and losing his free will to the Pacifista project's finalization."}, {"type": "paragraph", "text": "After Kuma witnessed Luffy defeating Gecko Moria, he reported it to the World Government, and they ordered Kuma to kill all witnesses on Thriller Bark including the Straw Hat Pirates. During the confrontation, Kuma injured Franky and Sanji hurt his leg while trying to attack Kuma. After a fight with Zoro, Kuma offered to spare everyone else if they allowed him to take Luffy. They refused and Kuma attacked them with an Ursus Shock, knocking out most of the Straw Hats except for Zoro and Sanji. Seeing no other way, Zoro offered to trade his life for Luffy's. Kuma agreed to Zoro's terms and subjugated him into experiencing the pain Luffy endured throughout his fight against Moria. Acknowledging Zoro's loyalty, Kuma even mused about Dragon having a good son with a loyal crew."}, {"type": "paragraph", "text": "After Thriller Bark, he spared them again on the Sabaody Archipelago, where he helped them escape Admiral Kizaru and Sentomaru, his last known act under his own free will. While Kuma helped the entire Straw Hat Pirates crew, he showed a certain respect for Zoro, specifically after he found the swordsman alive following the events at Thriller Bark. Zoro, too, recognized and respected Kuma’s strength, admitting that he was only alive because of the other’s mercy."}, {"type": "paragraph", "text": "Kuma's intentions during the incident with the World Nobles on the Sabaody Archipelago was to save the Straw Hat Pirates. He also made a deal with Vegapunk to program him to protect the Thousand Sunny until a Straw Hat member returned. Franky told the other Straw Hats that they owe a debt to Kuma, although he noted the next time they would meet, Kuma would be a heartless, human weapon."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "World Government and Marines", "level": 4, "content": [{"type": "paragraph", "text": "Prior to his final modifications, Kuma publicly claimed to follow the World Government. However, he refused to cooperate with the Marines unless given direct orders by the World Government to do so. Currently, due to his Pacifista upgrades, he has seemingly become a slave to both the World Government and Marines alike, doing whatever he is commanded. Kuma was also seen joking to Vice Admiral Garp and Fleet Admiral Sengoku about Luffy's crew slipping through his hands. Sentomaru, who was always distrustful of Kuma, addressed him as \"Kuma-kou\" (くま公, Kuma-kō), an honorific meant as a sarcastic and insulting way of addressing someone."}, {"type": "paragraph", "text": "Moria stated that because of Kuma's allegiance to the World Government, he worried him more than any other Shichibukai."}, {"type": "paragraph", "text": "The reason for his pretense as a loyal tool of the World Government has not been revealed yet, nor has the reason why he agreed to have his personality and memories removed or why he had even agreed to become a participant in the Pacifista project in the first place. He has shown to have command over the Pacifista units during his visit to Sabaody Archipelago, also showing he had no qualms sending one away during the battle along with the rest of the Straw Hats."}, {"type": "paragraph", "text": "Due to his current emotionless and inhuman state, he became a slave-to-rent for the World Nobles. Seeing him unable to cry or scream regardless of injuries, the Celestial Dragons heavily abuse him for their own pleasure, referring him as a top-class slave."}, {"type": "paragraph", "text": "Kuma is said to have hated the World Government before his conversion into a Pacifista."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Kuma_and_Pacifista.png/revision/latest/scale-to-width-down/210?cb=20130213063507", "caption": "Bartholomew Kuma and a Pacifista."}]}, {"title": "Dr. Vegapunk", "level": 4, "content": [{"type": "paragraph", "text": "Kuma seems to have a good enough relationship with Vegapunk. Vegapunk was able to grant him his final wish as a human being, which was to program Kuma to protect the Straw Hats' ship until their return. It is very likely that Vegapunk highly respects Kuma's strength, as he modified Kuma to be the prototype Pacifista, and let him do things that go against the World Government."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fb/Bartholomew_Kuma_Pacifista_Programming.png/revision/latest/scale-to-width-down/210?cb=20130623115359", "caption": "Kuma being programmed by Vegapunk."}]}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Gecko Moria", "level": 4, "content": [{"type": "paragraph", "text": "Kuma has been shown interacting with one of the Shichibukai, Gecko Moria. Moria feels that because of his loyalty to the World Government, he cannot be trusted. Kuma showed much patience around Moria, offering assistance to help him against the Straw Hats despite his disrespect towards him. Moria was gravely insulted at his offer and showed no qualms about attacking him, despite Kuma not being affected by his intimidation tactics. Moria also knew of Kuma's Devil Fruit, as shown when he stated that he knew about his powers and his tendency of asking people where they want to go on a trip before sending them flying away."}], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "No direct interaction is observed between the two. Nonetheless, Doflamingo seems to be aware of the modifications that he has undergone as he explained to Ivankov the reason that his personality has changed. However, he does not appear to know of Kuma's affiliation with the Revolutionaries."}], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Kuma has not met Blackbeard directly but showed to have prior knowledge of him before he was elected as a Shichibukai. Despite his unknown bounty, he knew about his past history as a member of the Whitebeard Pirates and was opposed to his appointment, showing his doubts over the matter."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Prior to his final Pacifista modifications, Kuma was a officer in the Revolutionary Army. As a result, he had control over its lower ranking members. However, he lost this power when he became a complete slave of the World Government. As the former king of Sorbet Kingdom, he once held political power."}, {"type": "paragraph", "text": "Kuma was shown to be brilliant at deception, managing to successfully trick the World Government about his true affiliation with the Revolutionary Army for several years, as well as being elected to the position of one of the Shichibukai."}, {"type": "paragraph", "text": "Kuma is one of the few people to have completely defeated the Straw Hat Pirates, and is also the only character introduced so far that has defeated the crew single-handedly, twice. However, the crew was extremely weak both times and they were in no shape to fight another battle, much less a Shichibukai (in the first encounter, the crew had just finished battling another Shichibukai, Gecko Moria, as well as an island full of zombies and a giant zombie named Oars; in the second encounter, they had just battled against a Pacifista while fending off a second, Kizaru and Sentomaru). He did not want the crew dead, however, since he allowed them to escape, indicating he might have held back."}, {"type": "paragraph", "text": "He is extremely fast, enough to seem as though he has disappeared in the eyes of the Straw Hats, as well everyone on Thriller Bark. This is, however, unclear if it has something to do with the modifications from Dr. Vegapunk, or if it is part of his Devil Fruit powers, or simply his raw speed."}, {"type": "paragraph", "text": "He has such a fierce reputation that even other powerful and famous pirates are unnerved by him, as seen when the captain of the Kid Pirates, Eustass Kid, seemed heavily disturbed when he witnessed the arrival of a Pacifista (mistaking it for the real Kuma) on the Sabaody Archipelago, despite the fact that his bounty was higher than Kuma's former one."}], "images": []}, {"title": "Geographical Knowledge", "level": 3, "content": [{"type": "paragraph", "text": "Through his actions, he appears to have a great knowledge in geography, as with his powers he knows exactly where he is sending someone seemingly no matter where in the world he is. His degree of knowledge is high enough to perfectly locate even a moving sky island, although his cyborg modifications may have enhanced this ability. This is also shown when he asks people where they would like to go before he \"pushes\" them."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Kuma ate the Nikyu Nikyu no Mi, a Paramecia-class Devil Fruit that gave him paw pads on his palms which give him the power to \"push\" or deflect anything, including the air around him (in paw-shaped bubbles); allowing him to not only defend himself from attacks but also to push objects at great speed. The fruit's powers also allow him to move at the same speed as the objects he pushes, possibly by using it to push himself, appearing instantaneously at a desired location regardless of distance, all the while moving with no more than a slow walk."}, {"type": "paragraph", "text": "Kuma has made numerous people \"vanish\" by slapping them with one of his hands. It is later revealed that he pushes them away, sending them flying to another destination, which he can choose, even if the destination requires several days to reach."}, {"type": "paragraph", "text": "Kuma has also shown the ability to \"push\" or deflect things that lack palpability such as people's pain and exhaustion. This is shown when Kuma took all of the pain that Luffy had suffered on Thriller Bark and left him feeling completely healthy, meaning that his abilities can be used to heal people and cure them. However, in this case, Kuma removed Luffy's pain because Zoro had agreed to accept it in his place. It is not clear what would happen if the pain, which took the form of a giant bubble, had not been transferred to Zoro."}, {"type": "paragraph", "text": "Kuma fights in a style reminiscent of sumo-wrestling. He crouches low in a wide stance, even using the signature stomp, and attacks with open-palm strikes, using his special paws to launch powerful air bullets. Much in keeping with the sumo inspiration, Kuma spends almost all of his time with his feet planted, refusing to give his ground. He has also demonstrated the ability to block all physical attacks, even sword attacks, by pushing them away with these hands."}, {"type": "paragraph", "text": "Kuma's abilities can also be used to create massively destructive attacks. This is displayed by one of his signature moves, \"Ursus Shock\", essentially a bomb made of highly compressed air created by pushing the air between his hands. This destructive power is enough to severely cripple a massive giant, in this case Oars Jr."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e4/Nikyu_Nikyu_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20190411220015", "caption": "Kuma reveals his Devil Fruit's ability."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ad/Kuma_Using_Pad_Ho.png/revision/latest/scale-to-width-down/210?cb=20140721190638", "caption": "A simple thrust of air results in a long line of heavy damage."}]}, {"title": "Pacifista Modifications", "level": 3, "content": [{"type": "paragraph", "text": "Kuma is now a cyborg modified by Vegapunk. He is however, very different from other cyborgs, and displays strength and agility that are on a different scale."}, {"type": "paragraph", "text": "As with the other Pacifista models, Kuma has a built-in electronic recognition device within his pupils, which enables him to accurately identify certain individuals (presumably anybody that is listed within the World Government's bounty system) and their bounty count from across a distance of several dozen meters."}, {"type": "paragraph", "text": "Kuma's massive build along with cybernetic enhancements grants him tremendous durability comparable if not superior to other Pacifista; the average Pacifista model is capable of withstanding a combination assault from the pre-timeskip Monster Trio. His body is able to withstand most attacks, including Sanji's kicks and even Zoro's \"Shishi Sonson\", a technique that was able to cut through steel. It only left a scratch on Kuma despite it being a surprise attack."}, {"type": "paragraph", "text": "Even after two years of accumulated damage, lack of repair, and lack of sustenance intake, Kuma was still operational. While the modifications gave Kuma great strength, their full completion over a long time period apparently robbed Kuma of his free will."}, {"type": "paragraph", "text": "Due to technically having his mind removed, Kuma does not feel any pain. While being enslaved by the World Nobles, Kuma was constantly and brutally abused by the World Nobles without feeling any discomfort, not even reacting as Rosward struck his head hard with a hammer and stabbed him with a sword. He has multiple swords stabbed inside his body and continues to function without succumbing to the accumulated damage."}, {"type": "paragraph", "text": "As a Pacifista, Kuma has the ability to shoot laser beams, which not only causes massive explosions upon detonation, but can also melt steel. This laser is apparently a replication of Kizaru's Pika Pika no Mi powers and for Kuma, this launcher is only installed in his mouth. In the other Pacifista, the launcher is installed on their palms as well. Kuma has his paw pads instead of the laser holes on his hands; it is this aspect, along with the bible that only he holds, even after losing his free will, that distinguish him from the other Pacifista, and makes him superior to them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/77/Kuma%27s_Cybernetic_Enhancements.png/revision/latest/scale-to-width-down/210?cb=20160127232838", "caption": "Kuma's cybernetic enhancements on his shoulder, after being cut by Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Kuma_Fires_A_Laser_Beam.png/revision/latest/scale-to-width-down/210?cb=20130106060135", "caption": "Kuma firing a laser beam from his mouth."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early Life", "level": 4, "content": [{"type": "paragraph", "text": "Not much is known about Kuma's past in great detail. What is known is that he was once the king of the Sorbet Kingdom. and according to Perona, Kuma was once a violent, tyrannical pirate, who was said to be \"brutal beyond measure\". Because of this, he was known as \"Tyrant\" Kuma. Also at some point in his life, he became a member of the Revolutionary Army."}], "images": []}, {"title": "Revolutionary Army", "level": 4, "content": [{"type": "paragraph", "text": "Twelve years before the current storyline, he was on a crew with Monkey D. Dragon and Emporio Ivankov. He witnessed the immolation of the Gray Terminal, assisting the survivors on board the revolutionaries' ship."}, {"type": "paragraph", "text": "While this crew was a precursor to the Revolutionaries, it is unknown if Kuma remained with Dragon after he began his campaign against the World Government. In this time, though, he learned of Dragon's son, Monkey D. Luffy. Considering that not even Ivankov knew of Luffy and Dragon's relationship, this means that Kuma was either incredibly close to Dragon, or that he had been informed of their relationship by Sengoku, Garp, or Akainu after he became a Shichibukai, since they were the only ones in the Marines to know that Dragon is Luffy's father."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Revolutionary_Army.png/revision/latest/scale-to-width-down/210?cb=20160620220530", "caption": "Kuma as a member of the Revolutionary Army."}]}, {"title": "Shichibukai and the Pacifista Project", "level": 4, "content": [{"type": "paragraph", "text": "He later became a Shichibukai and allowed Dr. Vegapunk to modify him into the cyborg weapon \"Pacifista\". He apparently struck some sort of deal with the World Government to become a guinea pig for this human weapon project, despite his hatred towards them. As of yet, there has been no further details revealed regarding this clandestine agreement, the processes involved in the creation of the Pacifista, or the relationship between Kuma and the mysterious Vegapunk. His modification into a cyborg was a slow process, with each of his body parts being modified one by one, with his head being preserved for the last."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/Bartholomew_Kuma_Undergoing_Pacifista_Modifications.png/revision/latest/scale-to-width-down/210?cb=20130623094322", "caption": "Kuma undergoing the modifications of the Pacifista project."}]}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "Kuma was introduced during the meeting at Mary Geoise. Like Donquixote Doflamingo and later on Dracule Mihawk, he was present at the government summit at Mary Geoise, following Crocodile's defeat in Alabasta. He only spoke briefly. Just then, they were interrupted by another person, a man that was identified by one of the Marines as Laffitte, a former policeman who was renowned for his violent ways and exiled from the West Blue. Kuma listened as Laffitte stated that he wished to put forward his captain's name for nomination of Shichibukai."}], "images": []}, {"title": "Thriller Bark Arc", "level": 3, "content": [{"type": "paragraph", "text": "With orders from the World Government to notify Gecko Moria of Crocodile's replacement, Kuma came to Thriller Bark. Arriving there, he asked some of Perona's zombie minions, who were loading treasure onto the Thousand Sunny, where their master would be. However, he was met with some resistance and was forced to deal with them. His actions were not unnoticed as the zombies reported his actions to the person they were to ordered to follow, Perona. Perona recognized Kuma and shook in fear at the sight of him."}, {"type": "paragraph", "text": "Despite Kuma's reputation, however, Perona got annoyed with him and attempted to engage the Shichibukai for his shadow. However, after asking her where she would like to go and removing a glove, he made her vanish by sending her flying to Kuraigana Island."}, {"type": "paragraph", "text": "The zombies seeing this tried to attack him but were frightened off by his mere presence. Kuma then spotted Nami and asked her if Luffy had an older brother. After receiving her answer, he then somehow teleported away and continued his search for Moria."}, {"type": "paragraph", "text": "Kuma then found Moria in the dance hall in the Mast Mansion of Thriller Bark. After some formalities, he told Moria of Crocodile's replacement, Marshall D. Teach. Though the gap in the Shichibukai ranks had been filled up, he told Moria that he felt somewhat uneasy of the situation."}, {"type": "paragraph", "text": "Kuma then told Moria that since the Straw Hat Pirates were most likely to head toward Moria's vicinity, he should do something about them. He explained this to Moria since the World Government had grown greatly alert of the pirates since the assault on Enies Lobby. When Kuma told Moria that the World Government was afraid that the latter would be defeated, Moria becomes enraged. Though he was not given a specific order, Kuma offered to help Moria in dealing with the Straw Hats. Moria angrily declined Kuma's help and told him to instead sit back and watch as he himself defeated the Straw Hats. However, despite Moria's boasting, Kuma witnessed Moria get defeated by Luffy. After the battle, Kuma then reported this to the World Government."}, {"type": "paragraph", "text": "Fearful that the rumors of Moria's defeat would cause another global uproar like with Crocodile, they ordered Kuma to kill all witnesses on Thriller Bark, including the Straw Hat Pirates. Accepting the order, he launched an attack on some of the members of the Thriller Bark Victim's Association before shifting his attention to Zoro. Kuma dueled Zoro and used his Devil Fruit ability to take down Franky and Sanji got hurt attacking him. Knowing how unfair it was to eliminate them after they fought Moria, he created a bomb from a ball of air."}, {"type": "paragraph", "text": "He then gave them an ultimatum: let him take Luffy, and he would let them live. When they refused his offer, Kuma launched and set off the bomb, engulfing a portion of the island (in the anime, the entire island was affected)."}, {"type": "paragraph", "text": "Though this did not succeed in killing the Straw Hats, it knocked all of them out. Just when he was about to take an unconscious Luffy, Zoro, in a desperate move, struck him with a Shishi Sonson (Lion's song) in an effort to stop him. However, he was only able to damage him. The wound on Kuma's shoulder revealed that he is a cyborg like Franky, but he is different from Franky."}, {"type": "paragraph", "text": "Kuma was an incomplete human weapon created by the World Government and Dr. Vegapunk, known as a Pacifista. Zoro offered to trade his life for Luffy's. Kuma agreed and at that moment, Sanji decided to give his life up. Zoro promptly knocked him out, feeling it necessary to sacrifice his own life rather than Sanji's. Kuma stated that he would not harm Luffy, as his \"honor would be at stake\"."}, {"type": "paragraph", "text": "In exchange for Zoro experiencing the pain Luffy endured throughout his fight against Moria, Kuma would leave. Kuma proceeded to extract Luffy's pain and directed it at Zoro, which almost killed him. Kuma then teleported to the entrance to the ship. He was next seen musing about Dragon having a good son with a loyal crew."}, {"type": "paragraph", "text": "Later, he was seen in the company of Garp and Sengoku, being scolded by the latter for his inability to capture the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e9/Perona_Encounters_Kuma.png/revision/latest/scale-to-width-down/210?cb=20140921211053", "caption": "Kuma arrives at Thriller Bark."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Kuma_and_Moria_Meet.png/revision/latest/scale-to-width-down/210?cb=20140916083309", "caption": "Kuma speaks with Gecko Moria"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8b/Kuma_Destroys_Thriller_Bark.png/revision/latest/scale-to-width-down/210?cb=20130507034947", "caption": "Kuma destroys Thriller Bark."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Kuma_Shows_Zoro_Mercy.png/revision/latest/scale-to-width-down/210?cb=20130507035212", "caption": "Kuma offering Zoro the chance to save his captain."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Having exhausted themselves by defeating a Pacifista on the Sabaody Archipelago, the Straw Hats were immediately confronted by Kizaru and Sentomaru, as well as another Pacifista, PX-1. However, the battle was interrupted by the real Bartholomew Kuma, who Zoro recognized as the genuine article. He was surprised to find Zoro still alive, who sardonically replied that it was due to Kuma's mercy. Seemingly impressed, Kuma made Zoro vanish to the same place that he sent Perona using the same move that he used on her at Thriller Bark."}, {"type": "paragraph", "text": "Sentomaru revealed that Kuma has the ability to make people fly through the sky to far away places and anyone that gets touched by Kuma's paws would fly through three days and three nights and the destination would only be known by Kuma. An outraged Sanji got ready to battle Kuma, while PX-1 tried to attack Usopp from behind, using a beam attack. Kuma then used his Devil Fruit ability to send PX-1 away, which enraged Sentomaru."}, {"type": "paragraph", "text": "As Sanji, Usopp, and Brook tried to escape, Kuma descended on them, prepared to attack. Brook sacrificed himself and made a joke as he disappeared. Sanji told Usopp to run and landed a kick on Kuma, only to be deflected into a pile of rubble. Usopp attempted to hold Kuma back, only to be sent away as well. An enraged Sanji ran towards Kuma, but was also sent away as well. Kuma then approached Rayleigh and whispered to him quietly, revealing himself to be an officer of the Revolutionary Army, and he wished to help Luffy and his crew escape."}, {"type": "paragraph", "text": "Rayleigh questioned Kuma's motives, who responded by saying that he could choose whether to believe him or not. When Kizaru asked what Kuma said to Rayleigh, Kuma simply replied with that he would not answer Kizaru's questions. Luffy activated Second Gear but Kuma teleported to where Franky and Nami were. Franky tried to attack Kuma by using \"Strong Right\" but had no effect. An enraged Luffy tried a \"Jet Pistol\", only to be blocked by Kuma's paws. Kuma descended on Franky and also sent him away using his Nikyu Nikyu no Mi. He then approached Nami and sent her away as well."}, {"type": "paragraph", "text": "With only Robin and a Monster Chopper left, Luffy desperately lunged at Kuma. However, Kuma simply teleported again to Robin and Chopper. Luffy started begging Kuma to stop sending his friends away but Kuma still sent Chopper away. Robin attempted to run, but she also gets sent away by Kuma. Luffy, filled with despair and rage, fell to the ground, angry and cried that he could not even save a single friend. Kuma simply responded by saying that he would not be seeing Luffy again and ultimately sent Luffy flying, making the loss of the crew complete."}, {"type": "paragraph", "text": "Before returning to Marineford, he visited Rayleigh to tell him something and adding that he did not have much time left. This was the last-known action made freely by Kuma before Dr. Vegapunk completed the Pacifista modifications."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Kuma_Attacking_Pacifista.png/revision/latest/scale-to-width-down/220?cb=20131030092229", "caption": "Kuma intercepting PX-1."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3d/Kuma_and_Rayleigh.png/revision/latest/scale-to-width-down/210?cb=20131029041557", "caption": "Kuma secretly speaks with Rayleigh."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Kuma_Defeats_the_Straw_Hats.png/revision/latest/scale-to-width-down/210?cb=20190923144050", "caption": "Kuma stands triumphed over the Straw Hat Pirates."}]}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kuma answered the call for the Shichibukai to battle the Whitebeard Pirates and was later shown dining with the other Shichibukai, except for Jinbe and Boa Hancock."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He then appeared at Marineford alongside Dracule Mihawk, Donquixote Doflamingo, Gecko Moria, and Boa Hancock, ready for the battle ahead. When Fleet Admiral Sengoku announced the truth about Ace's heritage, Kuma showed no response to the situation, calmly waiting for the Whitebeard Pirates to appear."}, {"type": "paragraph", "text": "When Little Oars Jr. arrived and began leaving destruction in his wake, Kuma hit him with an Ursus Shock, an attack that badly wounded Little Oars Jr. and swept both Marines and pirates alike aside. Kuma took on a solemn appearance after seeing Luffy on the battlefield. Kuma went on the offensive and fired off a beam at Ivankov, who was furious at Kuma's actions. While Luffy recognized Kuma, he did not react to seeing Ivankov up close. Doflamingo chimed in after Ivankov's attempted to talk to him, informing him Kuma was dead. When Sengoku revealed that Dragon is Luffy's father, Kuma was the only Shichibukai not to voice his thoughts."}, {"type": "paragraph", "text": "Doflamingo spoke on Kuma's behalf, saying that while Ivankov and Luffy seemed to know Kuma, the man standing before them was not Kuma, as Vegapunk had finished his modifications on the former Bartholomew Kuma. Doflamingo then explained to Ivankov the process Kuma volunteered to undergo, as his body was converted into a \"Pacifista\", with bits and pieces of him being modified at a time. While Doflamingo admitted that he did not know what kind of deal Kuma and the World Government made, he went on to say that he had retained his personality a few days ago, but became a walking corpse with no human memory, following the World Government's every command: PX-0."}, {"type": "paragraph", "text": "Kuma then fired a laser blast from his mouth, sending Luffy and Ivankov flying aside. Kuma suddenly appeared in the middle of Ivankov's Newkama army and launched a pressure cannon through a line of okamas. Refusing to take any more of Kuma's actions, Ivankov spun his head around with Face Spectrum to make a mirage of dozens of faces and launched Death Wink from all of them with Galaxy Wink. Ivankov then kicked Kuma and sent him flying, shouting that he would not let Kuma get away with hurting his followers."}, {"type": "paragraph", "text": "Kuma later went to the plaza with the other Shichibukai when Sengoku began the final stages of his plan. After the arrival of Shanks, Kuma was seen standing down along with everyone else."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Kuma_Attacks_Little_Oars_Jr.png/revision/latest/scale-to-width-down/210?cb=20100831061924", "caption": "Kuma about to attack Little Oars Jr."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/64/Kuma_vs._Newkamas_at_Marineford.png/revision/latest/scale-to-width-down/210?cb=20130106135103", "caption": "Kuma attacking Ivankov's allies."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kuma appeared again at the Sabaody Archipelago in front of the Rosy Life Riders, holding his trademark bible. Shakky was not afraid of him, stating that he was an ally. Kuma then joined them in protecting the Thousand Sunny."}, {"type": "paragraph", "text": "One year after the separation of the Straw Hat crew, the Marines tried to destroy the ship but Kuma, as well as Hatchan and Duval, fought against them. Kuma continued protecting the Thousand Sunny after Duval and Hatchan retired, having received too many injuries in that battle."}, {"type": "paragraph", "text": "His reason to do so remains unclear, but Kuma had Vegapunk input a special mission into his body before losing his personality. The mission was to protect the ship, even if it costs him his life, until a Straw Hat member returns."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/19/Kuma_Returns_to_Sabaody_Archipelago_After_War.png/revision/latest/scale-to-width-down/210?cb=20130418212307", "caption": "Kuma returns to Sabaody Archipelago."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Franky returned to the Thousand Sunny, he found Kuma heavily damaged near the ship. Upon seeing Franky, Kuma slowly walked away, having completed his mission."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8f/Franky_Returns_to_the_Thousand_Sunny.png/revision/latest/scale-to-width-down/210?cb=20130507153027", "caption": "Kuma being relieved of his mission of protecting the Thousand Sunny."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime later, Kuma became a slave-to-rent at Mary Geoise as punishment for aiding Luffy.Rosward rented him sometime prior to the Levely."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bartholomew Kuma vs. Perona and Zombies", "elements": []}, {"text": "Bartholomew Kuma vs. Straw Hat Pirates and Rolling Pirates", "elements": []}, {"text": "Bartholomew Kuma vs. Roronoa Zoro", "elements": []}, {"text": "Bartholomew Kuma vs. PX-1 vs. Straw Hat Pirates", "elements": []}, {"text": "Shichibukai and the Marines vs. Whitebeard Pirates and their allies", "elements": [{"text": "Bartholomew Kuma (as PX-0), Donquixote Doflamingo, and Gecko Moria vs. Little Oars Jr.", "elements": []}, {"text": "Bartholomew Kuma (as PX-0) vs. Emporio Ivankov", "elements": []}]}, {"text": "Bartholomew Kuma, Hatchan, and Rosy Life Riders vs. every attacker of the Thousand Sunny", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bartholomew Kuma vs. Sabo", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In an interview about Strong World, Oda revealed that he originally intended the steering wheel in the head concept of Shiki to be used on Kuma. He turned down the idea and decided later to use it for Shiki."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Early_Kuma.png/revision/latest/scale-to-width-down/210?cb=20150404102504", "caption": "Kuma's concept in One Piece Green."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Appearance", "level": 3, "content": [{"type": "paragraph", "text": "In the manga also, Kuma was intended to have a different color scheme than the one he is presented with in the anime. This unfortunately was because no full colored version of Kuma was present when the first episode of him appearing was made. The anime had Kuma with a black jacket while Oda's intentions were an orange one. The manga however later changed this color scheme to resemble that of the anime."}, {"type": "paragraph", "text": "In the manga and One Piece Unlimited Cruise, Kuma's paw pads are black, like a bear's. However, in the anime, the paw pads are pink, like a cat's (which may play off a concept in Robin's head of Kuma's Devil Fruit reminding her of a cat's pads)."}], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the meeting in Mary Geoise in the manga, Kuma had a few lines, but in the anime, he had none."}], "images": []}, {"title": "Post-War Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the manga, during the flashback where Dragon saves the people of the Grey Terminal from a fire, Kuma's clothing underneath the common Revolutionary Army cloak was not shown. In the anime, it is revealed that Kuma had the same clothing then that he does now."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the flashback of Sabo's past, the anime shows Kuma being present in the training of Sabo where Kuma deflected Sabo after he tried to attack him."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Kuma” means \"bear\" in Japanese, which represents his character's animal theme.", "elements": []}, {"text": "In the TV version of the FUNimation dub of the anime, when Kuma is introduced, the word \"BIBLE\" is edited out of the book he is carrying. In the uncut DVDs, the word \"BIBLE\" is retained.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "As a prominent character, he has appeared in the fan merchandise. Bartholomew Kuma has been featured with the Shichibukai in the series of One Piece Shichibukai Cellphone Strap and twice in the One Piece Super Deformed Figures. Kuma has also been released in the P.O.P. Portrait of Pirates series. He was recently released in the One Piece DX Figure models. He was released in the One Piece World Collectable Figure series in July 2010 along with the rest of the Shichibukai, and will be re-released in the same figure series (new ones are exactly the same but for a change in the color pattern of Doflamingo)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f0/One_Piece_POP_Bartholomew_Kuma.png/revision/latest/scale-to-width-down/210?cb=20150311020737", "caption": "One Piece POP Bartholomew Kuma."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kuma's bible's design had changed over its appearances and media.", "elements": [{"text": "On the color spread and the digitally colored manga, the bible Kuma is carrying is gold colored, with an orange title, and its back has the same pattern as Kuma's jacket. In the anime and games, the book is purple and its back is not clearly seen.", "elements": []}, {"text": "On its first appearance during the Jaya Arc, the cover had a yellow figure over orange rays of light. In the anime, the figure is white and floating with yellow rays of light over a bluish-green background.", "elements": []}, {"text": "In the following chapter, the back was shown to be blank and the cover was clearly seen with the figure being that of a woman and the background features a skyline.", "elements": []}, {"text": "Starting with the end of the Thriller Bark Arc, the cover had the clearer image. In the colored version, the back cover is orange as the original coloring of Kuma's jacket. In the anime, this cover wasn't shown until the end of the Sabaody Archipelago Arc. However, the figure is white and the background is yellow.", "elements": []}]}, {"text": "His surname most likely comes from the historical pirate Bartholomew \"Black Bart\" Roberts.", "elements": [{"text": "Kuma was revealed to have been effectively dead during the Battle of Marineford, which concluded the Golden Age of Pirates and began the \"New Age\". Coincidentally, it was Bartholomew Roberts whose death ended the real world's \"Great Pirate Age\".", "elements": []}, {"text": "Kuma may be named after Bartholomew the Apostle, one of the twelve apostles of Jesus.", "elements": []}]}, {"text": "Kuma is the only known person to be affiliated with pirates, the Revolutionary Army, the World Government, and the Shichibukai.", "elements": []}, {"text": "Following the dismissal of Gecko Moria, Kuma is now both the oldest and the tallest of the still active Shichibukai (based on given information).", "elements": []}, {"text": "In the 5th fan poll, Kuma ranked 85th, making him the least popular of the Shichibukai both current and previous.", "elements": []}, {"text": "He is the first cyborg to appear in the series, though he was not revealed as one until the Thriller Bark Arc.", "elements": []}, {"text": "In One Piece: Pirate Warriors 3, Kuma's Bible is referred as Book of Bears and appears as a rare coin. The Book of Bears coin can be obtained by getting Kuma's Crew Level to MAX (Level 5). It is one of the 4 rare coins needed to break Kuma's level limit.", "elements": []}, {"text": "Kuma is one of the few cases which color scheme was displayed incorrectly in the anime and remained that way even after the official color scheme depicted by Oda was published. In fact, Oda replaced the original color scheme later with one similar in the anime.", "elements": []}, {"text": "Kuma's depiction as a child has similarities with Ninomiya Sontoku, a famous philosopher of the 19th century. Many statues portray him holding a book while he walks with a heavy load on his back.", "elements": []}, {"text": "Kuma's favorite foods are honey and salmon.", "elements": []}]}], "images": []}]}