{"sections": [{"title": "Pell", "level": 1, "content": [{"type": "paragraph", "text": "Pell the Falcon is one of the two head guards in the Alabasta kingdom that serve under Igaram, the other being Chaka. He is said to be the strongest fighter in all of Alabasta."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pell is a tall man with a purple line under each eye that runs down the sides of his face, making him resemble a falcon, his Devil Fruit's animal. Underneath these robes, he is fairly muscular, and has two large, star-shaped scars on his torso."}, {"type": "paragraph", "text": "He wears a long white robe with brown star-like motifs on it and a matching hat. He has a big orange necklace around his neck, and also sports striped socks under a pair of normal shoes. He carries his sword on his right hip, so it might be assumed that he is left-handed or even ambidextrous."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pell has a great sense of honor and respect, and protects the royal family. He was willing to protect Vivi from Miss All-Sunday, regardless of how powerful she was. He has also shown strong loyalty to Alabasta, as he selflessly sacrificed himself to save the country from the exploding time bomb Crocodile had set."}, {"type": "paragraph", "text": "Pell appears to have a soft side, gently conversing with Vivi as a child when she asked about his role as a guardian, and using his Devil Fruit abilities to give her a ride. It seems that Pell is very fond of Vivi, as he is shown with a happy smile while flying with Vivi in his flashback before sacrificing himself to save Alubarna from the bomb."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Pell is renowned as Alabasta's strongest warrior. With the aid of his Devil Fruit powers, he dispatched a group of Baroque Works agents in mere seconds. He is also extremely resilient, as he was able to stand back up shortly after having his back broken or at least heavily injured by Nico Robin, as well as somehow surviving an explosion that could have wiped out a kingdom. Carrying the bomb is also a demonstration of immense physical strength, as, even in his falcon form, the bomb was both completely made of metal and at least twice Pell's size."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Pell ate the Tori Tori no Mi, Model: Falcon, a Zoan-type Devil Fruit that allows him to transform into a falcon, which has earned him the nickname \"Pell the Falcon\". The fruit is, apparently, one of five that have been discovered that give the user the ability of flight. Since the fruit is a Zoan type, he has three types of transformations meaning that he can turn into a falcon and a man/falcon hybrid, as well as maintain his natural human form."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Tori_Tori_no_Mi_Model_Falcon_Infobox.png/revision/latest/scale-to-width-down/190?cb=20160928131012", "caption": "Pell's falcon hybrid form."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries around an exotic looking sword with a handle and hilt resembling a plane, and has been shown to be adept at using it. He also carries a pair of gatling guns which he uses in conjunction with his Devil Fruit, causing him to resemble a fighter plane."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Not much was shown about Pell's past. However, he was often seen having fun with Vivi, even though he was strict. This is shown when Vivi tried to make fireworks with gunpowder to celebrate the anniversary of Pell's enlistment. Pell, seeing that what she did was dangerous, slapped and yelled at Vivi out of concern before breaking down and exclaiming that he would not know what to do if anything happened to her. This showed that Pell was strict with Vivi because he cared for her greatly."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Pell, together with Chaka, came to the incident where pirates were attacking civilians. Sir Crocodile came and helped the people by defeating the pirates before the two reached their destination. When the rebellion began to move, Pell and Chaka wanted to fight back but King Nefertari Cobra refused. Later, they found Karoo bringing Vivi's letter, and learned of their enemy's identity from the information. King Cobra planned to attack Crocodile but was rejected by Pell's reasoning that Rainbase is far and that the opponent could see the army and leave. He was later commanded by the king to scout out the enemy at Rainbase."}, {"type": "paragraph", "text": "When he found Vivi, he shot the Millions who were after her in his Devil Fruit form and took her to a safe place on a nearby rooftop. He proceeded to finish off the Baroque Works agents. At this moment, Miss All-Sunday, aka Nico Robin, appeared on the same rooftop as Vivi. Pell discussed with Miss All Sunday about the fate of Igaram (whom Robin had pretended to have killed, although Pell believed his death to be true). Miss All Sunday then enraged Pell by pretending to pierce through Vivi's body with her hand. However, it was the use of her Devil Fruit power (making a hand appear on the back of Vivi's body while her actual hand only punched her). A furious Pell attacked her, but he was easily defeated by her Devil Fruit ability."}, {"type": "paragraph", "text": "Later, he regained consciousness and caught up with Miss All Sunday after she pulled Monkey D. Luffy out of Crocodile's sand-pit. He attempted to engage in a fight but Miss All Sunday pointed out that he was already too injured to stand any chance. She then let him know that Vivi was perfectly safe with the Straw Hat crew and that he should instead help save Luffy, who had protected Princess Vivi."}, {"type": "paragraph", "text": "During the final battle, he reappeared in Alubarna with Luffy on his back. While Luffy fought Crocodile, he learned that Crocodile had set up a massive bomb to blow up the capital city Alubarna. Princess Nefertari Vivi and the Straw Hat Pirates managed to find the bomb, but they were unable to disarm it in time. Pell seemingly sacrificed himself by carrying the bomb high into the sky where it exploded, leaving the city unscathed."}, {"type": "paragraph", "text": "At first, he was thought to be dead. However, a doctor from a remote hospital out in the desert called to a person who left his hat, which resembles Pell's."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Pell_Saves_Alubarna.png/revision/latest/scale-to-width-down/250?cb=20121114003526", "caption": "Pell saving Alubarna from the bomb."}]}, {"title": "Episode of Alabasta: The Desert Princess and the Pirates", "level": 4, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story. In the credits of One Piece The Movie 8, it shows Vivi hugging Pell, happy that he survived the explosion."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Gedatsu's Accidental Blue-Sea Life", "level": 3, "content": [{"type": "paragraph", "text": "After Goro and ex-Priest Gedatsu opened up a tunnel from Alabasta to Ukkari Hot-Spring Island, Pell and others visited the baths."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Ruluka Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Pell also appeared in the end of the filler Ruluka Island Arc. Igaram picked up the last Rainbow Mist book, and Pell was seen in the background talking to Vivi."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby", "level": 4, "content": [{"type": "paragraph", "text": "After the new bounties for the Straw Hat Pirates were revealed, Pell was concerned as to why Nico Robin, the former vice-president of Baroque Works (and the one who defeated him), was a member of the Straw Hats crew."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Weeks after the events of the Whitebeard War, Pell informed King Cobra that he and Chaka drove a group of pirates out of the country."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Pell and Chaka were fitted for new clothes to wear to the upcoming Levely."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/RoyalPalace2YL.png/revision/latest/scale-to-width-down/180?cb=20130806233429", "caption": "Pell being fitted by Maidy for the Levely."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Pell accompanied the Nefertari Family to Mary Geoise alongside Chaka, Karoo, and Igaram. Pell told Igaram that he worried too much about Vivi."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the way to the Levely, Pell received the news of Luffy's exploits at Totto Land."}, {"type": "paragraph", "text": "The Alabasta Kingdom participants later arrived at Mary Geoise. After Mjosgard stopped Charlos from enslaving Shirahoshi, Pell apologized to Vivi for not being with her during the incident. When Vivi asked Pell about her father, Pell informed her that Cobra receieved a letter from Fujitora and was having a meeting with the admiral and Riku Doldo III."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Pell vs. Miss All-Sunday (Nico Robin)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece Grand Battle 3", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the 6th Japanese fan poll, Pell is ranked the 57st most popular character in One Piece.", "elements": []}, {"text": "He represents the falcon, one of the two guardian spirits of Alabasta, along with Chaka the Jackal. Both of them are based on the Egyptian deities Horus and Anubis respectively, with their hybrid forms displaying this even more so.", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "He was shown alive and well at the end of the Alabasta arc when he approaches his own grave in disturbed astonishment only in the anime."}], "images": []}]}