{"sections": [{"title": "McGuy", "level": 1, "content": [{"type": "paragraph", "text": "\"Thunder Lord\" McGuy is an infamous New World pirate who allied with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "McGuy has a long face with a big nose and prominent chin, wavy blonde hair reaching to his waist, and a black mustache shaped like a lightning bolt. He sports a blue shirt with loose sleeves and ruffled edges under a black vest. Due to his legs not being visible enough in the manga, in the anime he was given dark bermuda shorts and an orange sash decorated by a silver colored ornament with a red jewel in it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/87/McGuy_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20190420141335", "caption": "McGuy's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Though little can be said regarding McGuy's personality in the manga, he is shown having huge respect towards Whitebeard. In the anime, he was shown to be perceptive enough to see through Sengoku's tactic to lure the pirates in for the Pacifista to attack. McGuy is also shown to have a sense of honor, stating to Doberman that it was a privilege to fight him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "McGuy has managed to make himself an infamous reputation in the New World, becoming a subordinate of Whitebeard. Also, he was very observant, as he managed to understand why Whitebeard ordered his subordinates to split up in order to avoid being trapped by the Pacifista. He also avoided injuries from the war."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "McGuy is a swordsman, although his exact level of ability remains unknown, however it is presumed quite high. He was somehow able to channel electricity through his blade, increasing the damage done. Whether this ability stems from a Devil Fruit, a Dial, Electro or another method is currently unknown. In the anime, his skill as a swordsman was enough for him to fight on equal grounds against Vice Admiral Doberman to stall him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/McGuy%27s_Electric_Sword.png/revision/latest/scale-to-width-down/230?cb=20101023160029", "caption": "McGuy running electricity through his sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "McGuy and his crew were first seen, along with a fleet of 42 other infamous pirate crews under the Whitebeard Pirates, attacking Marineford to save Portgas D. Ace from his execution. When Squard stabbed Whitebeard due to being deceived by Admiral Akainu, McGuy was shocked. He was later seen among the group of New World captains backing up Luffy and Ivankov on Whitebeard's orders."}, {"type": "paragraph", "text": "When the Blackbeard Pirates launched a barrage of bullets and blades at Whitebeard and killing him in the process, McGuy was seen crying. He was seen behind fellow New World ally Doma, showing shock at seeing the Yonko Shanks appearing on the battlefield."}, {"type": "paragraph", "text": "Upon Shanks calling for a ceasefire and the war coming to a close, McGuy and the other pirates left."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, McGuy and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "McGuy vs. Marine Officers", "elements": []}, {"text": "McGuy and other subordinate crews vs. Pacifista", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "McGuy vs. Vice Admiral Doberman", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, McGuy was given an additional scene of fighting against Vice Admiral Doberman when Whitebeard ordered his subordinates to backup Luffy; this extra fight was not shown in the manga."}, {"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, McGuy cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows McGuy alongside the other attendees. Although it can be assumed that McGuy was at the funeral, there is no visual evidence of his attendance in the manga to support this assumption and, as such, his attendance can only be considered non-canon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/McGuy_vs._Doberman.png/revision/latest/scale-to-width-down/230?cb=20130224135405", "caption": "McGuy vs Doberman."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 551 and Episode 460, McGuy makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 172), McGuy's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 563 and Episode 472, McGuy shocked at Squard's attack.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, McGuy attends Whitebeard and Ace's funeral.", "elements": []}]}], "images": []}]}