{"sections": [{"title": "Doma", "level": 1, "content": [{"type": "paragraph", "text": "\"Bohemian Knight\" Doma is an infamous New World pirate who worked for Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Doma is a man with black curly hair and a beard that seems to have lines that extend to his eyes. He wears a large red headband and a necklace with big light-blue square jewels on it. His neck appears to have a scar on the lower right, and he sports a large and long light brown coat with a wide dark red collar and cuffs, closed by a belt. He also wears loose blue pants tucked inside simple boots."}, {"type": "paragraph", "text": "A monkey is seen perched on his shoulder. The monkey is usually seen wrapping its prehensile tail around Doma's arm; it also carries a flintlock pistol that it fires on Doma's behalf during battle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Doma_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20190420141117", "caption": "Doma's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Doma's personality other than that he is very loyal to Whitebeard since he was willing to risk his own life to save Ace from execution. In the anime, he seems to have a certain degree of respect for his enemies, as he told Momonga that it was a privilege to fight him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Doma has managed to make himself an infamous reputation in the New World, becoming a subordinate of Whitebeard."}, {"type": "paragraph", "text": "Doma is a swordsman who employs a dual-sword style and is seen fighting with both swords held in a reverse grip. His exact level of swordsmanship remains unknown, however it is presumed quite high. In the anime, he was capable of fighting on par with Vice Admiral Momonga to stall him. He is also very agile and seems to prefer kicking-style attacks."}, {"type": "paragraph", "text": "The monkey perched on his shoulders appears to be able to wield a gun well, and serves as Doma's \"third hand\" for shooting the gun in battle, since Doma is already carrying two swords with him. He is also strong enough to emerge seemingly unharmed by the end of the war."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Doma_with_monkey.png/revision/latest/scale-to-width-down/210?cb=20101212072246", "caption": "Doma and his monkey fighting."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Doma and his crew surrendered to Ace after he defeated them."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Doma and his crew are first seen along with a fleet of 42 other infamous pirate crews who are subordinate to the Whitebeard Pirates, attacking Marineford to save Portgas D. Ace from his execution. When Whitebeard decided to attack personally, he is seen holding his sword, ready to fight alongside his \"father\"."}, {"type": "paragraph", "text": "He is then shown in combat during the war against the marines. He wields two swords while his pet monkey that clings onto his neck wields a pistol, helping him in combat. He is later seen among the group of New World captains who were backing up Luffy and Ivankov on Whitebeard's orders."}, {"type": "paragraph", "text": "When the Blackbeard Pirates launched a barrage of bullets and blades at Whitebeard that killed him, Doma was seen crying. Upon the arrival of Shanks and his crew, Doma was seen showing shock and unease. When Fleet Admiral Sengoku called the war to a close, he and the rest of Whitebeard's crew left."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew attended Whitebeard's and Ace's funeral on a undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Doma and his crew vs. Portgas D. Ace (in past, unseen)", "elements": []}, {"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Doma vs. Marine Officers", "elements": []}, {"text": "Doma and other subordinate crews vs. Pacifistas", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Doma vs. Vice Admiral Momonga", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Doma was given an additional scene of protecting Luffy from Vice Admiral Momonga when Whitebeard ordered his subordinates to backup Ace's brother. This extra fight was not shown in the manga."}, {"type": "paragraph", "text": "In the manga, Doma's monkey has thicker, fluffy fur; while in the anime, it has short, sleek fur."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b1/Momonga_Clashes_with_Doma.png/revision/latest/scale-to-width-down/210?cb=20101214143104", "caption": "Doma blocks Momonga from attacking Luffy."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Doma's nickname, \"Bohemian Knight\" refers to the real world kingdom of Bohemia, a kingdom that would eventually become the modern day Czech Republic.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 551 and Episode 460, Doma is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 109), Doma's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 567 and Episode 476, Doma's monkey is seen wielding a gun.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 552 and Episode 461, Doma and his crew are stated to have surrendered to Ace.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bohemianism – Wikipedia article about Bohemianism.", "elements": []}]}], "images": []}]}