{"sections": [{"title": "Decalvan Brothers", "level": 1, "content": [{"type": "paragraph", "text": "The Decalvan Brothers are two infamous New World pirates who allied with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Decalvan Brothers appear to be twins (since they share the same birthday), and both wear overalls. Both have wide faces (though one of them is wider than the other) and flowing black hair. The one with the wider face has sharper teeth. Each brother opens one of their eyes which is large and black around the rim, and closes the other which has a scar over it; which eye they open and close are opposite to one another."}, {"type": "paragraph", "text": "They both wear a brown and yellow pirate tricorn hat with polka dots bandanna underneath it (one red, and one blue). The hat bears their Jolly Roger: two skulls and a cross-bone, with a wavy design over it. They both wear yellow long gloves with razor-sharp nails at the end on both hands."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Decalvan_Brothers_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20190420141552", "caption": "Decalvan Brothers concept art from the anime."}]}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about the Decalvan Brother's personality, other than that they were willing to fight in order to rescue Ace from execution."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The Decalvan Brothers have managed to make themselves an infamous reputation in the New World, becoming subordinates of the Whitebeard Pirates. After Squard, they were Whitebeard's choice in leading the other subordinate crews to attack Marineford."}, {"type": "paragraph", "text": "In the anime, they were able to fight on par with Vice Admiral Dalmatian to stall him."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "They wear gloves with razor-sharp nails at the end, which are most likely used in battle, similar to Sham and Buchi, the Nyaban Brothers of the Black Cat Pirates, albeit much stronger."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e4/Decalvan_Brothers_Anime_Infobox.png/revision/latest/scale-to-width-down/230?cb=20160130173149", "caption": "Decalvan brothers' claws."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Decalvan Brothers and their crew are first seen, along with a fleet of 42 other infamous pirate crews subordinate to the Whitebeard Pirates, attacking Marineford to save Portgas D. Ace from his execution. After failing to reach Squard, Whitebeard contacted the Decalvan Brothers and gave them, along with certain other captains, the command of all the New World pirates in retaliation to Ace's early execution time."}, {"type": "paragraph", "text": "After Whitebeard was stabbed by Squard, they were seen commenting on how ashamed he must be feeling. They were later seen among the group of New World captains who were backing up Luffy and Ivankov on Whitebeard's orders. In the anime, the brothers dueled Vice Admiral Dalmatian to a stalemate."}, {"type": "paragraph", "text": "When the Blackbeard Pirates launched a barrage of bullets and blades at Whitebeard, killing him in the process, the Decalvan Brothers were seen crying. Upon the arrival of Shanks and Sengoku calling the war coming to a close, they and the rest of Whitebeards crew left."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, the Decalvan Brothers and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Under unknown circumstances, the Decalvan Brothers encountered Edward Weevil and got into an argument. However, this small argument resulted in their defeat at the hands of Weevil. The news of their defeat was seen on Kizaru's desk."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Decalvan Brothers vs. Marine Officers", "elements": []}, {"text": "Decalvan Brothers and other subordinate crews vs. Pacifistas", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Decalvan Brothers vs. Portgas D. Ace and Thatch", "elements": []}, {"text": "Decalvan Brothers vs. Vice Admiral Dalmatian", "elements": []}, {"text": "Decalvan Brothers vs. Edward Weevil (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, an additional flashback scene was shown in which the Decalvan Brothers fought against Thatch and were beginning to overpower him before Ace joined the fight. The outcome remains unknown, but it is very likely that the brothers were overpowered by the two commanders, since it was stated that the bounty of Portgas D. Ace rose again after the battle."}, {"type": "paragraph", "text": "In the manga, they were always standing together, with one brother partly covering the other one, resembling conjoined twins. In the anime, there were some scenes were they stood further away from each other."}, {"type": "paragraph", "text": "Furthermore, they were given an additional scene of fighting against Vice Admiral Dalmatian when Whitebeard ordered his subordinates to backup Luffy. This was not shown in the manga."}, {"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, the Decalvan Brothers cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows the Decalvan Brothers alongside the other attendees. Although it can be assumed that the Decalvan Brothers were at the funeral, there is no visual evidence of their attendance in the manga to support this assumption and, as such, their attendance can only be considered non-canon."}, {"type": "paragraph", "text": "In the anime, one of the brother's lower half of the face can be identified among the news reports of those defeated by Edward Weevil, alongside the reports of Elmy, Ramba, Whitey Bay, Bizarre, A.O, and Palms."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/13/Dalmatian_vs_Decalvan_Brother.png/revision/latest/scale-to-width-down/220?cb=20121207002901", "caption": "Decalvan Brothers vs. Dalmatian."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 551 and Episode 450, The Decalvan Brothers are introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 107), The Decalvan Brothers' birthday are given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 559 and Episode 460, The Decalvan Brothers are introduced.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 559, The Decalvan Brothers are given control of all the New World pirates in place of Squard.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 58 Chapter 564, The Decalvan Brothers comment on how much ashamed Squard must feel.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, The Decalvan Brothers attend Whitebeard and Ace's funeral.", "elements": []}, {"text": "↑  One Piece Anime — Episode 751, The DeCalvan Brothers' news report on Kizaru's desk.", "elements": []}, {"text": "↑  One Piece Anime — Episode 461.", "elements": []}]}], "images": []}]}