{"sections": [{"title": "Crocodile", "level": 1, "content": [{"type": "paragraph", "text": "\"Desert King\" Sir Crocodile is the former president of the mysterious crime syndicate Baroque Works, the primary antagonist of the Alabasta Arc, and the central antagonist of the Alabasta Saga."}, {"type": "paragraph", "text": "He is one of the longest running and most noteworthy primary adversaries of the series, as he was the first enemy to hand Luffy a complete and utter defeat, as well as one of only two who has defeated Luffy more than once. He was originally introduced as a Shichibukai but was later stripped of his title after attempting to take control of the desert kingdom Alabasta."}, {"type": "paragraph", "text": "Thanks to Luffy, he managed to escape from Impel Down and went to Marineford to participate in the war. After the war, he and his subordinate Daz Bonez decided to head out to the New World."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Crocodile is a tall man with a wide chest, broad shoulders, muscular arms and legs, and a thick neck. He has pale skin and nape-length black hair which is kept neatly slicked back, though strands tend to fall in front of his face during battles. Crocodile has various battle wounds, most notably a long stitched scar at the bridge of his nose that stretches across his face and a large hook made from a tough gold alloy in place of his left hand. His eyes are deep-set and heavy-lidded, and his thin eyebrows are characteristically drawn upward in the middle. This gives his usual facial expression a feeling of condescension and distrust. Crocodile speaks with a deep, relaxed voice, and he is usually seen smoking a thick cigar produced by his company. In the anime, his skin is somewhat of a grayish color."}, {"type": "paragraph", "text": "His theme of dress is meant to convey the image of an Italian mafia boss. In his original appearance, Crocodile wore a bright orange, black-striped button up vest over a long-sleeve peach shirt (white in the manga and One Piece: Pirate Warriors series), along with a blue scarf, dark brown suit pants, and polished black shoes with gold buckles. He also wore a long, thick, dark pelted fur coat (fully dark green in the manga and One Piece: Pirate Warriors, dark gray with a regular gray fur trim in the anime, and dark green with a light green trim in Movie 8) over his shoulders."}, {"type": "paragraph", "text": "After he was incarcerated at Impel Down, he wore a striped prisoner uniform, like most other prisoners, but was somehow permitted to keep his gold hook. After joining Luffy and Jinbe on their mission to save Ace, he obtained a full change of clothes from the supplies of Newkama Land and thereafter wore a black shirt, a green scarf, dark grey slacks, and a black overcoat with brown tan (light color in the anime) fur trim. After the Battle of Marineford, he is seen in attire that greatly resembles the one from Alabasta, consisting of a vest over a plain shirt, a scarf around his neck, suit pants, elegant shoes, and a fur coat draped around his shoulders."}, {"type": "paragraph", "text": "In all his appearances, he wears a single gold hoop earring in his right ear, and he usually has several golden rings with different colored gemstones on every finger except the ring finger, for reasons unknown. (In the anime version of the Alabasta arc, it was his middle finger that was bare. This has since been corrected in recent arcs.)"}, {"type": "paragraph", "text": "In SBS Volume 63, Oda drew the Shichibukai as children. Crocodile is shown having a similar hairstyle as his adult self but is missing his trademark scar and hook. He is shown wearing simple clothing with a large pistol slung on his belt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Crocodile is self-assured, confident in himself and in his abilities. His great power is shown when he defeats Luffy twice, almost killing him both times. He enjoys toying with weaker opponents, often grinning and laughing smugly during battle. However, due to his overconfidence, he seriously underestimated Luffy's willpower, and this eventually led to his defeat."}, {"type": "paragraph", "text": "His willingness to kill shows his pitiless nature, and he does not think twice about sentencing another person to death. He is also very quick to get angry if someone insults or ridicules him in any way; Crocodile told Nico Robin that he had killed everyone who had ever insulted him. This irritability is first seen when Sanji sasses him over the Den Den Mushi. It is more clearly shown during his first fight with Luffy: when Luffy called him stupid, he bit his cigar clean in half and then threatened to kill Robin for laughing. To be fair, by his own admission, he is not always rational."}, {"type": "paragraph", "text": "Despite his low tolerance for receiving insults, he has a habit of insulting others and frequently used the word \"worthless\" to refer to the desperate struggles of his enemies, although he seems to have changed this habit slightly since fighting Luffy. Crocodile is known to insult others and generally imply that they are far inferior to him, whether he's fighting a rookie or a fellow Shichibukai (namely Donquixote Doflamingo, who had a former bounty almost 300,000,000 higher than his own.) Crocodile's capacity for looking down on others is so high that he even told Dracule Mihawk to \"watch himself\"."}, {"type": "paragraph", "text": "If Crocodile is extremely angry or annoyed with his victim, he will rarely kill them outright, instead leaving them to suffer as they slowly die. This proved to be a bad habit and ultimately led to his defeat. In his first and second fight with Luffy, instead of killing him straight away, Crocodile left Luffy to suffer. This allowed Luffy to come back and finally defeat him. This habit, along with sheer luck, are the only reasons Luffy lived through any of his fights with Crocodile. This also allowed Mr. 3 to survive Crocodile's attempt to feed him to the Bananawani."}, {"type": "paragraph", "text": "Crocodile shows no emotional concern for any of his subordinates. He is fully willing to sacrifice them to achieve his ambitions; a prime example is Operation Utopia, wherein every Baroque Works member in Alubarna, including most of the Officer Agents, would have been killed by the resulting cannon blast.) He also has no qualms about killing them if they insult or fail him, as shown with Mr. 3 and Nico Robin. He showed no true attachment, affection, or trust toward these people and viewed them only as pawns. Despite all this, Crocodile may not be entirely immune to the idea of respecting someone other than himself: currently, he seems to have a good relationship with Mr. 1, having gone out of his way to rescue his former subordinate from his cell."}, {"type": "paragraph", "text": "Crocodile has been shown to almost completely lack any code of honor. One of the few vestiges of honor he ever displayed was in his third battle with Luffy, during which he stated that Luffy deserved an honorable death from his venomous hook. Due to the situation at the time of battle, this could be seen as more an act of cruelty than honor, but he did seem to regard the use of his rarely-seen poison hook as a tribute to Luffy's tenacity. As another example of his distorted sense of honor, after Whitebeard was injured by Squard, Crocodile refused to fight him in that weakened state."}, {"type": "paragraph", "text": "Crocodile has displayed an extremely cynical and patronizing attitude, showing complete disregard to the romantic pirate lifestyle and stating that all the values that the status of Pirate King had once symbolized were now worthless to him. He valued military power above popularity, renown, and treasure. Crocodile believed that only ignorant fools declare their grandiose dreams. He refers to trust and faith in others as idiotic several times during the Alabasta arc. He claims to have done away with countless people rather than trust them and goes so far as to deride those who fight for others, making their defeats all the more harsh."}, {"type": "paragraph", "text": "After losing to Luffy and being stripped of his Shichibukai title, Crocodile apparently lost interest in the outside world. He refused to escape with the rest of his subordinates during the breakout detailed in the eighth Mini-Series. His only apparent motivation to leave Impel Down was the chance to enact revenge against Whitebeard."}, {"type": "paragraph", "text": "He has shown a complete lack of fear and doubt, although this trait broken down a bit by his third battle with Luffy. He usually appears to be very composed and fearless, even when facing fearsome opponents like Whitebeard,Dracule Mihawk, and Akainu. Upon his capture, he disregarded the notion of escaping simply because he did not feel like it, perhaps assuming that escape would come easily to him if he changed his mind. Similarly, he smiled at the news that he would be sent to Impel Down and seemed apathetic during his imprisonment. Crocodile was the only Impel Down inmate who appeared to be enjoying himself; he is initially seen smiling and mocking his fellow prisoners. He claimed that he was only in Impel Down because he chose to stay, an assertion well in line with his overly condescending demeanor."}, {"type": "paragraph", "text": "Crocodile seems to have mellowed out since his defeat in Alabasta, at least to some degree. He seems more willing to assist others, having offered to help Luffy escape from Impel Down, and he nonchalantly accepted help from others as well. Recent revelations imply that he may not be as heartless as he lets on. During the war, he went beyond his personal agenda several times to save his allies' lives. He saved Ace's life and protected Mr. 1 and Luffy from Mihawk. He even prevented Akainu from cornering Luffy and Jinbe as they desperately tried to escape the scene of the battle. Nevertheless, he claimed that he only saved them because if he had not, the Marines would feel victorious, and that prospect irritated him. Following the war, Crocodile appears adventurous and fearless, preparing to journey to the New World with Mr. 1."}, {"type": "paragraph", "text": "Crocodile has a distinct laugh that starts with \"Ku\" (i.e. Kuhahahaha!). In the anime, he tends to laugh at a much slower pace than one might expect, his \"hahaha\"s lapsing into \"ah-ah-ah\"s on occasion."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Baroque Works", "level": 3, "content": [{"type": "paragraph", "text": "His relationship with his employees, in regards to the grand scale of Baroque Works, is virtually non-existent. His identity was shrouded in complete mystery to everyone in the organization except for Nico Robin. This implies that people may not have trusted Mr. 0 as a boss if they had known he was the Shichibukai Crocodile."}, {"type": "paragraph", "text": "He did not refrain from acting cruelly towards the Baroque Works agents under his employment, especially those who failed him, as shown when he fed Mr. 3 to his Bananawani. Though he was formerly a loyal subordinate, Mr. 3's allegiance turned to hate and fear after Crocodile attempted to murder him. Ever since, the mere sight of Crocodile has filled him with terror. However, he does not harm subordinates for no reason, only striking out at them if they fail or betray him."}, {"type": "paragraph", "text": "Crocodile's connection to Robin was strictly business-related; he did not consider her a friend, only a tool for his own ambitions."}, {"type": "paragraph", "text": "Miss Double Finger, like her fellow Officer Agents, was shocked to learn Mr. 0's true identity and continued to appear moderately intimidated by his presence, especially when the latter used his sand powers to dehydrate Mr. 3. This, however, did not stop Zala's curiosity; she daringly decided to directly ask Crocodile about his final objective while Mr. 1, Mr. 2, Mr. 4, and Miss Merry Christmas remained visibly put off."}, {"type": "paragraph", "text": "Mr. 2 addressed Crocodile as \"Zero-chan\" even after learning his identity."}, {"type": "paragraph", "text": "Despite Crocodile's cruelty towards his subordinates, the Officer Agents managed to retain some level of loyalty toward him after his defeat. This is demonstrated when Miss Goldenweek attempted to save him and the other Baroque Works agents and Mr. 1 subsequently decided to stay with him in prison. Crocodile rewarded this loyalty first by personally releasing Mr. 1 from his cell after escaping from his own and later by asking Mr. 1 to join him in the New World."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Alabasta Kingdom", "level": 4, "content": [{"type": "paragraph", "text": "In Alabasta, the Shichibukai Crocodile was seen as a hero because he was always defeating pirates who attacked the island. Without knowing that his true intention was conquest, the citizens admired him and even the king acknowledged his good deeds. The first Alabastan to discover his evil plan was Nefertari Vivi. Crocodile's cruelty toward Alabasta was laid bare after he was defeated by Luffy; he passed out as he was being pummeled into the sky, and soon after he made landfall, Vivi revealed the truth to the astonished crowd."}], "images": []}, {"title": "Nefertari Vivi", "level": 4, "content": [{"type": "paragraph", "text": "Crocodile is on especially bad terms with Vivi. After learning of the crimes he was committing at her country's expense, she repeatedly expressed her desire to kill him and did not hesitate to deal what would have been a lethal blow to anyone but a Logia user."}], "images": []}, {"title": "Nefertari Cobra", "level": 4, "content": [{"type": "paragraph", "text": "Cobra was first seen expressing his gratitude toward Crocodile for defeating some pirates that tried to raid Nanohana, not knowing of Crocodile's true nature. Soon afterwards, he learned the truth about the rebellion from Vivi's letter. Crocodile had Cobra brought to him and demanded to know the location of Pluton, later forcing the king to lead Miss All Sunday to the Alabasta Poneglyph in order to gather information about Pluton. Cobra was willing to face death if it meant he could keep Crocodile from seizing the throne. When Luffy arrived and fought against Crocodile one last time, Cobra witnessed the battle and was amazed by Luffy's finishing attack that punched Crocodile through bedrock."}], "images": []}, {"title": "Chaka", "level": 4, "content": [{"type": "paragraph", "text": "They first fought when Crocodile appeared at the royal castle. Chaka was so angered by Crocodile's dismissal of the Kicking Claw Force that he attacked the man in a fit of rage. His reasons were also backed by his desire to protect Vivi and Koza and to buy them enough time to put an end to the battle. Despite his best efforts, Chaka was easily defeated."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Crocodile was a major enemy of the Straw Hats, and his defeat at their hands is considered one of their greatest achievements. Starting from Whisky Peak, Luffy and his crew were targeted by Crocodile and his organization, Baroque Works. When the Straw Hats finally reach Alabasta, the crew struggled but succeeded in foiling Crocodile's scheme, all for the sake of their friend, Princess Vivi. Crocodile did not really see Chopper as a threat like the rest of the Straw Hats, and mistook him for nothing more than the crew's pet."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "After seeing Crocodile and his Operation Utopia plan to destroy Vivi's kingdom, Luffy grew furious at the Shichibukai, swearing to defeat him. However, Crocodile viewed Luffy as just another rookie who knows nothing of the world. During their third fight, Crocodile stated that once Luffy learns what the seas are truly like, he would forsake his dream."}, {"type": "paragraph", "text": "After coming across Crocodile in Level 6 of Impel Down, Emporio Ivankov persuaded Luffy to free him, which he did reluctantly. Even though he suffered defeat at Luffy's hands, he does not seem to hold a grudge and was even willing to offer him assistance in breaking out of Impel Down. Though Crocodile aligned himself with no one during the Battle of Marineford, he ended up saving Luffy's brother, Ace, once and even protected Luffy himself, claiming that he did it only because he did not want the Marines to have their way. Therefore, he helped Jinbe and Luffy escape from Akainu to prevent the then admiral from killing them."}], "images": []}, {"title": "Nico Robin", "level": 4, "content": [{"type": "paragraph", "text": "Crocodile and Nico Robin worked together for several years in order to further their own goals, but their relationship never had more than a semblance of mutual trust. Although he sheltered her from authorities in exchange for her services, he never once showed compassion to her; she was just expected to follow orders. He held no pity for her when she failed to deliver Pluton and did not think twice about striking her, although he did admit that she had been a beneficial partner to him."}], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "As the person responsible for Crocodile suffering a humiliating defeat during his early days at the New World, he held a grudge against Whitebeard ever since. At Impel Down, he expressed a desire of revenge and to kill Whitebeard himself. When Squard stabbed Whitebeard, Crocodile was disgusted by how weak his former adversary had become. Upon the Yonko's death, he remarks that his wounds were now fully healed."}], "images": []}, {"title": "World Government and Marines", "level": 4, "content": [{"type": "paragraph", "text": "Crocodile is considered an enemy of the Marines and the World Government after his plot threatened to upset the balance between the Three Great Powers. Crocodile abused his Shichibukai privileges to build himself a large and powerful covert organization. His actions in Alabasta left the World Government with no choice but to revoke his status as Shichibukai, although they hadn't even realized there was a problem until after Luffy dealt with him. The World Government raised Luffy's bounty as a direct result of Crocodile's defeat."}, {"type": "paragraph", "text": "During the War of Marineford, Sengoku thought that he could use Crocodile's hatred of Whitebeard to his advantage. Though Crocodile did want to take Whitebeard's head, he also wanted to keep the Marines from having their way, as shown when he saved Ace from the first execution attempt. Sengoku was shocked and aggravated by this turn of events. Even though Crocodile had been robbed of his revenge against Whitebeard, he continued to consider the Marines his enemy and ultimately saved Luffy and Jinbe from Admiral Akainu."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f7/Crocodile_Saves_Ace.png/revision/latest/scale-to-width-down/210?cb=20130914144322", "caption": "Crocodile interrupts Ace's execution."}]}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Emporio Ivankov", "level": 4, "content": [{"type": "paragraph", "text": "Ivankov and Crocodile knew each other at some point while the latter was still a rookie. At that time, Ivankov found out a precious weakness of Crocodile's, which he later used as blackmail to ensure that the known villain would not betray the escape party."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Among his former colleagues, Crocodile seems to have an especially negative past relationship with Jinbe, who was notably furious to know Crocodile was in a cell near his at Impel Down. Upon their release, Jinbe told Crocodile to leave Whitebeard alone. However, Crocodile's only response was asking him if he wanted to fight. Despite their conflict, in the late stages of the Battle of Marineford, Crocodile helped Jinbe and Luffy escape from Akainu."}], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "When they met during the Battle of Marineford, Crocodile threatened to kill Doflamingo for intruding in his business and mocking him, but Doflamingo suggested they form a partnership. In response, he laughed at the offer and attacked both Jozu and Doflamingo. After Crocodile rescued Ace from the first execution attempt, Doflamingo suddenly cut off Crocodile's head, saying that he would be jealous if Crocodile allied with Whitebeard after refusing his own alliance proposal. Crocodile said that he was not allied with anyone, after which the two were seen clashing. Doflamingo also recognizes his strength, as he didn't believe Crocodile would be defeated by a Marine captain after hearing about him in the Alabasta cover up."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1b/Doflamingo_and_Crocodile_Clash.png/revision/latest/scale-to-width-down/210?cb=20141206161747", "caption": "Crocodile clashing with Doflamingo."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a former Shichibukai, Crocodile is powerful enough to be recognized by the World Government. He was the Shichibukai with the second lowest bounty at the time (81,000,000), with Hancock having the lowest, although he held the title for so long that such a low bounty would now be outdated. Indeed, when Crocodile was stripped of his Shichibukai status and transferred to Impel Down, he was placed in Level 6, where the world's absolute worst criminals are kept."}, {"type": "paragraph", "text": "He defeated Luffy no less than twice before his eventual defeat. In fact, if not for his good luck and the help he received from several people, Luffy would have been killed in all three battles: he was impaled (and then rescued by Nico Robin), dehydrated (and then revived by his own Water Water Pistol), and poisoned (and then received the antidote from Robin). Moreover, if Luffy's blood had not served as a way to nullify Crocodile's Logia-Type defense, and if Robin had not supplied Luffy with the antidote to his hook's poison, the third battle would have effectively favored Crocodile as well."}, {"type": "paragraph", "text": "Later on, during the Battle of Marineford, Crocodile was uninjured after confronting fellow Shichibukai Donquixote Doflamingo and Dracule Mihawk in quick succession, despite the fact that both opponents possess and have complete mastery of their Haki. Crocodile was even able to battle Admiral Akainu and appear completely unharmed afterward."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Despite his powers being of the Logia-type, allowing him to turn into sand to avoid injuries, Crocodile has an enormous amount of physical stamina, durability, pain tolerance, resilience and endurance, coupled with remarkable speed and reflexes. He was able to take a serious beating from Luffy in their third battle while countering with attacks of his own, and he later managed to take a direct strike from a diamond-encased Jozu with only a single burst blood vessel. He is also one of the few people known to tolerate getting \"baptized\" in boiling water in Impel Down without flinching, which is considered an impressive feat. The former Shichibukai could effortlessly withstand the extreme temperatures of Levels 3 (where the heat is sufficient to roast a bird alive), 4 (which is several times hotter than Level 3) and 5 (a room operating at sub-zero temperatures) of Impel Down."}, {"type": "paragraph", "text": "Crocodile also possesses great physical strength, first demonstrated when he carried off the dead bodies of an entire pirate crew (namely Puppu's) after dehydrating them with his Devil Fruit powers. While Luffy was unable to retaliate against Mihawk and was forced to only avoid his attacks, Crocodile intercepted and stopped Mihawk's two-handed slash with just his hook; he didn't seem to be worried at all about facing such a strong opponent, and even talked down to him. He also seemed to be able to fight Doflamingo, a pirate noted for his outstanding physical feats, as an equal: their clash creating a shock wave strong enough to push nearby Marines away."}], "images": []}, {"title": "Intelligence", "level": 3, "content": [{"type": "paragraph", "text": "Crocodile is extremely intelligent and cunning, which is apparent from his ability to lead Baroque Works while keeping the World Government completely in the dark about what he was doing and making himself out to be a hero in the eyes of the people. He is also skilled at crafting near-flawless plans and noticing things that most other people would not. "}, {"type": "paragraph", "text": "He is known to deduce a correct conclusion based on very little information; for example, after seeing the white wrappings on the Straw Hats' arms, he almost instantly figured out that it was a safeguard against Mr. 2's infiltration. He managed to sabotage the king's reputation among the citizens by secretly importing rain-producing dust into the capital during a period of major regional drought, then having it \"accidentally\" discovered en route, inciting the threat of civil war and thereby drawing attention away from his own shady machinations."}, {"type": "paragraph", "text": "The entire Alabasta Saga is a testament to Crocodile's strategy and manipulative skills: he managed to successfully maintain control over all operations within \"Baroque Works\" over a period of years while keeping his true identity as a Shichibukai hidden from everyone except Nico Robin. Simultaneously, he strove to attain a high level of respect and prestige among the citizens of Alabasta as their \"savior\" by brutally dispatching any would-be invaders or pirates."}, {"type": "paragraph", "text": "In addition, aside from being heavily experienced thanks to his many years as a pirate, he seems to have a better understanding of Devil Fruits than most people, as evidenced by his mastery of his Logia-type powers. He also revealed that the Jailer Beasts were actually \"Awakened\" Zoan fruit users at a time when no one around him had even realized that they were even Devil Fruit users."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Crocodile ate the Suna Suna no Mi, a Logia-type Devil Fruit that allows him to become, generate, and manipulate sand. He has mastered his ability to the point of perfection and can turn into sand reflexively if attacked; this became especially obvious after Doflamingo cut his head off while he was distracted."}, {"type": "paragraph", "text": "While in a desert area, his powers make him nearly invincible. Crocodile has the ability to create huge sandstorms, make multiple bladed weapons out of sand, and create quicksand (given the presence of a nearby underground waterway)."}, {"type": "paragraph", "text": "He can also suck all the moisture out of any object, living or non-living, by touching it with his right hand. This ability allows him to utterly destroy his surroundings, killing and macerating any biological substances via dehydration."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Suna_Suna_no_Mi_Infobox.png/revision/latest/scale-to-width-down/230?cb=20170407033847", "caption": "The Suna Suna no Mi in use."}]}, {"title": "Weapons", "level": 3, "content": [], "images": []}, {"title": "Hook", "level": 4, "content": [{"type": "paragraph", "text": "In addition to being one of the few characters shown to have some degree of mastery over their Devil Fruit, Crocodile is also formidable in hand-to-hand combat. He fought using only his hook for most of his third match with Luffy, only resorting to his Devil Fruit powers when he finally accepted that things weren't going in his favor. His hook is made mostly out of an extremely tough and resilient gold alloy, which makes it resistant to corrosion. Its durability was shown to be especially impressive when it took no visible damage from Mihawk's Yoru as Crocodile defended Luffy from an attack."}, {"type": "paragraph", "text": "The gold part of the hook is hollow and can be removed to expose a poisonous hook hidden inside. This porous secondary hook releases a powerful scorpion venom, which is strong enough to melt through rock and kill anyone with the effect of a single slash. In One Piece: Burning Blood, Crocodile's poison hook appears as his Awakened state under the name You're An Annoyance!."}, {"type": "paragraph", "text": "In the unlikely event that the hook becomes damaged, there is a knife hidden underneath that can be ejected and used in its place. In a pinch, the very wide base of the hook can also serve as an improvised mace-like weapon, as shown when Crocodile used its blunt force to smash Luffy into a wall."}, {"type": "paragraph", "text": "During his incarceration in both a regular prison and Impel Down, Crocodile was permitted to keep his formidable weapon of a hook, suggesting that the authorities assumed or knew that it was a prosthesis."}], "images": []}, {"title": "Timer Bomb", "level": 4, "content": [{"type": "paragraph", "text": "For the pinnacle of Operation Utopia, Crocodile prepared a specialized bomb. It was designed to detonate across a maximum radius of five kilometers, large enough to completely obliterate the capital city of Alubarna. It was prepared about 30 minutes prior to the intended firing time, at which point it would be released from a bulky cannon, but in case that method backfired, Crocodile had a special timer installed onto the bomb itself. The timer was set for less than a minute after the planned time."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Disillusioned Youth", "level": 4, "content": [{"type": "paragraph", "text": "Twenty-two years before the start of the storyline, Crocodile witnessed the execution of Gol D. Roger at Loguetown."}, {"type": "paragraph", "text": "At one point in the past, Crocodile's dream was to become the Pirate King. During his time as a rookie, he had crossed paths with Emporio Ivankov, who ended up with the knowledge of something that Crocodile does not wish to be revealed."}, {"type": "paragraph", "text": "He once went to the New World and grew adapted to its erratic environment. As time went by, though, he grew in power and experience and lost sight of the importance of dreams and trust in other people. However shortly after ascending to the rank of Shichibukai in his mid-twenties, he suffered a humilating defeat upon challenging the Yonko Whitebeard, which brought an abrupt end to his dream of being the Pirate King. Sixteen years before the current storyline, at age 30, Crocodile relocated to Alabasta and became renowned as a pirate-hunting hero. "}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/86/Crocodile_at_Roger%27s_Execution.png/revision/latest/scale-to-width-down/210?cb=20130918190445", "caption": "Crocodile witnessing Gol D. Roger's execution."}]}, {"title": "The Birth of Baroque Works", "level": 4, "content": [{"type": "paragraph", "text": "Crocodile secretly started a crime syndicate called Baroque Works. Being careful not to attract too much attention to himself, he gathered some of the best bounty hunters in the world and gave them code names based on power. His plan the whole time was to conquer Alabasta  and use the Poneglyph there to find the ancient weapon Pluton, which would give him great military power."}, {"type": "paragraph", "text": "It is known that he found Nico Robin when she was 24, at which point he made a deal with her. He would protect her and give her sanctuary from the authorities, and in return, she would be his business partner, decipher the Poneglyph, and find the location of Pluton."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Little Garden Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Crocodile called to check in on Mr. 3, Sanji happened to be nearby and answered the Den Den Mushi instead. Understanding that this conversation was not meant for him and that an enemy was on the other end of the call, Sanji lied to the Shichibukai by pretending to be Mr. 3 and claimed to have killed the Straw Hats and Vivi. As a result, Crocodile sent the Unluckies to Little Garden to deliver an Eternal Pose to Mr. 3. When they arrived, they attacked Sanji. He easily subdued them, but the noise of their quarrel made Mr. 0 suspicious. Sanji pretended that he had to give the Straw Hats a final blow. Crocodile took this to mean that Mr. 3 had lied to him about defeating the enemies but ended the call with instructions to go to Alabasta. However, Crocodile asked Miss All Sunday to send Mr. 2 to Little Garden with orders to kill Mr. 3."}, {"type": "paragraph", "text": "Later, when informed by his partner of a pirate invasion of Alabasta, Crocodile asked her whether they knew he was there. Miss All Sunday said that a civil war was going on and they might use this opportunity to their advantage, asking him whether the two of them should go. Crocodile decides to take care of it alone, reminding Ms. All Sunday that he is the citizens' hero."}], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Some pirates, Puppu and his crew, made a grave mistake in attempting to raid Nanohana. When Crocodile showed up, Puppu insulted him for being a \"government dog\" and, along with his crew, thoroughly stabbed the Shichibukai. Thinking that he had won, Puppu's mockery turned to horror when Crocodile created a sandstorm that drained the water from Puppu and his crew's bodies. They most likely died from severe dehydration as Crocodile was carrying their corpses out of town afterward."}, {"type": "paragraph", "text": "Much later, Crocodile assembled a meeting with all of his Officer Agents at Rain Dinners, marking the first time their boss's true identity would be revealed to them. Crocodile informed his agents of the true goal of the Baroque Works and gave each them their final missions."}, {"type": "paragraph", "text": "Mr. 3 unexpectedly interrupted the meeting in order to request another chance to defeat the Straw Hats. Crocodile was surprised by this revelation since, after calling Little Garden, he had assumed that all of the Straw Hat Pirates and Vivi were dead. Mr. 2 confirmed that the Straw Hat Pirates and Vivi are alive since he had met them on the way to Alabasta. With the help of his power, they were able to take photographs of the Straw Hats' faces (excluding Sanji) and started to take measure to prevent Vivi from meeting with the rebel leader, Koza. Disappointed with Mr. 3, Crocodile dried him up and fed him to his Bananawani. Crocodile ordered the rest of the Officer Agents to take out the Straw Hats posthaste."}, {"type": "paragraph", "text": "Luffy and his group pressed forward to confront the Shichibukai. Upon arriving at Rainbase, Luffy and Usopp were sent to fetch some water after their long journey in the desert. Upon getting water from a bar, the two encountered Smoker and Tashigi. After a big commotion and a frenzied chase, Luffy and some of his crew managed to reach Crocodile's casino, Rain Dinners. Crocodile ordered Robin to take them to the VIP room. After falling for an obvious trap, Luffy, Nami, Zoro, Usopp, and Captain Smoker found them trapped in a Seastone cage. Crocodile arrived to greet them shortly after."}, {"type": "paragraph", "text": "Luffy and the others were powerless to punch Crocodile, as badly as they wanted to. When Robin brought Vivi, the princess was overwhelmed by anger and attacked Crocodile, but it was useless. Crocodile announced that Operation Utopia, the plan to destroy Alabasta, would commence at 7 o'clock. He made sure to explain it in an extra infuriating way, just to tick them off."}, {"type": "paragraph", "text": "Crocodile showed Vivi the key to the seastone cage before feeding it to a bananadile and beginning to flood the room in an attempt to make Vivi choose between saving her friends and saving her country. Luffy overheard Toto being mentioned by the Shichibukai and realized that Crocodile was the one causing the sandstorms that plagued Yuba."}, {"type": "paragraph", "text": "Before leaving, Crocodile taunted Vivi with everything he had. This made Luffy very angry, and he begged Vivi to free them so that he could beat Crocodile. Suddenly, Crocodile received a weird call on the Den Den Mushi he used for contacting Billions. The voice on the other end was familiar to him in a bad way. Sanji, nicknamed as Mr. Prince, fooled Crocodile over the snail by baiting him to leave the casino. When Crocodile saw that all his Millions were beaten by the mysterious Mr. Prince, he ran after the obvious decoy, a disguised Chopper. He wasn't fooled for very long, but it was long enough."}, {"type": "paragraph", "text": "Ms. All Sunday wondered if the Straw Hat Pirates could have already found the key, and Crocodile answered by saying that the key was a fake in the first place, revealing that he had the real one. By the time they arrived at the room, the cage was swinging open underwater, while the beaten Bananawanis and a beat-up Mr. 3 floated in the water with a piece of paper on him that says \"See ya shitty Croc - Mr Prince\" on it. Crocodile lost his cool."}, {"type": "paragraph", "text": "Later in the desert, Luffy saved Vivi from Crocodile's hook and stayed behind to fight him. Vivi was worried about him, but the Straw Hats reassured her that Luffy would win and they would reunite in Alubarna. Crocodile allotted three minutes of his time to battling Luffy. He was unaffected by Luffy's attacks but easily annoyed by his confidence and demeanor. Crocodile attacked Luffy and made his arm wither with his power. Luffy started to panic but remembered the water Toto gave him and used it to restore his arm. Luffy yelled that Toto stated Yuba would never lose to sand. He busted out a new technique and gulped the top half of Crocodile's sandy body, which further enraged him. Crocodile told Luffy to die along with Yuba and let loose a Sables."}, {"type": "paragraph", "text": "Luffy was very upset to learn that the sandstorm would end up in Yuba, but when he tried to complain, he got impaled by Crocodile's hook. Crocodile held Luffy up and derided him for a while. Crocodile had apparently stabbed right through the water bottle around Luffy's neck on the way into his chest. When the water from Luffy's bottle dripped onto Crocodile's arm, Luffy suddenly grabbed the arm and squeezed it hard enough to crunch a little. Crocodile was surprised that Luffy survived and threw him into the quicksand where he was promptly buried."}, {"type": "paragraph", "text": "Later, Vivi arrived at the palace and gave the order for the Royal Army to blow up the palace in order to get everyone's attention, but Crocodile thwarted the plan. At the castle, Miss All Sunday prevented the guards from helping the King. This gave Crocodile time to make Vivi despair by telling her that Luffy died and disclose to Cobra the fact that his true goal was Pluton. At the castle, Crocodile explained that he needed a weapon to establish his military power and be able to counter the World Government forces. Hence, he was searching for the ancient weapon Pluton which is hidden somewhere in Alabasta. To find it, Crocodile was searching for a place containing \"true history.\" So as to convince Cobra to help him, Crocodile revealed his trump card: a bomb was rigged to explode in 30 minutes, killing the rebels and royal guards all together. The Tsumegeri Guards then came to the king's defense, attempting to kill Crocodile by drinking Hero Water to increase their strength. They attacked Crocodile, but he avoided their attacks by turning into sand and leaping up to the roof of the palace, not even giving them a chance to touch him. The Tsumegeri Guards died from the aftereffects of the Hero Water, resulting in an angry Chaka attacking Crocodile, revealing his Devil Fruit powers, only for Crocodile to effortlessly defeat him."}, {"type": "paragraph", "text": "When Koza arrived at the palace to force Cobra's surrender, Crocodile gloated that he had manipulated him all this time. Upon learning of Crocodile's bomb, Koza wanted to warn the city but was stopped by Vivi, who stated that it would create a panic, instead telling him to stop the war. Crocodile moved in to attack the pair before they could, but Chaka used what strength he had left to intervene, allowing them to escape. The Royal Army raised the white flag, with Koza in front, but he was shot down by a double agent in the Royal Army, provoking the rebels. A battle started in the palace plaza as Vivi watched in horror. After gloating to her that she should've let Koza warn the city and that her ideals would be what destroys the country, Crocodile proceeded to throw Vivi off the palace wall, but she was saved by Luffy who came in flying on Pell's back, much to Crocodile's shock as he thought Luffy had died in their last fight. Vivi met the rest of the Straw Hats on the foot of the wall and went to search for the bomb with them and Pell."}, {"type": "paragraph", "text": "During his previous fight, Luffy noticed that water made Crocodile unable to turn into sand as he and the water barrel that Toto gave were pierced by Crocodile's hook. Realizing this, he brought a huge barrel of water to aid him in his rematch against the Shichibukai. But as Luffy fought Crocodile again, he soon realized that his barrel of water could easily be jeopardized. Figuring this out, Luffy decided to switch tactics by drinking all of his water and storing it within himself, essentially becoming what he dubbed \"Mizu Luffy\". While this new tactic infuriated Crocodile, it proved very effective for Luffy. Unfortunately, he gained enough of an upper hand for Crocodile to stop holding back."}, {"type": "paragraph", "text": "Crocodile ordered Nico Robin to have Cobra lead her to the ponyglyph that contained the location of Pluton, planning to catch up after he finished dealing with Luffy. He then used his strongest technique, Ground Secco and Ground Death, to turn the entire area they were standing on into sand. Though Luffy was able to evade Crocodile's devastating powers of erosion, he was caught by his opponent. As Crocodile's hand held Luffy, he was severely dehydrated  and was once again left for dead. Fortunately, however, some water bubbles that Luffy misfired earlier dropped on him, reviving him from his near death state."}, {"type": "paragraph", "text": "Miss All Sunday easily dispatched the Marine grunts who had held her up and defeated Tashigi just as easily with her Devil Fruit ability. As Tashigi struggled for her sword, Crocodile appeared, calling her superior Smoker \"cowardly\" and mocking her and the Marines' ideals of \"Justice\" before departing again. Tashigi was left crying and confused as to what action she should take and angry that she wasn't strong enough. Miss All-Sunday and King Cobra went to the hidden Grave of the Kings and found the Poneglyph. Crocodile soon arrived  but did not get the information he wanted from the stone. Nico Robin alone could read it but told him that all that was said on the Ponyglyph was Alabasta's history. He turned his back on Nico Robin, having no further use for her, and impaled her with his hook, easily avoiding her attempt to kill him. Cobra triggered a destruction mechanism in the grave to keep the secrets safe, but Crocodile pointed out that he can easily escape with his ability. On his way out however, he was confronted by Luffy again."}, {"type": "paragraph", "text": "Annoyed by Luffy's stubbornness, he asked him what was his reason for fighting and being killed. To that question, Luffy answered that he needed to give back the country. Crocodile laughed because he thought he had not yet accomplished that part, but Luffy answered him that if it was the case, Vivi shall be happier, and then he ran towards Crocodile and gave him a direct punch in the face. Crocodile was surprised about that since Luffy carried no more water. He finally understood that what allowed Luffy to hit him was the blood from his wounds. Realizing that he was facing someone he should no longer underestimate, he took the upper part of his hook off, revealing a poisonous weapon. Luffy fought him and gained the upper hand but eventually got struck by the hook and was poisoned. However, his determination to defeat Crocodile easily overcame this, much to the latter's frustration."}, {"type": "paragraph", "text": "As the battle continued, Luffy kicked Crocodile into the air. Upon doing so, Luffy was blasted with one of Crocodile's powerful techniques. Luffy however withstood the attack and prepared to retaliate. Using a series of moves, Luffy propeled himself up to Crocodile to deliver the final blow. As a last resort, Crocodile tried to stop Luffy by turning his hand into blades. This did not stop Luffy as he broke through the sand created weapons with his bare fists and delivered a flurry of punches onto his opponent. Luffy attacked Crocodile with such force that it penetrated a layer of pure bedrock and sent Crocodile flying, finally defeating the Shichibukai. Upon being defeated, the effect of his Devil Fruit that was preventing it from raining was broken and Alabasta's rain returned."}, {"type": "paragraph", "text": "The Baroque Works president landed in the center of the capital, much to the confusion of the fighting citizens. After the truth of his crimes were finally made known to the rebels and royal guard, Tashigi, going by her own justice as Captain Smoker ordered, arrested Crocodile, who was stripped of all titles and permissions granted by the Marines and the World Government. All Baroque Works agents in the city were rounded up and arrested. The only one who managed to escape was Mr. 2 Bon Kurei, who later assisted the Straw Hats in escaping the country."}, {"type": "paragraph", "text": "The World Government falsified the entire incident, embarrassed that a pirate had saved the country rather than themselves. To the Marines, Smoker was declared the one who captured Crocodile (much to the former's disgust and anger). The only recognition the World Government gave to Luffy was raising his bounty."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/87/Crocodile_Slays_Invading_Pirates.png/revision/latest/scale-to-width-down/230?cb=20130526171544", "caption": "Crocodile slays the invading Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f9/Crocodile%27s_Meeting_with_Baroque_Works.png/revision/latest/scale-to-width-down/230?cb=20140911225237", "caption": "Crocodile meets with Baroque Works."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/57/Crocodile_Captures_Smoker_and_Straw_Hats.png/revision/latest/scale-to-width-down/230?cb=20130526171711", "caption": "Crocodile captures Smoker and the Straw Hats."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/82/Luffy_Defeated_by_Crocodile_Fight_1.png/revision/latest/scale-to-width-down/230?cb=20160927123526", "caption": "Crocodile impales Luffy on his hook."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/Luffy_Defeated_by_Crocodile_Fight_2.png/revision/latest/scale-to-width-down/230?cb=20160927123209", "caption": "Crocodile dehydrates and defeats Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Luffy%27s_Final_Battle_Against_Crocodile.png/revision/latest/scale-to-width-down/230?cb=20130402075835", "caption": "Crocodile fighting Luffy for the third time."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Crocodile_defeated.png/revision/latest/scale-to-width-down/230?cb=20160927124150", "caption": "Crocodile being stripped of his Shichibukai title by Tashigi after Luffy defeats him."}]}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "Crocodile was taken to a prison and was put in the same cell with Mr. 4 and Mr. 1. After Miss Goldenweek broke out all of the other Baroque Works members, Crocodile and Mr. 1 decided to stay behind. Crocodile was enjoying one of his cigars, smiling as he watched his former agents escape. On their way out, Miss Goldenweek used her Rainbow Color Trap to transform his appearance based on his dream, making him appear as the Pirate King. Crocodile was later sent to Impel Down along with Mr. 1, Mr. 2, and Mr. 3."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later in Impel Down, he was serving his sentence in Level 6. He was placed in a cell not too far from Jinbe and \"Fire-Fist\" Ace. He commented on the fact that Whitebeard's life was at risk due to the incoming war between him and the World Government, stating with a chuckle that several \"Silver Medalists\" (such as himself) would love to have their revenge on Whitebeard due to having only ever been defeated by the two in some way. He remained silent when Boa Hancock came to visit and was one of the three (the other two being Ace and Jinbe) who was unaffected by her beauty."}, {"type": "paragraph", "text": "When Luffy, Emporio Ivankov, and Inazuma were stuck on Level 6, Crocodile called out to Luffy, offering to create an opening out of Level 6. Luffy was defiant at first as he had yet to forgive Crocodile for what he did to Vivi and her country. He seemed confident that Luffy could not refuse his offer. Crocodile had at first lost interest in the outside world, but hearing that Whitebeard was going to war with the Marines had caused him to reconsider as it was a perfect chance to take down the legendary pirate. Luffy wanted nothing to do with him, considering that the Alabasta incident was still fresh in his mind. Ivankov however suggested to free him, much to Luffy's shock. It was then revealed that Ivankov has long known the former Shichibukai as far back as when he was a rookie. Ivankov assured Luffy that should Crocodile get out of line, he would take care of him himself since he knew of something in Crocodile's past that he would not want revealed."}, {"type": "paragraph", "text": "Ivankov then stated that he was only willing to free him if Crocodile helped out (which Crocodile already offered to do). Jinbe suddenly spoke out, begging to help, as he wanted to save Ace as badly as Luffy, even willing to die \"a glorious death\" to do so. Noting this, Luffy agreed to his wishes. The other prisoners in Level 6 also asked to be let out too, but Ivankov silenced them with a Death Wink. With that done, Inazuma freed Crocodile and Jinbe of their chains and the five prepared to break out of Impel Down."}, {"type": "paragraph", "text": "After being released from his bonds, Jinbe warned Crocodile to lay off Whitebeard though Crocodile merely asked if Jinbe would just prefer to fight to the death immediately if that was the case. Ivankov called out for Luffy to proceed only to be informed by Inazuma that he, Crocodile, and Jinbe had already pressed on. Ivankov shrugged this off and told the others to follow after him. Bon Kurei was also among the group, having been injected with Tension Hormones (though they worked a little too well since he cannot stop spinning). In a stairway leading to Level 4 from Level 5, Luffy, Crocodile, and Jinbe rushed on. The latter mentioned that the execution was set for 3 o'clock and that Whitebeard could make his move at any point while Ace was on the ocean. Luffy was content on the premise that Ace would not be executed before he was scheduled to."}, {"type": "paragraph", "text": "Crocodile went ahead of the two and dried up the entrance to Level 4, turning it to sand, only to find the security on that level were waiting for them. This did not stop the trio though and they attacked at full force. Crocodile used his Barchan ability, Luffy used his Gomu Gomu no Ame, and Jinbe used his Fish-Man Karate (which was so powerful he did not even need to touch the guards to knock them back). It soon became evident to the guards that they cannot beat the trio."}, {"type": "paragraph", "text": "On Level 4, Crocodile threw some keys into a cell and asked Daz Bonez to leave with him. Daz agreed to leave and joined the group. However, Sadi-chan and her Jailer Beasts arrived and quickly began taking out most of the group with nothing seemingly able to affect them. Just as all seems lost, Luffy, Jinbe, and Crocodile rushed forward and struck them with powerful attacks, knocking out the Jailer Beasts in one hit, much to the horror of Sadi and the shock of the guards."}, {"type": "paragraph", "text": "Suddenly as Blackbeard arrive at the scene, Crocodile witnesses his successor's arrival. Luffy proclaimed he will not let Ace die and started to attack again. Blackbeard retaliated by summoning a black whirlpool, sucking Luffy toward him and slamming him into the ground. Crocodile was genuinely surprised Luffy actually bled from the attack since he's made of rubber, and Blackbeard did not use haki, instead using the ability of his Devil Fruit to syphon off Luffy's power. Crocodile picked him out as his successor in the Shichibukai, and asked him why he was throwing away his Shichibikai status after working for it so hard. Blackbeard commented that it was part of his scheme although it was not going smoothly. He then retorted and asked Crocodile since when did he have to explain his plans to him which Crocodile responded that he really did not care what he was planning, which caused Blackbeard to comment on Crocodile being \"short on manners\"."}, {"type": "paragraph", "text": "A short while later the Minotaurus started attacking the escape force. In shock Mr. 2 Bon Kurei asked why it was already up since him, Luffy, Buggy, and Mr. 3 had defeated it not that long ago. Crocodile then explained that the four Jailer Beasts are Awakened Zoan users and they have super strength and high recovery rates and that the three guards which he, Jinbe, and Luffy had just beaten would recover soon as well, however, they lost the ability to go back to their human form. However, he was not concerned about this and stated that Magellan would arrive soon. He was later seen making his way through level 2 with Luffy and Jinbe and commented on how vacant it is. A short while later in Level 1, Buggy literally ran into him while fleeing the Jailer Beasts. At first, Buggy started telling him to watch where he was going, but upon seeing who he just ran into, Buggy screamed in shock and fear along with Mr. 3. Crocodile asked Mr. 3 what a worthless piece of trash such as him was doing there, which caused Mr. 3 much fear and dread. However, Crocodile was quite impressed later as Mr. 3 saved everyone from Magellan's Hydra using his Candle Wall."}, {"type": "paragraph", "text": "While Luffy then decided to take on Magellan with the help of Mr. 3's wax abilities, Magellan recognized the wall made of wax which Mr. 3 gloats is tough as steel and enough to blocks his attacks. Crocodile, Jinbe, Buggy, Mr. 1, Mr. 2, and the other prisoners found their way out in order to get a ship. Although they awaited the Marine ships at the entrance, not a single ship was waiting in front of Impel Down. They then noticed some of the Marine ships sailing away at a far end."}, {"type": "paragraph", "text": "Buggy, Mr. 1, and Crocodile jump onto the door before Jinbe carried it from under the water toward the ships. The prisoners were more than over-enthusiastic at the sight of seeing two Shichibukai on their side in action as well as their saviour Buggy along with them. Buggy however just jumped on to get away from the prison so as to not face Magellan."}, {"type": "paragraph", "text": "Just as the four came closer to the Marine ships, the Marines spotted them and opened fire. Jinbe dodged them then stated that he was going to launch them onto the ship before going underwater. Buggy began to freak out as their speed decreased and the makeshift raft on the verge of getting hit by the ships. Jinbe, meanwhile gathers as much power as he can before sending it out into a strong ocean current that rockets Buggy, Crocodile, and Mr. 1 onto the deck of one of the ships (the former two landed without trouble, but Buggy landed flat on his face). The Marines quickly pointed their guns at the bunch but before they can, Jinbe hit the ship with a spear wave much to Crocodile's annoyance. Jinbe apologized, mentioning he got careless since that’s the ship they were going to use. A short while later, he helped defend the ship from cannon fire by stopping the cannon balls with a sandstorm. Crocodile told the escapees to fire the ship's cannons, which Buggy repeated to the crew but made it sound like it was his idea."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Crocodile_and_Jinbe_freed.png/revision/latest/scale-to-width-down/230?cb=20160927124405", "caption": "Crocodile and Jinbe freed from their cells."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Crocodile_Luffy_and_Jinbei_in_Impel_Down.png/revision/latest/scale-to-width-down/230?cb=20100516125748", "caption": "Crocodile, Luffy, and Jinbe breaking free."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/76/Crocodile_and_Blackbeard_Confrontation.png/revision/latest/scale-to-width-down/230?cb=20160620135010", "caption": "Crocodile and Blackbeard confront each other."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Impel_Down_Makeshift_Raft.png/revision/latest/scale-to-width-down/230?cb=20130522003651", "caption": "Crocodile, Buggy, and Mr. 1 all ride on a makeshift raft, carried by Jinbe."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the escape, he was seen having a conversation with Jinbe about how he summoned the whale sharks. He commented on how it seemed odd that Jinbe could summon whale sharks. Crocodile also talked about how the fish-men were a violent race, which Jinbe agreed. After the ship was contacted by the Marines, Buggy and the rest of the prisoners that escaped with him were in shock and terror about their destination and they wanted to stop the ship. Crocodile explained that they can only go to Marineford or Enies Lobby because the current only flows to those two places."}, {"type": "paragraph", "text": "Later, when the prisoners that were released by Buggy became riled up and wanted to take the ship to escape, Crocodile, Luffy, and Jinbe got ready to do what was necessary to subdue or kill them, but Buggy managed to convince them to join the battle instead. Crocodile remained on the ship with Luffy and the others, approaching the battle of Marineford. Luffy tried to talk the others into pushing the boat so that it would slide down the back of the wave."}, {"type": "paragraph", "text": "Before they do, though, the Den Den Mushi on board intercepted the order, which was to just ignore the schedule and move up Ace's execution. Panicking, Luffy told the others that they need to hurry. Ivankov performed Hell Wink in hopes of shoving the battleship off of the wave, but instead of sliding down, it is knocked forward, flipping upside down and sending all of the inmates plummeting towards the sea. He was later seen alongside the other Impel Down fugitives, falling from the sky to Marineford."}, {"type": "paragraph", "text": "Through an act of pure fortune, the battleship landed in one of the few spots of the ocean that remained unfrozen. Although the impact split the boat in two, those on board fall into the ocean unharmed. Crocodile, along with the other Devil Fruit users is rescued by Jinbe, who fishes them out of the water. Onlookers were shocked that Crocodile, as well as the other prisoners, arrived in the middle of the war. As Ivankov looked around, he noticed that Crocodile made his first move, appearing behind Whitebeard, ready to impale him with his golden hook. Before he can, Luffy activated Gear Second and intercepted Crocodile. Crocodile reminded Luffy that they had a deal, to which Luffy responded that because Whitebeard was important to Ace, he would not let Crocodile touch him. Marco remarked to himself that Ace's brother was not half bad."}, {"type": "paragraph", "text": "Crocodile and Mr. 1 then fought through all that get in their way as Crocodile made his way towards Whitebeard. While many of Whitebeard's crew attempted to stop Crocodile from attacking the old man again, Crocodile brushed them aside with a sandstorm. Jozu then lunged at Crocodile, managing to strike Crocodile using haki."}, {"type": "paragraph", "text": "As Jozu attempted to attack Crocodile again with Diamond body, he was stopped by Doflamingo, who was riding on his back and controlling his movement. While Crocodile seemed antagonistic towards Doflamingo, Doflamingo asked if he and Crocodile could team up. However, Crocodile laughed at the offer and told Doflamingo that he was aware that Dolflamingo was asking him to be a subordinate. Doflamingo laughed at how he thought Crocodile had learned his lesson, to which Crocodile answered that if he had, he would not have escaped Impel Down in the first place. He then performed Sables, and blew Doflamingo away. The attack was not confined to Doflamingo, though, as Buggy was accidentally sucked into the vortex as well."}, {"type": "paragraph", "text": "When Squard stabbed Whitebeard and let everyone think that Whitebeard betrayed his allies in exchange for his own crew, Crocodile shouted at Whitebeard in disgust, claiming that he wasn't so weak during the last time they fought."}, {"type": "paragraph", "text": "Up on the execution platform, the guards were about to execute Ace. However, they were blown back by Crocodile. While Sengoku wondered why Crocodile would aid his own enemy, the former Shichibukai noted that he only did it because he did not want to see the Marines be satisfied. Suddenly, taking everyone by surprise, Crocodile's head came flying off of his body. Doflamingo, standing behind Crocodile, said that he was jealous that he had decided to collaborate with Whitebeard instead of him. Forming his head back onto his body, Crocodile responded by saying that he was not teaming up with anyone. Dolflamingo asks if this was the same as blowing him off, and Crocodile admits that it is. At this point Dolflamingo attacks Crocodile, who easily parries it with his hook."}, {"type": "paragraph", "text": "As Luffy was about to be attacked, Whitebeard's allies jumped in and protected him, telling him that he had to go on ahead while Whitebeard held the Marines off. Ivankov told Luffy that Whitebeard was putting all of his faith in him; Luffy answered by saying that he did not care about Whitebeard and that he was only there to save Ace. Dracule Mihawk attempted to attack Luffy, but was stopped by Mr. 1, who said that he was protecting him only by Crocodile's orders. After Mihawk struck Mr. 1 down, Crocodile interfered and protected his right-hand man, telling Mihawk to watch out because he was in a bad mood."}, {"type": "paragraph", "text": "Later, the Blackbeard Pirates took Whitebeard's life robbing Crocodile of his revenge since all Crocodile could do was observe his lifeless, but still standing body. When Admiral Akainu had Jinbe and Luffy cornered, Crocodile repelled Akainu. Crocodile revealed himself and used Sables to throw Luffy and Jinbe into the air claiming if they were gonna protect Luffy, they had to do it right. The duo flied until they plow into Buggy who was still escaping, much to his surprise. His followers thought he was actually trying to save them. Just as Buggy was fleeing, Akainu fired a magma fist at them but was stopped by the Whitebeard commanders who commented and proclaimed that they would protect Luffy. Crocodile was then seen standing alongside the Whitebeard Pirates and prepared to face off against Akainu."}, {"type": "paragraph", "text": "It is unknown what happened to him during the confrontation with Akainu, but he later appeared unharmed when Shanks was calling for a ceasefire between the the three factions. He and Mr. 1 slipped away from Marineford and escaped when Sengoku accepted the ceasefire because of Shanks' arrival."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8a/Crocodile_Tries_to_Kill_Whitebeard.png/revision/latest/scale-to-width-down/230?cb=20130526172516", "caption": "Crocodile attempts to kill Whitebeard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Jozu_vs._Crocodile.png/revision/latest/scale-to-width-down/230?cb=20130116150806", "caption": "Crocodile struck by Jozu's Brilliant Punk."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ea/Crocodile_Protects_Luffy_from_Mihawk.png/revision/latest/scale-to-width-down/230?cb=20130204210223", "caption": "Crocodile protects Luffy from Mihawk."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6c/Crocodile_vs._Sakazuki.png/revision/latest/scale-to-width-down/230?cb=20121205021516", "caption": "Crocodile attacks Admiral Akainu."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three weeks after the war, Crocodile and Daz Bonez were on an unidentified island in the Grand Line. Looking over the newspaper, he remarked that Luffy and Jinbe, right after having been saved, were committing foolish acts. Bonez commented that they must have some sort of plan or they were just being crazy, and then stated that Luffy suffered \"wounds\" that do not heal quickly. Crocodile contradicted Bonez's remark, replying that his (Crocodile's) \"wounds\" were already healed, and that he was heading back to the New World as proof. Crocodile invited his former subordinate to come with him and Bonez accepted without hesitation."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/86/Crocodile_and_Daz_Bonez_Post_War.png/revision/latest/scale-to-width-down/230?cb=20130510015738", "caption": "Crocodile reading about Luffy's return to and rampage at Marineford."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Over the last two years, Crocodile has successfully eluded any Marines sent to capture him and is currently hiding in the New World."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Crocodile read the newspaper. He appeared to be in an up-scale room with several guards gathered in the background."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0b/Crocodile_Reads_the_News_About_Luffy.png/revision/latest/scale-to-width-down/210?cb=20190331030408", "caption": "Crocodile reading the newspaper."}]}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "Crocodile came to Delta Island during the Pirates Expo hosted by Buena Festa. While the Expo was going on, he snuck into Festa's lair. There, he encountered Robin and Trafalgar Law and recruited Law into his plan to bring down Festa and his ally Douglas Bullet."}, {"type": "paragraph", "text": "Following Crocodile's plan, Law gathered up an alliance to defeat Bullet consisting of himself, Luffy, Boa Hancock, Sabo, and Smoker, and as they worked to attack Bullet's monstrous colossus, Crocodile stepped in and unleashed a sandstorm to help damage the colossus. When the alliance succeeded at destroying the colossus, Crocodile attempted to seize Bullet's treasure, an Eternal Pose pointing to Laugh Tale. However, he was stopped by Roronoa Zoro. Luffy proceeded to defeat Bullet, and Crocodile attempted to grab the Eternal Pose again, but Luffy destroyed it and left him empty-handed."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "One Piece Green: Secret Pieces revealed that an early concept of Crocodile was capable of making up very hard riddles, similar to the villain Riddler from DC Comics."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Crocodile_question_mark.png/revision/latest/scale-to-width-down/180?cb=20150404100051", "caption": "Early Crocodile with a hook the shape of a question mark."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Crocodile vs. Whitebeard (unseen)", "elements": []}, {"text": "Crocodile vs. Puppu", "elements": []}, {"text": "Crocodile vs. Monkey D. Luffy (Desert)", "elements": []}, {"text": "Crocodile vs. Tsumegeri Guards", "elements": []}, {"text": "Crocodile vs. Chaka", "elements": []}, {"text": "Crocodile vs. Monkey D. Luffy (Alabasta Palace)", "elements": []}, {"text": "Crocodile vs. Nico Robin", "elements": []}, {"text": "Crocodile vs. Monkey D. Luffy (Tomb of the Kings Mausoleum)", "elements": []}, {"text": "Crocodile, Monkey D. Luffy, and Jinbe vs. Minorhinoceros, Minokoala, and Minozebra", "elements": []}, {"text": "Crocodile, Mr. 1, and Jinbe vs. Marines (outside Impel Down)", "elements": []}, {"text": "Crocodile and Mr. 1 vs. Whitebeard Pirates", "elements": []}, {"text": "Crocodile vs. Donquixote Doflamingo vs. Jozu", "elements": []}, {"text": "Crocodile vs. Donquixote Doflamingo", "elements": []}, {"text": "Crocodile vs. Dracule Mihawk", "elements": []}, {"text": "Crocodile vs. Admiral Akainu", "elements": []}, {"text": "Crocodile, Andre, and Whitebeard Pirates Commanders (minus Ace, Jozu, and Thatch) vs. Admiral Akainu", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Crocodile, Lucci, Luffy, Hancock, Sabo, Law, Smoker, and Buggy vs. Bullet", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Appearance", "level": 3, "content": [{"type": "paragraph", "text": "In the manga, Crocodile's skin color is a more natural light skin color, as opposed to the anime's gray skin. In the manga, the poison hook beneath his golden one is far thinner than in the anime."}], "images": []}, {"title": "Impel Down Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the anime it is partially seen how Crocodile changes outfits, as his shoes are laced by the Emporio Ivankov's Dancers. In the manga, Minozebra is defeated by Crocodile's Sables, while in the anime he is defeated by Jinbe's Gosenmaigawara Seiken. In the manga, Minorhinoceros is defeated by Jinbe's Gosenmaigawara Seiken, while in the anime he is defeated by Crocodile's Sables."}], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the anime Crocodile mentioned that they were falling down out of the sky because of Ivankov. He is in fact blaming the okama, but this was proven wrong in the next episode, where it showed detailed explanation on what happened on their way to the war. The conversation between Akainu and the Whitebeard Commanders and Crocodile was extended in the anime."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the manga, when the world learns of Doflamingo's sudden resignation from the Shichibukai, Crocodile is not specifically shown or even confirmed to appear, only a shadowy figure with a long non-fur coat over his shoulders with a cigar in his mouth. In the anime, the cigar is removed but the coat was changed to Crocodile's trademark fur coat and Crocodile's golden hook is shown, confirming his identity in the anime."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids dub, Crocodile underwent several edits. After his first fight with Luffy, Crocodile dangled Luffy upside down with his hook instead of impaling him with it. Strangely, in the next episode of the dub, Luffy was right-side up with Crocodile's hook being around his neck, but was still hanging upside-down in some shots. Another edit Crocodile suffered was that instead of being weakened by Luffy's blood in the final fight, he was weakened by his sweat. In spite of this, it was roughly edited- there were a few frames where the blood can still be seen. Also, in the hidden tomb with Nico Robin, he merely hit her in the back. In the original version, he impaled her through the back."}, {"type": "paragraph", "text": "Additionally, scenes with Crocodile smoking cigars were cut. However, in one episode, 4Kids forgot to edit his cigar at one point. His personality was also changed to be much more sarcastic in the 4Kids dub, such as calling Luffy \"desert doodoo\". Also, due to cutting out the Little Garden arc, his feeding Mr. 3 to his Bwanigator was for pointless reasons, which itself was a plot hole as he said he ordered Mr. 3 to follow the Straw Hats since they left Loguetown when he didn't even know about them yet."}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Cultural References", "level": 3, "content": [{"type": "list", "elements": [{"text": "In a mock-trailer in the anime series Gintama in episode 50, a Crocodile lookalike of Kondou Isao (the stalker) is seen charging towards Shimura Tae. He is knocked away by a \"Gomu Gomu Pistol\" move pulled off by Tae as she yelled, \"Gomu Gomu\".", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "As a prominent character, he has been featured in the fan merchandise. Crocodile has been featured in the One Piece Anime Heroes and twice in the One Piece Gashapon Grand Battle sets. Crocodile has also been released in the P.O.P. Portrait of Pirates series. He's also appeared in One Piece Super Effect - Devil Fruit User, Super Effect Keychain, and One Piece The Combining Prison Impel Down!! with Jinbe. He has recently been released in the Figuarts Zero line."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f5/One_Piece_POP_Crocodile_Figure.png/revision/latest/scale-to-width-down/150?cb=20130222082834", "caption": "One Piece POP Crocodile figure."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Jump Ultimate Stars", "elements": []}]}], "images": []}, {"title": "Errors and Corrections", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the serialzation of a Cover Story Mini-Arc, Crocodile was once shown to have both hands, and no hook. This was corrected for the release of the volume and is now published with the hook correctly placed on his left arm.", "elements": []}, {"text": "In Episode 117 of the anime (roughly at timing 19:55), Crocodile was seen lighting his cigar with both hands (his hook is nowhere to be seen, and so are his numerous rings).", "elements": []}, {"text": "When Igaram first mentioned Crocodile's former bounty, he said it was 80,000,000. However, when Crocodile was introduced in person, his infobox said his bounty was 81,000,000.", "elements": []}, {"text": "In SBS Volume 56, a fan asked Oda why Crocodile was wearing his own clothes since he was still in prisoner clothes after he's released, Oda replied that he went to Newkama Land and got his clothes from there. This is depicted in the anime.", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His animal theme is the crocodile. His name, the Bananawani he kept as pets, and his large scar (which resembles a \"crocodile's smile\") are all reflections of this theme.", "elements": []}, {"text": "Miss Goldenweek's Rainbow Color Trap reveals that his dream was to become the Pirate King.", "elements": []}, {"text": "The soundtrack playing during Crocodile's defeat is Dvorak's New World Symphony, specifically the 4th movement, \"Allegro con fuoco\". It was the third time in the anime when a piece of classical music was played in the anime (The first being Buggy and Gaimon's farewell, during which Chopin's Etude in E Major played, the second being Dr. Hiriluk's last speech, during which Ave Maria was played and the fourth being when the zombies claimed Absalom as their leader, with Ludwig van Beethoven's rendition of (Ode to Joy).", "elements": []}, {"text": "Crocodile is the first Shichibukai to be defeated by Luffy.", "elements": []}, {"text": "In the 5th Japanese fan poll, Crocodile was ranked the 15th most popular character in One Piece.", "elements": [{"text": "In the sixth fan poll, he is ranked as the 18th most popular character.", "elements": []}]}, {"text": "Crocodile is the only one of the original Shichibukai to possess a Logia Devil Fruit.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Crocodile_Pirate_King.png/revision/latest/scale-to-width-down/230?cb=20080705092455", "caption": "Crocodile's dream revealed."}]}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Crocodile's birthday, September 5, comes from the Japanese transcription of his name's first and third syllables since 9-5 can be derived from cu-co.", "elements": []}, {"text": "It was noted that if the World Government had known that Crocodile was the head of Baroque Works, his bounty would be at least doubled to 162,000,000.", "elements": []}, {"text": "Crocodile's favorite foods are crocodile meat and tomatoes, while his least favorite food is ketchup.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Crocodile - The animal Crocodile is named after.", "elements": []}]}], "images": []}]}