{"sections": [{"title": "Squard", "level": 1, "content": [{"type": "paragraph", "text": "\"Maelstrom Spider\" Squard is an infamous New World pirate captain who allied with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Squard is a pale, slim man of average height. He has a bald top, but light-pink wavy hair that flows long downwards. He is often seen sticking his tongue out and has sharp teeth."}, {"type": "paragraph", "text": "He wears a spider design on his forehead which has a spiral at the bottom, with a diagonally-placed headband that attaches to it. He wears a dark grey, long coat with ruffled edges over a similar designed, lighter-colored shirt, and dark pants that almost reach his armpits, with some buckles and strings on the front, tucked inside boots, and with ruffled, lighter-colored edges as well. Around his neck he has a dark red tie. For footwear, he wears high-heeled black boots with loose white cloth coming down from the openings."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Squard_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180911014156", "caption": "Squard's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Squard is a person of loyalty, as he swore allegiance towards the Whitebeard Pirates and was willing to risk his own life to save his friend, Portgas D. Ace. He was also very hurt when he lost his faithful crew to Gol D. Roger, and felt lost and sad until joining forces with the Whitebeard Pirates."}, {"type": "paragraph", "text": "However, Squard tends to hold grudges of his past. He developed a hatred towards Roger for killing his old crew, and this hatred extended to Roger's son, Ace. Squard felt betrayed when he found out all of this, and due to this shock and hatred, the then Admiral Akainu was easily able to deceive Squard into thinking that Whitebeard was plotting to betray all of his subordinate crews. When Whitebeard kindly told him not to hold children accountable for the sins of their fathers, Squard discarded his philosophy of children inheriting their parents' sins."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Gol D. Roger", "level": 3, "content": [{"type": "paragraph", "text": "Before the Pirate King was executed 24 years ago, he killed all of Squard's loyal crewmates, all of whom fought by their captain's side faithfully. Their loss made Squard hate Roger deeply, a hatred that was well known to both Whitebeard and the Marines."}], "images": []}, {"title": "Whitebeard Pirates", "level": 3, "content": [], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "After losing his entire crew to Roger, Squard was taken in by Whitebeard, who treated him like a son, and saved him from the loneliness of losing all of his crew. Squard, in return, thought of Whitebeard as a father figure, but felt betrayed when he was tricked into thinking that Whitebeard was planning to sacrifice all of his subordinates to save Ace, and tried to assassinate him. When Whitebeard proved otherwise, Squard broke down in tears for his mistakes. He later attempted to redeem himself at the cost of his own life by charging head-first into battle, to which Whitebeard himself reprimanded him for."}], "images": []}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "Squard managed to befriend Ace, who was a member of the Whitebeard Pirates that Squard allied himself with. Of course this was before learning of Ace being the son of Gol D. Roger, which when he did, Squard felt betrayed and a fool for it. Seeing Whitebeard treat Ace as something special made the impact even harsher. To this end, he was fully prepared to believe Akainu's lies regarding Whitebeard's false betrayal. When Whitebeard claimed that Ace is no different than any other of his sons, Squard broke down in tears."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Squard has managed to make himself an infamous reputation in the New World, becoming Whitebeard's subordinate in the process. His strength or ability as a captain seems to be highly respected by Whitebeard, as he was Whitebeard's first choice in leading the counter attack against the Marines. He is also a veteran from Roger's time."}, {"type": "paragraph", "text": "Squard is a swordsman, and he wields a normal sized katana and an oversized one, the latter of which he used to stab through Whitebeard's chest. Taking advantage of Whitebeard's trust, Squard managed to get one sneak attack on the great pirate, something that Marco claimed was usually impossible (albeit Marco also claimed that Whitebeard could have predicted the attack with ease in his younger days). Also, he quickly retaliated after Marco slammed his head down on the deck in an attempt to immobilize him, although this was not depicted in the anime. As a testament of his skill he sustained no injuries from the war."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "While Gol D. Roger was still alive, he killed all the members of Squard's crew, which led Squard to carry an intense hatred towards the Pirate King. Sometime later, he was taken in by Whitebeard, Roger's enemy, at which time he was all alone. Squard befriended Ace, without the knowledge of Ace being the son of his greatest enemy, and rebuilt his crew."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Squard and his crew are first seen, along with a fleet of 42 other infamous pirate crews, allied with the Whitebeard Pirates, attacking Marineford to save Portgas D. Ace from his execution. When Whitebeard changed his strategy due to Ace's execution being moved to an earlier time, he tried to contact Squard to have him lead the New World pirate subordinates to attack the Marine battleships. However, according to Squard's crew, he had disappeared to an unknown location, leading Whitebeard to contact the Decalvan Brothers instead."}, {"type": "paragraph", "text": "Squard appears on Whitebeard's ship, apologizing for being absent when Whitebeard needed him. As Whitebeard announces that he will now join the fray himself, Squard pledges his continued allegiance to Whitebeard, saying that he will continue to help him. However, to Whitebeard's surprise, Squard suddenly impales him through the chest with his blade."}, {"type": "paragraph", "text": "Marco immediately attacks him and demands the reason for Squard's actions. Squard claims that Whitebeard had betrayed him twice: the first being when he did not tell him that Ace was the son of Gol D. Roger, the man Squard hates the most for having killed his first crew; the second being when he sold out his New World subordinates to the Marines for saving Ace."}, {"type": "paragraph", "text": "Admiral Akainu, had in fact following the orders of Sengoku, deceived Squard, using his shock of knowing Ace's origins against him, and making him believe Whitebeard's betrayal. Having understood this, Whitebeard hugs Squard, telling him he loves him anyway, and begins his last attack against the Marines, leaving Squard on the Moby Dick on his knees, lamenting from his mistake. Seeing Squard on the ground sobbing, Marco suggests that he redeem himself."}, {"type": "paragraph", "text": "After Ace was rescued by Luffy and Galdino, he uses the black paddleship to charge towards the battlefield, so that the Whitebeard Pirates along with the subordinates could escape while he was fighting the Marines. Squard states that this is not enough to redeem himself and continues to fight, or else he can never forgive himself."}, {"type": "paragraph", "text": "When Whitebeard stops the ship, Squard seems surprised. When Whitebeard says that it's not the right way to have a son die before his father, Squard seems moved. Whitebeard then states that Squard shouldn't be so overconfident in himself, since his \"pesky stab\" hardly harmed Whitebeard at all."}, {"type": "paragraph", "text": "He is later seen watching Akainu taunting Ace, telling him that Whitebeard ended up being wounded by his own ally (referring to Squard himself)."}, {"type": "paragraph", "text": "When the Blackbeard Pirates launched a fatal barrage of bullets and blades at Whitebeard, Squard was seen wailing in grief alongside the rest of Whitebeard's subordinates."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3f/Squard_Stabs_Whitebeard.png/revision/latest/scale-to-width-down/248?cb=20141206162020", "caption": "Squard stabs Whitebeard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Whitebeard_Forgives_Squard.png/revision/latest/scale-to-width-down/210?cb=20141206161937", "caption": "Whitebeard hugs and forgives his 'son'."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Squard and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World. During the funeral, Squard cried at the deaths of Whitebeard and Ace."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Maelstrom Spider Pirates crew vs. Roger Pirates (unseen)", "elements": []}, {"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Squard vs. Marine Officers", "elements": []}, {"text": "Squard vs. Admiral Akainu (before making a deal)", "elements": []}, {"text": "Squard vs. Edward Newgate (temporary betrayal)", "elements": []}, {"text": "Squard vs. Marco (temporary betrayal)", "elements": []}, {"text": "Squard vs. Marine Officers", "elements": []}]}]}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, an additional flashback about Squard was shown that did not exist within the manga. After his crew was slaughtered by Roger, Squard was seen injured among the burning rubble while the Oro Jackson departed. The flashback showed Squard in a state of depression, in which he got drunk in bars from time to time, called out for Roger while throwing tantrums, and caused massive damage. During one of these incidents, Whitebeard approached Squard and stopped his rampage, while adopting him as a son. Also, in the same episode, brief flashbacks of Squard's interactions with Ace are shown when Whitebeard hugged Squard and made him recall all those times of joy and pain that he experienced together with Ace."}, {"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, Squard cannot be seen among those in attendance. However, the anime version of the exact scene in Episode 505 explicitly shows Squard alongside the other attendees. Although it can be assumed that Squard was at the funeral, there is no visual evidence of his attendance in the manga to support this assumption and, as such, his attendance can only be considered non-canon."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise SP", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 551 and Episode 460, Squard is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 92), Squard's birthday is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Information about Squard is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Squard's name is romanized.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, Squard attends Whitebeard and Ace's funeral.", "elements": []}, {"text": "↑  One Piece Anime — Episode 472, Squard reliving his past on how he met Whitebeard.", "elements": []}]}], "images": []}]}