{"sections": [{"title": "Wild Joe", "level": 1, "content": [{"type": "paragraph", "text": "Wild Joe is one of the main antagonists of Oda's one-shot Wanted! He is killed early in the story and is a ghost for the rest of it."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "When he was alive, he wore a light colored coat, with a brown shirt underneath. He also had a black bandana around his neck, and a brown cowboy hat. He also has light colored pants and shoes."}, {"type": "paragraph", "text": "As a ghost, he was much smaller, and has a ghost like tail instead of legs. He wore a white robe, and his cowboy hat was gone."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "After being killed by Gill Bastar, he wanted to get revenge on him from the afterlife by possessing his body. He still wanted revenge, even when he finally passed in the afterlife."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He claimed to be the best bounty hunter around, but he was defeated rather easily by Gill. He seemed to be proficient in using a gun."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "One day, he saw Gill Bastar, who had a high bounty for killing people. He attempted to kill Gill, but was killed himself."}, {"type": "paragraph", "text": "After being killed, he reappeared as a ghost. Thinking that Gill could not see him, he followed him around and insulted him. Gill then turned around and yelled at him to shut up. Surprised, Joe swore his revenge on Gill and followed him into the desert."}, {"type": "paragraph", "text": "Joe and Gill then talked about Sino Phoenix and exchanged information on him. They later walked into town and went to the bar for a drink. Joe floated in between Gill and another man, whom he recognized as Sino. Joe warned Gill about Sino and Gill made a quick escape before Sino saw him."}, {"type": "paragraph", "text": "Joe, wanting revenge on Gill, decided to possess Gill's body and force him to challenge Sino to a gunfight. After Gill killed Sino, Joe's spirit disappeared and passed on."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Joe's wanted poster can be seen among others in Fullbody's ship, at the Gold Roger Bar in Loguetown, and at the beginning of One Piece Movie 9. His bounty is 2,000,000. His wanted poster can also be seen in Whiskey Peak in the anime, when Zoro and Luffy were fighting and Vivi rode into the middle of the fight. Once the situation calms down, the wanted poster can be seen.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/46/Wild_Joe_bounty.png/revision/latest/scale-to-width-down/160?cb=20121209071347", "caption": "Wild Joe's wanted poster."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Wanted - Wild Joe makes his debut.", "elements": []}, {"text": "↑  One Piece Movie 9, Joe's bounty is shown.", "elements": []}, {"text": "↑  One Piece Anime — Episode 45.", "elements": []}, {"text": "↑  One Piece Anime — Episode 48.", "elements": []}, {"text": "↑  One Piece Anime — Episode 66.", "elements": []}]}], "images": []}]}