{"sections": [{"title": "Issho", "level": 1, "content": [{"type": "paragraph", "text": "Issho, commonly known by his alias Fujitora, is a Marine admiral. He was conscripted into the Marines through a World Military Draft during the two-year timeskip along with fellow newcomer Ryokugyu, both filling the two vacancies in the admiral positions caused by Kuzan's resignation and Sakazuki's promotion."}, {"type": "paragraph", "text": "Fujitora was first mentioned by Sakazuki when the latter was first discussing plans to deal with Monkey D. Luffy and Trafalgar Law. His following mission and actions on Dressrosa made him the first admiral to make an appearance after the timeskip and the secondary antagonist of the Dressrosa Arc."}, {"type": "paragraph", "text": "Much like his predecessor, Kuzan, Fujitora is strongly against the Marines' dogma of \"Absolute Justice\" and extremely vocal in his opposition of it. His disgust with the corruption and evil in the world is such that he intentionally blinded himself many years ago so as to avoid ever seeing it again. He particularly holds strong disdain for the Shichibukai system, longing to disestablish it, and after learning about the horrific atrocities committed by Donquixote Doflamingo of the Shichibukai in Dressrosa, Fujitora formally apologized to King Riku and his citizens on behalf of the Marines in front of the world, thus infuriating Sakazuki and risking his admiral position."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Fujitora is a blind man with only the whites of his eyes showing, though he usually keeps both eyes closed. He has an X-shaped scar centered on the left side of his forehead that stretches over both eyes, which was actually self-inflicted due to his decision to blind himself. He has short dark hair, a mustache, and a beard. He seems to be very tall, a trait shared with other admirals."}, {"type": "paragraph", "text": "Like other admirals, Fujitora sports the standard marine coat with his personal clothes underneath, wearing the coat on his shoulders like a cape with his arms not in the sleeves. His sleeves cuffs are purple. While previous admirals and other high-ranked marines wear the conventional suit and tie underneath their marine coats, Fujitora opts for a light-purple yukata held up with a dark purple belt, all underneath a purple cloak, matching the color in his alias. Fujitora wields a shikomizue (a Japanese swordstick) that doubles as a cane for his blindness, and also wears geta sandals. He has white bandages wrapped around both of his forearms, with handguards on both hands."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Fujitora appears to be a reasonable man that is very trusting of people, as seen when he actually believed that he kept losing at roulette purely by chance. The moment he was told that he was being cheated and that the swindlers tried to kill Luffy for revealing their trickery, he retaliated mercilessly and stated that being blind spared him from seeing the corruption in the world. In fact, it was he himself that cut his own eyes to avoid seeing such evil. As per his own standards of virtuousness, Issho has taken on the motto of \"Moral/Virtuous Justice\" (仁義ある正義, Jingi aru Seigi) in the Marines."}, {"type": "paragraph", "text": "He also takes responsibility for the collateral damage he inflicts, as shown when he compensated the shop owner for the damages he caused when creating a massive crater to attack the swindlers. He appears to follow his own ideals instead of adhering to the Marines' doctrine of Absolute Justice. However, he still follows the law, as he chose to spare Caesar Clown simply because he was a subordinate working under Donquixote Doflamingo, although he did understand that Doflamingo could be up to something and desired to investigate further into the problem if it were not for the law and lack of solid evidence."}, {"type": "paragraph", "text": "He is rather modest, as he barely commented on the remarks Doflamingo and Law made on his formidable reputation and display of power. Nevertheless, Fujitora has a sense of pride that prevents him from going back on his word and standing by his decisions, refusing to apologize to Sakazuki after their heated argument for letting Luffy and Law escape."}, {"type": "paragraph", "text": "During the first time he was seen in battle, Fujitora was shown to be willing to use excessive force, as he summoned down a meteor to attack both Law and Doflamingo. Doflamingo even commented that he does not hold back."}, {"type": "paragraph", "text": "Fujitora is also an extremely compassionate man, gentle and soft-spoken towards his subordinates. Despite being one of the highest ranking marines, Fujitora exhibits immense concern for innocent civilians, prioritizing their safety over his duty to arrest and punish criminals, unlike his superior Sakazuki and most other high-ranking marines, such as Vice-Admirals who are ruthless to the point of sacrificing their own subordinates for the sake of killing criminals."}, {"type": "paragraph", "text": "Despite his responsible personality, he seems to enjoy gambling and is not entirely serious with his duties, as he was playing roulette even when he was supposed to be apprehending Luffy and Law. Gambling seems to be a big theme in his personality, as he often makes gambling references and analogies as part of his conversations. On top of this, he makes many very big gambles during combat, even sometimes gambling the safety of others. When he brought a meteor down on Green Bit, he was not completely sure that Trafalgar Law and Doflamingo were powerful enough to prevent the island from being obliterated. He launched both his battleship and a meteor at the Straw Hats, not accounting for Law and his abilities. He brought down yet another meteor on Dressrosa itself while the bird cage was active, not understanding that the cage would actually split the meteor into pieces, thus widening the impact of the blast and endangering more people."}, {"type": "paragraph", "text": "Another trait Fujitora displayed is his ability to remain calm. Even when one of his own meteorites was sent flying back at his ship, he was calmly slurping a bowl of soba noodles acting as if nothing was happening while his whole crew was in panic and even commenting on his choice of timing for a meal."}, {"type": "paragraph", "text": "Though Fujitora is normally calm and serious, he has also displayed a sense of humor unlike most admirals, and even exaggerated comedic expressions, contrary to the realistic expressions and designs the admirals share. When Luffy took him on in a one-on-one fight, Fujitora was amused by the fact that Luffy started calling out his own attacks in battle, not to patronize him because of his handicap, but because Luffy had taken a liking to Fujitora and wanted an earnestly fair fight with the admiral. After realizing this, he cracked up and started laughing, which Luffy, however, found annoying."}, {"type": "paragraph", "text": "At one point in his life, Fujitora grew so disgusted with seeing all the evil in the world that he decided to take his own eyes. However, he later regrets this decision, as he was unable to see the face of the man whom so many are willing to risk their lives to protect. He also gets very offended when enemies patronize him because of his blindness and hold back against him, or show pity towards him."}, {"type": "paragraph", "text": "Fujitora is also a man of his word and follows his own rules, and sometimes makes his decisions based on a roll of a dice that he always carries wherever he goes. For example, he used a dice to determine whether or not to pursue Luffy and his crew following the downfall of Doflamingo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Issho_laughing.png/revision/latest/scale-to-width-down/180?cb=20160529052500", "caption": "Fujitora laughs at Luffy's absurd behavior in battle."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "As an admiral of the Marines, Fujitora is deeply respected within the organization. He has compassion for his subordinates, and many Marines, including Vice-Admirals Bastille and Maynard, held strong respect for Fujitora. When several Marines fell under the control of Doflamingo's Parasite technique, Fujitora opted to use his gravity powers to restrain them, rather than using lethal force to stop them. Fujitora prostrating before King Riku to apologize for the World Government's irresponsibility prompted his Marines to follow suit, which was a strong contrast to Sakazuki's concern about the Marines' dignity."}], "images": []}, {"title": "Sakazuki", "level": 4, "content": [{"type": "paragraph", "text": "He seems to be trusted by Fleet Admiral Sakazuki, who sent him to deal with the Straw Hat Pirates' and Heart Pirates' alliance, with the two captains of the groups being a notorious pirate and a Shichibukai respectively. Sakazuki even apologized to Fujitora when he informed him about Donquixote Doflamingo's false resignation from the Shichibukai. However, Sakazuki became furious when Fujitora admitted that the Straw Hat Pirates defeated Doflamingo and apologized on his knees on behalf of the marines in full view of the world. He demanded that Fujitora does his job and to kill Luffy and Law, threatening to make sure no marine base will allow him in until the task was done. Fujitora, who was disgusted at the actions of the Marines until now - including but not limited to the World Government attempting to give credit to the Marines for Crocodile's defeat and turning a blind eye to Doflamingo's actions in Dressrosa - told Sakazuki that he was honored to fulfill his orders. Because of this, Fujitora refuses to apologize to Sakazuki for their heated argument, despite Sengoku suggesting that it would make Sakazuki forgive him."}], "images": []}, {"title": "Smoker", "level": 4, "content": [{"type": "paragraph", "text": "Fujitora also seems to be close to Smoker, who also shares his belief that the Shichibukai system should be abolished. Smoker and Tashigi praised Fujitora for not allowing the incident with Doflamingo in Dressrosa to be covered up, like it was with Crocodile in Alabasta."}], "images": []}, {"title": "Sengoku", "level": 4, "content": [{"type": "paragraph", "text": "Fujitora and Sengoku seem to be amiable towards each other. Sengoku reveals he knows Fujitora purposely allowed Luffy and Law to escape and defeated the pirates menacing them. He chooses not to report it and notes Sakazuki would forgive him if he apologized. He respects Fujitora's refusal to heed his advice and seems to be amused when the Admiral goes to Mary Geoise despite Sakazuki's outrage."}], "images": []}, {"title": "Ryokugyu", "level": 4, "content": [{"type": "paragraph", "text": "Fujitora and Ryokugyu appear to be on good terms as Ryokugyu disregarded Sakazuki's orders to drive Fujitora out of Mary Geoise and instead had a friendly conversation with his fellow admiral."}], "images": []}, {"title": "World Government", "level": 3, "content": [{"type": "paragraph", "text": "Despite technically being a servant of the government, Fujitora utterly despises the World Government and their actions. This was made apparent during Doflamingo's Birdcage game, as Fujitora noted how the government continues to ignore the citizen's cries when they are truly in trouble and that if he, a Marine admiral, arrests Doflamingo, then the government could cover the ordeal like they did in Alabasta. Not wanting them to cover it up like before, Fujitora purposely humiliated the government by bowing before Riku Doldo III and giving a heartfelt apology on behalf of the government. This action utterly infuriated the Five Elders and Fleet Admiral Sakazuki and put Fujitora's title as admiral on the line."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Shichibukai", "level": 4, "content": [{"type": "paragraph", "text": "Despite the fact that the Shichibukai are on the World Government's side, Fujitora, like Smoker, believed that the Shichibukai are nothing more than pirates who cannot be trusted and is willing to abolish the Shichibukai's system, which came into fruition."}], "images": []}, {"title": "Pirates", "level": 4, "content": [{"type": "paragraph", "text": "As a marine, he views pirates as enemies, although he is more flexible than most marines and is able to look past them and see their good qualities. He was willing to acknowledge Luffy's character for his help with the swindlers, and felt obligated to fight him because he considered it \"biting the hand that feeds him\". However, he puts the civilians' safety above the pirates' arrest. When he realized that he was being cheated by some of Doflamingo's underlings, he quickly took care of them."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Despite being enemies, Luffy helped Fujitora when Doflamingo's thugs were cheating due to his blindness and thanked Luffy for his kindness. However, during Doflamingo's Birdcage game, Fujitora was going to hinder Luffy and his allies from reaching Doflamingo, but he was stopped by Sabo. He then allowed Luffy to defeat Doflamingo. During the Straw Hat Pirates and allies' escape, Fujitora fought against Luffy until they escaped. When Fujitora attempted to drop the rubble on Luffy, he was stopped by the cheering citizens of Dressrosa and decided to let Luffy go. Seeing how the citizens tried to help Luffy, Fujitora smiled and admitted that he should not have blinded himself because he wanted to see what Luffy's face looks like. When Doflamingo's business associates attempted to kill Luffy, Fujitora dropped the rubble on the enemy fleet as a farewell gift for Luffy and thanked him for cleaning up the World Government's mess."}], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Despite having been sent to help him, Fujitora was very mistrustful of Doflamingo, having heard rumors of Doflamingo's illegal activities which contributed to his desire to end the Shichibukai system. He made it clear to Doflamingo that he was helping him in order to protect Dressrosa, namely its citizens, from Luffy and Law rather than out of a desire to help the Shichibukai himself. When he and Doflamingo confronted Law, Fujitora showed little regard for Doflamingo when he called down a meteor onto the scene, and he openly talked about Doflamingo's suspicious activities and his own desire to end the Shichibukai system, which annoyed the Shichibukai and even caused him to attack the admiral once. Although Fujitora is an admiral, Doflamingo was cocky around him, expecting Fujitora to help him against Luffy and Law no matter the situation and even believing that he could dispose of the admiral once he trapped everyone in the Birdcage. When Doflamingo's illegal activities were eventually put on full display, Fujitora did not go after the Shichibukai, as he did not want the World Government to fix a problem that they themselves had created. He went after Doflamingo's enemies for a brief period of time during this, but later stopped going after Luffy and Law and bet on them to stop Doflamingo. Once Doflamingo was defeated, Fujitora had the Shichibukai arrested immediately."}], "images": []}, {"title": "Revolutionaries", "level": 4, "content": [{"type": "paragraph", "text": "Due to being an officer in the Marines, he is an enemy of the Revolutionary Army. As such, he and his battalion engaged Sabo when he impeded their capture of Luffy. He personally clashed with Dragon's second-in-command. Despite this opposition, he confesses to Sabo it is not possible for the Marines to stop Doflamingo, and leaves the Heavenly Demon's defeat to the pirates. However, they later have another confrontation at the Levely when Sabo and his comrades attempted to rescue Bartholomew Kuma from his enslavement by the World Nobles."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Riku Doldo III", "level": 4, "content": [{"type": "paragraph", "text": "Fujitora has a great respect for King Riku and made the same bet as him. After Doflamingo's defeat, Fujitora told him not to take responsibility and bowed down towards him to apologized for the World Government allowing a vicious pirate to become one of the Shichibukai and take over Dressrosa. Riku asked Fujitora raise his head until he found out the reason Fujitora couldn't attack Doflamingo at the palace. Fujitora claimed this is not the Marines' victory. They apparently have maintained cordial relations as Issho requested to have a private conversation with him before the Levely commences."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "In terms of combat strength, Fujitora is considered to be one of the strongest fighters within the entire World Government structure, as an admiral is considered the \"Greatest Military Power\". Fujitora is at least strong enough to have Sakazuki's confidence in dealing with both Monkey D. Luffy and Trafalgar Law, two members of the Worst Generation. Alongside Sengoku and Tsuru, he was able to defeat Jack, a right-hand man of the Yonko Kaido with a bounty of 1,000,000,000."}, {"type": "paragraph", "text": "Despite being blind, Fujitora has proven to be able to handle himself extremely well in battle, as he was still able to perfectly time his defense against the meteor he summoned and deflected it without a problem. According to Doflamingo, Fujitora and Ryokugyu are two very formidable and venerable beasts within the Marines. His strength was also admired by Monkey D. Luffy, when the latter watched his fight against Doflamingo's thugs. When Doflamingo tried to attack him, he showed absolutely no concern and easily blocked his attack. A testament to his fighting skills was that he was able to fight against Sabo, the chief of staff of the Revolutionary Army to a standstill and emerge without a scratch on him. This is a noteworthy feat given his opponent recently acquired a Logia class fruit before their fight, and it is also notable since Sabo had defeated Jesus Burgess without sustaining any injury after nearly killing one of the Yonko's highest ranking subordinates with ease."}], "images": []}, {"title": "Leadership", "level": 3, "content": [{"type": "paragraph", "text": "As an admiral, Fujitora has command over the many thousands of soldiers ranked lower than him, his status being second highest within the entire Marine organization, just below Fleet Admiral Sakazuki. He also has the power to initiate a Buster Call on any island he deems to be a threat, as well as grant lower ranking World Government agents such a privilege. As an admiral, he has the authority to revoke a Shichibukai's title."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Fujitora is incredibly resilient, having guarded from a Haki-imbued Gear Third Punch without the use of his own Haki while taking no damage."}, {"type": "paragraph", "text": "Fujitora possesses immense physical strength, as shown when he was able to defend against extremely powerful attacks from Zoro and Luffy without visible effort."}, {"type": "paragraph", "text": "Fujitora has great reflexes, and combined with his skill in Kenbunshoku Haki, Fujitora could swiftly defend against an unexpected kick from Doflamingo without any effort. In the anime, he was able to catch and stop Doflamingo's Parasite string before it could take control of him while casually sitting down, while most people easily fall victim to the same attack."}], "images": []}, {"title": "Senses", "level": 3, "content": [{"type": "paragraph", "text": "He appears to have excellent hearing, as he was able to hear lightning from Nami's Clima-Tact while she was far away from his position, something that Doflamingo wasn't able to detect. He also stated that he is able to sense the movement of clouds."}, {"type": "paragraph", "text": "In the anime, Fujitora is also shown to be very good at gambling, having won many games in roulette before the owners started to cheat him out of his money. In roulette, he seems to be relying on his sharp hearing and sense of gravity to predict the outcome. The only reason he was losing was because he was being cheated by thugs who were taking advantage of his blindness."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "While other admirals have been shown to mostly rely on their Devil Fruit abilities in battle, Fujitora wields a shikomizue (a cane sword) in tandem with his Devil Fruit ability. The connection between these two factors has yet to be explained, though it seems he channels his power through the sword, as shown when he pointed the blade at Trafalgar Law to create a gravitation field to pin down the young pirate and cause a rock to crumble."}, {"type": "paragraph", "text": "Fujitora wields his sword in a reverse-grip style, with the blade pointing in the direction opposite of his thumb. Despite his blindness, Fujitora has shown to be an extremely powerful and skilled swordsman, able to skillfully block powerful attacks, as he was able to parry Zoro's powerful flying slash that was strong enough to bypass the incredibly heavy gravitational force generated from his Devil Fruit abilities and blast Fujitora himself away a considerable distance, as well as defend against Luffy's Elephant Gun, which is strong to defeat a giant Kraken. In a hostile conversation with Doflamingo, Fujitora easily defended himself from an unexpected kick from the Shichibukai, showing incredible power and lightning fast dexterity in his swordsmanship. His swordsmanship, combined with his Devil Fruit powers, allow him to fight equally with Sabo, an immensely powerful fighter wielding a staff enhanced by flames generated from the Mera Mera no Mi without any injuries at all, a tremendous feat as Vice-Admiral Bastille, a highly skilled swordsman wielding the Same-kiri Bocho, and Jesus Burgess, who is one of the most powerful members of the Blackbeard Pirates, were completely defeated by Sabo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7c/Fujitora_vs._Zoro.png/revision/latest/scale-to-width-down/210?cb=20180516072818", "caption": "Fujitora uses his sword to create a massive hole with his Devil Fruit."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Fujitora ate the Zushi Zushi no Mi, a Paramecia-type Devil Fruit that allows him to manipulate gravity around a chosen location at will by sending gravitational forces. Every time he uses this ability, he draws his sword. He regularly uses this ability to precipitate giant meteorites from the sky or, as shown at Green Bit, uses it to increase the force of gravity and immobilize an opponent on the ground."}, {"type": "paragraph", "text": "Fujitora can also reverse gravity to create a circular barrier around him that repels all attacks or to levitate a battleship similar to Shiki's Fuwa Fuwa no Mi. He can also levitate a rock and use it as a mobile platform. Fujitora is also able to use gravity to attack horizontally, consequently hitting opponents and everything around him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Zushi_Zushi_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20160529113354", "caption": "Fujitora uses his power to lift rubble."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all Marines ranked vice admiral or higher possess Haki."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Fujitora could clash head on physically with Sabo, a Logia-class Devil Fruit user and also a proficient Busoushoku Haki user, demonstrating an extremely high level of skill in Busoshoku Haki. He could focus a strong concentration of Busoshoku Haki into his sword, turning it obsidian black and making it strong enough to defend against the razor sharp threads of the Birdcage, which can slice cannonballs and buildings with great ease."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fe/Issho_Using_Busoshoku_Haki.png/revision/latest/scale-to-width-down/210?cb=20160911160648", "caption": "Fujitora imbuing his sword with Busoshoku Haki."}]}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Fujitora is also masterful in Kenbunshoku Haki, which he uses to compensate for his blindness in battle. His incredible skill in Kenbunshoku Haki gives him a strong sense of danger. He can accurately predict fast attacks from enemies, such as an unexpected kick from Doflamingo. In the anime, he could sense Doflamingo's fast Parasite thread and even grabbed it before it took control of him. He also correctly sense an enraged Pica preparing to attack before his subordinate pointed out to him. In his fight with Sabo, he could keep track of Sabo's extraordinary agility which is enhanced by the fire based powers of the Mera Mera no Mi, but the most prominent example is his capability to see his surroundings in a form of an aura which is not impeded by his blindness. Similar to Otohime, Fujitora can also read and hear the true thoughts and emotions of other people, as he was made aware that the Dressrosa citizens had no ill will towards Luffy while they were \"chasing\" him at the Dressrosa coast."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Issho is from the Grand Line. Aside from that, not much is known about his past, but at some point in his life, Issho intentionally blinded himself when he became disgusted with all the evil and corruption he had seen in the world. At some point in his life, Issho ate the Zushi Zushi no Mi."}, {"type": "paragraph", "text": "Sometime during the two years when the Straw Hat Pirates were separated, he was promoted to the rank of Admiral in the World Military Draft. He joined the Marines because he wanted many things to come to fruition, one of which is to end the Shichibukai system."}, {"type": "paragraph", "text": "At some point, he spoke to Smoker, who revealed to him what had happened at Alabasta. He also listened to Smoker's frustration over how the World Government covered up the incident."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Fujitora was dispatched to Dressrosa by Fleet Admiral Sakazuki in order to deal with Monkey D. Luffy and Trafalgar Law."}, {"type": "paragraph", "text": "In a restaurant in Acacia, Fujitora was gambling with some of Doflamingo's men that were cheating. Luffy called the thugs' bluff and helped Fujitora. After giving his thanks to Luffy, he unsheathed a sword from his cane. As the thugs were crushed and collapsed into a hole in the ground, he said that being unable to see the world's filth could be considered an advantage of being blind. Everyone stood in awe after his display of power, the crew speculated that he must definitely have some Devil Fruit ability and Luffy immediately asked outright who exactly he was. Fujitora laughed and stated that for both their sakes it would be unwise to reveal who he is. As he walked off, he gave the bartender a piece of paper and told him to forward all the damage claims to the address on it."}, {"type": "paragraph", "text": "Later at the Corrida Colosseum, he was scouting out all of the big names competing in the monthly tournament, and told his subordinates that they should leave. He requested three battleships and a large number of medical officers and said that he would go to Green Bit first. Then, he asked his subordinate about the number of spectators as well as the populations of the town and country. When his subordinate asked why that was needed he replied that before counting the number of enemies, they should count the number of people needing protection."}, {"type": "paragraph", "text": "At Green Bit, Fujitora lead his men to the southern beach where Law and Caesar Clown were present. On the way, he was contacted by Sakazuki, who informed him that Doflamingo's resignation was a false report. Fujitora and his subordinates arrived at the exchange site at the same time as Doflamingo. While Law and Doflamingo were exchanging words, such as how their negotiations were off, Fujitora noted Caesar's presence. Upon seeing Fujitora, Doflamingo commented on how he and Ryokugyu are beasts in terms of power. Fujitora explained that he is aware that Doflamingo was not following the rules as a Shichibukai and that he noticed that Caesar referred to Doflamingo as Joker. Doflamingo simply replied that if the admiral wants to investigate him, he had better be prepared to back up his claims. Fujitora then turned his attention to Law and stated that Law would be forgiven if the Straw Hats were his subordinates. After Law declared that he and Luffy are indeed in an alliance, Fujitora took away Law's Shichibukai title and used his gravity ability to bring down a meteor. Before the meteor impacted, Fujitora, Doflamingo, and Law used their abilities to reduce the meteor to pieces. After emerging unscathed, Fujitora, Doflamingo, and Law faced each other in a three-way confrontation."}, {"type": "paragraph", "text": "As the fight went on, Fujitora continued unleashing devastating attacks. Once Law was overwhelmed, Fujitora sat next to Law's injured body, holding him down with his gravity ability, as Doflamingo explained the history of the Donquixote Family. Fujitora later commented that he heard lightning in the distance, much to Doflamingo's confusion since the weather seemed fine. Law realized that Nami's group was approaching Green Bit and told Doflamingo that he never said that the heart he was holding belonged to Caesar. Doflamingo squeezed the heart to confirm, and a nearby Marine started to scream in pain. Law quickly used this opportunity to escape by using his Devil Fruit. Fujitora calmly sat still as Law grabbed Caesar and fled, with Doflamingo in hot pursuit of him."}, {"type": "paragraph", "text": "He later sent a Marine ship flying towards the Thousand Sunny while attacking the Straw Hats' ship with meteors. Law redirected one of the meteors to the Marine ship, dealing significant damage to it. As a Marine reported the damage, Fujitora casually commented on his own miscalculation while slurping a bowl of noodles. To his men's surprise, Fujitora ordered them to head back to Dressrosa, musing on how the tides have turned."}, {"type": "paragraph", "text": "When a Marine told Fujitora that a fight just broke out in the middle of town, he, with a concerned look on his face, told his men to hurry. Fujitora arrived at the scene just in time to block Zoro's swing at Doflamingo. He then used his ability to push Zoro underground, but the swordsman sent a flying slash towards the admiral, which he repelled with little effort. With an unconscious Law in tow, Fujitora and Doflamingo head for the palace, where the admiral and the Shichibukai would have a chance to finish their conversation."}, {"type": "paragraph", "text": "While Franky attempted to breach the Toy House, Fujitora heard the commotion through a Den Den Mushi. Doflamingo then asked the admiral if the Marines should do something about the Straw Hats. When the Marines made a move to arrest Franky at the Toy House, Doflamingo thanked Fujitora. Doflamingo told him that he made a wise choice, but the admiral replied that he should not be mistaken as an ally. Fujitora stated that if Luffy decided to fight him, there would be a lot of destruction and protecting the citizens from that destruction was his \"Justice\" and that was what he had utilized the Marines for. As for Doflamingo, he would deal with him later. Fujitora said that he accepted the position of admiral because there had been certain things that he wanted to accomplish, and one of those things was the total discarding of the Shichibukai system. He also mentioned about a country where pirates threatened to hijack the royal throne and commented that if the attempt succeeded, it would become as vile as Dressrosa. Doflamingo then tried to kick him. Fujitora blocked his attack with ease and continued saying that the balance of the Three Great Powers would be shattered and if Doflamingo kept on committing crimes, the bounty on his head would increase after the Shichibukai system was abolished. After finding out his true intentions, Doflamingo assumed that Fujitora was going to kill him, but the admiral said that they should continue being allies for the time being. From that point onwards, he would protect Dressrosa and ignore all of its malpractices."}, {"type": "paragraph", "text": "Fujitora was with Bastille as all the toys transformed back into their original forms, causing a widespread panic. He later watched as Doflamingo trapped Dressrosa in his \"Birdcage\" and forced random people to attack each other. While listening to Doflamingo's explanation of the survival game he created, Fujitora used his Devil Fruit power to immobilize Marines who were under Doflamingo's control, preventing them from attacking civilians. Later, he ordered Bastille to tell all squads to focus on stopping the civilians from hurting each other. He clarified that the Straw Hats and Law are their main targets."}, {"type": "paragraph", "text": "Later, Vice Admiral Maynard left the Corrida Colosseum and reported to Fujitora about Doflamingo's connection with the underworld. Maynard explained that it would be the best time to arrest Doflamingo, but Fujitora responded that it is not the World Government's role to play God in the wake of the anger-filled screams of the citizens and instructed the Vice Admiral to continue following his orders. Fujitora later confronted Luffy, Zoro, and Law. While Fujitora clashed with Zoro again, Pica joined the fray as a massive stone giant. When Luffy made Pica angry by laughing at his voice, a Marine told Fujitora to flee before Pica launched his attack."}, {"type": "paragraph", "text": "Fujitora and the Marines were later stationed at the base of the new King's Plateau apparently to hinder the Straw Hats from reaching Doflamingo. However, while Luffy and his allies were charging up the new King's Plateau, Sabo was seen preventing the Marines from going after them. Fujitora asked Sabo if that was his duty as a revolutionary. Sabo replied that he was doing his duty as a brother. Once Sabo defeated several Marines including Bastille, Fujitora brought down some meteors. However, the meteors were sliced into smaller pieces by the Birdcage and they fell onto the city. Fujitora worried about the damage he caused and he regretted his mistake. After learning about Sabo's relation to Luffy and Ace, he clashed against the revolutionary. As the battle raged on, Sabo asked Fujitora why he was acting oblivious. Fujitora admitted his bluff and jokingly asked Sabo to show mercy towards him due to his blindness. Sabo then told the admiral that he does not discriminate against anyone. Fujitora noted that Sabo was not all talk after all, but asserted that he also had a title and reputation to maintain and used Ferocious Tiger to make gravity go horizontally with enormous pressure, destroying several buildings in the process as the sheer force made Sabo burst into flames as he charged forward, clashing with Fujitora once more, causing Sabo to ponder just what the admiral was plotting. Fujitora then told the young revolutionary that he was willing to bet his life on their fight."}, {"type": "paragraph", "text": "Fujitora ultimately decided to end their battle after revealing his views on how it was impossible for even the Marines to become heroes. When Sabo asked him about what would happen if someone discovered how he feels, Fujitora called it a gamble and wished Sabo good luck. The admiral then went to the old King's Plateau where Riku Doldo III, Viola, Usopp, Kin'emon, and Kanjuro were present. He spoke with Riku, saying that he decided to make the same bet as him by placing his faith in Luffy."}, {"type": "paragraph", "text": "He later left the old King's Plateau and ordered his troops to gather the citizens in one place where they could protect them. When Zoro defeated Pica and destroyed Pica's statue, Fujitora protected the citizens in the city by keeping the rubble afloat long enough for the people to evacuate."}, {"type": "paragraph", "text": "During the final phase of Doflamingo's game, Fujitora noticed the falling Chiyupopo while the citizens fled from the shrinking Birdcage. He later helped Zoro, Kin'emon, and Kanjuro slow down the Birdcage. Once Luffy finally defeated Doflamingo, Fujitora silently stood as the Birdcage collapsed and the people celebrated Doflamingo's downfall."}, {"type": "paragraph", "text": "During the aftermath, the Marines arrested the Donquixote Pirates. Fujitora approached Riku and kneeled down on the ground while bowing his head before him, giving him a heartfelt apology for all the damage a Shichibukai has caused and the World Government's irresponsibility. Riku asked Fujitora to raise his head, but the admiral did not mind if the whole world saw him kneeling, saying that it is more important for the world to know the truth. Fujitora further stated that after allowing Doflamingo to do as he pleased, he had no right to preach justice."}, {"type": "paragraph", "text": "Sakazuki later contacted Fujitora and scolded him for allowing the true news of Dressrosa to spread throughout the world without consent from his superiors. He angrily told Fujitora that he should have known what it meant for him to admit fault, and that he should have reported it before taking action. Fujitora replied if he had done so, the incident might have been covered up as it always has been in the past. Fujitora stated that he does not want to be made into a hero for something he did not do, and that the World Government needed to take responsibility for their actions. Sakazuki shouted that it was a matter of credibility and trust, while Fujitora responded that if their credibility was so easily damaged, then they never had any in the first place. Sakazuki then ordered Fujitora to make amends before returning to headquarters by bringing back the heads of Luffy and Law, and promised him that until he carried out this order, the doors to all Marine bases would remained closed to him. Fujitora appeared to take his superior's decision in stride."}, {"type": "paragraph", "text": "Later that night, Fujitora rolled a dice and it showed a one. He then decided not to capture Luffy and Law for the time being. Maynard objected to this decision, but Fujitora only told him not to complain. Three days after Doflamingo's downfall, Fujitora met up with Tsuru and Sengoku. Tsuru asked Fujitora why he did not capture Luffy and Law. Fujitora explained that he based his decision on the roll of a dice and that Luffy and Law have been lucky for two days in a row. He then gave his dice to Tsuru and declared that if the dice rolled on any number other than one, he will go after the pirates. The dice rolled on a six and Fujitora mobilized the Marines to pursue Luffy and his allies. Fujitora stated that he will test Luffy's luck himself. Fujitora then headed for the eastern port, the location of the Straw Hats' escape point."}, {"type": "paragraph", "text": "As Luffy's allies prepared to stand their ground against the admiral, Fujitora used his gravity ability and prepared to strike them all by raising up all the rubble from Dressrosa into the sky and clearing the way for a battlefield. Luffy arrived and struck him with a Haki-imbued Gear Third attack. Although he knew he could not defeat him like a normal enemy, Luffy declared that he grew tired of running from the admiral after having run from the other admirals in the past, and decided he would defeat anyone regardless of their notoriety, even the Yonko, for the sake of becoming the Pirate King."}, {"type": "paragraph", "text": "As they clashed, Luffy announced every single one of his attacks and where he was aiming before striking. Fujitora wondered if Luffy was taking pity on him due to his blindness. Luffy declared that he would not attack without saying anything, given that his opponent was blind. Annoyed and slightly angered, Fujitora blew Luffy away with his gravity ability. Luffy's allies caught him and fled across a bridge leading to a gigantic ship in the distance. Fujitora continued to levitate all the rubble and prepared to sink all the pirate ships in the vicinity by dropping the rubble, while simultaneously revealing that his blindness was his own doing after seeing too many terrible things in the world and refusing to witness any more. However, the Dressrosa citizens arrived to \"chase\" Luffy. Even though he was aware of their true intentions, Fujitora would not risk harming the citizens. It surprised him that none of the citizens had any anger in their voices and were acting in a genuinely compassionate manner. For the first time in his life, he started to regret his decision to blind himself, because he was not able to see Luffy's face with his own eyes, though he remarked that he felt that it was a kind face."}, {"type": "paragraph", "text": "When pirates who allied with Doflamingo arrived and started attacking Luffy and his allies, Fujitora dropped the rubble on the enemy as a farewell gift. He then thanked Luffy for all he had done. Sengoku appeared behind him, saying that he heard him, much to the admiral's embarrassment."}, {"type": "paragraph", "text": "After leaving Dressrosa, Fujitora took part in escorting Doflamingo. Sengoku asked Fujitora to apologize to Sakazuki, but he refused, saying that he still has his pride and stated that after they drop Doflamingo off, he is going on a trip. Sometime later, a subordinate of Kaido, Jack, attacked the Marine convoy in an attempt to retrieve Doflamingo. Though he sank two of the Marine ships, Jack was ultimately defeated."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Fujitora_Leaves_Footholds_Standing.png/revision/latest/scale-to-width-down/210?cb=20141206212545", "caption": "Fujitora vs. Law vs. Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6f/Fujitora_Floating_a_Battleship.png/revision/latest/scale-to-width-down/210?cb=20160912171911", "caption": "Fujitora and his crew pursuing the Thousand Sunny."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cb/Zoro_vs._Fujitora.png/revision/latest/scale-to-width-down/210?cb=20150823234713", "caption": "Fujitora intercepts Zoro's attack against Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/89/Doflamingo_Attacks_Fujitora.png/revision/latest/scale-to-width-down/210?cb=20160116170103", "caption": "Fujitora tells Doflamingo of his plan to end the Shichibukai system."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/Sabo_vs._Fujitora.png/revision/latest/scale-to-width-down/210?cb=20160201060349", "caption": "Fujitora and Sabo clash."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c1/Fujitora_Kneels_Before_Riku.png/revision/latest/scale-to-width-down/210?cb=20160509033926", "caption": "Fujitora and the Marines kneel in apology."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Luffy_Punches_Fujitora.png/revision/latest/scale-to-width-down/210?cb=20160529052143", "caption": "Luffy punches Fujitora."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "After completing the journey to Impel Down, Fujitora went on a long journey and saw Vegapunk's new invention, which Fujitora believed could render the Shichibukai system obsolete."}, {"type": "paragraph", "text": "As royals gathered for the Levely, Fujitora went to Mary Geoise and had a friendly conversation with Ryokugyu. While eating food, Fujitora mentioned seeing Vegapunk's new invention. Just prior to the Levely, Fujitora sent a letter to Nefertari Cobra and had a meeting with him and Riku Doldo III."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 3, "content": [{"type": "paragraph", "text": "Fujitora was part of a Buster Call fleet sent by Marine Headquarters on Delta Island, where the Pirates Expo was being hosted. Upon arriving, Fujitora went to the shore of the island, where he clashed with Zoro. He fought Zoro for some time until the pirate Douglas Bullet came to confront the Buster Call fleet. When this happened, Fujitora departed from the island and summoned a meteorite to leave Zoro and the pirates with."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "On the fourth day of the Levely, Fujitora and Ryokugyu fought Sabo and his group."}, {"type": "paragraph", "text": "After the Shichibukai system was abolished, a wounded Fujitora talked with Sakazuki in the midst of a battle, and voiced his hope that the power balance of the world would tilt to the Marines' favor. However, Sakazuki said the timing was bad due to the Pirate Alliance of the Big Mom and Beasts Pirates."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, before he went to the restaurant, he had a brief conversation with Zoro. Zoro seemed intimidated by him and was about to unsheathe his sword, but then calmed down after Fujitora walked past him.", "elements": []}, {"text": "In the anime, Fujitora wins 15 times in the game of roulette before he eventually \"loses\" to Doflamingo's thugs, with others betting on his calls to also make money. In the manga, it only shows him \"losing\" to the thugs.", "elements": []}, {"text": "In the anime, Fujitora slashed Doflamingo's thugs with his sword before creating the hole. He slashed all of them, though it appeared to have no effect, but after he sheathed his sword, the gravity started to take effect. In the manga, Fujitora did not slash them with his sword, but merely sheathed his sword to make the hole.", "elements": []}, {"text": "In the anime, after leaving Corrida Colosseum, Fujitora uses his Devil Fruit ability to retrieve a lost balloon for a young girl.", "elements": []}, {"text": "When confronting Luffy and Zoro during Doflamingo's Birdcage game, the manga only showed him clashing swords with Zoro. In the anime, Luffy tries to attack Fujitora first.", "elements": []}]}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Issho vs. Doflamingo's thugs", "elements": []}, {"text": "Issho and Donquixote Doflamingo vs. Trafalgar D. Water Law", "elements": []}, {"text": "Issho vs. Roronoa Zoro", "elements": []}, {"text": "Issho vs. Sabo", "elements": []}, {"text": "Issho vs. Monkey D. Luffy (Dressrosa Eastern Port)", "elements": []}, {"text": "Doflamingo's Marine escort vs. Jack (not shown)", "elements": []}, {"text": "Issho and Ryokugyu vs. Sabo, Morley, Lindbergh, and Karasu", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Issho vs. Monkey D. Luffy (Birdcage)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited World Red", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the 6th fan poll, Fujitora ranked 53rd, making him the most popular current admiral of the Marines after his predecessor Kuzan.", "elements": []}, {"text": "On the frontal flag of what appears to be Fujitora's personal battleship is lettering reading \"Isshō\" (一生, \"Isshō\"), which is Japanese for \"whole life/lifetime\" or \"age/era.\" This matches the exact pronunciation of Fujitora's real name, which is always written in katakana.", "elements": []}, {"text": "In the anime, a common animation error is for the scars over one or both of Fujitora's eyelids to be drawn too long or too short from time to time.", "elements": []}, {"text": "In the video game One Piece: Pirate Warriors 3, Fujitora is one of the few characters that Boa Hancock cannot turn into stone with her Devil Fruit abilities (both when controlled by the player or encountered as an enemy), which is a reference to his blindness and not knowing what she looks like. However, this immunity has yet to be confirmed or denied in the manga, as the two of them have not met or interacted in the series thus far.", "elements": []}, {"text": "Fujitora is the only known admiral, former or current, to have eaten a Paramecia-type Devil Fruit.", "elements": []}, {"text": "He is also the only known current or former admiral to use a weapon unrelated to his Devil Fruit.", "elements": []}, {"text": "Fujitora's favorite foods are udon and soba.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Fujitora's birthday, August 10, comes from his epithet since 8-10 can be derived from Fuji-tora.", "elements": []}, {"text": "Fujitora's appearance is based on the late actor Shintaro Katsu, more specifically his role as Zatoichi, the blind swordsman. The similarities are as follows:", "elements": [{"text": "They carry a shikomizue (cane-sword) for both walking and battle.", "elements": []}, {"text": "Both have a love for gambling (although Zatoichi is able to recognize whether or not he is being taken advantage of). Interestingly, they were also targets of gambling cheats right in their maiden appearances, Fujitora in the restaurant and Zatoichi in The Tale of Zatoichi. While Fujitora was successfully duped, Zatoichi saw through the deception.", "elements": []}, {"text": "They wield their swords in identical styles, and both utilize iaijutsu (quick draw techniques).", "elements": []}, {"text": "Both seem to put the best interests of the people first. In fact, they help out citizens when they are in crisis.", "elements": []}, {"text": "Both are quite humble.", "elements": []}, {"text": "They are able to strike fear in their opponents during combat, and have succesfully dealt justice to leaders of antagonist groups.", "elements": []}, {"text": "Both are also interested in going on trips. In the movies, Zatoichi is depicted as a wanderer and Fujitora has decided that he would be going on a trip after Sakazuki barred him from entering any Marine base.", "elements": []}, {"text": "Many of his named techniques originate from his movies. Jigoku Tabi originates from Zatoichi and the Chess Expert, and Abare Himatsuri is derived from Zatoichi at the Fire Festival.", "elements": []}]}, {"text": "Fujitora and Ryokugyu's animal aliases (Tiger and Bull, respectively) are the representation of the northeastern quarter where the ogre that Momotarō must kill lives.", "elements": []}, {"text": "A fan asked Oda why Fujitora (Wisteria Tiger) was not just named \"Purple Tiger\" (紫虎, Murasakitora), with a simple color like the other admirals, and Oda responded that he did not like the feel or pronunciation of Murasakitora or Shitora (both meaning purple), and decided on Fujitora because it sounded cooler.", "elements": []}]}], "images": []}]}