{"sections": [{"title": "Kanjuro", "level": 1, "content": [{"type": "paragraph", "text": "\"Evening Shower\" Kanjuro is a samurai from Wano Country and a retainer of the Kozuki Family. He is also one of the Nine Red Scabbards. He was born 59 years before the present day, but traveled 20 years forward in time when he was 39 years old."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kanjuro's appearance matches the stereotype of a traditional Kabuki performer. He has bright long red hair down to the floor with the front hair sticking outward and down to his chest, with big lips and blush marks on his cheek in a similar manner to Bentham. All-in-all, his appearance resembles a kabuki performer. He is rather tall, as he appears to be a similar height to Kin'emon (who himself is of a comparable height to Brook, who stands 277 centimeters) when standing side by side."}, {"type": "paragraph", "text": "He wears a traditional samurai outfit with a ribbon in the middle and zori for footwear. On his back Kanjuro carries a large brush which he keeps in readiness for use with his powers."}, {"type": "paragraph", "text": "As a retainer of the Kozuki Family, he bears the crest somewhere in his body."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kanjuro seems to be quite caring, since he suggested that they leave the island and devised a plan to do so. He is also very brave, since he sacrificed himself to let his fellow samurai escape. Unfortunately, there are times where he can be absent-minded, such as when he failed to realize the citizens of Dressrosa could climb the net he had drawn like a ladder to get to Usopp and King Riku, or when he was fooling around during the escalade of Zunesha's leg and failed to realize that Bariete was falling towards him, hitting Kin'emon and him and making them fall off the elephant."}, {"type": "paragraph", "text": "His personality seems to be a lot like Sai in the sense that he is overzealous with his emotions. For instance, when he realized he put Usopp in danger, he stated he would cut open his stomach as compensation. However, he quickly decided against such actions when Kin'emon told him not to, showing he does listen to his friends."}, {"type": "paragraph", "text": "Like most other characters in the series, he has a unique Laughter Style: \"Ka, ka, ka\""}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Craftsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Kanjuro has some skills in making brushes, using the hair of people and corpses to make brushes for a living."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Kanjuro is physically strong, able to easily carry around and use his giant ink brush without tiring. While imbuing his brush with Haki, Kanjuro was able to push back and significantly slowed down the contraction speed of Doflamingo's Birdcage."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Kanjuro ate a Paramecia-type Devil Fruit that allows him to turn anything that is drawn into a three-dimensional real object, or even a living organism by saying \"Appear\" (出でよ, Ideyo). Creations also have the same abilities as the originals, such as a bird's ability to fly, or food being edible (although according to Kin'emon it hurts his stomach). This also allows him to affect his own body, as he hid inside a wall as a drawing to avoid detection. Due to his lack of knowledge about Devil Fruits, he calls his ability \"sorcery\". The fruit's powers can also work in reverse, causing the animation to revert to its inanimate 2D form if it comes in contact with a flat surface. Kanjuro can also order the drawing to return to its inanimate form."}, {"type": "paragraph", "text": "Ironically, despite his Devil Fruit ability, Kanjuro is bad at drawing, which seems to compromise the full potential of his creations. The drawings will dissolve if they come into contact with water. Living creatures created have limited strength and endurance, and if they reach their limit they will revert to their inanimate form."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/50/Kanjuro%27s_power.gif/revision/latest/scale-to-width-down/200?cb=20160905010655", "caption": "Kanjuro's Devil Fruit allows him to animate what he draws."}]}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Nuke Suzume (抜け雀, Nuke Suzume, literally meaning \"Escaping Sparrow\"): Kanjuro draws a large sparrow in order to escape a confined area. However due to his poor drawing skills, the sparrow cannot fly very well. He first used it to escape Dressrosa's prison with Kin'emon.", "elements": []}, {"text": "Nobori Ryu (昇り竜, Nobori Ryū, literally meaning \"Rising Dragon\"): Kanjuro draws a long dragon which cannot fly, but can climb up cliffs and steep surfaces. He first used it to take him and the Straw Hat Pirates and allies up one of Zou's legs. However, his creation disgusted Kin'emon, as he hates the sight of dragons, while Robin, in contrast, actually blushed because she found it very cute. The Straw Hat Pirates named the dragon \"Ryunosuke\" (りゅーのすけ, Ryūnosuke).", "elements": []}, {"text": "Nekozaemon (ねこざえもん, Nekozaemon): Kanjuro draws a giant cat with dis-proportionally short and small limbs. By his claim, cats are good climbers, which was the purpose of drawing Nekozaemon, but due to the poor drawing and small limbs, the cat climbed at a very slow rate, seemingly exhausted after a short amount of time. He first drew it to climb back up one of Zunesha's legs after falling off Ryunosuke.", "elements": []}, {"text": "Torasaburo (虎三郎, Torasaburō): Kanjuro draws a tiger that is fairly rotund and has a short tail and crudely drawn stripes. He first drew it to climb back up one of Zunesha's legs for the second time after Nekozaemon failed. \"Saburo\" means \"third son,\" referencing how it was the third drawing to climb up Zunesha.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In order to utilize his Devil Fruit powers, Kanjuro keeps a giant ink brush with him. It has a katana hilt and guard, with a tassel tied to the pommel. He wields it in a manner similar to a sword, instead of how one would hold a brush. During his youth, Kanjuro used a sword to cut hair off from people and corpses in order to use them to make brushes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/24/Kanjuro%27s_Katana_Brush.png/revision/latest/scale-to-width-down/210?cb=20190413071416", "caption": "Kanjuro's brush."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Kanjuro is able to use Busoshoku Haki, known in Wano as \"Ryuo\", which he used to reinforce his ink brush to help Zoro and Kin'emon push back the Birdcage. Kanjuro's Busoshoku Haki is strong enough to defend against the Birdcage's razor sharp threads that can easily slice cannon balls and large buildings."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Kanjuro possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Before meeting Kozuki Oden, Kanjuro was in Kibi stealing human hair from people regardless of being dead or alive to make brushes and sell them to make a living. Later, he met Oden who he thought was a corpse and tried to steal his hair only to be defeated by him. Following his defeat at the hands of Oden, Kanjuro followed him ever since. After Oden became daimyo of Kuri, Kanjuro became one of his retainers."}, {"type": "paragraph", "text": "After Inuarashi, Nekomamushi, and Kawamatsu joined Oden, they were running low on funds. Therefore, he and the other retainers attempted to steal money from Shimotsuki Yasuie, but they were caught. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Oden and Wano Country. Following Yasuie's advice, they educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "After meeting the Whitebeard Pirates, Oden and his retainers were having a feast with them. Oden said that he wanted to join the crew, but Kanjuro, Kin'emon, Raizo, and Denjiro voiced out against it. After the Whitebeard Pirates left Wano two weeks later, the retainers discovered Oden, Izo, Inuarashi, and Nekomamushi to be missing."}, {"type": "paragraph", "text": "Twenty years ago, after Oden was executed in the Flower Capital by the shogun, Kanjuro, Kin'emon, Raizo, Kiku, Inuarashi, and Nekomamushi escaped the execution site and fled to Oden Castle, but Inuarashi and Nekomamushi were captured by the shogun's forces and were left behind. By the time Kanjuro's group reached Oden Castle, it was set ablazed by Kaido. The retainers went inside the castle and found Momonosuke as well as his sister and mother. Toki then sent her son and the retainers 20 years into the future. After arriving at the future, they went around Wano and discovered how much it changed over the years. However, they discovered allies they could still count on and began forming a plan to take back Wano. Momonosuke, Kanjuro, Kin'emon, and Raizo decided to travel to Zou to seek aid from the Mink Tribe, but when they were leaving Wano, they were spotted by the Beasts Pirates."}, {"type": "paragraph", "text": "On the way to Zou, they ended up shipwrecked, in which they got separated from Raizo, and drifted ashore to Dressrosa. Once there, they were chased by Dressrosa's guards. Kanjuro chose to be apprehended to cover Kin'emon, allowing him to escape and pursue Momonosuke on a ship that was headed toward Punk Hazard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7a/Kanjuro_and_Inuarashi_Buying_Books.png/revision/latest?cb=20191125140723", "caption": "Kanjuro and Inuarashi buying books for self education."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Kanjuro_Gets_Captured.png/revision/latest/scale-to-width-down/180?cb=20151011174734", "caption": "Kanjuro sacrificing himself for Kin'emon."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After his capture, Kanjuro was imprisoned at the SMILE Factory under the guise of a toy house. While Kin'emon was at the royal palace, Kanjuro was said to have disappeared from the scrapheap."}, {"type": "paragraph", "text": "When Kin'emon later arrived at the scrapheap, it was shown that Kanjuro was hiding in the walls; he was also able to sustain himself by using his Devil Fruit powers to make food. Kin'emon was happy to have found Kanjuro, who was also glad to see Kin'emon again. Kanjuro and Kin'emon prepared to leave on a bird Kanjuro drew and brought to life using his Devil Fruit ability, but the trapped citizens and Dressrosa soldiers begged to be taken along."}, {"type": "paragraph", "text": "Kanjuro then used his ability to create ladders for the people to climb to the surface with. After leaving the scrap heap, Kanjuro and Kin'emon went to the old King's Plateau and met up with Usopp, Viola, and Riku Doldo III. Kanjuro painted a net to keep the citizens from reaching the top, but they ended up climbing it. Kanjuro offered to commit harakiri, but Kine'mon told him not to and Usopp beat them both with Kanjuro's brush."}, {"type": "paragraph", "text": "Upon Usopp's request, Kanjuro created a doodle drawn by the sniper which was then converted into a special projectile that Usopp would use to defeat Sugar. When the Dressrosa citizens reached the top of the plateau, Kanjuro and others held them back long enough for Usopp to snipe at Sugar. Though Kanjuro and Kin'emon were tied up, Usopp was successful in making Sugar lose consciousness. The Dressrosa citizens then released the samurai and the others, realizing that they were merely playing into Doflamingo's hands if they had continued. They were later joined by Issho, who decided to place his faith in Monkey D. Luffy and his allies."}, {"type": "paragraph", "text": "After most of the Donquixote Pirates' officers were defeated, Kanjuro informed Usopp that Issho left and went to the city. Kanjuro, Kin'emon, and Usopp then saw Pica heading towards the old King's Plateau. When Pica prepared to crush everyone on the plateau, Kanjuro was awestruck when Zoro destroyed the Pica statue and defeated Pica."}, {"type": "paragraph", "text": "As Doldo, Tank, and the citizens were leaving the old King's Plateau, Kanjuro heard about Law's defeat from Viola."}, {"type": "paragraph", "text": "Later, as Doflamingo's Birdcage started shrinking he left the old King's Plateau with Kin'emon and Zoro. Kanjuro was informed by Zoro about his intention to stop the Birdcage. Once they reached the Birdcage, Kanjuro and Kin'emon were surprised that Zoro made an attempt to push back the Birdcage. The samurais tried to tell Zoro that it would be impossible, but Zoro angrily told them to help instead of doing nothing. The two samurai complied and they were soon aided by Issho. With everyone pushing, the cage stopped for a moment."}, {"type": "paragraph", "text": "They kept pushing the Birdcage back just long enough for Luffy to deal one decisive blow to Doflamingo. Once Doflamingo had been defeated, they witnessed the collapse of the Birdcage. They rejoiced as Doflamingo's downfall was announced to Dressrosa."}, {"type": "paragraph", "text": "Three days after Doflamingo's downfall, Kin'emon and Kanjuro traveled through the central streets, watching the citizens rebuild the country. They later appeared at Kyros' house, eating a meal with the Straw Hats. They prepared to leave when the Marines were mobilized to pursue Luffy and all those affiliated with him. They fled when the Marines were about to storm Kyros' house. After Luffy separated from the group to take care of unfinished business, Kanjuro's group went to the eastern port. While waiting for Luffy, they saw Issho approaching."}, {"type": "paragraph", "text": "When Issho prepared to attack them with all the rubble from Dressrosa, they quickly fled to the escape ship. At that moment, Luffy arrived and attacked Issho. During the clash, Issho used his gravity ability to blow away Luffy, who was then caught by Hajrudin. They quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after the pirates. They eventually reached Orlumbus' flagship, the Yonta Maria."}, {"type": "paragraph", "text": "After the Straw Hat Grand Fleet was formed, they held a feast to celebrate their victory over Doflamingo. After the feast, each of the leading allies received a piece of Luffy's Vivre Card and parted ways. Bartolomeo then brought the Straw Hats, the samurais, and Law to his ship, the Going Luffy-senpai."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Kanjuro_Frees_Prisoners.png/revision/latest/scale-to-width-down/210?cb=20151124142553", "caption": "Kanjuro helps the prisoners escape from the underground scrapheap."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/04/Zoro_and_Samurai_Push_Birdcage.png/revision/latest/scale-to-width-down/210?cb=20160228091728", "caption": "Zoro and the samurai help stop the Birdcage."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "During a hail storm, Luffy's group learned that the Barto Club does not have a navigator, lacks experience in sailing, and usually call Gambia's grandmother who gives them useless advice. Therefore, the Straw Hats, the samurais, and Law needed to protect the ship. After one week of traversing through the dangers of the New World, the ship finally arrived at Zou. Kanjuro commented that he heard tales of a tribe that hates humans."}, {"type": "paragraph", "text": "After finding the Thousand Sunny, the Barto Club bid Luffy's group farewell. Proceeding to search for Sanji's group, they climbed the giant elephant's left hind leg with a dragon that Kanjuro conjured. After the samurais explained that they were also searching for their ninja comrade, Raizo, the group saw something dropping towards them."}, {"type": "paragraph", "text": "The thing that was falling towards them happened to be a monkey. While Kin'emon and Kanjuro were fooling around, the monkey hit them, causing them to fall off the dragon. Despite being separated from the group, the samurais assured the Straw Hats that they were alright and will catch up to them eventually."}, {"type": "paragraph", "text": "Kanjuro later conjured a cat, which he, Kin'emon, and the monkey used to climb the elephant's leg. As they saw the eruption rain, they panicked as the cat would melt if it made contact with water. Having failed to reach Zou, Kin'emon and Kanjuro returned to the Thousand Sunny and decided to wait until the next day."}, {"type": "paragraph", "text": "On the next morning, they finally reached Zou. When Kin'emon asked the monkey mink about Raizo, he quickly ran away. The samurais chased after him, not noticing a sleeping Franky, Nico Robin, and Brook."}, {"type": "paragraph", "text": "On the way to the Mokomo Dukedom, Kanjuro and Kin'emon reunited with Momonosuke. When they arrived at Kurau City, they were quickly intercepted by the Straw Hats, who tried desperately to keep them hidden. However, when they saw Inuarashi and Nekomamushi fighting with each other, the samurais revealed themselves, much to the Straw Hats' horror. Contrary to what the Straw Hats expected, the Mink Tribe welcomed them and revealed that Raizo is safe as well as having a friendship with Kin'emon's clan."}, {"type": "paragraph", "text": "After Inuarashi and Nekomamushi called a truce for the sake of Momonosuke, whom they recognized as their lord, they took the samurais and the Straw Hats to a secret area in the Whale Forest where Raizo was hidden. After making their reacquaintance, Kanjuro, Kin'emon, and Raizo were saddened to see the state Zou was in after Jack's invasion. They then went back inside the whale tree once Robin finished deciphering the red poneglyph hidden there. After explaining the history of the Kozuki Family and their connection to the poneglyphs, the samurais and Raizo expressed sorrow in explaining Lord Oden's execution at the hands of Kaido and the shogun of Wano Country Kurozumi Orochi."}, {"type": "paragraph", "text": "The samurais and the two rulers of Zou revealed Oden's will to open the country of Wano to the world and to defeat Kaido and the shogun of Wano Country. The samurais also explained that they needed allies which was the reason why they journeyed to Zou. They then formed an alliance with the Mink Tribe and the Straw Hats."}, {"type": "paragraph", "text": "They later left the secret room and the samurais explained that they never went with Oden during his travels as leaving the borders of Wano is a crime. While discussing their plans to defeat Kaido, the alliance decided to split up and meet up again at Wano Country. Law agreed to take the samurais back to Wano Country in his submarine. Right after they left the Whale Tree, they felt Zou shaking and heard Zunesha crying. Zou's shaking was because of Jack returning and assaulting the giant elephant. On Momonosuke's command, Zunesha retaliated and sank Jack's fleet. With the threat of Jack ended, everyone became calm again."}, {"type": "paragraph", "text": "After Momonosuke decided to stay on Zou in order to communicate more with Zunesha, Kanjuro and his comrades prepared to go back to Wano with Law and Zoro accompanying them. As the Sanji Retrieval Team departed from Zou, everyone, except for the Straw Hat members left behind, was shocked when Luffy jumped off Zunesha with his party."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Samurai_Ride_Nekozaemon.png/revision/latest/scale-to-width-down/210?cb=20160904110313", "caption": "Kanjuro, Kin'emon, and Bariete ride Nekozaemon up Zou's leg."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Raizo_is_Safe.png/revision/latest/scale-to-width-down/210?cb=20161204162210", "caption": "The minks reveal that they protected Raizo from Jack."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kanjuro and his group later infiltrated Wano Country, where they remained hidden until the alliance was ready to strike. While incognito, Kanjuro worked as a fishmonger. After Franky left his job, he informed Kanjuro of the bad news concerning the blueprints of Kaido's fortress."}, {"type": "paragraph", "text": "After the chaos at Orochi's palace, Kanjuro rendezvoused with Shinobu, Robin, Nami, and Brook at the Northen Graveyards in the Ringo region. During their meeting, Kanjuro was surprised at the large amount of information Robin was able to gather."}, {"type": "paragraph", "text": "Sometime later, the Beasts Pirates found out about Kin'emon's secret message and the moon marks on the ankles of the Kozuki Family supporters. At Ebisu Town, Shinobu got into a heated argument with Law, suspecting that Law's captured crewmates revealed the meaning of Kin'emon's secret message. When Shinobu said that the captives should be disposed of, Kanjuro disagreed with her, saying that it was most important that they retain the allies they had made, as otherwise they would be unable to bring down Orochi and Kaido. Tonoyasu then entered the house and recognized Shinobu and Kanjuro, much to their surprise. He then showed them a copy of the message and talked about the rumors swirling around the Flower Capital, wondering if the final battle was at hand."}, {"type": "paragraph", "text": "After telling Kanjuro and Shinobu that he would join them, Tonoyasu left the house. Kanjuro and Shinobu then explained to Sanji, Franky, and Robin that they did not actually know who Tonoyasu was, making them questioned on how he knew them."}, {"type": "paragraph", "text": "When news of Tonoyasu's capture was revealed, Kanjuro and his group gathered to see him being shown on a broadcast. He finally recognized him as Yasuie, a former daimyo who supported Oden."}, {"type": "paragraph", "text": "Kanjuro and his group rushed to Rasetsu Town but only arrived after Yasuie was shot and executed. As he mourned Yasuie's death, Kanjuro regretted not recognizing him sooner and called his death a grave mistake."}, {"type": "paragraph", "text": "Kanjuro's group managed to retrieve Yasuie's body and returned to Ebisu Town. Kanjuro then promised the villagers that he would give Yasuie a burial in Kuri. He later joined a meeting with several key alliance members at Amigasa Village."}, {"type": "paragraph", "text": "The group then learned from Zoro and Kawamatsu that Hiyori is alive. On the day for the raid on Onigashima, Kanjuro marched to the rebel meeting place with Momonosuke, Kin'emon, Kikunojo, Raizo, Shinobu, Inuarashi, Kawamatsu, and Ashura. The group eventually arrived at the meeting place, but found none of their ships and allies. In spite of this major setback, the Scabbards were still determined to go through with the raid, knowing that they would not get another chance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Nine_Red_Scabbards_Mourn_Yasuie.png/revision/latest/scale-to-width-down/180?cb=20190605192512", "caption": "The witnessing members of the Nine Red Scabbards mourn Yasuie's death."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kanjuro vs. Doflamingo's guards", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In Kanjuro's first flashback appearance, he appeared to have his hair back in a pony tail. However, in the volume release of the chapter, Oda made a change to Kanjuro's shadowed appearance. In the revised chapter he seemed to have some type of helmet or hat on his head. It could also possibly be a tengai or reed hood worn by komusō.", "elements": [{"text": "When Kanjuro was seen for the first time, he resembled neither of these silhouettes.", "elements": []}, {"text": "The first silhouette is eventually revealed to be closer to that of Kin'emon's ally Denjiro.", "elements": []}]}, {"text": "The three drawings Kanjuro created to climb Zunesha each had the end part of their name match one of the Wano Country characters. Ryunosuke with Momonosuke, Nekozaemon with Kin'emon and Torasaburo with Kanjuro himself.", "elements": []}, {"text": "The voice actor for Kanjuro's climbing dragon, Ryunosuke, is credited as Ryunosuke Yamaguchi (山口竜之介, Yamaguchi Ryūnosuke), which is the name of Yamaguchi Kappei (Usopp's voice actor)'s son.", "elements": []}, {"text": "Kanjuro's ability to create poor tasting food is similar to the power of the Kuku Kuku no Mi.", "elements": []}]}], "images": []}]}