{"sections": [{"title": "Trebol", "level": 1, "content": [{"type": "paragraph", "text": "Trebol is one of the top three officers of the Donquixote Pirates. He occupies the Club seat of the Donquixote Family, and is the leader of the crew's Trebol Army subdivision."}, {"type": "paragraph", "text": "He is also personally responsible for fostering Donquixote Doflamingo's cruelty from a young age, making him the indirect cause of an inhumanly large amount of evil and suffering brought about by Doflamingo's wrath. Because of this, he can be considered a secondary antagonist in the Dressrosa Arc with a greater influence and impact than what is first suggested in his initial appearances."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Trebol is a toweringly tall hunchback, who despite his impairment looms over his captain Doflamingo at a similar height to Diamante and Pica. His appearance is dishevelled and bedraggled. His attire consists of a long, ragged blue coat (initially dark grey, and then cyan in the anime) made of his Devil Fruit mucus with a navy (dark in the anime) blue ring-pattern on it. Mucus and sticky slime constantly trail from the coat's hem. The front of the coat is cleverly designed to resemble the front of a barrel chest, making Trebol appear to be a thickset man wearing a loose cloak over his shoulders. In truth he is extremely skinny to the point of being emaciated, and everything under the hollow of his stooped chest is a decoy made of mucus. His posture and attire make him look like a giant snail."}, {"type": "paragraph", "text": "Besides his cloak, Trebol does not wear any footwear and is always shown with bare feet, but wears a mid-length chained-shackle on each of his ankles, which are not linked together. He usually wears a small pair of sunglasses covering his small slanted eyes and has a broad flat nose, which is commonly seen with snot hanging out of it. He wears his dark hair in a bowl-cut, complete with a long, thick beard and stubble on his upper lip. His lips are a bit thicker than normal and his teeth are round and have some space between them. He also has a small scar just above his right eyebrow. He holds a scepter with a club suit design on the top. This scepter also has a lighter built into it which he can use to ignite his mucus."}, {"type": "paragraph", "text": "As a child, Trebol lacked his mucus coat, but his nose was still constantly running. He wore a bowler hat and his signature sunglasses, as well as a tattered shirt and pants. He used sandals before at some point ending up with shackles in place of actual shoes. He appeared to have grown up on the streets judging by his dirty, tattered appearance and having scrounged for food. At 18 and 33 years old, he lacked a beard. He continued wearing his bowler hat and also used a cane, which he may have replaced with the scepter he holds currently. At age 39, he was no longer using his bowler hat, taking on an appearance similar to his current one. He also changed the design of his mucus coat to represent his position as the Club seat of the Donquixote Family. When he was 47, Trebol had started using his gold scepter and changed his coat to a striped version with colors slightly paler than the scheme of his most recent coat. His hair and even part of his lip took on a sloppy, dribbling appearance, oozing downward from the effects of his Devil Fruit, but Trebol later reverted back to the facial appearance he had during Doflamingo's takeover of Dressrosa."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Trebol seems to have a problem with how close he gets to someone with whom he is talking, making people comment that he is too close."}, {"type": "paragraph", "text": "He is somewhat bold and insensitive, as he casually asked Baby 5 if Doflamingo killed another one of her fiancés, as well as asking Baby 5 to marry him as a joke, knowing that it would make Baby 5 feel compelled to help him. Trebol can also act rashly and violent, as upon realizing that the Straw Hat Pirates are attacking Sugar, he instantly threw a ship at the Officer Tower without considering the damage or risk to Sugar or caring that he was destroying the expensive vessel of a crew who came to do business with the Donquixote Family while cruelly setting the captured dwarves on fire. Despite his insensitive and cruel behavior, he has no tolerance for anyone who insults his family, as he grew angry when a peon giggled at Pica's voice, as well as getting enraged whenever someone directly insults him, as seen when he lunged at Law after the latter insulted him despite Doflamingo warning him not to. After Law wounds Trebol with Sterben, he attempts to kill Law by using his staff to cause a devastating explosion though Law survives after that."}, {"type": "paragraph", "text": "A very profuse and off-putting amount of mucus tends to drip and hang from Trebol's nose (most likely because of his Devil Fruit powers), and he will often say he cannot help it, sometimes snotting more when he laughs or has been excited or startled."}, {"type": "paragraph", "text": "Trebol is worshipful of Haoshoku Haki, as he claims it to be a quality of a king. Doflamingo's usage of Haoshoku Haki was the reason Trebol and the other executives took him under their wing and did whatever he wanted."}, {"type": "paragraph", "text": "Like many One Piece characters, Trebol has a distinct laugh: \"Behehehehe\". He also has a unique speech pattern, frequently beginning his sentences with \"Ne\" or \"Ne, ne\" (which translates to \"Hey\", or \"Hey, hey\"), and in some cases, though uncommon, he will repeat \"Ne\" more than twice in a row. He speaks in a very nasally manner, causing the words to sound more along the lines of \"Nyeh\", or \"Nyeh, nyehh\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Trebol is very casual around Doflamingo and does not seem to be scared of him, as he gets awkwardly close to him, much to his annoyance. Trebol often refers to him by his nickname \"Doffy\". The two already met since childhood, with Trebol never torturing Doflamingo as the rest of the North Blue citizens did, and even offering the former Celestial Dragon power. Trebol was the one who gave Doflamingo the Ito Ito no Mi and his signature flintlock pistol. He and the other top executives greatly admire Doflamingo, and would do anything for him. During Law's flashback when the family were having dinner, Trebol was seen sitting closer to Doflamingo than anyone else in the room. Trebol cares deeply for Doflamingo's well-being, jumping in whenever he appears to be in danger, killing any and everyone who ever offended him in the slightest, and taking pride in Doflamingo being their king, telling him not to let his knees touch ground. In return, Doflamingo cares about Trebol's well being too, as when Law was about to finish Trebol off, Doflamingo intervened to his rescue. Doflamingo also tried to warn Trebol to not let Law provoke him only to be ignored. Due to this, Doflamingo did not hesitate to insult Trebol when he suffered serious injuries from Law's trap."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/The_Elite_Officers_Swear_Loyalty_to_Doflamingo.png/revision/latest/scale-to-width-down/200?cb=20151227180339", "caption": "The Executive Officers bow before Doflamingo."}]}, {"title": "Baby 5", "level": 4, "content": [{"type": "paragraph", "text": "Trebol is somewhat rude towards Baby 5, as he casually asked her if Doflamingo killed another of her boyfriends, as well as making fun of her inability to say no to people."}], "images": []}, {"title": "Diamante", "level": 4, "content": [{"type": "paragraph", "text": "Diamante and Trebol have known each other for over thirty years and out of all the members of the Donquixote Pirates, he seems to get along with Diamante best. The two were constantly seen working together under their captain in flashbacks. Additionally, so far Diamante seems to be the only one not bothered with Trebol´s lack of sense regarding personal space."}], "images": []}, {"title": "Sugar", "level": 4, "content": [{"type": "paragraph", "text": "Although Sugar is a member of the Trebol Army, she is also a special officer and one of the most important members of the entire crew, along with Caesar Clown, due to her ability to essentially maintain power over Dressrosa. As such, Trebol has been assigned to act as her personal bodyguard. Despite this, the two have a less-than-amiable relationship, as Sugar expresses disgust at Trebol's appearance and habits, telling him to go and die, while Trebol finds her rudeness displeasing, believes her to be a mere brat and treats her like a child."}, {"type": "paragraph", "text": "Nevertheless, he takes his role as bodyguard seriously enough to take drastic actions to ensure Sugar's safety going so far as to throw a boat into the Officer's Tower subsequently demolishing it in the process, and panicked when Sugar fainted."}], "images": []}, {"title": "Lao G", "level": 4, "content": [{"type": "paragraph", "text": "As Lao G is an officer under Diamante's army, Trebol treats him with respect as a family member. Despite this, when Trebol failed his duty of preventing Sugar from fainting, Lao G reprimanded the Elite Officer for being unable to protect a single child, to which Trebol retorted in anger saying that she is not a child."}], "images": []}, {"title": "Pica", "level": 4, "content": [{"type": "paragraph", "text": "Although not much relationship is shown between the two Elite Officers, the two have known each other for more than thirty years and have loyally served under Doflamingo. Trebol respects Pica as a family member, and became angered when one of the lower ranking soldiers giggled at Pica's high-pitched voice."}], "images": []}, {"title": "Senor Pink", "level": 4, "content": [{"type": "paragraph", "text": "As Senor Pink is an officer under Diamante's army, Trebol treats him with respect as a family member. Despite this, he and Diamante laughed at Pink's sudden change into infant's clothing, apparently not aware of the man's reason."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "It is unknown what Trebol thought of Trafalgar D. Water Law while the latter was his crewmate, but given that Trebol highly respects his fellow crew members it is highly likely that he respected Law too. However, this ended after Law deserted the Donquixote Pirates, and Trebol now considers Law an enemy to be eliminated."}, {"type": "paragraph", "text": "Trebol, alongside Doflamingo, confronted Law and Monkey D. Luffy at the rooftops of the Royal Palace. Law targeted Trebol and managed to immobilize him with his \"Radio Knife\" technique, which caused Trebol to panic. At one point, he tried to reason with Law by stating that he took care of him back when they were crewmates, but it did not work as Law just ignored him. However, Trebol enjoyed seeing Law suffer as he openly attacked Law multiple times, happily cheered when Doflamingo sliced Law's arm off with his \"Itonoko\" technique and held down Monkey D. Luffy so that Doflamingo could kill Law without interference, repeatedly telling Law to give in to his injuries and die."}, {"type": "paragraph", "text": "Law had no respect for Trebol and the other executives, stating that he had no desire to associate himself with the likes of Trebol and insulting the role of the Donquixote Family's Executive Officers by claiming that their loyal actions were simply the work of puppets being manipulated by Doflamingo. This notably offended and enraged Trebol, who then tried to personally kill Law himself. This ended up being Trebol's undoing though, as Law took advantage of his lowered guard in order to heavily wound him. After this, Trebol cursed Law as he tried to blow himself up along with him, showing that his hatred for his former crewmate had reached its peak."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Though Trebol has not interacted with Luffy much, he, like all the Donquixote Pirates, considers the Straw Hat an enemy. He was very shocked to witness Luffy's ability to use Haoshoku Haki as he clashed with Doflamingo. Like so many others in the series, Trebol underestimated Luffy since he considered Luffy too weak to defeat his captain. He also made multiple attempts to prevent Luffy from attacking Doflamingo."}], "images": []}, {"title": "Usopp", "level": 4, "content": [{"type": "paragraph", "text": "Trebol mocked Usopp as a deceiving coward while confronting the Dwarves during Operation SOP. Usopp admitted that Trebol was right about him; however, he was still able to build enough courage to face the Executive Officer in order to save the helpless Dwarves, whose cries were heaving on his conscience. Though Trebol easily defeated Usopp, his defeated opponent manage to scare Sugar to the point where she lost consciousness, ironically destroying everything Trebol's crew worked for."}], "images": []}, {"title": "Dwarves", "level": 4, "content": [{"type": "paragraph", "text": "During Operation SOP, Trebol managed to defeat all the Dwarves that tried to fight him and openly mocked the faith they had on their hero \"Usoland\", calling him a coward who was just deceiving them. When Leo and the rest of the Dwarves tried to stand up against Trebol's words, he sadistically started to stomp on them, amusing himself with their \"death\" cries."}, {"type": "paragraph", "text": "Later, after Law managed to severely hurt Trebol, Leo and the Dwarves at the SMILE Factory suddenly started feeling relief for being unintentionally \"avenged\", but they did not know that was the case."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Trebol occupies the Club seat in the Donquixote Pirates as one of its top three strongest members after Doflamingo himself, and as such commands his own division, with Sugar, Violet, and Giolla being the most notable of his known subordinates."}, {"type": "paragraph", "text": "Even as an 18-year-old, Trebol was strong enough to burn down an entire town alongside Vergo, Diamante, and Pica, all of whom are younger than him. At 39, Trebol was able to defeat the entire Dressrosa army alongside Diamante and Pica."}, {"type": "paragraph", "text": "Trebol possesses a strong will, being able to withstand the clash of Haoshoku Haki between Luffy and Doflamingo."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "As noted by Robin, Trebol has extraordinary hand-eye coordination, making him a powerful shooter. With a bullet made of mucus fired from his index finger at extreme speed, he casually shot down a nearby fly mid-flight, just seconds after noticing it, hitting it directly between its eyes while piercing a wall behind with explosive force, blasting through three layers of reinforced concrete."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "He is extremely fast and can leap over long distances at impressive speeds. Despite his skinny build, he holds a tremendous level of physical strength. In his anger, he is seen lifting a giant ship out of a harbor and throwing it far away like a flail, while at the same time smashing the ship halfway through a concrete-domed roof, nearly destroying the dome."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Trebol ate the Beta Beta no Mi, a Paramecia-class Devil Fruit which gives him the ability to produce mucus, which possesses great adhesiveness, allowing him to stick to walls. He can also use it to adhere to a person, restraining their movements and dragging them towards him. It is also very flammable to the point of exploding on contact."}, {"type": "paragraph", "text": "He can also use it to grab a ship and fling it as a gigantic flail, or fire off mucus bullets with extreme speed and precision. Like Magellan, he also keeps his Devil Fruit active by turning his cloth to sticky substance all time, giving him a perpetual state of a thick liquid form."}, {"type": "paragraph", "text": "Trebol, despite being slim, produces very baggy clothing made out of mucus, which can change color."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d9/Beta_Beta_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20180513215218", "caption": "Trebol using his Devil Fruit ability."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Trebol wields a staff with a club suit design on the top. The top of the staff is a lighter, which he uses in conjuncture with his flammable mucus ability, while the bottom is sharp, allowing him to stab someone with it."}, {"type": "paragraph", "text": "At 18 years old, Trebol carried with him several flintlock pistols, one particular one he gave to Doflamingo as a gift, and another one he used to kill some thug who assaulted Doflamingo."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Trebol has been knowledgeable of Haki since before he even met Doflamingo, particularly that those who possess Haoshoku Haki are qualified to become king."}, {"type": "paragraph", "text": "Trebol possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "As a child, Trebol was very famished, and at some point ate the Beta Beta no Mi. Before he was 18, he formed a gang with Vergo, Diamante, and Pica, and found the Ito Ito no Mi."}, {"type": "paragraph", "text": "At the age of 18, Trebol and his gang found a young Donquixote Doflamingo and discovered that he could use Haoshoku Haki. Believing Doflamingo would rule over the world, they pledged their allegiance to him, and Trebol gave him the Ito Ito no Mi and a flintlock to take revenge on the world. Trebol, Vergo, Diamante, and Pica did anything to serve Doflamingo, killing people who offended Doflamingo and even burning down an entire town just because he slipped and fell on a street."}, {"type": "paragraph", "text": "Fifteen years later, Trebol was an officer of Doflamingo's crew. He and Diamante later spoke with Trafalgar Law about the remainder of his life and Corazon's behavior as Corazon threw Law out the window. After Law had been with the crew for about a week, at a meal with the other members of Doflamingo's \"family\", Trebol asked Law if he was feeling homesick and casually mentioned about how Corazon injured Law during their first meeting. The crew then learned that Law was sick with the Amber Lead Syndrome."}, {"type": "paragraph", "text": "After Law was made an official member of the crew, the Donquixote Pirates spread their influence as they traveled to the Grand Line. They participated in various activities such as looting, making business deals, and collecting bounties. One day, Corazon suddenly left the crew and took Law with him. Six months later, Trebol had a meeting with Diamante, Pica, and Doflamingo. They noticed that the Marines were not tracking them during Corazon's absence and expressed their suspicion. The crew also made plans to steal the Ope Ope no Mi during a trade that was going to occur on Rubeck Island. They also planned to meet Corazon on Swallow Island three days before the exchange."}, {"type": "paragraph", "text": "The crew later arrived at Minion Island where the Barrels Pirates, who had the Ope Ope no Mi, were based. Shortly after their arrival, they were informed of Corazon's treachery by Vergo. While Doflamingo covered part of the island in his birdcage, the Donquixote Pirates raided and looted the Barrels Pirates' hideout. When they found Corazon, they viciously attacked him until Doflamingo arrived. Buffalo and Baby 5 later informed Doflamingo that the Marines stationed at the island took custody of a boy. Thinking that the boy might be Law, the Donquixote Pirates left Corazon for dead and prepared for departure. Before they left the island, they found themselves under fire by Tsuru's squadron."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "One year later, the Donquixote Pirates held an auction for the Gol Gol no Mi, though Doflamingo did not intend to actually sell it. Gild Tesoro went to the auction and sent criminals to kill many people, allowing him to gain possession of the Devil Fruit. Doflamingo got angry and sent assassins to kill Tesoro, but they all failed."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "Two years later, Trebol participated in Doflamingo's takeover of Dressrosa. After Doflamingo successfully made Riku Doldo III a villain in the citizens' eyes, Trebol, Diamante, and Pica stepped in and subdued the Dressrosa army, passing themselves off as heroes."}, {"type": "paragraph", "text": "Two years ago, when Luffy's second bounty was revealed, Trebol was asked by Doflamingo to gather information about the boy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/99/Trebol%27s_Offer.png/revision/latest/scale-to-width-down/200?cb=20151220070414", "caption": "Trebol offers Doflamingo the Ito Ito no Mi and his signature pistol."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Donquixote_Pirates_16_Years_Ago.png/revision/latest/scale-to-width-down/210?cb=20150712150319", "caption": "Trebol eating dinner with the Family."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Baby 5 was looking for Trebol, he was sticking onto the wall of a house and remarked that the country is in chaos and suggested that the rest of the world might be in chaos too. He then rushed up to Baby 5, getting way too close to her, and asked her if it was true that Doflamingo killed another of her boyfriends, only to be told by her to back off. Trebol started flirting with Baby 5 for a bit, to which Baby 5 told him that he is gross and that Doflamingo wanted to see him, and also that Trebol should bring the Mera Mera no Mi with him. He then suggested that Baby 5 should marry him instead of some random man who will only get killed by Doflamingo, but quickly laughed it off as a joke."}, {"type": "paragraph", "text": "Later, in Doflamingo's meeting room, Trebol dropped himself off the ceiling and handed Doflamingo the fruit he desired, getting too close to him as well."}, {"type": "paragraph", "text": "After many of the disqualified participants from the Corrida Colosseum were thrown into an underground dungeon, Trebol used his power to envelop Sai with a blob of liquid, pulling him up to the ceiling. After Sai was transformed into a cymbal-bearing animated toy, he ordered him to not harm humans, obey the orders of the Donquixote Family, and then commanded him to go to a factory."}, {"type": "paragraph", "text": "While Franky was attempting to breach the Toy House, Trebol and Sugar heard the skirmish through a Den Den Mushi. Trebol assured Sugar that the Straw Hats' goal was the SMILE Factory, and that even if they managed to reach there somehow, she could turn them into toys. Trebol was also certain that the pirates were unaware of Sugar's existence."}, {"type": "paragraph", "text": "When Cavendish was brought to the officer tower, Trebol bound him to a sheet of sticky substance. After Sugar transformed Cavendish into a toy, Trebol put him to work."}, {"type": "paragraph", "text": "Robin (disguised as one of Doflamingo's subordinates) entered the room and lured Trebol out of the tower by reporting trouble at the trade port. After leaving the tower, Trebol heard Sugar urging him to return, saying that it was a trap. Once he realized that he had been tricked, he attempted to catch the fleeing Robin, but it was just a clone. Out of anger, he grabbed a pirate ship and threw it at the tower."}, {"type": "paragraph", "text": "Trebol then captured the dwarves with his sticky substance. After tricking Leo into revealing with whom they were allied, Trebol ignited the sticky substance, causing it to explode. Standing next to Sugar again, Trebol gleefully laughed as all the dwarves were completely incapacitated."}, {"type": "paragraph", "text": "He then ordered both subordinates and enslaved toys to go back to work. When the fallen dwarves started chanting \"Usoland\", Trebol asked about him and Leo declared that Usoland will save not just the dwarves, but all the enslaved toys as well. Trebol only laughed at their faith, saying that they were lied to and their savior was not coming and is probably somewhere laughing at their misery. He then told the dwarves that their faith in him was misplaced. Leo furiously dismissed Trebol's remarks, saying that Usoland will definitely save them. Before Leo can say anymore, Trebol stomped the dwarf with his foot. He then went on stomping on the other dwarves until Usopp revealed himself. After Usopp admitted his lies, he launched an attack against Trebol."}, {"type": "paragraph", "text": "After a fierce battle, Trebol overwhelmed Usopp and entrapped him in his sticky substance. When Sugar forced the Tatababasco into Usopp's mouth, Usopp made a horrible expression which surprised and terrified Sugar. Trebol panicked as Sugar lost consciousness. As Sugar's curse broke, Trebol sadly informed Doflamingo of the situation. When he tried to attack Robin, Usopp, and the dwarves, Robin took him on so that the dwarves could rush the injured Usopp away to safety. However, right after the fight started, they were interrupted by Hajrudin."}, {"type": "paragraph", "text": "Trebol and Diamante later stood guard outside the SMILE factory and defeated many attackers."}, {"type": "paragraph", "text": "Trebol and Diamante later gathered at the royal palace, which was relocated to the top of the Flower Hill by Pica. To Trebol's chagrin, Lao G reprimanded him for failing to protect Sugar. However, Doflamingo pardoned Trebol for his mistakes and assured him that the factory did not need to be guarded by destroying the factory's keys to prevent the enemies from entering it. When one grunt laughed at Pica's high voice, Trebol, along with the other Elite Officers and Doflamingo, glared at the man angrily."}, {"type": "paragraph", "text": "He was with Doflamingo when Bellamy arrived and confronted Doflamingo for betraying him."}, {"type": "paragraph", "text": "Later, when Luffy and Law infiltrated the palace, Trebol stood next to Doflamingo while he prepared for a confrontation. Luffy was enraged at Doflamingo for treating Bellamy like trash and tried to attack Doflamingo with his foot. Trebol laughed hysterically when Doflamingo used Bellamy as a shield. He was then surprised when Luffy aimed an attack at Law, thinking that he lost his mind. Law activated ROOM and used Shambles to switch places with Doflamingo, allowing Luffy to strike him. Once Trebol noticed Law sitting on Doflamingo's chair, he was sliced to pieces by Law's ability."}, {"type": "paragraph", "text": "Trebol tried to reattach himself, but soon realized that Law's Radio Knife prevented him from doing so. Law was about to strike Trebol with Injection Shot, but Doflamingo, having recovered from Luffy's attack, stopped his attack. Trebol then immobilized Law, enabling Doflamingo to wound him with Fulbright."}, {"type": "paragraph", "text": "As the battle between Doflamingo and Law intensified, Trebol became worried when Doflamingo started to lose his composure after Law revealed himself to be a \"D\". Trebol was shocked when Law managed to stab Doflamingo with Injection Shot but was later proud to see Doflamingo sever Law's right arm. Just as Doflamingo was about to kill Law with his pistol, Trebol laughed when he saw Luffy defeating Doflamingo's string clone."}, {"type": "paragraph", "text": "Trebol later saw the SMILE factory's destruction in the distance. He was not worried, stating that they can use Mansherry's powers to restore the factory, unaware that she had been rescued."}, {"type": "paragraph", "text": "While Luffy battled Bellamy, Trebol assisted Doflamingo in overwhelming Law. Trebol then watched as Doflamingo shot Law multiple times."}, {"type": "paragraph", "text": "After Luffy returned to the palace rooftop to resume his battle with Doflamingo, Trebol stood next to Doflamingo as the latter claimed that Law was dead and that the Birdcage started shrinking. When Luffy charged at Doflamingo, Law suddenly switched places with Luffy, much to Trebol's surprise. As Law attacked Doflamingo with Gamma Knife, Trebol wondered how Law was able to use an Ope Ope no Mi attack without a ROOM. Law revealed that he had a gigantic ROOM surrounding the whole New King's Plateau the entire time, further shocking Trebol. After Doflamingo fell to the floor injured, Trebol furiously tried to attack Law only to be kicked away by Luffy. Trebol was worried when Law attacked Doflamingo with Counter Shock, but was pleased when Doflamingo stood back up. However, when Luffy prevented Doflamingo from attacking Law, Trebol was nervous."}, {"type": "paragraph", "text": "Trebol was then amazed by Luffy's ability to use Haoshoku Haki as he and Doflamingo clashed. Trebol reminisced on his past where he first witnessed Doflamingo using Haoshoku Haki. He then commented on how his fate made Doflamingo into the man he is now. As Luffy was kicked away by Doflamingo, Trebol bound Luffy in his sticky substance. Luffy attempted to escape by punching him, but it had no effect. Trebol stated that he is not a Logia at all. Law mocked Trebol afterwards, enraging him, which made him use Beto Launcher to cover Law with the mucus. He then explained to Law about his past with Doflamingo as he prepared to attack Law, who then mocked Trebol's loyalty to Doflamingo. Angered, Trebol prepared to kill Law, confident that he could not fight back. However, Law activated his ROOM and levitated his severed arm, which he used to slice and wound Trebol. It was then revealed that Trebol's coat was mucus all this time and that Trebol is actually a very skinny, hunchbacked man. Enraged, Trebol set his mucus on fire in an attempt to kill Law, causing an explosion."}, {"type": "paragraph", "text": "The explosion knocked Trebol unconscious for the rest of the battle. After Doflamingo's defeat, he was arrested by the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/25/Trebol_Teasing_Baby_5.png/revision/latest/scale-to-width-down/210?cb=20140916075946", "caption": "Trebol teasing Baby 5"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Beta_Betton_Meteora.png/revision/latest/scale-to-width-down/230?cb=20141206215100", "caption": "Trebol destroying the officer tower"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Trebol_vs_Robin.png/revision/latest/scale-to-width-down/210?cb=20150201190234", "caption": "Trebol confronting Robin."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/88/Radio_Knife.png/revision/latest/scale-to-width-down/210?cb=20150628224507", "caption": "Law cuts Trebol."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e2/Law_Defeats_Trebol.png/revision/latest/scale-to-width-down/190?cb=20151229212504", "caption": "Law wounds Trebol with \"Sterben\"."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Trebol, Diamante, and Pica vs. Dressrosa army", "elements": []}, {"text": "Trebol vs. Dwarves of Tontatta Kingdom", "elements": []}, {"text": "Trebol vs. Usopp", "elements": []}, {"text": "Trebol vs. Nico Robin", "elements": []}, {"text": "Trebol and Diamante vs. former toys", "elements": []}, {"text": "Trebol, Donquixote Doflamingo, and Bellamy (while being controlled by Doflamingo) vs. Monkey D. Luffy and Trafalgar Law", "elements": []}, {"text": "Trebol and Donquixote Doflamingo vs. Monkey D. Luffy and Trafalgar D. Water Law", "elements": []}, {"text": "Trebol vs. Trafalgar D. Water Law", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Trebol, Pica, Diamante, and Vergo vs. unknown thugs (past battle)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Trébol is the Spanish word for \"clover\". This matches the card suit motif of Doflamingo's executive officers, as the clubs suit is called tréboles (\"clovers\") in Spanish.", "elements": []}, {"text": "The fact that Vergo and Donquixote Rosinante were both called Corazon (Spanish for \"heart\") while occupying the Heart seat within the Donquixote Pirates, as well as the fact that Baby 5 and Buffalo are not the real names of the characters who use those names, indicate that \"Trebol\" may also just be a code name and not his real name.", "elements": []}, {"text": "Trebol's favorite food is sausages.", "elements": []}]}], "images": []}]}