{"sections": [{"title": "Miss Friday", "level": 1, "content": [{"type": "paragraph", "text": "Miss Friday is a vulture and a member of the criminal organization Baroque Works, being a part of The Unluckies (, Anrakkīzu) along with Mr. 13. They were a team that served as messengers for Mr. 0 and were also responsible for executing any Baroque Works agents that fail their missions. She is classified as Type D creatures, \"Small Savage\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Miss Friday is a large, black-feathered vulture, with white feathers toward the neck. Her skin is pink, and her beak is a light yellow. She wears a yellow aviator cap dotted with red flowers and black goggles."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/11/Miss_Friday_Anime_Concept_Art.png/revision/latest/scale-to-width-down/120?cb=20180909150908", "caption": "Miss Friday's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like most of the Baroque Works members, Miss Friday is quite brutal, having been willing to attack Mr. 9 and Vivi for failing their mission and the bounty hunters at Whisky Peak simply for running away. She and Mr. 13 are not very faithful to their organization and its members, as they betrayed their fellow Baroque Works agents to the Marines in exchange for food."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Miss Friday displays exceptional intelligence among animals, having tracked down other agents, understand human speech (evidenced when she and Mr. 13 listened in on Vivi), and easily operated weaponry."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When punishing other agents for failure, the Unluckies will drop bombs from on high."}, {"type": "paragraph", "text": "In close combat, Miss Friday fights with a pair of machine guns strapped to her back. The weapon is powerful enough to damage Mr. 3's iron-hard wax."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/55/Miss_Friday%27s_Machine_Guns.png/revision/latest/scale-to-width-down/180?cb=20191206004346", "caption": "Miss Friday's machine guns."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Reverse Mountain Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Unluckies first appeared near the end of the Straw Hat Pirates' stay with Crocus, where they overheard Mr. 9 and Miss Wednesday discussing their failure to catch Laboon. Upon hearing this and thinking that the duo were late because they were plotting to betray Baroque Works, the Unluckies dropped an exploding package on them."}], "images": []}, {"title": "Whisky Peak Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Roronoa Zoro's battle against the 100 bounty hunters in Whisky Peak, the Unluckies arrived and prepared to punish the remaining bounty hunters, who were attempting to run away. However, they stopped when Mr. 5 and Miss Valentine came to eliminate a spy within their organization. When the spy, Vivi, accidentally revealed Mr. 0's true identity to three of the Straw Hat Pirates, Mr. 13 drew pictures of the three to report to their boss before the two departed."}], "images": []}, {"title": "Little Garden Arc", "level": 3, "content": [{"type": "paragraph", "text": "Later at Little Garden, the Unluckies were sent to check up on Mr. 3 and Miss Goldenweek. Instead, they encountered Sanji, who was pretending to be Mr. 3 while answering a phone call from Mr. 0. They attempted to assassinate Sanji, but he kicked Mr. 13 into the side of Mr. 3's wax house hard enough to leave an imprint and twisted Miss Friday's neck until it snapped."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bc/Sanji_Defeats_the_Unluckies.png/revision/latest/scale-to-width-down/180?cb=20191210191218", "caption": "The Unluckies defeated by Sanji."}]}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "The Unluckies survived their encounter with Sanji and were used by the Marines to make drawings of the Baroque Works agents that were not captured in Alabasta (using a hot bowl of donburi as encouragement). It is unknown what was done with them afterward."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/60/Unluckies_Accept_Bribe.png/revision/latest/scale-to-width-down/210?cb=20130823111650", "caption": "The Unluckies accept a bribe from the Marines."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mr. 13 and Miss Friday vs. Sanji", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "One Piece: Treasure Wars", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The name \"Unluckies\" most likely comes from the superstition of Friday the 13th being an unlucky day for people, as well as the unfortunate fate of those they come to visit. Miss Friday is a vulture, essentially linked to death. While the reason for Mr. 13 being an otter has never been addressed, it may be because there are thirteen known species of otter.", "elements": []}]}], "images": []}]}