{"sections": [{"title": "Edward Newgate", "level": 1, "content": [{"type": "paragraph", "text": "Edward Newgate, more commonly known as \"Whitebeard\", was the captain of the Whitebeard Pirates and widely known as the \"Strongest Man in the World\" and the \"Man Closest to One Piece\" after Gol D. Roger's death."}, {"type": "paragraph", "text": "In the past before forming his own crew, he was a member of the legendary Rocks Pirates and later in life he became a member of the Yonko that rule over the New World, before his death in the Battle of Marineford."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "In his younger days, he wore an open dark gray vest and a black bandanna, and his trademark mustache was nonexistent. Later in his life, he grew the prominent crescent-shaped mustache, which would spawn his epithet, \"Whitebeard\". When he was 52, he wore a white and yellow pirate hat with his jolly roger on it over a black bandana with black and red, both worn over long, blond flowing hair he had back then."}, {"type": "paragraph", "text": "Whitebeard was an abnormally large man, with a height of 666 cm (21'10\"). Unlike other large-sized humans, however, he was well-proportioned. He had a long face, ploughed because of the advanced age with many wrinkles around his eyes, and many scars running along his chest, and was very muscular. The muscles on his biceps seemed to grow bigger whenever he used his quake-based powers. Like all of his men, he had his own Jolly Roger tattooed on his back. In the manga, his eyes are brown, but in the anime, his eye color is seen to be yellow."}, {"type": "paragraph", "text": "He wore a black bandanna around his head and adorned himself with a white captain's coat, which hung loosely from his broad shoulders and bore his Jolly Roger symbol. He was always seen bare-chested, and wore light, loose pants tucked inside his large black boots, and a dark pirate sash around his waist. While not in battle, Whitebeard was typically on oxygen and attached to several medical sensor machines, due to health issues concerning his age."}, {"type": "paragraph", "text": "In the manga, after Akainu melted off a portion of his head, Whitebeard lost his left eye and the left side of his mustache (this was changed to just losing the left side of his mustache in the anime) as well as a massive hole in his torso (a second, bigger hole in the stomach was also dealt by Akainu in the anime). However, for the entire 72 years that he lived, he had never once received a wound on his back because he never ran away from his battles."}, {"type": "paragraph", "text": "As a child, he wore a light colored sleeveless shirt with the word \"Power\" (力 Chikara) written on it. He also wore shorts and a white bandanna. He had bandaged scrapes and cuts from his fights."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Edward Newgate was a cheerful and carefree person during his younger years, prior to commanding his own ship and becoming known as Whitebeard. Due to being an orphan who grew up in poverty, Newgate has a strong desire for a family, which he saw as the greatest treasure."}, {"type": "paragraph", "text": "His reign on the sea, reputation, and foreboding power made him seemingly overconfident and fearless. In initial appearances, he seemed unable to see any cause for alarm on any decision he made and refused all advice given to him, such as his nurse telling him not to drink heavily or Shanks warning him of Blackbeard. However, he was much more thoughtful than he initially appeared to be. Actions that initially seem to be the result of thoughtless, headstrong bravado actually had strong reasons behind them; his loud declaration that Fish-Man Island belonged to him freed the island from all pirates and slavery, and his insistence that Blackbeard be punished was merely a cover for Ace, who had set out after him against Whitebeard's wishes."}, {"type": "paragraph", "text": "Though he may have seemed to have an overgrown ego, deep down, Whitebeard knew that he was nothing but a single man and was fully aware of his own mortality. He knew that the youth are the keys to the future, and that their lives are far more important than his own."}, {"type": "paragraph", "text": "Despite his fierce reputation, Whitebeard is an extremely compassionate man, having adopted countless people of different background into his crew as his foster children, such as Squard whom he took in after the latter was devastated in loneliness after Roger killed his crew. Marco stated that the main reason the Whitebeard Pirates held such strong loyalty to their captain was due to Newgate's compassion, deeply caring for them like a father. Contrary to the tyrannical Kaido and Charlotte Linlin, Whitebeard used his power and influence as a Yonko to help people such as liberating and protecting Fish-Man Island from slavery, an act which touched the hearts of the citizens of Ryugu Kingdom whom were normally distrustful of humans. The ultimate proof of his compassion came when he declared war with Marine Headquarters solely to save Ace's life."}, {"type": "paragraph", "text": "A distinguishing feature of Whitebeard's nature was his high moral standards: he never forgave the death of a crewmate, and believed that a man cannot live without some form of moral code. Another example is taking on Blackbeard in order to avenge Thatch, despite being close to death at the time. However, he was willing to go against his moral code under certain circumstances, such as when he instructed Ace to let Blackbeard go because he had an uneasy feeling about him."}, {"type": "paragraph", "text": "Like Gol D. Roger, Whitebeard believed that a child should not be responsible for their parents' sins, and he told Squard that Ace should not be held responsible for Roger killing his (Squard's) original crew."}, {"type": "paragraph", "text": "He also seemed to enjoy talking about the past; the first things he talked about when Shanks visited were old memories from the past twenty-two years, and when he saw Buggy during the Paramount War, he recalled some memories from the past. People that were children at that time were still children in his eyes, even men as powerful as his fellow Yonko Shanks and Admiral Aokiji."}, {"type": "paragraph", "text": "One way to appease him involved bringing and sharing with him a drink (preferably of high quality and very expensive) while striking up a conversation. This was seen with his encounters with Shanks, Gol D. Roger, and Shiki; however, this did not guarantee complete cooperation from him, judging from the nature of these conversations."}, {"type": "paragraph", "text": "Whitebeard believed that it is fine when a man decides what to make of his life if he does not live to regret it. After being stabbed by Squard, Whitebeard remained forgiving and understanding toward his subordinate."}, {"type": "paragraph", "text": "Whitebeard was very careful about choosing a person to be included in his crew, depending on their personality and nature. This cautiousness mainly stemmed from his time as a member of the Rocks Pirates, as the violent and poor relationship in that crew left a negative impact on Whitebeard, thus he vowed to never let such relationship occur in his own crew."}, {"type": "paragraph", "text": "Like other characters in One Piece, he has a unique laugh, which is \"Gu ra ra ra ra\". Like Perona, his laugh is similar to the name of his Devil Fruit, the Gura Gura no Mi. However in the anime (before the Marineford Arc) and Gigant Battle, his laugh was changed to a regular \"Ha ha ha ha ha\". In the American Shonen Jump, his laugh is changed to \"Gu ha ha ha ha\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Whitebeard considered every single member of his crew, as well as his subordinate crews, his \"sons\". His strong love for his crew and subordinate crews traced all the way back to before he even had a crew, when he stated that the one thing he wanted more than anything was a family."}, {"type": "paragraph", "text": "Any crewmember from Whitebeard's crew who killed another crewmember were to be hunted down by the commander of that former crew member's division. Whitebeard's strong stand against crewmate killing was based on his fatherly stance over every member of his crew; as a result of this treatment, the whole crew affectionately referred to him as \"Pops\" or \"Old Man\" (オヤジ, Oyaji, an informal variation of \"father\"). However, Whitebeard did not force commanders to hunt down wayward crew members if he had an uneasy feeling about the situation; in the case of Blackbeard, Whitebeard tried to make an exception and stop Ace from hunting him down, but Ace did so anyway for the sake of Whitebeard's honor."}, {"type": "paragraph", "text": "This was not blind loyalty, as Whitebeard was willing to go to war with the World Government to save Ace. In addition, Whitebeard took full responsibility for the actions of his crew and kept a stern outward appearance for non-crew members, falsely claiming to outsiders that he ordered Ace to hunt down Blackbeard. Whitebeard also treated all of his \"sons\" and \"daughters\" equally, and claimed to Squard that Ace was no different than any other, despite being Roger's son. In battle, while this unshakable bond between him and his crew stood, Whitebeard's subordinates knew better than to get in the way of their captain."}, {"type": "paragraph", "text": "Marco had a very strong bond with Whitebeard. During the Marineford War, he was the first and only crewmate who rushed to Whitebeard's aid after the latter was stabbed by Squard. Later, Marco attempted to assist his captain in fighting Blackbeard, but was ultimately ordered to stand down."}], "images": []}, {"title": "Subordinate Crews", "level": 3, "content": [{"type": "paragraph", "text": "Aside from their own 1600 member crew, the Whitebeard Pirates had many subordinate crews working in the New World. Each one of the pirate captains was an infamous pirate who had made a name for him or herself in the New World. There seemed to be at least 43 crews underneath Whitebeard. Whitebeard treated all of his long-time subordinate crews just like his own crew, as though they were his own sons, though some of them were originally from the main crew before becoming captains of their own crews. They all seemed to know Ace, at least, and were willing to help Whitebeard's cause when Ace was about to be executed at Marineford; however, they were not aware that Ace was Roger's son until around the time Ace died. These New World subordinate crews included \"Bohemian Knight\" Doma, \"Thunder Lord\" McGuy, the Decalvan Brothers, \"Great Whirlpool Spider\" Squard,Little Oars Jr., and the \"Ice Witch\" Whitey Bay."}], "images": []}, {"title": "Squard", "level": 4, "content": [{"type": "paragraph", "text": "After losing his entire crew to Roger, Squard was taken in by Whitebeard, who treated him like a son and saved him from the loneliness of losing all of his comrades. Squard, in return, thought of Whitebeard as a father figure, but felt betrayed when he thought that Whitebeard was planning to sacrifice all of his subordinate crews to save Ace. When Whitebeard proved otherwise, Squard broke down in tears at his mistake. He later attempted to redeem himself at the cost of his own life by charging head-first into battle, but Whitebeard himself stopped and reprimanded him."}], "images": []}, {"title": "Friends and Allies", "level": 3, "content": [], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Because of his role as a protector of Fish-Man Island, Whitebeard was considered a hero by many Fish-Men, in particular Jinbe of the Shichibukai. Jinbe has expressed many times that he owes a great deal of gratitude to the Yonko and refused to participate in the war against Whitebeard, even if it meant losing his Shichibukai title and being imprisoned in Impel Down. Over the years, Jinbe's respect has grown to the point where he will readily declare himself as an adversary to anyone or anything with ill intent upon the Yonko's life, which is why he immediately engaged in battle against Ace on their first encounter, since Ace was out to assassinate Whitebeard at that time."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard seemed to have some form of respect for Luffy after hearing about him from both Ace and Shanks; Ace had shown excitement that Luffy was on the Grand Line, and Shanks had stated that he had given up his arm on a \"bet on the New Age\", referring to Luffy. After showing his fierce tenacity, Luffy had managed to gain Whitebeard's respect. Whitebeard went as far as assigning his top commander, Marco, to act as Luffy's bodyguard during the war and \"would not have forgiven him\" if Luffy had died."}, {"type": "paragraph", "text": "As the war went on, his respect for Luffy increased after witnessing Luffy's true potential, and Whitebeard decided to command all his forces to fully support Luffy with all their might, a decision which even surprised his own men. This also marks the first time that Whitebeard called him by his name, Straw Hat Luffy, instead of \"brat\", proving that Whitebeard came to acknowledge him and his strength through the course of the war. Luffy respected Whitebeard as well, believing that anyone whom Ace admires cannot be a bad person, and was willing to intercept an attack from Crocodile aimed at Whitebeard's life before he even met him in person."}], "images": []}, {"title": "Impel Down Escapees", "level": 4, "content": [{"type": "paragraph", "text": "Alongside Luffy were many Impel Down convicts who escaped from prison, including Emporio Ivankov, a Revolutionary Army commander, and Buggy, a former member of the Roger Pirates. All of these convicts were powerful people, and a majority of them fought against Whitebeard's opposition, which made them valuable assets to Whitebeard's cause. Whitebeard also proposed an alliance with Buggy, as he recognized the threat his new crew imposed, though he did not see Buggy himself as anything threatening."}], "images": []}, {"title": "Neptune", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard was an old friend of King Neptune. Their friendship stemmed from when they first drank together, and Whitebeard protected Fish-Man Island from slavery due to this friendship. Though it is unknown how they became friends, it is known that they had been friends for quite some time, as Neptune helped Whitebeard out a lot during his younger days."}], "images": []}, {"title": "Protectorates", "level": 3, "content": [{"type": "paragraph", "text": "Before his demise, Whitebeard had a number of locations under his protection. Most of them seem to be within the brink of pirate raids, and it was only by being \"owned\" under his name that they were kept stable and safe, thereby earning the Yonko the gratitude of the citizens; consequentially, these territories immediately became vulnerable after his death. At least one other Yonko, Big Mom, placed Fish-Man Island under her protection while Foodvalten fell to Brownbeard. The status of Whitebeard's other former territories is currently unknown, but Blackbeard appears to have taken over most of them during his ascent to Yonko status, as he has over two decades of experience with the Whitebeard Pirates and thus knows which islands they were protecting."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Gol D. Roger", "level": 4, "content": [{"type": "paragraph", "text": "Despite having been rivals with Gol D. Roger, Whitebeard held great respect for him. Not long before his death, Roger met with Whitebeard on an island to have what seemed to be an entirely cordial drinking session, with Roger even offering to give the location of Laugh Tale to Whitebeard, and when Whitebeard asked Roger about the Will of D., Roger willingly told him about it. Upon learning that Ace was his rival's son, Whitebeard did not see his bloodline as an inconvenience, and even tried to inspire Ace to respect Roger as his father."}], "images": []}, {"title": "Impel Down Convicts", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard made many enemies over the years besides the other Yonko and the World Government. There are many prisoners in the lower levels of Impel Down who wished to kill him because of personal grudges, though the only one known by name is Crocodile."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard respected both Monkey D. Garp and Sengoku, a respect which was mutual. He considered them the few people that knew the seas from Roger's era who are still alive in the present. On the other hand, he considered other younger Marines to be \"brats\" and refused to give any of them, including the powerful admirals, much respect. However, Sakazuki earned Whitebeard's wrath for killing Ace, and Whitebeard brutally injured him."}], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Marshall D. Teach, also known as Blackbeard, was Whitebeard's greatest enemy for killing Thatch and enabling Ace's capture and execution. Claiming that Blackbeard alone was the only one whom he refused to consider his son, Whitebeard attempted to take Blackbeard's life prior to his death. Just before dying, Whitebeard openly declared that Blackbeard was not worthy of being Roger's successor. After Whitebeard's death, Blackbeard stole his Devil Fruit powers and conquered his territories and usurped his post as a Yonko."}], "images": []}, {"title": "Yonko", "level": 3, "content": [], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Since none of the Yonko work together, any other Yonko is a threat to him and his crew. In his first appearance, Whitebeard received a letter from Shanks delivered by Shanks's newest crewmate, Rockstar. However, before even reading the letter, Whitebeard threw it away, claiming that Shanks should come in person with some expensive sake if he wanted to talk. Most of all, he refused to accept Shanks as anything more than the kid he was 22 years ago and believed he was 100 years too young to tell him what to do."}, {"type": "paragraph", "text": "Despite being enemies, Shanks held great respect for Whitebeard, which made him willing to lend his aid to Whitebeard by preventing the Yonko Kaido from reaching Whitebeard, allowing him to reach Marineford without any hindrance. After Whitebeard's death, Shanks saved Whitebeard's crew and their other subordinate crews  and gave Whitebeard and Ace a proper burial."}], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "In the past, they used to be part of the Rocks Pirates. After the incident at God Valley, they went their separate ways to form their own crew and became Yonko."}, {"type": "paragraph", "text": "Under normal circumstances, they did not provoke each other. However, Kaido saw an opportunity to eliminate his adversary prior to the impending Battle of Marineford and did not hesitate to attempt to do so. Two years later, Kaido cursed Whitebeard for being able to die while he remained alive."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "In the past, they used to be part of the Rocks Pirates. After the incident at God Valley, they went their separate ways to form their own crew and became Yonko. Not much is known of their standing, though they did not seem to be hostile with one another."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Shiki", "level": 4, "content": [{"type": "paragraph", "text": "In the past, they used to be part of the Rocks Pirates. After the incident at God Valley, they went their separate ways to form their own respective crew."}, {"type": "paragraph", "text": "Shiki did seemlingy not have a bad relationship with Whitebeard, he thought of him as a strong man, able to take over Roger's dominion of the sea, as he said when they were drinking together on the Moby Dick and speaking about old times. Whitebeard was apparently knowledgeable about Shiki's penchant for planning."}], "images": []}, {"title": "Edward Weevil", "level": 4, "content": [{"type": "paragraph", "text": "Edward Weevil claims to be Edward Newgate's biological son. However, many doubt this claim, and it is unconfirmed whether he actually is Whitebeard's biological son or not. Weevil and his mother seek to obtain Whitebeard's fortune due to their belief that they are his rightful heirs, and to this end they have been hunting down Whitebeard's surviving allies and their subordinate crews in order to claim it. Weevil also wishes to avenge Whitebeard's death by killing the Yonko Marshall D. Teach, indicating that, at the very least, he truly believes himself to be Whitebeard's son."}], "images": []}, {"title": "Bakkin", "level": 4, "content": [{"type": "paragraph", "text": "Bakkin is the self-proclaimed lover of Whitebeard and mother of Edward Weevil. She claims and/or believes herself to have been Whitebeard's lover, and that he is the father of her son, which she believes makes her and Weevil the rightful heirs to Whitebeard's fortune. It is currently unknown if any of her claims concerning her and Weevil's relationship to Whitebeard are true or not."}], "images": []}, {"title": "Rocks D. Xebec", "level": 4, "content": [{"type": "paragraph", "text": "Rocks D. Xebec was Whitebeard's former captain during his days as a member of the Rocks Pirates. It's unknown what kind of relationship they had, but it can be assumed that Whitebeard had immense respect for Xebec, since he willingly worked under him alongside other members who he had nothing but disdain for."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "Whitebeard was one of the most powerful and influential pirates of his generation. He garnered the title \"Strongest Man in the World\" before even the late Pirate King Gol D. Roger's death and was one of the world's few to ever match Roger in one-on-one combat."}, {"type": "paragraph", "text": "After Roger's death, Whitebeard became one of the Yonko, the four most formidable pirates ruling the latter half of the Grand Line; the biggest pirate threats to the World Government. Prior to his own passing, Whitebeard held not only the highest bounty among those four, but the second highest in recorded history, at over 5 billion (only behind Roger's own)."}, {"type": "paragraph", "text": "Whitebeard's reputation alone made his simple declaration of Fish-Man Island being his territory enough to keep slave traders and pirates from attacking the island further, making Whitebeard himself far more effective than the treaty signed with the World Government 200 years before his death."}, {"type": "paragraph", "text": "Whitebeard was the captain of the Whitebeard Pirates, directly controlling an enormous pirate fleet of 1,600 pirates divided into 16 divisions, each one being led by an incredibly powerful division commander. A testament to his power is the fact that the Shichibukai and World Government used virtually all their power to prepare to fight him and his crew."}, {"type": "paragraph", "text": "Whitebeard's powers were so vast that few would dare to challenge him, making Ace, Crocodile, Aokiji, Kizaru, Akainu, Blackbeard, Kaido, and Luffy a few very brave and powerful people. In the past, Ace tried to kill Whitebeard over a hundred times, with each attempt resulting in subsequent failure and injury; Whitebeard's retaliation was so effortless that he was able to counterattack even while sleeping."}, {"type": "paragraph", "text": "After Akainu killed Ace, Whitebeard brutally injured the Admiral, who was practically helpless in response to Whitebeard's power. He was able to defeat Akainu with a mere two attacks despite the Yonko being on the brink of death due to his illness and severely injured state at the time. Another example of his power was his \"fight\" with Shanks. When their weapons clashed, the heavens split in two."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Whitebeard was given the title of the \"strongest man in the world\" for his physical power, which is far superior to even a giant. During the Marineford War, Whitebeard completely overpowered vast numbers of strong Marine officers and giants with tremendous physical might, such as Vice Admiral Ronse, with only one hand and supplemented by his Devil Fruit powers. Whitebeard blocked a two-handed downward swing from the giant Vice Admiral John Giant with only one hand on his naginata, extinguished the flames of one of Akainu's molten rocks with just a single breath, and prevented a massive paddle ship from advancing using only one hand. He could jump to great heights to attack large opponents, such as John Giant."}, {"type": "paragraph", "text": "Despite his gigantic size, Whitebeard could move at considerable speeds, having appeared behind Akainu to attack him in a matter of seconds, with the latter (who was on his way to kill Luffy) only realizing it once his soldiers yelled at him to watch out."}, {"type": "paragraph", "text": "Whitebeard appeared to have debilitating health problems, possibly stemming from his advanced age and excessive drinking. When not in battle, he was always surrounded by nurses, used oxygen tubes, and was hooked up to intravenous tubes and life support systems; despite this, he used to literally drink sake by the barrel. However, Marco noted that Whitebeard's health had gotten worse, and he no longer possessed the reflexes to avoid Squard's surprise attack, which was, in the past, something easy for him to achieve. Even with his health issues, Whitebeard was still considered the world's most dangerous and powerful pirate, which raises the question of how powerful he must have been in his prime."}, {"type": "paragraph", "text": "Whitebeard's physical resistance and pain tolerance were tremendous: he was able to keep fighting despite the number of life-threatening injuries he sustained, which included part of his head being burned off. This also proves that Whitebeard possessed enormous amounts of stamina and endurance; no matter how much damage he took throughout the battle, Whitebeard continued to press forward and fight, only stopping once almost all of the Blackbeard Pirates collectively shot and brutally stabbed him to death at point-blank range. It was shown that even in his old age, in a heavily wounded state and without access to his Devil Fruit and Haki powers, he could near-effortlessly take down a Shichibukai-level opponent, as demonstrated in his fight against Blackbeard."}, {"type": "paragraph", "text": "During the War at Marineford, Whitebeard sustained 267 sword wounds, 152 gunshot wounds, and 46 wounds from cannonballs, and got a portion of his head blasted off, resulting in 465 injuries in total. In addition, he received one of Kizaru's laser beams and two of Akainu's magma blasts. Whitebeard also received a brutal assault from the Blackbeard Pirates. However, even after taking so much damage in his already weakened state, he died standing, an impressive feat when compared to other characters. Even Teach was shocked by Whitebeard's tenacity."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Whitebeard_Refusing_Medical_Treatment.png/revision/latest/scale-to-width-down/210?cb=20130519152329", "caption": "Whitebeard refuses to use his medical apparatus while his crew fusses over him."}]}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Besides his formidable power, Whitebeard was a brilliant leader and an incredibly skilled military strategist: a match for former Fleet Admiral Sengoku, one renowned as \"The Resourceful General\" for his famed acumen on the field of battle. The Yonko's tactical prowess was demonstrated when he saw through Sengoku's deliberate leak of information regarding a change of schedule for Ace's execution, and when he foresaw the Pacifista's arrival at Marineford and scattered the pirates so that they would not be routed by the cyborgs."}, {"type": "paragraph", "text": "In addition, Whitebeard could easily adapt to rapidly-changing situations even in the heat of battle, as shown when he bypassed a siege wall impervious to his Devil Fruit powers by having Oars, who was in a near-death state, help carry the paddle ship into the Marineford plaza. Even when he was on the brink of death, Whitebeard quickly thought of a countermeasure against Teach's Devil Fruit power's nullification abilities by using his naginata to cut Teach down, taking him off guard for him to use his quake powers to injure him."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Whitebeard ate the Gura Gura no Mi, a Paramecia-type Devil Fruit that made him a \"Quake Man\" and which was considered the strongest Devil Fruit within the Paramecia class. According to Sengoku, Whitebeard had the power to destroy the world."}, {"type": "paragraph", "text": "With the power of this Devil Fruit, Whitebeard could create powerful shockwaves by shattering the air like glass. These shock waves then would be redirected into the ground, resulting in earthquakes and, if under the seafloor, tsunamis. He could create these shockwaves in the air, rendering airborne attacks ineffective. He could also use these shockwaves to attack enemies, with either widespread or specific targets. Whitebeard's powers also allowed him to create a quake bubble around his hand or naginata to increase the power of his physical attacks, as well as manipulate the air with his hands to tilt the environment around him. He also used his naginata to slash the air, which caused a massive explosion and the collapse of a tower in Marineford."}, {"type": "paragraph", "text": "Whitebeard could also use these shockwaves to block physical attacks as well as non-physical attacks, making his Devil Fruit powers excellent for both offensive and defensive capabilities."}, {"type": "paragraph", "text": "Soon after Whitebeard's death, the power of the fruit was extracted by Blackbeard through unknown means."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Gura_Gura_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20141009104038", "caption": "Whitebeard uses the Gura Gura no Mi."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Whitebeard wielded a gigantic bisento called Murakumogiri which is one of the 12 Sajio O Wazamono Meito. He was immensely skilled with the blade even in old age. He could use Murakumogiri to fight off countless powerful Marines in Marineford, including Marine Admirals, and during his prime, he also clashed with Kozuki Oden who was one of the strongest samurais of Wano. When he was a child, he had a much smaller and less well crafted spear made up of a simple knife bound to a pole."}, {"type": "paragraph", "text": "After Whitebeard's death, it became a marking for his burial site, with his coat, a bouquet of flowers, and the crew's flag hanging from it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6d/Whitebeard_Swings_His_Bisento.png/revision/latest/scale-to-width-down/210?cb=20151028144452", "caption": "Whitebeard swings Murakumogiri in conjuncture with his Devil Fruit powers."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Whitebeard is one of the very small number of people in the world who can use all three types of Haki."}], "images": []}, {"title": "Haoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard possessed Haoshoku Haki. During his initial encounter with Kozuki Oden 30 years ago, their sudden clash created a notable effect similar to lightning and released a large burst. During the Marineford War, he was on the verge of using it against some of the World Government's executioners to protect Portgas D. Ace, but failed because of a sudden illness attack. He is capable of using this form of Haki in the video games One Piece: Pirate Warriors 2 and 3, as well as One Piece: Burning Blood."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard has immense mastery of Busoshoku Haki, which he used to negate the intangibility of Logia-based Devil Fruits. In the past, he was able to defeat Crocodile (though it is unknown if the former Shichibukai had already eaten his Devil Fruit) and to beat Ace more than one hundred times. During the Marineford War, Whitebeard successfully inflicted significant damage on Akainu where Marco, Vista, and Jinbe, who were highly skilled Busoshoku Haki users, failed to do so. During his prime, Whitebeard's Busoshoku Haki applied into his Murakumogiri is powerful enough to clash with Oden's superior Haki enhanced Enma and Ame no Habakiri, an amazing feat as both could bisect the Mountain God and also gave near indestructible Kaido a massive scar."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard is also masterful in using Kenbunshoku Haki. When he and his crew drifted to Wano thirty years ago, he could sense \"Oden\" coming from a vast distance before the two confronted each other. In the bay of Marineford, he predicted Crocodile's sudden attack but did not move, knowing that Luffy would block it. However, due to both his age and worsening health, he failed to predict Squard's betrayal and thus got injured, something which, according to Marco, was totally unexpected from the Yonko."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Childhood", "level": 4, "content": [{"type": "paragraph", "text": "After his home country, Sphinx, became too poor to be a member nation of the World Government, Newgate became an orphan. He became a pirate at an early age and supported his village with the money and resources he gained."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Newgate%27s_Childhood.png/revision/latest/scale-to-width-down/210?cb=20190623030233", "caption": "Newgate growing up in poverty."}]}, {"title": "Younger Days in Piracy", "level": 4, "content": [{"type": "paragraph", "text": "Before forming the Whitebeard Pirates, he was just another crewmember in another crew going by his real name \"Newgate\" and that he was not interested in treasure, but instead wanted a family."}, {"type": "paragraph", "text": "Some time after this, he joined the Rocks Pirates but eventually left after the God Valley Incident and 33 years ago, he would go on to form his own pirate crew, the Whitebeard Pirates."}, {"type": "paragraph", "text": "30 years ago, Whitebeard and his crew were shipwrecked at Wano Country. They encountered Kozuki Oden and he asked to join his crew after a brief clash with Whitebeard."}, {"type": "paragraph", "text": "Afterwards, Whitebeard and his crew had a feast with Oden and his retainers. Oden kept asking to join only to be turned down. Two weeks later, the Whitebeard Pirates tried to leave Oden behind, but he caught up to them and held onto a chain he attached to the ship. Izo also held onto Oden and got dragged away with him. After pulling Izo up onto the ship, Whitebeard gave Oden a test. If he could hold onto the chain for three days, he would be allowed into the crew. Just when Oden only had ten minutes left, he heard a woman in trouble and let go, drifting to an island. On the next day, Whitebeard found Oden and a woman named Toki confronted by Karma and his crew. Whitebeard defeated Karma and finally allowed Oden to join his crew. Inuarashi and Nekomamushi, who had stowed away on Whitebeard's ship, joined the crew as well."}], "images": []}, {"title": "Clashing of the Crews", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard, Gol D. Roger, and Shiki ruled the seas in the days before the Great Age of Pirates. Whitebeard and Roger competed often. Whitebeard came to know certain members of Roger's crew, such as Shanks and Buggy. Somewhere along the Grand Line, Roger pulled away from Whitebeard and made it to Laugh Tale. At some point, the two grew to respect each other, and Whitebeard was one of those Roger met shortly before his death to say goodbye. During the meeting, Roger explained the Will of D."}, {"type": "paragraph", "text": "After Roger's execution, Shiki broke out of Impel Down and had a meeting with Whitebeard aboard the Moby Dick. When Shiki attempted to form an alliance between the two of them, knowing that their combined power would be incredible, Whitebeard responded by threatening to have Shiki thrown overboard, which prompted Shiki to note how Whitebeard had not changed. After claiming it was \"Whitebeard's time\", Shiki informed him of his plan, leading Whitebeard to note Shiki was plotting something again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Whitebeard_and_Roger.png/revision/latest/scale-to-width-down/210?cb=20130405213116", "caption": "Whitebeard's last talk with Gol D. Roger."}]}, {"title": "The End of an Era", "level": 4, "content": [{"type": "paragraph", "text": "With Roger's execution, Whitebeard became the undisputed power of the sea for being the only one able to battle on equal terms with the Pirate King. Whitebeard was always fully aware of events in the Grand Line playing out around him, such as the frequent dueling between Dracule Mihawk and Shanks. In time, the World Government came to dub him, Big Mom, Kaido, and Shanks as the four strongest pirates in the New World, the Yonko."}, {"type": "paragraph", "text": "Some time after the beginning of the Great Age of Pirates, Whitebeard went to Fish-Man Island and freed it from pirate attacks, stating that the attacking pirates had nerve attacking his old friend's kingdom. He claimed the island as his territory, and in doing so restored peace to the island. He defended Fish-Man Island because he was a good friend of King Neptune, with the two having drank together in the past. Ever since Whitebeard declared Fish-Man Island as his territory, no pirate dared to harm any of the fish-men and merfolk."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Edward_Newgate_Protects_Fish-Man_Island.png/revision/latest/scale-to-width-down/210?cb=20130602193031", "caption": "Whitebeard defends Fish-Man Island from pirates."}]}, {"title": "Expectations and Murder", "level": 4, "content": [{"type": "paragraph", "text": "At some point in the three years prior to Monkey D. Luffy setting out on his adventure, Whitebeard read about Portgas D. Ace's increasing fame as the captain of the Spade Pirates and how Ace refused the offer of a Shichibukai position. Right after the five-day fight between Ace and Jinbe, Whitebeard approached the Spade Pirates aboard the Moby Dick and told his own crew that he would deal with Ace alone."}, {"type": "paragraph", "text": "Whitebeard defeated both Ace and his crew without a single scratch on him. After the confrontation, Whitebeard, aware of Ace's talent, drafted him into his crew, eventually allowing him to become commander of his Second Division despite Ace's young age and multiple attempts to assassinate him."}, {"type": "paragraph", "text": "Around this time, Ace told Whitebeard about his father being Gol D. Roger, but Whitebeard claimed it did not matter because everyone was a son of the sea. When Blackbeard, who was back then a member of Ace's division, murdered the Fourth Division commander Thatch in order to acquire a Devil Fruit he had found, Ace decided to hunt down Blackbeard by himself. Even though Whitebeard did not want him to go because he felt uneasy about the situation, Ace left anyway."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Whitebeard_Offers_Ace_to_Join_His_Crew.png/revision/latest/scale-to-width-down/210?cb=20100815073208", "caption": "Whitebeard offers Ace a chance to join his crew as his son."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Some time later, Rockstar arrived, carrying a letter to Whitebeard from his own captain, Shanks. Unimpressed that Shanks sent him a letter instead of coming to see him in person, Whitebeard tore it up in front of Rockstar, whom he told that Shanks should see him in person and bring some good sake."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After fighting through a Marine blockade that had been set up to prevent them from meeting and knocking out dozens of the Whitebeard Pirates with Haoshoku Haki, Shanks finally arrived to talk with Whitebeard about Ace and Blackbeard. Whitebeard talked about Gol D. Roger and Shanks' past as an apprentice pirate on Roger's ship alongside Buggy. Whitebeard noted how the duels between Shanks and Mihawk still ringed in his ear. When the subject of his missing left arm was brought up, Shanks replied that he bet it on the new age."}, {"type": "paragraph", "text": "When Shanks asked him to stop Ace because he did not feel he was ready to face Blackbeard, Whitebeard laughed off Shanks' request, saying that he was 100 years too young to tell him what to do before telling him that Blackbeard must be taught a lesson about morality. Claiming he had nothing to fear, Whitebeard clashed with Shanks, causing the heavens above to split."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Shanks_vs._Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20170205001116", "caption": "Whitebeard and Shanks clash."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard and his pirate crew went to prevent Ace's execution, and the Marines and Shichibukai gathered to face him."}, {"type": "paragraph", "text": "Whitebeard's flagship, the Moby Dick, had started to move, and Whitebeard had taken out all 23 ships keeping an eye on him in an instant, leaving the Marines completely clueless as to exactly where and when he would attack.Kaido tried to attack Whitebeard, but Shanks intercepted him."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Whitebeard's fleet infiltrated Marineford Bay by sailing underwater through coating, and four of their five ships rose up to confront the Marines. Standing on the bow of the Moby Dick, Whitebeard unleashed two massive quakes on each side of the island, and Ace asked why they came to rescue him, as it was his fault he was captured. However, Whitebeard lied that he had told Ace to go after Blackbeard, which Marco affirmed. Whitebeard watched as his quakes caused two massive tsunamis to come toward Marineford, but they were frozen by Admiral Aokiji. Aokiji attacked Whitebeard, and the Yonko shattered his ice body with a quake, but the admiral froze the bay in response. Dracule Mihawk and Admiral Kizaru then unleashed long-range attacks on Whitebeard, but the attacks were respectively stopped by Jozu and Marco. Admiral Akainu launched magma meteors into the bay, but Whitebeard caught one of them on his naginata without issue."}, {"type": "paragraph", "text": "Little Oars Jr. of the Little Pirates made his way into the bay, and Whitebeard did not approve of his reckless actions, but aceded to his giant subordinate's wishes. Whitebeard was solemn when Oars Jr. was brought down by Gecko Moria, and Vice Admiral Ronse of the Giant Squad attempted to attack him by surprise. However, Whitebeard brought him down with a single quake-powered punch, and told his subordinates to press on past their fallen comrade. When he saw several Marines communicating via Den Den Mushi, Whitebeard wondered what Fleet Admiral Sengoku was planning."}, {"type": "paragraph", "text": "Whitebeard then saw as a ship containing Impel Down escapees fell onto the bay from the sky. One of the escapees was Crocodile, who attempted to attack Whitebeard and get revenge on him. However, Ace's brother Monkey D. Luffy kicked Crocodile away. Whitebeard warned Luffy that he would be throwing his life away by entering the battlefield, but Luffy did not care and brashly proclaimed that he would become Pirate King, not Whitebeard. Whitebeard was stunned, but quickly became impressed. Luffy told Whitebeard that Ace's execution was set to be moved up, and when Marco came with the same news, Whitebeard told him to remain calm. When Luffy went out onto the battlefield, Sengoku revealed to everyone that he was the son of Monkey D. Dragon, and Whitebeard told Marco that he would not forgive him if he let Luffy die."}, {"type": "paragraph", "text": "In order to neutralize any potential nuisance from the Impel Down escapees under Buggy's command, Whitebeard called out to Buggy and proposed an alliance, which the pirate delightfully accepted. Whitebeard attempted to contact Squard, but could not reach him, so he called the Decalvan Brothers instead and ordered them to split up the subordinate crews and lead them around the bay in both directions. Whitebeard grew annoyed when Crocodile continued fighting against his crew, but Crocodile was then dealt with by Jozu. Whitebeard then saw as Sentomaru led an army of Pacifista into the bay from the outside. Squard came onto the Moby Dick to report that their forces in the rear were being hit hard, and Whitebeard decided to join the fight. However, Squard then stabbed Whitebeard through the chest. Squard revealed that he had heard the Whitebeard Pirates and Marines made a deal for Whitebeard and Ace to survive during the war in exchange for the lives of Whitebeard's subordinate crews. Understanding that Squard felt betrayed by Ace's heritage, Whitebeard embraced and forgave him, saying he hated Gol D. Roger, but would not treat Ace differently because he was the late Pirate King's son; he loved all of his sons equally. Whitebeard then unleashed quakes that shattered the frozen tsunamis and gave his subordinates a way to escape, and he warned that anyone who stayed should be prepared to lose their lives as he leaped onto the battlefield."}, {"type": "paragraph", "text": "Whitebeard charged into battle, and clashed with John Giant of the Giant Squad. He unleashed a massive earthquake that tilted the entire island to one side, and hit John Giant with a large shockwave. The shockwave continued toward Ace's execution platform, but it was stopped by the three admirals. The Marines then put up an encircling wall between the pirates and Ace, and Whitebeard watched as Akainu destroyed the Moby Dick with magma fists. He silently apologized to his ship, and unleashed a quake at part of the encircling wall, but it only bent slightly. With Oars Jr. leaving an opening in the wall and regaining consciousness, Whitebeard told him to stay there as he prepared for his crew to charge into the plaza. The crew's final ship then surfaced, and Whitebeard had Oars Jr. pull it through the gap in the wall, allowing the crew to invade the plaza. Whitebeard then unleashed a devastating attack that took out dozens of Marines."}, {"type": "paragraph", "text": "Whitebeard attempted to attack again, but was frozen by Aokiji. However, the quake he had formed shattered the ice, and he attacked the admiral with his naginata. Aokiji attempted to move through his naginata, but was attacked by Jozu. Whitebeard caught a heavily injured Luffy after the latter was kicked away by Kizaru, and the admiral mocked Whitebeard for putting his trust in someone so weak. Whitebeard threw Luffy to his subordinates for his wounds to be treated, and then clashed with Akainu. When Monkey D. Garp attacked Marco, Whitebeard told his subordinates not to overestimate the vice admiral as he directed Akainu's magma attack into a settlement, destroying much of it. However, Whitebeard was suddenly seized by a sick cough, allowing Akainu to strike him."}, {"type": "paragraph", "text": "Whitebeard was then attacked by several Marines and was hit by multiple blades and bazooka shots. However, he proceeded to fight them off, refusing to die until he had secured his sons' safety, and several fighters gathered to defend him from behind. The Marines then attempted to execute Ace, and Whitebeard was unable to stop them. To his surprise, however, Luffy knocked out the guards by unleashing Haoshoku Haki. As Whitebeard continued fighting off Marines, he told his subordinates to back up Luffy. When Kizaru attempted to stop Luffy from reaching the execution platform, Whitebeard attacked the admiral. However, Kizaru shot Whitebeard through the chest and resumed going after Luffy. Despite this, Whitebeard watched as Luffy was able to free Ace."}, {"type": "paragraph", "text": "With Ace freed, Squard and his men attempted to ride the ship into the plaza in order to allow Whitebeard and his crew to escape. However, Whitebeard stopped the ship singlehandedly. He then declared that everyone was to escape while he would meet his end here at the end of this era, and he prepared for his final stand against the Marines. He rejected his crew's pleas against this and started attacking once more. Upon seeing Ace nearby, Whitebeard asked if Ace thought he was a good father, which Ace affirmed. However, Ace was soon fatally injured by Akainu, and Whitebeard wept as he watched his son die."}, {"type": "paragraph", "text": "Enraged at the death of Ace, Whitebeard brutally attacked Akainu with a quake punch to the head, and although Akainu responded by burning off a portion of his head, Whitebeard attacked him again with a powerful strike that heavily damaged Marine Headquarters. The attack created a chasm that separated Whitebeard from his crew as the Yonko continued fighting the Marines with ferocity. However, the battle was then interrupted by the arrival of the Blackbeard Pirates."}, {"type": "paragraph", "text": "Whitebeard immediately unleashed a quake at the wall Blackbeard was standing on, intending to avenge Thatch. Blackbeard stripped Whitebeard of his Devil Fruit powers with the Yami Yami no Mi, but Whitebeard struck his former son with his naginata before furiously slamming his head into the ground with a quake-imbued punch. Blackbeard then told his subordinates to attack, and he and his crew struck Whitebeard with several bullets and blades. Whitebeard told Blackbeard that despite carrying the initial D., he was not one of the people Roger was waiting for. He then proclaimed to the Marines that the discovery of the One Piece would result in a grand battle that engulfed the entire world, declaring that the One Piece did indeed exist. Whitebeard silently apologized to his crew and bid them farewell. He then died after having been slashed and stabbed 267 times, shot by 152 bullets, and hit by 46 cannonballs. Even in death, however, he remained standing, and did not have a single wound on his back."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e7/Whitebeard_Arrives_at_Marineford.png/revision/latest/scale-to-width-down/210?cb=20141206162940", "caption": "Whitebeard arrives at Marineford in order to save Ace."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Whitebeard_Defeats_Ronse.png/revision/latest/scale-to-width-down/210?cb=20141206092109", "caption": "Whitebeard beats Ronse in one shot."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3f/Squard_Stabs_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20141206162020", "caption": "Squard stabs Whitebeard through the chest."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bd/Whitebeard_Defeats_John_Giant.png/revision/latest/scale-to-width-down/210?cb=20141206161150", "caption": "Whitebeard defeats John Giant."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Sakazuki_Attacks_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20141206161512", "caption": "Akainu strikes Whitebeard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Borsalino_Attacks_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20160212193508", "caption": "Kizaru attacks Whitebeard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Whitebeard_Mourns_Over_Ace%27s_Death.png/revision/latest/scale-to-width-down/210?cb=20141206092231", "caption": "Whitebeard cries over the loss of his son, Ace."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/46/Whitebeard_Breaks_Akainu%27s_Ribs.png/revision/latest/scale-to-width-down/210?cb=20140801152509", "caption": "Whitebeard brutally injures Akainu."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Whitebeard_Dies_While_Standing.png/revision/latest/scale-to-width-down/210?cb=20130511050441", "caption": "Edward \"Whitebeard\" Newgate dies, yet his body refuses to yield."}]}, {"title": "Postmortem", "level": 3, "content": [{"type": "paragraph", "text": "After Whitebeard's death, Blackbeard used an unknown method to steal Whitebeard's Gura Gura no Mi powers from the corpse. When Shanks arrived to end the war, Whitebeard's and Ace's bodies were taken for a proper burial, a request that Sengoku allowed despite Vice Admiral Doberman wanting to show their heads to the world to symbolize the Marines' victory. Whitebeard, along with Ace, were buried on an island near Whitebeard's homeland somewhere in the New World."}, {"type": "paragraph", "text": "His coat and naginata were made into a grave marker, with his pirate flag tied to it and a bouquet of flowers hanging from the halberd's handle. His grave was put beside Ace's and filled with flowers and swords left behind by his crew members, and the members themselves stood on either side of the island, paying their last respects to the two deceased."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Tomb_of_Ace_and_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20141206163731", "caption": "Whitebeard and Ace's graves."}]}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Two years later, the grave markers had become tattered with age. Sabo visited them and placed a bottle of sake and three cups on a crate next to Ace's grave, pinning the recent newspaper article of the Straw Hats' return onto Ace's grave as a message to him that Luffy is doing fine."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Tomb_of_Ace_and_Whitebeard_Post_Timeskip.png/revision/latest/scale-to-width-down/210?cb=20140928200911", "caption": "The graves after two years."}]}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "Whitebeard's death was a devastating blow to the balance of power in the world. Because of his great power and influence, many of the islands he controlled as protectorates descended into anarchy as pirates began invading his territory. One of the more prominent pirates was his assassin, Blackbeard, who annexed most of Whitebeard's territory and usurped his previous status of Yonko. Nonetheless, Whitebeard's dying words provoked the New Age of piracy and inspired countless pirates to voyage to the New World, just as Gol D. Roger did. Also, two pirates who claim to be the late Yonko's son and lover are going after his crew and subordinate crews in order to claim his non-existent fortune."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Edward Newgate vs. Marine Bazooka Unit", "elements": []}, {"text": "Edward Newgate vs. Z (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Appearance", "level": 3, "content": [{"type": "paragraph", "text": "In the manga and other related merchandise, the interior color of Whitebeard's coat was initially green. In the anime and other related merchandise, it is red. Later in the manga, however, this was changed to red. In his initial appearance in the anime, his eyes were black like many male characters of the series, but this was changed to a golden yellow color by the Battle of Marineford."}, {"type": "paragraph", "text": "In the manga, Whitebeard has no hair showing, but in the anime, he initially had some brown hair; his hair was later retconned to follow the manga. His pants were also left hanging over his boots in his first appearance in the anime and during one of the scenes of his meeting with Shanks; in the manga, his pants were always tucked inside his boots."}], "images": []}, {"title": "War at Marineford", "level": 3, "content": [{"type": "paragraph", "text": "After Ace's death, Whitebeard tried to stop Akainu but was attacked by Kizaru. In Episode 484, instead of burning off a portion of Whitebeard's head, Akainu only managed to remove part of Whitebeard's mustache. Instead, Akainu successfully punched another hole in Whitebeard's torso and visibly filled him with magma. Also, the battle between Whitebeard and Akainu went on longer, with Whitebeard launching more vicious attacks against the admiral. The fight between Whitebeard and Blackbeard is extended in the anime. Blackbeard manages to land punches on Whitebeard's torso and chin. Even after the initial strike proved Whitebeard's quake punch has no effect on Blackbeard, Whitebeard continued to punch several more times before using his naginata. Whitebeard was unable to move after his last attack on Blackbeard, but managed to move forward with his body turned red with smoke coming out of it, similar to Luffy in Gear Second. This was likely done to signify his fury. Additionally, Whitebeard's speech about One Piece was longer in the anime."}, {"type": "paragraph", "text": "After Whitebeard's death, when the narrator lists all the injuries Whitebeard suffered, swords that have pierced his front and through his body could be seen with the tips protruding from his back. In the anime, there were no swords at all in his body."}, {"type": "paragraph", "text": "Later, in Episode 507, when Usopp dropped a newspaper covering the aftermath of the war, Whitebeard's body was shown to match the manga's depiction as opposed to the anime's censorships: his torso had swords sticking out, he was posed to make it looks like portion of his head was torn off, and the gaping hole on his stomach that Akainu inflicted on him in the anime was missing, leaving only the hole in his upper chest."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/60/Whitebeard%27s_Death_in_the_Anime.png/revision/latest/scale-to-width-down/210?cb=20130504040534", "caption": "Whitebeard's death in the anime."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/47/Whitebeard_Anime_Death_Newspaper.png/revision/latest/scale-to-width-down/210?cb=20120314071525", "caption": "Whitebeard's body in the newspaper."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "As confirmed in One Piece Yellow: Grand Elements, Newgate's official English epithet is \"Whitebeard\", despite him having no actual beard. In the Japanese language, there are no distinct terms for beard or mustache; instead, Whitebeard's name contains the word \"Hige\", which is a blanket term for facial hair."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Several action figures of Edward Newgate have been produced. He has twice been featured as part of MegaHouse's Portrait of Pirates collection of a 1/8 scale figures: once in July 2011 in his present day appearance, and again in September 2013 in his youthful appearance (called \"Ver. 0\"). A 9\" figure was featured as part of the Figuarts ZERO One Piece series.Banpresto has released two Whitebeard figures as Ichiban Kuji prizes, one in August 2010  and another in April 2012."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/19/Edward_Newgate_DX_Figure.png/revision/latest/scale-to-width-down/120?cb=20130222084311", "caption": "Edward Newgate DX figure."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Adventure", "elements": []}, {"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Universal Studios of Japan built a replica of Ace's and Whitebeard's tombs. Whitebeard's epitaph says: \"Edward Newgate, captain of the Whitebeard pirates, here lies a great captain and father, liberated from the exhausting role and labor, who captained the Moby Dick in the spectacular Era of Pirates\".", "elements": []}, {"text": "Whitebeard is widely regarded as the \"strongest man\" in the world. In comparison, Kaido is said to be the \"strongest creature\" in the world, though the extent of his powers remains unknown.", "elements": []}, {"text": "He is one of three characters whose name comes from the real life Blackbeard, otherwise known as Edward Teach; the others being Marshall D. Teach and Thatch.", "elements": []}, {"text": "He shares his name with the Newgate Prison, which was a notorious prison in London, active during the Golden Age of Piracy, and where many infamous pirates (and other criminals) were incarcerated; including William Kidd and members of the \"King of the Pirates\" Henry Every's crew.", "elements": []}, {"text": "In the 6th Japanese fan poll, Whitebeard ranked 28th.", "elements": []}, {"text": "At 72 years old, he is the oldest known Yonko in the series.", "elements": []}, {"text": "Whitebeard held the highest bounty among the Yonko (both past and present), and the second highest recorded bounty among all pirates, surpassed only by Roger.", "elements": []}, {"text": "A pirate with a similar crescent-shaped mustache, Gally, can be seen in Oda's early Romance Dawn one shots.", "elements": []}, {"text": "Oda explained in an extra pamphlet (that came with initial copies of Databook Yellow) titled \"One Piece Paradise Vol. 2\", that Whitebeard was directly modeled after the barkeep of the pub he used to frequent with his previous manager. This barkeeper passed away in 2007.", "elements": []}, {"text": "In a SBS, Oda jokingly stated that Whitebeard once had a dog, Stefan, with a mustache similar to his own.", "elements": []}, {"text": "Whitebeard shares several characteristics with the legendary warrior monk, Musashibo Benkei. A popular figure in Japanese folklore, Benkei was said to have been five times the size of a normal man, possessed inhuman strength, and wielded a naginata as his weapon of choice. He famously died in a standing position, with his body riddled with arrows and spears.", "elements": []}, {"text": "Whitebeard's favorite foods are alcoholic beverages and cheap food.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Whitebeard_and_Ace%27s_Graves_at_Universal_Studios_Japan.png/revision/latest/scale-to-width-down/180?cb=20121226162820", "caption": "Whitebeard and Ace's graves made by Universal Studios of Japan."}]}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Poseidon – Wikipedia article on the Greek god Whitebeard shares a resemblence with.", "elements": []}]}], "images": []}]}