{"sections": [{"title": "Sam", "level": 1, "content": [{"type": "paragraph", "text": "Sam-san (サムさん, full title: \"Ordinary everyday person\" Sam-san) is a drunk man from Cocoyasi Village. On many occasions, he wanders around unknowingly when is drunk."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sam is a man that is bald at the top, but has black hair on the sides of his head, and has a black mustache which is straightened down on both ends. He wear a black suit with a white dress shirt and purple tie (white in the anime). His face is usually red due to his drunkenness. He has also been seen carrying a package at times."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sam is a very stressed out person due to the rebellious nature of his daughters. To cope with his stress, he drinks heavily and has a habit of getting very drunk. When he's drunk, he becomes much more fun loving and joins any crowd or party he would happen to run into."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When his eldest daughter was eight, his wife left him and their daughters behind. Throughout the years, he had to raise his daughters on his own. His second daughter was a big troublemaker growing up and had caused him many problems."}], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Arlong was defeated and Arlong Park destroyed, Sam was seen celebrating with the other villagers at the fish-man's defeat. It is revealed that he was drunk on his way home from his daughter's wedding and saw a party, which prompted him to join in."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the Cooking Championship at Loguetown, Sam was passing by on his way home after attending a wedding when he was invited by Sapi to serve as a judge in the name of fairness. After Sapi asked him if he was ready, Sam shouted out that he was ready to go. During the contest, he thought that the food that Carmen made was delicious as he kept eating."}], "images": []}, {"title": "Whisky Peak Arc", "level": 3, "content": [{"type": "paragraph", "text": "While the disguised bounty hunters of Baroque Works were throwing a party for the Straw Hat Pirates, Sam joined them in their celebration. He later cheered on the contestants during the drinking contest."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the disguised Mr. 2 Bon Kurei attacked Nanohana and Mr. 1 and Miss Doublefinger crashed a galleon into the port, Sam ran around drunkenly while the townspeople ran in fear. It is later explained that he was there because his second daughter was getting married, and that even though his second daughter was apparently a troublemaker and despite the trouble she gave him, when she got married, he went out and got drunk because it saddened him that she was leaving. As a result, he somehow ended up in Alabasta after having one too many drinks."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Dead End Adventure", "level": 3, "content": [{"type": "paragraph", "text": "Sam was drunk and wandering around sometime before the Dead End Race began."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Sam-san has made few appearances in the manga, however, he has also been featured in the background of the One Piece anime on several occasions. Despite his overall lack of appearances in the manga, he is one of the more common recurring hidden characters in the animated series."}, {"type": "paragraph", "text": "Additionally, his tie is purple in the manga, as shown in the Digitally Colored Manga and confirmed in the Vivre Card - One Piece Visual Dictionary, but is shown as white in the anime."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sam is one of Oda's jokes in the SBS corner, although it was more likely just a less-than-serious answer Oda came up with to answer the question as to why the same random drunk was in two different panels in the manga.", "elements": []}, {"text": "The idea behind him is the same as Pandaman, only he is much rarer to see and normally less noticed.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 94 and Episode 43, Sam makes his first appearance.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Sam's birthday and place of residence is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 21, Fan question: What was Sam-san doing in Alabasta?", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 14, Fan Questions: Who is the guy in the Arlong Park Arc running with the villagers after Arlong's Defeat?", "elements": []}, {"text": "↑  One Piece Anime — Episode 51, Sam appears as a judge for the cooking contest.", "elements": []}, {"text": "↑  One Piece Anime — Episode 64, Sam parties with the people of Whisky Peak.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 19 Chapter 171, Sam reappears in Alabasta.", "elements": []}, {"text": "↑  One Piece Movie 4, Sam is seen drunk in Movie 4.", "elements": []}]}], "images": []}]}