{"sections": [{"title": "Franky", "level": 1, "content": [{"type": "paragraph", "text": "\"Iron Man\" Franky is the shipwright of the Straw Hat Pirates."}, {"type": "paragraph", "text": "A cyborg from Water 7, he was originally the leader of the Franky Family, a group of ship dismantlers. He is originally from South Blue , but left 32 years ago as a four-year-old child. He was originally named \"Cutty Flam\" until he threw away his original name for his nickname per the request of Iceburg to hide his identity."}, {"type": "paragraph", "text": "Franky and his followers were originally enemies of the Straw Hats at the beginning of the Water 7 Arc, until circumstances forced them to become allies at the end of the same arc and the Enies Lobby Arc. At the request of the Franky Family, Franky decided to join the Straw Hats to fulfill his dream of creating and riding a ship capable of circumnavigating the world, the Thousand Sunny."}, {"type": "paragraph", "text": "He is the eighth member of the Straw Hat crew and the seventh to join Luffy's crew. He currently has a bounty of 94,000,000. Previously going by the epithet, \"Cyborg\" Franky, he has since gained the new nickname, \"Iron Man\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [], "images": []}, {"title": "Before the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "As a direct result of the modifications that he conducted upon himself as well as the years spent as a ship dismantler, bounty hunter, and street thug in Water 7, Franky is a powerfully built man with a height of at least seven feet, making him the third-tallest member of the Straw Hat crew, after Jinbe and Brook. His forearms are relatively enormous while his biceps are comparably small. His chest is well-toned with large abs and pectoral muscles. He has brightly-colored blue hair and blue star tattoos on his forearms. Franky's eyebrows are rather long and stern, and he has three prominent lower Matsuge on each eye. His chin is very angular and tapers off in three pointed clefts. Franky has an equally angular prosthetic nose made of iron with several rivets and jagged edges, the only replacement part of his exterior body that is not covered in artificial skin. "}, {"type": "paragraph", "text": "Before being hit by the Puffing Tom, Franky's forearms were normal-sized and his overall height was comparably smaller than his cyborg-enhanced self would be. He also had an ordinary nose and chin, both of which were later badly broken in the accident, causing him to repair them with iron."}, {"type": "paragraph", "text": "His choice of clothing usually comprises of a swim briefs, which causes people to call him a pervert, and an open loud Hawaiian \"Aloha\" shirt with a large golden chain necklace around his neck. It is rare for him to button up his shirt, have long sleeves, and wear pants or footwear unless the situation calls for it, or someone makes him do so. He also does not like it when people tamper with his look, as seen when Nami's mind was inside his body and she tried to button up his Hawaiian shirt, which made Franky upset."}, {"type": "paragraph", "text": "Before becoming a cyborg, Franky went half-dressed simply because he wanted to. Now, his cyborg body is built in a way that covering himself up actually limits him from accessing its features (long sleeves prevent him from using weapons installed on his arms, a buttoned shirt stops him from accessing his chest panels, pants keep him from using features on his legs that cause them to separate or expand, shoes are a hindrance for the same reason and also redundant because his feet are toughened with iron). If in a battle, Franky will strip down for the sake of using his weapons or wear specially modified clothing that can transform along with him. Conversely, Franky always makes sure to cover his back (hence, he wears a shirt) because it is a weak spot- it is still flesh and blood, the only part of his body he cannot reach and modify. Unfortunately, Franky is still susceptible to cold and can suffer chills from his half-nakedness."}, {"type": "paragraph", "text": "During his first appearance in the Water 7 Arc, Franky wore a masked costume as a disguise so no one could identify him while he bought wood from the Adam tree off the black market. After discarding this disguise, for the rest of the arc all the way up to the end of the Post-Enies Lobby Arc, he wore a red Hawaiian shirt, with lime green palm trees decorating it."}, {"type": "paragraph", "text": "During the Thriller Bark Arc, Franky wore a yellow shirt with purple trident-like symbols on the sides and a large one on back."}, {"type": "paragraph", "text": "Near the end of the previous arc all the way up to the Sabaody Archipelago Arc, Franky switched to wearing a purple version of his Hawaiian shirt."}, {"type": "paragraph", "text": "During the Straw Hats separation, Franky wore a red coat to protect himself from the cold while on Baldimore, but after blowing up Vegapunk's laboratory, the skin on his face and frontal body was burned off, revealing his metal endoskeleton underneath, which he covered up with a tiger skin rug due to scaring people who looked at him. "}, {"type": "paragraph", "text": "He also has a pair of sunglasses, which he usually wears when things start to get serious."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Over the two years he was on his own, Franky used Vegapunk's blueprints to drastically reconfigure his body, repairing the damage he accidentally caused to himself and replacing some old functions his body used to have with better and more powerful implements. Franky's hair is now controllable, and can change different styles instantly by pushing his nose for more than three seconds. While he used to wear it up in a pompadour style and can still do such, he now tends to keep his hair retracted and sport a buzz cut, or otherwise experiment with different hairstyles, sometimes changing his hairstyle to a theme which fits the circumstances he finds himself in."}, {"type": "paragraph", "text": "He also has two stitch-mark scars on his torso running down from the back of his neck indicating that he had sewn his skin back on."}, {"type": "paragraph", "text": "He appears to have made modifications to his eyes as well. What appears to be his eyes are actually lenses that resemble human eyes over a pair of robotic eyes underneath. His left eye was seen with inverse coloration and with a glowing red pupil after his battle with Senor Pink, after being knocked around so much it caused the lens over the eye to fall out. Once the fighting against the Donquixote Pirates had come to a close and Franky had some downtime to repair himself, he installed a replacement lens."}, {"type": "paragraph", "text": "His shoulders, torso, and arms are also much bigger than before, and with studded hands that look almost robotic in appearance, but he also revealed that inside of his huge arms he still has a set of normal-sized robotic hands. He now appears to be wearing metal rigged suspenders. He has replaced his elbows with large, light blue hinges, his shoulders with a large red ball and socket joint with \"BF-37\" written on them, and his forearms with large, light blue cubes, with his trademark star tattoo being split by an edge. Surprisingly, Franky's forearms also have hair on them even though they are clearly robotic, and his large robot hands can even wear gloves. These new features house upgrades he gave himself during the timeskip."}, {"type": "paragraph", "text": "He now wears a red coconut tree-motived Hawaiian shirt and red swim briefs. While on Punk Hazard, he was given a large double-breasted black coat by Kin'emon for the cold. When he was able to change into winter attire, he put on a sky blue double-breasted coat with \"BF 37\"  written on the front and back, and paired it with a dark navy blue scarf with red polka dots."}, {"type": "paragraph", "text": "During the Dressrosa Arc Franky wore a white dress shirt and black suit jacket, a bowler hat, as well as his typical speedos. He initially had his hair in two long pigtails. After Dressrosa Operation: SOP began, he reformed his hair to resemble a cannon, which comically was only cosmetic."}, {"type": "paragraph", "text": "After the battle against the Doflamingo Family, he wore a white tank top with 'Corrida' written across it. He also reformed his hair to resemble Usopp's hat during the Dressrosa Arc."}, {"type": "paragraph", "text": "During the Zou Arc, Franky wore a black v-neck t-shirt with four symbols on it arranged in a square pattern (An \"I\", \"H\", \"T\", and a sun-like symbol). He reformed his hair into an undercut style similar in appearance to Smoker's Post-Timeskip hairstyle. Later on, he re-styles it again to resemble a blue whale."}, {"type": "paragraph", "text": "In the Wano Country Arc, Franky wears a dark blue yukata workman coat with kanji on the vee of the chest and symbols around the belt. He has red cloth draped around his shoulders and his hair is reformed to resemble a hammer."}], "images": []}]}