{"sections": [{"title": "Marianne", "level": 1, "content": [{"type": "paragraph", "text": "Marianne, also known as the \"Flag-Bearer of Freedom\" and more commonly by her alias Miss Goldenweek, was an officer agent of Baroque Works and the partner of Mr. 3. She is currently working as a painter at the new Spider's Cafe alongside many of her former colleagues. She is the secondary antagonist of the Little Garden Arc and the main character in Miss Goldenweek's \"Operation: Meet Baroque Works\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Marianne is a teenager with a childish appearance, with relatively large eyes and circles of blush on her cheeks. She is fairly short in stature and wears her dark red hair tied in braided pigtails. Her attire consists of a wide-brimmed pink hat with a green band, a dark blue T-shirt with the word \"GOLDEN\" written on it in pink (orange in the anime), a sky blue cloud-patterned button-down shirt, a maroon-colored overalls skirt with the top folded down, blue striped stockings, and big red shoes with white cuffs and white soles. She is usually seen eating rice crackers."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Marianne is laid back to the extreme and never passes up a good chance to relax. For instance, she set up a picnic during an ongoing battle. Another example of her easygoing nature was when she sat a few feet away from a cup of tea, apparently too lazy to walk over to it and pick it up herself. She skillfully conveyed this message to her partner using only her eyes, and when Mr. 3 understood, he chided her but brought her the cup anyway."}, {"type": "paragraph", "text": "Regardless of her laid back persona, Marianne takes her missions rather seriously as she prevented Luffy from destroying her partner's Candle Set to save his crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e0/Relaxed_Goldenweek.png/revision/latest/scale-to-width-down/210?cb=20130201225048", "caption": "Miss Goldenweek having a picnic in the midst of battle."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Baroque Works", "level": 3, "content": [{"type": "paragraph", "text": "Miss Goldenweek cares greatly for the other members of the organization. She formed a strong bond with Mr. 5 and Miss Valentine while on Little Garden and was willing to go to a Marine base to free the rest of the captive agents. She and Mr. 3 had a relationship of mutual respect due to their partnership, and they bonded over a shared appreciation of hot tea, among other things."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "For the most part, Miss Goldenweek seemed neither afraid of nor aggressive toward her opponents. She was fairly indifferent to the majority of the Straw Hat Pirates but seemed to be scared of Usopp when he shot a fire star and Luffy and Karoo when they charged her."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Marianne makes up for an absence of combat ability by using her unique skills as a realist painter, collectively known as Colors Trap (カラーズ・トラップ, Karāzu Torappu). In this way, she can change a person's personality through the use of certain colors, changing their behavior as she sees fit."}, {"type": "paragraph", "text": "It works through the use of a symbol, which she paints either directly onto a person or near them. Once the person is under the spell of Colors Trap, they are unable to break out of it unless the symbol is removed or smeared. The trap overwrites all other actions attempted by the person under its influence, forcing them to do whatever the trap suggests no matter what."}, {"type": "paragraph", "text": "Someone who possesses a simple mind, like Monkey D. Luffy, is said to be more vulnerable to this kind of psychological attack. This implies that someone very strong-willed would be able to resist the influence of Colors Trap."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Uragiri no Kuro (裏切りの黒, Uragiri no Kuro literally meaning \"Black of Betrayal\"): Causes the target to betray his friends, doing exactly the opposite of what they say. First used on Monkey D. Luffy. She later uses it on some Marines in the Baroque Works Mini-Series. This technique is known as Betrayal Black in the Viz Manga and FUNimation dub.", "elements": []}, {"text": "Warai no Kiiro (笑いの黄色, Warai no Kiiro literally meaning \"Yellow of Laughter\"): Causes the target to laugh uncontrollably. This technique is known as Laughter Yellow in the Viz Manga and FUNimation dub.", "elements": []}, {"text": "Togyu no Aka (闘牛の赤, Togyu no Aka literally meaning \"Red of Bullfighting\"): Causes the target to direct all their attacks toward the painted mark. This technique is known as Bullfight Red in the Viz Manga and FUNimation dub.", "elements": []}, {"text": "Kanashimi no Ao (悲しみの青, Kanashimi no Ao literally meaning \"Blue of Sadness\"): Causes the target to become sad. It was not shown on its own, but mixed with the Warai no Kiiro already on Luffy's back to make Nagomi no Midori. This technique is known as Sadness Blue in the FUNimation dub.", "elements": []}, {"text": "Nagomi no Midori (なごみの緑, Nagomi no Midori literally meaning \"Green of Soothing\"): A mixture of blue and yellow, it causes the target to sit down and have a picnic with Miss Goldenweek. This technique is known as Calming Green in the Viz Manga, and Tranquil Green in the FUNimation dub.", "elements": []}, {"text": "Tomodachi no Kimidori (友達の黄緑, Tomodachi no Kimidori literally meaning \"Yellow-Green of Friendship\"): A mixture of green and yellow, it causes the target to be Miss Goldenweek's friend and help her out. It was used to befriend a pterodactyl during the Baroque Works Mini-Series.", "elements": []}, {"text": "Yume no Nijiiro (夢の虹色, Yume no Nijiiro literally meaning \"Rainbow of Dreams\"): Causes the target to realize their dream. It was used during the Baroque Works Mini-Series to show the dreams of the Officer Agents.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Little Garden Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the initial uncovering and subsequent flight of Princess Vivi from the organization, Crocodile sent Miss Goldenweek and Mr. 3 to lie in wait for Vivi and her Straw Hat escorts on the island of Little Garden. Miss Goldenweek sat idly by as Mr. 5 and Miss Valentine arrived to finish their mission. Mr. 3 revealed to the crew their new focus would be taking down the giants due to a 200,000,000 bounty on their heads. Mr. 5 reported he had successfully poisoned Dorry so the Baroque Works crew could easily take down the giants."}, {"type": "paragraph", "text": "Miss Goldenweek stood at Mr. 3's side as they witnessed Brogy defeat Dorry due to their treachery. Miss Goldenweek barely participated in the battles that followed, but when she did, she was more than a match for the simple-minded Luffy as she activated her Color Trap which caused her victim to feel certain emotions. She first made Luffy feel uncooperative so that he would not want to help his friends. Luffy was freed from the trap by Vivi telling Luffy she did not want to be saved and that he should not move. Luffy wanting to be disagreeable stepped off of the Color Trap and then was freed of Goldenweek's black color influence. However, she quickly painted a new color directly on Luffy's shirt which stopped him cold in his tracks again. Luffy was rescued by Usopp when he used a sacrificial shot to incinerate Luffy's shirt while taking a hit from one of Mr. 5's exploding breath shots. Unless she is controlling an opponent with her paint, she is nearly defenseless, as shown when Karoo defeats her easily offscreen."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/df/Miss_Goldenweek_vs._Luffy.png/revision/latest/scale-to-width-down/230?cb=20130201224425", "caption": "Miss Goldenweek vs. Luffy."}]}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "Miss Goldenweek starred in her own mini-arc on the chapter covers of the manga during the Water 7 Arc. Upon finding out that Baroque Works had been exposed after the Alabasta Arc, she, along with Mr. 5 and Miss Valentine, flew from Little Garden on top of a pterodactyl with the help of a Color Trap in order to go visit them in jail. However, the symbol was washed away in a storm and the three were dropped onto Kyuka Island where Hina, Jango, Ironfist Fullbody and their Marine unit happened to be vacationing. After briefly going incognito, she ultimately managed to free most of the other agents from prison (rescuing Miss Doublefinger, Miss Merry Christmas, Mr. 4, and Lassoo), and the group of escaped colleagues started a new Spiders Cafe together."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Her name, \"Goldenweek\", comes from a series of national holidays in Japan known as Golden Week, similar to Spring Break in the United States or Half Term in the UK."}, {"type": "paragraph", "text": "Mr. 3 and Miss Goldenweek's involvement in Little Garden was removed in the 4Kids dub, but she is still mentioned during Vivi's Baroque Works debriefing and still featured in the localized Grand Battle video game, albeit renamed as \"Miss April Fools Day.\" During Vivi's Baroque Works debriefing, Nami commented on Miss Goldenweek, saying, \"Isn't she too young to be a creep?\" despite the fact that the two had never met."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "When she used the Rainbow Color Trap on herself, it was revealed that she wanted to become a true artist, complete with a beret and mustache.", "elements": []}, {"text": "She and Mr. 4 are the only officer agents who do not possess a Devil Fruit ability.", "elements": []}, {"text": "The Mr. 3 pair has an art theme, specializing in sculpting and painting.", "elements": [{"text": "Marianne was paired with Mr. 3 due to her ability to color his wax creations.", "elements": []}]}, {"text": "Due to her painting skills, many readers and fans alike believed that Marianne may have eaten a Devil Fruit of some sort. However, Oda explained in the SBS that her Color Traps work similarly to hypnosis because she can change how people feel and act. She uses her colors as way to affect people.", "elements": []}, {"text": "She is the only Baroque Works officer agent whose defeat occurs off-screen.", "elements": []}, {"text": "Marianne's name and epithet as \"Flag-Bearer of Freedom\" may refer to the figure of Marianne as depicted in Eugène Delacroix's \"Liberty Leading the People\", a famous painting. This ties in to both Marianne's artistic theme and plan to free her arrested comrades in her cover story.", "elements": [{"text": "Marianne shares this inspiration with Belo Betty, a Revolutionary Army commander who is also referred as \"Flag-Bearer of Freedom\".", "elements": []}]}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Miss_Goldenweek_Artist.png/revision/latest/scale-to-width-down/180?cb=20131111200846", "caption": "Miss Goldenweek realizes her dream."}]}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Golden Week – Wikipedia article about her holiday codename.", "elements": []}]}], "images": []}]}