{"sections": [{"title": "Kuro", "level": 1, "content": [{"type": "paragraph", "text": "Kuro of a Hundred Plans, also known by his alias Klahadore, is the primary antagonist of the Syrup Village Arc. He was the caretaker of Kaya until his defeat, and the captain of the Black Cat Pirates before that."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kuro is a tall and slim man with glasses and slicked black hair, though during his fight with Luffy strands fell off onto his face."}, {"type": "paragraph", "text": "During his stay on Gecko Islands, he wore a black suit with two golden markings on it over a white shirt with a curious collar, with spiral-like protrusions on the edges, and a standard black tie. He also sports striped shoes (which he apparently kept from his life as a pirate). He would loosen up the tie and collar on the night before the planned raid on Syrup Village."}, {"type": "paragraph", "text": "During his time as a pirate, he wore a standard black captain's coat with the Black Cat Pirates' symbol on the epaulets over a simple white shirt hanging over a pair of black pants reaching down to his knees, and his trademark shoes."}, {"type": "paragraph", "text": "Whichever his persona he is using, he wears round glasses that tends to always slip off, until Luffy knocked them off when he dealt the final blow, where a previous punch shattered the lens and the final headbutt bent the frame; despite these glasses slipping off from time to time that required Kuro to shove them back into place, they are nevertheless his signature belongings, as he rejected a more fitting pair from Kaya."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kuro is an extremely intelligent man (having the second highest IQ in East Blue, behind Benn Beckman), whose plans have never failed in the past. He is a master strategist and an accomplished fighter, but he was severely hampered by the fact that he simply did not have the patience to deal with a pirate's life on the run from the Marines. Despite his intellect, he has a tendency to underestimate his opponents based on their seemingly harmless appearance, as he believed that Usopp and the Straw Hat Pirates were no threat, which became his downfall. His confidence in his plans tend to lead him to be reckless as well, as he believed that since the pirate attack was nigh, he saw no reason to restrain himself from his feral instincts by needlessly attacking Merry, thus resulting in the surviving Merry to report to Kaya of Kuro's true intentions."}, {"type": "paragraph", "text": "Kuro seems to be very proud of his plans, which had never failed before (hence his nickname, Kuro of a Hundred Plans). True to his epithet in both figurative and literal meaning, he conceived many well thought out plans and would achieve them by all means. When he relived his moments of piracy, he claims his plans were too great to be wasted on his crew. Because of his pride within his plans, Kuro is intolerant of any failures on his subordinates' part, and would kill them if they were to hinder his plans in any way. He valued his plots to perfection, as he refused Kaya's negotiations for leaving the village alone in exchange for handing over the estate and fortune he desired, insisting the attack and her death must occur for the sake of his plan. During the final moments before Luffy defeated him, Kuro lost his composure and screamed at the despair of his precious plan failing."}, {"type": "paragraph", "text": "He also seems to like the glasses he wears very much, even though they tend to slip down his nose every so often. He pushes them up with his palms so he does not scratch his face with his Cat Claws, a symbol of remembering his murderous ways. Even despite the lens being shattered by Luffy's punch, he kept them on. The glasses are his signature belongings, and as such, he destroyed the new ones Kaya gave him (though it may be because he simply hated her)."}, {"type": "paragraph", "text": "Kuro follows the role of the diabolical mastermind and continues the series' tradition of noticeably cruel villains. He held himself in very high regard, having a standard for people no one but himself seemed able to live up to. He felt nothing for the lives of others, willingly sacrificing anyone he needed to achieve his ambitions."}, {"type": "paragraph", "text": "During his three years as Kaya's butler, he acted as a benign, trustworthy and well-mannered—yet slightly snobbish—man who carries a hatred for pirates, and as such, looks down on Usopp. He later admits that, aside his hatred for Usopp and piracy, how much he despises this pseudo-personality; his hatred of piracy standing, the true reason is very different than that of his false persona. Kuro has proven himself to be a skilled actor, having created the personality of Klahadore, which was in stark contrast to that of his true persona, Kuro; he managed to maintain his act despite his deep hatred of Kaya and Usopp, enduring them with crocodile tears and verbal taunts, respectively, only revealing himself when he deemed it was no longer necessary. He differentiates his two personalities via his tone of speech: as Klahadore, he uses the formal pronoun \"watashi\" (私, \"watashi\") to refer himself, while as Kuro, he uses the more arrogant \"ore\" (おれ, \"ore\"); the anime exemplifies a possible split personality by \"Klahadore\" speaking in a lighter and a very formal tone while \"Kuro\" has a deeper and much colder voice. Either way, his sudden change made Merry and Kaya fear him greatly."}, {"type": "paragraph", "text": "Kuro has proven himself to be quite a hypocrite. While discussing his plans regarding Kaya with Jango, Kuro would avoid using the word \"kill\" due to believing it to be barbaric, preferring to her planned death as \"accident\" to make it sound more civilized; once his true intentions came to light and his patience with his crew waned, Kuro bluntly stated that he would kill, even directing such cruelty to Kaya when she confronted him. He later revealed that he never intended to let his crew leave Gecko Island alive despite his earlier claim that three years of inactivity had softened his heart (hence giving his crew five minutes to redeem themselves). Stating how much he detested piracy due to his belief that they are simply buffoons who robbed and killed out of greed and self-gratification, he has proven himself to be no better due to his plot to take everything away from Kaya while reveling on killing all the villagers."}, {"type": "paragraph", "text": "Though able to restrain himself most of the time, to the point of appearing to be a civilized person who abhors senseless violence, deep down Kuro is a very bloodthirsty man, using death and brutality as means to punish any subordinates who failed him or even stand in his way during his attacks; this trait comes to full effect upon seeing a crescent moon, which drives him wild and even he finds it difficult to resist the temptations of violence brought on by the stage of the moon. During his time as an active pirate, he was open about his murderous nature, as his crew feared him for his ruthlessness at all times. On the night of the Marine attack, there was once again a crescent moon, which seems to have been the reason why Kuro was so brutal to the Marines on board. Even after yearning a peaceful life devoid of the needless violence associated with piracy, Kuro still found the sight of a crescent moon an irresistible lure to his old ways, leading him to unnecessarily attack Merry simply to satisfy himself; his habit of pushing his glasses up with his palm instead of his fingers, whether as a pirate or butler, is proof that he has not forgotten his killing methods. His desire for retirement did nothing to curb his enjoyment of killing, as he reveled on the thought of killing Kaya and Usopp for money and revenge, respectively. As a consequence, during the first opening of the anime a red crescent moon can be briefly seen in the scene with Kuro."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Kuro had come to the conclusion his crew were nothing but puppets; that pirates were barbarians that stole from people out of greed and nothing more, and that they were buffoons who were nothing without his guidance and direction, and that his skill is wasted helping them to plot. He saw his crew as this since the very beginning. He would willingly sacrifice them all and by the time his plan was ready he had already long decided they should all die. This was proven to be true, as Kuro killed and injured many of his crew members. This disgusted Luffy and made him even more determined to stop Kuro."}, {"type": "paragraph", "text": "Kuro had no problem in sacrificing Nugire Yainu, the shipwright of his crew, in order to deceive the marines that he was executed and revoke his bounty."}, {"type": "paragraph", "text": "When the crew had a hard time against the Straw Hats (something that Kuro did not know at that time) Kuro became furious because his plan was about to be delayed and he accused Jango for the fact that his crew is not like it used to be. He did not hesitate to call them useless. Sham and Buchi were offended by their captain’s statement and thinking that their captain’s strength had faded attempted to commit a mutiny against him. However, Kuro proving them wrong gave them 5 minutes to get rid of the Straw Hat Pirates."}, {"type": "paragraph", "text": "Originally, Jango was loyal to his former pirate captain, Kuro, as Jango was willing to take over captaincy of the crew, and return three years to instigate the plan, despite seemingly knowing of his captain's darker personality. Jango also was frustrated to see Kuro arriving at the shore. Kuro on the other hand viewed Jango simply as a buffoon like the rest of his crew and thought that he needed to die to preserve the secrecy of his agenda. Now, as a Marine, the Black Cat Pirates and Jango are enemies."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Kuro_Attacks_Crew.png/revision/latest/scale-to-width-down/210?cb=20130125194349", "caption": "Kuro showing absolutely no remorse in killing his subordinates."}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "His life as a pirate led him to become irritated at the idea that he was forever chased by the Marines, as well as those seeking his bounty. He then began to yearn for a peaceful life, without such bothers. He slew through a ship full of Marines, sparing only Morgan to use him as an unwilling accomplice to arrest and execute a decoy, thus allowing Kuro to escape the Marines' constant pursuit. Sometime after his defeat at the hands of Luffy, the Marines came to acknowledge that Kuro is still alive, and reactivated his bounty."}, {"type": "paragraph", "text": "Jango, after becoming a Marine, is now an enemy of Kuro and the rest of the Black Cat Pirates."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "At first Kuro did not consider the Straw Hats as a threat, seeing them as mere children instead of genuine pirates. Even after seeing his crew defeated by them, he believed that it was due only to their own weakness until Luffy revealed his Devil Fruit powers. Likewise, he did not seem surprised at the very least when Zoro easily cut down the Nyaban Brothers and declared that he can easily kill the entire Black Cat Pirates in less than five minutes. Kuro's beliefs for the pirate’s life angered Monkey D. Luffy who had completely a different opinion about this matter. It was Kuro's contrasting believes and underestimation of Luffy's crew that led to his ultimate downfall."}, {"type": "paragraph", "text": "Kuro mocked Usopp (who was at the time not a Straw Hat yet) when he called himself a pirate, calling his act a \"Childish game\", and viewed him as equal to an insect. Usopp disliked him for this, and came to hate him after realizing what he was planning. Kuro also (hiding his identity) bullied Usopp because his father abandoned him to become a pirate. Finally, Kuro was not bothered by the fact that Usopp heard his conversation with Jango, because he knew that the villagers would not believe him in case he tried to inform them about the pirates’ arrival. This was another factor of underestimation that led to Kuro's plan failing. However, Kuro did bear a grudge against Usopp for punching him, and once his intentions were known, he did not hold back and attempted to cut down Usopp in revenge, while delivering a hard kick to Usopp's stomach when Luffy stopped him from killing the young pirate."}, {"type": "paragraph", "text": "It was due to Kuro's defeat by Luffy and Usopp that he suffered, for the first time, a failure in the plan he was so proud of, and the shattering of his dream of a peaceful, luxurious retirement when Luffy unceremoniously threw him off the island, where the Marines eventually learned of Kuro's deception, thus forcing him to endure constant pursuit of being a wanted man once more."}], "images": []}, {"title": "Kaya", "level": 4, "content": [{"type": "paragraph", "text": "As Klahadore he was forced into acting kind natured, to make himself out as Miss Kaya's trustworthy family butler and caretaker. He later admits how much he hated acting out this role for three years, and in the process betrays Kaya's feelings. At one point, he relives seemingly happy memories with her, breaking her heart as he states that he \"endured it\", and voiced his utter contempt for her."}, {"type": "paragraph", "text": "Until his deception was revealed, Kaya had always been fond of Klahadore, even leading to dismiss Usopp's claims about Klahadore being a pirate as hurtful lies, while Klahadore made it look as though his mistress's safety and well-being is the utmost importance and refused to let her see Usopp, one factor that she disagreed on due to her friendship. When she discovered what Usopp had told her was the truth, she became upset and could do nothing as Kuro betrayed her feelings on purpose, upsetting her, yet she was unable to pull the trigger of the flintlock that she aimed at him; if anything, she found it very chilling when Kuro made it clear that he was not regretful at the very least in his attempt to kill Merry and made no attempt to deny it. Kuro also voiced aloud that he truly loathed her and desired nothing more than killing her."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Kaya_and_Kuro_Shopping.png/revision/latest/scale-to-width-down/210?cb=20130927191159", "caption": "Kaya and Klahadore shopping, one of Kaya's supposedly happy memories with her servant."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Kuro_Destroys_Kaya%27s_Present.png/revision/latest/scale-to-width-down/210?cb=20130321215742", "caption": "As a sign of contempt, Kuro destroys Kaya's third-year anniversary gift without even trying them on."}]}, {"title": "Merry", "level": 4, "content": [{"type": "paragraph", "text": "At first, Merry is a fellow butler who deeply trusted Klahadore, as they both see their mistress' well-being as the most important factor, and were on friendly terms during the three years working together. They also both saw Usopp as an untrustworthy liar who only loves to cause trouble, and as such, Merry refused to believe Usopp's claim that Klahadore was a pirate attempting to steal Kaya's fortune, and even chuckling it off as ridiculous when Klahadore asked of it. However, when his colleague revealed his true colors, Merry's trust and liking instantly turned to fear and hate."}, {"type": "paragraph", "text": "Kuro, in turn, showed no genuine sympathy for Merry from the beginning, and even attempted to murder him for no necessary reason, but instead for the sheer pleasure under the crescent moon. If anything, Kuro held contempt for his colleague, as when Kaya confronted him the next morning, the closest to regret Kuro expressed is his failure of killing Merry."}], "images": []}, {"title": "Syrup Villagers", "level": 4, "content": [{"type": "paragraph", "text": "Kuro managed to gain the villagers’ trust during the three years that he stayed on the island. When Usopp arrived at the village shouting for the pirates’ upcoming arrival, not only they did not listen to him but they also said that wished him to be like Klahadore."}, {"type": "paragraph", "text": "Kuro, on the other hand, shows no true compassion for the villagers that he had been friendly for three years, and plotted their massacre for his own benefits."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Kaya's Parents", "level": 4, "content": [{"type": "paragraph", "text": "Three years before the start of the story, her father hired Kuro (under the pseudonym Klahadore) to live in the mansion as a butler (going as far as to save him from the streets in the anime), not knowing of Kuro's true identity. Sometime after this adoption, Kaya's parents died, according to Kuro, by accident and were not part of his plan to gain her riches; Kuro denied killing them when Jango suggested it. Under his Klahadore guise, he made it as though he felt indebted to the man for saving his life, and that if he let anything happen to Kaya, he could never face her father again."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Kuro is a master strategist who has never once before failed in his village raids, due to him planning skillfully beforehand. He is the second most intelligent person shown at the time of his debut, and was skilled enough to have tricked the Marines into making them think he died with a decoy, thus deactivating his bounty and infamy."}, {"type": "paragraph", "text": "Nicknamed \"Kuro of the Hundred Plans\" for his tactical genius, and he is shown to be well-versed in tactics: he has the patience and determination to carry out a three-years plan right down to the most minute detail, and managed to perfectly blend into his \"alias\" Klahadore (winning the respect of the townspeople, the care of his adoptive family and managing to convince Syrup Village that the liar Usopp was of malicious intent), demonstrating expert manipulation skills."}, {"type": "paragraph", "text": "He is feared by all his subordinates, all of whom obey him out of his well-known ruthlessness to both foes and allies alike. Despite the Nyaban Brothers believing that his skills dulled over the three years as a butler (something he admits) and tried to kill him, he proved that he is still superior by easily overwhelming them at the tip of his claws. He also considered Zoro as \"soft\" in comparison for not successfully killing Buchi in one strike."}, {"type": "paragraph", "text": "Finally, even though Devil Fruits are rare in East Blue, Kuro calmly came to acknowledge it as a fact when Luffy had demonstrated the powers of eating one, while many others (including the rest of the Black Cat Pirates) would be shocked to see what they believe to be a mere myth come to reality."}, {"type": "paragraph", "text": "During his three-years ruse as Kaya's servant, Kuro has shown to be a capable butler despite his absolute hatred of being under her servitude, accompanying her in various shopping and sailing trips, taking care of her when she fell ill, and conversing with her adequately. He organized the mansion's security by hiring the guards."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Along with his intellect, he is also a powerful and deadly pirate in the East Blue. Kuro can effectively enter a state of automatic blood-lust during any phase of a \"crescent moon\", leading to an increase in brutality. He has incredible physical prowess, as he has sufficient strength in his arms and hands to wield his overly large Cat Claws which consist of one full-sized katana blade per finger without any strain while still retaining his superhuman speed. Even after three years of not engaging in combat, he is still powerful enough to overpower the Nyaban Brothers. His inhuman speed is also due to his highly powerful legs. In fact, a simple stomp from him was capable of completely shattering Kaya's present, splitting the glass case cleanly in two. He is skilled in powerful kicks, as demonstrated when he kicked Usopp and Luffy; on both occasions he sent them both flying for a great distance from him, while cutting Luffy's lip. He has superior agility able to jump onto Luffy's outstretched arm and run down its length to reach Luffy."}], "images": []}, {"title": "Stealth Foot", "level": 3, "content": [{"type": "paragraph", "text": "The Nuki Ashi (抜き足, Nuki Ashi, literally meaning \"Stealth Foot\") is Kuro's silent movement technique to move at superhuman speeds, at about 100 meters in 4 to 5 seconds, almost looking like he teleported. He initiates this move by performing several quick foot movements to propel himself to another location, much like the Soru technique, except that the movements of his feet are more noticeable, suggesting that this skill is a rudimentary form of Soru. This is Kuro's signature skill in combat, with which he would utilize this blinding speed to deliver his attacks. His mastery of this skill is such that at full speed he is only able to be seen as a vague blur or by the damage his attacks cause; being capable of killing a group of 50 skilled assassins before any of them would even take notice. While the pinnacle of his speed is considered superhuman and matching that of the Soru technique, his weakness—being unable to tell what he is hitting—puts him at a setback against other superhuman-speed users who can tell what they are striking. He can partially counter this flaw by his indifference to what he strikes down, feeling remorseless in killing his subordinates. This is called Pussyfoot Maneuver in the Viz Manga and FUNimation dub and Stealth Walk in the 4Kids dub."}, {"type": "list", "elements": [{"text": "Creeping Cat: Like the Nuki Ashi, except he has more control and moves about freely while appearing invisible. The downside is, he needs to revert to normal speed when initiating attacks, making him automatically visible at that point. The same thing also happens if, by any chance, the opponent(s) should manage to strike out at him while he's in this state. This is a technique name that comes from the English versions, as this is simply another use of the Stealth Foot in the Japanese version of the series. This move is one of his super attacks in the One Piece: Grand Adventure.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Captain Kuro uses weapons called \"Cat Claws\", furred gloves with full-length katana blades at the end of each finger. He combines these large iron claws with his impressive speed to indiscriminately slash everyone in his vicinity to death at random depths of cuts."}, {"type": "paragraph", "text": "Captain Kuro often pushes his glasses up on his nose with the palm of his hand, a technique he has used since his days as a pirate: straightening them with the fingers would be impossible when the Cat Claws are worn. According to Jango, this proves that even after three years of peaceful life, that Captain Kuro has not forgotten how to kill."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Black Cat Captain", "level": 4, "content": [{"type": "paragraph", "text": "The dreaded former Captain of the Black Cat Pirates, he is also known as Kuro of the Hundred Plans for his elaborate plans that virtually never fail. However, this proved to have a huge setback; as time passed, he grew tired of setting up schemes for his crew and of constantly being hunted down by the Marines."}, {"type": "paragraph", "text": "Five years before the current storyline, Kuro told Jango that he wanted to give up being Captain Kuro after being pursued by the Marines for the third time in a week, since he is now an infamous pirate. Jango told Kuro that the Marines would not stop until the pirate captain was dead. Kuro told Jango that he was going to die and that Jango would be the new captain. A Marine Ship was attacking the Bezan Black with its cannons. He ordered his crew to give him a small boat, which they did. He arrived at the Marine ship and killed everyone on board, except a jaw-broken Marine soldier who was none other than Morgan."}, {"type": "paragraph", "text": "Jango ordered the crew to board the ship. He noticed Nugire Yainu and told him goodbye. Morgan refused to beg Kuro to kill him, but Kuro said to him that today, he would be the one who captured Captain Kuro. Jango hypnotized Nugire to think he was Captain Kuro and Morgan to think he was the one who captured the dreaded pirate. The Marine ship sailed away with the fake Captain Kuro to be executed. Kuro was happy that the first part of his plan worked."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/ff/Kuro_Breaks_Morgan%27s_Jaw.png/revision/latest/scale-to-width-down/210?cb=20130125192524", "caption": "Kuro breaks Morgan's jaw"}]}, {"title": "Cunning Plans", "level": 4, "content": [{"type": "paragraph", "text": "Soon after, Captain Kuro set up an elaborate scheme in a small village he came to live in, in order to live free from pursuit with great wealth. He taught his crew how to function without him, then took the name Klahadore and, for three years, lived as the butler of the wealthy parents of Kaya, who he is believed by many to have killed (this is not yet known to be true, as he denied it when Jango accused him of it, saying that their deaths were not part of his original plan). He then became the sickly Kaya's caretaker. He earned the trust and liking of the villagers, expressing himself as a humble man who detests needless violence and piracy, thus putting him in odds with the village's troublemaker, Usopp, and his crew of children."}], "images": []}, {"title": "Syrup Village Arc", "level": 3, "content": [{"type": "paragraph", "text": "At the mansion, Kaya and Klahadore, her butler, talked about Usopp, and Klahadore had forbid her from seeing him. At the mansion, Klahadore the caretaker explained to his mistress Kaya that he would not allow Usopp inside on the account of his lying. He explained that it is his duty to see she is safe and well on behalf of her late father and why there are two bodyguards near the front gate. Despite his efforts, when he left, Usopp appeared outside her window, claiming nothing could keep him away."}, {"type": "paragraph", "text": "Luffy then climbed over the gate, which caused Klahadore to ask another servant where the bodyguards were. The servant explained that the bodyguards were at lunch. As Usopp was finishing a story about a giant goldfish, Luffy and Usopp's pirate crew appeared and greeted him. Klahadore then appeared and demanded to know what they are doing. Klahadore told Luffy he would not get a ship and that they all need to leave. Klahadore then began to put Usopp down because his father is a pirate, due to his idea that all pirates are bad. When he asked what he wants from Kaya, money or otherwise, Kaya became upset. Usopp then lost his temper and punched him for insulting his father. After being hit, Kuro compares Usopp to his father, referring to him as \"the pirate\". Usopp then replied that he is proud to be the son of a pirate."}, {"type": "paragraph", "text": "Klahadore then continued to insult Usopp, stating although he is not a pirate his father's blood still makes him turn to fists when he is insulted. Finally Kaya begged Usopp to stop when he goes to hit him again, this time for saying he is only after Kaya's money. As Usopp let the care taker go, he received one final warning about coming back to the mansion which Usopp replied was fine with him. The Usopp Pirates then insulted their captain for that, which Luffy also admits. As the others were told to go away, the four tried to go after the care taker but were held back by Zoro and Nami."}, {"type": "paragraph", "text": "Later, Kaya was crying in her room, and Klahadore came in to bring her a meal. Kaya asked why Klahadore was so harsh, and he replied by reminding Kaya of the day he came to the mansion, when he was battered, and her father let him in. He then said that if anything happened to Kaya, he would not forgive himself, and is only doing what thinks are Kaya's best interests."}, {"type": "paragraph", "text": "He later met Jango at the shore. Jango confirmed that the plan to murder the mansion owner is ready. Klahadore asked Jango to not mention the word \"murder\" and to stop calling him Captain Kuro. Usopp and Luffy spied on the pair and Usopp suddenly remembered the name \"Captain Kuro\". Usopp recalled that he was a feared pirate who raided many towns and was finally put to death three years ago after he was captured by the Marines."}, {"type": "paragraph", "text": "Jango found it amusing that his captain declared he was bored with a pirate's life, made him captain and secretly settled in the village, but so long as there is a reward he is happy doing whatever Kuro asks of him. Kuro then told Jango that all he had to do is hypnotize Kaya to sign a will so he rightfully owns the mansion because \"Klahadore\" is not a member of the family and therefore cannot inherit her fortune otherwise. Once the task is done he must then kill her without making it look like she was murdered. Jango then mocked his former captain, stating that if it was him, he would just invade the mansion and take the riches, however Kuro reminded him that would make him a pirate again. Jango mocked him once again for asking for a peaceful life when he was planning to kill everyone to get Kaya's money, but Kuro stated he did not expect things like Kaya's parents' death, as they died unexpectedly in an accident."}, {"type": "paragraph", "text": "As Usopp slowly came to the realization of what they were hearing, he had to deal with Luffy who did not have a clue what was going on. While he dealt with thoughts related to the problem at hand, Luffy stood up and shouted to the pair below them. While Usopp was horrified at what Luffy did, Usopp grabbed him to pull him down so that he could not be seen, but it was too late, since Kuro and Jango had looked up at the cliff and saw the pair."}, {"type": "paragraph", "text": "Jango then held up his hypnotism ring and began to hypnotize the pair. Usopp looked away before getting hypnotized, but Luffy was clueless about the ring, and did not look away. As Luffy fell asleep, so did Jango. Kuro then commented on Jango's hypnotism weakness, telling him that he really needs to fix that. Usopp then yelled at Luffy, but Luffy ended up falling off the cliff, which seemingly killed him in the eyes of Jango and Kuro. While Usopp yelled about killing Luffy, Jango asked if Usopp should be killed as well, but Kuro just stated that even if Usopp tells the village, no one would believe him due to his reputation as a liar in the village."}, {"type": "paragraph", "text": "Later, Kuro went to greet his men after three years away from them and ensured the start of the plan. He then told them to get ready for the attack."}, {"type": "paragraph", "text": "Inside the mansion, Klahadore and Kaya's other servant discussed Usopp's actions of the day while Kaya slept soundly in her bed. Klahadore found the glasses that were supposed to be a present for him in the morning on their 3rd anniversary. The servant then told him that they had been specially made for him, so that he would no longer have to push his glasses up. As the other servant continued to talk, Klahadore suddenly began to talk strangely. He looked at the crescent moon and stated that it makes him wild. Before the servant's eyes, Klahadore smashed the glasses and looked devilishly at the servant, and stated that his present would be the mansion."}, {"type": "paragraph", "text": "Klahadore then stated that he no longer had to pretend as there were only a few hours left. He pulled out his cat claws from a bag that he was carrying and turned them on the servant. He then revealed to the servant his intentions to get Kaya's inheritance and destroy Syrup Village, which shocked the servant. He then revealed his Cat Claws gloves and attacked the servant, leaving him on the ground to die."}, {"type": "paragraph", "text": "Kuro then went upstairs, and went to Kaya's room. He then rubbed his cat claws against her face. He then left the room."}, {"type": "paragraph", "text": "On the mansion steps, Kuro sat and he said the word \"late\". He pictured the other servant laying on the floor, injured and the room cut up from his attack. He commented that if Jango and the others are late, he would kill them. He then set off to find them. Kuro headed towards the north coast only for Tamanegi to sight him; wondering why the butler would be walking around that early. On the slope, the Black Cat Pirates were fighting Usopp and the Straw Hats. Jango then had a bad feeling come over him, and the Nyaban brothers both became incredibly frightened. On top of the slope, Kuro stood, and he demanded to know why dawn had passed without his plan being in motion."}, {"type": "paragraph", "text": "Jango and the rest of the Black Cat Pirates were terrified by him, including Sham and Buchi. Kuro could not believe that his former crew were held back by a bunch of children. He then asked Jango for an explanation. Jango reminded Kuro who said letting Usopp go would not cause any problems. Kuro then stated that he knew that Usopp would try in vain to stop the Black Cat Pirates from invading Syrup Village, since no one would believe him, but the one thing he did not count on was the weakness of his crew."}, {"type": "paragraph", "text": "This remark made Sham and Buchi very mad. They remembered Kuro as a strong killer and they said they had been sinking ships and vanquishing pirate crews while Kuro lived the good life. They accused him of becoming weak. They then attempted to attack him, hoping to kill him. Jango tried to warn them, but it was no use. Before they could deal him a blow, he suddenly disappeared. He then reappeared moments later behind them with his Cat Claws gloves on his hands. They tried to attack him again, but he disappeared once more. Jango recognized this move as the Nuki Ashi technique, Kuro's trademark attack. He reappeared behind Sham and Buchi again, with his claw-like knifes pointing at them. Even Nami was impressed by this, as the Nyaban Brothers nearly defeated Zoro. This silent technique was so powerful, that not even a group of 50 assassins could stop Kuro. Jango knew he had not lost that attack, because of the way he always lifted his glasses to avoid being cut by his Cat Claws gloves."}, {"type": "paragraph", "text": "Kuro then gave his crew five minutes to kill Zoro. He then stated that if they did not meet this deadline, he would kill them. After the Nyaban Brothers were defeated, Zoro said to Kuro that the former captain would be defeated in less than five minutes. Kuro showed a little bit of impression from this statement. Buchi was still conscious and he begged Jango to hypnotize him so he could become strong enough to defeat Zoro. Jango managed to do so, and Zoro decided to deal with Buchi before he fought Kuro."}, {"type": "paragraph", "text": "The Black Cat Pirates then began to think it would be impossible to defeat Luffy and Zoro, since they thought that they were very strong. After waking up Luffy, Nami passed out from previous injuries. Luffy noticed Nami’s wound, and Nami then asked Luffy to fight for the village and her treasure, to which Luffy accepted. The pirates then ran from Luffy, being scared for their life. While Buchi fought Zoro, Jango decided to deal with Luffy. Kuro then said that time was up and that it was now time to kill everyone on the north slope. He was also surprised that Luffy survived the fall from the cliff since he thought that fall would have killed him."}, {"type": "paragraph", "text": "Just before Kuro started to attack people, Kaya arrived and begged him to stop. Usopp managed to save her before Kuro slashed her. She said to Usopp that she could not bear to see him get hurt protecting her. She then talked to Kuro and told him that he could take her fortune and leave the village alone. Kuro then told to Kaya he wants more than her fortune, including the thought of peace. He said that despite her plea, the Black Cat Pirates would still attack the village and kill her. She then pulled a gun from her coat and pointed it at Kuro. She threatened to kill him if Kuro and the Black Cat Pirates did not leave the island at that moment."}, {"type": "paragraph", "text": "Kuro then commented that she had become \"stronger\" over the last 3 years. He then recollected the events of the last three years with her, including the things they did together. He then stated that he always thought that the things they did were \"stupid things\" and told her that he had done all that stuff for her so that he could be around the day she dies. Kaya dropped the gun as Kuro went on about enduring the boring days in the past three years. He also stated that spending three years with her was an insult to his pride as a pirate. He took the gun from her and threw it to the ground. Usopp then took the gun and tried to shoot Kuro down, but Kuro used his Nuki Ashi to reappear behind the boy with his Cat Claws gloves on. He tried to kill him to make him pay for punching him, but his attempts were stopped by Luffy, who punched him with a Gomu Gomu no Pistol, sending him to the ground. Luffy then swore that Kuro would have a bad day since he hates being punched."}, {"type": "paragraph", "text": "The Black Cat Pirates then showed terror by this. Nami decided to search for the pirates’ treasure, despite her wounded shoulder. The Usopp Pirates arrived and hit Kuro as hard as they could with a shovel, a casserole and a bat. Usopp, Kaya and the others tried to warn them to stay away, but they refused to listen, too busy beating Kuro up, hoping that they could kill him. They then stopped, thinking that they had inflicted damage to Kuro. Jango then showed fear the kids' actions would make Kuro really mad."}, {"type": "paragraph", "text": "The Usopp Pirates then went to Usopp and they argued with him for not telling them about the fight. Usopp begged them to run away, but the kids refused to run away, saying that it would only shame the Usopp Pirates. Suddenly, Kuro got up, making the Usopp Pirates show terror, and also made them scream in horror. Instead of attacking the kids though, Kuro went straight for Usopp, to attempt to kill him. His sight then went to Luffy, and he asked if he had eaten a Devil Fruit. Luffy confirms this, and the news frightened the Black Cat Pirates even more. Kuro then ordered Jango to take care of Kaya and the Usopp Pirates while he took care of Luffy, to which Jango accepted."}, {"type": "paragraph", "text": "Kuro then told Usopp that escape is useless, since he knew that Kaya is weak. Usopp managed to get up, and heard a noise coming from the forest. Kuro then told Usopp that the noise is Jango destroying the forest. Usopp then asked him where he shred of pity is, but Kuro responded by telling him he has none, and that Kaya is nothing more than a pawn to his plan and he will express gratitude once she is dead. Usopp then showed anger by Kuro's words. Luffy told Usopp to go to Kaya and the Usopp Pirates and that he would take care of Kuro. Usopp managed to get up, despite his multiple wounds. Kuro was impressed by this, and Usopp told him that he would not let him win. Usopp tried to walk, but he ended up falling down due to his wounds. Kuro laughed at Usopp’s effort and said even if he did manage to get to Jango, he would end up dead. Usopp then said that, despite his weakness, he would protect the village."}, {"type": "paragraph", "text": "Zoro then took Usopp on his right shoulder and told him that he would go after Jango. Luffy agreed to it, but Kuro attempted to stop them, which caused Luffy to stop him with a Gomu Gomu no Kama, which Kuro dodged. Kuro then tried to slash him, but Luffy evaded the attack. He then counter attacked with a Gomu Gomu no Yari, but Kuro disappeared using his Nuki Ashi technique. Kuro reappeared and asked Luffy why an outsider like him is butting into the village’s business. Luffy then told Kuro that this is because there is a man in the village he does not want to let die and that he will not die today."}, {"type": "paragraph", "text": "The battle then continued, with Luffy stretching his arm to hold Kuro, attempting to kick him with his foot. Kuro managed to evade it by sending Luffy into the ground. Luffy tried to attack Kuro with a Gomu Gomu no Muchi and a Gomu Gomu no Pistol, but Kuro dodged both moves. Luffy then found Kuro on one of his arms. He then told Luffy that the fight was getting boring. He then delivered a kick at Luffy, sending him to the ground again. The Black Cat Pirates tried to cheer their captain on, but Kuro angrily told them to not call him by that name, saying that his plan was to get rid of the name \"Captain Kuro\". He then said that he is tired of devising plans for a band of men who care only about mayhem and to be relentlessly pursued by bounty hunters and government dogs."}, {"type": "paragraph", "text": "While saying that, Kuro remembers what had happened three years before this. Back in the present, Kuro told Luffy that when his plan succeeds today, his goal would be fully achieved and that money and peace of mind would be his. He refused to let Luffy ruin his plans. He tried to kill Luffy, but Luffy stretched his arms to pick up a rock and blocked his attack. The rock broke his first Cat Glove."}, {"type": "paragraph", "text": "While throwing the rock at him, Luffy told Kuro that if the pirate captain did not want a reputation, he should not have became a pirate and that his own ambition is greater than Kuro's."}, {"type": "paragraph", "text": "After his right hand was disposed of by Luffy, Kuro got up and told the Black Cat Pirates that he would kill them and Jango later. Kuro then revealed that he was planning to kill the Black Cats anyway to prove his innocence and to make sure that the world did not notice that he was still alive, which greatly shocked the Black Cats Pirates."}, {"type": "paragraph", "text": "Luffy then told Kuro that his pirate crew is dumb, to which Kuro explained his ideals of what a pirate crew is and used his Shakushi. One by one the Black Cats started falling, which caused Nami and Luffy to look on in disbelief."}, {"type": "paragraph", "text": "Luffy and Nami were still watching as Kuro continued to cut up the other Black Cat Pirates. Suddenly, Luffy was wounded by Kuro but he kept his ground and grabbed Kuro's jacket and threw him to the ground. Kuro mocked Luffy, saying he should have stood still so Kuro could kill him easier, and because Luffy stopped him, his crew are still alive and suffering. Kuro then went to do his move again, but this time, Luffy grabbed him and held him tight, which made Kuro unable to move."}, {"type": "paragraph", "text": "Kuro's crew then cheered Luffy on. Luffy then threw his head back and stretched his neck far enough back to tell the Black Cat Pirates to stop cheering for him. Kuro, in shock just kept telling Luffy about how his plan could not fail. Luffy then head-butted Kuro with Gomu Gomu no Kane, which defeated the pirate, twisting the frames ever beloved glasses of the scheme captain in the process. Replying to the horrified Black Cat Pirates that he will be the next Pirate King, Luffy then threw Kuro back to the Black Cats, fiercely telling them to never return. The crew ran in horror, dragging their fallen former captain back onto the Bezan Black and fleeing."}, {"type": "paragraph", "text": "Despite Usopp contributing greatly to the defeat of Kuro and the Black Cat Pirates, he insisted that Kaya and his crew of children to keep this quiet, believing that it would disrupt the peace of the village. Kaya and Merry then started to think of excuses for the villagers and other employees about Klahadore's departure."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Usopp_Punches_Kuro.png/revision/latest/scale-to-width-down/210?cb=20130310222608", "caption": "Usopp angrily attacks Kuro after he makes fun of his father."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Kuro_Slashes_Merry.png/revision/latest/scale-to-width-down/210?cb=20130124230248", "caption": "Kuro slashes Merry."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/64/Kuro_Traps_The_Nyaban_Brothers.png/revision/latest/scale-to-width-down/210?cb=20130927190815", "caption": "Kuro traps the Nyaban Brothers."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Luffy_Defeats_Kuro.png/revision/latest/scale-to-width-down/210?cb=20180625003848", "caption": "Luffy lands the final blow on Kuro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Kuro%27s_Glasses_Broken.png/revision/latest/scale-to-width-down/210?cb=20150622185010", "caption": "Kuro's signature glasses, broken and fallen."}]}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "Sometime after his defeat and escape from Syrup Village, Kuro once again became the Captain of the Black Cat Pirates. After Luffy receives his initial 30,000,000 bounty, Kuro is alerted of the fact by one of his men. In response, Kuro was silent and left the bounty poster on his table as he sat and pondered. However, at the time of Luffy's bounty issuance, it appears that the Marines were oblivious of his defeat as his defeat was not considered when determining Luffy's bounty."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Kuro_Anime_Cameo.png/revision/latest/scale-to-width-down/210?cb=20130121010936", "caption": "Kuro's extra appearance when Luffy's first bounty came out."}]}, {"title": "Aftermath", "level": 3, "content": [{"type": "paragraph", "text": "While Kuro's whereabouts are currently unknown, it seems the Marines have become aware that he is still alive, and as such have had his bounty reactivated."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kuro vs. Marines (including Morgan)", "elements": []}, {"text": "Kuro (as Klahadore) vs. Usopp (Kaya's mansion)", "elements": []}, {"text": "Kuro vs. Merry", "elements": []}, {"text": "Kuro vs. Sham and Buchi", "elements": []}, {"text": "Kuro vs. Monkey D. Luffy", "elements": []}, {"text": "Kuro vs. Usopp Pirates", "elements": []}, {"text": "Kuro vs. Black Cat Pirates", "elements": []}, {"text": "Kuro vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, right after slashing down Merry, Kuro continued to attack all over the room, leaving scratch marks all over; in the anime, he instead left the room and went straight for Kaya, seemingly toying with the idea of killing her then and there himself, but holding enough composure to refrain from doing so."}, {"type": "paragraph", "text": "In the manga, Kuro is not seen or mentioned again after his defeat by Luffy. In the anime, Kuro was last seen in a cameo appearance on board of his ship, as the captain again, when his crew informed him of Luffy's 30,000,000 bounty."}, {"type": "paragraph", "text": "While the anime thus establishes that Kuro returned to his life of piracy, it appears that he has managed to keep his existence a secret from the Marines. When the inside of Fullbody's ship was seen in the same episode, Kuro's wanted poster was seen with a red X through it, meaning that he is still believed to be deceased."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "\"Kuro\" can be written in kanji as 黒, meaning \"Black\". \"Kuro\" is also a way of saying \"claw\" in Japanese."}, {"type": "paragraph", "text": "Due to his odd alias, Kuro's \"butler name\" has been translated in a wide variety of ways. The English adaptations use the name Klahadore, possibly a \"claw\" pun. The pronunciation of \"Klahadore\" could be compared to \"claw-a-door\" in English. Some fans of Kaizoku Fansubs, however, use the term Kurahadol; as it is what Kaizoku Fansubs uses."}, {"type": "paragraph", "text": "Also, in the original version, Kuro's epithet is \"Of a Hundred Plans\", while the English version changes it to \"Of a Thousand Plans\". His epithet, in the original Japanese version, is another way of saying \"all means\", which is a testament of him achieving his plans by all means."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "Grand Battle!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "When he was in his butler attire, there were strange symbols on his jacket. Oda explained that these symbols are poop.", "elements": []}, {"text": "In the 4th Japanese fan poll, Kuro is ranked the 29th most popular character in One Piece.", "elements": []}, {"text": "Due to being thought of as dead and the events surrounding him largely unwitnessed outside of those involved, Kuro was not considered when the Marines gave Luffy his first bounty.", "elements": []}, {"text": "Kuro is one of only two major antagonists (next to Krieg) whose fate after encountering the Straw Hat Pirates is not (yet) shown. The other ones have their own cover story or another appearance within the main story itself.", "elements": []}, {"text": "Kuro's favorite food is bananas.", "elements": []}]}], "images": []}]}