{"sections": [{"title": "Patty", "level": 1, "content": [{"type": "paragraph", "text": "Patty is one of the main cooks who works at the Baratie."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is an average-sized, muscular man with a lot of hair on his arms and legs. He has a shaved head, large lips, and a short black beard. He wears a navy blue short-sleeved shirt with yellow buttons on both sides, and light blue on the end of the sleeves. He has knee-length shorts that are the same color as his shirt, along with brown shoes. He also wears a white apron, a pink ascot, an earring in his right ear, and a white rope tied around his head. He has two heart tattoos on his left arm."}, {"type": "paragraph", "text": "After the timeskip, Patty no longer has a shaven head, as black hair has now grown. He also appears to have a longer beard. He wears the same style shirt and shorts, and has the same earring, rope, and ascot. His apron now says \"Baratie Dessert\" on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Patty is one of the main cooks on board the Baratie who does not always see eye to eye with Sanji. He has a very business-minded attitude towards customers; those who pay receive good and friendly service while those that do not get the boot. However, he tends to unknowingly insult his customers when he greets them. His kinder side is revealed when he tries to save Gin after having breathed in poison gas."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Culinary Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Patty is a highly skilled and experienced chef, being one of Baratie's most skilled chefs. He has excellent skills in using knives, able to precisely slice and debone a large fish with great speed. He is capable enough to be entrusted by Zeff to manage the Sister Anko dessert ship."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Patty essentially acts as a \"bouncer\" by preventing trouble on the Baratie. He has great physical strength, being able to carry and use a large bazooka. He also has considerable combat skills and experience, having managed to fight off countless pirates who tried to cause trouble in the Baratie for years. Alongside Carne, he managed to take down large numbers of Kreig's men who easily overpowered the other Baratie chefs whom themselves were capable fighters."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Shokuatari Meatball (食あたり砲弾 (ミートボール), Shokuatari Mītobōru, literally meaning \"Indigestion Meatball\"): Using a lobster-shaped bazooka, Patty shoots a huge exploding cannonball at the offender. He uses it to defeat tough pirates. However, it was ineffective against Krieg's Wootz Steel Armor. In the Viz Manga, 4Kids and FUNimation dubs, this is called the Meatball of Doom.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Patty and Carne started working at the Baratie after seeing Zeff's advertisement about \"damn cooks wanted\"."}, {"type": "paragraph", "text": "Around that time, the three chefs tried to petition Zeff to hire some female chefs, but Zeff refused because his style of training would not, in his opinion, be suitable for women."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Baratie Arc", "level": 4, "content": [{"type": "paragraph", "text": "After practicing his greetings in the bathroom, Patty entered the dining room, saw Sanji threatening to beat up Fullbody, and berated Sanji for it. Later on, Patt taunted the starving Gin by refusing to give him food and knocked out Sanji so that the chef would not cook for Don Krieg and his men. Patt and Carne helped defend the restaurant from Krieg, particularly by rallying the other cooks to defeat Don Krieg's lower subordinates. However, he and Carne were defeated by Pearl."}, {"type": "paragraph", "text": "Sanji stepped up to battle Pearl and revealed his superior kicking abilities. However, the battle was cut short as Zeff had been taken hostage by Gin. Sanji refused to let any harm to come to Zeff as he owed the man with his life. Patty and Carne demanded to know their past, so Sanji informed them about how, when Sanji was young, Zeff had attacked his ship."}, {"type": "paragraph", "text": "As the battle raged on, Don Krieg launched a MH5 Poison Bomb at the Baratie. Patty and the other cooks were able to take cover from the gas until it dissipated. However, they realize the enemy commander Gin had been poisoned in a turn of events. They initially declared they would refuse to help him, but were ultimately coerced into giving Gin antidote by Sanji."}, {"type": "paragraph", "text": "He and the other cooks then witnessed the defeat of Don Krieg at the hands of Monkey D. Luffy. As they recuperated from a hard battle, Zeff overheard Sanji turn down the chance to leave the Baratie with Luffy to the Grand Line. Seeing the joy on Sanji's face and voice as he talked about his dream, Zeff had Patty and Carne help him in a plan to convince Sanji to leave. As they met to eat, they all pretended Sanji's soup tasted horrible. They told him his cooking skills were horrible and should leave. Sanji was even kicked out of the restaurant by Zeff when he challenged them and their tastes. When the chefs explained they were only faking so Sanji would leave with Luffy, Sanji overheard while he sat outside. After filling him up with supplies, Sanji prepared to push off when Patty and Carne attempted to perform one more surprise attack on Sanji. He easily defeated their attack as he took off. Zeff wished him luck and Sanji bowed and began crying as he showed the Baratie his ultimate respect. Sanji then left the Baratie cooks and began his new life as one of the Straw Hat Pirates."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Enies Lobby incident, he was seen laughing at Sanji's wanted poster."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Patty is seen again two years later in an expanded Baratie, in a dessert ship named \"Sister Anko\"."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events at Dressrosa, Patty and the other chefs of the Baratie received Sanji's new wanted poster, with him laughing at Carne's frustration over the fact he modeled his new ship after Sanji's old poster."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Some pirates visited the restaurant and demanded food. Patty was displeased with their presence but Zeff had no objections preparing a meal for them."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the 4Kids dub, Patty has an Irish accent.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Patty's name comes from \"pâtissier\", a baker that specializes in pastries and sweets.", "elements": []}, {"text": "A 'patty' is also a small, round, flat cake made of minced meat that is commonly used in hamburgers.", "elements": []}, {"text": "Patty's favorite food is pudding.", "elements": []}]}], "images": []}]}