{"sections": [{"title": "Laboon", "level": 1, "content": [{"type": "paragraph", "text": "Laboon is a large whale native to the West Blue, whom the Straw Hat Pirates encounter immediately after entering the Grand Line. He is classified as a Type A creature, \"Big Friendly\", and at the top of both the size and friendliness scale."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Laboon is an extremely large whale, comparable in size to most of the Calm Belt's Sea Kings; his eye alone is several times larger than the Going Merry. His skin is black (blue in the anime), coupled with short fins and a fluked tail. Much of his head is crisscrossed with scars, from his many years of tackling Reverse Mountain. After meeting the Straw Hats, Laboon had a crude replica of their Jolly Roger painted over these scars."}, {"type": "paragraph", "text": "His interior contains a complex network of metal chambers and tunnels, installed - presumably by Crocus - to deal with his habit of swallowing ships that challenge or annoy him. The largest of these chambers, built into his stomach, can receive newly-swallowed ships from his esophagus and allow them to leave through a set of gates leading to his blowhole; it also holds an artificial island with a cabin for Crocus to \"vacation\" in. This chamber is \"painted\" with an unknown material that not only resembles the daytime sky (complete with clouds) but apparently produces its own light."}, {"type": "paragraph", "text": "52 years ago, he had rounder teeth and was around the size of a small dinghy, just large enough to carry two or three men.Brook remarked that he looked \"cute\" around this time."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Laboon is heavily emotional and surprisingly understanding for a whale. He has both the patience and loyalty of a good friend. He formed strong bonds with the Rumbar Pirates, Crocus (his caretaker), and the Straw Hat Pirates as well. He is also a bit stubborn, as he would not believe the fact that his friends had died, despite Crocus's constant explanation. He would hit the Red Line constantly, completely ignoring Crocus's protests. He also seems to have a bit of a playful nature, as evidenced by Crocus."}, {"type": "paragraph", "text": "In his early years, he was a happy little Island Whale who formed a strong bond with the Rumbar Pirates. However, his happiness was shattered and he fell into a deep depression after he was told that they had fled the Grand Line, leaving him behind. His strong will and determination was led by a blind ambition to see his friends again, clinging on to what little hope he had for their safety. Because of this, he tried to break through the Red Line, so that he could get to the West Blue and rejoin his friends. Later, when Luffy fought him and painted the Straw Hat Jolly Roger on his head, Luffy promised to have a rematch when they meet again. Laboon honored this visual promise on his head and stopped bashing into the Red Line so that it would not disappear. His connection with the Rumbar Pirates remained strong even after that, as when Brook joined the Straw Hat Pirates, Laboon was noted to be unusually happy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Due to his immense size, Laboon is resistant to most physical damage, and was able to survive daily headbutts against the Red Line for decades (albeit not without medical assistance from Crocus). However, he did react in pain when Luffy slammed the mast of the Going Merry into a fresh wound on his head."}, {"type": "paragraph", "text": "Laboon is also able to swallow small-to-medium-sized ships without much difficulty, trapping them inside his stomach. While his stomach acid is mild enough that even an unarmed human can survive brief exposure, lengthy exposure can very much prove fatal."}, {"type": "paragraph", "text": "Intellectually, Laboon is highly capable of understanding both human language and psyches."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Time With the Rumbar Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Over fifty years earlier, Laboon met the Rumbar Pirates after becoming lost and separated from his pod and began following them in his loneliness. After a while, they noticed how sad he looked and they cheered him up by singing and as a result, he continued to follow them. The crew grew attached to him because he was \"cute\". Eventually, while feeding him bait, Brook named him \"Laboon\". He was accepted as a crew member and even aided them when an attack caused a few crew members to fall overboard and no one else could help them."}, {"type": "paragraph", "text": "Despite being a crew member, when the Rumbar Pirates decided to go to the Grand Line, they chose to leave Laboon behind because he was just a baby. However, Laboon refused to leave them and Yorki, their captain, ordered the others to ignore Laboon. When the pirates finally entered the Grand Line, they found that Laboon had followed them much to their surprise. After repairing their ship, the crew finally bid farewell to Laboon, promising him they would return in two or three years, after having traveled all the way around the Grand Line."}], "images": []}, {"title": "Fifty Years of Waiting", "level": 4, "content": [{"type": "paragraph", "text": "Laboon patiently waited for them at Grand Line's entrance under the care of Crocus, who mans the lighthouse that introduces travelers into the Grand Line. After many years passed by without the return of the Rumbar Pirates, Crocus decided to travel with the Roger Pirates to discover what happened to Laboon's crew. Upon his return, Crocus told him that his friends had effectively abandoned him by fleeing the Grand Line through the Calm Belt. The old doctor had cared for Laboon ever since his friends left him and tried to make Laboon understand the situation. Although Laboon knew the truth about his friends, he refused to admit to himself that they were gone."}, {"type": "paragraph", "text": "That night, Laboon turned his head towards the mountain and slammed himself into it for the first time. Over the years that would pass, Laboon gained many scars on his head from slamming into Reverse Mountain. He believed that by doing this, he could destroy the mountain and return to the West Blue where his friends would be waiting for him."}], "images": []}, {"title": "Reverse Mountain Arc", "level": 3, "content": [{"type": "paragraph", "text": "After entering the Grand Line, Laboon was the first thing the Straw Hat Pirates saw. Launching the cannon in the hopes that it would slow them down, Luffy hit Laboon instead. After saving him from Mr. 9 and Miss Wednesday, who were trying to use Laboon for food, Crocus explained to Luffy why Laboon would slam his head into the Red Line."}, {"type": "paragraph", "text": "Luffy, in an effort to give Laboon a renewed sense of hope, picked a fight with the whale by jamming the Going Merry's mast into the whale's head. After the battle (which Luffy called a draw), Luffy promised Laboon that he would return to see him, under the guise of wanting a rematch, which moved Laboon to tears of joy. As a sign of the promise of the future rematch, Luffy painted the Straw Hat Jolly Roger on Laboon's head, commenting that the insignia would wash away if Laboon hit Reverse Mountain further. This prevented Laboon from hitting his head any further. Laboon and the Straw Hats then parted ways as the crew departed in good spirits for Grand Line."}], "images": []}, {"title": "Thriller Bark Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Brook joined the Straw Hats, Laboon was seen again with Crocus, with the Straw Hat Jolly Roger still on Laboon's head, undamaged. Crocus commented on how Laboon seemed to be in good spirits, which Laboon replied to with a triumphant roar, as if knowing that the Straw Hat Pirates and Brook would return."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After two years, Laboon was seen at the Twin Cape with Crocus, who was drinking with an unknown person. The badly drawn jolly roger is still in perfect condition on his face, showing that he has not hit his head against the wall since his meeting with Luffy."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Straw Hats' adventure at Dressrosa, Laboon was shown to be happy about Brook's new bounty while Crocus read the newspaper."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Originally, in the Japanese manga and anime, the appearance of Laboon is also the introduction of Mr. 9 and Miss Wednesday, two Frontier Agents of Baroque Works who are responsible for bringing the Straw Hat Pirates to Whisky Peak (Misty Peak in the 4Kids adaption). However, the fight between Luffy and Laboon where Laboon is stabbed with Going Merry's mast was deemed to be too controversial and violent by 4Kids for American audiences, so Laboon was passed off as an iceberg that was effectively destroyed by Luffy. (In the July 2006 English issue of Shonen Jump, there is a page featuring upcoming One Piece cards; in this, he is called \"Raboon\", but his name remains \"Laboon\", in the manga itself)."}, {"type": "paragraph", "text": "This missing \"arc\" was also significant in it was originally how Nami came to have a Log Pose, though this was also written around in the English anime. In the original, Nami found a Log Pose left by Mr. 9 and Miss Wednesday, which Luffy destroyed. Crocus then gave them his Log Pose."}, {"type": "paragraph", "text": "In the 4Kids version, the Log Pose (here called the \"Grand Compass\") was inside Usopp's pocket which was found when it fell out. Usopp had a \"flashback\" of his father explaining what the Log Pose was (the scene of Yasopp saying \"I can shoot the antenna off of an ant\" was used to mouth the words) where he apparently told his wife that Usopp would find this useful when he became a pirate. Nami and Sanji both then recalled information about the Log Pose and the Grand Line from their past mentors (just like with Yasopp, previous scenes were reused)."}, {"type": "paragraph", "text": "This situation also created a plot hole in the events concerning Brook in this version."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "Pirates Carnival", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sperm Whale – Wikipedia article about the type of whale Laboon resembles.", "elements": []}, {"text": "Whaling – Wikipedia article about the controversy which 4kids censored Laboon for.", "elements": []}]}], "images": []}]}