{"sections": [{"title": "Genzo", "level": 1, "content": [{"type": "paragraph", "text": "Genzo is the sheriff of Cocoyasi Village. He is an ally of the Straw Hat Pirates during the Arlong Park Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Genzo once wore a pinwheel on his hat to distract Nami (because he wanted to see her laugh) when she was a baby because she was frightened by Genzo's face. All of Genzo's scars are from his first encounter with Arlong when he tried to stop him from taking Nami: Kuroobi attacked him and slashed his body several times. Genzo is usually seen wearing a police uniform with short sleeves and pants. After the Straw Hats left Cocoyasi Village, he removed his pinwheel and placed it by Bell-mère's grave."}, {"type": "paragraph", "text": "After the timeskip, Genzo has a little bit of stubble on his chin."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As Bell-mère was growing up, she was known as the village trouble maker (he refers to her as you little thug although at her age, he is said to have been a thief himself). Her reputation caused him to express concerns over the children's well-being when she announced she was adopting them as her daughters. He has had close ties with both Nami and Nojiko since they were kids because of his concern over their adoptive mother's capabilities and spent most of his time watching out for them. Eventually this grew into a desire just to see all three of them live together and grow together as a happy family."}, {"type": "paragraph", "text": "After their mother's death, he became concerned for the happiness of Nami and Nojiko, as he had grown into a father figure to them. He and the other villagers realized Nami would never join up with Arlong's crew without good reason. His concern for her and Nojiko's well being also led him to promise Luffy that he would hunt him down and kill him if he ever took away Nami's smile."}, {"type": "paragraph", "text": "He kept the town together after Arlong took over the island, making sure everyone was safe and able to pay Arlong's tax. Whenever there was trouble between the villagers and Arlong or his crew, he took full responsibility for everything so the villagers would not be punished. He helped keep the village together to give Nami the time to complete her plan to save the village. When her 8 years of hard work to save them fell apart after Arlong's betrayal, he decided enough was enough. If they were going to die, they would die trying to fight Arlong even with Nami pleading that she can just start all over again."}, {"type": "paragraph", "text": "Genzo also has a perverted side, as he becomes quite flustered when Bell-mère offered to pay back the items the latter stole \"with her body\" but when Nami parroted Belle-mere's words, Genzo just yelled at the girl not to pick up her adoptive mother's bad habits. Genzo has a blown-up image of Nami's wanted poster, in which she appears in a bikini, despite stating that she shouldn't have posed like that as it would draw the attention of more perverts (Marriage seekers in the English version) than bounty hunters."}, {"type": "paragraph", "text": "Genzo was also horrified to see Nami's brazen new dress sense in the papers and imagined faceless leering pirates around her."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Nothing more than an ordinary fighter, Genzo lacks any great strength and was easily defeated by Arlong and his crew when he tried to save Bell-mère and her children. However, he has great leadership skills and was the binding force that helped the village survive Arlong and his crew."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Although he is never seen using it, Genzo carries a standard sabre. He also used a pair of pistols when Arlong first came to the island."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Genzo grew familiar with one particular girl in Cocoyasi Village, Bell-mère, a child who caused much trouble (although she claims Genzo himself had once been prone to thievery). He came to refer to her as 'you little thug' as a result of it. However a shock came upon him and the others one day when Bell-mère declared she was going to join the Marines and fight bad pirates. Later he was at the dock aiding Bell-mere when she returned to the village with two small children. He was the first to protest when Bell-mère declared she was old enough to look after children, and he volunteered to help Nojiko and Nami grow up in the troubled world they lived in. Genzo kept a close eye on her, but often Nami would cry upon seeing him. Bell-mère remarked that Nami cried when she saw Genzo because he looked scary. To avoid this, Genzo put his pinwheel on which made Nami laugh."}, {"type": "paragraph", "text": "As Nami was growing up, Genzo kept an eye on Nami as she was renowned for stealing; often referring to her as Bell-mère's 'little cat' upon returning her home. While he was fully aware of how Bell-mère easily got her own way with him, often he would agree to do what she asked because she would say things to embarrass him (E.g. \"I will repay you... With my body\", in the 4kids Dub she simply comments that he takes her fruit without asking). He was the first to find Nami when she ran away from home and then finally revealed her origins. Soon after Nojiko came looking for Nami, he was seen agreeing with the other villagers that although the three girls struggle to get by, they are happy; and thus that everyone should do their best to keep them as such. However, as Nami and Nojiko were running off, Arlong and his crew of fish-men showed up. He told them to go hide behind the houses because it was dangerous on the street."}, {"type": "paragraph", "text": "Genzo had enough money to save his family. To his horror, Genzo spotted smoke coming from Bell-mère's house. He said to himself that Bell-mère doesn't have enough money to buy her and her daughters lives from the pirate. He was terrified when he heard that one of the fish-men saw the smoke. He went to her place to try to save her. When Hatchan looked into the house and saw that the woman was preparing meal for 3, he lied that Bell-mère invited him and another friend for dinner. When Arlong kidnapped Nami, Genzo used 2 pistols to try to stop him from doing so, but he was easily defeated by Kuroobi. From this incident, Genzo was left with large scars all across his body."}, {"type": "paragraph", "text": "Soon afterward, he formed a rebellion to storm Arlong Park to free Nami, but learned that Nami had joined Arlong's crew. Disgusted with Nami, he ordered her to never set foot in the village again. However, he later became suspicious of why Nami would join Arlong, and made Nojiko tell him about her plan to buy Cocoyasi Village. In order to prevent her from feeling that the villagers were counting on her, and that she could not escape if she wanted, he resolved never to reveal that he knew her motives."}, {"type": "paragraph", "text": "For the next eight years, Genzo managed to pay the money to save his life from Arlong's tyranny until the pirate was defeated."}], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "Having endured Arlong and his crew for many years, Genzo began to put various plans of rebellion into place. Things went wrong and the weapons the villagers were hiding were discovered. He barely escaped death when Usopp stepped in and interfered."}, {"type": "paragraph", "text": "After losing all the money she had saved to buy her village, Genzo was disgusted that Arlong sent the Marines after Nami in order to keep her working for him forever. He and the villagers decided they finally had enough and headed off to Arlong Park to fight with the pirates despite Nami's tearful plea."}, {"type": "paragraph", "text": "They were stopped by Johnny and Yosaku who stood guard on the entrance, preventing anyone from entering until Luffy, Zoro, Sanji, and Usopp arrived. During the fight with Arlong and his crew, he and Nojiko focused on keeping Luffy alive because he was thrown into the water at Arlong Park after getting stuck in concrete. They used Luffy's Devil Fruit powers and stretched his head out of the water and took turns attempting to free him from the pinning rock. Sanji dove into the pool to free the rock while Genzo held Luffy's head above water and stretched out. However, Hatchan appeared and attempted to attack Sanji. Nojiko dove in the way to take the brunt of Hatchan's punches. As a result of the strain, the wounds Hatchan received from Zoro opened and halted his attack. Sanji finally destroyed the rock and Luffy was freed."}, {"type": "paragraph", "text": "After Arlong was defeated, he and the villagers celebrated freedom from the fish-men who had made them suffer all these years. Their celebration was almost cut short as Nezumi arrived to spoil the fun. He ordered the riches of Arlong Park to be brought to the Marines. However, Zoro stepped in and Nami helped push Nezumi out of town so that the villagers could keep the money."}, {"type": "paragraph", "text": "He later met Luffy by Bell-mère's grave and told him that if he ever takes Nami's smile away, he would kill him."}, {"type": "paragraph", "text": "After Nami sailed off with Luffy and crew, Genzo said he no longer needed his pinwheel, placing it by Bell-mère's grave."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a5/Bell-m%C3%A8re%27s_Grave_Pre_Timeskip.png/revision/latest/scale-to-width-down/150?cb=20130215231458", "caption": "Genzo's pinwheel by Bell-mère's original grave."}]}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Genzo appeared again later, and was outraged by Nami's wanted poster, wherein she was in a bikini, but had a blown-up version of the picture in his house (being the same size of the wall said picture is attached to), much to Nojiko's confusion."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, Genzo was seen with Nojiko and Chabo. He was reading the newspaper and was fretting over the suggestive picture of Nami that was used in it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7a/Genzo_Two_Years_Later.png/revision/latest/scale-to-width-down/150?cb=20140304164136", "caption": "Genzo's reaction to Nami's new look."}]}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the events of Dressrosa, Genzo and Nojiko received Nami's new wanted poster. Genzo started complaining about the new photo, even though he once again enlarged and hung it on his wall."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids dub, Genzo speaks in a thick Italian accent."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The pinwheel part of Nami's tattoo represents Genzo while the tangerine part represents Bell-mère, paying homage to her father figure and adoptive mother respectively.", "elements": []}, {"text": "The pinwheel also inspired an attack for Luffy during his fight with Arlong.", "elements": []}, {"text": "Genzo's favorite food is raw ham melons.", "elements": []}]}], "images": []}]}