{"sections": [{"title": "Senor Pink", "level": 1, "content": [{"type": "paragraph", "text": "Senor Pink is an officer of the Donquixote Pirates' Diamante Army. He was also the husband of Russian and the father of Gimlet."}, {"type": "paragraph", "text": "Due to his actions and role, he is a supporting antagonist during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Senor Pink is a tall, portly man with large lips, dark shaggy hair, and a double chin. He wears a pink bonnet and purple aviator sunglasses, and carries a yellow pacifier in his mouth. He also wears a blue scarf with white polka dots around his neck with a pink bib underneath it. He wears a purple cut off, sleeveless shirt with the logo \"Let's Baby\" in yellow on it, and what appears to be small swim trunks with stars all over it that are folded over to resemble a diaper. The baby outfit is a homage to his late infant son."}, {"type": "paragraph", "text": "When he was 30 years old, Senor Pink was much slimmer than his present self. He wore a dark-colored suit with a floral shirt, and his hair was neatly combed, showcasing the signs of a well-dressed gentleman. Shortly after the death of Rosinante, Pink adopted his current appearance of dressing as an infant due to it making his comatose wife smile. By age 36, he gained extra weight after falling into depression (having started the formation of his portly figure), his shirt was light-colored and the logo \"Let's Baby\" was dark-colored. In the present, it is the other way around with \"Don't Cry\" printed on the back."}, {"type": "paragraph", "text": "As a child, Senor Pink wore a dark-colored shirt with dirty pants, and he sported numerous bruises on his face."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "For some reason, he is surrounded by many women who seem to be extremely fond of him. However, he claims to be too old for them; advising them to find someone younger, despite dressing himself as an infant. He is also shown to have some manner of indecency as he had no qualms about ripping a woman's bra off in order to wipe his mouth, which does not seem to deter the women's admiration of him, and using a shoe brush to brush his teeth. The women who admire him, as well as others, often remark he is \"hard-boiled\", while his male underlings equally praise how cool he tends to act."}, {"type": "paragraph", "text": "He seems to care about his comrades, as he took a direct hit from Franky's Rocket Launcher on purpose so that Machvise would not take damage, as he was vulnerable after having tried to crush Franky. He seems to have both a cruel and a compassionate side, calling Sugar useless one moment but then worrying about her safety the next. He is also a very proud man, as he refuses to use his ability to run away from his enemies. He even promised that if Franky could survive his strongest attack, he would admit defeat, a promise well kept."}, {"type": "paragraph", "text": "That compassionate side seems to show again, as Franky was able to trick Pink into abandoning the fight when Franky lied that he heard a woman in trouble nearby. Although Pink was angry at being tricked, he was relieved there was not actually a woman in trouble. He continues to show this side of himself such as how he protects a random cat during the middle of battle, something which made even Franky cry in admiration."}, {"type": "paragraph", "text": "His love for his wife was so strong, that he would hide his pirate career from her, as she hates pirates. However, his steadfast loyalty to his crew made it impossible for him to leave them either, forcing him to juggle between his two families. When she found out and left him, he became heartbroken, and did everything to regain her smile, even if it means dressing up like their deceased son by wearing infant clothing. Even when everyone else laughed at him for it, calling him a pervert and believing that he became so because of his loss of his wife and son, he easily brushed it all off due to the love for his wife. Overall, Senor Pink can be considered one of the kinder members of the Donquixote Family."}, {"type": "paragraph", "text": "Despite dressing like a baby and sucking on a pacifier, and his love for his late son, he claims to not like children."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Pink is a loyal officer of the Donquixote Pirates, whom he saw as his family, sentiments that are returned faithfully, and calling Donquixote Doflamingo \"young master\". Despite his affiliation with the crew clashing with that of his wife and son's relationship, the latter both he loved very much, he refused to give up on either family, instead choosing to lie to his wife about his career and hiding the truth. Despite familial attachments with the crew, which Doflamingo stresses and forbids anyone from making fun of each other, Diamante and Trebol are not above laughing at his change in wearing infant clothes, yet he simply ignores them."}], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Senor Pink once had a wife and a son. Senor Pink lied that he was a banker so his wife would not hate him due to his wife's hatred towards pirates. His relationship with his wife became strained after his son died of a fever and his wife learned that he was not a banker."}, {"type": "paragraph", "text": "After his wife got into an accident and was reduced to a vegetative state, Senor Pink dressed like a baby because that was the only thing that made her smile. Even after her alleged death, Pink continues to wear the infant clothes to this day, showing a deep sign of lingering love for her."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Senor_Pink%27s_Family.png/revision/latest/scale-to-width-down/210?cb=20151025211659", "caption": "Senor Pink with his wife and son"}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Franky", "level": 4, "content": [{"type": "paragraph", "text": "Despite being enemies, they developed some respect for each other during their battle at the SMILE factory. Senor Pink told Franky if he survived his finishing move, he'd accept defeat and he even kept his promise when the latter withstood it. Upon being defeated by Franky, the cyborg showed an interest to hear of Pink's past, should they ever meet again in the future."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Since he is one of the officers representing the Donquixote Pirates in the battle for the Mera Mera no Mi at the Corrida Colosseum and part of the Battle Brigade division, he is considered a strong opponent. It is said that when the four officers enter the tournament, they have a 100% chance of victory."}, {"type": "paragraph", "text": "Pink is quite perceptive, as he saw through Franky's body design, and realized that the cyborg's back remains unmodified, and therefore, a glaring weakness."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "He possesses great superhuman strength, as he was able to wrestle and knock down Franky, a very large and heavy cyborg. He is also a very durable person, able to survive a direct hit from Franky's rocket with only minor injuries and burns. He has great skill in wrestling and bare handed fighting, able to use it in combination with his Devil Fruit powers to utilize devastating attacks, able to cause extreme damage to Franky despite his cybernetically enhanced body with a strong level of resistance to even firearms and artillery."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Nekomimi Punch (ネコ耳パンチ, Nekomimi Panchi, literally meaning \"Cat Ear Punch\"): Senor Pink places his fists above his head, making them look like cat ears, while rushing towards the opponent. Then, he tries to headbutt them with his head and fists. It was first used against Franky, but it accidentally hit Kyuin instead.", "elements": []}, {"text": "Nyannyan Suplex (ニャンニャンスープレックス, Nyannyan Sūpurekkusu, literally meaning \"Meow Meow Suplex\"): Senor Pink grabs a person from behind with both of his arms and smashes the opponent's head by bending over backwards and slamming the victim onto the ground. It was first seen used against Franky outside the Toy House. It was unnamed at the time, only getting named later when used at the SMILE factory.", "elements": []}]}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Senor Pink ate the Sui Sui no Mi, a Paramecia-class Devil Fruit that allows him to swim on the ground or through walls. This grants him the ability to move underground and through structures to attack at unsuspecting angles and avoid attacks. This power also allows him to infiltrate enemy bases and commit assassinations."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Sui_Sui_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20141019165710", "caption": "Senor Pink swimming through solid ground."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When entering Minion Island to intercept Donquixote Rosinante, a 32-years old Pink carried a rifle. During the takeover of Dressrosa, a 36-years old Pink carried a katana on his back. His skills with either weapon are not seen."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Omutsu Bakudan (おむつ爆弾, Omutsu Bakudan, literally meaning \"Diaper Bomb\"): Pink releases several spherical bombs from the waist band of his diaper and throws them at his opponent. The effectiveness and size of the explosions has not been shown. This was first seen used against Franky.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Senor Pink had been in Doflamingo's crew for at least sixteen years. The crew was once based in the North Blue at a port town called Spider Miles. Right after a ten-year old Law joined the crew, Pink was seen having a meal with the other members of Doflamingo's \"family\". The crew learned that Law was sick with the Amber Lead Syndrome and they listened as Law explained how he escaped the extermination of Flevance. While out on a raid, after Lao G and Gladius explained to Baby 5 about the country of Flevance and how its people were inflicted with Amber Lead Syndrome, Senor Pink explained about how the country was isolated and the people were later massacred."}, {"type": "paragraph", "text": "After Doflamingo made Law an official member of the crew, the Donquixote Pirates spread their influence as they traveled to the Grand Line. They participated in various activities such as looting, making business deals, and collecting bounties."}, {"type": "paragraph", "text": "While the crew was engaged in battle with the Marines out at sea, Senor Pink showed Doflamingo a note from Corazon saying he and Law left to cure Law from the Amber Lead Syndrome."}, {"type": "paragraph", "text": "Six months after Corazon and Law left the crew, the Donquixote Pirates plotted to steal the Ope Ope no Mi from pirates who were going to sell it to the Marines. They later arrived at Minion Island and were informed by Vergo of Corazon's treachery."}, {"type": "paragraph", "text": "While Doflamingo covered part of the island in his birdcage, the Donquixote Pirates raided and looted the Barrels Pirates' hideout. When they found Corazon, they viciously attacked him until Doflamingo arrived. Buffalo and Baby 5 later informed Doflamingo that the Marines stationed at the island took custody of a boy. Thinking that the boy might be Law, the Donquixote Pirates left Corazon for dead and prepared for departure. Before they left the island, they found themselves under fire by Tsuru's squadron."}, {"type": "paragraph", "text": "Some time after the incident with Rosinate, Pink met a woman named Russian, whom he fell in love with. He kept from her that he was a pirate, since she hated pirates, telling her that he was a legitimate banker and the two were ultimately married. They had a son, Gimlet, but he died while Pink was on business with the Donquixote Family. When Russian found out that Pink was not a banker, she ran away from him. She was later caught in a landslide, making her fall into a permanent vegetative state. Visiting her while showing regret for what happened to his son, Pink began to wear the bonnet, which made his wife smile even in her emotionless state. He ultimately adopted the bonnet and the appearance of a baby from then onward as part of the Donquixote Family."}, {"type": "paragraph", "text": "He participated in Doflamingo's takeover of Dressrosa. After Monet opened the gates to the palace, he and the other officers of the Donquixote Pirates invaded the palace. He commented on how good the view of Dressrosa was from up in the palace."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Donquixote_Pirates_16_Years_Ago.png/revision/latest/scale-to-width-down/210?cb=20150712150319", "caption": "Senor Pink eating dinner with the family."}]}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was first introduced in the Corrida Colosseum as a representative for the Donquixote Pirates in the tournament for the Mera Mera no Mi."}, {"type": "paragraph", "text": "He was later seen guarding the east entrance to the toy house. When Franky arrived, a battle ensued. After Franky dealt a large-scale damage to the building and sent many of Doflamingo's men flying, Senor Pink approached him from behind by \"swimming\" through the ground."}, {"type": "paragraph", "text": "Senor Pink engaged Franky in combat and performed a surprise attack, knocking Franky to the ground."}, {"type": "paragraph", "text": "When Franky started shooting his rockets, Senor Pink took one right in the face in order to protect Machvise, who was unable to move. Soon, the Marines arrived and surrounded the toy house and Pink seemed annoyed by their presence."}, {"type": "paragraph", "text": "He was later seen standing over the defeated Franky with Machvise, Dellinger, and the Marines."}, {"type": "paragraph", "text": "Upon hearing that Sugar had passed out, he voiced his annoyance by insulting her, calling her a brat. However, he voiced his hopes that she was not seriously injured immediately afterwards, much to the delight of his watching female fans."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\" and put a price on the heads of twelve people (including Franky), Senor Pink, Machvise, and Dellinger noticed that Franky disappeared from the Toy House."}, {"type": "paragraph", "text": "They were surprised that the Marines were not taking any action against the Donquixote Pirates even after the truth about Doflamingo was exposed. They then see Luffy, Zoro, and Law dropped down from the sky and landed right in front of them. The three officers wasted no time engaging Law and the two Straw Hats in combat. As they attempted to run, Senor Pink quickly swam through the ground and grabbed Luffy's leg, allowing his comrades to attack him. Their battle was interrupted by the arrival of Issho and Pica, who appeared as a massive stone giant."}, {"type": "paragraph", "text": "After Franky reached the SMILE factory and prepared to attack it with Radical Beam, Senor Pink swam up to him and performed a suplex, preventing him from destroying the factory. Senor Pink then stated his intent to settle the score."}, {"type": "paragraph", "text": "Franky later claimed that there was on old lady in need of help, distracting Pink long enough for Franky and his dwarf group to enter the factory after it was unlocked from the inside. Once Pink realized he was tricked (simultaneously angered at being tricked, and relieved that there was nobody in need of help), he charged into the factory and Franky smashed Kyuin's head against Pink. After Franky stopped Kyuin from going on a rampage, Senor Pink continued on with his battle against him."}, {"type": "paragraph", "text": "He was later seen continuing his \"fight\" with Franky. Both of them moved in a way that resembled synchronized swimming, while the girls and dwarves cheered around them."}, {"type": "paragraph", "text": "He later took a direct punch from Franky in order to protect a cat. After making sure the cat was safe, Pink crumbled to his knees."}, {"type": "paragraph", "text": "Pink's battle with Franky then turned into a test of will. After he willingly took a direct hit from Franky's Strong Hammer, he performed another suplex. After Franky declared to the dwarves that he would withstand every attack, Senor Pink challenged Franky with Baby Buster. The attack failed to defeat the cyborg and while taking a beating from Franky Iron Boxing, Pink thought about his wife and son. As Pink fell to the ground defeated, he shed a tear from remembering his tragic past. Franky respectfully wiped the tears before walking away."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Senor Pink and his fellow officers were arrested by the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6d/Franky_Defeated_by_Senor_Pink%2C_Machvise%2C_Dellinger_and_the_Marines.png/revision/latest/scale-to-width-down/180?cb=20150105020710", "caption": "Senor Pink, Dellinger and Machvise defeat Franky."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Senor_captures_Luffy.png/revision/latest/scale-to-width-down/180?cb=20140531205714", "caption": "Senor Pink captures Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c9/Franky_vs._Senor_Pink_and_Kyuin.png/revision/latest/scale-to-width-down/210?cb=20151130010122", "caption": "Senor Pink and Kyuin vs Franky."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/05/Franky_Pummels_Senor_Pink.png/revision/latest/scale-to-width-down/210?cb=20151025063820", "caption": "Franky pummels Senor Pink."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Senor Pink vs. Franky (Toy House)", "elements": []}, {"text": "Senor Pink and Machvise vs. Franky", "elements": []}, {"text": "Senor Pink, Machvise, and Dellinger vs. Franky (unseen)", "elements": []}, {"text": "Senor Pink, Machvise and Dellinger vs. Monkey D. Luffy, Trafalgar Law and Roronoa Zoro", "elements": []}, {"text": "Senor Pink vs. Franky (SMILE factory)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Senor Pink's backstory is expanded to feature several new scenes. In addition, when Franky is shown dealing him the final blow, it is depicted much more poignantly than what was seen in the manga. The lens in Senor Pink's signature sunglasses fracture and shatter out and tumble away, before the frames slowly fall off his face. This reveals his eyes clearly, at which moment he notes the rain Russian enjoyed has stopped and begins to tear up. As he looks at the sky, the clouds part and sunshine pours down from above. Senor Pink sees a vision of his departed wife and child and opens his mouth to gasp, causing his pacifier to fall out. He then falls to the ground unconscious. In the manga, Senor Pink's defeat did not show his eyes clearly, only featureless blank white eyes that characters usually have upon being knocked out. His glasses and pacifier flung away abruptly, and he did not see visions of Russian and Gimlet in the sky."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Senor_Pink%27s_Eyes.png/revision/latest/scale-to-width-down/210?cb=20151126223720", "caption": "Senor Pink's eyes seen clearly in the anime."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "Senor is pronounced like \"Señor (sen-yor)\" and denotes an older man as \"Mister\" in Spanish. The VIZ translation uses \"Señor\".", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Being able to swim in the ground as the user of the Sui Sui no Mi, Senor Pink is so far the only known Devil Fruit user able to swim (although in particular conditions).", "elements": []}, {"text": "Senor Pink's favorite food is Russian's homemade cooking, and the cocktail, gimlet.", "elements": []}]}], "images": []}]}