{"sections": [{"title": "Gaburu", "level": 1, "content": [{"type": "paragraph", "text": "Commander Gaburu (ガブル隊長, Gaburu Taichō) was a revolutionist commander leading a group of rebels on an unknown island. An image of him first appeared in Chapter 702."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gaburu greatly resembled Caribou, as his subordinates easily mistook Caribou for him. The only differences between the two are that Gaburu lacked a beard and Caribou's signature cowlick. Gaburu also wore a green beret with a red star much like his subordinates."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Gaburu's personality, but he seems to have enjoyed his grandmother's meat pies."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Subordinates", "level": 3, "content": [{"type": "paragraph", "text": "Gaburu is very much admired by his subordinates, as they were overjoyed to the point of tears when they thought he was still alive, and were later seen cheering when they thought he had returned."}], "images": []}, {"title": "Grandmother", "level": 3, "content": [{"type": "paragraph", "text": "Gaburu had quite an affectionate relationship with his grandmother, as he liked her meat pies and she carried a picture of him with a written sign of love on the frame. Her love for her grandson led her to be affectionate towards Caribou, who bears a striking resemblance to Gaburu, though she is well aware that he is really the infamous pirate."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about his abilities since he has yet to make an appearance but as a commander, it can be assumed that he had control over his subordinates."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Gaburu used to be the commander of a revolutionary army, but at some point in his life, he died, leaving his men without a commander. While searching for Gaburu, his subordinates encountered Caribou on one of Kaido's favorite islands and mistook the pirate for him."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name and appearance might be inspired by Che Guevara.", "elements": []}, {"text": "In Chapter 702 and Chapter 719, his name is spelled as \"Gaburu\". However, in Chapter 708, his name is spelled as \"Gabull\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 71 Chapter 702, cover story: Caribou's Kehihihihi in the New World Vol. 23, Gaburu's name and face are seen.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 71 Chapter 708, cover story: Caribou's Kehihihihi in the New World Vol. 27, Caribou finds a picture of Gaburu and his grandmother.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 70 Chapter 696, cover story: Caribou's Kehihihihi in the New World Vol. 18, Gaburu's subordinates search and cry out for him.", "elements": []}]}], "images": []}]}