{"sections": [{"title": "Dellinger", "level": 1, "content": [{"type": "paragraph", "text": "Dellinger is a combatant and an officer of the Donquixote Pirates' Diamante Army who is a hybrid between a human and a fighting fish fish-man."}, {"type": "paragraph", "text": "Due to his actions and role, he is a supporting antagonist during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dellinger is a very short, slim teenager with shaggy shoulder-length blonde hair and a generally effeminate appearance."}, {"type": "paragraph", "text": "His clothing is simple, consisting of light-colored hoop earrings (white in the anime) on his ears, a white baseball cap with horns coming out of it on his head and a mark on the center of his hat shaped like a dark fighting fish (colored blue in the anime), a long sleeved shirt with a giraffe-like design on it, blue shorts, and dark purple stilettos. Though his eyes are innocent-looking outside of combat, if he becomes bloodthirsty, his irises grow wide and red, similar to those of the fighting fish and the way Arlong's eyes change when angered, as well as those of the Lord of the Coast."}, {"type": "paragraph", "text": "Stemming from his fish-man heritage, he has a fighting fish dorsal fin located on his back and horns coming out of his head. This fin appears to be retractable as Dellinger was able to keep it hidden until he attacked Blue Gilly. He also has retractable fangs that he can grow out by forcing his human teeth out of their gums."}, {"type": "paragraph", "text": "As a newborn baby, without even being a year old, Dellinger had an even smaller version of his hat with tiny horns poking through and a small fish drawn on it. He was wearing normal baby clothes, with his already visible fish-man dorsal fin popping through it. At six years old, he wore a backpack and the giraffe-like patterns were only on the lower half of his shirt. The mark on his hat was shaped like an ordinary dark fish (blue in the anime)."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Dellinger has a flamboyant and flashy attitude that matches his eccentric fashion sense. He seems confident in his abilities, as well as a bit arrogant, as he tells Bellamy that he is going to kill him right after demeaning him. He's also a bit too carefree, as he apparently has a habit of blabbing things he knows to others, such as secret information like Doflamingo's order for him to dispose of Bellamy. Because of his confidence, Dellinger holds his own heritage of fighting fish fish-man with pride."}, {"type": "paragraph", "text": "In battle, he is rather sadistic and bloodthirsty, such as when he's fighting against Suleiman. Dellinger also believes that strong people don't require honor, as he mocks Ideo for having such ideals. That said, he's prone to cockiness and as such, doesn't take a lot of situations seriously. This leads to him to be quickly defeated by Cavendish in his Hakuba form when Gladius tries to warn him to stay back but he did not listen."}, {"type": "paragraph", "text": "In the anime he is heard speaking with a double voice, using a pitched and effeminate tone when talking casually, and a deep and masculine tone when fighting or threatening rivals."}, {"type": "paragraph", "text": "He is also shown to be easily annoyed when someone else hinders him from killing his intended target. He becomes very angry at Bartolomeo for protecting Bellamy and swears retribution for his actions. Stating that this is his \"family's business\", he also shows strong bonding to his own crew, which he considers his family."}, {"type": "paragraph", "text": "In the anime, when Dellinger was cut, he was shown visibly worried at seeing his own blood due to a sleepwalking Cavendish slashing him, possibly indicating he never been wounded before or meeting someone who outmatched his speed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Vicious_Dellinger.png/revision/latest/scale-to-width-down/200?cb=20161221020835", "caption": "Dellinger shows his sadistic side in battle."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of the Donquixote Pirates' officers, as well as bearing fish-man genes, Dellinger is no doubt very powerful, in fact being one of the well known participants of the Corrida Colosseum's tournaments where the fighters' calibers are rather high. It's said that when the four officers of the Diamante Army enter the tournament, they've got a 100% chance of victory."}, {"type": "paragraph", "text": "Arguably the greatest testament to his considerable battle prowess is Dellinger's membership in Doflamingo's crew for the entire 16 years of his life, starting from his infancy, an impressive feat considering that, according to Diamante, of the 100 people that tried to join the crew, only the absolute strongest remained after just two days. At six years old, he assisted in the takeover of Dressrosa as the youngest member of the crew."}, {"type": "paragraph", "text": "Dellinger is also quite confident in his own abilities and even outright tells Bellamy, a pirate worth 195,000,000 who is older than him, that he was going to kill him; Doflamingo has enough faith in him to assign him the task of killing Bellamy. This faith proves somewhat valid, since he subsequently defeats Bellamy (albeit while wounded) without effort, though he afterward proves unable to get past Bartolomeo's barriers. He later easily defeats Suleiman,Blue Gilly,, Dagama, and Ideo."}, {"type": "paragraph", "text": "Though despite being a powerful member of the group, he was swiftly defeated by Cavendish in his Hakuba form in one strike."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a human-fish-man hybrid, Dellinger was born physically stronger than the average human, going by his ability to lift cannonballs at two years of age without problems and he has extreme superhuman leg strength as the force of his kicks can easily move a ten-ton Machvise and also seriously injure physically powerful fighters such as Blue Gilly. Having a pair of horns, he can use them to gore his foes through headbutts in a spear-like fashion, a technique he shows to be proficient with, but he can still be immobilized when doing so by being caught and not let go of his horns. He additionally seems to have the ability to grow new teeth whenever he wants, similar to Arlong, as well as being able to choose between human teeth and sharp fighting fish fangs at his will."}, {"type": "paragraph", "text": "Moreover, Dellinger has extraordinary superhuman speed as he can move fast enough to create several temporary duplicates to surprise unsuspecting foes and effortlessly dodges Ideo's attacks."}, {"type": "paragraph", "text": "Dellinger is extremely proficient in kicking, seen when he easily knocks out Blue Gilly, a powerful martial artist known for his own strong kicking, with a single kick while leaving no time for the latter to react. His kicking strength is further highlighted by the fact he is able to kick and move Machvise, who at the time weighs 10 tons thanks to his Devil Fruit, though Dellinger shouts in pain a result of the kick."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/88/Dellinger_Forming_Fangs.png/revision/latest/scale-to-width-down/180?cb=20161221014535", "caption": "Dellinger forms his fighting fish fangs."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Dellinger%27s_speed.png/revision/latest/scale-to-width-down/180?cb=20150503172628", "caption": "Dellinger creates afterimages with his speed."}]}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Pistol High Heel (ピストルハイヒール, Pisutoru Hai Hīru): Dellinger rushes towards to his enemy and kicking him with force while wearing high heeled shoes. It is powerful enough to hurt even super-weighted humans. It is first used accidentally on Machvise.", "elements": []}, {"text": "Danto High Heel (断頭ハイヒール, Dantō Hai Hīru, literally meaning \"Decapitation High Heel\"): Dellinger charges at his enemy and unleashes a hard kick to the neck, potentially strong enough to cut an opponent's head off given its name. It is first used against Blue Gilly and is powerful enough to take him out in one blow.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Pistol_High_Heel.png/revision/latest/scale-to-width-down/180?cb=20140531204609", "caption": "Dellinger accidentally attacks Machvise."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Born from a human and a fighting fish fish-man, Dellinger has been a member of the Donquixote Pirates since he was a newborn infant, having been abandoned at birth and found by the family and raised by Giolla. The crew was once based in the North Blue at a port town called Spider Miles. After Law had been with the crew for about a week, Dellinger was seen sitting on Giolla's lap drinking milk out of a bottle while the crew was dining together. When Doflamingo slammed his hand on the table in frustration after Giolla wrongly stated that Law's sickness was contagious, Dellinger threw his hands up and started crying."}, {"type": "paragraph", "text": "After Law became an official member of the crew, Dellinger went along with them as they spread their influence while traveling to the Grand Line."}, {"type": "paragraph", "text": "He participated in Doflamingo's takeover of Dressrosa. After Monet opened the gates to the royal palace, he and the other high-ranking members of the Donquixote Pirates invaded the palace."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Donquixote_Pirates_16_Years_Ago.png/revision/latest/scale-to-width-down/210?cb=20150712150319", "caption": "Dellinger eating dinner with the family."}]}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was first seen introduced in the Corrida Colosseum as a representative for the Donquixote Pirates in the tournament for the Mera Mera no Mi."}, {"type": "paragraph", "text": "Later, as Bellamy was preparing to assassinate Luffy in order to be accepted as an officer of the Donquixote Pirates, Dellinger approached him and asked him if he had finished with the assassination. In response to this, Bellamy asked Dellinger what he wanted from him. Dellinger then revealed that he was there under Doflamingo's orders to kill Bellamy, saying that Doflamingo had no confidence in him and considered him an eyesore. Bellamy responded by angrily questioning Dellinger's previous statement."}, {"type": "paragraph", "text": "Dellinger severely wounded Bellamy, but before he could kill him, Bartolomeo interfered and protected Bellamy with his barrier. Meanwhile, Dellinger received instructions from Diamante via Den Den Mushi to guard the SMILE Factory alongside Lao G. Dellinger was furious at Bartolomeo's interference and, as he angrily walked away, he swore that both Bartolomeo and Bellamy would not leave Dressrosa alive."}, {"type": "paragraph", "text": "Dellinger was later seen at the toy house, standing next to Machvise and Senor Pink over a beaten Franky."}, {"type": "paragraph", "text": "When Sugar lost consciousness and her powers became undone, Dellinger panicked as all the toys throughout Dressrosa returned to their original forms."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his Bird Cage and put a price on the heads of twelve people (including Franky), Dellinger, Senor Pink, and Machvise noticed that Franky disappeared from the Toy House."}, {"type": "paragraph", "text": "They were surprised that the Marines were not taking any action against the Donquixote Pirates even after the truth about Doflamingo was exposed. They then saw Luffy, Zoro, and Law dropping down from the sky and landing right in front of them. The three officers wasted no time and engaged Law and the two Straw Hats in combat. While attempting to attack Luffy, Dellinger was kicked from behind by Zoro. This caused him to accidentally kick Machvise instead. The battle was interrupted by the arrival of Issho and Pica, who appeared as a massive stone giant."}, {"type": "paragraph", "text": "He was later seen on the second level of the new King's Plateau guarding the palace alongside Machvise, Baby 5, Lao G, and Gladius. While Luffy and his allies were easily fighting their way through Doflamingo's troops, Dellinger began to wonder why Issho and his Marine platoon were not intervening. Baby 5 looked through her binoculars and informed him that the Marines were hindered by Sabo."}, {"type": "paragraph", "text": "As the battle unfolded, Dellinger commented that not a single one of Luffy's allies was defeated on the first level. After the Colosseum fighters reached the second level, Dellinger confronted Suleiman and knocked him down by headbutting him with his horns, piercing The Beheader's chest. When the Colosseum fighters banded together to create an opening for Luffy and Cavendish, Dellinger attacked Dagama, but the latter managed to grab ahold of him."}, {"type": "paragraph", "text": "After Blue Gilly stopped some of the Donquixote Pirates' troops from attacking Luffy and Cavendish, Dellinger charged at him and kicked him in the face. Afterwards, Dellinger came face to face with Ideo."}, {"type": "paragraph", "text": "Ideo attempted to attack with an explosive punch, but Dellinger easily dodged it. When he was distracted due to Pica changing the shape of the plateau, Ideo managed to land a hit on him."}, {"type": "paragraph", "text": "The wound, however, was superficial, and Dellinger later punctured a hole in Ideo's stomach. Thinking that Ideo had fallen, Dellinger checked the situation on the third level and Gladius asked him for assistance. Before leaving the second level, he was grabbed by Ideo. Remarking on how stubborn Ideo was, Dellinger took off his hat, revealing his horns, and showed the fangs he inherited from his fighting fish lineage, which he then used to launch a decisive assault on Ideo, defeating him."}, {"type": "paragraph", "text": "With the fall of his adversary, he went to the third level to assist Gladius in the battle against Cavendish and Bartolomeo. Whilst remaining his cheerful self, he questioned Gladius as to the reason of his delay regarding the battle. He also commented that together the two of them would be unstoppable. Dellinger was then taken by surprise by what seemed to be a gust of wind and got cut down by a sword belonging to Cavendish shortly after. It was then revealed that Cavendish transformed into Hakuba."}, {"type": "paragraph", "text": "His unconscious body was later brought to the palace alongside the fallen Machvise, Lao G, and Sugar. Giolla intended to use Mansherry and her healing powers to revive him and the others. However, Giolla's plan was thwarted thanks to Leo and Kabu arriving and defeating Giolla and saving Mansherry."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Dellinger and his fellow officers were arrested by the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7f/Bartolomeo_and_Dellinger.png/revision/latest/scale-to-width-down/220?cb=20140928201255", "caption": "Dellinger is hindered from killing Bellamy by Bartolomeo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Dellinger_attacks_Luffy.png/revision/latest/scale-to-width-down/100?cb=20140905110929", "caption": "Dellinger tries to attack Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Dellinger_stabs_Suleiman.png/revision/latest/scale-to-width-down/180?cb=20150503172729", "caption": "Dellinger stabbing Suleiman with his horns."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e9/Dellinger_Strikes_Blue_Gilly.png/revision/latest/scale-to-width-down/210?cb=20150503203451", "caption": "Dellinger attacks Blue Gilly."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Dellinger_Defeats_Ideo.png/revision/latest/scale-to-width-down/200?cb=20151004212320", "caption": "Dellinger defeats Ideo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Hakuba_Slashes_Dellinger.png/revision/latest/scale-to-width-down/210?cb=20151004080153", "caption": "Dellinger is defeated by Hakuba."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dellinger vs. Bellamy", "elements": []}, {"text": "Dellinger vs. Bartolomeo", "elements": []}, {"text": "Dellinger, Senor Pink and Machvise vs. Franky (unseen)", "elements": []}, {"text": "Dellinger, Senor Pink, and Machvise vs. Monkey D. Luffy, Trafalgar Law, and Roronoa Zoro", "elements": []}, {"text": "Donquixote Pirates vs. Corrida Colosseum gladiators", "elements": [{"text": "Dellinger vs. Suleiman", "elements": []}, {"text": "Dellinger vs. Dagama", "elements": []}, {"text": "Dellinger vs. Blue Gilly", "elements": []}, {"text": "Dellinger vs. Ideo", "elements": []}, {"text": "Dellinger vs. Cavendish (as Hakuba)", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Dellinger vs. Elizabello II (interrupted by Hajrudin)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "While there are real species of fighting fish, none have the fangs, horns, and fin that Dellinger and the species created by Eiichiro Oda have. This makes him the first fish-man whose design is based on a fictional species.", "elements": []}, {"text": "Due to his effeminate appearance, many fans mistook Dellinger for a female. However, Dellinger was revealed to be male, with Oda explaining his fashion sense as a result of being raised from infancy by Giolla.", "elements": []}, {"text": "He shares his Laughter Style (\"Kyahahaha\") with Miss Valentine.", "elements": []}, {"text": "He, Vergo, and Lao G are the only officers of the Donquixote Pirates who do not have the power of a Devil Fruit.", "elements": []}, {"text": "His name may be a reference to both derringers, a type of small-sized handgun, and Henry Deringer, the man who developed the first derringer model handgun. Notably, derringer type handguns were frequently used by women due to their compact size making them easilly consealable in purses and hand muffs which could be a reference to Dellinger being raised as a girl.", "elements": []}, {"text": "Dellinger's favorite food is melon.", "elements": []}]}], "images": []}]}