{"sections": [{"title": "Machvise", "level": 1, "content": [{"type": "paragraph", "text": "Machvise is an officer of the Donquixote Pirates' Diamante Army."}, {"type": "paragraph", "text": "Due to his actions and role, he is a supporting antagonist during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Machvise is a large overweight man, with long, wavy, blond hair under a big red hat. He has a large beard and mustache. He has a hairy chest and thick, club-shaped arms, with very thin forearms, which are a bit hairy. He also has short, hairy legs."}, {"type": "paragraph", "text": "He sports a large red shirt with swirly designs on it and a tail-like appendage on its back. He wears sunglasses, and has the Donquixote Pirates' jolly roger printed on both his arms, and a red peaked cap that also has the crew's jolly roger on the front. He also wears a clover-shaped iron plate on his back."}, {"type": "paragraph", "text": "As a child, he possessed his tail as well as his red hat. He wore a button-down shirt with a belt and a jacket with polka dots over it. At age 36, he had a more muscular figure, a shorter beard, and wore a wrestling singlet with a single swirly design on the front. At age 42, he wore a sleeveless buttoned shirt with a pocket on the left and was already overweight."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He seems to have a habit of ending his sentences with \"iin\"."}, {"type": "paragraph", "text": "He is rather compassionate, showing concern (though in what seems to be a mocking way) for Baby 5's well being after she was shot. He is also very headstrong, as he was ready to fight any Marines who came to the island after Doflamingo supposedly resigned from the Shichibukai. When fighting Hajrudin he has proven himself to be both merciless and cruel, increasing the destructive power of an attack against an opponent who was injured to the point of barely being able to stand. Oddly in spite of his large size, he often stands in pirouettes."}, {"type": "paragraph", "text": "Like many One Piece characters, Machivise has a distinct laugh: \"Nihihihihihi\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He can be considered strong, as he is one of the officers representing the Donquixote Pirates in the battle for the Mera Mera no Mi, at the Corrida Colosseum. It is said that when the four officers enter the tournament, they have a 100% chance of victory."}, {"type": "paragraph", "text": "Machivise's true strength was shown when he and the other officers engaged the former Colosseum fighters. He was able to defeat Boo, the lieutenant of the Happo Navy, as well as severely wounding Hajrudin, a powerful giant."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Machvise ate the Ton Ton no Mi, a Paramecia-class Devil Fruit that allows him to increase his own weight to tremendous amounts, leveled by metric tons. His main style of fighting involves getting above his targets high in the air, and then swiftly increase his weight to fall on his enemy with his stomach, in an attempt to crush them on the ground. The strength of his weight is powerful enough to easily crack the ground and even a giant's bones."}, {"type": "paragraph", "text": "Because of their same style of abilities, Machvise's fighting style is also very similar to that of Miss Valentine with her Kilo Kilo no Mi, although his powers are superior to hers due to the difference in their weight units."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/40/Ton_Ton_no_Mi_Infobox.png/revision/latest/scale-to-width-down/180?cb=20151003022742", "caption": "Machvise shattering the ground with his increased weight."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Machvise's signature weapon is a round, cross-shaped shield that he uses to crush his enemies with in conjunction with his Devil Fruit power. He keeps it held on his back by four chains while not using it. The shield was later broken in half by Hajrudin."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Machvise was born in the North Blue. He ate the Ton Ton no Mi at a young age, but many people tried to take the fruit's power, forcing him to live on the run from frequent pursuers. The pirate Donquixote Doflamingo also took interest in Machvise's Devil Fruit, and after Machvise was unable to escape him, he joined Doflamingo's crew."}, {"type": "paragraph", "text": "Sixteen years ago, soon after Trafalgar Law joined the crew, Machvise was seen having a meal with the other members of Doflamingo's \"family\". The crew then learned that Law was sick with the Amber Lead Syndrome and that he was a survivor from the extermination of Flevance. Machvise later participated in a raid alongside Lao G, Gladius, Baby 5, Senor Pink, and Giolla."}, {"type": "paragraph", "text": "After returning to base, Machvise and Giolla caught Law trying to run away and brought him to Doflamingo, unaware that he had stabbed Corazon. After Law was made an official member of the crew, the Donquixote Pirates spread their influence as they traveled to the Grand Line. They participated in various activities such as looting, making business deals, and collecting bounties."}, {"type": "paragraph", "text": "Six months after Corazon and Law left the crew, the Donquixote Pirates plotted to steal the Ope Ope no Mi from pirates who were going to sell it to the Marines. They later arrived at Minion Island and were informed by Vergo of Corazon's treachery. While Doflamingo covered part of the island in his birdcage, the Donquixote Pirates raided and looted the Barrels Pirates' hideout. When they found Corazon, they viciously attacked him until Doflamingo arrived. Buffalo and Baby 5 later informed Doflamingo that the Marines stationed at the island took custody of a boy. Thinking that the boy might be Law, the Donquixote Pirates left Corazon for dead and prepared for departure. Before they left the island, they found themselves under fire by Tsuru's squadron."}, {"type": "paragraph", "text": "He participated in Doflamingo's takeover of Dressrosa. After Monet opened the gates to the royal palace, the Donquixote Pirates invaded the palace."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Donquixote_Pirates_16_Years_Ago.png/revision/latest/scale-to-width-down/230?cb=20150712150319", "caption": "Machvise eating dinner with the Family."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "He first appeared on Dressrosa, where he witnessed Baby 5's attacks on Doflamingo. As she continued in her attempt to kill Doflamingo, Machvise asked her what she was doing."}], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo supposedly resigned his title as Shichibukai, Machvise proclaimed that he would fight the Marines if they showed up."}, {"type": "paragraph", "text": "He was later introduced in the Corrida Colosseum as a representative for the Donquixote Pirates in the tournament for the Mera Mera no Mi."}, {"type": "paragraph", "text": "While Franky was breaching the toy house, Machvise joined Senor Pink in the battle against the Straw Hat. Machvise was seen unable to move and Senor Pink took a direct hit from one of Franky's rockets in order to protect him. He later jumped at Franky in an attempt to smash him with his stomach. His attack failed, and the battle was interrupted altogether by the Marines, who had come to arrest Franky. He was later seen standing over the defeated Franky with Senor Pink, Dellinger, and the Marines. When Sugar lost consciousness and her powers became undone, Machvise expressed his annoyance over her defeat."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\" and put a price on the heads of twelve people (including Franky), Machvise, Senor Pink, and Dellinger noticed that Franky disappeared from the Toy House."}, {"type": "paragraph", "text": "They were surprised that the Marines were not taking any action against the Donquixote Pirates even after the truth about Doflamingo was exposed. They then see Luffy, Zoro, and Law dropped down from the sky and landed right in front of them. The three officers wasted no time engaging Law and the two Straw Hats in combat. Once Senor Pink swam up to Luffy and grabbed his legs, Machvise attempted to crush the Straw Hat captain but only managed to pin down his legs. When Dellinger tried to attack Luffy with a kick, Zoro kicked Dellinger towards Machvise. This caused Dellinger to accidentally kick Machvise instead. The fight was soon interrupted by the arrival of Issho."}, {"type": "paragraph", "text": "When Pica joined the fray as a massive stone giant, Luffy made him angry by laughing at his high-pitch voice. Machvise fled before Pica struck his offender. Machvise was later seen on the second level of the new King's Plateau guarding the palace alongside Gladius, Baby 5, Lao G, and Dellinger. As the colosseum fighters fought through the second level, Machvise pointed out that the lower-rank troops were no match for them."}, {"type": "paragraph", "text": "Machvise and his four fellow officers later joined the fray. He got the jump on Boo and crushed him into the ground. However, Boo managed to withstand the attack. After the colosseum fighters banded together, Machvise tackled Boo. Afterwards, Machvise was confronted by Hajrudin. The officer later used his 10 Ton Vise attack to bring down the giant."}, {"type": "paragraph", "text": "He then turned his attention to Zoro, who was fighting Pica at the time, and initiated his 1000 Ton Vise attack, hoping to crush the swordsman. Midway through his free fall, he spotted Hajrudin, who had risen once more. Intending to kill the giant, he quickly magnified his attack, turning it into the 10,000 Ton Vise. Hajrudin lashed out with his signature attack, Gungnir, which sent Machvise rocketing towards the sky. His momentum took him through Doflamingo's 'Bird Cage', shredding him. He fell to the ground, motionless and incapacitated."}, {"type": "paragraph", "text": "His unconscious body was later brought to the palace along side the fallen Dellinger, Lao G, and Sugar. Giolla intended to use Mansherry and her healing powers to revive him and the others. However, Giolla's plan was thwarted thanks to Leo and Kabu arriving and defeating Giolla and saving Mansherry."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Machvise and his fellow officers were arrested by the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6d/Franky_Defeated_by_Senor_Pink%2C_Machvise%2C_Dellinger_and_the_Marines.png/revision/latest/scale-to-width-down/210?cb=20150105020710", "caption": "Senor Pink, Dellinger, and Machvise defeat Franky."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Machvise_Strikes_Boo.png/revision/latest/scale-to-width-down/210?cb=20150503203811", "caption": "Machvise crushes Boo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b1/Hajrudin_defeats_Machvise.png/revision/latest/scale-to-width-down/180?cb=20141215131850", "caption": "Hajrudin defeats Machvise."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Machvise, Senor Pink, and Dellinger vs. Franky", "elements": []}, {"text": "Machvise, Senor Pink, and Dellinger vs. Monkey D. Luffy, Trafalgar Law, and Roronoa Zoro", "elements": []}, {"text": "Donquixote Pirates vs. Corrida Colosseum gladiators", "elements": [{"text": "Machvise vs. Boo", "elements": []}, {"text": "Machvise vs. Hajrudin", "elements": []}]}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Machvise's favorite food is pizza.", "elements": []}]}], "images": []}]}