{"sections": [{"title": "Lao G", "level": 1, "content": [{"type": "paragraph", "text": "Lao G is an officer of the Donquixote Pirates' Diamante Army. Due to his actions and role, he is a supporting antagonist during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lao G is old and rather short. He is bald with veins protruding from his head. He has a beard and wrinkled skin. In his appearances, his eyes have been shadowed out, as they are extremely squinted. His mouth is also shadowed, suggesting that he doesn't have any teeth despite being able to speak and eat."}, {"type": "paragraph", "text": "He wears a blue jumpsuit with a white arrow pointing upwards with two blue lightning bolt-like shapes pointing towards his shoulders. The jumpsuit has a belt with the letter \"G\" on the buckle. He also wears white gloves and boots. He wears red tights under his jumpsuit, with blue arrows pointing downward on his legs."}, {"type": "paragraph", "text": "As a child, Lao G had a curly patch of hair on his forehead with the front curl resembling a G. He wore a shirt with an arrow pointing upwards that had a \"G\" on it, a sash around his waist, white gloves, and black pants. His eyes were also wide and visible, yet to turn squinted. At age 54, he wore a dark blue bunny-eared hat and had a more muscular body, as well as a black beard trimmed to form a G, and was shown to still have teeth. At age 60, his hair had started to gray and he was becoming pot-bellied. He wore a cap with devilish horns and eyes, gloves, a blue bodysuit with a yellow gold matrix-pattern, what seems to be briefs over it and a belt with the green letter \"G\" as the gold yellow buckle."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is very calm and analytical, as he was able to deduce that Doflamingo had an ulterior motive for his supposed abdication. He always emphasizes the letter \"G\" in his words and even goes so far as to mimic it with his hands."}, {"type": "paragraph", "text": "He seems to be rather senile in his old age, such as when he went back into the elevator that he had just left instead of going to the Toy House. He appears to be far-sighted, as he needed glasses in order to spot Kabu up close. This does not seem to affect his fighting capabilities, however, as he was able to swat Kabu away quickly with minimal effort. He is also hard of hearing."}, {"type": "paragraph", "text": "He has his own Laughter Style: \"Fafafafafafa\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Like other members of the Donquixote Pirates, he has respect and loyalty to Doflamingo and calls him \"Young Master\"; he considers Doflamingo's orders to be absolute."}, {"type": "paragraph", "text": "He was seen with Giolla a few times playing cards with her. As he played, he got angry when Baby 5 tried to accept a joke of a proposal from Trebol, while showing no mercy in declaring Trafalgar Law a traitor. When Trebol failed to protect Sugar from fainting, Lao G mocked the Elite Officer for his inability to defend a single girl, to which Trebol retorted in an angry manner."}, {"type": "paragraph", "text": "He admitted that he thought of Baby 5 as merely convenient."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "Lao G has made enemies with the citizens of Dressrosa once the truth about Doflamingo was revealed."}, {"type": "paragraph", "text": "He had fought the dwarves from the Tontatta Tribe and Thunder Soldier to keep them from their objective of overthrowing Doflamingo."}, {"type": "paragraph", "text": "Lao G had battled some of the gladiators who allied with Luffy and went head on with Chinjao. After Chinjao gave Sai the title of \"Don\", Lao G defeated the former during their discussion. During his battle with Sai, Lao G mocked his opponent, believing that a \"weakling like him needs another 100 years of training\" to challenge him. He also mocked Sai's belief that Luffy could defeat Doflamingo and declared that he, along with everyone in Dressrosa, could not escape the Birdcage. Lao G also believed that Sai was proposing to Baby 5 and he could not let him have her."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of the officers of the former Shichibukai led Donquixote Pirates, Lao G has shown to be a powerful fighter, despite his age. In fact, he is one of the well-known fighters of the Corrida Colosseum, where the caliber of fighters is very high. It is said that when the four officers enter the tournament, they have a 100% chance of victory."}, {"type": "paragraph", "text": "Doflamingo also trusted him enough to guard the entrance to his factory from the Straw Hats' actions."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Lao_G%27s_Speed.png/revision/latest/scale-to-width-down/300?cb=20141202205402", "caption": "Lao G demonstrates his high speed and reflexes."}]}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Despite his elderly age, Lao G has proven himself to be an extremely powerful and skilled martial artist, being able to knock down Thunder Soldier, a toy known for his speed and dexterity, with ease. His incredible speed and reflexes are seen further on when he managed to put his glasses on and then swat Kabu away, despite the fact that the dwarf, a species known for its speed, was mere inches away from his face. Even the likes of Chinjao, a pirate of legendary strength, is shown to be no match for him (although at the time the latter was still weakened by his fight against Luffy). He was the one who taught Law hand-to-hand combat, along with a diagram of pressure points, showing his skills as a teacher."}, {"type": "paragraph", "text": "However, his legs seem to be frail from old age, as they were shivering while standing, and his eyesight requires spectacles to see more clearly. His body can even become so weak that his spirit may leave it and be ready to pass on. However, he can just as quickly recover from near-death if he feels he has been called back, showing that he still has a very strong life force."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Lao_G_attacks_Don_Chinjao.png/revision/latest/scale-to-width-down/210?cb=20141121234653", "caption": "Lao G kicks Don Chinjao."}]}, {"title": "Jio-Ken", "level": 4, "content": [{"type": "paragraph", "text": "Lao G is a master of a martial arts style known as the Jio-Ken. The techniques utilized all revolve a theme around his advanced age, taking advantage of any debilitating symptoms of an elderly as his fighting stance. With his mastery of Jio-Ken, he could fight and overwhelm Chinjao, who is an extremely powerful master of Hasshoken. Lao G can use the ultimate technique of this style which is to use qigong to conserve his physical vitality during his youth, which he can store up until he needs it, granting him immense strength of his prime once unleashed, thus negating his weaknesses of senescence."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Lao G was already a member of the Donquixote Pirates, at age 54, when a 10-year-old Trafalgar Law joined. After Law had been with the crew for about a week, Lao G was having a meal with the other members of Doflamingo's \"family\". The crew then learned that Law was sick with the Amber Lead Syndrome and heard how Law escaped the extermination of Flevance. While out on a raid, Lao G and Gladius explained to Baby 5 about the country of Flevance and how its people were inflicted with the Amber Lead Syndrome."}, {"type": "paragraph", "text": "After Law was made an official member of the crew, the Donquixote Pirates spread their influence as they traveled to the Grand Line. They participated in various activities such as looting, making business deals, and collecting bounties. Lao G was also instructed by Doflamingo to teach Law hand-to-hand combat skills."}, {"type": "paragraph", "text": "Six months after Corazon and Law left the crew, the Donquixote Pirates plotted to steal the Ope Ope no Mi from pirates who were going to sell it to the Marines. They later arrived at Minion Island and were informed by Vergo of Rosinante's treachery."}, {"type": "paragraph", "text": "While Doflamingo covered part of the island in his Birdcage, the Donquixote Pirates raided and looted the Barrels Pirates' hideout. When they found Rosinante, they viciously attacked him until Doflamingo arrived. Buffalo and Baby 5 later informed Doflamingo that the Marines stationed at the island took custody of a boy. Thinking that the boy might be Law, the Donquixote Pirates left Rosinante for dead and prepared for departure. Before they left the island, they found themselves under fire by Tsuru's squadron."}, {"type": "paragraph", "text": "He participated in Doflamingo's takeover of Dressrosa. After Monet opened the gates to the royal palace, the Donquixote Pirates stormed the palace."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Donquixote_Pirates_16_Years_Ago.png/revision/latest/scale-to-width-down/210?cb=20150712150319", "caption": "Lao G eating dinner with the Family."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Law_Being_Trained_by_Lao_G.png/revision/latest/scale-to-width-down/210?cb=20150719215319", "caption": "Lao G trains Law in martial arts."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "Lao G played cards with Giolla and asked Doflamingo what he would do to Trafalgar Law. Later, when Sugar asked where Doflamingo was, Lao G suggested that he was in his room on the fourth floor, only to be told that she already looked there. They then figured that Doflamingo went to Punk Hazard alone. Lao G stated that it is just like Doflamingo to go off on his own while leaving behind his crew."}], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "While playing cards again, Lao G declared that Doflamingo's supposed decision to abdicate his throne was absolute when Baby 5 asked them if they saw Trebol. When Trebol, who jokingly asked Baby 5 to marry him, and she started to think he needed her, Lao G and Giolla yelled at her not to go there."}, {"type": "paragraph", "text": "He later appeared at the Corrida Colosseum as one of the Donquixote Pirates' representatives in the tournament for the Mera Mera no Mi. However, before the first round ended, Lao G was ordered to guard the SMILE Factory."}, {"type": "paragraph", "text": "After waiting at the entrance of the factory, he reentered the lift. When the lift reached mid-way to the palace, he defeated Thunder Soldier and his group of dwarves without considerable effort."}, {"type": "paragraph", "text": "The lift later reached the palace and Lao G continued to have the upper hand. When the palace shook due to Pica's confrontation with Luffy's group, Baxcon, Nubon, and Daikon took the opportunity to pin Lao G down so that Thunder Soldier, Kabu, and Rampo could continue going after Doflamingo."}, {"type": "paragraph", "text": "After the toys returned to their original forms, Doflamingo was exposed as a villain and proceeded to implement his \"Birdcage\" plan. Sometime after Pica relocated the royal palace to the top of Flower Hill, Lao G and some other officers gathered there to discuss with Doflamingo about plans concerning the Straw Hat Pirates and the Marines. Lao G reprimanded Trebol for failing to protect Sugar and Diamante for losing the Mera Mera no Mi."}, {"type": "paragraph", "text": "He was later seen on the second level of the new King's Plateau guarding the palace alongside Machvise, Baby 5, Gladius, and Dellinger."}, {"type": "paragraph", "text": "As Luffy's allies reached the second level, Lao G declared that they will defeat them one by one. Lao G and his four fellow officers later joined the fray. During the skirmish, Lao G punched Orlumbus in the face."}, {"type": "paragraph", "text": "Lao G fought Chinjao and jumped to dodge the Don's signature headbutt., and later kicked Chinjao in the head. He then got into Yotsu no Kamae and fircely attacked the legend several times. During Chinjao's argument with Sai, Lao G's life force began leaving his body but then returned when Baby 5 tearfully pleaded for him stay, despite the fact that he did not hear what she said."}, {"type": "paragraph", "text": "After Chinjao granted Sai the title of Don, Lao G performed Jio-Ken Kyukyouku no Higi: Sento Ho Ken and easily defeated Chinjao. He then proceeded to fight Sai, proclaiming that as long as he lived, both Dressrosa and Baby 5 belonged to his master. However, Sai retaliated by kicking his head with a Haki-imbued Kiryu Kirikugi, which split the entire ground they were standing on. Lao G apologized to the young master for his defeat and cursed Sai while falling into the split cracks."}, {"type": "paragraph", "text": "His unconscious body was later brought to the palace alongside the fallen Machvise, Dellinger, and Sugar. Giolla intended to use Mansherry and her healing powers to revive him and the others. However, Giolla's plan was thwarted thanks to Leo and Kabu arriving and defeating Giolla and saving Mansherry."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Lao G and his fellow officers were arrested by the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/Lao_G_vs._Kyros.png/revision/latest/scale-to-width-down/180?cb=20141206180744", "caption": "Lao G stops the Thunder Soldier."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/13/Lao_G_Defeats_Chinjao.png/revision/latest/scale-to-width-down/200?cb=20150922150536", "caption": "Lao G defeats Chinjao."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Sai_Defeats_Lao_G.png/revision/latest/scale-to-width-down/200?cb=20150922213658", "caption": "Sai defeats Lao G."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Donquixote Pirates vs. Thugs", "elements": []}, {"text": "Lao G vs. Thunder Soldier, Kabu, and members of the Tontatta Tribe", "elements": []}, {"text": "Donquixote Pirates vs. Corrida Colosseum gladiators", "elements": [{"text": "Lao G vs. Orlumbus", "elements": []}, {"text": "Lao G vs. Chinjao", "elements": []}, {"text": "Lao G vs. Sai", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Lao G and Gladius vs. Ideo and Sai", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Lao means \"old\" in Chinese (老). G is homophonic with jii (爺, jii), which means \"grandpa\" or \"old man\" in Japanese. Effectively, Lao G's name means \"old grandpa\" or \"very old man\".", "elements": []}, {"text": "He, Vergo, and Dellinger are the only officers of the Donquixote Pirates who do not have the power of a Devil Fruit.", "elements": []}, {"text": "Lao G's favorite food is aged-meat steak.", "elements": []}]}], "images": []}]}