{"sections": [{"title": "Viola", "level": 1, "content": [{"type": "paragraph", "text": "Viola is the second daughter of the Riku Family and the current crown princess of Dressrosa after her niece Rebecca abdicated her position. She is the younger sister of the late Scarlett."}, {"type": "paragraph", "text": "When the Donquixote Pirates took over Dressrosa, Viola joined them and adopted the name Violet, working as an assassin and officer of the Trebol Army until betraying the crew."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Viola is a slender, well-endowed, and olive-skinned woman of average height. She wears her long, slightly wavy dark brown hair pulled back and held in place by a rose, with a lock hanging to the left of her face. This rose is actually used to conceal a hidden dagger."}, {"type": "paragraph", "text": "Along with the red rose on her hair, she wears round earrings, purple stiletto heels, and a long, sleeveless white Flamenco dress with violet polka dots and maroon frills."}, {"type": "paragraph", "text": "At age 19, ten years before joining the Donquixote Pirates, Viola wore her hair in a side-parted, chin-length bob with a pink hairband. She was wearing a long dress with a black top and a light and frilly bottom."}, {"type": "paragraph", "text": "As a child, Viola was seen wearing dresses with puffy shoulders, and her hair was in a shorter, rounded bob."}, {"type": "paragraph", "text": "After Donquixote Doflamingo was defeated and she regained her status as a princess, Viola wore a long fuchsia dress with white frills, and brings the hair in a ponytail."}, {"type": "paragraph", "text": "At the end of the Dressrosa Arc, Viola wore a long dark blue dress with white frills, and brings the hair in a ponytail."}, {"type": "paragraph", "text": "During the Whole Cake Island Arc, Viola wore a light purple blouse, a dark purple long skirt with white frills, light purple pumps, and a red rose on her hair."}, {"type": "paragraph", "text": "During the Levely Arc, Viola wore a red violet dress with white frills, matching pumps, and a red rose on her hair. She had two necklaces and a cream white long cardigan over her shoulders."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When playing the role of Violet, an officer of the Donquixote Family, Viola fits the stereotype of the dancing women of Dressrosa; she seems to be very emotional and romantic but would not hesitate to stab a man who betrays her. She can use her charm to manipulate people, persuading Sanji to kill a man for her and luring him into a trap. She has no qualms about using violence when necessary, as shown when she kicked Sanji full-force in the face, leaving him bleeding and barely conscious."}, {"type": "paragraph", "text": "Her ruthless behavior is actually a symptom of a profound cynicism; not a single man she has ever been involved with has been honest with her, a fact that her powers allowed her to discover. Deep down, she has a kind heart that was moved by Sanji's honesty and kindness, leading her to help him in spite of the consequences."}, {"type": "paragraph", "text": "The true Viola is nobler than her alias Violet, as she sacrificed her own freedom in order to spare her father's life. She never felt true loyalty to any king but her father. Even while working for the Donquixote Family, she kept tabs on the Tontattas' progress without revealing their plans to Doflamingo. Prior to her family's dethronement, Viola showed a more amiable and trusting personality, trying to persuade her sister to trust Kyros despite his background."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Riku Doldo III", "level": 4, "content": [{"type": "paragraph", "text": "Viola is the second daughter of Riku Doldo III. She is shown to love her father very much, having agreed to become one of Doflamingo's subordinates in exchange for her father's life."}], "images": []}, {"title": "Scarlett", "level": 4, "content": [{"type": "paragraph", "text": "Scarlett is Viola's late older sister. Viola cared for her sister's happiness and she even helped Scarlett fake her death so she could be with the man she loved and cried at her \"funeral\". Afterward, she would occasionally visit Scarlett in secret. She takes it upon herself to punish any who show ill will toward Scarlett's daughter, Rebecca. Upon learning that Diamante had killed Scarlett, Viola was so devastated that she attempted revenge with a knife, only stopping when Tank Lepanto pleaded for her to stay strong."}], "images": []}, {"title": "Rebecca", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca is Viola's niece. Viola was present at Rebecca's birth and visited her occasionally before Doflamingo came to Dressrosa. Viola cares for her, as she was shown shooting a screen that showed spectators booing Rebecca in the Colosseum. Viola also said that she had been watching Rebecca for the last ten years and was thankful to the toy soldier who took care of her. When they met on top of the plateau, Rebecca gave her aunt a hug which the latter returned."}, {"type": "paragraph", "text": "When Doflamingo manipulated Rebecca to kill Viola, the latter assured her crying niece that nothing was her fault and that she would bear no grudge towards her which was another sign of her love for her though Viola was saved by Luffy and Law. After Doflamingo's defeat, Rebecca entrusted Viola with taking her place as the crown princess of Dressrosa so she could live with her father, Kyros. Viola understood her niece's desire and supported it as it reminded her of Rebecca's mother."}], "images": []}, {"title": "Kyros", "level": 4, "content": [{"type": "paragraph", "text": "Kyros is Viola's brother-in-law through his marriage to Scarlett. When his job was to guard the two princesses, she was more sympathetic to him than her sister, since her power allowed her to see his true nature. It is clear from the way he refers to her that he holds her in high regard. While he was a toy and she was unaware of his true identity, Viola reciprocated that respect and was grateful to Kyros for raising and cherishing Rebecca in place of her sister. Once Kyros reverted to his human form, Viola burst into tears as memories of her brother-in-law returned."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Initially, Viola regarded Sanji as nothing but another target to be hunted down, and an easy one at that, given his severe vulnerability to women. However, after using her Devil Fruit abilities, she learned that he trusted her even after being betrayed and had only earnest (if perverted) intentions in helping her. As she had spent most of her life being lied to by men, this came as a profound shock to her. Because of his honesty, she began to help him and the Straw Hats in their quest to destroy the SMILE Factory."}], "images": []}, {"title": "Dwarves", "level": 4, "content": [{"type": "paragraph", "text": "Viola has been friends with the dwarves since her childhood, along with her sister, Scarlett. Back then, she and the dwarves would often cause mischief and get in trouble with her father. As a result, they were often sent to the \"punishment room,\" an area at the back of a palace chapel with a small cell fitted to hold the dwarves temporarily. Scarlett would visit and gently admonish them for their mischief, bringing them food and accompanying them when they apologized to King Riku. Years after the Riku family fell from power, Viola continued to watch over the dwarves in place of her sister, showing that she still cherished her relationship with them."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Viola helped Luffy enter the palace in order to reach Doflamingo, though she was thrown off by his reckless nature. She put her full faith in them, even telling her father that, despite being pirates, their promise to defeat Doflamingo was sincere."}, {"type": "paragraph", "text": "Later, Luffy (with the help of Trafalgar D. Water Law) saved her from being killed by Doflamingo. She watched Luffy's final clash with Doflamingo and was amazed by him defeating the latter. Afterwards, Viola broke into tears of joy, thanking Luffy for saving her country and freeing her people from tyranny."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Before Kyros intervened, Doflamingo had planned to execute Riku Doldo III. In order to save her father's life, Viola joined the ranks of the Donquixote Pirates and seemed to have earned Doflamingo's trust enough for him to call her by her real name. However, Viola herself hates Doflamingo for what he did to her family and country and wished to kill him. He was not especially surprised to learn that she had betrayed him. When she confronted him, he seriously wounded her and made it clear that he could forgive his subordinates' failures but would not tolerate betrayal from her. He even manipulated Viola's niece Rebecca to kill her and took joy in their sadness and unwillingness, but they were saved by the combined efforts of Luffy and Law. Viola later watched Doflamingo's defeat with tears of joy."}], "images": []}, {"title": "Donquixote Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Before her defection from the Donquixote Family, Viola was well trusted and respected by the crew, being addressed with honorifics by the foot soldiers. She worked in Trebol's subdivision. However, she actually regarded the entire crew with nothing short of bitter hatred, especially Diamante, who murdered her sister Scarlett. After Sanji convinced her to trust him, Viola did not hesitate to attack her subordinates in order to save him. Gladius was furious at her betrayal, but Doflamingo was not surprised by it."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "World Government and Marines", "level": 4, "content": [{"type": "paragraph", "text": "Because her family was dethroned by a Shichibukai, Viola is extremely distrustful of the World Government. She asserted to her father that the status and protection the World Government granted Donquixote Doflamingo as a Shichibukai is precisely how Dressrosa was driven into corruption and disorder and that she, therefore, has no interest in their definition of justice. She claims they only listen to the cries of the people when it is convenient for them. Viola was therefore surprised to see Admiral Fujitora putting his faith in Luffy to defeat Doflamingo."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Viola is a very graceful Flamenco dancer. She is skilled in manipulating others and, as an assassin of the Trebol Army held in high regards, is an accomplished fighter. Her combat ability was demonstrated when she was able to severely wound Sanji, although comparing their respective strengths is somewhat pointless, given that he would die before fighting back."}, {"type": "paragraph", "text": "As the princess of Dressrosa, she has great authority over the country, a status that was taken away when her family was dethroned by Doflamingo until his defeat. As a former officer of the Donquixote Pirates, she had command over the 2000 soldiers."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Viola ate the Giro Giro no Mi, a Paramecia-type Devil Fruit that affords her various eye- and vision-related powers."}, {"type": "paragraph", "text": "She can use clairvoyance to see anything within a 4,000-kilometer radius in great detail."}, {"type": "paragraph", "text": "In a move that she calls Peeping Mind, she uses her fingers to form \"goggles\" that she can use to see through anything, read the minds of others, and even allow others to see into her memories. It was this ability that let her see through all the men who attempted to lie to her, making her altogether impossible to deceive."}, {"type": "paragraph", "text": "She can also use her Devil Fruit powers in combat. In an attack called Hierro Lagrima: Mekujira (consisting of the Spanish for \"iron tear\" followed by a Japanese pun on the words for \"whale\" and \"glaring\"), Viola's eyes emit whale-shaped tears that subsequently detach and pursue her opponents, attacking them with what seems to be blunt force."}, {"type": "paragraph", "text": "It was her Devil Fruit ability that made Viola a very valuable asset to the Donquixote Pirates, as Doflamingo accepted her offer to spare King Riku's life in exchange for her services. She had already eaten the fruit by the age of ten."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Giro_Giro_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20150827151825", "caption": "Viola using her Giro Giro no Mi powers."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Viola possesses a pistol and was shown using it proficiently when she shot at a screen displaying the Corrida Colosseum Block D battle."}, {"type": "paragraph", "text": "When confronting Doflamingo, she was seen wielding a knife. She appeared to pull it out of her hair, suggesting that the knife was part of the rose-shaped ornament she wore."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Viola was the second princess of Dressrosa. When Kyros was promoted to captain of the royal guard, Viola was accepting of him while her older sister, Scarlett, was skeptical. After Scarlett fell in love with Kyros and left the castle to live with him, Viola and her father would occasionally visit them and their daughter, Rebecca."}, {"type": "paragraph", "text": "On the night of Doflamingo's coup, Monet (who had been working undercover as a servant) captured Viola and opened the gates to the royal palace, allowing the Donquixote Pirates to invade. Because Doflamingo found Viola's power to be useful, he agreed to spare her father's life on the condition that she joined the Donquixote Pirates."}, {"type": "paragraph", "text": "Some time later, Viola was grief-stricken when Diamante informed her that he killed Scarlett. Viola was going to do something rash, but Tank Lepanto stopped her, promising to protect her."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "While Sanji and Zoro were chasing the fairy who stole Shusui, Sanji got distracted by Viola's dancing and lost track of Zoro. After Viola's performance, the police came and searched for her, so she appeared before Sanji and hugged him so that the guards would pass without suspicion. A delirious Sanji asked whether he could help her. She asked him to escort her to the next town, where she wanted him to kill a man for her. Later, Sanji took out a sniper who was aiming at him and Viola, leaving her apparently pleased and impressed."}, {"type": "paragraph", "text": "Viola eventually lured Sanji into a trap, beat him up, and held him captive. They were seen in a warehouse with Sanji handcuffed, bloodied, and bruised as Viola ridiculed his weakness towards women and revealed that she was an assassin from the Donquixote Family. She then used her power to read his mind and learned that the Straw Hats and Heart Pirates had formed an alliance. Shocked by this fact, she further scanned Sanji's mind in order to find the Straw Hats' reason for being on the island, but all she learned was the true depth of his eroticism. She let out a disgusted scream and asked, rhetorically, what he was thinking about at a time like this."}, {"type": "paragraph", "text": "Sanji answered that he was thinking about her: he had noticed that when she asked him to kill a man for her, her tears were sincere. He added that even if a million people denounced her, he never would, for he never doubts a woman's tears. Somehow touched by these words, Viola decided to help Sanji. As her subordinates were about to kill him, she knocked them out, freed him, and thanked him for earlier. She explained that his crew had fallen for Doflamingo's trap the second they landed and allowed him to look into her memories. Sanji was shocked to learn that Doflamingo had never quit the Shichibukai at all. Viola told Sanji to run away and warn his friends, hoping that, while she couldn't oppose Doflamingo, the Straw Hat Pirates might be able to."}, {"type": "paragraph", "text": "She was later seen with Sanji as the latter was warning Franky about Doflamingo's trap via Den Den Mushi. She noticed that some of her subordinates were about to reach their location and gave Sanji a map to the toy house, which was actually the SMILE Factory in disguise. Sanji, fearing that Viola would face serious consequences, said she shouldn't help him so much, but she answered that her leaders most likely knew about her betrayal already. Sanji told her to wait for him at the western shore, the rendezvous point with his crew, declaring that he would definitely let her escape. Viola, touched by this, smiles and called Sanji a romantic fool before running to the shore."}, {"type": "paragraph", "text": "Right after Sanji and Kin'emon met up with Zoro, Viola went to Sanji and informed him that the Thousand Sunny had been seized by Giolla. While Zoro and Kin'emon stayed behind at the Corrida Colosseum, Viola and Sanji headed to Green Bit. On the way, she informed him about the number of Marines present in Dressrosa. Before they parted ways, she assured him that she would receive protection from the government. After he left, Viola came across a group of people watching the Corrida Colosseum tournament on a visual monitor and sneering at Rebecca. Viola shot the monitor and made her way to the royal palace."}, {"type": "paragraph", "text": "After she arrived at the lift leading to the royal palace's entrance, she met Luffy, Zoro, and Kin'emon and offered to guide them to the palace. After getting acquainted with the trio, Viola told them that taking the public lift would be inadvisable since they would be spotted on the way and their costumes would raise too much suspicion. She then spoke to Wicca and revealed that she had been using her ability to monitor the underground rebellion led by the Thunder Soldier. She also thanked Wicca for believing in her father. After explaining about her relationship with Rebecca and Scarlett, Viola took them to a secret passage only known to the royal family and showed them a hidden stairway. Upon finding a pulley-driven basket used for transporting supplies, Zoro suggested that Luffy should climb to the top carrying a rock and hang from the chain to act as a counterweight, allowing them to use the basket as an elevator. Viola protested at the audacity of his idea, but Luffy had already started climbing."}, {"type": "paragraph", "text": "The group later reached the palace rampart tower. Viola was about to sneak them in, but Luffy went ahead and smashed his way through the gate, much to her chagrin. Having alerted the guards, they decided to charge in. Once Viola, Luffy, and Zoro reached Rampart Tower B-1, they were intercepted by Pica. After Viola explained about Pica's Devil Fruit power, Pica attempted to crush the intruders with the palace walls."}, {"type": "paragraph", "text": "Viola and Luffy escaped while Zoro stayed behind to fight the executive. They later ran into Gladius just in time for Luffy to save Thunder Soldier from the officer's clutches. Luffy was about to fight Gladius, but Viola urged him to continue on to the suit room on the second floor. Upon seeing Viola, Gladius expressed his fury at her betrayal. In turn, Viola stated that she was never loyal to Doflamingo, to begin with. Gladius exploded his helmet in reply, sending shrapnel in her direction. Viola, Luffy, and Thunder Soldier escaped through a window and took a shortcut to the second floor. While hiding from sight right outside the suit room, Viola was surprised to see her father there. The three waited for the right moment to attack Doflamingo. Viola later saw Gladius and his men approaching the second floor."}, {"type": "paragraph", "text": "When Sugar's curse broke, Thunder Soldier transformed back into Kyros. As she watched him charge into the room, Viola shed tears of joy, having regained her lost memories of her brother-in-law. She explained to Luffy about everything that had happened in the country and that Kyros is Rebecca's father. After Kyros apparently decapitated Doflamingo, Luffy grabbed Viola and leaped into the room. As Luffy rushed toward Law, Viola gave him the keys to Law's cuffs. Law's rescue was interrupted by Pica's sudden appearance and the revelation that Doflamingo was still alive."}, {"type": "paragraph", "text": "It was revealed that the decapitated Doflamingo was only a clone made of string. After the real Doflamingo appeared and had a brief skirmish with Kyros and Luffy, Pica threw Viola, Doldo, Luffy, Law, and Kyros out of the palace. They could only watch as Doflamingo started setting up the Birdcage. When Doflamingo trapped and forced everyone on Dressrosa into a survival game, Viola was included on Doflamingo's hit list."}, {"type": "paragraph", "text": "After Tank Lepanto, Usopp, Robin,Rebecca, Bartolomeo, Hack, and the Tontatta dwarves reached the top of the old King's Plateau, Viola found the key to Law's sea stone handcuffs. She pleaded to her father to believe in the Straw Hats, pointing out that they could not count on the \"justice\" of the Marines and the World Government and that Luffy was sincere in his promise to defeat Doflamingo. Rebecca volunteered to deliver the key to Luffy and Law. Once Leo finished explaining his plan to reach the flower garden on the new King's Plateau, Viola, Doldo, and Tank watched as Robin, Rebecca, Leo, and Bartolomeo traveled to the new King's Plateau using the Yellow Giant Rhinoceros Beetles."}, {"type": "paragraph", "text": "When the Dressrosa citizens began pursuing Usopp and Doldo, Usopp started to panic. Viola assured him that the citizens would not harm Doldo after learning the truth about the past. Viola and Doldo received word from the dwarves that Mansherry was not imprisoned inside the SMILE factory. Viola used her ability to locate Mansherry inside the royal palace and relay the information to Leo. She was also alarmed to find that Sugar had recovered."}, {"type": "paragraph", "text": "Usopp took the initiative and prepared to snipe Sugar, who intended to turn Luffy and Law into toys. Viola used her ability to help Usopp lock on to the target, while the others held back the Dressrosa citizens. When Usopp was successful in taking Sugar out a second time, a severely impressed Viola praised and congratulated him. She was then pleased to inform Usopp that Luffy and Law had reached Doflamingo unharmed. The Dressrosa citizens decided not to turn King Riku and Usopp over to Doflamingo, realizing that they would be playing into Doflamingo's hands if they had continued. Viola was surprised when Admiral Fujitora placed his faith in Luffy and left Doflamingo's defeat to him."}, {"type": "paragraph", "text": "As the battles with the Donquixote Pirates raged on, Viola informed her father of the status of Law and Luffy's battle against Doflamingo and then told Usopp about the status on each of the Donquixote Pirates' officers. She later contacted Leo and Kabu as they made their way to the palace chapel. Viola informed them that Mansherry was taken by Giolla and was being forced to heal the defeated Donquixote Pirates' officers. Viola panicked when Giolla started torturing Mansherry but was relieved when Leo and Kabu defeated her and saved their princess in the nick of time. Viola later informed the group on the Old King's Plateau about Kyros' victory over Diamante."}, {"type": "paragraph", "text": "Soon, she saw Pica (in the form of a stone behemoth) heading towards the Old King's Plateau, preparing to crush everyone on it. She was awestruck when Zoro sliced up the enormous statue and defeated Pica. After Pica's downfall, Viola notified the others that Luffy had defeated Bellamy, leaving Doflamingo and Trebol as the only remaining enemies. While Doldo, Tank, and the citizens were leaving the Old King's Plateau, Viola informed Usopp, Zoro, Kin'emon, Kanjuro, and Hack of Law's defeat."}, {"type": "paragraph", "text": "She was seen looking nervous as the Birdcage started to shrink. While climbing down the Old King's Plateau with the others, Viola explained the danger of staying at the plateau. After reaching the base of the plateau, Viola informed her father via Den Den Mushi that Doflamingo was the only enemy left. When Luffy dealt a devastating blow to Doflamingo, Viola thought Luffy had won and misinformed Usopp. She later informed Robin about Zoro, Franky, and dwarves' attempts to hinder the advancing bird cage."}, {"type": "paragraph", "text": "As more people joined the effort slow down the Birdcage, Viola decided to face off against Doflamingo. When Rebecca happened upon the confrontation, Viola told her to stand back. During the confrontation, Doflamingo gravely injured and then immobilized Viola. He took control of Rebecca, preparing to have her strike down her defenseless aunt. When Rebecca was about to unwillingly attack Viola, Law saved the latter by switching her position with Luffy, who took the hit with no damage. After Law saved Rebecca from Doflamingo's onslaught by teleporting her away from the battle, Viola witnessed the final clash between Luffy and Doflamingo. Viola then watched Doflamingo's defeat with tears of joy."}, {"type": "paragraph", "text": "Three days after Doflamingo's downfall, Viola informed Rebecca that Luffy and his allies were being pursued by the Marines. When Luffy arrived at the palace and spoke to Rebecca concerning her father, Rebecca asked Viola a favor, which is to take her place as princess. After Luffy took Rebecca to Kyros, Viola informed Doldo of Rebecca's decision to forfeit her title of princess. When she witnessed Issho preparing to strike Luffy and his allies with all the rubble from Dressrosa, Viola worryingly wondered what would save them from Issho's incoming attack. After Luffy and his group escaped, the people of Dressrosa proceeded with the celebrations and Viola was seen dancing."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/55/Viola_Kicks_Sanji.png/revision/latest/scale-to-width-down/210?cb=20140414044242", "caption": "Viola kicking Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/Infiltrating_the_Dressrosa_Palace.png/revision/latest/scale-to-width-down/210?cb=20160614222203", "caption": "Viola and Wicca help the Straw Hats infiltrate Doflamingo's palace."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/Doflamingo%27s_Hit_List.png/revision/latest/scale-to-width-down/180?cb=20150601013423", "caption": "Viola included in Doflamingo's list"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Viola_Confronts_Doflamingo.png/revision/latest/scale-to-width-down/210?cb=20160228153245", "caption": "Viola confronts Doflamingo."}]}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Viola asked Rebecca to accompany the Riku Family as a lady-in-waiting."}], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "After Leo and his band decided to become pirates, Viola and Rebecca helped make new clothes for them."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "On the way to the Levely, Viola's ship was attacked by pirates who planned to abduct her. However, the attack was thwarted by Koby and Helmeppo."}, {"type": "paragraph", "text": "The Dressrosa participants later arrived at Mary Geoise. While talking with Fukaboshi at the castle, Viola noticed that Rebecca looked happy while she was conversing with Vivi and Shirahoshi."}, {"type": "paragraph", "text": "After Mjosgard stopped Charlos from enslaving Shirahoshi, Viola stood close to Shirahoshi as Mjosgard promised to protect the Mermaid Princess during the Levely."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Viola vs. Sanji", "elements": []}, {"text": "Viola vs. Donquixote Doflamingo", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Viola, Luffy, and Zoro vs. Doflamingo's Guards (Rampart Tower)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, between the time when Sanji dealt with the sniper and Viola had Sanji detained and beaten, the two of them arrived at a warehouse. Before going in, Viola seemed to show second thoughts and remorse about using Sanji and asked him to leave her. He refused and didn't even ask why she wanted him to kill the man inside the warehouse, declaring that her tears were enough. Sanji broke in, interrupting a poker game between three thugs who quickly called in reinforcements. Sanji defeated them effortlessly, but the head thug snuck behind him and took Viola hostage, holding a gun to her head. He told Sanji not to move if he wanted her to live, but the next instant, Sanji vanished and then reappeared, kicking him and freeing Viola. He said that he wouldn't forgive the man for making Viola cry, then used Diable Jambe to send the man flying far enough to disappear as a twinkle in the sky. Viola embraced Sanji, to his obvious ecstasy. She asked him for a favor, and he replied that he would do anything for her. In the next moment, Viola cuffed his hands, then his ankles. With a wicked smile, she asked him to die for her, calling him by his epithet, Black Leg Sanji. Sanji looked in horror at Viola's eyes, which had turned dark."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Both \"Viola\" and \"Violet\" can refer to a genus of flowers.", "elements": []}, {"text": "Her dance style, Flamenco is a form of Spanish folk music and dance from the autonomous community of Andalusia in southern Spain.", "elements": []}, {"text": "Her alias and ability may be a reference to \"ultraviolet\", which can be used to see things normally invisible to the human eye.", "elements": []}, {"text": "In Volume 83's SBS, Oda accepted a fan submission for Viola's birthday to be on January 30, despite her birthday being given as April 30 two volumes ago. However, the Birthday Calendar keeps her birthday as April 30. This makes her one of two characters, along with X Drake, to be given two birthdays.", "elements": []}, {"text": "A reader asked Oda why Viola and Doflamingo called each other \"Violet\" and \"Doffy\" in chapter 788. Oda replied that there is a deep secret behind this, but because it is a pretty adult part of the story, he could not tell the reader more.", "elements": []}, {"text": "Viola's favorite food is crema catalana.", "elements": []}, {"text": "The song that Viola dances to when she's introduced \"Violet's Passionate Dance\" makes a reference to Sanji by using the Spanish translation of his epithet. ", "elements": []}]}], "images": []}]}