{"sections": [{"title": "Spartan", "level": 1, "content": [{"type": "paragraph", "text": "Spartan is a gladiator at the Corrida Colosseum who was going to compete for the Mera Mera no Mi, before being defeated by Luffy."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Spartan is a hulking man with long dark hair that is pulled back. He has a scar running down the right side of his torso from the bottom of his thick neck."}, {"type": "paragraph", "text": "His attire consists of a orange paludamentum, a pair of studded wristbands, dark briefs, and black boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is a very aggressive individual who dislikes idle spectators who only come into the Colosseum to look around, He does not hesitate to use force and intimidation to eliminate anyone he dislikes before the matches. He is quick to judge, as when he first saw Luffy (as Lucy), he immediately considered him a weakling who was unworthy to compete in the Colosseum."}, {"type": "paragraph", "text": "He also seems to be a cruel person, as he was said to have bullied Rebecca in the past. Despite his cruel actions, he showed a redeemable side to himself when he aided the other gladiators in providing Luffy enough time to regain his Haki and defeat Doflamingo."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Spartan is powerful enough to win the fighting tournaments fifty-one times within the high-caliber Corrida Colosseum, though he was utterly no match for Luffy."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Throughout the course of his life, Spartan won the monthly fighting tournament held at Corrida Colosseum fifty-one times. He also bullied Rebecca from time to time."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Monkey D. Luffy (under the disguise of \"Lucy\") joined the tournament to compete for the Mera Mera no Mi, Spartan first appeared in the waiting room angry at Luffy, thinking he was just a weak boy who came just to look around, not knowing his identity as the infamous pirate. Although the other tournament players tried to stop him, he attacked Luffy, who dodged the punch and grabbed his hand, lifting him high and flipping him down into the ground, hard. He was then knocked out while the others were left shocked at Luffy's strength."}, {"type": "paragraph", "text": "Luffy was going to get disqualified by the colosseum's staff for presumably starting a fight, but the Chinjao Family stood up for him and pointed Spartan as the one who should be disqualified from the tournament."}, {"type": "paragraph", "text": "After Doflamingo initiated his Birdcage and was nearly defeated by Luffy, Spartan and the other gladiators from the Colosseum provided their aid to Luffy after he became exhausted. The gladiators tried attacking Doflamingo, but they were easily defeated. However, they bought enough time for Luffy to recover, enabling him to defeat Doflamingo and bring down the Birdcage."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Spartan_Defeated.png/revision/latest/scale-to-width-down/210?cb=20140922140646", "caption": "Spartan is easily defeated by Luffy."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Spartan vs. Monkey D. Luffy", "elements": []}, {"text": "Spartan and Corrida Colosseum gladiators vs. Donquixote Doflamingo", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A Spartan is a person from the Greek municipality Sparta or the ancient Greek city-state of the same name. Fittingly, Sparta was very militaristic and was the dominant land-power in ancient Greece. From a young age, male Spartiates were trained for battle and put through grueling challenges to craft them into fearless warriors.", "elements": []}, {"text": "The manga did not state which block he was placed in, but a scene in the anime listed him as registered in D Block.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 703 (p. 17-19) and Episode 633.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 704 (p. 16) and Episode 634.", "elements": []}, {"text": "↑  One Piece Anime — Episode 729, Spartan and the other gladiators prepare to buy time for Luffy to regain his Haki.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 704 (p. 2-3) and Episode 633.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 79 Chapter 791 and Episode 734.", "elements": []}, {"text": "↑  One Piece Anime — Episode 633, Thunder Soldier looks at a board listing the notable gladiators from each block.", "elements": []}]}], "images": []}]}