{"sections": [{"title": "Van Augur", "level": 1, "content": [{"type": "paragraph", "text": "Van Augur, nicknamed \"The Supersonic\", is the sniper of the Blackbeard Pirates. He is currently one of the Ten Titanic Captains and the captain of the Third Ship of the Blackbeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Augur is a rather thin man, with light brown hair that hangs down to his lower neck. He is extremely tall, standing at around the same height as Blackbeard, who is over 11 feet tall. He appears calm all the time, even in battles, and his typical expression is generally emotionless. His eyebrows are almost always furrowed in what looks like a saddened expression, and he rarely smiles. The left lens of the black glasses he wears is a normal, rectangular eyepiece, but the right side is circular and holds what appears to be a cross hair."}, {"type": "paragraph", "text": "He sports a large black hat, protruding out to both sides. Its shape bears an uncanny resemblance to an upturned boat's hull. Van Augur is constantly wearing a long black cape, under which he wears a button-up, pale lavender shirt with loose sleeves, and simple black pants, with a maroon belt with an aqua outline that goes over a small portion of his shirt. He also wears black shoes. Due to the size of his rifle Senriku, he carries it leaned against his shoulder."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Van Augur is extremely calm and analytical even during battle. He very rarely changes his facial expression. However, in his confrontation with Ace on Banaro Island, he showed a darker side - showing a devilish grin after a failed kill shot. Like his crewmates, Augur is a heavy believer in fate. He displays very strong loyalty to Blackbeard and the rest of the crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "After the time-skip, he has become one of the Ten Titanic Captains of the Blackbeard Pirates that personally guard the Yonko, Blackbeard, and has gained great authority in the crew as captain of its third fleet."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Van Augur is shown to have great speed in shooting and running, as he did during his battle against Portgas D. Ace. His powerful eyesight makes him a valuable asset as a scout for the crew, as he managed to spot Akainu on board an approaching Marine battleship. He also demonstrated superhuman endurance for his thin figure as he endured one of Whitebeard's Gura Gura no Mi shockwaves (albeit not a direct hit) and Fleet Admiral Sengoku's shockwaves with the rest of the Blackbeard Pirates."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Van Augur is possibly one of the greatest master marksmen in the entire series. With his favorite rifle Senriku, Augur is able to fire bullets over tremendous distances with extraordinary accuracy. This is shown when Chopper suggested to Usopp that the seagulls flying around their ship were sniped from an extremely long distance, Nami immediately disclaims it since they could not see the island Augur was on, saying it was 'impossible' for any sniper to do. Augur was even able to tell after he shot the birds that one of them did not die immediately, showing his immensely sharp vision. Another example of his immense marksmanship skills (which is seen in the anime) is when he shot through the bullets of Impel Down's staff, and then through the barrels of their guns, destroying them. It was because of this that he was also able to discern Akainu being on board of the incoming battleship from afar."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "As the sniper of the crew, Van Augur uses a rifle called Senriku (千陸, Senriku, literally meaning \"Thousand Lands\") in battle. The rifle is extra long in length, and allows extraordinary long range shooting. Combined with his eyesight and immense marksmanship skills, this makes Senriku a lethal long-range weapon. However, he also used it for pointblank attack against Whitebeard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3e/Senriku_Infobox.png/revision/latest/scale-to-width-down/210?cb=20130811235117", "caption": "Augur wielding the Senriku."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "So far most of Van Augur's past is unknown, such as how he joined Blackbeard's crew in the first place and where he obtained his gun. Some time after joining the Blackbeard Pirates, Van Augur and the entire crew attacked Drum Island forcing the cowardly King Wapol to flee."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Van Augur shot down seagulls at a far distance from Mock Town, to see which one of them would die painfully and which would die quickly. Later, he and the rest of his crew were waiting for Laffitte. They also tried to capture the Straw Hat Pirates, but before they could get to them, the Knock Up Stream sent the Straw Hat Pirates to Skypiea and destroyed the Blackbeard Pirates' raft."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the incident at Enies Lobby, Augur and the rest of the crew were looting Banaro Island when Portgas D. Ace appeared. Augur shot at Ace, who returned fire. After Blackbeard told them not to interfere, Augur and Jesus Burgess carried the sick Doc Q and Stronger out of the battlefield and watched as their captain and Ace battled. While witnessing the two Logia users battle, Augur mused to himself that fate had made its decision that their paths would part once again."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates sailed to Impel Down and passed through the Gates of Justice. They reached the prison as Monkey D. Luffy was rioting in Level 4. As they made their way through Level 1, they encountered former Head Jailer Shiryu, and then made their way down to Level 4, where they encountered the escaping prisoners."}, {"type": "paragraph", "text": "After musing that their meeting was fate, not coincidence, Van Augur stood by as Blackbeard and Luffy briefly fought. After exchanging words with the prisoners, the Blackbeard Pirates continued on their way to the lower levels and confronted Chief Warden Magellan, who poisoned them with his Hydra technique. Later, the whole crew was saved by an antidote from Shiryu, who accepted Blackbeard's offer and joined their crew."}, {"type": "paragraph", "text": "When they reached Level 6, the Blackbeard Pirates had the prisoners fight to the death with the survivors joining the crew."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Van Augur was spotted along with the other members of the Blackbeard Pirates on the execution platform where they were watching the events that unfold on the battlefield. They had come to Marineford because they wanted to witness Ace's death. After Blackbeard confronted Whitebeard, the Blackbeard Pirates struck down Whitebeard."}, {"type": "paragraph", "text": "After Whitebeard died, Van Augur assisted his crewmates in covering Whitebeard with a black cloth and guarded Blackbeard as he started to demonstrate his powers. Blackbeard later emerged and demonstrated the power of the Gura Gura no Mi."}, {"type": "paragraph", "text": "Sengoku in his Buddha form then attacked the Blackbeard Pirates, blasting them with shockwaves. While Blackbeard fought against Sengoku and Monkey D. Garp, Red-Haired Shanks arrived on the battlefield. The Blackbeard Pirates decided to leave rather than fight the Red Hair Pirates."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates made their move in the New World, taking out Jewelry Bonney in the process. The crew was bickering amongst each other on a fiery island. The Blackbeard Pirates' raft was brought close to the point of destruction due to Sanjuan Wolf's size, and they seemingly got in contact with the Marines to trade Jewelry Bonney for a battle ship. On look out, Van Augur alerted Teach that the battle ship had arrived, but not for a trade because Akainu is on board. Knowing that the deal would not happen, the Blackbeard Pirates fled, leaving Bonney and her crew behind to be arrested."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "The Blackbeard Pirates used their captain's knowledge of Whitebeard's former territory to conquer it. Now that Blackbeard had become a Yonko, the Blackbeard Pirates were hunting down powerful Devil Fruit users in order to absorb their abilities. Augur became the captain of third ship."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates later attacked Baltigo, the Revolutionary Army's headquarters. Baltigo was destroyed by the time the Marines and Cipher Pol arrived, but the Revolutionary Army was able to escape. However, the Blackbeard Pirates fled after briefly clashing with Cipher Pol."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events at Totto Land, he was seen listening to his captain's comments about Luffy being too soon to be called a Yonko."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Blackbeard Pirates vs. Drum Kingdom", "elements": []}, {"text": "Van Augur and Jesus Burgess vs. Portgas D. Ace", "elements": []}, {"text": "Blackbeard Pirates vs. Impel Down Guards (Level 1)", "elements": []}, {"text": "Blackbeard Pirates vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Fleet Admiral Sengoku", "elements": []}, {"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco, unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol (unseen)", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the Viz Manga his name is spelled \"Ogre\". The edited for television FUNimation dub also spells it this way, but the closed captions spell the name as \"Auger\". With the release of FUNimation's \"Season Three First Voyage\" (The first set of the Skypiea Arc) this was confirmed to be the case. The subtitles for both the Japanese language track as well as the subtitles translating just the signs and title cards for the dub both spell his name \"Van Auger\", however Oda has stated in Chapter 595 of the manga the official spelling of his name, \"Van Augur\"."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "An early concept of the Blackbeard Pirates was shown in One Piece Green: Secret Pieces. Though Van Augur wasn't seen, he was originally named Van Wagot (ヴァン・ウァゴット, Van Wagotto)."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In both his appearance and abilities, Van Augur bears a number of similarities to the character Adolphus from Terry Gilliam's film The Adventures of Baron Munchausen. Adolphus is one of the eponymous Baron's henchmen, and has incredible eyesight and amazing shooting skills, able to detach an apple from a tree about nine hundred miles away. Van Augur's hat, glasses, hair, cape and rifle all contribute to this resemblance.", "elements": []}, {"text": "His name resembles that of the real life pirate, John Auger.", "elements": []}, {"text": "He can be seen in the beginning of the ninth movie of One Piece, with the rest of the Blackbeard Pirates attacking Drum Island.", "elements": []}, {"text": "When the Blackbeard Pirates were mentioned during the Drum Island Arc, there are a few silhouettes shown. Van Augur was the only one of the crew that was depicted correctly.", "elements": []}, {"text": "Van Augur's name and the way he was introduced point to Roman mythology. An augur was a type of omen reader who read the future by interpreting the flight patterns of birds, much like how Augur was shooting seagulls to see which ones were fated to die painlessly.", "elements": []}, {"text": "At the age of 27, Van Auger is the youngest of the Ten Titanic Captains.", "elements": []}, {"text": "Van Augur's favorite food is yaminabe pot luck.", "elements": []}]}], "images": []}]}