{"sections": [{"title": "Dagama", "level": 1, "content": [{"type": "paragraph", "text": "Dagama is the tactician of the Prodence Kingdom. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi. He is an ally of Luffy during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dagama is a large chubby man, with a hunchback, and black shaggy eyebrows and a thick shaggy mustache."}, {"type": "paragraph", "text": "He sports round black sunglasses and has a yellow coat with red polka dots draped over his shoulders. He wears a yellow beaded necklace with a yellow sun, and brown pants with tan spots."}, {"type": "paragraph", "text": "When he was turned into a toy, he had the appearance of a pig."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ever since he appeared, Dagama has been shown plotting with and bribing the other competitors in his block to gain the upper hand. When the Funk Brothers called him out on this, he told them to stop acting like they weren't plotting something also."}, {"type": "paragraph", "text": "When the B Block battle royale started, he commanded his collaborators to gang up on Bellamy. He then stated that \"all that matters is the last man standing... the ends justify the means\" showing that Dagama will do whatever it takes to win. Later he was shown betraying his collaborators and even attempted to attack Blue Gilly while his back was turned, showing that he has no honor. It was stated by Blue Gilly that Dagama is a very shady and untrustworthy person. However, he redeemed himself when he rallied the colloseum top fighters to fight as one and even held back Dellinger so that Cavendish, Luffy, and Kyros can safely pass the Donquixote Pirate officers. He is also extremely greedy as he was willing to betray the the people that saved him in order to get the prize money, though a scolding from his king managed to change his mind to be more grateful."}, {"type": "paragraph", "text": "Like many other characters, Dagama has a distinctive laugh, \"Gamahahahahah!\" which sounds similar to his own name."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As Tactician of his kingdom, he probably has a very high intelligence, knowledge, as seen by how he was very informed about his gladiator rivals such as Suleiman, Abdullah and Jeet, Orlumbus, Bellamy, Cavendish and Bartolomeo."}, {"type": "paragraph", "text": "Thanks to his cunning and strategic capacity, he arranged for an alliance with various gladiators, such as Tank Lepanto and Blue Gilly, during the B Block battle royale."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Dagama seems to have fairly high stamina (above average at least) as he took a direct hit from Dellinger but quickly recovered and grabbed hold of the young officer."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He has been seen holding both a long spiked club and two katanas, although his level of proficiency with them is unknown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "He came from the Prodence Kingdom with his king, Elizabello II, to compete for the Mera Mera no Mi at the Corrida Colosseum in Dressrosa. He was first seen arguing with the Funk Brothers after they called him out on trying to plot with the other competitors. He then stated that the country that wins the Mera Mera no Mi would gain massive leverage when it came to diplomatic relations and the threat of war, before mentioning the names a few big name fighters."}, {"type": "paragraph", "text": "As Block B was about to start, he entered the arena, along with all other Block B contestants. After Bartolomeo scared the audience with a fake bomb, Dagama scolded him and told him that he was making himself unpopular."}, {"type": "paragraph", "text": "As the fight started, Dagama teamed up with Elizabello II, Tank Lepanto, and several other fighters to take out some of their adversaries. Elizabello asked Dagama whether they should take out Bellamy first, to which Dagama agreed, and stated that they should take out the biggest threats first before their numbers decrease. When Bartolomeo and Bellamy complained about it, Dagama simply told them that the ends justify the means. Dagama and some of the other gladiators were guarding Elizabello so as to give him time to prepare his devastating punch."}, {"type": "paragraph", "text": "Dagama later said that, now that everyone was wounded, it was time to carry out the plan. He then called out to Blue Gilly, a martial artist from the Longleg Tribe. After that, Dagama and Blue Gilly started to attack the group of gladiators surrounding Elizabello II from behind. After defeating some of them, he sarcastically thanked them and said he would give them their reward later if they wished. It was then revealed that Blue Gilly was actually working with Dagama all along, and that he was hired to take out all the gladiators that were protecting the king. He then said that fighters who did not use their brain could only serve as pawns and told Blue Gilly to take out the remainder of them. But as soon as Blue Gilly turned his back to him, Dagama immediately tried to take him out as well. But before he could attack him, Blue Gilly took him out with a kick which threw him out of the ring where he was then attacked by a fighting fish."}, {"type": "paragraph", "text": "He and his king were supposed to receive treatment for their injuries but instead, they were thrown into an underground dungeon filled with broken toys, along with some of the other disqualified participants. Enraged by Doflamingo's trickery, Dagama urged his king to declare war on him."}, {"type": "paragraph", "text": "Shortly afterwards, Ricky revealed himself to be the former king of Dressrosa, Riku Doldo III. While Elizabello was happy to see his old friend, Dagama was not so pleased because of the wars that plagued various countries due to Doflamingo's weapons trading after Doldo's disappearance and Doflamingo's ascension to the throne. He was about to curse Doldo, but he was angrily interrupted by Tank Lepanto."}, {"type": "paragraph", "text": "Dagama was later transformed into a toy and put to work in the underground trade port. While witnessing Usopp's confrontation with Trébol and Sugar, Dagama begged Usopp to succeed, saying that he will offer him money."}, {"type": "paragraph", "text": "When Sugar lost consciousness, her curse broke and the toys return to their original forms. He was then seen standing alongside the former slaves as Usopp was hailed as their savior."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"birdcage\", he and his king returned to the surface. Dagama received a scolding and beating from Elizabello for wanting to get the prize money that Doflamingo was offering. When they found Luffy, Zoro, and Law, they joined forces with them alongside the Chinjao Family, Hajrudin, Ideo, Cavendish, Fighting Bull, Abdullah , Jeet, Blue Gilly, Orlumbus, and Suleiman. When some of the former toys came for the heads of Luffy, Zoro, and Law, the allied colosseum fighters fought them off. They later marched towards the palace and began to battle against Pica, who appeared as a massive stone giant."}, {"type": "paragraph", "text": "When Pica attacked, Chinjao and Elizabello II shattered his stone hand, enabling the group to move forward. Dagama and the other allied fighters fought through Doflamingo's troops. Pica then attacked with his other arm, causing Dagama and some of the other allies to fall back. After avoiding Pica's strike, they were surprised to see Luffy, Zoro, Law, Abdullah, Jeet, and Fighting Bull climbing on Pica's arm. They were also amazed when Luffy shattered Pica's stone head. When Pica's giant stone body stopped moving, Dagama and his allies continued on with their assault."}, {"type": "paragraph", "text": "With Zoro fighting Pica and Sabo fighting the Marines, the colosseum fighters charged up the new King's Plateau and easily defeated the Donquixote Pirates' troops standing in their way."}, {"type": "paragraph", "text": "After reaching the second level, the colosseum fighters were confronted by four of the Donquixote Pirate officers. During the skirmish, Baby 5 attacked Dagama with Revolver Leg. Dagama later banded the colosseum fighters together in order to fight their enemies and create an opening for Luffy and Cavendish. Dellinger, realizing who was the mastermind behind the colosseum fighters' new strategy, launched himself at and impaled Dagama. Dagama remained conscious and grabbed onto Dellinger, shouting for Luffy and the others to proceed onward."}, {"type": "paragraph", "text": "During the final phase of Doflamingo's game, Dagama and the other injured gladiators were temporarily healed by Mansherry. They then defeated the remaining Donquixote Pirates on the New King's Plateau to help the citizens flee from the shrinking Birdcage."}, {"type": "paragraph", "text": "When the Birdcage came close to the central streets, the gladiators work together to push back the Birdcage via Bartolomeo's barrier. Eventually, the effects of Mansherry's healing powers began to wear off and Dagama collapsed."}, {"type": "paragraph", "text": "His efforts were not in vain as Luffy was bought enough time to defeat Doflamingo and bring down the Birdcage."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c3/Block_B_Alliance.png/revision/latest/scale-to-width-down/210?cb=20160115220436", "caption": "Dagama, along with Elizabello, Lepanto and several allies in the Block B."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bf/Blue_Gilly_Defeats_Dagama.png/revision/latest/scale-to-width-down/210?cb=20140331023925", "caption": "Dagama defeated by Blue Gilly."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Luffy_and_the_Corrida_Colosseum_Gladiators_Going_After_Doflamingo.png/revision/latest/scale-to-width-down/250?cb=20160608200003", "caption": "Dagama with Luffy, Zoro, Law, Ucy and the other Corrida Colosseum combatants are on their way for Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Dellinger_Pierces_Dagama.png/revision/latest/scale-to-width-down/180?cb=20150503183106", "caption": "Dagama is pierced by Dellinger."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Revived_Gladiators_Defeat_Donquixote_Pirates.png/revision/latest/scale-to-width-down/190?cb=20161221120222", "caption": "Dagama and the other gladiators defeat the remaining Donquixote Pirates."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dagama vs. Corrida Colosseum Block B Gladiators (except Elizabello II)", "elements": [{"text": "Dagama vs. Blue Gilly", "elements": []}]}, {"text": "Corrida Colosseum gladiators vs. Donquixote Pirates", "elements": [{"text": "Dagama vs. Baby 5", "elements": []}, {"text": "Dagama vs. Dellinger", "elements": []}]}]}], "images": []}]}