{"sections": [{"title": "Cavendish", "level": 1, "content": [{"type": "paragraph", "text": "Cavendish of the White Horse, also known as the \"Pirate Prince\", is a famous Super Rookie and the captain of the Beautiful Pirates. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi. After the final battle against Donquixote Doflamingo, Cavendish decided to pledge his loyalty to Monkey D. Luffy and became the captain of the first ship of the Straw Hat Grand Fleet."}, {"type": "paragraph", "text": "He suffers from a split personality, changing into a bloodthirsty lunatic known as Hakuba when his dominant personality sleeps. He was formerly the prince of the Bourgeois Kingdom before he was exiled. He is an ally of Luffy during the Dressrosa Arc, and one of the central characters from The Stories of the Self-Proclaimed Straw Hat Grand Fleet Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cavendish is considered very attractive by both women and men, who often faint upon seeing him. His bright sky blue eyes are drawn in a style Oda usually uses for women. He is a lean yet muscular man with long, flowing blond hair that reaches just past his shoulders. He is fairly tall, standing about the same height as Bartolomeo (who is 7'3\")."}, {"type": "paragraph", "text": "He wears a black cowboy hat with a large aqua blue colored plume. He sports a ruffled white v-neck shirt under a coat draped over his shoulders. His trousers are dark purple in the anime, but are dark purple and have a thin white stripe on the sides and end in a ruffle just below a pale yellow and aqua blue star on each knee in the anime. In the manga the stripes are orange. Each of his brown high-heeled boots have bronze buckles attached by dark purple straps just above each ankle. He carries his sword Durandal on his left side, as he is right-handed."}, {"type": "paragraph", "text": "When possessed by his alter ego, Hakuba, his face slightly changes and gets a demonic appearance. His face becomes shadowed, his eyes become completely white, and his mouth is opened in a permanent sneer with no teeth showing whilst smiling. All-in-all, his face resembles the grinning mask from the two masks which symbolize drama, though it resembles the gloomy mask when frowning. His hair also comes loose from its ringlets, becoming a bit unkempt, and in the anime it becomes slightly dull. His voice also changes from mild-mannered and cultured to gruff and murderous."}, {"type": "paragraph", "text": "When both personalities are fighting for control of the same body, his face twists into what Bartolomeo considers \"half-and-half\", its features mixed between the two personalities split right down the middle. In the anime, the eye on Cavendish's dominant side also turns yellow-orange (it is unknown if this is Hakuba's actual eye color when his expression is not in its default manic state or an artistic choice to better differentiate between the two personalities, as Hakuba is always seen with featureless blank white eyes when in full control of Cavendish's body) while Hakuba's dominant side retains Cavendish's natural blue eye."}, {"type": "paragraph", "text": "When transformed into a toy, he has a round-shaped head with a cone hat and he wears a polka dotted shirt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Because of his good looks, Cavendish is extremely haughty, prideful, arrogant, boastful and vain, and loves attracting attention. Because of this, he harbors a deep-seated resentment towards the Worst Generation for stealing the spotlight from him two years ago. He even stabs their wanted posters to vent his anger. He is also shown to get deeply annoyed when the person he is talking to ignores him. Due to his petty jealousy, he is even willing to kill those he is jealous of with his own hands and will not let anyone get in his way as shown when he tried to fend off Chinjao, a former pirate who also wanted to kill his intended target at the time. Cavendish is also prepared to kill anyone who plans to take his prey away from him such as Bartolomeo. Despite his extreme narcissism and pettiness, he has an animal-loving nature, in particular towards to his horse and steed, Farul. He became enraged when his animal companion and dearest friend was badly wounded, and he immediately sought revenge on the Donquixote Pirates, showing that he has a deep emotional attachment to his animal friend and companion."}, {"type": "paragraph", "text": "Due to his royal heritage as a prince, Cavendish is highly sophisticated with a great penchant for fanciness as his make-shift meal after the B block was a posh-looking dinner on a tablecloth, with wine and a fancy main course, all of which was served by a waiter."}, {"type": "paragraph", "text": "He seems to be quite sociable as he tried to have a conversation with \"Lucy\" (unaware at first that he was actually Monkey D. Luffy, one of the Supernovas Cavendish hates), despite him being a total stranger. He can be very polite and civil even to people with bad reputations, as he congratulated Bartolomeo for his win despite his bad image."}, {"type": "paragraph", "text": "He has once been seen eating a rose he was carrying around, due to roses being his favorite food."}, {"type": "paragraph", "text": "He loathes others who have gained popularity, specifically those who take attention away from him, but will become immensely happy when he manages to recapture the spotlight, as shown during his speech to the spectators at the Coliseum defending Rebecca. However he seems unable to turn down a request from a \"fan\". This is shown when he accepts Luffy's request to get the others off of the King's Plateau, after mistakenly believing that the Straw Hat is his fan."}, {"type": "paragraph", "text": "While he deeply loathes those who gained immense popularity, he shows sympathy for those who are extremely unpopular as shown when he stood up for Rebecca when the audience booed and jeered at her. He is somewhat honorable as he stated to the audience that a warrior's life is not something one should put up for show and that those who are not willing to risk their own lives have no right to scorn. After seeing Usopp confronting Sugar and Trebol, Cavendish begged him to succeed while promising he won't go after Luffy anymore. After being freed from Sugar's curse, Cavendish kept his word as he ceased his grudge against Luffy. This also extends to Zoro and Law. Later on, his love for honor returned when he refused to leave Law alone after he was defeated by Doflamingo, stating that if Law is determined to die if Luffy is defeated, it would only be after Cavendish dies protecting him."}, {"type": "paragraph", "text": "During Doflamingo's \"Birdcage\", Cavendish displays being level-headed and is quite perceptive. He knew that Doflamingo was never planning on sparing Dressrosa after his exposure even if the people complied with the tyrant's demands. When he was in the underground trade port, Cavendish deduced that if Doflamingo is defeated, Luffy and Law would be at the center of the wrath of the people Doflamingo made deals with. True to his words, when he and his allies were fleeing Dressrosa, an army of ships came to the island to exact their revenge on the two."}, {"type": "paragraph", "text": "Cavendish possesses an inner personality known as Hakuba, which appears only when Cavendish falls asleep. Hakuba is both cruel and merciless, and attacks the people around him with incredible speed while wearing a demonic grin on his face, disappearing only once everyone has been defeated. Cavendish is aware of Hakuba's existence and, by sheer willpower, is able to suppress him to a certain degree when he does not wish him to be present. However, the two tend to argue over the control of their body, where in one case was when Cavendish was upset with how Hakuba chose to attack Robin."}, {"type": "paragraph", "text": "Despite his faults, Cavendish is shown to be very righteous and upright, as he defended Rebecca from the audience's vicious insults despite being completely strangers, leading Luffy to be impressed by him despite their initial enmity. He later showed disdain on how Sugar turns her own soldiers into toys. He also strongly criticized his alter ego Hakuba's murderous and blood thirsty nature, and is willingly to physically hurt himself to restrain his alter ego. He can be generous as he also gave his coat to Robin after she was injured by Diamante's spiked iron balls to stop the bleeding."}, {"type": "paragraph", "text": "When as Cavendish, he refers to himself with \"boku\" (ぼく, \"boku\"), a young boyish way of saying \"I\", but as Hakuba, he uses \"ore\" (おれ, \"ore\"), a more masculine version of \"I\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Originally, Cavendish was the prince of his country before he was exiled for his immense popularity among the women of the kingdom. After his banishment, he was joined by his faithful servants, who would go on to become his crew."}], "images": []}, {"title": "Farul", "level": 4, "content": [{"type": "paragraph", "text": "Cavendish has had his beloved steed Farul since childhood and cares for him dearly. During the charge to the royal palace, Cavendish did not approve of many people riding on his horse at once. He initially argued with Luffy, Law, and Kyros over who will be the one to take down Doflamingo. But when Farul got seriously injured en route, Cavendish left it up to the others and stayed behind to avenge his horse instead."}], "images": []}, {"title": "Suleiman", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat, Cavendish allowed the war criminal Suleiman to join his crew. Cavendish did express annoyance with Suleiman for not addressing him as captain as well as him nonchalantly stating that he joined Cavendish's crew when the latter allowed him to join. Later on, Cavendish became well acquainted with him, so much that he shared his past as a prince with the latter."}], "images": []}, {"title": "Worst Generation", "level": 3, "content": [{"type": "paragraph", "text": "He once hated all the members of the Worst Generation for stealing his glory. According to him, when he became a pirate, he was very famous and well known, but when the Supernovas, the Whitebeard War, and Blackbeard appeared, their daring acts and ruthlessness soon stole his glory and his fame decreased. Because of this, he vowed to kill any Supernova he came across. However, this changed during the Dressrosa Arc as he forgo any hostility towards Luffy and Law. He even went as far as swearing his loyalty to Luffy and becoming his subordinate."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b9/Cavendish_Attacks_Law.png/revision/latest/scale-to-width-down/205?cb=20170906164043", "caption": "Cavendish attacks Law because of his lost popularity, after forgiving Luffy."}]}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Because Luffy is one of the pirates from the Worst Generation, Cavendish at first despised him and wanted him dead."}, {"type": "paragraph", "text": "During their first meeting, Cavendish was friendly and sociable to him since Luffy was under the guise of \"Lucy\". Cavendish spoke openly with him until Chinjao revealed his identity. Right after that, he became hell bent on killing Luffy himself and was enraged by the popularity Luffy gained during his group's battle royale and was utterly disgusted by the cheers Luffy received after his victory in the first round. He outright attempted to kill Luffy after he left the arena, but his attempt ended in failure as Luffy escaped his grasp."}, {"type": "paragraph", "text": "After he was transformed into a toy and enslaved by the Donquixote Pirates, Cavendish silently promised Usopp that if he was able to return him to being a human, then he would let go of his grudge against Luffy. After returning to human form, Cavendish kept true to his word and showed no ill will to Luffy or Zoro; this also extended to Law, who is another pirate from the Worst Generation, where Cavendish ceased attacking Law due to how Luffy claimed how Law was his friend, despite Law's vehement denial."}, {"type": "paragraph", "text": "He fought alongside Luffy in the decisive battle against the Donquixote Pirates during the Birdcage game. Though he, like everyone else, originally wanted to be the one who kills Doflamingo, he allowed Luffy to go to the palace ahead of him after Farul was injured in battle."}, {"type": "paragraph", "text": "While fighting Doflamingo, it was shown that Luffy has grown to respect Cavendish, as he told the latter he was entrusting his friends' well-being into his hands which made Cavendish believe Luffy was his \"fan\" and caused him to accept the request."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Cavendish still believes Luffy to be a fan but respects him to the point that he pledged his loyalty to him and became a representative of the Straw Hat Grand Fleet."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "Similar to Luffy, Law was a pirate from the Worst Generation that stole his glory and for that reason Cavendish wanted him dead. Upon seeing him, he immediately tried to kill him on two occasions but was stopped by Luffy who claimed he was his friend despite the latter's outright denial. Due to his promise of giving up his grudge against Luffy, he extended this to Law as well and cooperated with him to fight against Doflamingo. Later on, Law was entrusted into Cavendish's hands by Luffy during the latter's one on one fight with Doflamingo. When Law wanted to stay behind and help Luffy, Cavendish tried to dissuade him, but when Law refused, Cavendish decided to stay and watch the battle with him. Afterwards, when Law's arm was reattached the two were shown having a casual conversation about how Luffy's and Law's actions with Doflamingo would lead up to a major event in the future."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "As a pirate, Cavendish is an enemy of the Marines. The Marines acknowledge his dangerous skills as a sword genius and some are aware of his split personality though they cannot view him in a sympathetic light since they knew he craved attention."}], "images": []}, {"title": "Donquixote Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Due to Sugar transforming him into a toy and Trebol making him a slave, Cavendish grew a vendetta against them and wanted to take them down after Usopp defeated Sugar which turned him back to human. Cavendish forgo any grudge against Luffy and Law to take down the crew for enslaving him as well as knowing that he would gain even more acknowledgment for defeating an infamous crew. Cavendish took part in the battle against them, and he gave up his chance to fight Doflamingo after his horse had been injured by toy transformed soldiers and wanted revenge. He and Bartolomeo fought Gladius but certain events caused him to fall asleep. As Hakuba, Cavendish effortlessly defeated Dellinger before going back to sleep."}, {"type": "paragraph", "text": "Cavendish later saved Law and Nico Robin from Doflamingo, who he wanted to fight but was requested by Luffy to protect his friends."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Hakuba", "level": 4, "content": [{"type": "paragraph", "text": "Hakuba is Cavendish's other personality. Cavendish is shown to disapprove of Hakuba's ruthless and cold-blooded nature, especially when he must work together with others since Hakuba has no qualms of killing anyone around him. As such, due to Cavendish's sleepwalking disorder, they tend to fight over his body frequently, with Cavendish constantly having to restrain him so he doesn't go on a killing spree."}], "images": []}, {"title": "Rebecca", "level": 4, "content": [{"type": "paragraph", "text": "Cavendish stood up for Rebecca, when the crowd was booing her because of her status as former King Riku's granddaughter, saying that if they are unwilling to fight themselves, then they have no right to jeer at her. Rebecca was grateful for this and thanked him for it, although Cavendish stated that they were just getting on his nerves, and reminded her that they are still enemies. Later on, he seemed impressed with her fighting style."}], "images": []}, {"title": "Bartolomeo", "level": 4, "content": [{"type": "paragraph", "text": "Initially, Bartolomeo was Cavendish's enemy due to competing in the tournament for the Mera Mera no Mi and due to Cavendish desiring to kill Luffy at the time. However, during Doflamingo's Birdcage survival game, they cooperate to defeat the Donquixote Family."}, {"type": "paragraph", "text": "Bartolomeo and Cavendish display a rivalry that is not unlike Sanji's and Zoro's. While they do fight well as a team, as shown in their fight against Gladius when Bartolomeo lets Cavendish in and out his barrier so he can attack Gladius and get to safety from his attacks, they constantly argue with each other over their respective attitude."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The fact that he has a 330,000,000 bounty indicates that he is quite powerful despite not having eaten a Devil Fruit. Three years ago, he was an infamous and feared pirate known to the world before being upstaged by all the Supernovas from the Worst Generation. With his \"beautiful\" appearance, he is able to make women faint from looking at him."}, {"type": "paragraph", "text": "Cavendish owns a white stallion called Farul and possesses excellent horsemanship skills, being able to skillfully ride Farul up the highly complex terrain of the New King plateau while carrying Law, Luffy and Kyros. He is also a very charismatic person who is able to sway the crowd in his favor."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Physically, he possesses a fair amount of superhuman power, as he was seen able to hold Chinjao's massive build in the air, after Chinjao stopped his \"Biken: Blue Bird\" with his headbutt. The fact that he was not shaken by the force of the headbutt and did this with only one arm demonstrates the incredibly high degree of his physical strength. The force he applies in his swordsmanship is powerful enough to create a compressed air slash that can slash through large amounts of stone as shown he cut through part of New King Plateau to create a path. He also has some skills in acrobatics, being able to dodge a double-punch attack directed at him from Chinjao while he was in the air, as well as a barrage of headbutts aimed at him and Luffy, showing considerable speed and reflexes."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Cavendish has an extremely high level of skill in swordsmanship, acknowledged by Vice Admiral Bastille as the prodigious \"Genius of the Sword.\" In the anime, Cavendish defeated multiple powerful gladiators, including Gardoa, with great ease. Cavendish can create extremely powerful compressed air slashes that can cleanly slice large amount of stone and also swiftly decapitate a giant metal doll. Cavendish could use his sword to deflect several String Bullets from Doflamingo aimed at Robin and an injured Trafalgar Law. When taken over by his alter ego, Cavendish's prowess as a swordsman significantly increased, able to strike down the remaining twenty fighters of Block D instantly. He also cut down Dellinger, who is noted by the dwarves to be one of the best fighters of the Corrida Coloseum, in a single slash."}], "images": []}, {"title": "Hakuba", "level": 3, "content": [{"type": "paragraph", "text": "Cavendish has an unusual condition, a combination of narcolepsy, sleepwalking, and dissociative identity disorder. His inner personality, Hakuba, awakens when Cavendish falls asleep and grants him tremendous speed, to the point that he moves too fast for the eyes to track; even with Haki he can barely be seen. Due to this, back in the Rommel Kingdom, everyone believed it was the wind that was slashing people. As such, the phenomenon became known as the \"Kamaitachi of Rommel\" (ロンメルのカマイタチ, Ronmeru no Kamaitachi, literally meaning \"Sickle Weasel of Rommel\"). An even greater example of Hakuba's speed is that he instantly defeated Dellinger, an executive of the Donquixote Pirates, without even being seen, who himself is renowned for defeating opponents with his speed."}, {"type": "paragraph", "text": "As a fighting style it is not ideal for match-style fights like the competition in Corrida Colosseum. Though he defeated the twenty strongest fighters in Block D instantly, in the end it led to Rebecca's victory (as she was the only one who managed to see and barely block his attack) as he promptly fell asleep afterwards. It is also not ideal for fighting alongside comrades as Hakuba will attack both enemies and allies alike."}, {"type": "paragraph", "text": "Cavendish has been shown to be able to suppress Hakuba to a degree where he can access his extremely incredible speed without losing control, but only for a very short duration, and he will still fall asleep afterwards."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is usually seen carrying one of the Meito named Durandal and is proficient in using it."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Cavendish possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Cavendish was born as the prince of the Bourgeois Kingdom. He had Farul since he was a child, and even at a young age women were fawning over him. As he grew up, his popularity grew to the point that the women of the kingdom all refused to get married to anyone else. Eventually, Cavendish was run out of the kingdom for being too popular, and was forced to live with just 74 underlings and 500,000,000."}, {"type": "paragraph", "text": "Sometime in the past in the Rommel Kingdom, his alter-ego Hakuba, also called the Kamaitachi of Rommel, was infamously known as a strange wind that would cut people. The Marines sent to investigate would only become his victims. Soon afterwards, Cavendish set out on his own to become a pirate, and seemed to enjoy the attention he was attracting."}, {"type": "paragraph", "text": "Three years ago, Cavendish entered the New World and made a name for himself. However, following the events two years ago, he has since been overshadowed by the rookies of \"the Worst Generation\". This has caused him to be extremely resentful towards the Supernovas and he has vowed to kill them all."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "He entered the Corrida Colosseum to compete for the Mera Mera no Mi. He was first seen in the battle preparation room, telling Luffy (as Lucy) about the weight limit on protective armor. Luffy accidentally told him his name, but the other contestants thought he was just mispronouncing his alias. Cavendish then proceeded to tell Luffy about his back story such as how he came to despise the pirates from the Worst Generation. Luffy ignored Cavendish in the middle of the conversation, much to his annoyance."}, {"type": "paragraph", "text": "When Block B was about to start, Cavendish sulkily pointed out that Bellamy has a pretty good reputation and asked Luffy which block he is in. Afterwards, it is revealed that Cavendish was assigned to Block D. While watching, Cavendish refused Luffy's request to just forgive the past and insisted on taking revenge on the Supernovas from two years ago. Chinjao then approached the two and revealed Luffy's identity, which shocked Cavendish."}, {"type": "paragraph", "text": "He then immediately drew his sword and prepared to attack Luffy, but Chinjao struck first, attacking Luffy with a headbutt. Right after Luffy dodged the attack, Cavendish tried to force Luffy to take off his fake beard. Chinjao then launched another attack, but Cavendish warded off the second headbutt with his sword. Chinjao continuously assaulted both Luffy and Cavendish with his headbutts until Luffy punched him into the ground. When Chinjao became very furious, Boo and Sai came to stop him. Cavendish then noticed Luffy had disappeared and swore to kill him before Block C starts."}, {"type": "paragraph", "text": "When Block C started, Luffy already reached the ring before Cavendish could confront him. As he tried to go after Luffy, he was held back by the Colosseum staff."}, {"type": "paragraph", "text": "Later on, he was observing Luffy's fight while having a fancy meal. As Bartolomeo approached Cavendish to ask him about Luffy, he congratulated him for his win and told him not to stick his nose into his business, without looking away from Luffy's fight. When Bartolomeo said that he would not allow him to kill Luffy, while trying to grab some of Cavendish's food, Cavendish removed Bartolomeo's hand from his food and told him that Luffy will be his prey. After Luffy tamed the Fighting Bull and gained more popularity, Cavendish was outraged. He was later shown to be unsurprised, though a little grumpy, when Luffy knocked out Hajrudin with one punch.  He was also rather nonchalant when Luffy and Chinjao, the two remaining fighters in Block C, clashed against each other with Haoshoku Haki."}, {"type": "paragraph", "text": "When Luffy defeated Chinjao and won Block C, Cavendish commented on how the cheers from the spectators sickened him. He then aimed to go after Luffy once he left the arena. Bartolomeo interrupted him, once again claiming that he would not be the one to kill Luffy. Cavendish angrily threatened to kill Bartolomeo if he were to interfere."}, {"type": "paragraph", "text": "After Luffy left the arena, Cavendish thrust his sword at him. Luffy effortlessly caught the sword and held on to it tightly. Chinjao arrived and tried to thank Luffy for restoring his head but broke the floor with an accidental headbutt. Luffy ran away and was dragged away by Rebecca before Cavendish could pursue him."}, {"type": "paragraph", "text": "Prior to the start of Block D, the spectators booed and jeered at Rebecca. Cavendish appeared in the arena on his horse and gave a speech to the audience, and said how shameful they were for wanting someone dead while not willing to risk their own lives. The crowd started cheering for Cavendish, making him overjoyed. Rebecca then thanked Cavendish for standing up for her. Cavendish sympathized with Rebecca but reminded her that they are enemies. Once Block D commenced, Cavendish began to fight."}, {"type": "paragraph", "text": "During the battle royal, Cavendish seemed impressed by Rebecca's fighting method of having her opponents fall out of the ring rather than using brute force. However, as the 20 strongest fighters were left standing, Cavendish suddenly fell asleep. When several gladiators took the opportunity to attack him, his alter ego, Hakuba, took control of his body. Hakuba used his incredible skill and speed to quickly strike down all the other fighters. However, Rebecca managed to see and avoid his strike and remained the only one left standing. Cavendish fell back to sleep and was therefore disqualified."}, {"type": "paragraph", "text": "He was still sleeping while he was being taken to the medical room."}, {"type": "paragraph", "text": "He later appeared at the executive tower in the underground trade port, stuck onto a sheet of sticky substance. After coming face to face with Sugar and Trebol, Sugar transformed Cavendish into a toy. He was then put to work in the underground port."}, {"type": "paragraph", "text": "While witnessing Usopp's confrontation with Trebol and Sugar, Cavendish begged Usopp to succeed, saying that he will cease his hostility towards Luffy if he does."}, {"type": "paragraph", "text": "When Sugar lost consciousness, Cavendish transformed back into a human. He was later seen standing alongside the other former slaves as Usopp was hailed as their savior."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\", Cavendish returned to the surface. After finding Luffy, Zoro, and Law, Cavendish briefly vented his rage over his lost popularity at Law. He then explained that he no longer has any ill-will towards the Straw Hats because of Usopp. After giving Law back his hat, Cavendish offered to defeat Doflamingo for Luffy. He then joined forces with Luffy's group alongside the Chinjao Family, Hajrudin, Ideo, Elizabello II, Dagama, Orlumbus, Blue Gilly, Abdullah, Jeet, Suleiman, and Fighting Bull. They later marched towards the palace and began to battle against Pica, who appeared as a massive stone giant."}, {"type": "paragraph", "text": "When Pica attacked, Chinjao and Elizabello II shattered his stone hand, enabling the group to move forward. Cavendish and the other allied fighters fought through Doflamingo's troops. Pica then attacked with his other arm, causing Cavendish and some of the other allies to fall back. After avoiding Pica's strike, they were surprised to see Luffy, Zoro, Law, Abdullah, Jeet, and Fighting Bull climbing on Pica's arm. They were also amazed when Luffy shattered Pica's stone head. When Pica's giant stone body stopped moving, Cavendish and his allies continued on with their assault."}, {"type": "paragraph", "text": "With Zoro fighting Pica and Sabo fighting the Marines, the colosseum fighters charged up the new King's Plateau and easily defeated the Donquixote Pirates' troops standing in their way. They later reached the first level and got ahead of Luffy."}, {"type": "paragraph", "text": "While they fought their way through the second level, Luffy managed to catch up to them. Cavendish approached him and said that he had a plan to reach the top."}, {"type": "paragraph", "text": "He then allowed Luffy and Law to ride on his horse. During the fray, Kyros managed to hitch a ride on Farul as well, much to Cavendish's chagrin. Despite Cavendish's repeated demands for Kyros to get off, he remained on the horse. When the other colosseum fighters banded together, they created an opening for Cavendish, Luffy, and Kyros to go through."}, {"type": "paragraph", "text": "As Farul charged towards the third level, Cavendish explained his awareness that Doflamingo has no intention of sparing anyone even if all twelve people on his hit list were captured. He went on saying that the only way to leave Dressrosa alive is to take Doflamingo's head and Doflamingo made a mistake by gathering strong fighters from different countries. Cavendish, Luffy, Law, and Kyros then briefly argued over who will be the one to defeat Doflamingo. Once they reached the third level, they found giant toy soldiers standing in their way."}, {"type": "paragraph", "text": "One of the toy soldiers then bit on Farul's head until Luffy punched it away. Cavendish angrily attacked the toy with his sword and decapitated it, but the toy easily recovered. Just then Nico Robin, Bartolomeo, and Gladius dropped from the sky. Robin and Bartolomeo told Luffy and his group to move on while they'll deal with the toys and Gladius."}, {"type": "paragraph", "text": "Bartolomeo used his ability to create a stairway to the fourth level. However, Cavendish chose to remain on the third level, wanting to avenge Farul. He then fought alongside Bartolomeo and Robin in the battle against Gladius."}, {"type": "paragraph", "text": "When the giant toys returned to their original forms after Sugar's second defeat, Cavendish was shocked to learn that Sugar turned her own subordinates into toys. He was next seen warning Gladius to prepare himself, notating to himself that his attacks were making him sleepy."}, {"type": "paragraph", "text": "Cavendish later noticed that Gladius was preparing for a destructive explosive attack by swelling and inflating the ground around them. He then asked Bartolomeo to allow him to get behind his barrier. Bartolomeo initially refused and Cavendish yelled that they were on the same side. Fortunately for Cavendish, Bartolomeo allowed him to get behind his barrier the moment Gladius initiated his attack. After reprimanding Bartolomeo for not saving him sooner, Cavendish asked to be let out again so he can continue fighting Gladius. Cavendish was about to strike the officer but was interrupted when Bartolomeo came charging with his barrier."}, {"type": "paragraph", "text": "Some time later, Cavendish turned into Hakuba and started striking down any Donquixote Pirates' troops in his vicinity. He then slashed Dellinger when he arrived to assist Gladius."}, {"type": "paragraph", "text": "After dealing with Dellinger, Hakuba attempted to strike Bartolomeo, but his barriers stopped his attack. He then noticed Robin and ran up the cliff to attack her as well, but the latter was able to stop him with her powers. Cavendish then regained control of his body while apologizing to Robin over what Hakuba did. Cavendish and Hakuba then quarreled with each other for control. Just then, Gladius attempted to rupture the plateau they were on. Bartolomeo attempted to stop Gladius, but his efforts were in vain. Cavendish, having gained some control over Hakuba, pleaded with Robin to trust him to escape the explosion with Hakuba's speed. The two narrowly escaped from Gladius's attack with Cavendish stopping Hakuba from harming Robin by holding his blade with his hand. Hakuba chastized Cavendish for wounding his own body by doing this, but Cavendish finally took total control over himself and retorted that Hakuba needed to listen to him every now and then. Cavendish then fell asleep afterwards while Robin went on ahead, with Hakuba suppressed for the time being."}, {"type": "paragraph", "text": "Cavendish later woke up and went to the Flower Field just in time to deflect Doflamingo's Tamaito, which was aimed at Robin's group. Cavendish was surprised that Doflamingo has not been defeated yet. Luffy then told him to take everyone on the Flower Field away to safety. Cavendish initially refused, wanting to assist Luffy in battling Doflamingo. However, Luffy told Cavendish that he entrusted him with the lives of his friends, causing Cavendish to believe that Luffy is his fan and comply with Luffy's request. Knowing Bartolomeo, who was on one level below, could get them down, Cavendish raced over to him. However, Cavendish had trouble getting Bartolomeo's attention as the latter was still foaming at the mouth after watching Zoro's victory. Eventually, Cavendish got Bartolomeo's attention and prepared to leave the Flower Field with Robin's group. However, Law refused to leave, saying he wanted to witness Luffy's battle to the end and die alongside him if need be. Cavendish reluctantly agreed and told Robin and the rest to go on down Bartolomeo's staircase, as he would remain behind and protect Law."}, {"type": "paragraph", "text": "While sitting next to Law, Cavendish was amazed at Leo's ability to reattach Law's arm and commented that Law and Luffy will be at the center of the upcoming storm."}, {"type": "paragraph", "text": "After Luffy activated his Gear Fourth technique and started gaining the upper hand against Doflamingo, Cavendish was amazed at Luffy's ability."}, {"type": "paragraph", "text": "When Luffy struck Doflamingo with Gomu Gomu no Leo Bazooka and sent him flying into the New King's Plateau, Cavendish commented that no one could survive an attack like that. However, Law told Cavendish to look up, pointing out that the Birdcage was still active. Cavendish was then surprised to see Jesus Burgess jumped down from the palace all the way into the city."}, {"type": "paragraph", "text": "Law later left the plateau and Cavendish did not notice until Gatz announced the approaching finale of the battle between Luffy and Doflamingo."}, {"type": "paragraph", "text": "When Luffy finally defeated Doflamingo, Cavendish quietly watched the collapse of the Birdcage."}, {"type": "paragraph", "text": "Sometime after the aftermath, the gladiators were seen resting at the palace and Cavendish was wrapped in chains to prevent Hakuba from rampaging."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, Cavendish and the other gladiators prepared to assist the Straw Hats' escape from Dressrosa when the Marines were mobilized to pursue them."}, {"type": "paragraph", "text": "As the Straw Hats made their way to the eastern port, Cavendish and his fellow gladiators stood in the way of the Marines that were chasing after them."}, {"type": "paragraph", "text": "The fighters later gathered at the eastern port, preparing to fight Issho. When Issho prepared to attack them with all the rubble from Dressrosa, the fighters and the Straw Hats quickly fled to the escape ship. At that moment, Luffy arrived and attacked Issho."}, {"type": "paragraph", "text": "During the clash, Issho used his gravity ability to blow Luffy, who was then caught by Hajrudin. The fighters and Straw Hats quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after Luffy. They eventually reached Orlumbus' flagship, the Yonta Maria. After boarding the ship, the Beautiful Pirates was then one of the seven groups that pledged their allegiance to the Straw Hats."}, {"type": "paragraph", "text": "When Luffy was asked to drink a sake cup to complete the agreement for an alliance, Luffy declined, much to the others' shock. Once Luffy explained that they can do whatever they want, the allies decided to forge the alliance anyway, forming the Straw Hat fleet. Sai, Bartolomeo, Leo, Cavendish, Ideo, Orlumbus, and Hajrudin sat down and drank their sake cups. Afterwards, they held a feast to celebrate their victory over Doflamingo."}, {"type": "paragraph", "text": "After the feast, Cavendish and the other leading allies received Luffy's vivre card and parted ways."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Luffy_and_Cavendish_vs._Chinjao.png/revision/latest/scale-to-width-down/210?cb=20141206210629", "caption": "Cavendish and Luffy encounter the furious Chinjao."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f0/Farul_Manga_Infobox.png/revision/latest/scale-to-width-down/230?cb=20130925101744", "caption": "Cavendish riding on Farul."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Luffy_and_the_Corrida_Colosseum_Gladiators_Going_After_Doflamingo.png/revision/latest/scale-to-width-down/250?cb=20160608200003", "caption": "Cavendish with Luffy, Zoro, Law, Ucy and the other Corrida Colosseum combatants are on their way for Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Hakuba_Slashes_Dellinger.png/revision/latest/scale-to-width-down/210?cb=20151004080153", "caption": "Hakuba defeats Dellinger."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2a/Cavendish_Protects_Law_and_Robin.png/revision/latest/scale-to-width-down/210?cb=20161221105709", "caption": "Cavendish protects Law and Robin."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/82/Corrida_Competitors_and_Baby_5_Post-Battle.png/revision/latest/scale-to-width-down/250?cb=20160425220708", "caption": "While everyone else sleeps, Hakuba finds himself chained up."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/20/Straw_Hat_Grand_Fleet.png/revision/latest/scale-to-width-down/180?cb=20160613115353", "caption": "Cavendish and the other representatives swear loyalty to Luffy."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "As the Beautiful Pirates sailed an unknown sea in the New World, Cavendish recounted his life story to Suleiman. They later encountered two pirate crews that were deeply infatuated with Cavendish, who told Suleiman that there was no need to fire on them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ad/Cavendish_remembers.png/revision/latest/scale-to-width-down/180?cb=20171005225034", "caption": "Cavendish recounting his life to Suleiman."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Cavendish acted proud as a journalist was interviewing him."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 3, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo along with his crew."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cavendish vs. Monkey D. Luffy vs. Chinjao", "elements": []}, {"text": "Cavendish vs. Monkey D. Luffy (Interrupted by Chinjao)", "elements": []}, {"text": "Cavendish vs. Corrida Colosseum Block D gladiators", "elements": [{"text": "Cavendish (as Hakuba) vs. Mummy, Meadows, Rolling Logan, Acilia, Damask, Suleiman, Orlumbus, and Rebecca", "elements": []}]}, {"text": "Corrida Colosseum gladiators vs. Donquixote Pirates", "elements": [{"text": "Cavendish and Monkey D. Luffy vs. Headcrackers (interrupted by Bartolomeo)", "elements": []}, {"text": "Cavendish, Bartolomeo and Nico Robin vs. Gladius and Headcrackers", "elements": []}, {"text": "Cavendish and Bartolomeo vs. Gladius and Donquixote Pirates", "elements": []}, {"text": "Cavendish (as Hakuba) vs. Dellinger", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cavendish vs. Gardoa", "elements": []}, {"text": "Cavendish vs. Acilia", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cavendish shares his name with \"The Navigator\" Thomas Cavendish, an English explorer and privateer.", "elements": []}, {"text": "His split personality is reminiscent of the famous novel Dr Jekyll and Mr Hyde which features a location called Cavendish Square.", "elements": []}, {"text": "He seems to have a European fairytale and folkore theme:", "elements": [{"text": "White horses have a special significance in mythologies around the world.", "elements": []}, {"text": "His epithets may be references to the heroic princes or white knights in fairy tales.", "elements": []}, {"text": "His sword has the same name as the legendary sword of the Frankish hero Roland.", "elements": []}, {"text": "His named techniques reference different European works and plays.", "elements": []}, {"text": "His kingdom's name may be a reference to a form of tragedy developed in 18th-century Europe.", "elements": []}]}, {"text": "His alter ego's name, Hakuba (白馬, Hakuba), means \"white horse\", which is one of Cavendish's nicknames.", "elements": []}, {"text": "Hakuba's epithet, \"Kamaitachi\", is a reference to the sickle weasel (鎌鼬, sickle weasel) from Japanese folklore that cuts people up so fast it is as if the victims were cut by the wind.", "elements": []}, {"text": "Hakuba's face looks remarkably similar to the Comedy mask associated with drama and the theater.", "elements": []}, {"text": "In the sixth fan poll, Cavendish ranked at 13th place.", "elements": []}, {"text": "Cavendish is the second royal figure to have been banished from his country and become a pirate, the first being Wapol.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cavendish's favorite food are roses, and his least favorite food is ramen.", "elements": []}]}], "images": []}]}