{"sections": [{"title": "Rebecca", "level": 1, "content": [{"type": "paragraph", "text": "Rebecca is the former crown princess of Dressrosa, who forfeited her title to live with her father and currently serves as a lady-in-waiting to the royal family."}, {"type": "paragraph", "text": "She was a gladiator at the Corrida Colosseum who joined a tournament to compete for the Mera Mera no Mi. She is the granddaughter of Riku Doldo III, the daughter of Scarlett and Kyros, and the niece of Viola."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rebecca is a fair-skinned and thin teenager who is of average height but slightly shorter than Luffy. She has long, light pink hair, which she wears in a braid."}, {"type": "paragraph", "text": "As a gladiator, she wore a yellow scale armor bikini, with a turquoise paludamentum, as well as a ridge helmet, a pair of greaves and gloves, and high-heeled armor. The helmet got damaged during Hakuba's assault and was missing the visor's middle piece in the second round. It was completely shattered after Diamante bashed her over the head with a club. She carried a large sword and shield. She discarded the shield before entering the Block D battle royale. She is considered extremely attractive and beautiful by the other gladiators."}, {"type": "paragraph", "text": "Underneath her helmet, her braid splits off into two strands starting at her temples."}, {"type": "paragraph", "text": "Before the Corrida Colosseum tournament started, she wore a short and simple white dress, a yellow pearl necklace and brown sandals."}, {"type": "paragraph", "text": "After Donquixote Doflamingo was defeated and she briefly regained her status as a princess, she was seen wearing a light-colored dress with frills at the bottom, almost identical to the one her mother wore. Rebecca also wore a ribbon which was tied at the top of her long braided light pink hair."}, {"type": "paragraph", "text": "When she was a child, her hair was shorter, yet she had the braided ponytail. She wore a light blue hooded coat. However, the manga portrayed her coat as dark-colored."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Rebecca is a calm and proud warrior who harbors a deep resentment towards Donquixote Doflamingo and wishes to obtain the Mera Mera no Mi to hunt him down and kill him. Furthermore, even though she pretends to shrug off others mocking her about Spartan, she is actually really bothered by it to the point of biting her bottom lip.She appears to have some knowledge of the Colosseum's history and was kind enough to enlighten Lucy upon noticing his interest in the giant statue of Kyros. She is very respectful of others as she tried to get Ricky to heal up after his fight, thanked Luffy for taking down Spartan, and later paid for the food he takes."}, {"type": "paragraph", "text": "Although a brave warrior, she can be extremely emotional at times as shown when she did shed some tears as she saw Thunder Soldier. She also expressed other forms of weakness such as the biting of her bottom lip when she was mocked by other gladiators. She dislikes expressing weakness to others as she claims she doesn't get hungry while remembering the time she told her mom she was during her childhood. In order to achieve her goal of protecting those dear to her, she was willing to resort to underhanded tactics, such as the attempted assassination of Luffy, although ultimately failing as a result of a lack in killing intent or immoral nature. After her failed assassination attempt, she was prepared to face retaliation, showing that she is not a coward. Rebecca is extremely kind, having been taught by her mother not to hurt people. As such, she strictly fights in a way that avoids injuring her opponents directly during the time when she was a convicted gladiator despite the violent and brutal matches of the Corrida Colosseum. Kyros proudly praised Rebecca for inheriting Scarlett's kindness during his battle with Diamante."}, {"type": "paragraph", "text": "She is sociable and can be quick to engage in friendly conversations especially with those who are acquainted with Luffy."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Kyros", "level": 4, "content": [{"type": "paragraph", "text": "Kyros is Rebecca's father who was turned into a toy. Ever since her mother Scarlett died when she was a child, Thunder Soldier watched over and protected her as his own. Although Rebecca initially said she hated Thunder Soldier for failing to protect her mother, she eventually came to love him since he raised her for the past 10 years and also taught her how to fight. She wanted to win the Mera Mera no Mi not only to defeat Doflamingo but also fulfill her wish of living together with Thunder Soldier. The soldier gave her some words of confidence to help her try and get through the tournament."}, {"type": "paragraph", "text": "Despite losing her memory of her father after he was transformed into a toy, she is shown to possesses awareness of his history as a gladiator, as she was able to tell Luffy about it when he asked her about the statue of Kyros. However she herself was unaware his relationship to her and her mother due to the effects of the Hobi Hobi no Mi. When Sugar fell unconscious, Rebecca finally regains her memory of her father. After contacting Luffy through a Den Den Mushi, she is informed that Thunder Soldier was her father the whole time."}, {"type": "paragraph", "text": "Upon their reunion, Kyros saved Rebecca from being killed by Diamante as Rebecca broke into tears of joy at seeing her father again as the latter told her she no longer needed to fight as he will do that for her. She was also worried for him after he was shot in the leg by Diamante and challenged the latter for his actions. However, Kyros stopped her, not wanting her to sully her hands after carrying on her mother's legacy."}, {"type": "paragraph", "text": "After Doflamingo's downfall, Kyros lied about her real father being a faraway prince, which was meant to stave off the stigma of having Kyros' criminal record affecting her. Rebecca, however, refused to accept this choice, and caught up with her father when he tried to leave Dressrosa. She insisted that he is her true father, looking past all of his past crimes and happily embraced him while asking if they can live together. She unhesitatingly abdicated her royal status to be with him after he asked if she really wanted him as her father. When the Straw Hats left Dressrosa, she held her father's hand and teased him after he cried out of joy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Kyros_and_Rebecca_Sit_Before_Scarlett%27s_Grave.png/revision/latest/scale-to-width-down/180?cb=20161221100608", "caption": "Rebecca and Kyros"}]}, {"title": "Scarlett", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca had a loving relationship with her mother, Scarlett. They lived happily together before the usurpation of the Riku Family by Donquixote Doflamingo. Trying to protect her daughter, Scarlett took her away from the violence that went on in Dressrosa, when Doflamingo took over. After she died trying to get food for her, Rebecca grieved over her death. Rebecca's fighting style reflects on respecting her mother's wishes to not harm anyone."}], "images": []}, {"title": "Viola", "level": 4, "content": [{"type": "paragraph", "text": "Viola is the daughter of Riku Doldo III, making her Rebecca's aunt. Rebecca seems to have much affection for her as she warmly embraced her when reunited, which the latter returned."}, {"type": "paragraph", "text": "When Doflamingo manipulated Rebecca to kill Viola, the latter assured her crying niece that nothing was her fault and that she would bear no grudge towards her which was another sign of her love for her. After Doflamingo's downfall, Rebecca requested Viola to take the position as the next princess of Dressrosa in her place, something Viola understands and accepts as it is similar to the request of Rebecca's mother."}], "images": []}, {"title": "Riku Doldo III", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca is the granddaughter of Riku Doldo III, who was believed to have tried to pillage his own people, causing her to be despised by everyone for her lineage. He does care about Rebecca as he was ashamed of himself for not being able to protect her. Rebecca cares for him as well as she defended him from Pica's insults and worried for him when Pica tried to kill him."}, {"type": "paragraph", "text": "After Doflamingo's downfall, Riku requested Rebecca to become the next princess of Dressrosa, but she ultimately refused in order to be with her father, something Riku found agreeable, seeing her similar to Scarlett."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca gained a little respect for Luffy upon seeing him defeat Spartan and gladly shared the story of Kyros with him when he took an interest in his statue. She was also happy to hear that he was in Block C, saying that it would be nice if they both survived the first round of the tournament, indicating she saw him as a worthy opponent. Her respect grew when she saw him tame Fighting Bull and was both impressed and humored at the sight. She was briefly worried when she thought Luffy was down and was quickly amazed when he knocked out Hajrudin with a single punch."}, {"type": "paragraph", "text": "Despite her respect for Luffy, she reluctantly attempted to kill him after he won his group's battle royale to better her chances of getting the Mera Mera no Mi. After her attempt failed, she is thankful to him for not retaliating. She tearfully opens up to him and explains her reasons for wanting the Devil Fruit. Luffy considers her a nice person and was very angry at the audience for booing and jeering at her."}, {"type": "paragraph", "text": "Even after learning Luffy's real name several times, she still refers to him as \"Lucy\". She was overjoyed to see Luffy again when he came to her by a window. Luffy understands her feelings, so he asked her if she is okay with being separated from her father. When she said no, Luffy took her to her father. She is extremely grateful to him for everything he has done for her and was relieved when Luffy made it out of the country safely and hopes to see him again."}, {"type": "paragraph", "text": "As news of Luffy's actions in Big Mom's territory spread across the world, Rebecca was proud of his progress."}], "images": []}, {"title": "Convict Gladiators", "level": 4, "content": [{"type": "paragraph", "text": "Prior to the Straw Hats' arrival on Dressrosa, the convict gladiators were the few, if not only, people who respected Rebecca as they did not share the citizens' view on her and they agreed with Luffy that Rebecca has nothing to do with what her grandfather supposedly did. They were very glad when Rebecca won her group's battle royale."}], "images": []}, {"title": "Acilia", "level": 4, "content": [{"type": "paragraph", "text": "Like the convict gladiators, Acilia did not share the citizens' hatred of Rebecca due to her bloodline. She allied with Rebecca during Block D and assisted her in reaching the finals."}], "images": []}, {"title": "Sabo", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca seemed to be curious about who he was after he replaced the original \"Lucy\" during the finals of the tournament. Despite this, she was also amazed by his strength due to the second \"Lucy\" destroying Jesus Burgess' armor and demolishing the Colosseum after eating the Mera Mera no Mi. He later reveals his true identity as Sabo, the Chief of Staff of the Revolutionary Army and the sworn brother of the first \"Lucy\"."}, {"type": "paragraph", "text": "Sabo seemed to sympathize with Rebecca after seeing Doflamingo's actions at Dressrosa. He even ordered Bartolomeo to protect Rebecca from Diamante and saved her after he destroyed the arena."}], "images": []}, {"title": "Mansherry", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca seemed to develop a friendship with Mansherry as they are seen together after Doflamingo's defeat."}], "images": []}, {"title": "Tank Lepanto", "level": 4, "content": [{"type": "paragraph", "text": "Due to his loyalty to her family and his efforts to protect her and the others from greedy pirates, Tank Lepanto was an ally to Rebecca."}], "images": []}, {"title": "Friends of the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "At Mary Geoise, Rebecca was quick to bond with Vivi, Shirahoshi, and Dalton due to having a mutual friend that they are indebted to. When a World Noble tried to enslave Shirahoshi, Rebecca was outraged and tried to defend the Mermaid Princess."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca deeply hates Doflamingo because of his evil rule and that he framed her grandfather and condemned her to eternal life in the Colosseum as a \"convict gladiator\". She wanted to win the Mera Mera no Mi in order to defeat him, so she could protect Thunder Soldier."}, {"type": "paragraph", "text": "When she discovered Viola confronting him, Rebecca was horrified as he wounded her aunt before he manipulated Rebecca to kill her and took joy in their sadness and unwillingness, but they were saved by the combined efforts of Luffy and Law. Rebecca later watched Doflamingo's defeat with tears of joy."}], "images": []}, {"title": "Diamante", "level": 4, "content": [{"type": "paragraph", "text": "Diamante is the man who killed Rebecca's mother, Scarlett, something he brought up during their battle to mock her and break her down psychologically. Because Rebecca lost her memories of her father at the time, she thought she was condemned to an ill-fated life as an orphan due to Diamante, and cried heavily to the point of being unable to fight on. Even after regaining memories of her father, Rebecca remains afraid of Diamante, as shown when Rebecca trembled once they meet again on Flowers Field. However, after Diamante succeeded in injuring her father, Kyros, Rebecca's fear turned to rage as she demanded him to face her and called him a coward for using unethical tactics."}], "images": []}, {"title": "Spartan", "level": 4, "content": [{"type": "paragraph", "text": "Some of the combatants from Corrida Colosseum mentioned that Rebecca had been bullied by Spartan in the past for a long time. She showed that she was still bothered by it when she bit her tongue and thanked Luffy for bringing him down."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Cavendish", "level": 4, "content": [{"type": "paragraph", "text": "Cavendish, along with everyone else in Block D, were all competitors for the Mera Mera no Mi. Despite this, Cavendish stood up for her when everyone else booed at her, causing them to cheer him on instead. Rebecca thanked him for this, but he reminded her that they were still enemies. Unlike a lot of women who fainted at the sight of his handsomeness, she regarded Cavendish without any hint of attraction."}], "images": []}, {"title": "Dressrosa Citizens", "level": 4, "content": [{"type": "paragraph", "text": "Due to being the granddaughter of the previous king of Dressrosa, Rebecca was despised by nearly every citizen of the country. The extent of this hate was displayed during a bombardment of horrific insults from the audience during the tournament at the Corrida Colosseum. To this end, the people of Dressrosa firmly believed that the \"dirty blood\" that flows through Rebecca's veins was more than enough cause to warrant her death. They did stop when Cavendish stood up for her. However, they continued throwing insults at her throughout the battle royale. When Rebecca was declared the winner of Block D, the citizens were utterly furious."}, {"type": "paragraph", "text": "After the truth of how Doflamingo conquered the kingdom is revealed, the citizens came to understand how the Riku family was framed, and their mistake for hating Rebecca for it. Regardless, they attacked the Riku family per Doflamingo's Birdcage bounty-hunting game, some for the bounty on her head while others wanted to stop the carnage brought upon by Doflamingo's puppetry. After Doflamingo's defeat, all the enmity they had towards Rebecca has totally ceased and she is now accepted by them."}, {"type": "paragraph", "text": "The citizens showed their fondness for Rebecca as they were looking forward to her being their princess. They were later shocked when they heard Luffy had \"kidnapped\" her, showing their deep concern for her well-being. However, upon Issho hearing one of the citizens saying that Rebecca is seen going to her father, Kyros, it shows that the citizens were well aware of Scarlett faking her death to marry Kyros and Rebecca being their daughter, and they were grateful to Luffy for bringing the two together. Their respect was so great, they went out of their way to prevent Issho from attacking in order to let Luffy, his crew, and his allies escaped."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As she wanted to eat the Mera Mera no Mi, it indicates that she is not a Devil Fruit user. She is known throughout the colosseum as the \"Undefeated Woman\", implying that she has never lost a fight yet, but at the same time, she was shown to be bullied by other gladiators such as Spartan."}, {"type": "paragraph", "text": "Since she was a child, Rebecca has been trained to fight by Kyros (as Thunder Soldier) who was the best fighter of Dressrosa colosseum, although he was limited by his body as a one-legged toy."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Due to the combat training regimen under Thunder Soldier since childhood, Rebecca is incredibly agile. Rebecca's greatest ability lie in her tremendous speed and ability to rapidly avoid attacks. As a testament of her power, while the other gladiator convicts were badly injured to the point of missing arms and legs, Rebecca doesn't have a scratch on her. She seems to be almost unbeatable in speed, as the gladiators were shocked when Luffy escaped from her slash. Being immensely evasive, Rebecca can avoid assaults from multiple enemies at once. Her most impressive display was dodging, albeit barely blocking, Hakuba's attack that hit 20 people in an instant. Rebecca also has some level of strength, as the force she applies in her swordmanship allowed her to parry off or defend against powerful strikes from gladiators, including enemies who are physically larger than herself. Rebecca was also shown to use proficient kicks or grappling throws to push enemies out of the ring in conjunction with her sword."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Rebecca is shown to be skilled with a sword. She uses a style of swordsmanship dubbed the \"Backwater Sword Dance\" (背水の剣舞, Haisui no Kenbu), or the Back-to-the-Water Dance in English FUNimation subs, which is completely defensive in nature. It emphasizes on using her sword to exploit her opponents' strength and momentum rather than using personal brute force to defeat them, reminiscent of real world aikido. She wins her battles in the Colosseum by having her opponents fall out of the ring without directly injuring them. This is how she earned the title of \"Undefeated Woman\". Her style of combat is a reflection of her personality of not wanting to hurt others, and has allowed her to survive and defeat all her opponents in the colosseum without directly harming anyone. Suiting her defensive nature, Rebecca can expertly use her sword to defend and parry off attacks from physically strong and powerful enemies. Her fighting style however proves to be ineffective against stronger and more experienced combatants, and she was rendered helpless when facing an opponent as strong as Diamante."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Rebecca wields a medieval style long sword, which from the ground up almost reaches her shoulders. However, presumably in an effort not to directly harm or kill anyone, the blade is blunt. She also has a rounded shield, which she carries on her left arm. As a gladiator of Corrida Colosseum, she has received training in wielding both sword and shield during combat. However, she discarded the shield before the D block battle royale."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Rebecca has been shown to be extremely capable at avoiding attacks, and Luffy worked out that she must be using Kenbunshoku Haki. Having been extensively trained by Kyros to hone her inner instinct to perfection, she appears to possess a great degree of mastery over her Kenbunshoku Haki, combined with her speed and reflexes has allowed her to emerge unscathed in all her earlier colosseum battles, thus earning her the title as the 'Undefeated Woman'. More significantly, she was able to see through Hakuba's movements despite his extremely blinding speed, and managed to barely survive his attack that took out everyone else."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Rebecca was born to Kyros and Scarlett, Riku Doldo III's eldest daughter. She and her family once lived a happy life in a small cottage just outside of the kingdom. Rebecca used to pick flowers together with her mother and then sell them in town. Her grandfather and aunt, Viola, would come visit every once in a while. During the Donquixote Pirates' takeover of Dressrosa, they saw the palace burning. Before going to the palace, Kyros told Rebecca and Scarlett to wait for him at the Red Flower Fields. Rebecca and her mother were later attacked by a group of armed men led by Diamante. They managed to escape thanks to the help of her father, who has been transformed into a toy known as Thunder Soldier. After two days on the run, Rebecca grew hungry and asked her mother for food. Scarlett decided to gather food for the both of them, leaving Rebecca behind, though promising to return shortly."}, {"type": "paragraph", "text": "Sometime later, Rebecca heard movement in the bushes, and was shocked to discover a battered and bruised Thunder Soldier, with a bloodied Scarlett in his arms. Thunder Soldier explained how Scarlett was attacked, and, although he tried to protect her, she was ultimately killed. He then gave Rebecca some food, though she instead began to cry. Thunder Soldier immediately clamped his hand on her mouth to keep her quiet as Doflamingo's troops storm by, looking for her. Later on, Thunder Soldier told Rebecca that Doflamingo became king and that her mother was an important person, as her daughter was also just as important, which is why Doflamingo was after her. He then told her that since he failed to protect her mother, he would protect her, even at the cost of his own life. Rebecca was not concerned with herself though, fixated on the death of her mother. She began to sob for her mother as Thunder Soldier attempted to cheer her up, all while trying to run back to her old home. Thunder Soldier, however, realized that her home would have been occupied by Doflamingo's troops by now."}, {"type": "paragraph", "text": "Thunder Soldier then became her guardian, protecting her and working various jobs to support her. The Thunder Soldier then tried to take care of Rebecca who resisted at first, but over time came to accept him. He then found a place for Rebecca to live and told her that although he could not live with her, he would always be there beside her. To prove his statement, he would always drop one flower petal every morning from the window into her bedroom. Over the years, the two were very happy together. One day, kidnappers broke into Rebecca's house, forcing the Thunder Soldier to attack her kidnappers in order to save her. In the process, Thunder Soldier became a wanted man. The two then found another place to live and Rebecca promised to one day live in the same house as him. Deciding that Rebecca should learn how to fight so she could protect herself from danger, the toy began to teach her how to defend herself. Rebecca was hesitant to train, not wanting to hurt anyone. As Thunder Soldier taught her how to use a sword, Rebecca would complain about the toy soldier's methods. On one occasion, Rebecca wanted to stop training, believing that she could always rely on Thunder Soldier to protect her. However, Rebecca relented when Thunder Soldier revealed his own limitations."}, {"type": "paragraph", "text": "Sometime later, Rebecca was captured by the Donquixote Pirates and forced to become a gladiator at the Corrida Colosseum, where she earned the title of \"undefeated woman\". After Doflamingo falsified the news of his resignation, Rebecca had a conversation with Thunder Soldier. The toy soldier tried to dissuade her from entering the tournament for the Mera Mera no Mi. Rebecca was insistent on participating, saying that the convict gladiators were starting to lose hope and that Kyros was nothing more than a myth designed to bring hope for those who have been condemned. In anguish, Rebecca told Thunder Soldier that he had no chance against Doflamingo because he was just a one-legged toy. After her outburst, she realized her words as Thunder Soldier left while Rebecca cried out in apology and begging him not to go."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Kyros%2C_Rebecca_and_Scarlett.png/revision/latest/scale-to-width-down/180?cb=20150220030514", "caption": "Rebecca playing with her father as her mother watches."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca entered the tournament at Corrida Colosseum with eyes set on the Mera Mera no Mi, and was placed in Block D. While in the waiting area, she witnessed Luffy, under the alias of Lucy, defeat Spartan, who she then met with to express her gratitude. Upon noticing his admiration for the statue of Kyros, she told him about his legendary status. After telling Luffy about the statue, two other fighters began teasing her about how she must be happy that Spartan was eliminated. When Luffy asked what they meant, Rebecca told him not to mind them, though she was noticeably bothered by what they said. After this, she declared that she would win the Mera Mera no Mi and defeat Donquixote Doflamingo. She then asked Luffy what block he was assigned to and was happy to learn that they were assigned to different blocks. As she walked off, she told Luffy that it would be nice if they both survived the first round."}, {"type": "paragraph", "text": "Before Block C started, she was seen looking outside the Colosseum through a window. She then saw the Thunder Soldier running by with Franky and was shocked to see him. She called out to him and tearfully expressed her determination to win the tournament as well as her wish to live together with him after she wins. The soldier, unable to cry but wanting to, answered that crying warriors cannot win tournaments. As he leaves, Rebecca collapses in tears. Inside the colosseum, Rebecca spoke to an injured Ricky, who refused treatment despite her insistence. She later went to the observation deck to watch the Block C battle royale. After Lucy gained popularity by taming the Fighting Bull, Rebecca commented that Lucy is an interesting person. She was amazed when she saw Lucy defeat Hajrudin with a punch. She was also taken aback at how Lucy and Chinjao defeated the remaining fighters with ease, before proceeding to clash with their own Haki-imbued fists."}, {"type": "paragraph", "text": "After Luffy won Block C, Rebecca saved him as he was running from Cavendish and Chinjao. Rebecca bought him some food and sat with to him in the Gladiator's quarters. Some gladiators behind prison bars restrained Luffy and after some hesitation, she attempted to kill him with her sword. Luffy dodged the attack, however, and pinned her down. Rebecca questions him, asking why he doesn't retaliate. Luffy replied that he won't do anything to someone who bought him food. Rebecca then proceeds to tell him about the convict gladiators and how they were imprisoned in the colosseum for opposing Doflamingo. She says that she wants to win the Mera Mera no Mi in order to be able to kill Doflamingo as well as protect herself, and no longer have to rely on the Thunder Soldier, who was currently planning an attack against Doflamingo."}, {"type": "paragraph", "text": "Rebecca then explained to Luffy about how the toys are no different from humans, and how they are capable of all the things humans are capable of. She also explained how her mother died ten years ago, and how the Thunder Soldier took over as her guardian after her mother's death, which is why he is so important to her. The conversation was interrupted by Gatz, who announced that the ring had been repaired and Block D was about to commence. Rebecca proceeded to walk towards the arena and dropped her shield before entering. As she entered the arena, she silently prayed for Thunder Soldier's safety, and promised she will not lose. Once Rebecca entered the arena, Gatz announced her appearance and the crowd booed and jeered at her, showing their hatred of her ties to the previous Dressrosa regime."}, {"type": "paragraph", "text": "The spectators continue with their booing and jeering until Cavendish appears in the arena on his horse and gives a speech to the audience, saying how shameful they are for wanting someone dead while not willing to risk their own lives. Once all the jeering stops, Rebecca thanks Cavendish for standing up for her. Cavendish sympathizes with Rebecca but reminds her that they are enemies. Once Block D commences, Rebecca begins to fight, silently telling Thunder Soldier to watch her."}, {"type": "paragraph", "text": "During the battle royale, Rebecca stood at the edge of the ring. She defeated several opponents not by injuring them but by having them fall out of the ring. She was soon confronted by Rolling Logan. Rather than fighting him head on, she evaded his attacks and let him take out the other competitors. Rebecca was later allied with Acilia, who told Rebecca that she must reach the finals. Sometime later, Rebecca fought against Suleiman. He asked her how could she cope to live in a country where she was despised so much. Rebecca declared that it does not matter how much she is hated as long she can live with Thunder Soldier."}, {"type": "paragraph", "text": "As Rebecca continued to dodge Suleiman's attacks, their fight was interrupted when Cavendish stood between them. She saw Cavendish suddenly fell asleep and when several gladiators took the opportunity to attack him, his alter-ego, Hakuba, took control and proceeded to strike down all the remaining fighters in Block D. Despite Hakuba's blinding speed, Rebecca managed to see through his movement and barely avoided his strike, which hit her helmet. She still fell down and she was seemingly knocked unconscious. However, much to the entire crowd's dismay and surprise, Rebecca was the only one to get up. This meant she won Block D, and was able to progress to the finals."}, {"type": "paragraph", "text": "After leaving the arena, she waved to Lucy to greet him but then noticed that he was a different person. She looked puzzled as the man briefly spoke to her and walked by. When the finals started, Rebecca entered the arena alongside Lucy, Bartolomeo, Jesus Burgess, and Diamante. She continued to wonder who Lucy was. They were suddenly interrupted when some of the disqualified participants from Block D charged in, refusing to accept that Rebecca was the winner. Rebecca then witnessed Diamante repelling them using the power of his Hira Hira no Mi. After Diamante explained the rules of this round, the five-person battle royale commenced. When the fighting fish holding the Mera Mera no Mi came charging at her, Rebecca attempted to cut the chains but failed. When Burgess prepared to launch an attack against Lucy, Rebecca positioned herself behind Bartolomeo. She seemed surprised when Lucy shattered Burgess's armor."}, {"type": "paragraph", "text": "Rebecca later attacked Diamante, but her strike was ineffective because she was using a dull blade. Diamante retaliated by striking her with a club while saying that she will die if she is not willing to kill. He then mocked her about her mother's death. After Diamante revealed that he was the one who killed her, Rebecca broke down in tears. When Sugar's curse broke, all the toys transformed back into their original forms and all the lost memories had been restored. Rebecca tearfully exclaimed that she remembered her father."}, {"type": "paragraph", "text": "When Lucy demolished the arena with his bare hands, Rebecca held onto Bartolomeo as the arena collapsed into the underground. After grabbing the Mera Mera no Mi and acquired its power, Lucy grabbed Rebecca, jumped into the air and used Hiken to completely destroy the arena and exposed the underground. After arriving at the underground, Rebecca saw that the Lucy who participated in the finals was Sabo of the Revolutionary Army. Sabo informed her that the previous Lucy was his brother Luffy and that the Revolutionary Army's objective in Dressrosa was to stop a weapons trade."}, {"type": "paragraph", "text": "Doflamingo trapped Dressrosa in his \"bird cage\" and forced everyone into a survival game which gives them a choice to either kill him or a list of people. The list includes Rebecca, Sabo, and the Straw Hats. When Usopp's new followers became their enemies, Rebecca, Robin, Usopp, Bartolomeo, Sabo, Koala, Hack, and the Tontatta dwarves fled to the surface. While fleeing, Rebecca contacted Luffy through Den Den Mushi. She started crying when she was informed that the toy soldier was her father Kyros. Luffy told her not to cry and to stay close to his friends while assuring her that he will defeat Doflamingo."}, {"type": "paragraph", "text": "Rebecca's group (except for Sabo and Koala) later reached the colosseum stands. They eventually arrived at the top of the old King's Plateau where they met up with Riku Doldo III, Viola, and Tank Lepanto. After reuniting with her aunt and grandfather, Rebecca volunteered to deliver the key to Law's seastone handcuffs to Luffy. As Robin contacted Luffy through Den Den Mushi, Rebecca, Robin, Bartolomeo, and Leo planned to meet Luffy at the sunflower garden on the fourth level of the new King's Plateau."}, {"type": "paragraph", "text": "Leo then planned to travel to the new King's Plateau with the assistance of the beetles of the Tontatta Airlines Yellow Cab. Rebecca, Robin, and Bartolomeo were uncertain of the idea since the beetles seem too small to carry a person. Leo then explained that the beetles are the Tontatta Airlines \"jumping\" service and made them jump down from the old King's Plateau. To their amazement, the beetles can decelerate their fall and they learned that they could use the beetles to jump from rooftop to rooftop. Leo reminded them to aim for the fourth level and warned them to watch out for attacks from below. They later reached the giant Pica statue while Zoro was battling Pica. After Pica noticed Rebecca, he prepared to throw a colossal punch at the trio with the statue. When Zoro stopped Pica with a powerful sword slash, Rebecca was struck with amazement."}, {"type": "paragraph", "text": "Rebecca, Robin, and Bartolomeo then passed the giant stone statue and continued onwards to the fourth level. While flying over the second level, the group was attacked by Gladius. Rebecca, Leo, and Kabu were subsequently separated from Robin and Bartolomeo. Rebecca and the two dwarves later reached the fourth level. After Leo and Kabu left to find Mansherry, Rebecca found herself confronted by Diamante. Not wanting to fight Diamante, Rebecca fled through the flower field. Diamante taunted her as he pursued her. He caught up and knocked down Rebecca with a sword slash. As he prepared to kill Rebecca in the same manner as he killed her mother, Kyros arrived and attacked him. Rebecca then burst into tears, having been reunited with her father. Luffy and Law then arrived and Rebecca quickly gave them the key to Law's handcuffs."}, {"type": "paragraph", "text": "After Law removed his handcuffs, he and Luffy decided to go face Doflamingo while Kyros battled Diamante. Luffy happily told Rebecca that he was glad that she could see her father again. As he was leaving, Rebecca asked Luffy if he would really defeat Doflamingo while still calling him \"Lucy\". Luffy answered that his name is not Lucy and told her his real name before entering the palace with Law. Rebecca then watched her father's battle with Diamante as the latter used \"Army Bandera\" to make the ground ripple. Diamante later aimed an attack at Rebecca, but Kyros managed to deflect it. Rebecca decided to fight too, but her father promised her that he will defeat Diamante so she will not have to use a sword again."}, {"type": "paragraph", "text": "While Kyros struggled to keep his balance due to the Army Bandera, Diamante tried to attack Rebecca again, but this time, Robin stopped his attack. Robin then promised to protect Rebecca so Kyros could focus on his battle with Diamante. When Diamante caused spiky iron balls to rain down from the sky, Robin shielded Rebecca with Mil Fleur: Flower Umbrella. As Kyros was struck by the balls, Diamante taunted Rebecca to come for him, enraging her. However, Kyros managed to stand back up, telling Rebecca that he would never allow her to get blood on her hands as he struck down Diamante."}, {"type": "paragraph", "text": "Once Diamante lost consciousness after hitting his head on Scarlett's grave, Rebecca ran to her father's side and they sat in front of Scarlett's grave together. Their moment together was cut short when Pica appeared. After asking Kyros about Riku Doldo III, Pica left without harming Rebecca and Kyros. They then watched Pica head towards the Old King's Plateau. After Pica's defeat by Zoro, Rebecca soon witnessed the explosion on the palace roof. After Luffy threw Law to Rebecca's group, she stood around Law and told the others that they needed to leave the Flower Field. She then went down Bartolomeo's staircase. Rebecca, Kyros, and Robin later join up with Bartolomeo and the colosseum gladiators as Riku Doldo III encouraged the citizens to not give in to despair. As many people work together to slow down the Birdcage, Rebecca rushed to find Doflamingo in case the Birdcage cannot be stopped. To her horror, she found Viola confronting Doflamingo."}, {"type": "paragraph", "text": "Rebecca watched helplessly as Doflamingo gravely injured Viola. He then took control of Rebecca and prepared to have her strike down her defenseless aunt. Once he made Rebecca attack Viola, Law saved the latter by switching her position with Luffy, who then shattered Rebecca's sword with his head. When Doflamingo resumed his onslaught, Law teleported Rebecca away before she could be injured by Doflamingo's attacks. Rebecca then watched Luffy's battle from afar. Rebecca then witnessed Doflamingo's defeat and the collapse of the Birdcage. Law then saved a falling Luffy by instantly teleporting him to the ground. Rebecca then sat next to Luffy, crying profusely. Later that night after the aftermath, Rebecca was at the palace unable to find Luffy and his crew. She then spoke to her grandfather, who told her that she will become the princess of Dressrosa once he becomes king again."}, {"type": "paragraph", "text": "Three days after Doflamingo's downfall, Rebecca was being dressed for her grandfather's return to the throne. Viola informed her that Luffy and his allies were being pursued by the Marines. Rebecca was dismayed that she has not expressed her gratitude to Luffy yet. Luffy later arrived at the royal palace and called out to Rebecca. Once Luffy found Rebecca, he asked her if she was okay with Kyros leaving her. Rebecca answered \"no\" and Luffy offered to take her to him. Rebecca then asked Viola a favor, which is to take her place as the next in line for the throne. Luffy then took Rebecca all the way to the hill where Kyros' house is located. After Luffy dropped her off there, Rebecca met with her father right after he left his house. Rebecca told him that she does not care about his past. As they embraced, Rebecca asked him to stay with her."}, {"type": "paragraph", "text": "When she witnessed Issho preparing to strike Luffy and his allies with all the rubble from Dressrosa, Rebecca worried for Luffy. After Luffy and his allies escaped, Rebecca and Kyros held hands just as when Rebecca was a child and when Kyros was Thunder Soldier. As the dwarves and the citizens started living together in coexistence, Rebecca was seen shopping with Mansherry."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Luffy_Pins_Down_Rebecca.png/revision/latest/scale-to-width-down/210?cb=20160121041933", "caption": "Luffy pins down Rebecca."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Rebecca_Facing_Rolling_Logan.png/revision/latest/scale-to-width-down/230?cb=20141206202709", "caption": "Rebecca faces off against Rolling Logan."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Diamante_vs._Rebecca.png/revision/latest/scale-to-width-down/180?cb=20141206181013", "caption": "Rebecca tries to attack Diamante."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ea/Rebecca_Confronts_Diamante.png/revision/latest/scale-to-width-down/210?cb=20150531141753", "caption": "Rebecca confronted by Diamante."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/29/Moth_Orchid.png/revision/latest/scale-to-width-down/210?cb=20160417100416", "caption": "Robin saves Rebecca from Diamante's attack."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Luffy_Intercepts_Rebecca%27s_Attack.png/revision/latest/scale-to-width-down/210?cb=20181208175800", "caption": "Luffy intercepts Rebecca's unwilling attack."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Kyros_and_Rebecca.png/revision/latest/scale-to-width-down/200?cb=20160522082751", "caption": "Kyros and Rebecca decide to live together."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Viola asked Rebecca to accompany the Riku Family as a lady-in-waiting."}], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "After Leo and his band decided to become pirates, Rebecca and Viola helped make new clothes for them."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Rebecca quickly showed the newspaper to her grandfather. After Koby thwarted a pirate attack on the Dressrosa-Prodence Kingdom convoy, Rebecca came bearing news of Luffy. After Koby read the news of Luffy and tried to mask his admiration of Luffy, Rebecca asked him if they could talk about it in secret."}, {"type": "paragraph", "text": "The Dressrosa participants later arrived at Mary Geoise. At the castle, Rebecca quickly befriended Vivi and later Shirahoshi due to their relationship with Luffy. Rebecca was then reacquainted with Sai before encountering Wapol. After Dalton drove Wapol away, Rebecca then engaged in a friendly conversation with him concerning Luffy."}, {"type": "paragraph", "text": "Later, the World Noble Charlos tried to take Shirahoshi by force. Rebecca was outraged at the noble's actions and she had to be held back by Sai lest she anger the noble and suffer the consequences in doing so."}, {"type": "paragraph", "text": "As Mansherry healed Shirahoshi's bruises after Mjosgard stopped Charlos, Rebecca commented on how the largest princess in the world and smallest princess in the world were meeting face to face."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Shirahoshi%2C_%E2%80%8B%E2%80%8BVivi_and_Rebecca_Become_Friends.png/revision/latest/scale-to-width-down/200?cb=20190925183946", "caption": "Rebecca, Vivi, and Shirahoshi become friends."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Rebecca vs. Monkey D. Luffy", "elements": []}, {"text": "Rebecca vs. Corrida Colosseum Block D gladiators (except Acilia)", "elements": [{"text": "Rebecca vs. Rolling Logan", "elements": []}, {"text": "Rebecca vs. Suleiman", "elements": []}]}, {"text": "Corrida Colosseum Finale", "elements": [{"text": "Rebecca vs. Boss Class Fighting Fish", "elements": []}, {"text": "Rebecca vs. Diamante", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Rebecca and Acilia vs Meadows", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "As of the 5th Japanese Fan Poll, Rebecca is the 29th most popular character, making her the sixth most popular female of the series behind Nefertari Vivi, Perona, Nico Robin, Boa Hancock, and Nami.", "elements": []}, {"text": "Rebecca is similar to Nefertari Vivi as they are both princesses who became acquainted with Luffy and his crew, who in turn saved their country from a Shichibukai.", "elements": []}, {"text": "Rebecca is also similar to Shirahoshi, as:", "elements": [{"text": "Both are sixteen year-old, pink-haired princesses.", "elements": []}, {"text": "Both learned pacifism from their mothers who were shot ten years ago.", "elements": []}, {"text": "Both offered food to Luffy when getting acquainted with him.", "elements": []}, {"text": "Luffy was accused of \"kidnapping\" both when Luffy was only helping them leave their palaces on their request.", "elements": []}]}, {"text": "Rebecca's relationship with the One-legged Toy Soldier is similar to The Nutcracker except she and the Toy Soldier are actually father and daughter.", "elements": []}, {"text": "Before settling on her final name, Oda had nearly thirty other name options considered for Rebecca. Among these are Noir, Russian, Girasole, Violet, Akiria, Isbell, Fabula, Laura, Helianthus, Seneca, Juvenalis, Iris, Vineyard, Lambda, Amazonia, and Shalom. Some of those options were considered as they mean \"sunflower\" in other languages, while others came to be used for other characters instead.", "elements": []}]}], "images": []}]}