{"sections": [{"title": "Kyros", "level": 1, "content": [{"type": "paragraph", "text": "Kyros is a legendary gladiator, who fought at the Corrida Colosseum until 20 years ago. A great bronze statue of him is held at the Corrida Colosseum."}, {"type": "paragraph", "text": "When he was turned into a toy, everyone forgot his existence. After his transformation, he became a One-Legged Soldier (片足の兵隊, Kata-ashi no Heitai), known as \"Thunder Soldier of Rage\". He is the former commander of the Riku Royal Army (リク王軍, Riku Ō Gun). He is also the father of Rebecca, husband of Scarlett and the son-in-law of Riku Doldo III."}, {"type": "paragraph", "text": "He spent ten years as a toy before being freed by the success of his own Operation SOP. After helping bring down the Donquixote Pirates, Kyros currently lives with Rebecca."}, {"type": "paragraph", "text": "He is an ally of the Straw Hat Pirates during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kyros is a large muscular man, with long, flowing hair and a pointy beard that points upward. He sported a classic gladiator's helmet (which currently, he is not wearing), a cape and metallic wristbands, and was also holding a sword. He also possessed a scar on his forehead from his final fight as a gladiator with King Riku and later sacrificed his left leg to help King Riku before he was turned into a toy."}, {"type": "paragraph", "text": "As Thunder Soldier, he is a small toy soldier whose body resembles a dark-colored uniform with four buttons. He has a block-shaped head, square eyes with two blush marks painted underneath, a rectangular nose, a small angular mustache, and a hinged mouth. He also has lanky limbs and a wind-up key on his back. He wears a large round hat with the letters \"SOL\" printed on it. He has a small stub where his left leg used to be, and he wears a roller skate on his right foot which he has trouble balancing on when standing still. He also carries a small toy rifle."}, {"type": "paragraph", "text": "Due to the 10 years he spent as a toy, Kyros did not age physically, as his appearance upon reverting to his true form did not show any signs of aging. Therefore, he is biologically 10 years younger than he is chronologically supposed to be."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In his younger years, he was shown to be a brutal killer, capable of killing in cold blood and even attacking King Riku. However, he did so in revenge for a dear friend, and keeping himself alive. He actually felt guilty and remorseful about his past as a criminal and felt that he was too unclean and unworthy of many things (such as continuing to interact with Scarlett before their marriage or holding his daughter with his bare hands, the latter making his wife calling him weird), while feeling depressed that the world would remember him as a murderer."}, {"type": "paragraph", "text": "During his first appearance, he is very defiant of authority as seen when he was yelling at some police officers. He also appears to be proud to be a toy that brings happiness to people, and gets angry when someone says he is serious, although he knows there are times when he has to be and does so without complaint. Because Sugar failed to make a contract with him, Kyros was the only toy who could rebel against the Donquixote Family. As such, he took his duty as the lone toy who is able to rebel against Doflamingo very seriously, having worked diligently with the Dwarves since his time as a toy in order to save the toys and the Dwarves together."}, {"type": "paragraph", "text": "He is kind and helpful towards common people. While he appears to enjoy being a toy, he is saddened by the fact that he cannot shed tears or feel the warmth of a person's touch like people can. When he was raising Rebecca as the Thunder Soldier, he tried his best to make her happy and was not above playing dead, striking strange poses or even singing songs in an attempt to make her happy. In addition, he was shown to be very protective of Rebecca as seen when he protected her from kidnappers and wild dogs. On the other hand, he was potentially overprotective of her given that he often punched anyone who made her cry or tried to give her love letters."}, {"type": "paragraph", "text": "In battle, Kyros is a very brutal fighter, as after having returned to his human form, he immediately decapitated Doflamingo's duplicate in an instant and broke Buffalo's neck while mowing down anyone who stood in his way. He is also very determined to save those dear to him, as when Doflamingo prepared to kill King Riku, Kyros immediately freed himself from his Seastone shackles by cutting off his own left leg."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Kyros%27_Seriousness_as_Thunder_Soldier.png/revision/latest/scale-to-width-down/210?cb=20140226221410", "caption": "The unacceptably serious Thunder Soldier"}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Kyros%2C_Rebecca_and_Scarlett.png/revision/latest/scale-to-width-down/180?cb=20150220030514", "caption": "Kyros with his wife and daughter during happier times."}]}, {"title": "Rebecca", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca is Kyros' daughter. He always wore gloves when he touched her as he felt he would otherwise sully her because of his past and being branded as a criminal. Despite this quirk, they had a loving and happy relationship. However, because being transformed into a toy wipes out other people's memories of the transformed person, Rebecca neither knew nor remembered who he truly was until he turned back into a human."}, {"type": "paragraph", "text": "After Scarlett's death, Kyros watched over and protected Rebecca as the Thunder Soldier. Although Rebecca initially said she hated Soldier for failing to protect her mother, she eventually came to love him since he raised her for 10 years and also taught her how to fight."}, {"type": "paragraph", "text": "She wanted to win the Mera Mera no Mi, not only to defeat Doflamingo, but also fulfill her wish of living together with Soldier. He gave her some words of confidence to help her try and get through the tournament. He vows to do whatever he can to protect her, even if it costs him his life. Rebecca is just as determined to protect him. After Kyros turned back into his human form, Rebecca burst into tears of happiness as her memories of her father returned."}, {"type": "paragraph", "text": "Upon their reunion for the first time in 10 years, Kyros saved Rebecca from being killed by Diamante as Rebecca shed tears of joy seeing her father again while Kyros stated that she no longer needed to fight and he would do that for her. She was also worried for him after he was shot in the leg and wounded by Diamante's underhanded moves. When she was furious at Diamante for his actions, Kyros stopped her, not wanting her to sully her hands after carrying on her mother's legacy."}, {"type": "paragraph", "text": "When Doflamingo was defeated, Kyros spread a rumor about Rebecca being the daughter of a faraway prince as a means to spare her the trouble of being the child of a former criminal. However, Rebecca would not accept his excuses and when confronting him when he attempted to leave Dressrosa she stated no matter what he did in the past he was still her father before happily embracing him and asking him to live with her. When the Straw Hats left Dressrosa, she held his hand and teased him after he cried out of joy, though he denied it."}], "images": []}, {"title": "Scarlett", "level": 4, "content": [{"type": "paragraph", "text": "Scarlett is Kyros' late wife, whom he loved very much. In the past, she was initially very skeptical about his promotion to being captain of the guards and even wanted nothing to do with him. This changed when Kyros saved her from a kidnapping attempt by pirates and she fell in love with him. Despite her feelings, he was still reluctant to interact with her due to his past as a criminal. To avoid the possible scandal of a criminal getting together with a princess, the Riku family faked Scarlett's death so she could be with him. She had no problem leaving her royal life behind, content to live a modest one with Kyros and their daughter Rebecca."}, {"type": "paragraph", "text": "Kyros deeply regrets not being able to save her on the day she died. Not only did he grieved over his wife's death, but was also devastated by the fact that she passed away without any memory of him or that he could not feel the warmth of her dying body since he was turned into a toy (experiences that he considered to be a living hell). It was after her death that he devoted himself to protecting Rebecca and is willing to even sacrifice himself for her safety."}, {"type": "paragraph", "text": "Kyros showed that he does not like anyone mocking his wife's death as he attacked Diamante fiercely for bringing up killing her. Kyros avenged Scarlett by defeating Diamante in their battle."}], "images": []}, {"title": "Riku Doldo III", "level": 4, "content": [{"type": "paragraph", "text": "Even though Kyros was known as a ruthless killer, Doldo showed him mercy even after Kyros attacked him during their first meeting. Initially withdrawn, Kyros eventually opened up to him. He also respected King Riku to the extent that he let his guard down and received a head injury as a result. After battling Kyros in the arena as Ricky, Doldo encouraged Kyros to leave the Colosseum and start a new life."}, {"type": "paragraph", "text": "The two eventually became in-laws when Kyros married Doldo's eldest daughter, Scarlett. Doldo approved of this union, helping fake Scarlett's death so they could be together without scandal, and he would visit his family from time to time. Kyros' loyalty to Doldo is so great that he immediately accused Doflamingo of wrongdoing as he refused to believe that the peaceful King would ever attack his people even after witnesses stated otherwise. Kyros also sacrificed his own leg to save Doldo, but he was then turned into a toy and Doldo lost his memories of him. Years after Doldo's dethronement at the hands of Doflamingo, Kyros plotted against the Shichibukai and sought to restore Doldo's honor."}, {"type": "paragraph", "text": "Upon returning to his true form, Kyros and Doldo had a tearful reunion, with Doldo apologizing for not recognizing him ten years ago, while Kyros apologizing for making him wait so long. Kyros also planned to kill Doflamingo for Doldo's sake. When Pica asked Kyros what Doldo was to him, Kyros stated Doldo was his benefactor and sacrificing his leg was one of his ways to repay. Kyros also proclaimed once Doflamingo was defeated, Riku would reclaim his rightful place on the throne."}], "images": []}, {"title": "Viola", "level": 4, "content": [{"type": "paragraph", "text": "Viola is Kyros' sister-in-law through his marriage to her sister Scarlett. In the past, she did not share the distrust Scarlett once placed on him, as she was actually able to see his true nature thanks to her Devil Fruit ability."}, {"type": "paragraph", "text": "It is clear from the way he refers to her that he holds her in high regard. Even though she completely forgot about his true identity and their relationship because of his transformation into a toy, she reciprocates those feelings as Kyros (Thunder Soldier) and the dwarves raised and cherished her niece Rebecca in place of her sister."}, {"type": "paragraph", "text": "Upon Kyros returning to his human form, Viola broke into tears of joy as her memories for her brother-in-law returned."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Franky", "level": 4, "content": [{"type": "paragraph", "text": "The soldier has become acquainted with Franky since they share a common enemy in Doflamingo. Because the toy soldier knows about the factory that Franky was searching for, Franky agreed to travel through Dressrosa with him and help him with his plan to free the workers in the factory. After hearing about Doflamingo's atrocities, Franky was more than willing to help the soldier succeed in his rebellion, especially since Franky realized that it was his (and his crew's alliance) that gave false hope to Kyros' rebellion of Doflamingo's resignation from the Shichibukai, leading to their decision of a kamikaze attack."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Due to them both desiring to take down Doflamingo, Kyros immediately warmed up to Luffy and allied with him to save the kingdom. Furthermore, despite being a pirate, Kyros trusts Luffy upon their first meeting mentioning he himself is also an outlaw.  He refers to him as \"Luffyland\" and aided him in the quest to defeat Doflamingo. When Luffy defeated Doflamingo, Kyros thanked the Straw Hats for saving Dressrosa and gave them shelter before the marines tried to capture them."}, {"type": "paragraph", "text": "In turn, Luffy brought Kyros' daughter back to him, so they could live together."}], "images": []}, {"title": "Dwarves", "level": 4, "content": [{"type": "paragraph", "text": "Kyros is also allied with the dwarves in the fight to overthrow the Donquixote Pirates. Though his human identity has been forgotten almost entirely except by the statue, the dwarves believe him for who he truly was. Kyros has shown to respect and care greatly for the Dwarves, as he was hesitant to abandon them when fighting Gladius."}, {"type": "paragraph", "text": "After his return to human form, the dwarves were amazed to see Kyros as he gave them the order to tend to the wounded. When Doflamingo was defeated, Kyros congratulated them on successfully executing their mission and disbanded the army."}, {"type": "paragraph", "text": "In the aftermath, the dwarves built a new statue for Kyros to honor his status as a hero for the island."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Kyros has nothing but hatred against Donquixote Doflamingo, who not only took the throne by discrediting the Riku Royal Family, but also had a subordinate turn him and many other citizens into toys. Initially, Doflamingo wanted Kyros to serve him, having heard of his reputation but refused to spare anyone related to the Riku Family which included his wife and daughter."}, {"type": "paragraph", "text": "Even though Doflamingo was a powerful foe, Kyros remained determined to overthrow him and undo the tragedies that he created for Dressrosa. After the Shichibukai falsified the news of his resignation, Kyros and his fellow rebels decided to initiate a decisive attack against him. Upon returning to his human form, Kyros swiftly decapitated what he believed to be Doflamingo. After his initial attempt to kill Doflamingo failed and he relocated to the Flower Hill, Kyros pursued him and went along with Luffy and his allies to fight him."}], "images": []}, {"title": "Diamante", "level": 4, "content": [{"type": "paragraph", "text": "Kyros holds extreme hatred for Diamante for killing Scarlett and trying to murder his daughter as well, and wishes to kill him with his bare hands. When Diamante tried to kill Rebecca, Kyros intervened proclaiming he would not allow Diamante to take away another member of his family. Kyros battled Diamante fiercely, with the latter mocking Kyros after recognizing him as the toy soldier who mourned Scarlett's death as well as using unfair tactics such as shooting Kyros in the leg and trying to kill Rebecca. With his wrath fueling him, Kyros overcame all handicaps and foul plays to defeat Diamante. Despite his promise to kill him, Kyros did not try to end Diamante's life and instead allowed the Marines to arrest him."}], "images": []}, {"title": "Sugar", "level": 4, "content": [{"type": "paragraph", "text": "No direct interaction is seen between the two but Kyros holds complete disdain for the female Special Officer for depriving him and the other toys of their humanity along with any memory of them within Dressrosa. While planning the uprising to depose the Heavenly Demon, he designates her defeat as one of the primary objectives of the operation."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Citizens", "level": 4, "content": [{"type": "paragraph", "text": "During his time as a gladiator, Kyros was initially highly unpopular as he was known as a murderer and a criminal. The crowd would raise an uproar whenever he won, demanding his death instead, something Kyros took deep to heart. However, after he spent several years in the colosseum, the citizens' opinions of him changed for the better. After he achieved 3000 victories, he was acknowledged as a legend. Upon becoming a toy, Kyros is all but forgotten, with only the statue and a lingering legend that some believed to be false."}, {"type": "paragraph", "text": "During his existence as a toy, Kyros became a criminal for breaching the law of entering a human house, even if it was to save Rebecca (whom the citizens hate)."}, {"type": "paragraph", "text": "Even after becoming human again and everyone remembering him, the citizens did not hesitate to attack Kyros during Doflamingo's \"bird cage\" game in order to capture him for Doflamingo. On the other hand, they tried reasoning with him by pointing out that their lives and loved ones were at stake. Kyros did charge through them but was hesitant in doing so as he sympathized with their desire to protect what they held dear."}, {"type": "paragraph", "text": "Following Doflamingo's defeat, any lingering animosity the island had against him has faded entirely as many of them supported his daughter's choice to live with him. They knew the entire time that Scarlett faked her death to marry him and that he is Rebecca's father, and they were grateful to Luffy for bring them together. They also respect him for his part in defeating Doflamingo and carved a new statue for Kyros to honor him as one of the heroes of Dressrosa."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kyros has been an accomplished fighter for much of his life. Even at the young age of 15, he was able to kill two people in a fight. He is the strongest fighter to have ever fought in the Colosseum, winning 3000 fights while taking only a single hit from \"Ricky\" though he had let his guard down upon recognizing his opponent. This proved himself to be an extremely proficient combatant. Examples of opponents he has defeated include a giant and a fishman that Kyros fought underwater. He was well known enough for even the Shichibukai Doflamingo to offer him to join his crew, and when the Marine Captain Koby first met Kyros, he could immediately tell with his advanced Kenbunshoku Haki that Kyros was very strong."}, {"type": "paragraph", "text": "Another testament of his strength is shown in how he single-handedly sank the ships of a pirate crew that had kidnapped Scarlett, whereas all of her other guards were easily defeated; Kyros single-handedly defeated the entire pirate crew, without so much as getting a scratch on himself or his ward Scarlett. His abilities are also illustrated from the fact that he managed to train Rebecca in combat to a level where she not only gained a reputation for herself as a fighter, but even managed to become the victor in her block, despite being a toy which would obviously impose restrictions when instructing someone in combat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Kyros_Defeats_Ricky.png/revision/latest/scale-to-width-down/200?cb=20160824202041", "caption": "Kyros won his last fight in the Corrida Colosseum."}]}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Despite having lost one leg, Kyros has shown enormous strength in his remaining leg, able to jump to incredible heights as well as moving at extremely great speed upon returning to human form he was fast enough to take a string clone of Doflamingo by surprise and decapitate the duplicate. He also easily defeated Buffalo with a single move, stopping his high-speed rotation, breaking his neck, and tossing him out of the building. He was even able to maintain his balance and keep moving when Diamante caused the ground to constantly move up and down like a wave, which the Executive Officer was surprised by."}, {"type": "paragraph", "text": "Kyros also has an enormous amount of stamina, having gone six days without food and still been able to fight against several opponents with ease. He cut off his own leg without hesitation in order to attack Doflamingo, although its potential negative impact on him was unknown since he was turned into a toy seconds later. His stamina is matched further by his monstrous durability, as even after being shot in his good leg and being bombarded by steel spiked balls, Diamante noted that Kyros was able to stand and continue fighting even fiercer than ever."}, {"type": "paragraph", "text": "Even while wounded from his fight with Diamante, he was still able to take down a few of the Donquixote Pirates' grunts with no problems."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Kyros_Fights_with_One_Leg.PNG/revision/latest/scale-to-width-down/250?cb=20160321202534", "caption": "Kyros fights enemies with one leg and wounded."}]}, {"title": "Skilled Tactician", "level": 3, "content": [{"type": "paragraph", "text": "Kyros is also a skilled tactician, having been the one to formulate Operation SOP, a plan that would be effective and instrumental in overthrowing Doflamingo by completely breaking the Donquixote Pirates's control over Dressrossa by liberating the countless numbers of victims Sugar has enslaved with her Devil Fruit powers."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Being a legendary warrior of the Corrida Coliseum who won 3000 matches, Kyros is an extremely powerful swordsman. His sword skills are of the highest caliber, as he could defeat all of his opponents in the Coliseum matches, including a fishman underwater and even a giant, using only a blunt sword. He could accurately deflect numerous steel balls that rained down on him by Diamante. Despite having only one leg, Kyros was able to fight on par with Diamante, who used various other techniques to injure him such as shooting him in the leg and raining steel balls on him, and he managed to defeat the top executive."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Trueno Bastardo (, Turueno Basutādo, literally meaning \"Destructive Sword of Thunder\"): Kyros jumps and slashes his opponent with his sword with extraordinary force, similar to a lightning strike. This attack was first used against Diamante, which was powerful enough to simultaneously cut through his rapier and also grievously wound him in one strike.Trueno Bastardo is Spanish for \"Bastard Thunder\"; the Japanese pronunciation of Spanish Bastardo is the same for English \"Bastard\", a term from how a longsword is referred as \"bastard sword\".", "elements": []}]}], "images": []}, {"title": "Toy Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a toy, he seems to be rather fast and evasive, as he managed to elude the police pursuing him every time, even with one leg. He was able to fight numerous dangers in the past and was a great teacher to Rebecca, as he trained her to be a formidable warrior, fighting without getting hurt or hurting her opponents. However, as his body is a mere toy, it is weak in durability, and as time went by, he continued to break down, with his joints already creaking. His weakened form made him less capable at physically fighting people compared to his human form, however, as he was quickly overwhelmed in hand-to-hand combat by Lao G, and since he was made of inorganic matter, he was susceptible to being ruptured by Gladius' Pamu Pamu no Mi."}, {"type": "paragraph", "text": "As Thunder Soldier, Kyros carried a rifle with him at all times, which he used in battle either as a firearm or as a club."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/Kyros_Using_Jet_Walk_as_Thunder_Soldier.png/revision/latest/scale-to-width-down/210?cb=20140226220831", "caption": "The soldier using \"Jet Walk\"."}]}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Jet Walk (ジェットウォーク, Jetto Wōku): He used this technique to increase his speed in order to dodge the police's shots.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "At age 15, Kyros wielded a makeshift mace made from a pipe with nails sticking out of it. During his time as a gladiator, he wielded a blunted sword. He later switched to a sharpened bastard sword when he became captain of the guard."}, {"type": "paragraph", "text": "While at the Dressrosa Palace as Thunder Soldier, he found a sword he could use after becoming human again and he used it throughout the conflict on Dressrosa."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Legendary Gladiator", "level": 4, "content": [{"type": "paragraph", "text": "Kyros once lived in the slums during his younger years. At the age of 15, he met Riku Doldo III after ruthlessly killing two people in a fight. Kyros struck Doldo on the head when the king tried to speak with him. Despite that, Doldo told his soldiers to stand down and asked Kyros to come with him."}, {"type": "paragraph", "text": "Shortly after, Kyros became a gladiator at the Corrida Colosseum. After winning several battles, Kyros revealed to Doldo that he was only avenging his friend at the slums. Kyros was then told that he would be released if he win 100 battles, a feat he accomplished four months later."}, {"type": "paragraph", "text": "However, despite earning his freedom, Kyros decided to stay in the colosseum. He continued to achieve victory after victory. He even fought a giant and a fishman under water. In his fourth year at the colosseum, Kyros achieved 1000 victories."}, {"type": "paragraph", "text": "While visiting his friend's grave with Doldo, Kyros expressed his sorrow, saying that he would always be known as a beast. He then tearfully wished that everyone would forget about him, a wish that would actually come true years later."}, {"type": "paragraph", "text": "After 9 years in the Colosseum, Kyros achieved 3000 victories and remained undefeated, sustaining only one hit from his last opponent, who just happened to be Riku Doldo III himself (who was disguised as Ricky). After the match, Doldo encouraged Kyros to leave the colosseum, saying that he should not live his life in a cage any longer while noting that Kyros had let his guard down on him. Because of his might, a statue of him was erected in Corrida Colosseum."}, {"type": "paragraph", "text": "At age 25, Kyros became captain of the Dressrosa army. Doldo's eldest daughter, Scarlett, was not fond of him at first but later fell in love with him after he saved her from pirates. After Scarlett left the royal family by faking her death, Kyros lived together with her in a flower field outside the kingdom and later conceived a child, Rebecca. They lived happily with Doldo and Viola coming to visit every once in a while."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e9/Kyros_Statue.png/revision/latest/scale-to-width-down/250?cb=20140216123924", "caption": "Kyros' statue in the Corrida Colosseum."}]}, {"title": "Life as a Toy", "level": 4, "content": [{"type": "paragraph", "text": "On the night that Doflamingo took over the kingdom, Kyros and his family saw the palace burning. After telling his wife and child to wait for him at the Red Flower Field, Kyros went to the palace and confronted Doflamingo, who was holding Doldo captive at his feet. While his leg was chained, Kyros was horrified when Doflamingo informed him that he had sent subordinates to kill his wife and child. When Doflamingo was about to execute Doldo, Kyros cut off his chained leg and attacked Doflamingo."}, {"type": "paragraph", "text": "Sugar intervened and transformed Kyros into a toy, making him her first human victim in Dressrosa. Despite this, he managed to escape the palace with Doldo. As a result of his transformation, all memories of him were forgotten and all that was left of his legacy is his statue at the colosseum. However, Sugar forgot to make a contract, so he was able to retain his free will."}, {"type": "paragraph", "text": "After saving Doldo, Kyros (now known as Thunder Soldier) saved his wife, Scarlett, and his daughter, Rebecca, from a group of armed men led by Diamante. On his way to the Red Flower Field where he told Scarlett and Rebecca to wait for him, he found Diamante shooting his wife down. He cried as his wife died in his arms. Thunder Soldier returned to Rebecca with her mother's body and the food she wanted to give to her. He repented for his failure and after informing her that Doflamingo ascended the throne and was hunting down people connected with the previous king, he swore to protect Rebecca and stay by her side. At first, Rebecca said that she hated him for not protecting her mother, but eventually, she warmed up to him."}, {"type": "paragraph", "text": "Thunder Soldier then became her guardian. In the following years, he worked in many jobs to support Rebecca and protected her from wild dogs, bullies, and boys giving her love letters. One day, kidnappers broke into her house, forcing Thunder Soldier to attack them in order to save Rebecca. However, Thunder Soldier became a fugitive in the process. After running away with Rebecca, he decided to teach her how to fight so she could protect herself, though Rebecca was hesitant to train, not wanting to hurt anyone. As Thunder Soldier taught her how to use a sword, Rebecca would complain about the toy soldier's methods. On one occasion, Rebecca wanted to stop training, believing that she could always rely on Thunder Soldier to protect her. However, Rebecca relented when Thunder Soldier revealed his own limitations."}, {"type": "paragraph", "text": "After leaving her, he became the leader of an underground movement of rebels against Doflamingo's rule. When Doflamingo falsified the news of his resignation, Thunder Soldier explained it to the dwarves, which turned their joy into utter disappointment. He also had a brief conversation with Rebecca at the colosseum. He tried to dissuade her from entering the tournament for the Mera Mera no Mi, but Rebecca was insistent on participating. In anguish, Rebecca told him that he had no chance against Doflamingo because he was just a one-legged toy. After her outburst, he left while Rebecca cried out in apology."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Kyros_Carries_Scarlett%27s_Dead_Body.png/revision/latest/scale-to-width-down/210?cb=20141206215953", "caption": "Thunder Soldier carries Scarlett's dead body to Rebecca."}]}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "When the tournament for the Mera Mera no Mi started at the Corrida Colosseum, he stood at the entrance and barred children from entering and shot at any that tried to do so. He frightened them away, claiming that blood-fights are not meant to be a show for kids. Later, he was chased by two Dressrosa police officers, but was able to elude them by leaping into the Corrida Colosseum, where only the Donquixote Family has power and police and Marines can not act by law. The soldier then jumped down and offered Luffy and Franky, who were dressed like old men, help with their luggage."}, {"type": "paragraph", "text": "After Luffy commented how funny he was, he started falling down comically while laughing to make Luffy laugh. When Franky complained that he was in their way, he became embarrassed. Franky then realized how serious he was, but the toy corrected him by saying that there is no such thing as a serious toy, because toys live to make people laugh."}, {"type": "paragraph", "text": "He was later seen sitting next to Franky in the Colosseum among the spectators. When Franky was about to leave to continue with his mission to destroy the factory, the toy asked Franky if he could come along. Franky refused to take him along because he thought the soldier would get in his way. After Franky said that he would interrogate one of the Donquixote Pirate members to obtain the location of the factory, Thunder Soldier warned him that talking about the Donquixote Family like that is considered a taboo in the kingdom. He then suggested to Franky that they should discuss the matter elsewhere."}, {"type": "paragraph", "text": "Later, in the corridors of the Colosseum, the toy soldier revealed that he himself was also planning to destroy the factory, and that he had been secretly preparing with his comrades. Franky once again asked where the factory is so he could destroy it right away. However, the toy insisted that they first rescue the people working inside the factory. He also said that their tactic is very important, since the destruction of the factory will also bring the fall of Dressrosa as well. He then told Franky that if he had the courage to oppose Donquixote Doflamingo, he would explain the history of Dressrosa."}, {"type": "paragraph", "text": "The toy soldier and Franky then left the Colosseum and made their way to the flower field. While riding on Franky's shoulder, the toy soldier was spotted by Rebecca, who called out to him. After Rebecca tearfully expressed her determination to win the tournament and her wish to live together with him, he replied that a crying warrior would not win any tournament. With that said, the toy soldier and Franky continued on towards their destination."}, {"type": "paragraph", "text": "He later explained to Franky about the two laws that Doflamingo enacted after becoming king ten years ago. Franky then asked him about how he and the other living toys came to be. Kyros revealed that the living toys are in fact humans who were turned into toys by a Devil Fruit user who came to Dressrosa alongside Doflamingo, and that and the human citizens have forgotten who the toys originally were. Before Franky could ask any more questions, the two saw the Flower Hill and Thunder Soldier said that they will talk more there."}, {"type": "paragraph", "text": "The toy soldier then brought Franky to the Riku Royal Army Headquarters hidden beneath the flower field, where he introduced Franky to the dwarf army. Once Usopp, Robin, and the dwarves from Green Bit arrived at the headquarters, Kyros gave his speech about overthrowing Doflamingo."}, {"type": "paragraph", "text": "Afterwards, Gancho explained the history of the dwarves from centuries ago, including their enslavement by the Donquixote Family and their liberation by the Riku Family after the Void Century. Once Gancho finished his story, Robin asked Thunder Soldier about Rebecca and her grandfather. The toy soldier explained the incident ten years ago which caused the former King Riku to lose all trust from the citizens of Dressrosa. When Usopp asked him who he was, the toy soldier revealed himself to be Rebecca's father."}, {"type": "paragraph", "text": "After this revelation, Usopp started wondering how he could be related to the former king, but the toy soldier ignored him and started telling the story of Dressrosa's tragedy in detail."}, {"type": "paragraph", "text": "After finishing his story about Doflamingo's takeover, he further explained that Riku Doldo still lives because his daughter, Viola, would aid the Donquixote Pirates' on the condition that the former king is spared. The toy soldier went on saying that Doldo and Viola must have suffered greatly and that goes for the former soldiers as well. He also said that some of the toys are beginning to lose their memories. However, they still remembered their hatred for Doflamingo and Kyros planned on recruiting them for the rebellion. He then expressed his despair of Doflamingo's fake resignation. As he goes into detail about how at first they were overjoyed at his \"resignation\", he mentions the fact that this being false information was what drove he and the dwarves to plan a rebellion."}, {"type": "paragraph", "text": "Thunder Soldier then explained the plans for the upcoming assault, which he named Dressrosa Operation S.O.P. He informed Franky, Robin, and Usopp about a hidden underground world where the factory and trade port are located and explained that they are going to infiltrate through an underground tunnel that the rebels spent a year digging. Other than destroying the factory and the port, the operation also includes taking out Sugar, the Devil Fruit user who turned humans into toys. He stated that by defeating Sugar, her powers will be undone and that will be essential for the operation's success."}, {"type": "paragraph", "text": "The rebels then finally commenced the operation. Since Franky was too big to fit in the secret tunnel, Thunder Soldier explained that he could enter the underground world through the toy house. While Franky went on that route, Thunder Soldier, the dwarves, Usopp, and Robin entered the tunnel and began their infiltration. Thunder Soldier hoped that Franky would be alright fighting his way in. Once they reach the end of the tunnel, they arrived at the trade port."}, {"type": "paragraph", "text": "Thunder Soldier and a few dwarves later separated from Usopp, Robin, and the majority of the rebels to go to the royal palace to attack Doflamingo as soon as Operation S.O.P. was completed. At the lift, he attacked a group of Doflamingo's men. After reminiscing about the times he trained Rebecca, he declared that he wanted a peaceful country so his child can live happily."}, {"type": "paragraph", "text": "The toy soldier and his group of dwarves later boarded the lift and when they reached mid-way to the palace, they engaged in battle with Lao G, but they seemed to be outmatched. The lift later reached the palace and Lao G continued to have the upper hand. When the palace shook due to Pica confronting Luffy's group, Baxcon, Nubon and Daikon managed to pin Lao G down. Kabu then urged Thunder Soldier to continue going after Doflamingo, and they proceeded together with Rampo."}, {"type": "paragraph", "text": "After fighting through several of Doflamingo's men, Thunder Soldier, Kabu, and Rampo were intercepted by Gladius. After the officer easily subdued the two dwarves, he caught Thunder Soldier before he can escape. The toy soldier was then saved from certain demise by the timely arrival of Luffy and Viola. Luffy knocked Gladius away with a Jet Stamp and the three escaped through a window. They later reach the second floor where Doflamingo was located. While hiding from sight right outside the suit room, Thunder Soldier saw Riku Doldo III and was glad to see him safe. He then waited for Leo's group to complete their operation."}, {"type": "paragraph", "text": "He found a sword that he can use once he became human again. While waiting, he reminisced about the time he first met Riku Doldo III and his history as a gladiator."}, {"type": "paragraph", "text": "Thunder Soldier was then beginning to worry when Gladius and his men were approaching the second floor. He also spoke to Luffy about his realization that he and his crew were pirates but also commented that it was reassuring that they share the same goal."}, {"type": "paragraph", "text": "When Sugar's curse broke, Thunder Soldier transformed back into Kyros. He then wasted no time charging into the room. After tearfully apologizing to Doldo for making him wait for ten years, Kyros took Doflamingo by surprise and decapitated him."}, {"type": "paragraph", "text": "Kyros then cut down Doflamingo's subordinates present in the room. Buffalo attempted to attack Kyros, but the former gladiator easily defeated him. After freeing Doldo, everyone was surprised to see Doflamingo still alive."}, {"type": "paragraph", "text": "It is then revealed that the Doflamingo that was decapitated was only a copy. As Kyros attempted to attack the copy again, the real Doflamingo appeared behind him and tried to behead him with a kick, slicing the royal palace in the process. Luffy managed to save Kyros from a fatal blow. Doflamingo and his copy launched another attack but Luffy and Kyros jumped out of the way. After Doflamingo fought off Luffy, Pica threw Kyros, Luffy, Law, Viola, and Riku Doldo III out of the palace. They later watched as Doflamingo initiated his \"Birdcage\" plan."}, {"type": "paragraph", "text": "Doflamingo trapped everyone on Dressrosa and forced them into a survival game. He coaxed them to go after twelve certain people by putting a price on their heads. Kyros was included in Doflamingo's hit list. Kyros went after Doflamingo alone while fighting through anyone who tried to claim his head."}, {"type": "paragraph", "text": "He was later confronted by armed citizens, who demanded that Kyros surrender. Having important business to deal with, Kyros charged through them."}, {"type": "paragraph", "text": "Kyros later reached the new King's Plateau and climbed up to the first level."}, {"type": "paragraph", "text": "He then went to the second level through a shortcut Luffy made and managed to hitch a ride on Cavendish's horse, much to his chagrin. As Cavendish yelled at Kyros to get off, Kyros was shocked when Luffy informed him that Rebecca was heading for the fourth level. Kyros reminded Luffy that Rebecca is on Doflamingo's hit list, but Luffy assured him that one of his crewmates was with her. After calming down, Kyros explained his intent to kill Diamante. When the other colosseum fighters banded together, they created an opening for Kyros, Luffy, and Cavendish to go through."}, {"type": "paragraph", "text": "While Farul charged towards the third level, Kyros, Luffy, Law, and Cavendish briefly argued over who will be the one to defeat Doflamingo. Once they reached the third level, they found giant toy soldiers standing in their way."}, {"type": "paragraph", "text": "After Farul was gravely injured by one of the toys, the group prepared to battle them. Just then, Robin, Bartolomeo, and Gladius fell from the sky and landed in front of them. Robin and Bartolomeo held back Gladius and the army of toys to enable Kyros, Luffy, Law, and Cavendish to continue towards the fourth level, where Rebecca would be waiting."}, {"type": "paragraph", "text": "Bartolomeo used his ability to create a stairway to the fourth level. After cutting down some of the giant toys, Kyros ran ahead of Luffy. Kyros reached the sunflower field just in time to save Rebecca from Diamante. Kyros then told Rebecca that she would not need to fight anymore. Once Luffy and Law caught up and Law removed his handcuffs, Kyros told them to go ahead while he fights Diamante."}, {"type": "paragraph", "text": "Once Kyros gave Diamante a cut on the face, the latter retaliated with \"Army Bandera\", making the ground ripple."}, {"type": "paragraph", "text": "After Diamante recognized Kyros as the one-legged toy soldier, Kyros charged at Diamante again. Diamante was impressed that Kyros can fight with only one leg but warned him that his cape is made of iron. He then aimed an attack at Rebecca, but Kyros managed to deflect it. Rebecca decided to fight too, but Kyros promised her that he will defeat Diamante so she will not have to use a sword again."}, {"type": "paragraph", "text": "While Kyros struggled to keep his balance due to the Army Bandera, Diamante tried to attack Rebecca again. Kyros told Rebecca to run as she would not be able to block the strike. Fortunately, Robin arrived and stopped the attack."}, {"type": "paragraph", "text": "Robin then promised Kyros that she would protect Rebecca. Kyros thanked Robin and resumed his battle with Diamante."}, {"type": "paragraph", "text": "However, he struggled to avoid Diamante's Half Moon Glaive attack and collapsed on the ground in fatigue. Diamante taunted him and his weakness, and decided to finish off Kyros by using Death Enjambre to rain down spiked steel balls from the sky. Kyros told Robin to protect Rebecca while he batted away all the balls that came his way, showing a shocked Diamante the true power of him and the Dressrosa Army. However, Diamante shot Kyros in the leg, causing him to fall down and be struck all over by the spiked balls. However, as Rebecca prepared to confront Diamante in rage, Kyros stood back up, saying he would never allow his daughter to get blood on her hands. Kyros and Diamante then duel, with Kyros retorting to Diamante's shocked comments about his endurance by saying that Diamante had never known true pain and that he was carrying the anger of a country on his shoulders. Kyros and Diamante stopped dueling and the Donquixote executive prepared to finish him off, but Kyros rushes toward him and uses Trueno Bastard to break through Diamante's sword and cut him down."}, {"type": "paragraph", "text": "Diamante then lost consciousness after hitting his head on Scarlett's grave. Kyros was grateful to Robin for protecting Rebecca and the latter then ran to his side. Kyros and his daughter then sat in front of Scarlett's grave together. Their moment together was cut short when Pica appeared. Kyros was prepared to fight him, but Pica asked Kyros about Riku Doldo III. After Kyros answered his question, Pica left without harming Kyros and Rebecca. They then watched Pica head towards the Old King's Plateau."}, {"type": "paragraph", "text": "After Pica's defeat to Zoro, Leo, Mansherry, Kabu met up with Kyros and his group at the Sunflower Field. Mansherry noticed Kyros's wounds and offered to heal them, but Kyros told her to use her healing powers on the other people who need it more than him."}, {"type": "paragraph", "text": "Kyros was then seen watching as the Birdcage started to shrink."}, {"type": "paragraph", "text": "Kyros then noticed that Leo was looking towards the city with his mouth open and asked him whether something was wrong."}, {"type": "paragraph", "text": "Later, Kyros saw the explosion on the palace roof and told Leo that it would be best if they did not interfere with the battle going on above. After Luffy threw Law down onto the Flower Field, Kyros then stood around Law while Leo and Mansherry were discussing about treating Law's wounds. He later left the Flower Field and went down the staircase made by Bartolomeo."}, {"type": "paragraph", "text": "Kyros, Rebecca, and Robin later join up with Bartolomeo and the colosseum gladiators as Riku Doldo III encouraged the citizens to not give in to despair."}, {"type": "paragraph", "text": "After the injured were healed by Mansherry, Kyros and the other gladiators defeated the remaining Donquixote Pirates on the New King's Plateau to help the citizens flee from the Birdcage."}, {"type": "paragraph", "text": "He later assisted the other gladiators in pushing back the Birdcage via Bartolomeo's barrier. While pushing, Kyros wondered where Rebecca went. Once the Birdcage finally collapsed, Kyros smiled as Luffy's victory is announced to Dressrosa. He then stood behind a piece of rubble and cried with tears of joy."}, {"type": "paragraph", "text": "Later, Kyros saluted the dwarves and commended them on their efforts. He then happily declared their mission completed and disbanded the rebel group before asking them to return to the royal palace. Kyros later took the Straw Hat Pirates, Law, and Bellamy to his house, where he slept and recovered from his wounds."}, {"type": "paragraph", "text": "During this time, he started a rumor that Rebecca's father was a prince from a faraway kingdom who died in a war so he would not need to be a part of the Royal Family. He talked to Riku about it and sent Rebecca a letter explaining everything. Three days later when the Straw Hats were having a meal, Kyros explained everything to them though Luffy did not agree with it. After Bartolomeo arrived, Kyros received a call from Leo that the Marines were headed for his house. He then assisted the Straw Hats in escaping Dressrosa."}, {"type": "paragraph", "text": "After Bartolomeo and the Straw Hats left the house, Kyros packed his things and apologized to Scarlett for starting the rumor as he prepared to leave Dressrosa. Right after he stepped outside of the house, he found Rebecca, who was brought there by Luffy. Rebecca told Kyros that she does not care about his past stating no matter what he was still her father before tearfully embracing him as Kyros asked if she was sure she wanted him as her father. Rebecca answered that she does and asked him to live with her as a family."}, {"type": "paragraph", "text": "When he witnessed Issho preparing to strike Luffy and his allies with all the rubble from Dressrosa, Kyros was worried that the escape plan would fail."}, {"type": "paragraph", "text": "After Luffy and his allies escaped, Rebecca and Kyros held hands just as when Rebecca was a child and when Kyros was Thunder Soldier. It was the very first time Kyros touched her with his bare human hand, feeling the warmth of her grasp, which moved him to tears. His daughter asked him if he was crying again, but Kyros refused to admit it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/22/Franky_and_Thunder_Soldier_Traveling_Through_Dressrosa.png/revision/latest/scale-to-width-down/210?cb=20160113123707", "caption": "Thunder Soldier and Franky travel through Dressrosa."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Operation_SOP_Infobox.png/revision/latest/scale-to-width-down/210?cb=20150529004236", "caption": "Thunder Soldier explains Operation SOP."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Gladius_vs_Luffy.png/revision/latest/scale-to-width-down/210?cb=20150202025335", "caption": "Thunder Soldier is nearly blown up by Gladius."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Kyros_Decapitates_Doflamingo.png/revision/latest/scale-to-width-down/210?cb=20150122202039", "caption": "Kyros decapitates Doflamingo's clone."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Kyros%2C_Luffy_and_Cavendish_Advance.png/revision/latest/scale-to-width-down/200?cb=20160824204355", "caption": "Kyros, Luffy, and Cavendish advance into new plateau while riding Farul"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6d/Kyros_Defeats_Diamante.png/revision/latest/scale-to-width-down/200?cb=20161221100424", "caption": "Kyros defeats Diamante."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Kyros_and_Rebecca_Sit_Before_Scarlett%27s_Grave.png/revision/latest/scale-to-width-down/210?cb=20161221100608", "caption": "Kyros and Rebecca sit together in front of Scarlett's grave."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Kyros_Sobbing.png/revision/latest/scale-to-width-down/210?cb=20160327151328", "caption": "Kyros cries for the first time in ten years."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Kyros_and_Rebecca.png/revision/latest/scale-to-width-down/200?cb=20160522082751", "caption": "Kyros and Rebecca decide to live together."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Kyros accompanied his family to the Levely. After Koby saved the Dressrosa-Prodence Kingdom convoy from a pirate attack, Kyros spoke to Koby and commended his actions during the Rocky Port Incident though Koby denied it."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kyros vs. Corrida Colosseum gladiators (3000 times)", "elements": [{"text": "Kyros vs. Ricky", "elements": []}]}, {"text": "Kyros (as Thunder Soldier) vs. Diamante", "elements": []}, {"text": "Kyros (as Thunder Soldier) vs. Doflamingo's subordinates", "elements": []}, {"text": "Kyros (as Thunder Soldier), Kabu, and the Tontatta Tribe dwarves vs. Lao G", "elements": []}, {"text": "Kyros (as Thunder Soldier) vs. Gladius (interrupted by Monkey D. Luffy)", "elements": []}, {"text": "Kyros vs. Donquixote Doflamingo", "elements": []}, {"text": "Kyros vs. Buffalo", "elements": []}, {"text": "Kyros vs. Dressrosa citizens", "elements": []}, {"text": "Kyros vs. giant toy soldiers", "elements": []}, {"text": "Kyros vs. Diamante", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Kyros vs. Baby 5", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, his statue is bronze, but it appears to be made of stone in the anime."}, {"type": "paragraph", "text": "In the anime, Kyros' confrontation with Buffalo is extended, and he also battled Baby 5."}, {"type": "paragraph", "text": "The anime expands on Rebecca's memories. During Rebecca's recalling her childhood, Kyros is added but his face is not shown."}, {"type": "paragraph", "text": "While on his way to the palace, Kyros was attacked by a few men, one of which tried to shoot him with a rifle until said man was defeated by another man. Kyros thanked the before the latter points the weapon at him while begging Kyros to let him capture him to end Doflamingo's game. Kyros put his sword away and told the man he will defeat Doflamingo which caused the man to put the gun away."}, {"type": "paragraph", "text": "Kyros and Diamante started their battle before Luffy and Law arrived. In the manga, it was after they left."}, {"type": "paragraph", "text": "When the Straw Hats are at Kyros' house, the latter awakened after Sabo left and admitted to having heard some of his story. He also thanked the Straw Hats for saving Dressrosa and while speaking with Zoro, the latter stated he would like to spar with Kyros one day. He was shown writing his letter to Rebecca on-screen."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kȳros (Κῦρος) is a Greek name meaning \"authority\", \"prestige\", or \"validity\". It is Latinized as Cyrus, which most notably refers to Cyrus the Great.", "elements": []}, {"text": "Part of the inscription on his statue reads \"King of Gladiators. Pancratium\". Pancratium was an Ancient Greek martial art combining aspects of boxing and wrestling, introduced in the Greek Olympic games in 648 BC.", "elements": []}, {"text": "As a one-legged toy soldier, he is similar to the titular character of the fairy tale \"The Steadfast Tin Soldier\".", "elements": []}, {"text": "In the 5th fan poll, Kyros ranked 31st.", "elements": []}, {"text": "His wanted poster as Thunder Soldier is unique, as it does not contain a reward number.", "elements": []}]}], "images": []}, {"title": "Notes", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑ SBS One Piece Manga — Vol. 75, Viola's current age is revealed to be 29, Scarlett's age at death was 25. Kyros is 9 years older than Scarlett, and 15 years older than Viola. He spent 10 years as a toy, not aging during that time.", "elements": []}]}], "images": []}]}