{"sections": [{"title": "Bobby Funk", "level": 1, "content": [{"type": "paragraph", "text": "Bobby Funk is an assassin from the Mogaro Kingdom and Kelly Funk's younger brother. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bobby Funk is a large, muscular man, who looms over his older brother Kelly. He has dark hair in two tails slung over his left shoulder. His long dark beard is also kept in two tails. He has a swirling lightning tattoo down his neck and right shoulder. He wears and a broad-rimmed fedora, a dred tie, and a white shirt with the sleeves rolled up."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bobby Funk appears to have a sense of honor and pride as he was seen scolding Dagama for scheming with and bribing the other competitors, although Dagama implied that they might have also bribed their way into the same block as well. He has also shown love for his country."}, {"type": "paragraph", "text": "Bobby maintains a level head in combat, but does not appear to fight and when confronted by a warrior turned his back and pleaded, stating he has never fought in his life. His main interest appears to be restraining his older brother, although he has an absent-minded habit of restraining the person Kelly is fighting instead."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He was a skilled assassin in the past, so it can be assumed that he has some skill in fighting and assassination. He is allegedly strong enough to take down pirates worth over 100 million. According to his brother Kelly, Bobby was blessed with an extremely strong body from birth (strong enough that being struck by a Busoshoku Haki-infused axe not only did not hurt him, but also broke the axe), but his weak will and lack of fighting spirit prevents him from using it effectively. Thus, he usually wears his brother Kelly, allowing his bloodthirsty brother to make better use of his body."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Bobby Funk was an assassin in the past."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Bobby Funk, along with his brother Kelly Funk, came to the Corrida Colosseum to compete for the Mera Mera no Mi, in order to help their country. They were placed in Block C."}, {"type": "paragraph", "text": "After Lucy defeated Spartan, Bobby was seen alongside his brother, arguing with Dagama. Kelly demanded that the Prodence Kingdom tactician stop conspiring with the strong competitors in his block, with Bobby commenting that a fight is a personal thing. In full agreement with his brother, Kelly comments on how Dagama is using conspiracy and bribery to get his way. However, the tactician is not phased with the brothers' threats, and states that they must have been sent from their own country in order to get the Mera Mera no Mi for \"war and diplomatic relations\", before pointing out the other big name competitors fighting for the same prize. When Dagama accuses the two brothers of scheming just as much as everyone else present, and asks them if they used bribes in order to get into the same block as each other, Bobby simply comments that it was a coincidence."}, {"type": "paragraph", "text": "As Block C began, Bobby and his brother were seen preparing to fight."}, {"type": "paragraph", "text": "Later, Kelly was shown mercilessly beating a fighter who was already unconscious. Alarmed, Bobby pleaded for his brother to stop, but ended up accidentally grabbing his brother's opponent instead of him. After realizing his mistake, Bobby finally restrains his violent brother, who tells him that the guy he had been pounding had called him a midget, before asking Bobby if he truly was a midget. Bobby assures him he is not, but his message seems lost on Kelly, who once again starts beating the unfortunate fighter. Not surprisingly, Bobby again grabs the wrong person in a second attempt to restrain his brother. His anger finally sated, Kelly finished his brutal beat down by threatening to gouge the man's eyes out. He then angrily told his brother to stop blocking him, with Bobby meekly informing his brother that this is a match."}, {"type": "paragraph", "text": "Moments later, Boo comes up on them, curious to see how a boxer with no formal training would fair against him. He immediately sends Kelly flying with a quick jab to the chin. Alarmed, Bobby cries out in concern for his brother. Boo then turns his sights on him, and tells him to prepare himself. Bobby, panicking in the face of this new threat, claims he has never been in a fight, and then cowers over his brother, exposing his back to Boo, who immediately takes the opportunity to swing one of his axes down on him. Much to Boo's surprise, however, his axe snaps over Bobby's back. This seemingly impossible feat was made even more surprising by the fact that Boo had imbued Busoshoku Haki into that last attack, leading the man to question how strong Bobby's body is. As Bobby frets over his brother, Kelly, nearly unconscious, angrily mutters how Boo had called him a midget, before telling Bobby to \"put it on\". Suddenly, what appears to be a larger, enraged Kelly with Bobby's hat and hair turns the tables on Boo, to Sai's consternation, by hitting him with a barrage of punches that knocks him unconscious. Unsatisfied with this, Kelly continues to pummel the kenpo user into the ground, threatening to bite his throat out."}, {"type": "paragraph", "text": "It is later revealed by another fighter in the arena, who had seen what had happened, that Kelly had unzipped and deflated like a jacket, and Bobby had then donned him, causing Kelly to gain his physique. After knocking out Boo, Kelly had then revealed this strange ability to be the result of a Devil Fruit he had eaten, the Jake Jake no Mi, allowing him to be worn like a suit to borrow the wearer's body and strength. Kelly, in Bobby's body, then proceeded to rampage through several more fighters with his Rarara Rambo, before being confronted by Sai. Despite the size and strength he had gained from Bobby, Kelly was defeated when Sai demonstrated his own speed and strength by climbing into the air atop Kelly's flying fists and delivering an Hasshoken-infused kick to his head, knocking the brothers out instantly."}, {"type": "paragraph", "text": "Sometime after Block C, Bobby and Kelly Funk were transformed into toys and forced to work in the underground trade port. When Sugar passed out, they returned to their human forms, and Bobby was seen holding someone while Kelly pummeled him."}, {"type": "paragraph", "text": "He was later seen standing alongside the other former slaves as Usopp was hailed as their savior."}, {"type": "paragraph", "text": "While Kelly fused with Bobby, they appeared at the first level of the new King's Plateau seemingly to aid Luffy and his allies. The Funk Brothers, however, lied about the tunnel, which lead to a dead end. Doflamingo appeared at the entrance, incapacitated the Funk Brothers, and entered."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7f/Funk_Brothers_Defeat_Boo.png/revision/latest/scale-to-width-down/210?cb=20141206210736", "caption": "Bobby and his brother defeat Boo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Sai_Defeats_the_Funk_Brothers.png/revision/latest/scale-to-width-down/210?cb=20140525090648", "caption": "The Funk Brothers are defeated by Sai."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bobby Funk and Kelly Funk vs. Corrida Colosseum Block C Gladiators", "elements": [{"text": "Bobby Funk and Kelly Funk vs. Boo", "elements": []}, {"text": "Bobby Funk and Kelly Funk vs. Sai", "elements": []}]}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bobby's and Kelly's names, their relationship as being brothers, and the fact that they are participating in an arena may have been influenced by the famous wrestling brothers Terry Funk and Dory Funk, Jr.", "elements": []}, {"text": "Bobby is one of the very few characters whose family name comes after the given name.", "elements": []}]}], "images": []}]}