{"sections": [{"title": "Chinjao", "level": 1, "content": [{"type": "paragraph", "text": "Chinjao, formerly known as \"Don Chinjao\" and \"Chinjao the Drill\", is a former pirate, the leader of the Chinjao Family, and the retired 12th leader of the Happo Navy. He also joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi."}, {"type": "paragraph", "text": "He has a bounty of 542,000,000. Although at first he confronted Luffy for his hatred against Garp, he became his ally during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chinjao is an elderly man, with very thick white eyebrows, a long white beard and mustache. He is a large human, about twice as tall as most humans but still not as tall as the late Edward Newgate. He is bald, with a dent on the crown of his head, and has the number \"12\" tattooed on his left temple representing that he was the 12th leader of the Happo Navy. Chinjao sports a pale green shirt with white linings, that shows his chest and round belly. He also wears dark yellow pants."}, {"type": "paragraph", "text": "Although Chinjao's expression is usually calm and serene-looking, his expression changes to a fiercer look when enraged, with his facial hair waving upwards."}, {"type": "paragraph", "text": "In his youth, he wore a long, buttoned, blue-colored shirt, with light green circle patterns and a yellow, grey captain's coat draped on his shoulders. He had a long pointed head, which gave him his epithet \"the Drill\". However, after a punch from Garp, his head was forced into its dented appearance. A glancing punch from Luffy later reverted it to normal. Not long after that though, a kick from his grandson, Sai, bent it."}, {"type": "paragraph", "text": "While under the effects of the Hobi Hobi no Mi, he appears as a Santa Claus-like doll."}, {"type": "paragraph", "text": "At Sai's wedding, he wore a bowtie and a mantle."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He seems to be a quiet and calm person, as he did not react to Luffy defeating Spartan. He is quite perceptive as, unlike many people in the Colosseum, he saw through Luffy's disguise. His immense presence, imposing nature lead to him having a serious, solemn demeanor."}, {"type": "paragraph", "text": "After losing something he considered precious, Chinjao can hold a great grudge and would believe that a child would inherit a parent's sin, as he wanted Luffy to pay for his grandfather Garp's actions, and even commented on how he would have killed Dragon if he knew that he was Garp's son sooner. Despite his grudge, he is at least able to maintain civility by addressing his enemies with an honorific suffix. However, this is short-lived as he can enter into a violent rage at the prospect of Garp's bloodline being near him. After Luffy returned what Chinjao had lost, Chinjao's grudge has ceased to exist."}, {"type": "paragraph", "text": "He also holds the Worst Generation in low regard, going so far as to praise the Marines for cleansing the demonic blood of Roger two years ago, thereby pulling the sprout that showed the most potential as a pirate."}, {"type": "paragraph", "text": "He always seems confident in his own fighting capabilities. During his fight with Garp, he believed that the Marine would end up losing his fist. At the Corrida Colosseum, he did not think highly of Luffy during their battle despite the pirate's reputation and believed that he will succeed in killing the Straw Hat captain."}, {"type": "paragraph", "text": "Prior to losing to Garp, Chinjao seems to be somewhat merciful, having ordered his men to simply round up the thieves attempting to steal his treasure and then send them drifting across the sea. He still addresses his enemies with an honorific suffix and politeness in civil conversations, such as knocking out some of the competitors in Block C while letting them off by knocking them out with Haoshoku Haki. However, Chinjao happens to be rather brutal in combat, as he knocked away numerous competitors to get to Luffy in Block C. Unlike Sai, he would even allow Baby 5 to commit suicide given a misunderstanding between her and Sai, going as far as to try preventing him from saving her life and attempting to take both their lives after Sai continued to do so."}, {"type": "paragraph", "text": "Chinjao is proud of the Happo Navy and his family. He would expand his military power through an arranged marriage between Sai and the daughter of the leader of the Niho Navy. When Sai was preventing Baby 5 from committing suicide, Chinjao declared him to be a disgrace to the navy and the family. However, after Sai bent his pointed head, Chinjao cried in joy over his grandson's power instead of getting angry, showing affection and gratitude of his family's strength, as he would call off the arranged wedding and declared that he would give his title of \"Don\" to Sai."}, {"type": "paragraph", "text": "Like most notable characters, he has a unique laugh: \"Hiyahoho\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Sai and Boo", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao shares an affectionate relationship with his two grandchildren, Sai and Boo. When he became enraged and tried to murder Luffy, the two of them could barely calm him down, though he did refer them with affectionate regard, and did not try to harm them for interfering as he did with Cavendish."}, {"type": "paragraph", "text": "While Sai and Boo were turned into toys, Chinjao completely forgot about them, saying in a conversation with Doldo that he wished that he had grandchildren."}, {"type": "paragraph", "text": "Chinjao would regain his memory of his grandchildren and they would seek to defeat Doflamingo for enslaving them. During the battle against the Donquixote Pirates, Chinjao became angry at Sai's \"proposal\" to Baby 5, due to a misunderstanding. He reminded Sai of the arranged marriage between him and the daughter of the leader of the Niho Navy. Upon further miscommunication, Baby 5 attempted to commit suicide and Sai tried preventing her from taking her own life, but Chinjao attempted to intervene, saying that he was helping an enemy. When Sai continued to ignore his grandfather's words, Chinjao declared him a disgrace to their family and navy while trying to attack both of them with his pointed head."}, {"type": "paragraph", "text": "When his grandson Sai managed to bend his head, rather than be angry, he actually cried tears of joy because his grandson managed to surpass him. He then proceeded to give him full control of his navy, his title of Don, and named the technique he used to bend his head after his own ultimate technique."}], "images": []}, {"title": "Baby 5", "level": 4, "content": [{"type": "paragraph", "text": "At first, the two were enemies given their respective association with Luffy and Dolfamingo. During the Birdcage game, Chinjao thought that Sai was \"proposing\" to Baby 5 given a misunderstanding, and given further miscommunication, Chinjao would allow Baby 5 to commit suicide, going as far as to prevent Sai from saving her."}, {"type": "paragraph", "text": "After having his head bent by Sai, Chinjao was overcome with joy and not only he declared the title \"Don\" to him but also called off the arranged marriage to let Sai marry Baby 5. After the downfall of the Donquixote Pirates, Chinjao and his grandsons toasted with Baby 5 during a celebration. He later participated in Sai and Baby 5's wedding and celebrated their union, indicating that he has accepted her as a granddaughter-in-law."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao originally saw Luffy as an enemy based on his heritage with Garp. Due to this, Chinjao desired to take out his grudge against Garp on Luffy. As with Garp, Chinjao shows a level of civility by referring to Luffy with the honorific suffix \"-kun\"."}, {"type": "paragraph", "text": "However, this was short-lived, as Chinjao lost control of himself and tried to kill Luffy, ignoring his primary reason for entering the tournament and nearly getting himself disqualified. During Block C's battle royale, Chinjao plowed through the many other contestants to reach Luffy alone. Chinjao desires to kill Luffy as opposed to Garp in order to leave the famed Marine in despair of losing someone precious."}, {"type": "paragraph", "text": "During their clash, Chinjao did not hold Luffy in high regard, even stating that he had no chance of being Pirate King and disrespecting Ace's death. Ironically, when Luffy defeated him, he inadvertently returned the one thing Garp took away by restoring Chinjao's pointy head."}, {"type": "paragraph", "text": "After the match, Chinjao became grateful for what Luffy has done and let go of his hatred towards him. He attempted to thank Luffy for restoring his head, but his efforts cause Luffy to get the wrong idea and run off while Chinjao's newly developed respect for Luffy made him think of having his grandsons help the Straw Hats. During the Birdcage, he got the chance to tell Luffy that he no longer has any ill-will towards him or his family and cooperates with Luffy in the decisive battle against Doflamingo to repay his debts."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo deceived him by sending him to an underground dungeon, he declares his grudge against him and his descendants much like his grudge against Garp. After Doflamingo trapped Dressrosa in his \"birdcage\", Chinjao assisted Luffy in the battle against him."}], "images": []}, {"title": "Lao G", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao fought against Lao G and developed something of a rivalry with him. After a tough fight, Lao G defeated Chinjao when he unleashed his full power and thought Sai was proposing to Baby 5."}], "images": []}, {"title": "Gol D. Roger", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao fought against Roger in the past."}], "images": []}, {"title": "Silvers Rayleigh", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao apparently holds a grudge against Rayleigh, as when Luffy reveals Rayleigh is the one who taught him to control Haki, Chinjao expressed displeasure to know the Pirate King's right hand still lives."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "In the past, Chinjao was not only nearly killed by Monkey D. Garp, but also lost his power and fortune to the Marine. For this reason, he bears a grudge against Garp and wants to take it out on his grandson, Luffy. The grudge extends to Garp's son, Dragon, saying that if he (Chinjao) knew sooner that Dragon is Garp's son, he would have killed the man before Luffy could come to this world. Believing that death is too good for Garp himself, Chinjao instead desires to kill Luffy so Garp would live in despair of losing someone close."}, {"type": "paragraph", "text": "Despite this, he shows a certain level of respect (if not out of sarcasm) by referring to Garp with the honorific suffix \"-san\"."}, {"type": "paragraph", "text": "After Luffy restored Chinjao's old head, Chinjao said to himself that he no longer holds his grudge against Garp."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "In his golden age, when he was still a pirate, he had a bounty of 542,000,000. However, the bystanders watching him attack Luffy implied that he may have weakened with age. A battle with Garp caused his head to be flattened and diminished his power while he was in his prime. Sometime, following his fight with Monkey D. Luffy, he reveals to Sai that his illness has worsened since their clash, which, along with his old age, has further depleted his strength."}, {"type": "paragraph", "text": "As the leader of the Chinjao Family, he has complete control over them. He was also able to survive an encounter with the famous Marine, Vice Admiral Garp, enforcing a good deal of power. Since he is a former commander of the Happo Navy he has access to their techniques as he used them quite well in battle."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Chinjao was an extremely powerful master of Hasshoken in his prime. He personally emphasized vibration enhanced punches and prominently headbutts. Before his head was flattened by Garp, his headbutts were powerful enough to split the immensely hard Ice Continent in two, courtesy of his drill-shaped head that allowed him to concentrate all of his strength into that point. Upon Luffy's strike restoring Chinjao's head to its old, pointed shape, his legendary strength from thirty years ago was restored, enabling him to split the Corrida Colosseum's arena simply by falling onto it head first. Even something as simple as bowing his head in gratitude can split the ground in front of Chinjao. However, his head was later bent by Sai, and it is unknown if he can fully use it again."}, {"type": "paragraph", "text": "Even with his head blunted, Chinjao can easily destroy rocks and block swords with his head alone. He is very fast, to the point that he deliver a barrage of headbutts that leaves afterimages, much like Luffy's Gomu Gomu no Gatling technique. He can easily keep up with Luffy's Gear Second enhanced speed in combat."}, {"type": "paragraph", "text": "Even in his old age, Chinjao remained physically powerful, able to bring down multiple powerful gladiators with his bare hands. He easily defeated Ideo, a boxing champion, with one swift strike. He also managed to hold his own against Luffy, a powerful fighter, in a fist fight. Finally, Chinjao is extremely durable, as he slightly bent Cavendish's \"legendary sword\" Durandal with the force of his head alone without his skin getting pierced, and got up quickly and unscathed after receiving a Jet Pistol to the back of the head.. He took several of Jean Ango's thrown weapons to the belly without any serious injuries, though it did cause him some bleeding and pain, while also acting in a manner similar to rubber, in that he bounced the weapons that hit him in the stomach and not long afterwards he reached full recovery with no permanent damage done. Ultimately, he managed to survive a full powered strike from a revitalized Lao G's strengthed Sento Ho-Ken and a ruthless assault from Pica's Charles Stone while in a heavily injured state."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Hasshoken_Infobox.png/revision/latest/scale-to-width-down/210?cb=20161221011055", "caption": "Chinjao using Hasshoken."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Chinjao is one of the very small number of people in the world who can use all three types of Haki."}], "images": []}, {"title": "Haoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao has also shown the ability to use Haoshoku Haki when he knocked out many of the competitors in Block C without laying a finger on them, an impressive feat considering that most of the participants in the Corrida Colosseum are strong fighters."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao is highly proficient in Busoshoku Haki, which he uses to harden his fist to augment the force of his punch and clash evenly with Luffy, an expert Busoushoku Haki user. The clash of their Haki enhanced strikes resulted in the air itself crackling. He prominently uses it to harden his head in order to split open the Jewel Ice Sheet."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Chinjao was a pirate and the 12th leader of the Happo Navy. Back then, his head was very tall and pointy, and it was rumored that nothing else could rival its hardness. This gained him the name \"Chinjao the Drill\"."}, {"type": "paragraph", "text": "At one point in time, he obtained an immense amount of treasure, amassed from both his efforts and of those from the rest of his clan, deeming it as his \"life's work\", and decided to bury it all in the one place no one else could access but him, the Ice Continent. Using his incredibly hard and pointy head, he could split open and reseal the continent any time he liked without any fear of anyone else being able to access it. Thus, the Ice Continent was the perfect place to bury his treasure."}, {"type": "paragraph", "text": "Unfortunately, in one encounter with Monkey D. Garp, the two faced off with Chinjao using his head which was considered the strongest head of that time and Garp using his fist, attempting to see which of the two was stronger. After the two collided, Garp overpowered Chinjao, causing his head to completely collapse in a telescopic fashion. This incident severely limited his destructive power to the point where he was no longer able to open up his secret treasure stash in the Ice Continent."}, {"type": "paragraph", "text": "As a result, Chinjao not only lost his livelihood, but also his fortune and his powerful head. After having lost so much, he decided to quit as a pirate, completely heartbroken. This led Chinjao to develop a life-long hatred for both Garp and his descendants."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/40/Garp_vs._Chinjao.png/revision/latest/scale-to-width-down/210?cb=20150823101215", "caption": "Garp flattens Chinjao's pointed head."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao came with Boo and Sai from the Kano Country ostensibly to compete for the Mera Mera no Mi, but with a hidden agenda to investigate a weapons trade that the Donquixote Family was involved in. Chinjao witnessed Luffy defeating Spartan. He sat quietly as Boo and Sai spoke to Luffy. For the battle royale, Chinjao was placed in Block C."}, {"type": "paragraph", "text": "Later on, as Luffy and Cavendish were watching the fights of Block B, Chinjao approached Luffy and asked him how Garp is doing and tells him that he once nearly died by Garp's hand, declaring soon after how he will seek revenge on Garp's grandson."}, {"type": "paragraph", "text": "Before Cavendish could attack Luffy, Chinjao made the first move, striking at Luffy with a headbutt, which he was able to dodge. Chinjao attacked again, but Cavendish stopped his attack with his sword. He then continuously launched a barrage of headbutts until Luffy punched him into the ground. He got back up unfazed and prepared to unleash his fury. Before Chinjao could cause anymore trouble, Boo and Sai stopped him. The two told him that he could just kill Luffy during the Block C fight and reminded him of their true goal."}, {"type": "paragraph", "text": "When Block C began, the Chinjao Family entered the ring, preparing to fight. As the battle royale in Block C raged on, Chinjao tried to make his way toward Luffy but several of the other gladiators got in his way, intending to take his head. Chinjao, however, used a burst of Haoshoku Haki to quickly get rid of them. Chinjao then continued heading towards Luffy but was interrupted again by Jean Ango, who thanked him for dispatching the other gladiators since he can now collect their weapons and use them himself. Chinjao then continued rampaging and making his way towards Luffy and saying he wished Garp was there to see what he was going to do to his grandson."}, {"type": "paragraph", "text": "After Boo was brutally defeated by the Funk Brothers, Chinjao told Sai to avenge him. While Luffy was dodging Jean Ango's attacks, the thrown weapons accidentally hit Chinjao. Angered, Chinjao knocked Jean out of the ring with a head butt. Before clashing with Luffy, he eliminated Ideo while Luffy defeated Sai. As the two remaining fighters in the battle royale, Chinjao and Luffy clashed their fists against each other, releasing a large wave of Haoshoku Haki to burst throughout the arena."}, {"type": "paragraph", "text": "After Luffy declared his dream of becoming the Pirate King, Chinjao asked him who taught him Haki and Luffy answered that it was Rayleigh. Chinjao then bursts into tears, mentioning about a treasure he was not able to obtain. When Luffy told him to stick to either crying or getting angry, Chinjao continued his battle with him. Chinjao's change of plan of originally intending to get Sai into the next round surprised his two grandsons."}, {"type": "paragraph", "text": "After Chinjao launched several attacks that Luffy barely avoided, Luffy struck back with his Gomu Gomu no Hawk Rifle, an attack powerful enough to make him cough up blood."}, {"type": "paragraph", "text": "After recovering, Chinjao began mocking Luffy, telling him that those known as the Worst Generation are greenhorns who do not know anything of the world and saying that his attempts to surpass Roger are laughable. He then enrages Luffy by saying executing Ace was a smart move by the Marines. Luffy then proceeds to launch himself in the air with Gomu Gomu no Rocket using Chinjao as leverage. He then thought to himself that he would succeed in taking Luffy's life, all while imbuing his head to shield himself from Luffy's incoming Gomu Gomu no Thor Elephant Gun."}, {"type": "paragraph", "text": "The two collided, seemingly matched up until Luffy manages to gain the upper hand, which coincidentally restores Chinjao's pointy head. He is then knocked out and falls down to the arena, splitting it in half with his newly reformed head. Chinjao then falls into the water, unconscious, officially losing Block C. His grandsons call out to him in horror as he continues to sink into the water."}, {"type": "paragraph", "text": "After the match, Chinjao and his grandsons went to speak with Luffy in the Colosseum corridors. Grateful for having his head restored, Chinjao lets go of his grudge. He tries to bow in respect but ends up accidentally breaking the floor. Thinking that he's being attacked, Luffy runs away. Chinjao thinks to himself about putting his grandsons under Luffy's command as a way to express his gratitude."}, {"type": "paragraph", "text": "Sometime later, Chinjao was supposed to receive treatment for his injuries but instead, he was thrown into an underground dungeon filled with broken toys along with some of the disqualified participants. Enraged by Doflamingo's trickery, Chinjao declared his grudge against him."}, {"type": "paragraph", "text": "Afterwards, they were joined by Boo, Ideo, and Kelly Funk, and Ricky revealed himself to be the former king of Dressrosa, Riku Doldo III. The Chinjao Family then explained how various countries, including the Kano Country, were plagued by wars due to Doflamingo's weapons trading. Chinjao and Boo were alarmed when Sai was abducted and dragged out of the dungeon by Trebol."}, {"type": "paragraph", "text": "Chinjao later had a conversation with Riku Doldo III about their retirements, and during the conversation, Chinjao mentions how he wishes he had grandchildren, completely forgetting about Sai and Boo, who were kidnapped and turned into toys. Since they were turned into toys, everyone else forgot about them, something explained by the Thunder Soldier."}, {"type": "paragraph", "text": "He was later transformed into a toy and forced to work in the underground trade port. When Sugar lost consciousness, Chinjao returned to his original form. He was later seen standing alongside the former slaves as Usopp was hailed as their savior."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\", Chinjao and the other colosseum fighters escaped to the surface through an opening created by Pica when he rearranged the land with his ability."}, {"type": "paragraph", "text": "When the Chinjao Family found Luffy, Zoro, and Law, Chinjao managed to tell Luffy that he no longer holds a grudge against his family. Chinjao explained that he also wanted to repay Usopp by defeating Doflamingo. Therefore the Chinjao Family joined forces with Luffy alongside Cavendish, Ideo, Hajrudin, Orlumbus, Elizabello II, Dagama, Abdullah, Jeet, Suleiman, Blue Gilly, and Fighting Bull. When some of the former toys came for the heads of Luffy, Zoro, and Law, the allied colosseum fighters fought them off. They later marched towards the palace and battled against Pica, who appeared as a massive stone giant. Chinjao and Elizabello II broke Pica's giant stone hand by attacking him together."}, {"type": "paragraph", "text": "With Pica's attack warded off, the group pressed on forward and fought through Doflamingo's troops. Pica then prepared to attack with his other arm and Zoro informed Chinjao and Elizabello II that attacking Pica's stone body is useless. After avoiding Pica's strike, they were surprised to see Luffy, Zoro, Law, Abdullah, Jeet, and Fighting Bull climbing on Pica's arm. They were also amazed when Luffy shattered Pica's stone head. When Pica's giant stone body stopped moving, Chinjao and his allies continued on with their assault."}, {"type": "paragraph", "text": "With Zoro fighting Pica and Sabo fighting the Marines, the colosseum fighters charged up the new King's Plateau and easily defeated the Donquixote Pirates' troops standing in their way. They later reached the first level and got ahead of Luffy."}, {"type": "paragraph", "text": "Later, after reaching the second level, Chinjao broke away from the group during the chaos and got even further ahead. While climbing to the third level, Gladius knocked him down with Landmine Punk. The colosseum fighters later banded together to create an opening for Luffy and Cavendish."}, {"type": "paragraph", "text": "Chinjao was later seen battling against Lao G. After Lao G dodged a headbutt, Chinjao received a kick to the head."}, {"type": "paragraph", "text": "Chinjao later thought that Sai and Baby 5 were engaged and disapproved their \"union\". Sai tried to make it clear that he had no intention of marrying Baby 5 and Chinjao reminded him that the daughter of the leader of the Niho Navy was supposed to be his fiancée. When Sai tried to stop Baby 5 from committing suicide, Chinjao was infuriated and attempted to attack both Sai and Baby 5 with his pointed head. Sai then bent Chinjao's head with a kick. Acknowledging Sai's strength, Chinjao gave Sai the title of Don. At that moment, Lao G swooped in and knocked out Chinjao."}, {"type": "paragraph", "text": "Chinjao survived Lao G's attack and was quickly tended to by his grandson. A love-struck Baby 5 then remarked that Sai had two ceremonies to prepare for, a wedding and a funeral, which irritated both Sai and Chinjao as the latter was not dead."}, {"type": "paragraph", "text": "After most of the Donquixote Pirates' officers were defeated, Pica preyed on the injured. Chinjao survived Pica's attack and he, Sai, and Baby 5 then watched Pica head towards the Old King's Plateau. He then witnessed Pica's defeat at the hands of Zoro, and was awestruck by Zoro's feat of strength."}, {"type": "paragraph", "text": "When Doflamingo's Birdcage started shrinking, Chinjao was told by Sai to wake up their fallen allies before the Birdcage reaches them."}, {"type": "paragraph", "text": "Chinjao and the other injured gladiators were later temporarily healed by Mansherry. They then defeated the remaining Donquixote Pirates on the New King's Plateau to help the citizens who were fleeing from the shrinking Birdcage."}, {"type": "paragraph", "text": "When the Birdcage came close to the central streets, the gladiators worked together to push back the Birdcage via Bartolomeo's barrier. Once Luffy finally defeated Doflamingo, the gladiators witnessed the collapse of the Birdcage."}, {"type": "paragraph", "text": "Later that night after the aftermath, Chinjao and the other gladiators were seen resting at the palace."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. As the Straw Hats made their way to the eastern port, Chinjao and his fellow gladiators assisted the Straw Hats in escaping Dressrosa."}, {"type": "paragraph", "text": "The fighters later gathered at the eastern port, preparing to fight Issho. When Issho prepared to attack them with all the rubble from Dressrosa, the fighters quickly fled to the escape ship."}, {"type": "paragraph", "text": "During the clash, Issho used his gravity ability to blow away Luffy, who was then caught by Hajrudin. The fighters and Straw Hats quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after Luffy. They eventually reached Orlumbus' flagship, the Yonta Maria. After boarding the ship, the Happo Navy was then one of the seven groups that pledged their allegiance to the Straw Hats."}, {"type": "paragraph", "text": "After the Straw Hat fleet was formed, the Straw Hats and company held a feast to celebrate their victory over Doflamingo."}, {"type": "paragraph", "text": "After Sai received Luffy's Vivre card, the Happo Navy parted ways with the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Luffy_and_Cavendish_vs._Chinjao.png/revision/latest/scale-to-width-down/210?cb=20141206210629", "caption": "The furious Chinjao ready to fight Luffy and Cavendish."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2b/Luffy_vs._Chinjao.png/revision/latest/scale-to-width-down/210?cb=20150825171505", "caption": "Luffy and Chinjao's clash during Block C."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d4/Hawk_Rifle.png/revision/latest/scale-to-width-down/210?cb=20130827004946", "caption": "Luffy using Gomu Gomu no Hawk Rifle against Chinjao."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Luffy_Defeats_Chinjao.png/revision/latest/scale-to-width-down/210?cb=20141115195105", "caption": "Luffy defeats Chinjao and inadvertently restores his pointed head."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Chinjao_and_Elizabello_vs._Pica.png/revision/latest/scale-to-width-down/210?cb=20161221114701", "caption": "Chinjao and Elizabello II shatter Pica's hand"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/13/Lao_G_Defeats_Chinjao.png/revision/latest/scale-to-width-down/210?cb=20150922150536", "caption": "Chinjao defeated by Lao G."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Revived_Gladiators_Defeat_Donquixote_Pirates.png/revision/latest/scale-to-width-down/190?cb=20161221120222", "caption": "Chinjao and the other gladiators defeat the remaining Donquixote Pirates."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "After parting ways with the Straw Hats, the Happo Navy journeyed back to their home country. When Sai received a beating from Uhoricia after breaking up their engagement, Chinjao received a scolding from Uhoricia's father. Chinjao later participated in Sai and Baby 5's wedding."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Chinjao vs. Monkey D. Garp", "elements": []}, {"text": "Chinjao vs. Monkey D. Luffy and Cavendish (Interrupted by Sai and Boo)", "elements": []}, {"text": "Chinjao Family vs. Corrida Colosseum Block C gladiators", "elements": [{"text": "Chinjao vs. Monkey D. Luffy", "elements": []}]}, {"text": "Corrida Colosseum gladiators vs. Donquixote Pirates", "elements": [{"text": "Chinjao and Elizabello II vs. Pica", "elements": []}, {"text": "Chinjao vs. Lao G", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Chinjao vs. Baby 5", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Chinjao (青椒, Chinjao), or qīngjiāo, means \"green pepper\" in Chinese.", "elements": [{"text": "Fittingly, Chinjao's favorite food is chinjao-rōsu, an adaption of the Chinese qīngjiāoròusī dish in Japanese Chinese cuisine.", "elements": []}]}, {"text": "Like Strawberry, Chinjao's elongated head is similar to Fukuroukuju, one of the Seven Gods of Good Fortune in Japanese folklore who is often depicted with an abnormally high forehead.", "elements": []}, {"text": "Chinjao's phrase \"Open, Chinjao\" was inspired by the famous phrase \"Open, Sesame\" from Ali Baba and the Forty Thieves, in which the phrase is used to open a cave filled with treasure.", "elements": []}]}], "images": []}]}