{"sections": [{"title": "Bartolomeo", "level": 1, "content": [{"type": "paragraph", "text": "Bartolomeo the Cannibal is a Super Rookie, the captain of the Barto Club and the captain of the second ship of the Straw Hat Grand Fleet. He was also a gladiator competing at the Corrida Colosseum for the Mera Mera no Mi, where he met Monkey D. Luffy and pledged his loyalty towards him."}, {"type": "paragraph", "text": "He is an ally of Luffy during the Dressrosa Arc, and the beginning of the Zou Arc, as well as during the non-canon Silver Mine Arc. He is also one of the central characters from The Stories of the Self-Proclaimed Straw Hat Grand Fleet Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bartolomeo is a light-skinned, tall and lean yet muscular man. He has light green-colored hair in a wild, Mohawk style and no eyebrows. He has a demonic looking face, sharp fangs, and a ring piercing on his nasal septum. There are two lines tattooed under his right eye that curve towards his ear."}, {"type": "paragraph", "text": "He has a dark tattoo on his chest of a thick ring with an opening on the top, wings on the sides, and long fangs on the bottom. He wears a dark purple coat with a stripe down each sleeve and a plumed collar and cuffs. On the back of it is a face with its head on fire with two crossing sabers just underneath it. He has a light-colored ring-patterned belt with a chain on the left. He has a weapon tucked in the front of his baggy checkered trousers, and has light ruffled dark boots on his feet."}, {"type": "paragraph", "text": "Two years ago, he sported a yellow and red vertically striped coat with tan fur around the neck. He also had brown pants and a black belt. His hair was not as wild, being more slicked back in a pompadour style."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bartolomeo can be rather vulgar and laid-back at times, as during the battle royale in Block B, he was lying on the sides watching the battle and then casually urinated off the side on the ring in front of all the spectators. His overall attitude and lack of refinement made him a very unpopular person among the audience, who booed Bartolomeo at every turn. During his formal introduction, Bartolomeo is said to be ranked number one on the \"pirate we wish most to disappear\" list."}, {"type": "paragraph", "text": "He is also very provocative, as Bartolomeo not only taunts the crowd with his shenanigans, but also mocks his opponents, usually in a nonchalant manner. Even when attempting to stay cool, however, Bartolomeo can become angered when provoked in return; when the spectators at the stadium insulted him, he threw a fake bomb at the audience to scare them. Bartolomeo also doesn't care what anyone else thinks of him, as he stated to Dagama that popularity among the audience is the least of his concerns. He did not even mind that he made enemies with the Donquixote Pirates by saving Bellamy, even treating it with blissful indifference. He also loves to mock his opponents as he pretends to be afraid when Hack was going to attack him only to reveal his Devil Fruit to make Hack's attack back fire on him. He also does not seem to hold a high opinion of people, as when he said he was disgusted by the audience's reaction when he threw the fake bomb into the stands, seeing them step over and push each other to escape. He can be bold and daring even towards the Yonko, as shown when he burned the Red Hair Pirates' Jolly Roger (unaware of their connection to Luffy)."}, {"type": "paragraph", "text": "However, Bartolomeo seems to care for his crew, as he violently beat up Vice Admiral Maynard for what he did to Gambia. That aside, it is this particular course of violence that has made him infamous, as he was noted to have gunned down several innocent civilians in the past. Despite such a destructive nature, he can restrain his murderous rage to a certain extent, at least by the regulations set by the Corrida Colosseum. While he is very laid-back, he is not immune to expressing shock as such when he heard that Luffy is around."}, {"type": "paragraph", "text": "Despite the cruelty he shows to others, he has immense respect for the Straw Hat Pirates. After witnessing Luffy's miraculous survival on the execution stand in Loguetown two years ago, Bartolomeo became a massive fan of Luffy's and views him as his hero, even to the point of worshipping him. After following Luffy's exploits up until the Battle of Marineford, he was inspired to start his life of piracy. His respect for Luffy is so deep that he gets angry and attacks people who mock Luffy, as seen when he squashed a man against a wall with his Devil Fruit powers and even cuts the man's tongue right after he badmouthed Luffy. Bartolomeo also expressed shyness towards Luffy as he hesitated to speak to him face to face. Bartolomeo has been shown to get easily excited when he sees the people he idolizes as when he saw Zoro, he burst into tears out of joy. He weeps uncontrollably even when doing something as simple as asking Zoro for an autograph. When he came face to face with Luffy, he screamed in joy. It has been revealed that he only entered the tournament in order to win the Mera Mera no Mi and give it to Luffy."}, {"type": "paragraph", "text": "Bartolomeo has been shown to have some honor, as he saved Bellamy from being brutally killed by Dellinger. Even though he and Bellamy fought against each other in the tournament, Bartolomeo stated that those who fought together are friends and he would not let a friend die without helping."}, {"type": "paragraph", "text": "Bartolomeo has a distinct speech style, ending his sentences with \"-dabe\". This particularity in his speech doesn't seem to mean anything."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/79/Shy_Bartolomeo.png/revision/latest/scale-to-width-down/210?cb=20141206072138", "caption": "Bartolomeo becomes shy in the presence of \"Luffy-senpai\"."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Bartolomeo seems to care deeply for his crew, as seen with the scene between him, Gambia, and Maynard."}, {"type": "paragraph", "text": "He appears close with his crew, as they share his admiration for the Straw Hats and joined him in celebrating their voyage with them to Zou."}], "images": []}, {"title": "Gambia", "level": 4, "content": [{"type": "paragraph", "text": "Bartolomeo seems to care for him greatly since he beat up Maynard for knocking out his ship mate."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Bartolomeo, an original admirer of Luffy from the time of Loguetown and onward, admires the crew in its entirety, saying he followed all of their actions and acted dumbfounded when he met Luffy and Zoro. He refers to both of them as '-senpai'. When Doflamingo put a price on their heads during his survival game, Bartolomeo did not turn on them like the former toys who swore their loyalty to Usopp."}, {"type": "paragraph", "text": "Bartolomeo's admiration for the Straw Hats has gone to the extent that he's willing to put himself in harm's way for them. While fighting Gladius, he took the shots aimed at Luffy and later got himself severely injured trying to protect Robin, and openly cried out in mourning when it appeared Gladius had successfully killed her but was relieved she was alright."}, {"type": "paragraph", "text": "Bartolomeo has also displayed in-depth knowledge of the Straw Hats. He is somehow aware of the Straw Hats involvement in Alabasta even though the world government tried to cover it up. Though he didn't know Sogeking's true identity until he met Usopp, he knew the true events of what happened at Enies Lobby, despite the newspapers claiming it to be a random attack."}, {"type": "paragraph", "text": "Bartolomeo also gave Luffy's group a ride to Zou and happily parted ways with them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Bartolomeo_Admires_the_Straw_Hat_Pirates.png/revision/latest/scale-to-width-down/180?cb=20140622182350", "caption": "Bartolomeo admires the Straw Hat Pirates."}]}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Two years ago, when a stray lightning bolt saved Luffy from being executed, Bartolomeo was in the crowd and was amazed by the spectacle. He followed all of the news about Luffy and the rest of his crew, up until the war at Marineford, which inspired him to quit as the head of the mafia he ran and start a life of piracy. He even traveled to Dressrosa for the sole reason to acquire the Mera Mera no Mi to give to Luffy as a present. After his Block B fight, Bartolomeo heard a man criticize Luffy. Bartolomeo proceeded to scold the man and cut off his tongue, portraying the severity of Bartolomeo's obsession and respect of Luffy. He sincerely believes that Luffy will become the next Pirate King."}, {"type": "paragraph", "text": "When he met Luffy, he could barely speak and fainted multiple times. After a while, he managed to gain the confidence to talk to the young pirate but wasn't able to look at him, or else he would faint again. When someone approached Luffy and Bartolomeo, saying that neither of them would get Ace's Devil Fruit, Bartolomeo sprung to fight the man, showing that he is willing to do anything and fight anyone for the potential future pirate king."}, {"type": "paragraph", "text": "After the Dressrosa incident in which Luffy defeated Doflamingo, Bartolomeo was among the seven representatives to swear fealty to Luffy and the Straw Hat Pirates, under the Straw Hat Grand Fleet. Luffy, however, rejected the offer, not wanting to suddenly command a gigantic crew, but wants to remain friends with the fleet. He told them that his goal to be Pirate King is not to be the most powerful, but rather the most free. This only furthered Bartolomeo's respect for Luffy and he swore his allegiance to Luffy. He then gave Luffy and the other Straw Hats a ride to Zou on his ship before parting ways with the Straw Hats while promising to honor the crew's name. Bartolomeo was also overjoyed when Luffy thanked him for the ride while referring to the latter by his name which excited Bartolomeo who excitedly stated it was no problem as he said his goodbyes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Bartolomeo_at_Loguetown.png/revision/latest/scale-to-width-down/180?cb=20141206073223", "caption": "Bartolomeo watching Luffy in Loguetown."}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "As a notorious pirate and a crazy Rookie, Bartolomeo is the enemy of the World Government."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "As a pirate, Bartolomeo is an enemy of the Marines. After Vice-Admiral Maynard injured Gambia, Bartolomeo quickly retaliated against the Marine officer and knocked him out."}], "images": []}, {"title": "Donquixote Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Bartolomeo made an enemy of the crew when he protected Bellamy from Dellinger. His interference caused the young pirate officer to swear revenge on him but he was not fazed by the threat. During the Birdcage game, Bartolomeo chose to help fight Doflamingo's crew and defeated Gladius during the battle."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Though they never met, he officially declared war against the Red Hair Pirates by burning their flag. This also signifies that Bartolomeo has no knowledge of the relationship between Luffy and Shanks."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Bellamy", "level": 4, "content": [{"type": "paragraph", "text": "Bartolomeo has an interesting relationship with Bellamy. The two originally were enemies in the Block B fight, and Bartolomeo seemed to enjoy knocking Bellamy to the ground. However, when Dellinger was ordered to kill Bellamy, Bartolomeo came to his rescue and protected him with his Devil Fruit abilities until the angry pirate officer left. When Bellamy asked why he had saved him, Bartolomeo said they were “friends” for fighting on the same battlefield and that he would stick up for him when he needed it."}, {"type": "paragraph", "text": "They met again when the Straw Hats had to flee from the Marines, with Bartolomeo reminding him of their friendship when he was angry at being saved by Law."}], "images": []}, {"title": "Sabo", "level": 4, "content": [{"type": "paragraph", "text": "Initially, Bartolomeo was hostile towards Sabo when he stated he won't allow Luffy to have the Mera Mera no Mi. He was ready to fight the latter (not knowing his relationship to Luffy) only to be pushed aside by him. When Sabo revealed himself as Luffy's other brother, Bartolomeo was surprised and due to this, he treats Sabo with great respect, referring to him as 'great senpai'. Though Sabo respects Bartolomeo to some extent because of his willingness to help Luffy, he found his obsession with the Straw Hats annoying. When Doflamingo placed a price on Sabo's head after trapping everyone on Dressrosa in his survival game, Bartolomeo did not betray him and assisted the revolutionary instead."}], "images": []}, {"title": "Cavendish", "level": 4, "content": [{"type": "paragraph", "text": "Initially, Cavendish was Bartolomeo's enemy due to competing in the tournament for the Mera Mera no Mi and due to Cavendish desiring to kill Luffy at the time. However, during the Doflamingo's Birdcage survival game, they cooperate to defeat the Donquixote Family."}, {"type": "paragraph", "text": "Bartolomeo and Cavendish display a rivalry that is not unlike Sanji's and Zoro's. While they do fight well as a team, as shown in their fight against Gladius when Bartolomeo lets Cavendish in and out his barrier so he can attack Gladius and get to safety from his attacks, they constantly argue with each other over their respective attitudes."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "Despite his connection to Luffy, Bartolomeo treats Law with his usual disdain. He openly told Law that he threw his bounty poster away, and refused to give Law provisions when he asked for some until he said it was for Luffy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a pirate captain, he has the power to command his subordinates. He is a Supernova, recognized by the Marines, meaning that he has some skills that made him stand out. He is shown to be strong enough to easily defeat Vice Admiral Maynard, and was able to win the Block B of the Corrida Colosseum tournament without getting so much as a scratch (though he was actually laying on the sidelines watching while avoiding conflict until he was forced to use his barriers). "}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Bartolomeo is tenacious with a great amount of durability, as shown when he took a point blank explosion by Gladius' attack. Not only did he remain conscious but he was able to defeat the executive. Bartolomeo is also physically extremely strong and skilled in hand to hand combat. In the anime, he is shown to have self taught himself Luffy's Gomu Gomu fighting techniques which he adapted into his own barrier enhanced version of Luffy's fighting style. By encasing his fist in a small hard barrier similar to a boxing glove, Bartolomeo could punch with extreme force, able to knock Gladius out in one hit. Even without his Devil Fruit abilities, Bartolomeo could easily defeat Hack, an exceptionally strong fish-man with a vicious kick to the face."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Bartolomeo ate the Bari Bari no Mi, a Paramecia type Devil Fruit which allows him to be a Barrier Human. He uses his Devil Fruit powers both to protect himself and attack his opponents. His barriers are seemingly indestructible, as attacks from powerful individuals such as Hack, Bellamy, and Gladius had no effect, and even Elizabello II's \"King Punch\" could not damage the barrier."}, {"type": "paragraph", "text": "His barriers are far from being restricted to defense, as he can utilize them in various versatile ways. He can send the barriers forward with great force to smash or crush his enemies, or alter their shape to form platforms."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries a dagger with him, though he has only been seen using it twice. Once when he cut off the tongue of a Corrida Colosseum contestant who insulted Luffy, and the second time was when he tried to kill Gladius, in an attempt to save Nico Robin."}], "images": []}, {"title": "Bombs", "level": 4, "content": [{"type": "paragraph", "text": "He is also shown to carry around fake bombs that can be used as a scare tactic, as when he threw one at the audience in Corrida Colosseum. He can also use real ones in One Piece: Burning Blood."}, {"type": "list", "elements": [{"text": "See you in hell!: Bartolomeo will throw either a fake bomb or real bomb at his opponent. If either hits the target it will fall to the ground after hitting them and if it is a real bomb it will explode a couple seconds afterwards, damaging the opponent or Bartolomeo if they are near it. The fake version of this attack was used against the audience in Corrida Colosseum. This technique appears as one of Bartolomeo's special attacks in One Piece: Burning Blood.", "elements": []}]}], "images": []}, {"title": "Video Game Only", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bartolomeo the Cannibal (人食いのバルトロメオ, Hitokui no Barutoromeo?): A technique where Bartolomeo taunts the enemy to power himself up. It appears in One Piece: Burning Blood as one of Bartolomeo's special attacks. Its name comes from Bartolomeo's epithet.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story.  Bartolomeo was friends with Desire when they were growing up, and they planned to go out to sea and reach the top together. Two years ago, Bartolomeo changed his dream after seeing Luffy at Loguetown and decided to help Luffy become Pirate King as a result, causing Desire to set off to sea without him."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "During his early years, Bartolomeo was a kingpin of a mafia. Two years ago, he was at Loguetown when Luffy was about to be executed by Buggy. He witnessed what he called a miracle, seeing Luffy getting saved by a lightning strike. Ever since then, Bartolomeo followed Luffy's exploits from Alabasta, to Enies Lobby to Impel Down. After seeing Luffy at the Battle of Marineford, he decided to set sail."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year ago, Bartolomeo became a big time rookie pirate. He became infamous for attacking innocent civilians."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Bartolomeo entered a tournament at the Corrida Colosseum to compete for the Mera Mera no Mi. After Maynard defeated Bartolomeo's subordinate, Gambia, Bartolomeo in turn defeated the vice admiral, before leaving to fight in the tournament."}, {"type": "paragraph", "text": "As Block B was about to start, he was seen walking into the arena while the announcer listed all the details about him. Upon entering, he declared that he would send everyone to hell. As the audience showed their dislike towards him, Bartolomeo first taunted them and then threw what appeared to be a bomb at the audience, which scared them and made them panic. The bomb turned out to be a simple black ball though. After having mumbled that the audience disgusts him, Dagama scolded him and told him that he's making himself unpopular. Bartolomeo simply responded that he didn't need to be popular among the likes of them."}, {"type": "paragraph", "text": "After the fight started, Bartolomeo pointed out that it is not really a battle royale anymore when Dagama was shown to have teamed up with Elizabello II, Tank Lepanto, and other fighters to take out Bellamy. Dagama simply stated that the ends justify the means. While everyone fought, Bartolomeo was seen laying down and nonchalantly watched the others fight."}, {"type": "paragraph", "text": "Later, he calmly started urinating off the side of the ring only to be booed by the crowd. Hack came to take him out with a Fish-Man Karate attack, but Bartolomeo blocked it using his Devil Fruit ability, damaging Hack's hand in the process. Bartolomeo then proceeded to finish off the fish-man."}, {"type": "paragraph", "text": "Bartolomeo later fought against Bellamy. However, like Hack, Bellamy ended up taking damage whenever he attempted to attack Bartolomeo. Despite not having the upper hand, Bellamy still managed to grab him, saying that he should not underestimate his power. Before Bartolomeo could retaliate, Elizabello finally threw his legendary \"King Punch\" which seemingly took out every remaining gladiator in the arena. When the announcer looked at the arena and said that no one could have possibly survived that punch and was about to declare Elizabello the winner of B block's battle royale."}, {"type": "paragraph", "text": "However, when the smoke cleared up, it was revealed that Bartolomeo remained standing. He then revealed that he ate the Bari Bari no Mi, which allowed him to create barriers and that he used one to protect himself from the king's devastating punch. He then defeated the king with his technique \"Barrier Crash\" which effectively made him the winner of the B block, much to the crowd's displeasure. He then thought to himself about how the Mera Mera no Mi would go to 'that person' once he won it."}, {"type": "paragraph", "text": "As the injured fighters were moved out of the ring, Bartolomeo came across Bellamy and Luffy (as Lucy) having a conversation and overheard Bellamy calling him Straw Hat. Upon learning of this revelation he showed signs of shock."}, {"type": "paragraph", "text": "During Block C, Bartolomeo went to the observation deck and approached Cavendish with a suitcase full of warning signs while the latter was having a fancy meal. Bartolomeo noticed that Cavendish was aiming for Luffy (as Lucy). Cavendish congratulated him for his win and told him not to stick his nose into his business. While trying to grab some of Cavendish's food, Cavendish removed Bartolomeo's hand from his food and told him that Luffy will be his prey. Bartolomeo responded by saying that he and Luffy have a far deeper connection. He continued to watch Block C as Luffy and Chinjao, the two remaining fighters in the battle royale, clashed against each other."}, {"type": "paragraph", "text": "After Luffy defeated Chinjao and won Block C, Cavendish aimed to kill Luffy the moment he left the arena. Bartolomeo interrupted Cavendish, and once again claimed that he would not be the one to kill the Straw Hat. Cavendish angrily threatened Bartolomeo to not get in his way."}, {"type": "paragraph", "text": "While Cavendish tried to kill Luffy after Block C's conclusion, Bartolomeo kept his distance, too shy to get close to Luffy. A gladiator passed by and mocked Luffy for failing to save his brother at the Battle of Marineford. Bartolomeo angrily crushed the man against a wall, and explained his reasons for admiring Luffy, and then cut the man's tongue. He continued to watch Luffy from afar as he fended off Cavendish. He wanted to help Luffy, but he was too nervous to bring himself close to him. When Luffy ran away from Cavendish and Chinjao, Bartolomeo wondered how he should go about approaching Luffy."}, {"type": "paragraph", "text": "While Zoro and Kin'emon were outside of the Corrida Colosseum wondering how to get in, Bartolomeo spotted them. Upon seeing Zoro, Bartolomeo burst into tears of joy as he recalled Zoro's past deeds. He then spoke to Zoro and offered to help him find Luffy while asking for an autograph. He later found Luffy when the Straw Hat left the gladiators quarters. He then guided Luffy to Zoro and Kin'emon but foamed at the mouth along the way."}, {"type": "paragraph", "text": "When Bellamy was about to be killed off by Dellinger, Bartolomeo got in the way and protected Bellamy with his barrier, much to the fury of Dellinger. Having been called away by Diamante, Dellinger angrily walked away, swearing that Bartolomeo and Bellamy won't leave Dressrosa alive."}, {"type": "paragraph", "text": "Bartolomeo then offered to take Bellamy to the medical room, but Bellamy rejected his offer, tearfully stating that he has nothing to live for and questioned Bartolomeo's reason for helping him. Bartolomeo stated that those who fought together are \"friends\" and he would not let a friend die without helping. As Bartolomeo carried Bellamy around, they ran into Luffy, who was looking for an exit. Since Luffy needed to leave the tournament in order to rescue a friend, Bartolomeo proudly declared that he will win the Mera Mera no Mi for Luffy. His conversation was interrupted by a stranger who stated that the Mera Mera no Mi could not be given to Luffy. Bartolomeo responded with anger, explaining that he had no right to speak to the brother of \"Fire-Fist Ace\" and the future Pirate King in such a manner. The stranger responded that he knew these things about Luffy already and pushed Bartolomeo aside. Bartolomeo was annoyed watching the stranger, revealed to be Sabo, having a casual conversation with Luffy."}, {"type": "paragraph", "text": "He was later seen standing next to Sabo (now taking Luffy's place as Lucy) at the observation deck. At the conclusion of Block D, Bartolomeo was surprised to see every big name fighter struck down almost instantaneously. He then saw Rebecca, the only one able to stand back up, declared the winner of Block D. When Rebecca waved to \"Lucy\" after leaving the arena, Bartolomeo told her not to act casual towards him. He then walked alongside Sabo to the arena when the finals started."}, {"type": "paragraph", "text": "Once the block winners and Diamante were present in the arena, they were interrupted when some of the disqualified participants from Block D charged in, refusing to accept that Rebecca was the winner. Bartolomeo then witnessed Diamante repelling them using the power of his Hira Hira no Mi. After Diamante explained the rules of this round, a five-person battle royale commenced."}, {"type": "paragraph", "text": "When Jesus Burgess prepared to launch an attack against Sabo, Bartolomeo found Rebecca standing behind him. When Sabo shattered Burgess's armor, Bartolomeo was struck with awe from witnessing his self-proclaimed idol's strength. Later, when Rebecca took a blow from Diamante, Sabo asked Bartolomeo to protect her, much to his surprise. Per Sabo's request, Bartolomeo safeguarded Rebecca while Diamante demoralized her with the revelation that he was behind her mother's death, causing her to break down in tears."}, {"type": "paragraph", "text": "As the toys in the audience transformed back into their original forms, Bartolomeo asked Rebecca how long she was going to keep crying. He looked confused as Rebecca exclaimed that she remembered her father and even more bewildered as Sabo prepared to demolish the arena. When Sabo grabbed the Mera Mera no Mi and ate it, Bartolomeo begged Sabo to help him as the arena collapsed into the underground. When Sabo used Hiken and destroyed the arena, Bartolomeo fell into the underground trade port. Bartolomeo used his barriers to protect himself from injuries. He later rushed to Sabo and scolded him for not trying to save him from falling."}, {"type": "paragraph", "text": "He later watched in shock as Doflamingo trapped Dressrosa in his \"Birdcage\" and created a \"game\" which gives everyone a choice to either kill him or a list of people he offers to them. Bartolomeo expressed his excitement in meeting Robin and Usopp much to Sabo's annoyance. Doflamingo then announced his hit list, which includes Sabo, Usopp, and Robin. When Usopp's followers turned against them, Bartolomeo, Sabo, Koala, Hack, Robin, Usopp, Rebecca, and the Tontatta dwarves fled to the surface. Bartolomeo used his barriers to hold back their pursuers. They later reached the colosseum stands and Bartolomeo continued aiding their escape."}, {"type": "paragraph", "text": "They eventually arrived at the top of the old King's Plateau where they met up with Riku Doldo III, Viola, and Tank Lepanto. Bartolomeo was surprised that Luffy already left to go after Doflamingo. When Rebecca volunteered to deliver the key to Law's seastone handcuffs to Luffy, Bartolomeo excitedly asked to come along. When Robin contacted Luffy through Den Den Mushi, Bartolomeo, Robin, Rebecca, and Leo planned to meet Luffy at the sunflower garden on the fourth level of the new King's Plateau."}, {"type": "paragraph", "text": "Leo then planned to travel to the new King's Plateau with the assistance of the beetles of the Tontatta Airlines Yellow Cab. Rebecca, Robin, and Bartolomeo were uncertain of the idea since the beetles seem too small to carry a person. Leo then explained that the beetles are the Tontatta Airlines \"jumping\" service and made them jump down from the old King's Plateau. To their amazement, the beetles can decelerate their fall and they learned that they could use the beetles to jump from rooftop to rooftop. Leo reminded them to aim for the fourth level and warned them to watch out for attacks from below."}, {"type": "paragraph", "text": "They later reached the giant Pica statue while Zoro was battling Pica. Bartolomeo was excited to see Zoro again. Pica prepared to throw a colossal punch at Bartolomeo, Robin, and Rebecca with the statue and Bartolomeo panicked because he could not make a barrier big enough to block the attack. When Zoro stopped Pica with a powerful sword slash, Bartolomeo was utterly amazed."}, {"type": "paragraph", "text": "Bartolomeo, Robin, and Rebecca then passed the giant stone statue and continued onwards to the fourth level. While flying over the second level, the group was attacked by Gladius. Robin and Bartolomeo were subsequently separated from Rebecca, Leo, and Kabu. Bartolomeo and Robin then landed on the third level where Luffy, Law, Kyros, and Cavendish were. Bartolomeo and Robin faced off against Gladius and an army of giant toys to enable Luffy, Law, Kyros, and Cavendish to continue towards the fourth level."}, {"type": "paragraph", "text": "After blocking Gladius' rupture bullets, Bartolomeo used his barriers to create a stairway to the fourth level. Luffy thanked him, causing Bartolomeo to shed tears of joy. When Gladius launched his explosives at Luffy, Bartolomeo jumped into the line of fire. When Cavendish asked him why he did not use his barrier to block the attack, Bartolomeo revealed that his barriers can only cover a limited surface area. When one of the giant toys was about to chomp on Bartolomeo, Robin repelled it. After Robin knocked away all the giant toys in the vicinity, Bartolomeo got back up, ready to rejoin the battle."}, {"type": "paragraph", "text": "When the toys turned back into humans after Sugar's second defeat, Bartolomeo claimed that he got his barrier back. He was next guarding Robin as she made her way to level 4."}, {"type": "paragraph", "text": "While Gladius was preparing for an explosive and destructive attack by swelling and inflating the ground around them, Cavendish asked Bartolomeo to allow him to get behind his barrier. Bartolomeo initially refused and Cavendish yelled that they were on the same side. Fortunately for Cavendish, Bartolomeo allowed him to get behind his barrier the moment Gladius initiated his attack. After reprimanding Bartolomeo for not saving him sooner, Cavendish asked to be let out again so he can continue fighting Gladius. Gladius then noticed Robin making her way up to level 4. He tried to gun her down, but Bartolomeo blocked the shots with his barrier. Robin winked at Bartolomeo in gratitude, making him very happy. Cavendish was about to strike Gladius but was interrupted when Bartolomeo came charging with his barrier, plowing and rending a significant portion of the terrain all within it in the process."}, {"type": "paragraph", "text": "Some time later, Cavendish turned into Hakuba and Bartolomeo remained behind his barrier while Hakuba went on a rampage."}, {"type": "paragraph", "text": "While seeing Hakuba, Bartolomeo realized what happened at the end of Block D. Hakuba attempted to attack him, but his barriers blocked the attack. Hakuba then set his sight on Robin, but she easily stopped him, much to Bartolomeo's amazement. Just then, Gladius began to rupture the cliff they were on. Bartolomeo tried to stop him, but Gladius hit him with poison-coated needles. Gladius then inflated his whole body, stating if Bartolomeo wished to save them, he must defeat him first. Bartolomeo shouted at Cavendish to protect Robin, but Hakuba regained control. Out of options, Bartolomeo charged at Gladius and trapped them both in a barrier intending on taking Gladius down before he detonates while slitting his throat with a knife. Gladius exploded, but he survived, having only been stabbed in his shoulder. Gladius then exploded the cliff, but Cavendish saved both himself and Robin using Hakuba's speed. Bartolomeo, now badly injured from the explosion, lamented that the he is still lacking in power, but promised that someday he will become someone that Luffy can rely on. He jumped into the air and landed a \"Bari Bari no Pistol\" (as homage to Luffy) directly into Gladius face, defeating him. He then fell exhausted, commenting that he never wanted to work together with Cavendish again."}, {"type": "paragraph", "text": "A short time later, Bartolomeo saw two of the Donquixote Family subordinates carrying away Gladius' body. He initially reacted in fury, but they pleaded with him to spare them, saying that they were only there to take away the defeated. They elaborated that Gladius would need medical attention for two or three days before he could awaken. Bartolomeo then impatiently told them to leave."}, {"type": "paragraph", "text": "He was later surprised to see Pica heading towards the Old King's Plateau using the giant Pica statue. Upon witnessing Zoro defeating Pica, Bartolomeo was so awestruck at Zoro's impressive feat of strength that he screamed in excitement, foaming at the mouth. Bartolomeo continued to foam at the mouth, even when Cavendish told him to create a stairway for Robin, Kyros, Rebecca, Leo, Kabu, and Mansherry to climb down. Shortly after, Bartolomeo, Kyros, Rebecca, and Robin joined up with their allies."}, {"type": "paragraph", "text": "Later, Bartolomeo and the other gladiators defeated the remaining Donquixote Pirates so that the citizens could get onto the palace plateau. Bartolomeo then prepared to stall the Birdcage after Doflamingo increased its speed."}, {"type": "paragraph", "text": "Bartolomeo then created a barrier which he, Robin, and the gladiators can use to push back the Birdcage. When Luffy regained his strength after being worn out for ten minutes, Bartolomeo cried with tears of joy. Once the Birdcage finally disappeared and Gatz announced Luffy's victory, Bartolomeo cried with happiness. Later that night after the aftermath, Bartolomeo and the other gladiators were seen resting at the palace."}, {"type": "paragraph", "text": "Three days after Doflamingo's downfall, Bartolomeo rushed to Kyros' house to see Luffy and his group. He informed them of Tsuru and Sengoku's arrival. When the Marines were mobilized to pursue Luffy and all those affiliated with him, Bartolomeo explained that an escape route was prepared. They then fled when the Marines were about to storm Kyros' house. Bartolomeo then noticed that Luffy stayed behind to settle some unfinished business."}, {"type": "paragraph", "text": "Bartolomeo then led the Straw Hats to the eastern port. While waiting for Luffy, he panicked when he saw Fujitora approaching. With all the fighters gathered, they prepared to stand their ground against the Admiral with Bartolomeo putting up a barrier. When Fujitora prepared to strike them with all the rubble from Dressrosa, the fighters quickly fled to the escape ship. Bartolomeo was greatly shocked when he witnessed Luffy attacking Fujitora with a Haki-imbued Gear Third attack."}, {"type": "paragraph", "text": "During the clash, Issho used his gravity ability to blow away Luffy, who was then caught by Hajrudin. Zoro prepared to fight the admiral, but Bartolomeo stopped him, saying that it was not the right time or place. The fighters and Straw Hats quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after Luffy. They eventually reached Orlumbus' flagship, the Yonta Maria. After boarding the ship, Bartolomeo's crew was then one of the seven groups that pledged their allegiance to the Straw Hats."}, {"type": "paragraph", "text": "When Luffy was asked to drink a sake cup to complete the agreement for an alliance, Luffy declined, much to the others' shock. Once Luffy explained that they can do whatever they want, the allies decided to forge the alliance anyway, forming the Straw Hat fleet. Sai, Bartolomeo, Leo, Cavendish, Ideo, Orlumbus, and Hajrudin sat down and drank their sake cups. Afterwards, they held a feast to celebrate their victory over Doflamingo."}, {"type": "paragraph", "text": "Afterwards, each of the leading allies received Luffy's vivre card and parted ways. Bartolomeo then brought the Straw Hats, the samurais, and Law to his ship, the Going Luffy-senpai. After Zoro noticed the Straw Hats' increase in bounty from a newspaper, Bartolomeo proudly showed Luffy's group their new wanted posters. He also informed Law that his bounty also increased. While showing the wanted posters he got on display, Bartolomeo noted that there is something unusual about Sanji's new wanted poster."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Bartolomeo_Power.png/revision/latest/scale-to-width-down/210?cb=20170904223329", "caption": "Bartolomeo creating an invisible barrier to block Hack's attack and crush his hand before defeating him."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Barrier_Crash.png/revision/latest/scale-to-width-down/210?cb=20150823144901", "caption": "Bartolomeo defeats Elizabello II and wins B Block."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/89/Bartolomeo_Threatens_a_Noble.png/revision/latest/scale-to-width-down/210?cb=20141206211109", "caption": "Bartolomeo gets angry at a gladiator for mocking Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7f/Bartolomeo_and_Dellinger.png/revision/latest/scale-to-width-down/215?cb=20140928201255", "caption": "Bartolomeo thwarting Dellinger's attempt to kill Bellamy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Sabo_Confronts_Bartolomeo_and_Luffy.png/revision/latest/scale-to-width-down/210?cb=20141206205445", "caption": "Bartolomeo meeting Sabo"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8a/Journey_on_the_Yellow_Kabu.png/revision/latest/scale-to-width-down/210?cb=20160615163230", "caption": "Bartolomeo, Rebecca, and Robin travel to the palace on the Yellow Kabu."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/66/Bartolomeo_Defeats_Gladius.png/revision/latest/scale-to-width-down/200?cb=20151011140929", "caption": "Bartolomeo defeats Gladius."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Revived_Gladiators_Defeat_Donquixote_Pirates.png/revision/latest/scale-to-width-down/210?cb=20161221120222", "caption": "Bartolomeo and the other gladiators defeat the remaining Donquixote Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/20/Straw_Hat_Grand_Fleet.png/revision/latest/scale-to-width-down/210?cb=20160613115353", "caption": "Bartolomeo and six other captains pledge their allegiance to Luffy."}]}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Silver Mine Arc", "level": 4, "content": [{"type": "paragraph", "text": "As night fell, the Barto Club and Straw Hats fell asleep on the Going Luffy-senpai's deck. Luffy got up to get food, and Bartolomeo got up and followed him, wanting to assist him in anything. Suddenly, Luffy grabbed a flying piece of meat, and Bartolomeo grabbed onto him, causing them to be dragged into a platoon of Battle Boats. A dazed Bartolomeo saw a faint outline of a familiar face as he and Luffy were taken away."}, {"type": "paragraph", "text": "They were taken to the deserted island of Silver Mine, and Bartolomeo was separated from Luffy and forced to mine for ore with his hands stuck to a pickax, preventing him from making barriers. Later, Bartolomeo escaped and came to the Silver Pirate Alliance's auditorium in order to prevent Luffy, who was encased in a silver ball, from being executed by Bill. Bartolomeo fended off the Silver Pirate Alliance with his pickax, but it was suddenly broken by the woman who captured them, whom Bartolomeo recognized as Desire. As he and Luffy were cornered, Luffy made a charge and the two of them managed to escape."}, {"type": "paragraph", "text": "As they rested outside, Bartolomeo promised to protect Luffy and revealed that Desire was his childhood friend. They were then pursued by Desire and her crewmates, and Bartolomeo refused Desire's offer to spare him in exchange for Luffy. Desire shot at Bartolomeo and Luffy, causing a chasm to form which the three of them fell into."}, {"type": "paragraph", "text": "Bartolomeo, Luffy, and Desire survived the fall, but were attacked and pursued by Bill's subordinate Aveyron. Bartolomeo and Desire ran on top of Luffy's ball, and they eventually careened into a large chasm. The fall did not break Luffy's silver ball, and Desire bragged that Bill's work could not be broken that easily, causing Bartolomeo to question her loyalty to him after his subordinate attacked her. Desire told Bartolomeo that he betrayed her after deciding to help Luffy, and when Bill rescued her from an attack, she found someone with her ideologies. The trio was found by a group of miners, who took them to their mining colony. Bartolomeo dipped his hands in hot water to remove the sticky substance, and picked up his speed when Aveyron arrived. Desire battled Aveyron and accidentally deflected one of his bombs into Bartolomeo and the miners, dazing them. As Luffy was freed and pursued Aveyron, Bartolomeo followed him into a cave. They chased Aveyron despite several twists and turns, and Bartolomeo created a barrer track that sent Aveyron flying into the air, allowing Luffy to defeat him. Bartolomeo, Luffy, and Desire then prepared to escape the mine."}, {"type": "paragraph", "text": "They ascended a train track leading to the exit along with the miners, but were confronted by Peseta and his men, who fired cannonballs at them. The cannonballs caused the track they were on to collapse, but Bartolomeo shielded his allies from the falling wreckage and sent it flying at Peseta. He then created a barrier staircase leading outside, but to his shock he realized he could not make any more barriers to protect them from Peseta's cannons. The pirates and miners managed to escape from the cannon shots, but some Silver Pirate Alliance members arrived at the exit and shot molten ore at them. Suddenly, Kin'emon arrived and cut through the molten ore, allowing Luffy to take out the enemy pirates and letting the pirates and miners escape. They were confronted by Peseta again, but Zoro arrived to confront him. Peseta mocked Zoro, which angered Bartolomeo, but Luffy prevented him from interfering in Zoro's fight. Zoro defeated Peseta, and Bartolomeo prepared to escape to the Going Luffy-senpai. However, Bill arrived and cut off Bartolomeo and Luffy from Kin'emon and Zoro, and the two decided to confront Bill along with Desire."}, {"type": "paragraph", "text": "Bartolomeo and Desire watched as Luffy overwhelmed Bill and punched him into the underground mine, and they then began escaping. However, Bill returned as a giant that exuded waves of molten ore due to eating a lot of ore. Bill shot several waves of molten ore at the trio, and Bartolomeo blocked them with a barrier, but the molten ore began surrounding the trio. Desire fell into a chasm, but Bartolomeo caught her, not willing to let his friend die even for Luffy. Bartolomeo pulled Desire up in time for him to block another wave of molten ore, and the trio wondered how to deal with the encroaching molten ore. Bartolomeo then formed a barrier hand and pushed the ore back to Bill, which covered him in silver. Bill prepared to attack the pirates, but he was defeated by Luffy. The trio then escaped on Desire's battle boat as Silver Mine sank, and they returned to the Going Luffy-senpai. Bartolomeo asked Desire's crew to join his, but Desire declined, still wanting to pursue her own dream. The Sweet Pirates then set off as the Barto Club and Straw Hats prepared to sail for Zou."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Bartolomeo_Fights_the_Silver_Pirates.png/revision/latest/scale-to-width-down/210?cb=20160626203914", "caption": "Bartolomeo protects Luffy from the Silver Pirate Alliance."}]}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "During a hail storm, Bartolomeo revealed that his crew does not have a navigator and they usually called Gambia's granny to solve their problems. With her giving them useless advice, they needed to rely on the Straw Hats to protect the ship. After one week of traversing through the dangers of the New World, the ship arrived at Zou."}, {"type": "paragraph", "text": "After finding and admiring the Thousand Sunny, Bartolomeo and his crew tearfully bid farewell to Luffy and his group."}], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "Bartolomeo and his crew later visited an island and they announced their intention to cause a ruckus. He then defeated the leader of a gang at the port. Later, Bartolomeo was shown selling Straw Hat memorabilia to the island's citizens. As he was advertising his merchandise, Bartolomeo was then shown Shanks' pirate flag, which was hanging above the town. In a daring act, Bartolomeo and Gambia then burned Shanks' flag, much to the horror of the citizens."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Bartolomeo_and_Gambia_burn_Red_Hair_Pirates%27_flag.png/revision/latest/scale-to-width-down/200?cb=20180927171438", "caption": "Bartolomeo and Gambia burn the flag of the Red Hair Pirates."}]}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Bartolomeo acted proud as a journalist was interviewing him."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo along with his crew."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bartolomeo vs. Maynard (unseen)", "elements": []}, {"text": "Bartolomeo vs. Corrida Colosseum Block B Gladiators", "elements": [{"text": "Bartolomeo vs. Hack", "elements": []}, {"text": "Bartolomeo vs. Bellamy", "elements": []}, {"text": "Bartolomeo vs. Elizabello II", "elements": []}]}, {"text": "Bartolomeo vs. Dellinger", "elements": []}, {"text": "Bartolomeo vs. Usopp's former followers", "elements": []}, {"text": "Bartolomeo, Nico Robin, and Cavendish vs. Gladius and Headcrackers", "elements": []}, {"text": "Bartolomeo and Cavendish vs. Gladius", "elements": []}, {"text": "Bartolomeo vs. Gladius", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bartolomeo vs. Boss Class Fighting Fish", "elements": []}, {"text": "Bartolomeo vs. Silver Pirate Alliance", "elements": []}, {"text": "Bartolomeo and Monkey D. Luffy vs. Aveyron", "elements": []}, {"text": "Bartolomeo vs. Peseta", "elements": []}, {"text": "Bartolomeo and Luffy vs. Bill", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "His confrontation with Maynard was shown in the anime, which started as a short conversation before their fight. The anime also showed Maynard attempting to attack Bartolomeo and the latter crossing his fingers, hinting at his ability before Maynard is defeated. Bartolomeo's face was also revealed just prior to his fight with Maynard instead of when he entered the arena."}, {"type": "paragraph", "text": "His fight against Hack was censored. In the manga, Hack's fist was damaged and bloody while in the anime, the blow was made off-screen."}, {"type": "paragraph", "text": "When he threatened the man who mocked Luffy for not being able to save Ace in the manga, he stabbed the man's tongue. In the anime, he beat the man up instead."}, {"type": "paragraph", "text": "The anime also added the following scenes:"}, {"type": "list", "elements": [{"text": "Before going to find Luffy, Bartolomeo thought of meeting other members of the Straw Hats during which it is shown he is aware of Brook being a member.", "elements": []}, {"text": "Bartolomeo also visited the medical room where he mocked the defeated colosseum fighters.", "elements": []}, {"text": "When Dellinger attempted to kill Bellamy, the moment Bartolomeo comes to save the latter is shown.", "elements": []}, {"text": "Before Luffy's allies sleep at the Dressrosa royal palace, Bartolomeo placed Cavendish in chains to prevent Hakuba from rampaging. The manga, on the other hand, did not show who chained Cavendish.", "elements": []}]}], "images": []}, {"title": "Knowledge About Shanks", "level": 3, "content": [{"type": "paragraph", "text": "In an anime only scene, Bartolomeo stated that he interviewed each of the Straw Hats that were with him and so he was told of Luffy's past with Shanks. However, in the cover story The Stories of the Self-Proclaimed Straw Hat Grand Fleet, Bartolomeo is shown to be unaware of Shanks' connection to Luffy as he disrespectfully burned down the Yonko's flag."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bartolomeo's epithet \"Cannibal\" is actually a pun. \"Eating people\" means to \"mock them\" in Japanese.", "elements": [{"text": "In English, it's also a reference to the question \"what's eating you?\" when a person is annoyed.", "elements": []}]}, {"text": "In Vietnam, the crossing of one's fingers, like Bartolomeo did when facing Elizabello II, is roughly the equivalent of showing someone the middle finger. It is also a common taunt in Japanese schools.", "elements": [{"text": "Bartolomeo's behavior, along with the two things mentioned above, suggests that his whole character was created around the idea of mockery.", "elements": []}]}, {"text": "In the 5th fan poll, Bartolomeo is ranked as the 9th most popular character, which made him, at the time, the 4th most popular non-Straw Hat character behind Portgas D. Ace, Sabo, and Trafalgar Law.", "elements": [{"text": "In the 6th fan poll, he is ranked as the 30th place.", "elements": []}]}, {"text": "Bartolomeo is the first person to have an eyecatcher, from the fourth set of eyecatchers, that is not a member of the Straw Hat Crew, and is overall the second person who is not a member of the crew to have an eyecatcher.", "elements": []}, {"text": "Bartolomeo's eyecather resembles Straw Hats first eyecatcher on the background. Ship docked in the port, Grand Line sign and the view of the sunset with lighthouse from the port. The only difference is the ship is Going Luffy Senpai and none of his crew and him are present.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bartolomeo's birthday, October 6, comes from his name's Japanese trancription third and fourth syllable since 10-6 can be derived from to-ro. He shares his birthday with Tashigi and Trafalgar D. Water Law.", "elements": []}]}, {"type": "list", "elements": [{"text": "His favorite food are cheap sweets and his least favorite are vegetables.", "elements": []}]}], "images": []}]}