{"sections": [{"title": "Orlumbus", "level": 1, "content": [{"type": "paragraph", "text": "\"Massacre Ruler\" Orlumbus is a former adventurer who is the admiral of the Yonta Maria Grand Fleet and the captain of the seventh ship of the Straw Hat Grand Fleet. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi. After the final battle against Donquixote Doflamingo, Orlumbus pledged his loyalty to Monkey D. Luffy and became a pirate."}, {"type": "paragraph", "text": "He is an ally of Luffy during the Dressrosa Arc, and one of the central characters from The Stories of the Self-Proclaimed Straw Hat Grand Fleet Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Orlumbus is a huge man that resembles a stereotypical pirate captain. He has a deep frown and thick chin with stubble. He wears his long blond hair in braids with four slung over his shoulder. He has a large, masculine upper-body and a small lower-body with small legs."}, {"type": "paragraph", "text": "He wears a bicorn with a small skull on the front over a black bandanna with orange spots. There are four braids coming down from his hat, it is unknown if it his hat or his hair (like Buggy). He wears a buckled strap over his bare chest under a navy blue (red in the anime) naval long-coat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about his personality, but he seems to be quite self-confident, since he held up the defeated Fighting Lion to show everyone his strength."}, {"type": "paragraph", "text": "Unlike most of the people who were released from Sugar's curse, Orlumbus is not shown to be swayed by greed as he chose to engage the Donquixote Pirates instead of their enemies. After Doflamingo was defeated, Orlumbus became very loyal to Luffy and pledged the allegiance of his fleet to help the Straw Hats in the New World."}, {"type": "paragraph", "text": "Orlumbus is a dedicated scholar. Even as a child, he enjoyed studying, and in his adulthood, he has a collection of books for his leisure."}, {"type": "paragraph", "text": "Orlumbus can be compassionate as he gave supplies to the citizens of the poor country he tried to raid."}, {"type": "paragraph", "text": "It appears that Orlumbus is prone to exaggerating his exploits. While others refer to him as the \"Made-Up Explorer\", he calls himself the \"Pioneer Explorer\" instead."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He is the admiral of a fleet numbering approximately 4,300 soldiers, showing tremendous leadership capability. He uses a whip quite proficiently as a weapon in battle, as he is shown to have defeated Agyo by whip. Orlumbus is also an expert scholar as he is very orderly and has a fair collection of books in his possession."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Orlumbus has enormous physical strength, as he could lift a lion with just one hand and also squeezing it. During the fight against the Donquixote Pirates, Orlumbus could effortlessly throw Zoro all the way from the Flower Hill (turned into the New King's Plateau by Pica) to the Old King's Plateau with astounding velocity. He is also left handed."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Teitoku Hug (提督ハグ, Teitoku Hagu, \"Admiral Hug\"): Orlumbus utilizes a bear hug, which, combined with his size, can easily crush a group of people. This is first seen used against a group of the Donquixote Pirates' footsoldiers. It is called Commodore Hug in the FUNimation subs.", "elements": []}, {"text": "Teitoku no Igen \"Seiretsu\" (提督の威厳「整列」, Teitoku no Igen \"Seiretsu\", \"Admiral's Dignity: 'Ten-Hut'\"): This technique involves Orlumbus yelling at his opponents to follow his command. Orlumbus is first seen using this technique to stop some subordinates of the Donquixote Family. It is called Commodore Dignity: Atten-hut in the FUNimation subs.", "elements": []}, {"text": "Teitoku Killer Bowling (提督キラーボウリング, Teitoku Kirā Bouringu, \"Admiral Killer Bowling\"): Orlumbus grabs one of his opponents and uses them as a bowling ball to hit more opponents. It is used in conjunction with \"Admiral's Dignity: Ten-Hut.\" It can also be used without \"Admiral's Dignity: Ten-Hut\" as seen when Zoro needed his technique to help him reach Pica. In the anime it is called only Killer Bowling.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Orlumbus was born in a poor family in the Standing Kingdom and he was an avid reader and scholar. At some point, he did something that made him known as the \"Made-Up Explorer\". Some time after this event, the king of the Standing Kingdom supposedly made him an official explorer, making him an admiral and giving him command over a massive fleet which would later come to be known as the Yonta Maria Grand Fleet. After this, Orlumbus officially began traveling the seas as an adventurer. With his ability to command such a large fleet so skillfully in the New World, he earned the epithet, \"Massacre Ruler\". The fleet continued to gather fame during their travels to the point where it has been said that those who could manage to sink it would be able to make a name for themselves which consequently boosted Orlumbus' already rising reputation even further."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Orlumbus entered the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block D."}, {"type": "paragraph", "text": "As Block D's battle royale began, Orlumbus was seen preparing to fight, glaring fiercely at his competition."}, {"type": "paragraph", "text": "He later defeated the Fighting Lion. When Cavendish's alter-ego Hakuba suddenly surfaced, he proceeded to strike down all the remaining fighters in Block D. Orlumbus fell victim to his attack and was defeated."}, {"type": "paragraph", "text": "Sometime after Block D, Orlumbus was transformed into a toy and forced to work in the underground trade port. When Sugar fell unconscious, he returned to his original form."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\", Orlumbus and the other Colosseum fighters escaped to the surface through an opening created by Pica when he rearranged the land with his ability."}, {"type": "paragraph", "text": "When he found Luffy, Zoro, and Law, Orlumbus stated that he will take Doflamingo's head. Therefore, he joined forces with Luffy's group alongside the Chinjao Family, Hajrudin, Suleiman, Ideo, Fighting Bull, Blue Gilly, Cavendish, Abdullah , Jeet, Elizabello II, and Dagama. When some of the former toys came for the heads of Luffy, Zoro, and Law, Orlumbus and the allied Colosseum fighters fought them off. They later march towards the royal palace and began to battle against Pica, who appeared as a massive stone giant."}, {"type": "paragraph", "text": "When Pica attacked, Chinjao and Elizabello II shattered his stone hand, enabling the group to move forward. Orlumbus and the other allied fighters fought through Doflamingo's troops. Pica then attacked with his other arm, causing Orlumbus and some of the other allies to fall back. After avoiding Pica's strike, they were surprised to see Luffy, Zoro, Law, Abdullah, Jeet, and Fighting Bull climbing on Pica's arm. They were also amazed when Luffy shattered Pica's stone head. When Pica's giant stone body stopped moving, Orlumbus and his allies continued on with their assault."}, {"type": "paragraph", "text": "Orlumbus was then seen reaching the first level of the King's Plateau, together with the other colosseum fighters."}, {"type": "paragraph", "text": "With Zoro fighting Pica and Sabo fighting the Marines, the Colosseum fighters charged up the new King's Plateau and easily defeated the Donquixote Pirates' troops standing in their way. They later reached the first level and got ahead of Luffy."}, {"type": "paragraph", "text": "After reaching the second level, the Colosseum fighters were confronted by four of the Donquixote Pirate officers. During the skirmish, Lao G punched Orlumbus in the face. The Colosseum fighters later banded together to create an opening for Luffy and Cavendish."}, {"type": "paragraph", "text": "Orlumbus was shown to still be active in the fight later, engaging the numerous Donquixote Pirates' troops rather than an officer. The adventurer later assisted Zoro by forcibly getting a group of enemies to stand in formation using an as-of-yet unknown technique and strike them down with another foot soldier in a fashion similar to bowling. Orlumbus then stated that he would leave Pica to Zoro."}, {"type": "paragraph", "text": "When Pica was heading towards the Old King's Plateau in the giant Pica statue, Orlumbus assisted Zoro by throwing him towards his adversary, enabling Zoro to defeat Pica."}, {"type": "paragraph", "text": "After witnessing Pica's defeat at the hands of Zoro, he was seen grinning at the victory. When the Birdcage started shrinking, Orlumbus was told by Sai to wake up their fallen allies before the Birdcage reaches them."}, {"type": "paragraph", "text": "After Mansherry healed the injured, the gladiators defeated the remaining Donquixote Pirates on the New King's Plateau to help the citizens flee from the shrinking Birdcage. Using Bartolomeo's barrier, the gladiators worked together in pushing the Birdcage back."}, {"type": "paragraph", "text": "Once Luffy finally defeated Doflamingo, the gladiators witnessed the collapse of the Birdcage."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. Orlumbus utilized his Yonta Maria Grand Fleet of 56 ships to assist the Straw Hats and their allies in escaping Dressrosa. Orlumbus allowed them to board his flagship, the Yonta Maria. Orlumbus, along with his 4,300 crewmembers, asked to join Luffy's pirate alliance."}, {"type": "paragraph", "text": "When Luffy was asked to drink a sake cup to complete the agreement for an alliance, Luffy declined, much to the others' shock. Once Luffy explained that they can do whatever they want, the allies decided to forge the alliance anyway, forming the Straw Hat Grand Fleet. Sai, Bartolomeo, Leo, Cavendish, Ideo, Orlumbus, and Hajrudin sat down and drank their sake cups. Afterwards, they held a feast to celebrate their victory over Doflamingo. After the feast, Orlumbus and the other leading allies received Luffy's Vivre Card and parted ways."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/21/Hakuba_Defeats_Block_D_Competitors.png/revision/latest/scale-to-width-down/250?cb=20151130174131", "caption": "Orlumbus and the rest of Block D is defeated by Hakuba."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Luffy_and_the_Corrida_Colosseum_Gladiators_Going_After_Doflamingo.png/revision/latest/scale-to-width-down/250?cb=20160608200003", "caption": "Orlumbus with Luffy, Zoro, Law, Ucy and the other Corrida Colosseum combatants are on their way for Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Lao_G_Attacks_Orlumbus.png/revision/latest/scale-to-width-down/180?cb=20150503203550", "caption": "Lao G attacks Orlumbus."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cd/Orlumbus_Helps_Zoro.png/revision/latest/scale-to-width-down/180?cb=20161221101120", "caption": "Orlumbus helps Zoro defeat Pica."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "After parting ways with the other members of the Straw Hat Grand Fleet, Orlumbus and his fleet set out to sea. Orlumbus then spoke to the king of the Standing Kingdom and resigned as an adventurer."}, {"type": "paragraph", "text": "Orlumbus later started his day as a pirate at 6 AM by folding his pajamas. At 10 AM, Orlumbus checked the cleaning of his ship. Orlumbus then bid the Standing Kingdom farewell as the king and his army assaulted his stolen fleet with cannon fire. After leaving the kingdom behind, Orlumbus began writing a piracy plan. Sometime later, Orlumbus and his fleet began attacking an island. However, after finding out that the citizens were poor, Orlumbus decided to give them supplies. Afterwards, Orlumbus and his fleet left the island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b9/Orlumbus%27_First_Pirate_Expedition.png/revision/latest/scale-to-width-down/200?cb=20181005102024", "caption": "Orlumbus' first \"pirate act\" is to help a poor city by giving them supplies."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Orlumbus vs. Corrida Colosseum Block D gladiators", "elements": [{"text": "Orlumbus vs. Agyo", "elements": []}]}, {"text": "Corrida Colosseum gladiators vs. Donquixote Pirates", "elements": [{"text": "Orlumbus vs. Lao G", "elements": []}]}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Orlumbus' name comes from the famous explorer Christopher Columbus.", "elements": [{"text": "Orlumbus is a pun on \"Columbus\" and Ō, which means \"big\" in Japanese. On the other hand, co/ko, means \"small\" in Japanese.", "elements": []}, {"text": "The Yonta Maria Grand Fleet that Orlumbus leads is a pun on the Santa María, one of the ships used by Columbus in his first voyage. San can mean \"three\" in Japanese, while yon can mean \"four\".", "elements": []}, {"text": "His favorite food is boiled eggs, which might be a reference to Egg of Columbus.", "elements": []}]}, {"text": "Orlumbus and Ideo are the only representatives of the Straw Hat Grand Fleet not to single-handedly defeat an officer of the Donquixote Family (although Orlumbus did help Zoro defeat the Elite Officer Pica).", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Orlumbus' favorite food is boiled eggs and his least favorite is capricious cooking.", "elements": []}]}], "images": []}]}