{"sections": [{"title": "Jeet", "level": 1, "content": [{"type": "paragraph", "text": "Jeet is a criminal and a former bounty hunter who joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi, along with his partner, Abdullah. He is an ally of Luffy during the Dressrosa Arc. After the battle with the Donquixote Pirates at Dressrosa, he joined the XXX Gym Martial Arts Alliance, which later converted to a pirate crew called the Ideo Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jeet has a scar down the left side of his face. He has dark hair under a light-colored turban. He also wears a pinstriped shirt and a dark beaded necklace. He is usually seen licking his sword with a bloodthirsty smile."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like his partner Abdullah, Jeet seems to be ruthless and without mercy, as they bombed a government institution, indicating a severe enmity against the World Government."}, {"type": "paragraph", "text": "However, in spite of his ruthless nature, Jeet is also shown to have a strong sense of loyalty, being one of the few Colosseum participants that remained loyal to Usopp in spite of the massive bounty Doflamingo placed on his head, even joining in attacking those that did so."}, {"type": "paragraph", "text": "This is further highlighted by his willingness to not only fight alongside Luffy, but attack \"Doflamingo\" head on to protect his new ally, in spite of Doflamingo's own fearsome strength."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The fact that he was responsible for the bombing of a government facility and that he also was mentioned as a noted participant at the Colosseum indicates that he has some degree of strength."}, {"type": "paragraph", "text": "Jeet and Abdullah seem to use a sort of tandem fighting style. While the bigger, presumably stronger, slower and more intimidating Abdullah faces foes directly while often screaming loudly to get their attention with his longer ranged tridents, the much smaller, faster Jeet launches a quick surprise attack from the rear, catching their adversaries by surprise."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Abdullah_and_Jeet_Defeat_Lepanto.png/revision/latest/scale-to-width-down/150?cb=20140916083614", "caption": "Jeet and Abdullah, with their strategy, defeats Tank Lepanto."}]}, {"title": "Weapon", "level": 3, "content": [{"type": "paragraph", "text": "Jeet uses two sabers, with which he was able to take out several opponents."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Jeet and Abdullah bombed a government institution."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Abdullah and Jeet entered the Corrida Colosseum to compete for the Mera Mera no Mi. During the battle royale, they were placed in Block B."}, {"type": "paragraph", "text": "Jeet makes his first appearance when Dagama is explaining the ulterior motives of all the competitors present, eagerly licking the edge of one of his sabers."}, {"type": "paragraph", "text": "As Block B began, Abdullah and Jeet were seen preparing to fight. Later, as the battle royale commenced, Abdullah and Jeet disqualified some of the gladiators with a strategy: Abdullah distracted them while Jeet hit them from behind with his sword, gleefully cackling all the while. As one of the gladiators angrily accuses the two of being cowards, the two comment on how nice the sounds of combat are."}, {"type": "paragraph", "text": "Later on, Abdullah and Jeet trick and defeat Tank Lepanto, and are shown standing victoriously over his prostrate body. As the crowd comments on the dirty tricks that the two are using, Abdullah and Jeet swiftly defeat another fighter utilizing the same strategy. While Elizabello II, Dagama, Blue Gilly, and Ricky fight their respective battles, the two fighters eagerly await their next victim, hungry for blood. What they did not expect was for Bellamy to suddenly make his assault, rooting them to the spot by impaling their feet with knives. As the two shriek in pain at the sudden attack, Bellamy grabs them by their jaws and uses his Devil Fruit powers to flip over their heads, twisting and subsequently snapping their backs. Defeated by the vicious Donquixote Pirate member, the downfall of the two fighters was cheered on by the crowd."}, {"type": "paragraph", "text": "Sometime later, they were supposed to receive treatment for their injuries but instead, they were thrown into an underground dungeon filled with broken toys along with some of the disqualified participants. When Tank Lepanto asks Ricky if he is actually the former king of Dressrosa, Riku Doldo III, Abdullah flatly denies the possibility, stating that King Riku was dead. In full agreement with his partner, Jeet laughed, adding that he had heard the former king had gone insane."}, {"type": "paragraph", "text": "The pair were later seen having been transformed into toys. They referred to themselves as \"Lone Wolf Abdullah\" and \"Solitary Warrior Jeet\" in their thoughts, showing that despite their long history together as partners they had still forgotten each other once transformed."}, {"type": "paragraph", "text": "When Sugar passed out, her curse broke and the toys returned to their original forms. All the former slaves in the underground, including Abdullah and Jeet, declared Usopp as their savior for freeing them and happily followed his lead."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\", Abdullah, Jeet, and the other colosseum fighters escaped to the surface through an opening created by Pica when he rearranged the land with his ability."}, {"type": "paragraph", "text": "When they found Luffy, Zoro, and Law, they stated that they will defeat Doflamingo for Usopp. Therefore, they joined forces with Luffy's group alongside the Chinjao Family, Hajrudin, Suleiman, Fighting Bull, Blue Gilly, Cavendish, Ideo, Orlumbus, Elizabello II, and Dagama. When some of the former toys came for the heads of Luffy, Zoro, and Law, the allied colosseum fighters fought them off. They later march towards the royal palace and began to battle against Pica."}, {"type": "paragraph", "text": "When Pica attempted to strike, Chinjao and Elizabello II shattered Pica's stone hand, enabling the group to move forward. Pica then attacked with his other arm, causing Luffy's allies to fall back. However, Fighting Bull, with Luffy, Zoro, Law, Abullah, and Jeet on its back, jumped on and ran on Pica's arm. After Luffy shattered Pica's stone head with Grizzly Magnum, Pica's true body appeared before the bull. Pica took out his sword and tried to attack the bull and the group riding on it, but Luffy carried the bull and evaded the sword strike. Zoro intercepted Pica when he attempted to strike again. With Pica held back, the Fighting Bull ran on the stone giant's back, carrying Luffy, Law, Abdullah, and Jeet closer to the palace."}, {"type": "paragraph", "text": "They eventually reached the first level of the new King's Plateau. While they charged through Doflamingo's troops, Kelly Funk (while fused with Bobby Funk) appeared seemingly to aid them and showed them a tunnel that is supposed to go directly to the fourth level. While cheering for Kelly, Abdullah and Jeet hit their heads on the top of the tunnel's entrance and fell of Fighting Bull. Luffy, Law, and Fighting Bull went ahead and left Abdullah and Jeet behind."}, {"type": "paragraph", "text": "They soon realized that Kelly Funk had tricked Luffy, but before they could react, Doflamingo appeared and struck down Kelly. When Luffy, Law, and Ucy were trapped and about to be killed by Doflamingo, they both struck him in the back, only to discover that it was a clone made up of string. After Luffy punched a hole to the second level, he left Abdullah and Jeet to care for the wounded Ucy."}, {"type": "paragraph", "text": "During the final phase of Doflamingo's game, Abdullah and Jeet were seen again helping the other gladiators push back the Birdcage via Bartolomeo's barrier just long enough for Luffy to defeat Doflamingo."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. Abdullah, Jeet, and Ideo subdued the Marines at the eastern port. When Bastille called them, Abdullah and Jeet tried to trick him into not sending reinforcements, but failed."}, {"type": "paragraph", "text": "The fighters later gathered at the eastern port, preparing to fight Issho. When Issho prepared to attack them with all the rubble from Dressrosa, the fighters and the Straw Hats quickly fled to the escape ship. At that moment, Luffy arrived and attacked Issho."}, {"type": "paragraph", "text": "During the clash, Issho used his gravity ability to blow Luffy, who was then caught by Hajrudin. The fighters and Straw Hats quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after Luffy. They eventually reached Orlumbus' flagship, the Yonta Maria. After boarding the ship, Abdullah and Jeet revealed that they joined Ideo's group. The XXX Gym Martial Arts Alliance was then one of the seven groups that pledged their allegiance to the Straw Hats."}, {"type": "paragraph", "text": "After the Straw Hat fleet was formed, the Straw Hats and company held a feast to celebrate their victory over Doflamingo."}, {"type": "paragraph", "text": "After Ideo received Luffy's vivre card, the XXX Gym Martial Arts Alliance parted ways with the Straw Hats. They were later given a ship by Orlumbus."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Bellamy_vs_Abdullah_Jeet.png/revision/latest/scale-to-width-down/210?cb=20140323170755", "caption": "Abdullah and Jeet are brutally defeated by Bellamy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Luffy_and_the_Corrida_Colosseum_Gladiators_Going_After_Doflamingo.png/revision/latest/scale-to-width-down/210?cb=20160608200003", "caption": "Abdullah and Jeet with Luffy, Zoro, Law, Ucy and the other Corrida Colosseum combatants are on their way for Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/Black_Knight.png/revision/latest/scale-to-width-down/210?cb=20150419182355", "caption": "Abdullah and Jeet strike the Ito Clone."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "While sailing out at sea with their ship, the XXX Gym Martial Arts Alliance spotted two ships in the middle of a battle. Jeet and his group then fought against the crews of both ships. After ending the fight, the XXX Gym Martial Arts Alliance learned that the battle was part of a thousand-year quarrel between the Longleg and Longarm tribes. At a deserted island, Ideo's group decided to customize their new ship using undamaged ship parts. After their new ship was completed, the XXX Gym Martial Arts Alliance left the Longarm and Longleg crews behind, not caring whether they reconcile or continue their quarrel. The group later decided to become a pirate crew called the Ideo Pirates."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Abdullah and Jeet vs. Corrida Colosseum Block B Gladiators", "elements": [{"text": "Abdullah and Jeet vs. Tank Lepanto", "elements": []}, {"text": "Abdullah and Jeet vs. Bellamy", "elements": []}]}, {"text": "Abdullah and Jeet vs. Doflamingo's clone", "elements": []}, {"text": "Abdullah, Jeet, and Ideo vs. Marines (Dressrosa Eastern Port)", "elements": []}, {"text": "Ideo Pirates vs. unknown Longarm and Longleg crews", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jeet's name and appearance is based on a real-life professional wrestler, Tiger Jeet Singh.", "elements": []}]}], "images": []}]}