{"sections": [{"title": "Sai", "level": 1, "content": [{"type": "paragraph", "text": "Sai, also known as Don Sai, is a member of the Chinjao Family and the 13th leader of the Happo Navy, as well as the captain of the third ship of the Straw Hat Grand Fleet. He is also a martial artist who joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi, where he met Monkey D. Luffy, whom he eventually pledged his loyalty to. He is now married to Baby 5, a former officer of the Donquixote Pirates who defected due to falling in love with him."}, {"type": "paragraph", "text": "He is an ally of Luffy during the Dressrosa Arc, and one of the central characters from The Stories of the Self-Proclaimed Straw Hat Grand Fleet Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sai is a thick built man with shaggy brown hair and sideburns. He has an unusually smooth and tubular torso, and in spite of his muscular strength he lacks defined abs, or a belly button."}, {"type": "paragraph", "text": "He sports a dark green cape with a white frill collar. He wears puffy blue and yellow thick-striped pants (green in the manga) and black shoes. He has the number \"13\" tattooed on his left side just below his ribs, similar to the tattoo of the number \"12\" his grandfather has, representing that he is the 13th leader of the Happo Navy."}, {"type": "paragraph", "text": "When transformed into a toy, he appears as a monkey bearing cymbals. He has rounded teeth and a well-defined lower jaw. He wears a bow tie, sunglasses, a striped hat, and a pair of pants that resemble those he wore as a human. Surprisingly while most toys were not at all reminiscent of their true forms, Sai was one of the only people whose toy appearance vaguely resembled their human self."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sai strongly believes in honesty and fairness, as he stood up for Luffy when he was about to be unfairly disqualified. He is very emotional and has a habit of overreacting whenever he rejects something, repeatedly insisting there is no need for it before turning belligerent toward the offering party. This also goes for apologizing, as he threw himself on his knees and begged for forgiveness from a Colosseum doctor after having already apologized three times. Sai is responsible, being quick to restrain his grandfather's rash attack on Luffy (in disguise as Lucy) and Cavendish so that it would not interfere with their true goal at the tournament."}, {"type": "paragraph", "text": "Sai is thoroughly dedicated to his training in the Hasshoken, notably restraining his natural brotherly emotions towards Boo in order to remain focused in battle. However, as the commander of the Happo Army, he is also mindful of and fully dedicated to towards his comrades in arms, and will ruthlessly avenge their defeat."}, {"type": "paragraph", "text": "Sai is also compassionate with a very strong sense of honor, even towards his enemies, as when Baby 5 tried to commit suicide (due to his request) he immediately tried to stop her, claiming that was not how he wanted to win. His compassion was shown further when he was enraged at Lao G's insults to Baby 5 and his grandfather. When Pica ruthlessly attacked Baby 5 for treachery, he wasted no time in pushing Baby 5 to safety and taking the full brunt of Pica's attack himself. When Leo tried to save Shirahoshi from Charlos, Sai quickly went to back up the dwarf, showing that he is willing to defy even the World Nobles to help people despite the consequences of doing so."}, {"type": "paragraph", "text": "Like many One Piece characters, Sai also has a unique laugh: Kakakaka."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/76/Aggressive_Sai.png/revision/latest/scale-to-width-down/210?cb=20140723201137", "caption": "Sai getting belligerent for being thanked."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Chinjao", "level": 4, "content": [{"type": "paragraph", "text": "Sai cares greatly for his grandfather as he got angry with the Colosseum's medical staff for not telling him what happened to Chinjao. He also acts as a guide for Chinjao since he prevented the elderly pirate from clashing with Luffy and Cavendish and ruining their \"mission\". Chinjao shouted when his grandson was grabbed by Trebol, but, after Sai and Boo were turned into toys, Chinjao completely forgot about them due to the effect of the transformation on loved ones."}, {"type": "paragraph", "text": "After Sai tried to reason with Baby 5 from killing herself during Doflamingo's Birdcage game, Chinjao was enraged at Sai for trying to help an enemy and attempted to attack him stating he brought shame to the Happo Navy. Sai retorted with a kick that bent his legendary head. However, rather than getting angry, Chinjao proclaimed that he was proud of Sai's skills in the Hasshoken, proclaiming he is worthy of the title of Don and has now surpassed him. After his grandfather was brutally assaulted by Lao G, Sai honored his grandfather and defeated the Donquixote executive member."}], "images": []}, {"title": "Boo", "level": 4, "content": [{"type": "paragraph", "text": "Sai is very attached to his brother, which was seen when Boo was defeated by the Funk Brothers. Because of his Hasshoken training, Sai is not supposed to have a deep attachment to Boo when in battle to prevent him from getting distracted but does have enough pride to avenge any of his fallen comrades, including his brother. Boo also acts as a guide for Sai similar to the relationship between Sai and Chinjao as Boo had to hold back his brother from attacking Luffy."}], "images": []}, {"title": "Baby 5", "level": 4, "content": [{"type": "paragraph", "text": "Although they initially fought against each other at Dressrosa, Baby 5 fell in love with Sai. After he dismissed her, she prepared to kill herself, but Sai stopped her and defeated Lao G after declaring that he would marry her regardless. Baby 5 became elated at this news and after Sai's victory, she started to refer to Sai as \"darling\" much to the latter's displeasure. After breaking off the engagement with Uholisia, he officially married Baby 5, making her his wife. Sai also loves his wife's cooking as it is his favorite."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Sai has a strong dislike for Doflamingo for giving weapons to his country's enemies and instigating wars. He has vowed to stop this illegal trade and get revenge on the Shichibukai for turning him into a toy and making him a slave."}], "images": []}, {"title": "Trebol and Sugar", "level": 4, "content": [{"type": "paragraph", "text": "After Sai was imprisoned in an underground dungeon, Trebol abducted him and Sugar turned him into a toy. Trebol hypnotized Sai and took control of him. The Happo Navy leader was frustrated and confused at how he was physically forced to follow Trebol's orders and wasn’t able to control his own body."}], "images": []}, {"title": "Lao G", "level": 4, "content": [{"type": "paragraph", "text": "As a member of the Donquixote Pirates, Lao G was a major enemy to all the gladiators who sided with Luffy during the Birdcage game. Sai fought Lao G not only to help Luffy but also to defend Baby 5 and avenge his grandfather's defeat. "}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "When Luffy was about to be disqualified for knocking out Spartan before the matches started, Sai defended him, saying that Spartan was the one who instigated the fight. Afterwards, Luffy thanked Sai for defending him only for Sai to get belligerent and angry. After he was restrained, Sai flicked off Luffy. Sai does not seem to hold a grudge against Luffy for winning Block C. He even tried to get Luffy's attention so his grandfather could thank him."}, {"type": "paragraph", "text": "During the Birdcage game, Sai and his family allied with Luffy rather than go after the bounty on his head and allowed him to go after Doflamingo himself. After Doflamingo was defeated, Sai and the other captains swore to serve under the Straw Hats. Though grateful to Luffy he was annoyed when the latter first denied the alliance and thought of forcing him into accepting their offer."}], "images": []}, {"title": "Ideo", "level": 4, "content": [{"type": "paragraph", "text": "Sai shares a mutual respect for Ideo as a fighter, as seen during their battle in C Block. The two would later ally with each other to defeat the Donquixote Pirates and become members of the Straw Hat Grand Fleet."}], "images": []}, {"title": "Riku Doldo III", "level": 4, "content": [{"type": "paragraph", "text": "Sai blames Riku Doldo III for letting Doflamingo come to power. His opinion of him may have mellowed after learning of his innocence."}], "images": []}, {"title": "Leo", "level": 4, "content": [{"type": "paragraph", "text": "Sai is well acquainted with Leo as they both consider each other as comrades. When Leo tried to save Shirahoshi from Charlos, Sai quickly went to back him up."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Funk Brothers", "level": 4, "content": [{"type": "paragraph", "text": "Though Sai doesn’t have any actual qualms with the Funk Brothers outside of the Corrida Colosseum match, he did defeat them in battle to specifically avenge his beaten brother."}], "images": []}, {"title": "Uholisia", "level": 4, "content": [{"type": "paragraph", "text": "Uholisia is Sai's former fiancee. She appeared eager to marry Sai and make him her 26th husband, but when he broke off his engagement to her, Uholisia was so furious that she viciously beat him up for it."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the 13th Commander of the Happo Navy, Sai is undoubtfully a powerful fighter. He was able to defeat the Funk Brothers, who are capable of defeating pirates with bounties of over 100 million, with a single kick. He was later able to defeat Lao G, a Donquixote executive who defeated his grandfather easily with a single Haki-embedded kick that shattered the ground around them. Even Chinjao, an ex-pirate with a bounty of over 500 million, acknowledged that Sai had managed to surpass him in strength."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Due to his dedicated training in Hasshoken, Sai attained tremendous physical prowess as well as immense skill in the unique martial art which generates vibrations in physical strikes, and Sai personally had an emphasis in using vibration enhanced kicks. Along with Boo, he was able to restrain back his enraged grandfather, although it is probable that Chinjao didn't exert himself fully as he did not wish to harm his grandchildren."}, {"type": "paragraph", "text": "Sai is powerful enough to handle and excel against the dangers of the New World, to the extent of being chosen as the 13th Commander of the Happo Navy in succession of the legendary Chinjao. In the Block C battle royale of the Corrida Colosseum, he demonstrated incredible agility to effortlessly dodge the assault of the combined Funk Brothers and defeat them in one blow, as well as spar evenly with Ideo, a boxer powerful enough to launch a giant out of the ring with a single punch. Although Luffy knocked Sai easily out of the arena with a Gear 2nd kick, the attack was a surprise that caught him off guard, and he was shown to be conscious and fine in the waters right after. He also took a kick to the face from Rob Lucci and shrugged it off."}, {"type": "paragraph", "text": "Sai's true strength is later seen when he was able to effortlessly bend Chinjao's Haki-coated head (an incredible feat done only by Garp and Luffy before him) and during his fight with Lao G when he was able to both defeat him easily and split the entire hill in two simply from the aftershock of his attack. After seeing his destructive power even Roronoa Zoro noted his ability and decided to remember his name for the future."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Sai_Using_Hasshoken.png/revision/latest/scale-to-width-down/210?cb=20140518092836", "caption": "Sai using Hasshoken."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Sai possesses Busoshoku Haki as demonstrated when he coated his leg with Haki against Chinjao and Lao G. He also is skilled enough to coat large portions of his body with Haki in order to protect himself from being crushed by Pica."}, {"type": "paragraph", "text": "In the anime, when defeating Lao G, Sai's Haki emitted a green flame-like aura around his foot in conjunction with the usual black-skin effect of Busoshoku Haki."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Bujaogen.png/revision/latest/scale-to-width-down/210?cb=20150922150626", "caption": "Sai coats his leg with Busoshoku Haki against Chinjao."}]}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Sai possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Sai was seen using a sword when attempting to lunge at Luffy. It is currently unknown how skilled he is at using this weapon."}, {"type": "paragraph", "text": "In the fight at Block C, he used a bladed polearm proficiently. Sai acrobatically hurls himself at his enemy by balancing on his polearm and swinging himself in their direction, in a manner similar to pole vaulting. Sai can use the momentum generated by such an assault to land kicks and other attacks on his foes."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Sai, Boo, and Chinjao came from the Kano Country to compete for the Mera Mera no Mi and with a hidden agenda to investigate a weapons trade that the Donquixote Family is involved in. For the battle royale, he was placed in Block C."}, {"type": "paragraph", "text": "After Lucy defeated Spartan before the competition had officially started, one of the colosseum staff was about to disqualify the disguised Straw Hat captain for causing a fight before the match. Before he could follow through with this threat, the Chinjao Family arrived on the scene. Having seen the entire thing first-hand, Sai demanded that the staff member quit trying to throw Lucy out of the competition, as it had been the \"big guy\" who had started the whole thing, and if anyone should be thrown out, it should be him. After Lucy thanked them for standing up for him, Sai laughed and said there was no need for thanks. He then started repeatedly declaring that Lucy's thanks weren't needed, before angrily demanding for him to take it back. Before he could attack the bewildered Lucy, he was held back by Boo, who apologized to the confused pirate, stating that he's the kind of man who gets easily fired up. Hearing this, Sai angrily repeated his comrade's words, before flipping Lucy off as he was dragged away."}, {"type": "paragraph", "text": "Later, when Chinjao attempted to kill Lucy because of his vendetta with Garp, Sai and Boo held him back before his anger went out of control. They then explained to him that he could just kill Lucy during C block, reminding him of their true goal."}, {"type": "paragraph", "text": "After this, Sai is seen along with the rest of the Chinjao Family as he enters the ring, prepared to begin Block C's battle royale."}, {"type": "paragraph", "text": "Later, as the battle royale commenced, Sai, along with Chinjao, Jean Ango, and Kelly Funk, was seen watching as Lucy plow through his fellow competitors while riding on the back of Fighting Bull."}, {"type": "paragraph", "text": "Shortly thereafter, he dodged a fighter's attack by using his polearm as a pole vault, and then kicked the man's shield, utilizing the Hasshoken technique to easily disarm and defeat the fighter. Later, when Boo was being mercilessly pounded by the Funk Brothers, Sai called out to him in alarm  and later avenged his brother by knocking out the Funk Brothers with a single kick. After the Funk Brothers' defeat, he was then locked in combat with Ideo. The two fought evenly, exchanging blows with each other. However, before one of them could finish off the other, they were caught in the middle of Lucy and Chinjao's feud. Lucy knocked Sai out of the ring with a single kick while charging at Chinjao."}, {"type": "paragraph", "text": "While floating on the water outside of the ring, Sai and Boo watched Chinjao's clash with Lucy. Upon witnessing Chinjao's defeat, they called out to him in horror as he fell and sank into the water."}, {"type": "paragraph", "text": "After the match's conclusion, Sai and Boo brought Chinjao to Luffy so he could thank him for restoring his old head."}, {"type": "paragraph", "text": "Sometime later in the underground medical treatment facility, Sai was seen in the waiting room. He was yelling at a doctor because he has not seen his grandfather leave the treatment room. Sai was then told that Chinjao went through another exit and he apologized profusely for his outburst. When it was Sai's turn to receive treatment, he laid on the examination table. It was then revealed to be a trapdoor and Sai fell down into an underground dungeon filled with broken toys. After seeing that some of the other disqualified participants were also thrown down there, Sai demanded to know what was going on and how would they be able to get out."}, {"type": "paragraph", "text": "Sai could only sit and watch as more of the defeated contestants, including Boo, dropped into the dungeon. After Ricky is revealed to be the former king of Dressrosa, Riku Doldo III, Sai revealed the Chinjao Family's objective and blamed the former king for allowing Doflamingo to rise to power which led to wars in various countries including the Kano Country. Sai was then abducted by Trebol and transformed into a toy. After his transformation, Sai found himself unable to disobey Trebol's commands."}, {"type": "paragraph", "text": "Sai was later seen in the underground trade port, moving crates and still unable to disobey the orders given to him."}, {"type": "paragraph", "text": "When Sugar lost consciousness, Sai transformed back into a human."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\", the Chinjao Family escaped to the surface through an opening created by Pica when he rearranged the land with his ability."}, {"type": "paragraph", "text": "When the Chinjao family found Luffy, Zoro, and Law, they stated that they would defeat Doflamingo. Therefore, they joined forces with Luffy's group alongside Hajrudin, Ideo, Suleiman, Fighting Bull, Blue Gilly, Cavendish, Abdullah , Jeet, Orlumbus, Elizabello II, and Dagama. When some of the former toys came for the heads of Luffy, Zoro, and Law, the allied colosseum fighters fought them off. They later marched towards the royal palace and began to battle against Pica, who appeared as a massive stone giant."}, {"type": "paragraph", "text": "When Pica attacked, Chinjao and Elizabello II shattered his stone hand, enabling the group to move forward. Sai and the other allied fighters fought through Doflamingo's troops. Pica then attacked with his other arm, causing Sai and some of the other allies to fall back. After avoiding Pica's strike, they were surprised to see Luffy, Zoro, Law, Abdullah, Jeet, and Fighting Bull climbing on Pica's arm. They were also amazed when Luffy shattered Pica's stone head. When Pica's giant stone body stopped moving, Sai and his allies continued on with their assault."}, {"type": "paragraph", "text": "With Zoro fighting Pica and Sabo fighting the Marines, the colosseum fighters charged up the new King's Plateau and easily defeated the Donquixote Pirates' troops standing in their way. They later reached the first level and got ahead of Luffy."}, {"type": "paragraph", "text": "After reaching the second level, the colosseum fighters were confronted by four of the Donquixote Pirate officers. The colosseum fighters later banded together to create an opening for Luffy and Cavendish."}, {"type": "paragraph", "text": "Sai later came face to face with Baby 5, and blocked her bladed kick with his staff. Much to Sai's confusion, Baby 5 mistook his words during their battle and thought that he was hitting on her."}, {"type": "paragraph", "text": "Sai then tried to make it clear that he had no intention on marrying Baby 5 and Chinjao reminded Sai that the daughter of the leader of the Niho Navy was supposed to be his fiancée. Still thinking that Sai needed her, Baby 5 attempted to please Sai. He rebuffed her advances and jokingly asked her to kill herself. When Baby 5 really was about to commit suicide, Sai rushed to stop her. Infuriated that Sai was helping an enemy, Chinjao attempted to attack both Sai and Baby 5 with his pointed head. Sai then bent Chinjao's head with a powerful kick and slapped Baby 5. Chinjao acknowledged Sai's strength and gave him the title of Don. At that moment, Lao G struck down Chinjao with a surprise attack. Sai then promised Baby 5 that he will marry her after defeating Lao G. While Lao G rushed at his opponent, Sai defeated Lao G with a kick to the head."}, {"type": "paragraph", "text": "After Lao G's downfall, Sai tended to Chinjao and Baby 5 remarked that Sai had two ceremonies to prepare for, a wedding and a funeral, which irritated both Sai and Chinjao as the latter wasn't dead."}, {"type": "paragraph", "text": "Pica later preyed on the wounded and he attempted to crush Baby 5 for betraying the Donquixote Pirates. Sai pushed Baby 5 out of the way and took the brunt of Pica's attack. Sai survived and he, Chinjao, and Baby 5 watched an enormous stone giant, Pica, heading towards the Old King's Plateau. He then witnessed Pica's defeat at the hands of Zoro, and was awestruck by Zoro's feat of strength."}, {"type": "paragraph", "text": "Later, Sai noted the amount of rumbling and smoke caused by the Birdcage's shrinking. He then told Chinjao, Orlumbus, and Elizabello II to wake up their fallen allies before the Birdcage reaches them."}, {"type": "paragraph", "text": "After Mansherry temporarily healed the injured, Sai and the other gladiators defeated the remaining Donquixote Pirates on the New King's Plateau to help the citizens flee from the shrinking Birdcage."}, {"type": "paragraph", "text": "When the Birdcage came close to the central streets, the gladiators work together to push back the Birdcage via Bartolomeo's barrier. Once Luffy finally defeated Doflamingo, the gladiators witnessed the collapse of the Birdcage."}, {"type": "paragraph", "text": "Later that night after the aftermath, Sai and the other gladiators were seen resting at the palace with Baby 5 cuddled up next to him."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, Sai and the other gladiators prepared to assist the Straw Hats' escape from Dressrosa when the Marines were mobilized to pursue them."}, {"type": "paragraph", "text": "As the Straw Hats made their way to the eastern port, Sai and his fellow gladiators stood in the way of the Marines that were chasing after them. The fighters later gathered at the eastern port, preparing to fight Issho. When Issho prepared to attack them with all the rubble from Dressrosa, the fighters quickly fled to the escape ship. Sai was greatly shocked when he witnessed Luffy attacking Issho with a Haki-imbued Gear Third attack."}, {"type": "paragraph", "text": "During the clash, Issho used his gravity ability to blow away Luffy, who was then caught by Hajrudin. The fighters and Straw Hats quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after Luffy. They eventually reached Orlumbus' flagship, the Yonta Maria. After boarding the ship, Sai's Happo Navy was then one of the seven groups that pledged their allegiance to the Straw Hats."}, {"type": "paragraph", "text": "When Luffy was asked to drink a sake cup to complete the agreement for an alliance, Luffy declined, much to the others' shock. Once Luffy explained that they can do whatever they want, the allies decided to forge the alliance anyway, forming the Straw Hat fleet. Sai, Bartolomeo, Leo, Cavendish, Ideo, Orlumbus, and Hajrudin sat down and drank their sake cups. Afterwards, they held a feast to celebrate their victory over Doflamingo."}, {"type": "paragraph", "text": "After the feast, Sai and the other leading allies received Luffy's vivre card and parted ways."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Sai_Defeats_the_Funk_Brothers.png/revision/latest/scale-to-width-down/210?cb=20140525090648", "caption": "Sai defeats the Funk Brothers."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/40/Luffy_Kicks_Sai.png/revision/latest/scale-to-width-down/210?cb=20140525085549", "caption": "Luffy knocks Sai out of the ring."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Luffy_and_the_Corrida_Colosseum_Gladiators_Going_After_Doflamingo.png/revision/latest/scale-to-width-down/250?cb=20160608200003", "caption": "Sai with Luffy, Zoro, Law, Ucy and the other Corrida Colosseum combatants are on their way for Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Sai_Defeats_Lao_G.png/revision/latest/scale-to-width-down/200?cb=20150922213658", "caption": "Sai defeats Lao G."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Revived_Gladiators_Defeat_Donquixote_Pirates.png/revision/latest/scale-to-width-down/190?cb=20161221120222", "caption": "Sai and the other gladiators defeat the remaining Donquixote Pirates."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "Sai and the Happo Navy journeyed to their home country. After returning to Kano Country, Sai spoke to Uholisia and then broke off his engagement to her. Furious, Uholisia responded by giving Sai a beating. While Sai was covered in bandages, he and Baby 5 had their wedding."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Sai_and_Baby_5%27s_wedding.png/revision/latest/scale-to-width-down/200?cb=20171009200626", "caption": "Sai and Baby 5's wedding."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Sai later went to Mary Geoise to attend the Levely and got reacquainted with Rebecca and Leo. Sai then whispered to Leo, telling him that he planned to cut ties with his country after the Levely."}, {"type": "paragraph", "text": "Later, Charlos tried to take Shirahoshi by force and Sai had to hold Rebecca back to keep her from angering a World Noble and suffering the consequences. When Leo rushed to save Shirahoshi, Sai went to back him up, but they were both stopped by Rob Lucci."}, {"type": "paragraph", "text": "After Mjosgard stopped Charlos, Sai stood beside the Neptune Family as Mjosgard promised to protect Shirahoshi throughout the Levely."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/Sai_and_Leo_met_at_Mary_Geoise.png/revision/latest/scale-to-width-down/210?cb=20190519040616", "caption": "Sai and Leo meet at Mary Geoise."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sai vs. Corrida Colosseum Group C gladiators", "elements": [{"text": "Sai vs. Funk Brothers", "elements": []}, {"text": "Sai vs. Ideo (interrupted by Luffy and Chinjao)", "elements": []}]}, {"text": "Corrida Colosseum gladiators vs. Donquixote Pirates", "elements": [{"text": "Sai vs. Baby 5", "elements": []}, {"text": "Sai vs. Lao G", "elements": []}]}, {"text": "Sai and Leo vs. Lucci", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Sai and Ideo vs. Gladius and Lao G", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Originally in the manga, when Luffy met Sai, he took Luffy's gratitude as patronizing and subsequently got carried away with his anger, and as Boo forcefully pulled Sai away to keep him from starting a fight, Sai flashed his middle finger at Luffy. In the anime, this was censored out, with Sai simply getting angry and throwing a fit of rage as Boo pulled him away. It has become typical of the anime to nix the use of the middle finger gesture, as Trafalgar Law's uses of it have also been censored."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sai's favorite food is bento from his wife and his least favorite food is crab.", "elements": []}]}], "images": []}]}