{"sections": [{"title": "Suleiman", "level": 1, "content": [{"type": "paragraph", "text": "Suleiman the Beheader is a war criminal who joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi. He eventually joined the Beautiful Pirates, serving under Cavendish. He is an ally of Luffy during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Suleiman has straight, blond hair under a large black hat (decorated with a white skull and gold wings in the anime, mostly gold-colored with white accents in the manga), which covers one of his lilac colored eyes; it also has three bird-feathers. He wears a large black coat (red in the anime) with a pointed collar, a pair of military medals, a pair of grey pants (black in the anime) and a pair of dark grey heeled boots. He has a scar that goes across the center of his face."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appears to be a stoic yet patriotic man. Despite being an exiled war criminal, he claimed that he loves his country, even wearing his naval uniform despite his exile severing his connection to his home."}, {"type": "paragraph", "text": "Unlike most of the people who were freed by Sugar's curse, Suleiman isn't shown to be swayed by greed as he chose to fight the Donquixote Pirates instead of helping them."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Suleiman is extremely fast as he could easily match Rebecca's speed in combat. In the anime, he is observant with extremely sharp eyesight, able to visually keep up with Dellinger's immense speed and correctly deduced that Dellinger specialized in kicks."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Suleiman has shown to be an extremely skilled and powerful swordsman as he even managed to evade and counter Rebecca's \"Back to Water Dance\". Rebecca herself noted that Suleiman's swordsmanship is far lethal compared to many other powerful gladiators she has fought before. Suleiman's skills is shown when he disarmed Rebecca and later effortlessly defeating Acilia, cutting her down with multiple quick and powerful slashes that also destroyed her shield which is strong enough to withstand Logan's punches. He is ambidextrous as seen when he fought Dellinger, he uses his right hand while most of the time, he uses his left hand in battle."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past he was involved in the \"Sea Battle of Dias\" (ディアス海戦, Diasu Kaisen, \"Dias Naval Battle\" in the Viz Manga) and became a war criminal. After he was exiled from his country, he roamed throughout the underworld."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Suleiman entered the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block D."}, {"type": "paragraph", "text": "As Block D's battle royale began, Suleiman was seen preparing to fight."}, {"type": "paragraph", "text": "Suleiman later fought against Rebecca. He claimed that he did everything for his country and loved his homeland. He then asked her how she could cope living in a country where she is despised so much."}, {"type": "paragraph", "text": "Rebecca continued to evade Suleiman's attacks, but their fight was interrupted when Cavendish suddenly stood between them. They then saw Cavendish suddenly fall asleep and when several gladiators took the opportunity to attack him, his alter-ego, Hakuba, took control and proceeded to strike down all the remaining fighters in Block D. Suleiman fell victim to his attack and laid defeated on the arena."}, {"type": "paragraph", "text": "Suleiman was later transformed into a toy and forced to work in the underground trade port. When Sugar's curse broke, the toys returned to their original forms. Suleiman was among the former slaves praising Usopp for freeing them."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\", Suleiman and the other colosseum fighters escaped to the surface through an opening created by Pica when he rearranged the land with his ability."}, {"type": "paragraph", "text": "When he found Luffy, Zoro, and Law, Suleiman stated that he will defeat Doflamingo. Therefore, he joined forces with Luffy's group alongside the Chinjao Family, Hajrudin, Ideo, Fighting Bull, Blue Gilly, Cavendish, Abdullah , Jeet, Orlumbus, Elizabello II, and Dagama. When some of the former toys came for the heads of Luffy, Zoro, and Law, Suleiman and the allied colosseum fighters fought them off. They later marched towards the royal palace and began to battle against Pica."}, {"type": "paragraph", "text": "When Pica attacked, Chinjao and Elizabello II shattered his stone hand, enabling the group to move forward. Suleiman and the other allied fighters fought through Doflamingo's troops. Pica then attacked with his other arm, causing Suleiman and some of the other allies to fall back. After avoiding Pica's strike, they were surprised to see Luffy, Zoro, Law, Abdullah, Jeet, and Fighting Bull climbing on Pica's arm. They were also amazed when Luffy shattered Pica's stone head. When Pica's giant stone body stopped moving, Suleiman and his allies continued on with their assault."}, {"type": "paragraph", "text": "With Zoro fighting Pica and Sabo fighting the Marines, the colosseum fighters charged up the new King's Plateau and easily defeated the Donquixote Pirates' troops standing in their way."}, {"type": "paragraph", "text": "On the second level, Dellinger confronted Suleiman and began to mock him. As Suleiman stood, watching the strange pirate, Dellinger launched himself at Suleiman, knocking him down and impaling him with his horns."}, {"type": "paragraph", "text": "During the final phase of Doflamingo's game, Suleiman and the injured gladiators were temporarily healed by Mansherry. They later defeated the remaining Donquixote Pirates on the New King's Plateau to help the citizens flee from the shrinking Birdcage."}, {"type": "paragraph", "text": "With Bartolomeo's barrier, the gladiators worked together to push the Birdcage back just long enough for Luffy to defeat Doflamingo. After the Donquixote Pirates' downfall and the collapse of the Birdcage, the gladiators rested at the palace."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, Suleiman and the other gladiators prepared to assist the Straw Hats' escape from Dressrosa when the Marines were mobilized to pursue them."}, {"type": "paragraph", "text": "As the Straw Hats made their way to the eastern port, Suleiman and his fellow gladiators stood in the way of the Marines that were chasing after them."}, {"type": "paragraph", "text": "The fighters later gathered at the eastern port, preparing to fight Issho. When Issho prepared to attack them with all the rubble from Dressrosa, the fighters and the Straw Hats quickly fled to the escape ship. At that moment, Luffy arrived and attacked Issho."}, {"type": "paragraph", "text": "During the clash, Issho used his gravity ability to blow away Luffy, who was then caught by Hajrudin. The fighters and Straw Hats quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after Luffy. They eventually reached Orlumbus' flagship, the Yonta Maria. After boarding the ship, Suleiman announced that he had joined Cavendish's crew. The Beautiful Pirates was then one of the seven groups that pledged their allegiance to the Straw Hats."}, {"type": "paragraph", "text": "After the Straw Hat fleet was formed, the Straw Hats and company held a feast to celebrate their victory over Doflamingo."}, {"type": "paragraph", "text": "After Cavendish received Luffy's vivre card, the Beautiful Pirates parted ways with the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/21/Hakuba_Defeats_Block_D_Competitors.png/revision/latest/scale-to-width-down/210?cb=20151130174131", "caption": "Suleiman and the rest of Block D are defeated by Hakuba."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Dellinger_stabs_Suleiman.png/revision/latest/scale-to-width-down/180?cb=20150503172729", "caption": "Suleiman getting impaled by Dellinger."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Revived_Gladiators_Defeat_Donquixote_Pirates.png/revision/latest/scale-to-width-down/190?cb=20161221120222", "caption": "Sulieman and the other gladiators defeat the remaining Donquixote Pirates."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "As the Beautiful Pirates sails an unknown sea in the New World, Suleiman is present when Cavendish began to reminisce about his past. They later encountered two pirate crews that were deeply infatuated with Cavendish, who told Suleiman that there was no need to fire on them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ad/Cavendish_remembers.png/revision/latest/scale-to-width-down/180?cb=20171005225034", "caption": "Suleiman listens to Cavendish recounting his life."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Suleiman vs. Corrida Colosseum Block D gladiators", "elements": [{"text": "Suleiman vs. Rebecca", "elements": []}, {"text": "Suleiman, Rebecca, Orlumbus, Damask, Meadows, Mummy, Rolling Logan, and Acilia vs. Cavendish (as Hakuba)", "elements": []}]}, {"text": "Corrida Colosseum gladiators vs. the Donquixote Pirates", "elements": [{"text": "Suleiman vs. Dellinger", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Suleiman vs. Acilia", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, Suleiman defeats Acilia while she was protecting Rebecca. However, they were never shown fighting in the manga.", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name sounds similar to Sulayman Reis, a Barbary pirate who, after converting to Islam, worked under the Ottoman Empire during the 17th century.", "elements": []}, {"text": "In the game One Piece: Pirate Warriors 3, his head is used as one of the faces for Pirate Captain NPC, but his name is never mentioned and the NPC is always referenced as Pirate Captain.", "elements": []}]}], "images": []}]}