{"sections": [{"title": "Maynard", "level": 1, "content": [{"type": "paragraph", "text": "Maynard the Pursuer is a vice admiral who appears in the Dressrosa Arc. He was registered as a gladiator to compete at the Corrida Colosseum for the Mera Mera no Mi, but was defeated before he could participate."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Maynard is a muscular, broad-chested man with dark hair tied up in a wild ponytail that sticks out to one side. He also has a dark beard and a mustache."}, {"type": "paragraph", "text": "His outfit as a gladiator consists of a dark red cap, studded belt, briefs, a studded band on his left thigh which holds a knife, and sandals that reach just below his knees and are studded down the front. Under his cap he wears sunglasses."}, {"type": "paragraph", "text": "After leaving the colosseum, he wears the typical Marine coat with \"Justice\" (正義, Seigi) on the back. His cap is also different, with the word MARINE across the front, though it is still dark-colored unlike the white caps worn by most the Marines. In the anime, it is white."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Maynard has a strong sense of justice. He wanted to expose Doflamingo's acts to the world after escaping from the Colosseum. It is unknown whether he believes in absolute justice or moral justice."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "He disobeyed orders to go undercover in the Colosseum, and was berated by Vice Admiral Bastille for it. He was later surprised by Admiral Fujitora's decision to ignore the doings of Doflamingo."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "As a Marine, he is an enemy to all pirates, and shows no hesitation in attacking them."}], "images": []}, {"title": "Gambia", "level": 4, "content": [{"type": "paragraph", "text": "The pirate overheard Maynard talking to the Marines over a Den Den Mushi, and confronted him. Maynard defeated him with apparent ease, and left his unconscious body in a room."}], "images": []}, {"title": "Bartolomeo", "level": 4, "content": [{"type": "paragraph", "text": "After discovering Maynard was responsible for attacking Gambia, the pirate confronted Maynard as revenge for his subordinate. Bartolomeo defeated the Marine with ease, before leaving his unconscious body in a room."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Maynard has command over a substantial amount of lower ranked Marines. He was strong enough to defeat Gambia, one of Bartolomeo's crew."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "His raw strength is very powerful, as his hands were full of blood after beating up Gambia. He also seems to possess good stamina, as he was able to recover rather quickly after being beaten by Bartolomeo."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Maynard can also use the ability."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Maynard carries around a knife on his left leg, held by a band."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "He went undercover at the Corrida Colosseum tournament as fighter No. 0429, using the alias \"Capman\"."}, {"type": "paragraph", "text": "While reporting the names of competitors to his colleagues, he was discovered by Gambia. As Gambia questioned Maynard about what he was doing, he told his colleagues that he will call back in ten minutes. After hanging up, the vice admiral defeated Gambia and then unceremoniously left the pirate in the garbage room. While washing his hands, he called back to his colleague and told him to cross Gambia's name out, saying that he was mistaken about him and there was no need to worry."}, {"type": "paragraph", "text": "Later, just before Block B began, he was defeated by Bartolomeo and left inside the garbage room, in the same manner as he did Gambia earlier."}, {"type": "paragraph", "text": "Sometime later, Vice Admiral Bastille tried to get in touch with Maynard, but Maynard was not able to respond."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Bird cage\", Maynard left the colosseum and report to his colleagues. After receiving a scolding from Bastille, Maynard explained to Bastille and Issho about discovering Doflamingo's connection with the underworld. Maynard explained to Issho that it would be the best time to arrest Doflamingo, but Issho responded that it is not the World Government's role to play God in the wake of the anger-filled screams of the citizens and instructed the vice admiral to continue following his orders."}, {"type": "paragraph", "text": "Maynard, Issho, and an army of Marines were later stationed at the base of the new King's Plateau apparently to hinder the Straw Hats from reaching Doflamingo. However, while Luffy and his allies from the colosseum were charging up the new King's Plateau, the Marines were confronted by Sabo."}, {"type": "paragraph", "text": "Maynard was later seen at the North West Town Primula, leading the Marines to contain the chaos and subdue pirates looting the city."}, {"type": "paragraph", "text": "After the defeat of the Donquixote Pirates, Maynard makes a broadcast to Dressrosa's three neighboring countries and explained what transpired in the country itself."}, {"type": "paragraph", "text": "Later that night, Issho rolled a dice and decided not to capture Luffy and Law for the time being. Maynard objected to this decision, but Issho only told him to not complain."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. When Maynard heard that Luffy took Rebecca from the palace, he ordered his troops to capture Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6b/Maynard_Knocked_Out.png/revision/latest/scale-to-width-down/230?cb=20140303060701", "caption": "Maynard lies defeated by Bartolomeo."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Maynard vs. Gambia (unseen)", "elements": []}, {"text": "Maynard vs. Bartolomeo (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The anime extended Maynard's confrontation with Bartolomeo, showing them having a brief conversation before they fought. It also showed Maynard injured and trying to attack Bartolomeo before being defeated."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is possibly a reference to Robert Maynard, the English Royal Navy captain who was captain of the crew that killed the real-life pirate, Blackbeard.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 705 and Episode 634, Maynard makes his debut.", "elements": []}, {"text": "↑  https://one-piece.com/special/sbs/detail/7.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 705 and Episode 635, Maynard is defeated by Bartolomeo.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 75 Chapter 747 (p. 4-5) and Episode 682, Maynard asks Issho about Doflamingo's actions.", "elements": []}, {"text": "↑ One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 7) and Episode 511, Dr. Fishbonen states Haki is a power all vice admirals use.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 717 and Episode 647, Bastille fails to get in touch with Maynard.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 75 Chapter 750 (p. 18-19).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 76 Chapter 761.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 79 Chapter 792.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 79 Chapter 795.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 797.", "elements": []}]}], "images": []}]}