{"sections": [{"title": "Gambia", "level": 1, "content": [{"type": "paragraph", "text": "\"The Missionary\" Gambia is the staff officer of the Barto Club. He was also a gladiator competing at the Corrida Colosseum for the Mera Mera no Mi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gambia is a slim man with his top front teeth missing. He has jaguar spot tattoos on his upper arms, along with a cross tattoo on his chest. He has light colored hair in a beehive style with sideburns."}, {"type": "paragraph", "text": "He sports a headband with goggles and wears sunglasses. He also has a dark colored vest, and shorts that go to the middle of his thighs. He has high boots that start above his knees, and dark elbow pads. He also has nun-chucks sticking out of his shorts."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Gambia_Anime_Concept_Art.png/revision/latest/scale-to-width-down/90?cb=20181105195147", "caption": "Gambia's anime concept art."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appears to be a rather laid back and cheerful individual, and has thus far always been seen with a big smile on his face. He seems to respect big name criminals, as he called the people Maynard was talking about \"cool guys\"."}, {"type": "paragraph", "text": "Gambia also has a kind grandmother full of wisdom whom he loves enough that he is willing to regularly call her over the Den Den Mushi for her help, even if the advice she gives isn't reliable."}, {"type": "paragraph", "text": "Like his captain, he idolizes the Straw Hat Pirates. He can also be bold and daring like Bartolomeo, as he participated in burning the flag of one of the Yonko, Shanks."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Barto Club", "level": 3, "content": [], "images": []}, {"title": "Bartolomeo", "level": 4, "content": [{"type": "paragraph", "text": "Bartolomeo has been shown to take care for his crew as he violently beat up Vice Admiral Maynard for what he did to Gambia. Though the true extent of their relationship is unknown, his captain most likely cares for his well being, as he is shown being concerned about him upon finding him in an injured state and goes out of his way to confront Maynard and properly pay him back."}], "images": []}, {"title": "Granny", "level": 4, "content": [{"type": "paragraph", "text": "As the Barto Club lacks a proper navigator due to its members originally being a street gang, they often call Gambia's grandmother for advice on what to do in sticky situations. He is evidently dear to her, since she calls Gambia by an affectionate nickname, and Gambia also deeply cares about her, as do the rest of the Barto Club. However, his grandma's advice usually ends up being housekeeping tips that are not useful in times of crisis at sea."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Vice Admiral Maynard", "level": 4, "content": [{"type": "paragraph", "text": "Gambia encountered Maynard in the Colosseum and upon meeting him he questioned him over his affiliation to the Marines and not wanting his cover blown Maynard was forced to \"silence\" the pirate and leaving his unconscious body in the trash room. Maynard showed no remorse for his actions and told his associates to cross him off the list of pirates, however, Bartolomeo personally went after Maynard and defeated him for his actions."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a member of a promising rookie's crew, he is presumably very strong. He is strong enough to warrant a bounty of 67,000,000. He was, however, no match for Vice Admiral Maynard."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Gambia was seen holding nun-chucks, but it is not known how proficient he is in using them."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Gambia walked in on Vice Admiral Maynard in the changing rooms whilst the undercover Marine was informing his comrades about the situation, exclaiming how he had been talking about the \"cool guys\" and taking note of the vice admiral's Den Den Mushi, before cheerfully inquiring whether or not he had been talking to himself."}, {"type": "paragraph", "text": "He was rendered unconscious soon after by the vice admiral and then dumped into the storage and garbage room of the Corrida Colosseum."}, {"type": "paragraph", "text": "After the defeat of the Donquixote Pirates, the escape from Dressrosa, and the formation of the Straw Hat Grand Fleet, the Straw Hats (except the ones who remained on the Thousand Sunny) were brought to the Barto Club's ship, where Bartolomeo's crew happily welcomed them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Gambia_Defeated_by_Maynard.png/revision/latest/scale-to-width-down/210?cb=20140227221727", "caption": "Gambia is defeated by Maynard."}]}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "During a hail storm, the Barto Club revealed that they don't have a navigator and they usually called Gambia's granny to solve their problems. With his granny giving them useless advice, they needed to rely on the Straw Hats to protect the ship. After one week of traversing through the dangers of the New World, the ship arrived at Zou."}, {"type": "paragraph", "text": "After finding the Thousand Sunny, the Barto Club bid farewell to Luffy and his group."}], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "The Barto Club later visited an island. After Bartolomeo defeated the leader of a gang, Gambia was seen accompanying Bartolomeo as he was selling Straw Hat memorabilia to the citizens. As they were advertising their merchandise, Gambia and his captain were then shown Shanks' pirate flag, which was hanging above the town. In a daring act, Gambia and Bartolomeo then burned Shanks' flag, much to the horror of the citizens."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Bartolomeo_and_Gambia_burn_Red_Hair_Pirates%27_flag.png/revision/latest/scale-to-width-down/200?cb=20180927171438", "caption": "Bartolomeo and Gambia burn the flag of the Red Hair Pirates."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Gambia vs. Maynard (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "While the manga never said which block he was placed in, a sign from Episode 633 had him listed as a participant in block D.", "elements": []}, {"text": "The anime showed part of the battle between Gambia and Maynard that occurred off-panel in the manga.", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He shares his name with a country in west Africa.", "elements": []}, {"text": "As stated by Oda in an SBS, Gambia is a missonary of \"Luffy-senpaism\" (ルフィ先輩教, Rufi-senpaikyō).", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 705 and Episode 634, Gambia makes his debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 802 (p. 3), Gambia calls his grandmother for help.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 801.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 87 Chapter 875, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 10.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 802 (p. 3-5 & 13-15), Gambia, his crew, and his allies make their way to Zou.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 803.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 86 Chapter 869, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 6.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 87 Chapter 871, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 8.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 87 Chapter 873, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 9.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 87 Chapter 875, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 10.", "elements": []}, {"text": "↑  One Piece Anime — Episode 633, a sign lists Gambia as a participant in block D.", "elements": []}, {"text": "↑  One Piece Anime — Episode 634.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 82 (p. 102).", "elements": []}]}], "images": []}]}