{"sections": [{"title": "Hajrudin", "level": 1, "content": [{"type": "paragraph", "text": "Hajrudin is a giant warrior described as the \"new generation\" from Elbaf. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi, where he met Monkey D. Luffy and eventually pledged his loyalty towards him. He was an S-class pirate mercenary for Buggy's Pirate Dispatch Society but resigned after becoming the captain of the sixth ship of the Straw Hat Grand Fleet. He is also attempting the revival of the currently disbanded Giant Warrior Pirates, and is currently the captain of the New Giant Warrior Pirates."}, {"type": "paragraph", "text": "He is an ally of Luffy during the Dressrosa Arc, and one of the central characters from The Stories of the Self-Proclaimed Straw Hat Grand Fleet Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hajrudin is a muscular giant, well proportioned, and has long dark brown hair, mustache, and beard. He wears a metal helmet (gold in the manga) with protector shades over his eyes. He sports large metal vambraces (gold in the manga) with shields on each one. He also wears a pair of black underwear under a large brown belt with brown parts that hang down in a skirt-like fashion. He also has a gold belt buckle, and sports big black boots. After leaving Buggy's Delivery, Hajrudin wears armor plates over his belt and below his chest, a thick fur cape, and bigger vambraces."}, {"type": "paragraph", "text": "When he was a child, Hajrudin was stocky, and wore striped pants held up by suspenders, as well as a large dark belt lined with fur. He also wore a warrior's helmet and carried a sword that was taller than him."}, {"type": "paragraph", "text": "After he was turned into a toy, he became an elephant and wore a black cap."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is an arrogant individual, bragging that if he wins the competition and acquires the Mera Mera no Mi, he will become the king of the giants."}, {"type": "paragraph", "text": "However, Hajrudin is also a very honorable and prideful person, as befitting a warrior of Elbaf. He held Usopp in the air so everyone could see the man who saved him and the others, and proclaimed he would follow Usopp out of gratitude. In addition, upon meeting Luffy outside the Colosseum, he told him that he would put aside his defeat and kill Doflamingo to repay his debt to him. He would later decide to pledge his loyalty to Luffy and become a part of the Straw Hat Grand Fleet for the same reasons. He even cut all ties to Buggy's Delivery and quit his job as a pirate mercenary, leaving in order to honor his new allegiance to Luffy and the Straw Hats. His honor and pride as a warrior is great, as despite his many injuries during his battle against Machvise, he was determined to repay his debt to his saviors, and continued his battle against Machvise, sustaining even more serious injuries in order to finally defeat him."}, {"type": "paragraph", "text": "His honor and pride also seems to extend to his race as well, as he wants to plan and lead the revival of the currently disbanded Giant Warrior Pirates, an infamous crew that had been disbanded for a hundred years, and has already succeeded in recruiting four giants in pursuit of achieving this goal. He has been working toward this ever since he was young, being shown training hard at the age of 18."}, {"type": "paragraph", "text": "Like many people, Hajrudin has a unique laugh: \"Digagagaga\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Stansen", "level": 4, "content": [{"type": "paragraph", "text": "Stansen had known Hajrudin since childhood. In adulthood, Stansen joined Hajrudin's crew in his goal to revive the Giant Warrior Pirates and became his shipwright."}], "images": []}, {"title": "Gerd", "level": 4, "content": [{"type": "paragraph", "text": "Gerd had known Hajrudin since childhood. In adulthood, Gerd joined Hajrudin's crew in his goal to revive the Giant Warrior Pirates and became his doctor."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Elbaf Giants", "level": 4, "content": [{"type": "paragraph", "text": "Hajrudin deeply respects Elbaf's traditions. He had a good relationship with his teacher, Raideen, who trained Hajrudin when he was very young. He also has great admiration for Jorul and Jarul and was infuriated when Jorul died as a result of Charlotte Linlin's actions."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Hajrudin was initially hostile towards Luffy due to being opponents at the Corrida Colosseum tournament. However, after his transformation into a toy, Hajrudin witnessed Usopp fighting Trebol and Sugar and promised to work for him if he managed to succeed. After he was freed from Sugar's toy curse by Usopp, Hajrudin kept his word and picked Usopp up and expressed his gratitude towards the Straw Hats' sniper before showing him to the other freed slaves to acknowledge him as their savior. He then decided to repay his debt towards Usopp by allying with Luffy, telling him that he would forget his earlier defeat at the Colosseum to aid him in the decisive battle against the Donquixote Pirates. He was intent on repaying his saviors by stopping Machvise from attacking Zoro and sent the Donquixote officer flying as Zoro thanked him for his actions. After Doflamingo's downfall, Hajrudin became one of the representatives of the Straw Hat Grand Fleet."}], "images": []}, {"title": "Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "After the events on Dressrosa, Hajrudin decided, along with his allies, for his crew to travel under the Straw Hat Pirates' flag as the sixth ship of the Straw Hat Grand Fleet."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Hajrudin had known the Yonko when he was only 18 years old and just like the other giants, he had come to hate Linlin for devastating an Elbaf village and killing Jorul, one of the giants' greatest heroes. He even urged Jarul to kill Linlin, saying that it was for Elbaf's pride."}], "images": []}, {"title": "Donquixote Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After he was defeated at the Corrida Colosseum tournament, Hajrudin was turned into a toy and enslaved by Doflamingo's crew. After Sugar's curse broke, Hajrudin chose to ally with Doflamingo's enemies and helped ensure the downfall of the Donquixote Pirates by defeating one of their officers, Machvise."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a giant warrior of Elbaf, Hajrudin is tremendously strong being formerly an S Class member in Buggy's Pirate Dispatch Society. His punches were described as bolts of thunder, allowing him to overpower several powerful gladiators and crush Ucy. However, Lucy, angered that he had crushed Ucy, was able to knock him out with a single punch."}, {"type": "paragraph", "text": "He has immense pain tolerance, able to withstand tremendous physical strain that nearly cost him an arm as well as taking the breaking of his right leg from the brutal force of Machvise's 10,000 Ton attack head on through sheer will and even managed to muster enough physical power to counter and overpower Machvise's attack, sending the officer flying straight into Doflamingo's Birdcage, incapacitating the former in the process."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Hajrudin wears giant gauntlets, which he uses to hammer his fists down onto his enemies. He also wields a huge spiked club and seems to be quite proficient at using it, swatting a group of bounty hunters aside. When he was younger, he wielded a large broadsword. When he became captain of the New Giant Warrior Pirates, Hajrudin was seen holding a massive broadaxe."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Gungnir (, Gunguniru, literally meaning \"Hero's Spear\"): Hajrudin performs an uppercut with tremendous force, capable of sending someone flying a great distance. He first used this technique to defeat Machvise's 10,000 Ton Vise, cracking his shield in half and sending the Super-Weight Human flying, though the strain caused the performing right arm and the supporting right leg's bones to shatter.Gungnir is the spear wielded by the Norse god, Odin.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Gungnir.png/revision/latest/scale-to-width-down/210?cb=20150922150229", "caption": "Hajrudin uses Gungnir against Machvise."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When he was 18 years old, Hajrudin was seen training at Elbaf before the Winter Solstice Festival. After a sparring match with Raideen, Hajrudin greeted Jorul and Jarul when they arrived at the village to invite the children to feast on semla prior to the 12-day fast. On the seventh day of the fast, an incident occurred where Charlotte Linlin‎ devastated an Elbaf village due to her craving sickness and fatally injured Jorul. After the giants calmed Linlin down by giving her semla, Hajrudin was enraged at Linlin's actions and urged Jarul to kill her as Carmel pleaded the elder giant to spare her."}, {"type": "paragraph", "text": "Later in his life, he and four other giants had begun a plan to recruit more giants and revive the formerly infamous giant pirate crew, known as the Giant Warrior Pirates, with Hajrudin leading this new crew. As a result of this pursuit, Hajrudin had gained great fame as one of the \"new generation\" of pirates."}, {"type": "paragraph", "text": "At some point, Hajrudin and his crew joined Buggy's Pirate Dispatch Society where he became an S-class pirate mercenary."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Hajrudin entered the Corrida Colosseum to compete for the Mera Mera no Mi. He was seen by Vice Admiral Maynard and his name was given to an officer outside the Colosseum who was writing names down. For the battle royale, he was placed in Block C."}, {"type": "paragraph", "text": "He stood strong in the middle of the battlefield and eliminated any contestant that crossed his path until Lucy and Ucy ran into him. He tried to eliminate both of them with one smash of his shield and successfully defeated Ucy. But as he walked away, Lucy stood up and avenged Ucy, eliminating Hajrudin from the competition with a single punch."}, {"type": "paragraph", "text": "As the crowd was shocked at Hajrudin's swift defeat and cheered Lucy on, Hajrudin's unconscious body was unceremoniously punched aside by Ideo to clear the ring."}, {"type": "paragraph", "text": "Sometime later, Hajrudin was supposed to receive treatment for his injuries but instead was thrown into an underground dungeon filled with broken toys and some of the other disqualified participants. Once Sai joined them and demanded an explanation, Hajrudin commented that the losers were being dumped into the dungeon for some reason. Soon afterwards, he listened as Ricky revealed himself to be the former king of Dressrosa, Riku Doldo III."}, {"type": "paragraph", "text": "Hajrudin was later transformed into a toy and put to work in the underground trade port. While witnessing Usopp's confrontation with Trébol and Sugar, he silently begged Usopp to succeed, saying that he will even work for him."}, {"type": "paragraph", "text": "When Sugar lost consciousness, Hajrudin transformed back into his original form. He later blocked Trébol, who was attacking Robin, and then picked up Usopp and held him high for all the freed toys to see, declaring him as their savior."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\", Hajrudin and the other colosseum fighters escaped to the surface through an opening created by Pica when he rearranged the land with his ability."}, {"type": "paragraph", "text": "When he found Luffy, Zoro, and Law, Hajrudin stated that he will forget about his fight with Luffy at the colosseum and repay his debt to Usopp by defeating Doflamingo. Therefore, he joined forces with Luffy's group alongside the Chinjao Family, Suleiman, Ideo, Fighting Bull, Blue Gilly, Cavendish, Abdullah, Jeet, Orlumbus, Elizabello II, and Dagama. When some of the former toys came for the heads of Luffy, Zoro, and Law, Hajrudin and the allied colosseum fighters fought them off. They later march towards the royal palace and battle against Pica."}, {"type": "paragraph", "text": "When Pica attacked, Chinjao and Elizabello II shattered his stone hand, enabling the group to move forward. Hajrudin and the other allied fighters fought through Doflamingo's troops. Pica then attacked with his other arm, causing Hajrudin and some of the other allies to fall back. After avoiding Pica's strike, they were surprised to see Luffy, Zoro, Law, Abdullah, Jeet, and Fighting Bull climbing on Pica's arm. They were also amazed when Luffy shattered Pica's stone head. When Pica's giant stone body stopped moving, Hajrudin and his allies continued on with their assault."}, {"type": "paragraph", "text": "With Zoro fighting Pica and Sabo fighting the Marines, the Colosseum fighters charged up the new King's Plateau and easily defeated the Donquixote Pirates' troops standing in their way. They later reached the first level and got ahead of Luffy."}, {"type": "paragraph", "text": "After reaching the second level, the Colosseum fighters were confronted by four of the Donquixote Pirate officers. The Colosseum fighters later banded together to create an opening for Luffy and Cavendish."}, {"type": "paragraph", "text": "Later on, Hajrudin faced off against Machvise. The officer later used his 10 Ton Vise attack to bring down the giant."}, {"type": "paragraph", "text": "Zoro passed by where the giant fell and Machvise turned his attention to the swordsman. Resolving to repay his saviors, Hajrudin arose and launched a powerful punch called \"Gungnir\" against Machvise's 10,000 Ton Vise. After a brief struggle, Hajrudin successfully sent the officer flying into the ceiling of the birdcage, defeating him. Hajrudin then passed out from his injuries and Zoro promised him that when the giant wakes up, the birdcage will be brought down."}, {"type": "paragraph", "text": "After most of the Donquixote Pirates' officers were defeated, Pica preyed on the injured, including Hajrudin."}, {"type": "paragraph", "text": "During the final phase of Doflamingo's game, Hajrudin and the other injured gladiators were temporarily healed by Mansherry. They then defeated the remaining Donquixote Pirates on the New King's Plateau to help the citizens flee from the shrinking Birdcage."}, {"type": "paragraph", "text": "When the Birdcage came close to the central streets, the gladiators worked together to push back the Birdcage via Bartolomeo's barrier. Eventually, the effects of Mansherry's healing powers began to wear off and Hajrudin collapsed."}, {"type": "paragraph", "text": "His efforts were not in vain as Luffy was bought enough time to defeat Doflamingo and bring down the Birdcage."}, {"type": "paragraph", "text": "Later that night after the aftermath, Hajrudin and the other gladiators were seen resting at the palace."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, Hajrudin and the other gladiators prepared to assist the Straw Hats' escape from Dressrosa when the Marines were mobilized to pursue them."}, {"type": "paragraph", "text": "As the Straw Hats made their way to the eastern port, Hajrudin and his fellow gladiators stood in the way of the Marines that were chasing after them."}, {"type": "paragraph", "text": "The fighters later gathered at the eastern port, preparing to fight Issho. When Issho prepared to attack them with all the rubble from Dressrosa, the fighters and the Straw Hats quickly fled to the escape ship. At that moment, Luffy arrived and attacked Issho."}, {"type": "paragraph", "text": "During the clash, Issho used his gravity ability to blow Luffy, who was then caught by Hajrudin. The fighters and Straw Hats quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after Luffy. They eventually reached Orlumbus' flagship, the Yonta Maria. After boarding the ship, Hajrudin's crew was then one of the seven groups that pledged their allegiance to the Straw Hats."}, {"type": "paragraph", "text": "When Luffy was asked to drink a sake cup to complete the agreement for an alliance, Luffy declined, much to the others' shock. Once Luffy explained that they can do whatever they want, the allies decided to forge the alliance anyway, forming the Straw Hat Grand Fleet. Sai, Bartolomeo, Leo, Cavendish, Ideo, Orlumbus, and Hajrudin sat down and drank their sake cups. Afterwards, they held a feast to celebrate their victory over Doflamingo."}, {"type": "paragraph", "text": "After the feast, Hajrudin and the other leading allies received Luffy's vivre card and parted ways."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ca/Luffy_Defeats_Hajrudin.png/revision/latest/scale-to-width-down/200?cb=20160131191937", "caption": "Luffy defeats Hajrudin with a single punch."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/49/God_Usopp.png/revision/latest/scale-to-width-down/200?cb=20180126195454", "caption": "Hajrudin holds up Usopp in praise before the former toys."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Luffy_and_the_Corrida_Colosseum_Gladiators_Going_After_Doflamingo.png/revision/latest/scale-to-width-down/250?cb=20160608200003", "caption": "Hajrudin with Luffy, Zoro, Law, Ucy and the other Corrida Colosseum combatants are on their way for Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b1/Hajrudin_defeats_Machvise.png/revision/latest/scale-to-width-down/200?cb=20141215131850", "caption": "Hajrudin defeats Machvise."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Revived_Gladiators_Defeat_Donquixote_Pirates.png/revision/latest/scale-to-width-down/190?cb=20161221120222", "caption": "Hajrudin and the other gladiators defeat the remaining Donquixote Pirates."}]}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "Hajrudin later sent a message to Buggy, informing him of the giants' decision to leave the Pirate Dispatch Society."}], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "After resigning from Buggy's Delivery, Hajrudin and his crew sailed away from Buggy's headquarters. Having placed himself on the deserter list of Buggy's Delivery, Hajrudin declared himself captain of the New Giant Warrior Pirates."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hajrudin vs. Corrida Colosseum Block C Gladiators", "elements": [{"text": "Hajrudin vs. Fighting Bull", "elements": []}, {"text": "Hajrudin vs. Lucy", "elements": []}]}, {"text": "Corrida Colosseum gladiators vs. Donquixote Pirates", "elements": [{"text": "Hajrudin vs. Machvise", "elements": []}]}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hajrudin is the first giant from Elbaf shown after the timeskip.", "elements": []}, {"text": "His name is similar to the first name of the famous Ottoman fleet admiral Hayreddin Barbarossa.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "His favorite food is meatballs and his least favorite food is semla.", "elements": []}]}], "images": []}]}