{"sections": [{"title": "Little Oars Jr.", "level": 1, "content": [{"type": "paragraph", "text": "Little Oars Jr. (also referred to as Oars III on his flag) is the captain of the Little Pirates, a descendant of Oars, and a subordinate of the Whitebeard Pirates. He is among the several New World pirates aiding the Whitebeard Pirates in saving Ace from execution by the World Government."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Little Oars Jr. is an abnormally large giant, standing at around 124 feet tall, which has been stated to be about two times the size of a typical grown giant.. His nickname is a tribute to his grandfather Oars who was taller. His overall shape and silhouette resembles his ancestor greatly - large forearms and hands, small lower body and barrel-like gut. His skin is yellow-green and he has orange hair reaching down to his legs, which are quite small in comparison to his large belly and hairy forearms. He has large fangs and horns pointing upward, black triangle-like marks just above his eyes, and some stubble on his chin. He also wears three skulls on a beaded necklace rather than a belt, but the most notable item among his effects is a gigantic kasa hat that Ace made for him, which is usually seen resting on his back in a similar fashion to Luffy."}, {"type": "paragraph", "text": "He also sports a black, open indument that looks like a jacket, samurai-like armor plates protecting his chest and back, linked together by chains, and a loincloth with a mimetic pattern on it which looks like the Marine's battleships' hull and which is held up by a fur-lined belt. He carries around a gigantic sword fitting his size, with a large blade and a long hilt."}, {"type": "paragraph", "text": "In the video game One Piece: Gigant Battle!, his color scheme is similar to his ancestor Oars (the game was developed before Little Oars Jr.' color scheme was revealed in the anime)."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little Oars Jr. seems to be a very caring and kind person at heart. As shown in flashbacks, he was carefree and appreciated the little things in life, such as the straw hat Ace made for him. He is also shown to be very determined and loyal, as demonstrated when he went straight through enemy lines to rescue Ace, despite being hit by Kuma's Ursus Shock, impaled by Gecko Moria's Tsuno-Tokage and having one of his legs severed by Doflamingo. This mirrors his ancestor's determination and endurance, but contrasts with his brutal, ruthless nature."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Ace", "level": 3, "content": [{"type": "paragraph", "text": "It is shown in flashbacks that Little Oars Jr. had a great friendship with Ace, symbolized through the gigantic kasa that Ace made for him. It is shown both cooling him down and protecting him from the elements, with Oars contentedly remarking that his head is protected. For their friendship, Little Oars Jr. is determined to save Ace's life, risking his life and limb."}], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "His crew is made up of normal sized humans that are imitating his look, with fake yellow jaws with big fangs and long orange hair. They seem to care deeply for their captain, as in flashbacks they were often seen showing concern about his well being when he preferred to sit out in the cold and rain, than taking shelter."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1b/Little_Oars_Jr.%27s_Crew.png/revision/latest/scale-to-width-down/230?cb=20150802035047", "caption": "Little Oars Jr.'s crew."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a giant of immense size, Little Oars Jr. has incredible strength, enough to lift both Marine battleships and one of Whitebeard's paddle ships and throw them, the first for destruction, and the second as a way of helping his allies to enter the Plaza. He also displayed incredible fortitude in proportion with his own size, since he was relatively unfazed after receiving several cannon shots from the marines prior to being felled by Kuma's Ursus Shock. Little Oars Jr. also has immense stamina and pain tolerance; he sustained injuries from three Shichibukai, incoming Marine and the Marines' artillery without once losing his resolve to save Ace, and standing back on his feet after a short time. Ordinary cannon fire seems to have little effect on him. He was able to beat Vice Admiral Lacroix effortlessly and it took an enormous amount of damage for him to lose consciousness and pass out."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6d/Oars_Jr._lifting_a_Marine_Battleship.png/revision/latest/scale-to-width-down/230?cb=20121022035422", "caption": "Little Oars Jr. lifting a Marine Battleship."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Little Oars Jr. carries around a gigantic sword fitting his size. It has a broad blade with a single cutting edge, and a long hilt with a red hilt-wrapping. When not in use, it's seen resting on its owner's right hip, suggesting that Little Oars Jr. is left-handed, or even ambidextrous. When in his hands, the sword becomes a terrifying weapon, as the sheer force behind his blows can shatter almost any other weapon, including those wielded by other giants."}, {"type": "paragraph", "text": "The blade was destroyed when Little Oars Jr. was hit by Kuma's Ursus Shock."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Little_Oars_Jr.%27s_Sword.png/revision/latest/scale-to-width-down/230?cb=20151102192530", "caption": "Little Oars Jr. destroying a marine battleship with his huge sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Little Oars Jr. and Ace became friends. As a gesture of friendship, Ace gave Little Oars Jr. a kasa, which he learned to make in the Wano Country, though it took him three tries since he burned the previous two due to his Mera Mera no Mi powers. Having been given such a great gift, Little Oars Jr. was able to happily stay in the wide open without getting wet from rain, hot from the sun, or having snow pile up on his head."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Little_Oars_Jr_Hat.PNG/revision/latest/scale-to-width-down/230?cb=20190824154452", "caption": "Ace gives Little Oars Jr. his Kasa."}]}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Little Oars Jr. found out that Ace was to be executed, he and his crew immediately joined Whitebeard's forces to save him. At Marineford, Little Oars Jr. plowed through the Marine forces regardless of his own health and safety. Having recklessly charged into the defending marines, he was struck by Kuma's Ursus Shock and had the lower half of his right leg severed by Doflamingo. Despite his severe wounds, Little Oars Jr. pressed ever forward, determined to save his old friend. However, just as he was about to reach Ace, Little Oars Jr. was impaled by Moria through the chest. Unable to go on, he collapsed on the battlefield, allowing his allies to use the route he had opened up to invade the bay. After this, many believed he had died from his injuries."}, {"type": "paragraph", "text": "As the battle went on, his collapsed body unintentionally continued to help his allies as it had landed right on top of a section of the mechanical siege wall surrounding the island. Due to the massive weight of his body, it prevented the Marines to fully raise the section up. To further put a wrench in their tactics, his blood was also clogging up the machine's gears. Doing so gave his allies a chance to infiltrate the Marines' defenses. As his allies and the Marines tried to deal with this development, Little Oars Jr. awoke."}, {"type": "paragraph", "text": "Having woken up and gone back into the battle, Little Oars Jr. was instructed by Whitebeard to hold his ground in order to aid the other pirates with a decisive tactic using his strength. With the last hidden ship of Whitebeard surfacing and his allies on board, Little Oars Jr. carried the ship out of harm's way, straight through the hole in siege wall he created, and into the plaza of Marineford."}, {"type": "paragraph", "text": "Having aided his allies, Little Oars Jr. was knocked unconscious again by cannon fire. His fate after the war is currently unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Kuma_Attacks_Little_Oars_Jr.png/revision/latest/scale-to-width-down/210?cb=20100831061924", "caption": "Oars Jr. vs Kuma."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Oars_ship.png/revision/latest/scale-to-width-down/230?cb=20101117101346", "caption": "Little Oars Jr. pushing Whitebeard's ship through the barricade."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Little Oars Jr. vs Vice Admirals Momonga, Dalmatian, Onigumo, and another (unseen)", "elements": []}, {"text": "Little Oars Jr. vs. Giant Squad", "elements": []}, {"text": "Little Oars Jr. vs. Bartholomew Kuma, Donquixote Doflamingo and Gecko Moria", "elements": []}]}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The name \"Oars III\" is written on the bottom of the Jolly Roger. This also ended the debate of how to spell Oars' name, because before this it was romanized in many different ways: Oz, Odz, Odr, and Oor."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His ship can be seen alongside the other pirate ships allied with Whitebeard's fleet. His Jolly Roger is a skull that resembles his face, with massive downward horns, and crossbones in a cross, similar to that of the Whitebeard Pirates'.", "elements": []}, {"text": "His flag indicates he is the third person in his family to bear his ancestor's name.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Little_Pirates%27_Jolly_Roger.png/revision/latest/scale-to-width-down/250?cb=20151024051739", "caption": "Little Oars Jr.'s Jolly Roger."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 554 and Episode 463, Little Oars Jr. is introduced.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Information about Little Oars Jr. revealed.", "elements": []}, {"text": "↑ One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 517, two years pass in the storyline.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 201), Little Oars Jr.'s birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 56 Chapter 551, Little Oars Jr.'s ship flag shows the written Oars III", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World, Oars Jr. is large as two giants.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 555 and Episode 464, Little Oars Jr. remembers Ace's kindness as he desperately tries to save Ace.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 556 and Episode 464, Little Oars Jr.'s crew cry out for their captain as he is injured.", "elements": []}, {"text": "↑", "elements": []}, {"text": "↑  One Piece Manga — Vol. 58 Chapter 565, Little Oars Jr.'s body and blood stop the Marines' siege wall from raising up fully.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 565 and Episode 566, Little Oars Jr. wakes back up and aids his allies.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 551 and Episode 460, Little Oars Jr.'s ship is seen alongside the other pirate ships allied with Whitebeard's fleet.", "elements": []}]}], "images": []}]}