{"sections": [{"title": "Giant Squad", "level": 1, "content": [{"type": "paragraph", "text": "The Giant Squad is the name given to a group of giants in the Marine ranks assembled to guard the execution platform to be used for Portgas D. Ace's execution. They consist of at least eight giants."}], "images": []}, {"title": "Members", "level": 2, "content": [{"type": "paragraph", "text": "Lacroix and Ronse are vice admirals. The ranks and names of other members are unknown yet; however, given that all members wear Marine Longcoats with epaulettes, they are at least captain-ranked."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/78/Giant_Squad_as_Young_Marines.png/revision/latest/scale-to-width-down/230?cb=20121205212538", "caption": "Some of the Giant Squad in their youth as Marines."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "They were assigned to guard the execution platform. As the war with the Whitebeard Pirates and the Marines began, they were told by Kizaru to be prepared for air attacks after Marco revealed his phoenix Devil Fruit powers. Then, Jozu hurled a gigantic iceberg at them with the intention of wiping them out, but Akainu melted the iceberg first. When Oars Jr. made his move, some of them tried to intercept the larger giant; however, he plowed through the Marine front lines and them as well."}, {"type": "paragraph", "text": "Oars Jr. defeated Lacroix,Whitebeard knocked out Ronse with a single shock-wave imbued punch, and Luffy took down the one with a scar on the right side of his chest, wearing his Marine cap backwards with his Gomu Gomu no Gigant Rifle."}, {"type": "paragraph", "text": "Once Shanks and his crew arrived at Marineford to end the war, the Giant Squad, along with all the Marines, stood down on Sengoku's orders. They were severely wounded and incapacitated, tending to one another's injuries."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/Giant_squad_injured.png/revision/latest/scale-to-width-down/230?cb=20110308035445", "caption": "The Giant Squad at the end of the war."}]}, {"title": "One Piece: Film Z", "level": 3, "content": [{"type": "paragraph", "text": "The Giant Squad were summoned to a Marine summit meeting discussing the events prior of Z betraying and attacking them. They were shown in a separate room watching a live feed of Sakazuki speaking to everyone over the TV."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Giant_Squad_Film_Z.png/revision/latest/scale-to-width-down/230?cb=20140722071833", "caption": "Four of the Giant Squad members at the Marine summit (in the background)."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime additional scenes were added of the Giants fighting Oars Jr. as he threw one of the Marine warships at them. The unnamed female giant tried to attack Oars Jr. with a spear but was effortlessly knocked back."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 550 (p. 13) and Episode 459.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 554 (p. 4-5) and Episode 463.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 555 (p. 6-7) and Episode 464.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 556 (p. 4-5) and Episode 465.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 554 and Episode 463.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 555 and Episode 464.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 558 (p. 16-17) and Episode 467.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 580 and Episode 489.", "elements": []}, {"text": "↑  One Piece Movie 12, The Giant Squad appears in Movie 12.", "elements": []}]}], "images": []}]}