{"sections": [{"title": "Kelly Funk", "level": 1, "content": [{"type": "paragraph", "text": "Kelly Funk is an assassin from the Mogaro Kingdom and Bobby Funk's older brother. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kelly Funk is an average-sized man, just tall enough to reach his brother, Bobby Funk's, chest. He is seen bare-chested with red star tattoos across his left shoulder. He has somewhat shaggy black hair with a wavy forelock that sticks up. He wears red gloves and trousers with black and red vertical stripes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When seen in combat, Kelly is shown to be a belligerent and ruthless fighter, thrashing his opponents long after they have been knocked out and unaware of his environment while he does so. He is also insecure about his height, constantly checking for anyone calling him a midget and will violently attack those who do."}, {"type": "paragraph", "text": "Kelly is also deceitful and ungrateful by nature, as he lured Law and Luffy into a trap solely to get the bounty that Doflamingo placed on their heads, showing how ungrateful he was of being rescued by Luffy's crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kelly was a skilled assassin in the past. He uses boxing for his fighting style. He was also said to be capable of taking down pirates worth over 100 million."}, {"type": "paragraph", "text": "Kelly can land extremely strong punches at amazing speed, so fast that the enemy does not even have time to fall to the ground before the next punch hits them. However, when confronted by Boo, Kelly was knocked out effortlessly, highlighting his lack of endurance."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Kelly ate the Jake Jake no Mi, a Paramecia-type Devil Fruit which allows him to be worn like a fullbody jacket by humans, animals, or even monsters, granting him their physiques and powers. Bobby wears his brother like so to make the most of their fighting strength, combining Kelly's speed, skill and ferocity with Bobby's strength, resilience and hulking physique."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a1/Jake_Jake_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20170607182134", "caption": "The Jake Jake no Mi being used."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Kelly used an ordinary pair of boxing gloves during the Block C battle. He later used a pair of boxing gloves with spikes across the knuckles to increase the damage of his punches. He also wields what appears to be a combination of a gatling gun, and tommy gun, or shotgun/rifle, during his attempted alliance with Donquixote Doflamingo."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Kelly was an assassin."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Kelly Funk and his brother, Bobby Funk, came from the Mogaro Kingdom to the Corrida Colosseum to compete for the Mera Mera no Mi, in order to help their country. He and his brother were placed in Block C."}, {"type": "paragraph", "text": "After Lucy defeated Spartan, Kelly was first seen alongside his brother, arguing with Dagama. The shorter Funk Brother demanded that the Prodence Kingdom tactician stop conspiring with the strong competitors in his block, with Bobby commenting that a fight is a personal thing. In full agreement with his brother, Kelly comments on how Dagama is using conspiracy and bribery to get his way. However, the tactician is not phased with the brothers' threats, and states that they must have been sent from their own country in order to get the Mera Mera no Mi for \"war and diplomatic relations\", before pointing out the other big name competitors fighting for the same prize. Kelly is then seen gritting his teeth in anger as Dagama accuses them of scheming just like everyone else present."}, {"type": "paragraph", "text": "As Block C began, Kelly and Bobby were seen preparing to fight. Later, as the battle royale commenced, Kelly, along with Chinjao, Sai, and Jean Ango, were seen watching as Lucy plowed through his fellow competitors while riding on the back of Fighting Bull."}, {"type": "paragraph", "text": "Kelly was later shown mercilessly beating a fighter who was already unconscious. Alarmed, his brother tried to stop him, but ended up accidentally grabbing his brother's victim instead of him. Before he could continue his vicious beat down on his battered victim, Kelly was finally restrained by Bobby. He angrily stated that the guy he had been beating up had called him a midget, before demanding to know if he was a midget from his brother. Bobby assured him that he was not, but Kelly once again started beating the unfortunate fighter, angrily demanding for him to say something, with Bobby once again grabbing the wrong person in an second attempt to stop his brother. Kelly finishes his brutal beat down by threatening to gouge the man's eyes out, before telling Bobby to stop trying to stop him all the time."}, {"type": "paragraph", "text": "After this, Boo approaches them, curious to see how a boxer with no formal training would fair against him. Before the shorter Funk Brother can react, the Chinjao Family member immediately sends Kelly flying with a quick jab to the chin, calling him a midget at the same time. Boo then turns his sights on Bobby, who desperately claims he had never been in a fight before. As the taller Funk Brother cowers over his brother's body, he exposes his back to Boo, who takes the opportunity to swing an axe down on him. Much to the man's surprise, however, his axe breaks. What was even more surprising to Boo was that he had imbued Busoshoku Haki into that last attack, leading him to question how strong Bobby's body is. As his brother expresses his concern for him, Kelly, nearly unconscious, growls how that bastard had called him a midget, before telling Bobby to \"put it on\". As Boo continues to puzzle over the density of Bobby's back, what appears to be a larger, enraged Kelly with Bobby's hat and hair turns the tables on him, to Sai's consternation, by hitting him with a barrage of punches that knocks him unconscious. As he continues to land blow after blow on the unfortunate Boo, Kelly demands that the man try and call him a midget again, threatening to bite his throat out."}, {"type": "paragraph", "text": "Having defeated Boo, Kelly continues to rain havoc down upon his fellow Block C competitors. It is then revealed by another fighter in the arena, who had seen what had just happened, that Kelly had unzipped and deflated like a jacket and Bobby had then donned him, much to Boo's shock. As Bobby literally puts him on, Kelly reveals that even though he had been born with a strong body, Bobby was unsuited for combat due to his weak personality, so Kelly takes care of the fighting for him by taking over that personality like a \"second skin\". Kelly then reveals that he is a Jacket Man who ate the Jake Jake no Mi, allowing him to be worn like a suit to borrow his wearer's body and strength, before proceeding to begin pummeling Boo with his Rarara Rambo attack."}, {"type": "paragraph", "text": "Back in the present, Kelly had just defeated another fighter when he is confronted by Sai. Kelly then declares that he and his brother are working together as killers, and proceeds to taunt the martial artist, saying that he is pitiful for not being able to protect his little brother. Unfazed by his insults, Sai merely states that his brother had not trained enough. Smirking, Kelly comments on how strict the man is, before launching into another Rarara Rambo attack. As he throws punch after punch in Sai's direction, he taunts him once more by wondering if the Flower Country's kenpo was really as powerful as he had heard. Kelly is then shown looking stunned as the 13th leader of the Happo Navy demonstrates his speed and strength by climbing into the air atop Kelly's flying fists and delivering a Hasshoken-infused kick to his head, knocking the brothers out instantly."}, {"type": "paragraph", "text": "Kelly Funk later went to the underground medical treatment facility to receive treatment for his injuries. While waiting for his turn, he was annoyed with Sai yelling at a doctor concerning Chinjao. Shortly afterwards, he was tricked and thrown into an underground dungeon, alongside Ideo and Boo, where they joined the other disqualified participants."}, {"type": "paragraph", "text": "Kelly and Bobby Funk were later transformed into toys and forced to work in the underground trade port. When Sugar passed out, they returned to their human forms. Kelly was seen beating down a subordinate of the Donquixote Pirates being restrained by Bobby."}, {"type": "paragraph", "text": "He was later seen standing alongside the other former slaves as Usopp was hailed as their savior."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"birdcage\", Kelly smiled when Doflamingo announced his bounty hunting survival game."}, {"type": "paragraph", "text": "Kelly (while fused with Bobby) later appeared at the first level of the new King's Plateau seemingly to aid Luffy and his allies. He showed Luffy a tunnel that is supposed to go directly to the fourth level. He was shocked when Abdullah and Jeet fell off Ucy at the tunnel's entrance."}, {"type": "paragraph", "text": "However, the Funk Brothers had lied about the tunnel, which actually led to a dead end. Abdullah and Jeet then learned of Kelly's deception after hearing them brag about it, but before either side could do anything, a string clone of Doflamingo appeared and cut down the combined Funk Brothers at the back of their head."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/42/Boo_Using_Hasshoken.png/revision/latest/scale-to-width-down/210?cb=20140925232334", "caption": "Kelly Funk is hit by Boo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7f/Funk_Brothers_Defeat_Boo.png/revision/latest/scale-to-width-down/210?cb=20141206210736", "caption": "Kelly Funk, along with his brother, defeats Boo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Sai_Defeats_the_Funk_Brothers.png/revision/latest/scale-to-width-down/210?cb=20140525090648", "caption": "The Funk Brothers are defeated by Sai."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kelly Funk and Bobby Funk vs. Corrida Colosseum Block C Gladiators", "elements": [{"text": "Kelly Funk and Bobby Funk vs. Boo", "elements": []}, {"text": "Kelly Funk and Bobby Funk vs. Sai", "elements": []}]}, {"text": "Kelly Funk and Bobby Funk vs. Donquixote Pirates' troops", "elements": []}, {"text": "Kelly Funk and Bobby Funk vs. Doflamingo clone", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kelly's and Bobby's names, their relationship as being brothers, and the fact that they are participating in an arena may have been influenced by the famous wrestling brothers Terry Funk and Dory Funk, Jr.", "elements": []}, {"text": "Kelly is one of the very few characters whose family name comes after the given name.", "elements": []}]}], "images": []}]}