{"sections": [{"title": "Ideo", "level": 1, "content": [{"type": "paragraph", "text": "\"Destruction Cannon\" Ideo is a XXX rank boxer and member of the Longarm Tribe who is the captain of the Ideo Pirates and the captain of the fourth ship of the Straw Hat Grand Fleet. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi, where he met three other gladiators who he would form the then-XXX Gym Martial Arts Alliance with, as well as Monkey D. Luffy, whom he eventually pledged his loyalty towards."}, {"type": "paragraph", "text": "He is an ally of Luffy during the Dressrosa Arc, and one of the central characters from The Stories of the Self-Proclaimed Straw Hat Grand Fleet Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ideo has dark purple hair (black in the manga) pulled back into a tight ponytail and a dark purple beard (also black in the manga). He has a widow's peak, sharply edged facial features, and dark eyeliner surrounding his eyes, with large eyelashes on his lower eyelid, and a bulging vein on the side of his head. As a member of the Longarm Tribe, he possesses very long arms, with an extra elbow joint; unusually for a Longarm, he keeps the extra joint extended past his shoulders over his head. This is usually to power up the force of his punches, but if he needs to, Ideo can relocate these joints to their ordinary configuration to give his arms extra range. He has his ear pierced three times and has four black crosses tattooed on his chest."}, {"type": "paragraph", "text": "In the manga, he is shown sporting a green jacket, with a white stripe coming down each arm. He also wears matching shorts, a large belt, and knee pads. Ideo also has bandages wrapped around his calves and feet, along with red gloves. After becoming captain of the Ideo Pirates, he added a pair of dark colored shoes as footwear."}, {"type": "paragraph", "text": "His anime appearance is largely the same, with the exception of the stripes on his arms and legs. In the manga they are depicted as being white while the anime portrays them as red."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is confident enough in his abilities to enter the Corrida Colosseum tournament. During the Block C battle royale, he states his one desire: to become stronger, which is the main reason he wants to win the Mera Mera no Mi."}, {"type": "paragraph", "text": "He can also be quite merciless, as he had no qualms attacking an already unconscious opponent."}, {"type": "paragraph", "text": "Unlike most of the people who were freed from Sugar's curse, Ideo was not shown to be swayed by greed as he chose to fight the Donquixote Pirates instead of their enemies, even attacking those who tried to claim the bounties. During his fight with Dellinger, Ideo showed that he valued honor as he promised to hold the officer off long enough for Luffy to defeat Doflamingo. Ideo also mentioned that by repaying his debt to the Straw Hats, he would be able to show his face to those who went before him, showing great sense of determination and pride."}, {"type": "paragraph", "text": "Ideo later shows that he does not possess the same ill will towards those of the Longleg Tribe, not even having a problem with one of his crewmates being a member of that tribe."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Ideo has extraordinary physical strength and is extremely skilled in boxing, being an XXX rank boxer and was a two-time champion of the New World Central Fighting Tournament. He uses a punching technique wherein he delivers a hit that explodes on impact. His punches are apparently powerful enough to send the massive body of the unconscious Hajrudin flying with a single strike."}, {"type": "paragraph", "text": "Being a member of the Longarm Tribe gives him arms with an extra joint and length. He kept the extra joints quasi-hidden by extending them past his shoulders, allowing him to hide them for a surprise attack, stretching them out when necessary for the extra reach and strike. This compression of his shoulders gives him the extra strength to add that explosive power to his punches."}, {"type": "paragraph", "text": "In the Corrida Colosseum, Ideo took down multiple powerful gladiators with great ease. He even fought on equal level with Sai, a powerful master of the Hasshoken, and was only taken out by Chinjao due to him being pre-occupied with fighting Sai."}, {"type": "paragraph", "text": "Ideo has shown to possess great endurance. Even after being brutally pierced in the stomach by Dellinger and bleeding profusely, Ideo retained enough strength to grab Dellinger with one arm. He even withstood several powerful kicks from Dellinger without releasing his grip on Dellinger and only succumbed when Dellinger brutally bit him on his shoulder. Even after being kicked by Dellinger off the second level of the New King's Plateau, Ideo could survive a ruthless assault from Pica's Charles Stone in a seriously injured state."}], "images": []}, {"title": "Techniques", "level": 3, "content": [{"type": "list", "elements": [{"text": "Hakai Ho (破壊砲, Hakai Hō, literally meaning \"Destruction Cannon\"): An explosive punch that is Ideo's signature attack, and the source of his epithet. It was first seen when Ideo punched the unconscious Hajrudin out of the ring in the Block C battle royale, and named when he participated in the battle against members of the Donquixote Pirates. According to Gatz, the explosive power of the attack comes from Ideo's oddly-shaped shoulders, which are actually his Longarm Tribe joints compressed past his shoulders.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Destruction_Cannon.png/revision/latest/scale-to-width-down/210?cb=20150323172913", "caption": "Hakai Ho"}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, he became known as the 2 time (V2) champion of the New World Central Fighting Tournament."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Ideo entered the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block C."}, {"type": "paragraph", "text": "After Lucy defeated Hajrudin, Ideo walked over to the giant's prostrate body, stating that this place is a ring and that he can sleep elsewhere, before using his formidable punching powers to knock the giant out of the ring, highly surprising Gatz and the spectators. After this show of strength, Ideo announces his desire to grow even stronger by eating the Mera Mera no Mi, before proceeding to attack more of his fellow Block C fighters."}, {"type": "paragraph", "text": "After Sai defeated the Funk Brothers, Ideo was then locked in combat with him. The two fought evenly, exchanging blows with each other. The boxer used his exploding prowess while the Chinjao Family member utilized his Hasshoken technique. They clashed until they were caught in the middle of Lucy and Chinjao's feud. Before Ideo can so much as react, an irate Chinjao easily clobbered and knocked him out of the ring, much to Gatz and the spectators' utter shock."}, {"type": "paragraph", "text": "He later went to the underground medical treatment facility to receive treatment for his injuries. While waiting for his turn, he was annoyed with Sai yelling at a doctor concerning Chinjao. Shortly afterwards, he was tricked and thrown into an underground dungeon, alongside Kelly Funk and Boo, where they joined the other disqualified participants."}, {"type": "paragraph", "text": "He was later transformed into a toy and forced to work in the underground trade port. When Sugar lost consciousness, Ideo returned to his original form."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"Birdcage\", Ideo and the other colosseum fighters escaped to the surface through an opening created by Pica when he rearranged the land with his ability."}, {"type": "paragraph", "text": "When he found Luffy, Zoro, and Law, Ideo stated that he will defeat Doflamingo. He joined forces with Luffy's group alongside the Chinjao Family, Hajrudin, Suleiman, Fighting Bull, Blue Gilly, Cavendish, Abdullah , Jeet, Orlumbus, Elizabello II, and Dagama. When some of the former toys came for the heads of Luffy, Zoro, and Law, Ideo and the allied colosseum fighters fought them off. They later marched towards the royal palace and began to battle against Pica."}, {"type": "paragraph", "text": "When Pica attacked, Chinjao and Elizabello II shattered his stone hand, enabling the group to move forward. Ideo and the other allied fighters fought through Doflamingo's troops. Pica then attacked with his other arm, causing Ideo and some of the other allies to fall back. After avoiding Pica's strike, they were surprised to see Luffy, Zoro, Law, Abdullah, Jeet, and Fighting Bull climbing on Pica's arm. They were also amazed when Luffy shattered Pica's stone head. When Pica's giant stone body stopped moving, Ideo and his allies continued on with their assault."}, {"type": "paragraph", "text": "With Zoro fighting Pica and Sabo fighting the Marines, the colosseum fighters charged up the new King's Plateau and easily defeated the Donquixote Pirates' troops standing in their way."}, {"type": "paragraph", "text": "After reaching the second level, the colosseum fighters were confronted by four of the Donquixote Pirate officers. The colosseum fighters later banded together to create an opening for Luffy and Cavendish."}, {"type": "paragraph", "text": "Later on after Dellinger defeated Blue Gilly, Ideo faced off against Dellinger. Ideo attempted to attack with an explosive punch, but Dellinger easily dodged it. When he was distracted due to Pica changing the shape of the plateau, Ideo managed to land a hit on him."}, {"type": "paragraph", "text": "Dellinger retaliated by puncturing a hole in Ideo's stomach. Before Dellinger left the second level to assist Gladius, Ideo grabbed ahold of him. Dellinger took off his hat and revealed his fangs, which he used to deal the finishing blow to Ideo."}, {"type": "paragraph", "text": "After most of the Donquixote Pirates' officers were defeated, Pica preyed on the injured, including Ideo."}, {"type": "paragraph", "text": "During the final phase of Doflamingo's game, Ideo and the other injured gladiators were temporarily healed by Mansherry. They then defeated the remaining subordinates of the Donquixote Pirates on the New King's Plateau to aid the citizens fleeing from the shrinking Birdcage."}, {"type": "paragraph", "text": "When the Birdcage came close to the central streets, the gladiators worked together to push back the Birdcage via Bartolomeo's barrier. Eventually, the effects of Mansherry's healing powers began to wear off and Ideo collapsed."}, {"type": "paragraph", "text": "His efforts were not in vain as Luffy was bought enough time to defeat Doflamingo and bring down the Birdcage."}, {"type": "paragraph", "text": "Later that night after the aftermath, Ideo and the other gladiators were seen resting at the palace."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. Ideo, Abdullah, and Jeet subdued the Marines at the eastern port."}, {"type": "paragraph", "text": "The fighters later gathered at the eastern port, preparing to fight Issho. When Issho prepared to attack them with all the rubble from Dressrosa, the fighters and the Straw Hats quickly fled to the escape ship. At that moment, Luffy arrived and attacked Issho."}, {"type": "paragraph", "text": "During the clash, Issho used his gravity ability to blow away Luffy, who was then caught by Hajrudin. The fighters and Straw Hats quickly fled across a bridge leading to a gigantic ship in the distance. Issho prepared to drop the rubble on them but was obstructed by the Dressrosa citizens who were pretending to chase after Luffy. They eventually reached Orlumbus' flagship, the Yonta Maria. After boarding the ship, Ideo revealed that Blue Gilly, Abdullah, and Jeet had joined his group. The XXX Gym Martial Arts Alliance was then one of the seven groups that pledged their allegiance to the Straw Hats."}, {"type": "paragraph", "text": "When Luffy was asked to drink a sake cup to complete the agreement for an alliance, Luffy declined, much to the others' shock. Once Luffy explained that they can do whatever they want, the allies decided to forge the alliance anyway, forming the Straw Hat fleet. Sai, Bartolomeo, Leo, Cavendish, Ideo, Orlumbus, and Hajrudin sat down and drank their sake cups. Afterwards, they held a feast to celebrate their victory over Doflamingo."}, {"type": "paragraph", "text": "After the feast, Ideo and the other leading allies received Luffy's vivre card and parted ways. Orlumbus also gave Ideo his own ship."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Chinjao_Punches_Ideo.png/revision/latest/scale-to-width-down/210?cb=20140525085339", "caption": "Ideo gets knocked out by Chinjao."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Luffy_and_the_Corrida_Colosseum_Gladiators_Going_After_Doflamingo.png/revision/latest/scale-to-width-down/250?cb=20160608200003", "caption": "Ideo with Luffy, Zoro, Law, Ucy and the other Corrida Colosseum combatants are on their way for Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Dellinger_Defeats_Ideo.png/revision/latest/scale-to-width-down/200?cb=20151004212320", "caption": "Ideo is defeated by Dellinger."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Revived_Gladiators_Defeat_Donquixote_Pirates.png/revision/latest/scale-to-width-down/190?cb=20161221120222", "caption": "Ideo and the other gladiators defeat the remaining Donquixote Pirates."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "While sailing at sea with the ship he received from Orlumbus, Ideo spotted two ships in the middle of a battle. Ideo and his group then fought against the crews from both ships. After ending the fight, the XXX Gym Martial Arts Alliance learned that the battle was part of a thousand-year quarrel between the Longleg and Longarm tribes. At a deserted island, Ideo's group decided to customize their new ship using undamaged ship parts. After their new ship was completed, Ideo and his group left the Longarm and Longleg crews behind, not caring whether they reconcile or continue their quarrel. The XXX Gym Martial Arts Alliance later decided to become a pirate crew called the Ideo Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fd/The_Beginning_of_the_Ideo_Pirates.png/revision/latest/scale-to-width-down/200?cb=20190519085525", "caption": "Ideo and his crewmates become pirates."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ideo vs. Corrida Colosseum Group C Gladiators", "elements": [{"text": "Ideo vs. Sai (interrupted by Luffy and Chinjao)", "elements": []}]}, {"text": "Corrida Colosseum gladiators vs. Donquixote Pirates", "elements": [{"text": "Ideo vs. Dellinger", "elements": []}]}, {"text": "Ideo, Abdullah, and Jeet vs. Marines (Dressrosa Eastern Port)", "elements": []}, {"text": "XXX Gym Martial Arts Alliance vs. unknown Longarm and Longleg crews", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Ideo vs. Monkey D. Luffy (as Lucy)", "elements": []}, {"text": "Ideo and Sai vs. Lao G and Gladius", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, at the coliseum Ideo briefly battled with Lucy before the latter had his helmet stolen by Jean Ango resulting in him leaving as he chasing after Ango."}, {"type": "paragraph", "text": "During his battle against Dellinger, the attack he landed on him is dodged unlike in the manga where he was able to strike him."}, {"type": "paragraph", "text": "Also in the anime, he is shown to have extremely long arms that seem to stretch in a fashion similar to Luffy's Devil Fruit powers. This is likely an artistic exaggeration or a misinterpretation, since Longarms usually have arms no longer than twice the length of an average human."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ideo's name and abnormally high shoulders are based on the iconic robot from the anime series Space Runaway Ideon.", "elements": []}, {"text": "Orlumbus and Ideo were the only representatives not to single-handedly defeat a Donquixote officer.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/52/SBS72_4_Ideo.png/revision/latest/scale-to-width-down/120?cb=20131208144012", "caption": "Ideo and Ideon from SBS Volume 72."}]}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "His favorite food is doner kebab and his least favorite is pork.", "elements": []}]}], "images": []}]}