{"sections": [{"title": "Tank Lepanto", "level": 1, "content": [{"type": "paragraph", "text": "Tank Lepanto is the commander of Dressrosa's Self-Defense Army. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tank is a very huge muscular man with disproportionately small legs. He has a thick dark pointed beard. While participating in the Corrida Colosseum, he wears only a left shoulder guard linked by a chain and a dark skirt with a belt and boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Tank is a Riku Family loyalist who struggled under Donquixote Doflamingo's rule. During the competition at Corrida Colosseum, in order to claim the Mera Mera no Mi, he allowed himself to be paid to ally with Dagama, Elizabello, and several other gladiators just to get the advantage over Bellamy. He stated that rather than dreaming big, he believes in taking commands from others to get compensated, having a strong desire to win despite the cost. He also has the intelligence to pick out Bellamy as the first person to target, since he is one of the strongest competitors in Block B."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Riku Doldo III", "level": 3, "content": [{"type": "paragraph", "text": "Lepanto is very loyal to Riku Doldo III, the former king of Dressrosa. When Doflamingo came to blackmail them for protection money, Tank followed the king's orders to gather the 10,000,000,000 required, and was even about to risk his own life to ask foreign assistance (despite Doflamingo banning that), and even followed the king's refusal to fight back for the sake of peace. When Doldo was forced by Doflamingo to attack the citizens, Tank was at first devastated and confused to see his beloved king supposedly turned violent, but when his own body started moving in the same fashion against his will, he immediately figured out the king was in the same position. When Doldo was ousted from the country, Tank remained under Doflamingo only to keep a watch over Princess Viola. Ten years after the incident, Tank was the first to recognize Doldo despite his helmet and came to tears of joy upon seeing that his king is still doing well. When Dagama criticized Doldo for the incident ten years ago, Tank immediately stepped forward to defend the former king."}], "images": []}, {"title": "Rebecca", "level": 3, "content": [{"type": "paragraph", "text": "Due to his loyalty to her grandfather, Tank Lepanto was loyal to Rebecca and protected her as best he could from bounty hunters and Doflamingo's men."}], "images": []}, {"title": "Donquixote Doflamingo", "level": 3, "content": [{"type": "paragraph", "text": "As Donquixote Doflamingo literally manipulated Tank and the soldiers in Doldo's supposed crimes, he knows of the pirate's true colors and hates him for it. He only came to serve Doflamingo to keep himself alive and keep watch over Doldo's daughter, Viola. Tank was biting his lips very hard while Doflamingo insisted to the public to forgive the soldiers for supposedly following Riku's orders to attack the kingdom out of greed. It was his hatred for Doflamingo and his crew that Tank acted disrespectfully towards Bellamy during their battle."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Tank has shown significant strength and fighting ability, and wields a spiked ball and chain with ease. The fact that he is an army commander of Dressrosa is another testament to his strength and fighting abilities. He was also able to block one of Bellamy's attacks, although he showed some discomfort in doing so."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was seen fighting with a large spiked ball on a chain. He is fairly proficient in using it, since he was able to take down a few competitors with it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in the past, Tank gained his status as the commander of Dressrosa's Self-Defense Army. He was a loyal soldier to Riku Doldo III during his rule."}, {"type": "paragraph", "text": "After Donquixote Doflamingo demanded a ransom of 10 billion, Riku Doldo gathered his soldiers and asked them to gather money from the citizens in order to avoid a war. Tank assisted the king, knowing that it wasn't an easy decision for him to make. However, just as the money was being gathered, Doflamingo controlled Doldo from the shadows and made him go on a rampage. As panic and confusion spread throughout the kingdom, Doflamingo proceeded to take control of Tank and the other soldiers as well, making them attack innocent civilians against their will."}, {"type": "paragraph", "text": "After Doflamingo overthrew the Riku Family and took the throne, Tank remained in his position of commander but he struggled under Doflamingo's oppressive rule. After Scarlett's death, Tank prevented Viola from doing something rash."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Tank Lepanto entered the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block B. Some time before or during his participation in Block B, he was coaxed into fighting for the Prodence Kingdom."}, {"type": "paragraph", "text": "When Block B's battle royale began, Tank and the other competitors teamed up with the Prodence Kingdom to defeat Bellamy, with the burly man knocking out multiple gladiators to get to their intended target. Tank then came face to face with Bellamy. When Bellamy asked him why he was assisting fighters from a foreign country, Tank, grinning widely, responded by saying that he was only fighting for the money, before lashing out at the Donquixote Pirates member with his spiked ball chain. Although his attack managed to knock several gladiators out of the ring, Bellamy dodged the attack with ease and countered with his Spring Death Knock technique, which Tank manages to block while gritting his teeth in concentration."}, {"type": "paragraph", "text": "Sometime later, Tank is seen lying on the ground, unconscious and covered with blood, having been beaten by Abdullah and Jeet, who stand victoriously over his prostrate body, reveling in their trickery."}, {"type": "paragraph", "text": "Sometime after the battle, Tank was dropped down into an underground dungeon along with the other disqualified participants. There, he correctly identified the gladiator Ricky as the former king of Dressrosa, Riku Doldo III. When the former king removed his helmet and revealed himself, Lepanto was tearfully overjoyed as he explained how his loyalty to the old king never wavered, despite being under Doflamingo's oppressive rule. When Dagama was about to blame Doldo for the troubles that various countries have been facing since Doflamingo's ascension to the throne, Tank angrily told him that he knew nothing about what had actually happened ten years ago."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"birdcage\", Tank apparently escaped the colosseum. He was next seen on top of the old King's Plateau with Riku Doldo III and Viola when Usopp, Robin, Rebecca, Bartolomeo, Hack, and the Tontatta Dwarves arrived there."}, {"type": "paragraph", "text": "Once Leo finished explaining his plan to reach the flower garden on the new King's Plateau, Tank, Doldo, and Viola watched as Robin, Rebecca, Leo, and Bartolomeo travel to the new King's Plateau using the Yellow Giant Rhinoceros Beetles."}, {"type": "paragraph", "text": "The group on the old King's plateau were later joined by Kin'emon and Kanjuro."}, {"type": "paragraph", "text": "When the Dressrosa citizens reached the top of the plateau with the intent to capture Doldo and Usopp, Tank held them back long enough for Usopp to snipe at Sugar."}, {"type": "paragraph", "text": "Tank was later happy to hear from Viola about Kyros's victory over Diamante. Riku Doldo III decided to go to the city and Tank volunteered to accompany him. However, Pica was making his way to the Old King's Plateau."}, {"type": "paragraph", "text": "When Pica prepared to crush everyone on the plateau, Tank told Riku to run. He was awestruck when Zoro destroyed the Pica statue and defeated Pica."}, {"type": "paragraph", "text": "With the threat of Pica eliminated, Tank accompanied Doldo as he and the citizens were leaving the Old King's Plateau."}, {"type": "paragraph", "text": "Tank Lepanto and Riku Doldo III later assisted the citizens and warriors in pushing the Birdcage back just long enough for Luffy to defeat Doflamingo."}, {"type": "paragraph", "text": "After the downfall of the Donquixote Pirates and the Birdcage's collapse, Doldo asked Tank to shelter the pirates and warriors who fought on Dressrosa's behalf as well as the citizens who lost their homes."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, Tank was present with Doldo in the royal palace. Doldo asked him to bring Viola and Rebecca as he prepared to go to the city to announce his return to the throne. Tank was very happy to hear this."}, {"type": "paragraph", "text": "When he witnessed Issho preparing to strike Luffy and his allies with all the rubble from Dressrosa, Tank was worried for Luffy."}, {"type": "paragraph", "text": "After Luffy and his allies escaped, the people of Dressrosa proceeded with the celebrations. After Doldo received a note explaining that the Levely would be taking place soon, Tank commented that other countries were preparing for it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c3/Block_B_Alliance.png/revision/latest/scale-to-width-down/250?cb=20160115220436", "caption": "Lepanto, along with Elizabello, Dagama and several allies in Block B."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Abdullah_and_Jeet_Defeat_Lepanto.png/revision/latest/scale-to-width-down/210?cb=20140916083614", "caption": "Lepanto is defeated by Abdullah and Jeet."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "Tank Lepanto assisted the Dressrosa citizens into rebuilding their homes alongside Leo's newly formed pirate crew."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tank Lepanto vs. Corrida Colosseum Block B Gladiators", "elements": [{"text": "Tank Lepanto vs. Bellamy", "elements": []}, {"text": "Tank Lepanto vs. Abdullah and Jeet", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Tank Lepanto, Riku Doldo III, and Hack vs. pirates", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name may have originated from the Battle of Lepanto, which took place during the Fourth Ottoman-Venetian War.", "elements": [{"text": "Incidentally, the nickname of the author of Don Quijote, Cervantes, is el Manco (one-armed) de Lepanto. This nickname refers to the Battle of Lepanto where Cervantes' left hand became paralyzed. Tank Lepanto's name might so be a reference to Cervantes, while Donquixote Doflamingo and Rosinante are references to arguably his most famous work.", "elements": []}]}]}], "images": []}]}