{"sections": [{"title": "Riku Doldo III", "level": 1, "content": [{"type": "paragraph", "text": "Riku Doldo III is the recrowned king of Dressrosa after the defeat of Donquixote Doflamingo who dethroned him a decade ago. He entered the Corrida Colosseum to compete for the Mera Mera no Mi under the alias of \"Ricky\". He is the father of the late Scarlett and Viola, and is the grandfather of Rebecca."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Doldo is an elderly, yet well-built and extremely muscular man. In his disguise as Ricky, he wears a dark purple (blue in the anime) cape with a skull and crossbones on the back, and a gold (silver in the anime) masked helmet which covers his entire face save for his eyes and features a prominent nose-guard; it also features a flame-like design on it. A crack in this helmet received during his fights in the Block B battle royale revealed that he has a thick brown mustache and beard."}, {"type": "paragraph", "text": "Doldo later revealed his identity in the dungeon beneath the Colosseum and is shown to have a beard, mustache and thick eyebrows. A spiky ring of hair goes around the back of his head and he has a single large tuft of hair near his crown. A stitched scar runs from right above his left eyebrow to the top of his head. It was the result of a head injury he received when he first met Kyros. At some point, he received a second scar across the right side of his upper chest and lower neck."}, {"type": "paragraph", "text": "While he was king of Dressrosa, he had all his hair, which was still dark colored around the temples. His facial hair and eyebrows also shared the same color. Riku's attire was, at that point, usually covered by a royal mantle."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Although the modern public used to revile his name, Doldo, in truth, is an extremely kind, noble, and caring man. When he was king, he cared immensely for his people, as he put the welfare of Dressrosa's citizens first and readily helped countries that were in need. This earned him great respect from monarchs of other countries such as Elizabello II. Upholding the Riku family ancestors' ideas of compassion and pacifism, he desires peace, as he agreed to pay Doflamingo's ransom instead of declaring war against him. He even went as far as bowing down to the citizens, despite his advisers saying it would shame him, showing that he was willing to go beyond a royalty's ethics. However, he recognized that his pacifist ways caused him to be a weak ruler as it consequently resulted in the immense suffering of countless Dressrosa citizens and the death of his own daughter Scarlett. Thus, Doldo had no intentions of ever returning to the throne. After Doflamingo's downfall, however, the people of Dressrosa unanimously elected him to be their king again, wanting peace above all else."}, {"type": "paragraph", "text": "Doldo is also a very proud man. He refused to have his injuries tended to after his defeat in Block B, although he was also trying to hide his identity, and did not want it exposed, especially in front of his granddaughter."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Rebecca", "level": 4, "content": [{"type": "paragraph", "text": "Rebecca is Doldo's granddaughter. He was present at Rebecca's birth and occasionally visited her in secret before Doflamingo came to Dressrosa."}, {"type": "paragraph", "text": "Because Doldo has been in hiding since his dethronement, their relationship has become distant and she did not recognize him while he was under the guise of Ricky. However, it is clear that he still loves her dearly and deeply regrets the death of her mother and her difficult life under Doflamingo. He also supported her choice to go and live with her father, while remarking she inherited her mother's spirit."}], "images": []}, {"title": "Viola", "level": 4, "content": [{"type": "paragraph", "text": "Viola is Doldo's younger daughter. He was extremely grateful to Lepanto for taking care of Viola all these years after Doflamingo's ascension to the throne despite having to withstand the humiliation of serving under a tyrannical king. Viola also loves her father very much since she was willing to assist Doflamingo in exchange for her father's life."}], "images": []}, {"title": "Scarlett", "level": 4, "content": [{"type": "paragraph", "text": "Scarlett is Doldo's eldest daughter. Doldo fully supported her love for Kyros and even allowed her to leave the royal family even if she had to falsify her death. Before Doflamingo came to Dressrosa, Doldo would visit her family occasionally in secret. Doldo deeply cares about Scarlett, and is utterly distraught when his soldiers reported to him about her death which continued to haunt him for ten years. Part of Doldo's reason for believing himself as an unworthy king is also due to his failure as a father to protect his daughter from Doflamingo's malice."}], "images": []}, {"title": "Kyros", "level": 4, "content": [{"type": "paragraph", "text": "Even though Kyros was known as ruthless killer, Doldo showed him compassion and mercy, even after Kyros attacked him during their first meeting. Initially withdrawn, Kyros eventually opened up to him as Doldo continued to watch over Kyros, even visiting his friend's grave together with him at one point. After battling Kyros in the arena as Ricky, Doldo encouraged Kyros to leave the colosseum and start a new life and even made him captain of his royal guard."}, {"type": "paragraph", "text": "The two became in-laws when Kyros married Scarlett. Doldo approved of this union and he would visit them from time to time."}, {"type": "paragraph", "text": "The trust between the two is extremely strong, as Kyros realized that his opponent Ricky is really Riku in disguise, and held back as a result. He also instantly refused to believe that Riku would attack the kingdom on his own volition, instead outright believing Doflamingo to be the one responsible. Years after Doldo's dethronement at the hands of Doflamingo, Kyros plotted against the Shichibukai and sought to restore Doldo's honor."}, {"type": "paragraph", "text": "Upon returning to his true form, Kyros and Doldo had a tearful reunion, with Doldo apologizing for not recognizing him ten years ago and Kyros apologizing for making him wait so long."}], "images": []}, {"title": "Dressrosa", "level": 3, "content": [{"type": "paragraph", "text": "Before his dethronement, Doldo was greatly admired by the people of Dressrosa for his kindness and benevolence. Doldo would always put his people before him to which the people were grateful as their kingdom had never been involved in a war for 800 years. However, Doflamingo controlling the king to attack and kill his people caused all the citizens to hate Doldo and his family. The citizens did not hesitate to badmouth his granddaughter, Rebecca, any chance they get. They even wanted the whole Riku family dead, claiming they have \"dirty blood\". Doldo on his part is extremely remorseful for what happened, viewing himself as unworthy of being king and expresses hatred to Doflamingo for his evil rule."}, {"type": "paragraph", "text": "However, during Doflamingo's \"Birdcage\" game, the citizens all realized Doldo was innocent after seeing how Doflamingo took control of random people and made them attack one another. They felt guilty for ever doubting their former king, but they initially planned to hand him over to Doflamingo in order to end the game. However, they only wanted to capture Doldo alive. Doldo was hesitant to harm the citizens during the chaos. Upon capturing Doldo and those around him, the townspeople fell into despair and regret when they realized they were merely playing into Doflamingo's hands of \"electing their king\" by hunting down the Riku family over the Shichibukai. They released the captured prisoners and begged Doldo for his help to return Dressrosa to the peaceful kingdom it once was."}, {"type": "paragraph", "text": "During their darkest hour, the citizens were about to give up hope when the Birdcage was shrinking and destroying everything in its path. However, Doldo was able to raise their morale, giving them the will to survive until Luffy defeats Doflamingo."}, {"type": "paragraph", "text": "After Doflamingo's downfall, the citizens begged Doldo to return to the throne, not wanting anyone else to be king."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Tank Lepanto", "level": 4, "content": [{"type": "paragraph", "text": "Tank Lepanto was a faithful soldier under Doldo and remains extremely loyal to him. Prior to Doflamingo's takeover of Dressrosa, Tank understood the difficult decision Doldo had to make in order to protect the country. He was the first of the gladiators thrown in the pit with Doldo to see through his disguise as Ricky. When he revealed himself, Lepanto cried tears of great joy and bowed down before his old king, showing great respect. Later, when Dagama criticized his reign and actions, Lepanto immediately stepped forward to defend Doldo."}], "images": []}, {"title": "Riku Royal Army", "level": 4, "content": [{"type": "paragraph", "text": "All the soldiers of the Riku Royal Army are extremely loyal to Doldo due to his great benevolence. Alongside Tank, a majority of the Riku soldiers remain faithful towards Doldo despite his dethronement by Doflamingo. In fact, many gladiators who were former soldiers of the army, including those who were turned into toys, respectfully bowed before Doldo while in the underground scrap pit."}], "images": []}, {"title": "Tontatta Kingdom", "level": 4, "content": [{"type": "paragraph", "text": "Doldo has an extremely close friendship with the dwarves of the Tontatta Kingdom. After Doldo was forced by Doflamingo to massacred his citizens, the dwarves initially believed that Riku did become an evil tyrant. Only after the dwarves made contact with the Donquixote Pirates, which lead to the cruel enslavement of their people, did they realize that they have wronged Doldo with Gancho personally feeling great shame for doubting him. Thus, the dwarves under Kyros's leadership seek to restore his honor and rightful place as Dressrossa's king with many dwarves, including Leo, willingly risked their own lives to rebel against the Donquixote Pirates. Leo even persuaded Doldo to put his faith in the Straw Hat Pirates in defeating Doflamingo."}, {"type": "paragraph", "text": "Doldo thinks highly of the dwarves' capabilities as he assigned Leo's crew to be his escorts for the Levely."}], "images": []}, {"title": "Elizabello II", "level": 4, "content": [{"type": "paragraph", "text": "Elizabello, the king of Prodence Kingdom, is a close acquaintance of Riku Doldo III. His reaction to Doldo's revelation was very joyous as he hugged and thanked him for his aid as a ruler while lamenting the loss of his peaceful influence in modern politics. In contrast to his normally surly and aggressive demeanor, Elizabello shows great admiration for and deference to his former peer. During Doflamingo's \"bird cage\" game, Elizabello fought against the Donquixote Family on Doldo's behalf."}, {"type": "paragraph", "text": "After Doflamingo's downfall, Elizabello II encouraged Doldo to return to the throne of Dressrosa."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Doldo was at first wary of Luffy and his crew due to them being pirates like Doflamingo. However, at Viola's persuasion, he came to see that they were different from ordinary pirates as they were willing to risk their lives to save his country. Later on, Doldo put his full faith in Luffy while he was fighting Doflamingo, encouraging his followers to make the same bet on him just as he had done."}, {"type": "paragraph", "text": "After Doflamingo's downfall, Doldo was later shocked to hear Luffy \"kidnapped\" Rebecca. When Viola informed him about Rebecca's choice to live with her father, Doldo was apparently grateful to Luffy for bringing the two together. Doldo later became worried when Issho was planning to crush Luffy and his allies with the debris from Dressrosa."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "He expressed immense hatred towards Donquixote Doflamingo, holding a great grudge against him, who forced him and his soldiers to attack and massacre his own citizens and thus turning the citizens' public opinion against him. Upon Doflamingo abusing his connections with the World Nobles to falsify his resignation from the Shichibukai and monarch of Dressrosa to deceive the world, Riku expressed his disgust at how much corruption Doflamingo brought to the country."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Issho", "level": 4, "content": [{"type": "paragraph", "text": "Fujitora has great respect for King Riku and made the same bet as him. After Doflamingo's defeat, Fujitora told him not to take responsibility and bowed down towards him while apologizing for the World Government allowing a vicious pirate to become one of the Shichibukai and take over Dressrosa. Riku asked Fujitora to raise his head until he found out the reason Fujitora could not attack Doflamingo at the palace. They apparently have maintained cordial relations as the Marine admiral requested to have a private conversation with him before the Levely commences."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the king of Dressrosa, he had the complete authority over the country and its resources. But after Doflamingo's coup, he lost all of his influence and became a lowly criminal (in the eyes of the citizens at least). However, upon his name being cleared, the people once again begged him for his wisdom and leadership and he regained his authority."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Despite his old age, Doldo remained extremely strong. During the battle royale, he as 'Ricky' was seen vastly surpassing the other gladiators in B Block in terms of speed, using something similar to Rokushiki's Soru technique. He has extraordinary endurance and recovery rate as he was able to get right back up after the fight and move freely."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Unlike the other gladiators trained at the Colosseum, Doldo does not fight using a shield but instead fights with an old and blunted sword using both hands. His swordsmanship was so great that several gladiators speculated that he was from Wano Country. He managed to incapacitate some contestants with one swing of his blunt sword until Blue Gilly defeated him with a kick to the head. As 'Ricky', he was shown to be strong enough to inflict a minuscule (but permanent scar) scratch on Kyros, a feat no other gladiator was able to accomplish. (The anime shows that it is due to the fact that this was as a direct result of Kyros dropping his guard upon recognizing him.) He developed his swordsmanship with advice from Kyros prior to their battle in the Colosseum. In the anime, he dual wielded two wooden staffs as improvised swords, able to fend off multiple pirates who were attacking the citizens for Usopp's bounty."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Ruler of Dressrosa", "level": 4, "content": [{"type": "paragraph", "text": "In the past, Riku Doldo III ruled Dressrosa as its king. The country was peaceful even though it wasn't wealthy."}, {"type": "paragraph", "text": "When Kyros was fifteen years old, Doldo attempted to speak to him face-to-face after he killed two people in a fight. During this encounter, Kyros struck Doldo on the head. Despite that, the king told his soldiers to stand down and asked Kyros to come with him. He later watched Kyros fight in the Corrida Colosseum as a gladiator."}, {"type": "paragraph", "text": "Nine years later, Doldo (as Ricky) fought Kyros in the arena as his 3000th opponent. Even though Doldo was the only gladiator to wound Kyros, he lost the match. After their battle, Doldo encouraged Kyros to leave the colosseum, saying that he should not live his life in a cage any longer while noting that he went easy on him. One year later, Doldo made Kyros captain of the Dressrosa army."}, {"type": "paragraph", "text": "After Scarlett fell in love with Kyros, the king approved of their union even though the public would have a different opinion. While Kyros and Scarlett lived together in a flower field outside the kingdom, Doldo was overjoyed to see their infant daughter, Rebecca. Doldo and Viola would come visit the family every once in a while."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Kyros_Defeats_Ricky.png/revision/latest/scale-to-width-down/210?cb=20160824202041", "caption": "Kyros defeats Ricky."}]}, {"title": "Dethronement", "level": 4, "content": [{"type": "paragraph", "text": "One night, Doflamingo appeared in Riku Doldo's chambers. Riku recognized him as a descendant of the Donquixote Family and commented on his feats as a pirate, which included stealing money from the World Nobles and blackmailing the World Government to attain the position of Shichibukai. Doflamingo stated his demand, asking for a 10 billion fee until the dawn of the next day in exchange for leaving the country alone. Riku panicked at first, but then decided there was no other way if he wanted to avoid a war. He gathered his soldiers and asked them to collect all of the citizens' money, without informing the citizens of the situation."}, {"type": "paragraph", "text": "Just as the money was being gathered, Doflamingo, from behind the scenes, used his Devil Fruit ability to control Riku and made him rampage in the city of Sebio. As panic and confusion spread throughout the kingdom, Doflamingo proceeded to take control of the soldiers as well, making them attack innocent civilians against their will."}, {"type": "paragraph", "text": "Once Riku Doldo lost his credibility and the trust from Dressrosa's citizens, Doflamingo was able to pass himself off as a hero. After Doflamingo overthrew the Riku Family, he held Doldo captive. When Kyros arrived at the palace to confront Doflamingo, Doldo was right at Doflamingo's feet. When Doflamingo was about to execute Doldo, Kyros cut off his leg (which was chained) and attempted to attack Doflamingo. Even though Kyros was transformed into a toy by Sugar, he managed to escape the palace with Doldo. However, Doldo had lost all memories of Kyros."}, {"type": "paragraph", "text": "While hiding in a shack, he sent his guards to search for his daughter Scarlett. The guards then came back with news that his daughter was shot by Diamante."}, {"type": "paragraph", "text": "In exchange for sparing Doldo's life, Viola joined the Donquixote Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d0/King_Riku_Controlled_By_Doflamingo.png/revision/latest/scale-to-width-down/210?cb=20140920130218", "caption": "Riku controlled by Doflamingo."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Doldo entered the Corrida Colosseum under the disguise of Ricky to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block B."}, {"type": "paragraph", "text": "During the chaotic showdown between Bellamy and the forces of the Prodence Kingdom, Ricky was faced with three opponents, two of which noted his odd strength and unorthodox fighting methods. As they wondered whether or not he is a samurai from Wano Country, he disengaged from his current opponents and dispatched them with blinding speed, leading many in the audience to question whom he might be. His identity was questioned particularly by an old man who claimed to have a feeling of seeing a fighter long ago with such a fighting style."}, {"type": "paragraph", "text": "He was then attacked by Blue Gilly, but managed to evade his kick. However, Blue Gilly later defeated him with a kick to the neck, which also shattered some of his armor. Lying in a pool of his own blood, Ricky lamented to himself that he could not win against aging. He then heard the cheers coming out from the crowd, and angrily thought to himself how he hated those cheers and also how he hated Donquixote Doflamingo."}, {"type": "paragraph", "text": "As Elizabello II‎ prepared to use the King Punch, Ricky silently thought about the man's title. When the king finally deployed his devastating punch, Ricky managed to get himself up from the ring's floor and attempted to deflect it, but ended up breaking his sword in the process."}, {"type": "paragraph", "text": "Later, after the battle royale for Block C had commenced, Ricky was seen attempting to exit the Corrida Colosseum. When one of the medical staff plead with him to stop so they could treat his injuries, the former gladiator angrily stated how ironic it was that they were offering to help him after letting him fight to the death in front of a crowd. When the medical staff member attempted to remove Ricky's helmet so they could treat his head wound, which was still bleeding badly, the former gladiator slapped the man's hand aside and brushed past them, refusing to remove his protective gear, and ordered them to show him to the exit. Before he could get any further, the pain from his wounds forced him to his knees right in front of Rebecca. The woman gladiator bent down and examined Ricky's wounds and insisted that he really should get them checked out. Ignoring her kind words, Ricky ordered the medical staff to step aside, stating that he could show himself out. As he walked towards the exit, he apologized to Rebecca in his mind."}, {"type": "paragraph", "text": "He was later thrown into an underground dungeon filled with broken toys, along with some of the other disqualified participants. Shortly after, Tank Lepanto stepped forward and asked if Ricky was the former king of Dressrosa, which he revealed to be true. All the other fighters in the pit were struck with awe while Tank shed tears of joy at this revelation. Elizabello II, also happy to see Doldo, hugged him joyfully and remarked that he helped the Prodence Kingdom in the past. The former soldiers of Dressrosa and some of the broken toys stepped up and bowed before the former king."}, {"type": "paragraph", "text": "After several fighters were abducted and turned into toys, Riku Doldo and Chinjao had a casual conversation, completely forgetting about those who have been transformed. During the conversation, Doldo thought to himself about a strange feeling he once had ten years ago."}, {"type": "paragraph", "text": "Doldo was later taken to the palace where he received an audience with Doflamingo. After seeing Rebecca winning her group's battle royale, Doldo told Doflamingo that falsifying the news of his resignation was more than enough reason for him to fight for Dressrosa and everything it stands for. After Doflamingo interrogated Law about the Straw Hats' connection with the dwarves from Tontatta Kingdom and them targeting Sugar, he then questioned Doldo, who remained silent."}, {"type": "paragraph", "text": "When Sugar's curse broke, all the toys returned to their original forms and all the lost memories had been restored. Having regained his memory of Kyros, Doldo tearfully cried out to him as he charged in and decapitated Doflamingo. After Kyros freed Doldo, everyone was surprised to see Doflamingo still alive."}, {"type": "paragraph", "text": "It was then revealed that the Doflamingo that was decapitated was only a copy. The real Doflamingo appeared and had a brief skirmish with Kyros and Luffy. After Doflamingo informed Doldo that he planned to create a bigger tragedy than the one he orchestrated ten years ago, Pica threw Doldo, Luffy, Law, Kyros, and Viola out of the palace. They then watched as Doflamingo initiated his \"bird cage\" plan."}, {"type": "paragraph", "text": "Doflamingo trapped and forced everyone on Dressrosa into a survival game. Doldo watched in terror as the country fell into chaos. Doflamingo then coaxed the entrapped people into going after twelve certain people by putting a price on their heads. Doldo was included in Doflamingo's hit list."}, {"type": "paragraph", "text": "After Tank Lepanto, Usopp, Robin, Rebecca, Bartolomeo, Hack, and the Tontatta dwarves reached the top of the old King's Plateau, Doldo saw that Viola found the key to Law's seastone handcuffs. After Doldo reminded Viola that Luffy is a pirate, Viola pleaded to her father to believe in the Straw Hats and pointed out that they could not count on the \"justice\" of the Marines and the World Government and Luffy was sincere in his promise to defeat Doflamingo. The dwarves chimed in, saying that they were saved and the curse set by Sugar was broken because of the pirates."}, {"type": "paragraph", "text": "Once Leo finished explaining his plan to reach the flower garden on the new King's Plateau, Doldo, Viola, and Tank watched as Robin, Rebecca, Leo, and Bartolomeo travel to the new King's Plateau using the Yellow Giant Rhinoceros Beetles."}, {"type": "paragraph", "text": "Doldo and his group were later contacted by the dwarves in the SMILE factory and learned that Mansherry, the dwarf princess, was not there. Doldo asserted that she is locked up inside the royal palace and that Doflamingo won't kill her because she possesses some ability."}, {"type": "paragraph", "text": "The group on the old King's plateau were later joined by Kin'emon and Kanjuro."}, {"type": "paragraph", "text": "When the Dressrosa citizens reached the top of the plateau with the intent to capture Doldo and Usopp, Doldo and the others held them back long enough for Usopp to snipe at Sugar. After capturing Riku, they released him and the others, realizing that they were merely playing into Doflamingo's hands if they had continued. They begged for Riku to help them and asked him what they should do. Riku told the citizens to wait and decided to place his faith in Luffy. They were then met by Admiral Fujitora, who was also making the same bet as Riku."}, {"type": "paragraph", "text": "As the battle against the Donquixote Pirates unfolds, Viola informed Doldo about how Luffy and Law's fight with Doflamingo was progressing."}, {"type": "paragraph", "text": "After hearing the news about Diamante's defeat from Viola, Riku told the others on the King's Plateau that he would descend into the city. He was then seen watching how Pica (in the giant Pica statue) was heading towards him and the others."}, {"type": "paragraph", "text": "When Pica came close to the Old King's Plateau, Doldo told the citizens to flee while staying to face Pica. Pica mocked Doldo, saying that he was unfit to be king. Doldo admitted on his inability to protect the country and declared that he has no intention on returning to the throne. He also explained that a country whose history is filled with massacres cannot have a future. Pica was about to attack but was stopped and defeated by Zoro. Doldo was awestruck by Zoro's display of strength. The rubble from the Pica statue was about to fall onto the plateau but they were destroyed by Elizabello's King Punch."}, {"type": "paragraph", "text": "With the threat of Pica eliminated, Doldo then left the Old King's Plateau with Tank and the citizens. When Doflamingo decided to end his game by shrinking his Birdcage, Doldo was further disgusted at Doflamingo's villainy. Doldo was later informed by Viola via Den Den Mushi that Doflamingo was the only enemy remaining. As the citizens started giving in to despair, Doldo spoke to them through the speakers and encouraged them to survive and help one another until Luffy defeats Doflamingo."}, {"type": "paragraph", "text": "As Luffy was recovering his strength to defeat Doflamingo, Riku Doldo III and Tank Lepanto assisted the citizens and warriors in pushing the Birdcage back. Once Luffy finally defeated Doflamingo, Doldo witnessed the collapse of the Birdcage. He then tearfully reminisced the night Doflamingo arrived on Dressrosa as Gatz announced Luffy's victory."}, {"type": "paragraph", "text": "With the downfall of the Donquixote Pirates, the citizens were overflowed with joy. Though Doldo had no intention of returning to the throne, the citizens begged him to become king again. Fujitora then approached Doldo and gave him a heartfelt apology for the damage a Shichibukai has caused and the World Government's irresponsibility."}, {"type": "paragraph", "text": "Doldo asked Fujitora to raise his head, but the Admiral did not mind if the whole world saw him kneeling, saying that it is better for the world to know the truth. After Fujitora claimed that he had no right to preach justice, Doldo asked Tank to shelter the pirates and warriors who fought the Donquixote Pirates as well as the citizens who lost their homes."}, {"type": "paragraph", "text": "Later that night after the aftermath, Riku Doldo III was at the palace, telling Rebecca that she would become princess of Dressrosa once he became king again."}, {"type": "paragraph", "text": "Three days after Doflamingo's downfall, Doldo returned to the throne. Inside the palace, Doldo had a conversation with Elizabello II. Doldo declared that he will do his best for Dressrosa until Rebecca takes the throne."}, {"type": "paragraph", "text": "As he prepared to go to town to declare the Riku Family's return to royalty, Doldo was surprised to hear Luffy taking Rebecca from the royal palace. Viola then informed Doldo of Rebecca's decision to leave her title of princess."}, {"type": "paragraph", "text": "When he witnessed Issho lifting all the rubble from Dressrosa, Doldo wondered if the admiral planned to wipe out Luffy and his allies in one fell swoop."}, {"type": "paragraph", "text": "After Luffy and his allies escaped, the people of Dressrosa proceeded with the celebrations. Doldo presented himself to the citizens and later received a note explaining that the Levely will take place soon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cb/Blue_Gilly_Defeats_Riku_Doldo_III.png/revision/latest/scale-to-width-down/210?cb=20140330051642", "caption": "Ricky is defeated by Blue Gilly."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a1/Gladiators_and_Toys_Bow_Before_King_Riku.png/revision/latest/scale-to-width-down/210?cb=20141206180923", "caption": "The gladiators and broken toys bow before their former king."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f5/Pica_Confronts_Riku.png/revision/latest/scale-to-width-down/210?cb=20151124160053", "caption": "Pica attacks Doldo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c1/Fujitora_Kneels_Before_Riku.png/revision/latest/scale-to-width-down/210?cb=20160509033926", "caption": "Fujitora and the Marines kneel to Riku in apology."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Elizabello II contacted King Riku, asking if they could travel to Mary Geoise. Doldo III spoke with Leo, Bian, and Kabu and assigned them to be escorts for the Levely."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "While traveling to the Levely with Elizabello II, Riku Doldo III played a game of chess with him when Rebecca came bearing news of Luffy's exploits at Totto Land. They were alarmed when the Dressrosa-Prodence Kingdom convoy came under attack by pirates. However, the convoy was saved by Koby and Helmeppo."}, {"type": "paragraph", "text": "The Dressrosa participants later arrived at Mary Geoise. Just prior to the Levely, Doldo had a meeting with Admiral Fujitora and Nefertari Cobra. Doldo later went to the conference room with the other kings and queens to begin the Levely."}, {"type": "paragraph", "text": "Thanks to the efforts of Doldo and Cobra, the Shichibukai system had been abolished."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ricky vs. Kyros", "elements": []}, {"text": "Ricky vs. Corrida Colosseum Block B Gladiators", "elements": [{"text": "Ricky vs. Blue Gilly", "elements": []}]}]}], "images": []}, {"title": "Anime-Only Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Riku Doldo III, Tank Lepanto, and Hack vs. pirates", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the digitally colored manga, Ricky's armor is golden while his armor is colored silver in the anime. His cape is also purple in the digitally colored manga, but in the anime it is blue."}], "images": []}]}