{"sections": [{"title": "Jean Ango", "level": 1, "content": [{"type": "paragraph", "text": "Jean Ango, also known as Jean the Bandit, is a bounty hunter. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jean Ango is a tall, bulky man with small, piercing eyes and a large nose. He wears a green cactus-looking mouth guard, and sports a large sombrero with a red and yellow pattern on the rim and a green cactus on top."}, {"type": "paragraph", "text": "During the Colosseum match, he is shirtless, wearing armor on his right arm and a chain around his torso and shoulder. He also wore a large skirt and dark boots."}, {"type": "paragraph", "text": "After Chinjao headbutts Jean and knocks off his hat in the process, it is revealed that Jean's head and hair also resembles a cactus. His protector was also broken, and Jean is revealed to have a blocky jaw."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like many other One Piece characters, he has his own unique laugh, which is \"Dededede\"."}, {"type": "paragraph", "text": "Jean Ango seems to enjoy stealing things, as he was thankful to Chinjao for providing him so many opportunities to steal weapons. He is also perceptive, suspecting Lucy's real identity. Despite this, while sniping weapons at Lucy, Jean failed to realize he was hitting Chinjao with the weapons, suggesting that he has keen focus."}, {"type": "paragraph", "text": "As a bounty hunter, he enjoys hunting criminals and aims to raise his reputation, apparently having captured many of the convicts who escaped Impel Down with Luffy and also plans to hunt down those who assisted Luffy during the Whitebeard War. He included Buggy in his list of targets despite the fact that Buggy is a Shichibukai, indicating that Ango disregarded his current status."}, {"type": "paragraph", "text": "He does not seem to be very familiar with Haki, as he did not know how Luffy was able to dodge his attacks. Despite this, he does a possess a strong enough will to resist Chinjao's burst of Haoshoku Haki."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Jean Ango has stated that he is a sniper, but rather than using firearms or other conventional projectile weapons, Jean throws the many weapons he steals, turning the arms of his defeated foes against his new ones. He demonstrates fittingly great strength and precision with his throwing, and despite his large size, is nimble and stealthy enough to rob items from opponents while he fights them, as shown when he stole Lucy's helmet."}, {"type": "paragraph", "text": "Little other strengths or skills have been shown, but Jean must be confident in his overall might as he entered as a contestant at the Corrida Colosseum. The fact that he can survive the New World with no problem is a testament of his skills, as well as being able to capture escapees of Impel Down."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "The only dedicated weapon Jean uses is a four-bladed metal claw on his right hand, but so far he has been shown to make much greater use of the weapons he steals."}, {"type": "list", "elements": [{"text": "Gihaio (妓配王, Gihaiō, literally meaning \"Entertainer Arrange King\"): Jean Ango aims and throws weapons such as axes, swords or sabers bare handed at his enemies with great speed and strength. This attack is strong enough to pierce a wall and hurt Chinjao. It was first shown in the Corrida Colosseum against an unnamed gladiator but was later named while attacking Lucy. The name of the attack is a pun on oihagi (bandit).", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/db/Jean_Ango%27s_Weapons.png/revision/latest/scale-to-width-down/180?cb=20151020014824", "caption": "Jean Ango's weapons"}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Before the fighting tournament, Jean Ango captured many of the Impel Down convicts that had escaped with Luffy two years earlier."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Jean Ango entered the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block C."}, {"type": "paragraph", "text": "Later, as Block C's battle royale commenced, Jean Ango, along with Chinjao, Sai, Boo, and the Funk Brothers, was seen watching as Lucy plowed through his fellow competitors while riding on the back of Fighting Bull."}, {"type": "paragraph", "text": "After Chinjao knocked out his attackers utilizing Haoshoku Haki, Jean was seen collecting weapons from the fallen warriors, thanking the large man for helping him get them. At the same time, Jean was fleeing from one of his opponents, who wanted revenge on the bounty hunter for sending an acquaintance of his to jail. Explaining that the weapons he collected were his \"bullets\", Jean proclaimed that he is a sniper, before expertly dispatching his pursuer with the weapons he just collected."}, {"type": "paragraph", "text": "The bounty hunter then mocked his would-be attacker, stating that if this partner of his was so important to him, then he should show some guts and attack the prison like \"some idiot\" did two years ago. Shortly after this, he stole Lucy's helmet, remarking that he had heard something interesting about him, before informing him about the rumor that the Straw Hat Captain Monkey D. Luffy entered the tournament. As Chinjao charged towards Lucy, ranting about how he should atone for his grandfather's sins, Jean listened into their conversation with great interest, taking the former pirate's words as confirmation that Lucy was indeed Luffy. When the disguised Luffy demanded for his helmet back, Jean taunted him, saying that if he wanted it back, he was going to have to get to him first."}, {"type": "paragraph", "text": "With this, the bounty hunter unleashed his Gihaio technique, throwing several of the weapons he had collected from the fallen gladiators at his newest victim. As Lucy dodged this assault with ease, Jean proclaimed how he has made a lot of money in the past two years because of him, due to capturing many of the prisoners that had escaped from Impel Down with the disguised Straw Hat captain. He then went on to explain his plan of hunting down the entire \"Jailbreak Team\", which includes Buggy, Jinbe, Crocodile, Emporio Ivankov, and Shiryu. As he declared how he will become famous for bringing in all of their heads, Lucy continued to dodge every weapon Jean sent his way, while at the same time wondering how Ivankov was doing. Jean continued his speech by stating how the world does not know that the Level 6 prisoners escaped, because it was never announced, but that he has discovered their location."}, {"type": "paragraph", "text": "As Jean relayed this information, Lucy continued to dodge every single weapon Jean tossed at him, questioning whether there had been more prisoners that had escaped than he had previously thought. Frustrated by Lucy's ability to dodge every projectile, Jean furiously wondered why he could not hit him. As he prepared to continue his assault on the disguised Luffy, Jean was stopped in his tracks by what he saw behind the Straw Hat captain: Chinjao, who was hit by every single weapon that Lucy had dodged previously. Eyes widening in fear, Jean showed no resistance in Lucy taking back his helmet. Seconds later, a furious Chinjao knocked Jean out of the ring with a head butt, disqualifying him from the battle royale."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/99/Jean_Ango_defeated.png/revision/latest/scale-to-width-down/210?cb=20140525090211", "caption": "Jean Ango defeated by Chinjao."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jean Ango vs. Impel Down Escapees (unseen)", "elements": []}, {"text": "Jean Ango vs. Corrida Colosseum Block C Gladiators", "elements": [{"text": "Jean Ango vs. Monkey D. Luffy (interrupted by Chinjao)", "elements": []}]}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, it was never shown how Jean Ango acquired Lucy's helmet. In the anime, it showed that Jean Ango picked up the helmet after it had fallen off Lucy's head during his clash with Ideo."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He has the same full name as the real-life privateer Jean Ango. Unlike most characters with names from real life people, his full name is based only on one person.", "elements": []}, {"text": "His hat is similar to those from the Shishano Kingdom.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 706 and Episode 639, Jean Ango makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 715 and Episode 639, Jean Ango is formally introduced.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 716 and Episode 646.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 715 and Episode 645.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 714 (p. 12) and Episode 639, Jean is seen with metal claws.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 72 Chapter 714 (p. 12).", "elements": []}]}], "images": []}]}