{"sections": [{"title": "Mummy", "level": 1, "content": [{"type": "paragraph", "text": "Mummy is a sorcerer who joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mummy is a wrinkled man, with bandages covering the sides of his face, making an X in the middle. His head is decorated with feathers. His hands are also wrapped in bandages, and he wears a fur covering, most likely made of an animal hide."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Mummy_Anime_Full_Body.png/revision/latest/scale-to-width-down/180?cb=20150523150416", "caption": "A full body view of Mummy in the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When Cavendish fell asleep, Mummy became very scared, since he knew that Hakuba would attack."}, {"type": "paragraph", "text": "Mummy has a sense of honor, as he choose to lay his life on the line to protect Luffy from Doflamingo long enough to buy the pirate enough time to defeat the Shichibukai."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a sorcerer, Mummy most likely can use some form of magic (or ability that resembles it)."}, {"type": "paragraph", "text": "In the anime, he waved his hands and spoke an incantation that made two gladiators approaching him unable to breathe, incapacitating them. He has not been seen using any such ability in the manga."}, {"type": "paragraph", "text": "Not much is known about his skills in combat, but he must be confident in his strength as he entered as a contestant at the Corrida Colosseum."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Mummy entered the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block D. As the battle royale began, Mummy was preparing to fight."}, {"type": "paragraph", "text": "When twenty fighters remained, Cavendish's alter-ego Hakuba suddenly surfaced and proceeded to strike down all the remaining fighters in Block D. Mummy was hit by a blast of fire from Damask during the frenzy. Mummy then laid defeated on the arena floor."}, {"type": "paragraph", "text": "After Doflamingo initiated his Birdcage and was nearly defeated by Monkey D. Luffy, Mummy and the other gladiators from the colosseum provided their aid to the Straw Hat after he became exhausted."}, {"type": "paragraph", "text": "When the Birdcage came closer to the central streets, Mummy and the gladiators tried to attack Doflamingo, but they were easily defeated. However, they did buy enough time for Luffy to recover, enabling him to defeat Doflamingo and bring down the Birdcage."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/21/Hakuba_Defeats_Block_D_Competitors.png/revision/latest/scale-to-width-down/180?cb=20151130174131", "caption": "Mummy and the rest of Block D is defeated by Hakuba."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mummy vs. Corrida Colosseum Block D gladiators", "elements": []}, {"text": "Mummy and Corrida Colosseum gladiators vs. Donquixote Doflamingo", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A mummy is a corpse that has been preserved in order to guide the recipient's soul to the afterlife, and is commonly associated with Ancient Egyptian culture.", "elements": []}]}], "images": []}]}