{"sections": [{"title": "Fighting Bull", "level": 1, "content": [{"type": "paragraph", "text": "Fighting Bull is a gladiator competing at the Corrida Colosseum. He is nicknamed Ucy by Luffy (Moocy in the english versions), and renowned in the Colosseum as the Brutal Bull. He is an ally of Luffy during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Fighting Bull is a large bull with dark fur, long horns (the left of which was later broken due to Hajrudin) and a bulky body. He also has small eyes, both with three eyelashes on each."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is described by Gatz as the \"Colosseum's Grim Reaper\", and his fighting style has led him to become known as the \"Brutal Bull\". Despite this, Luffy was still able to tame and befriend him using his Haoshoku Haki."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He is powerful enough to eliminate many competitors of Block C. He is also said to have eliminated many death row prisoners in the past, a further testament to his fighting prowess. However, he was no match for Hajrudin, as he was defeated in one blow by the giant."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point before his participation in Block C, he defeated many death row prisoners in the Corrida Colosseum."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Fighting Bull entered the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block C."}, {"type": "paragraph", "text": "During the battle royale, he was tamed and ridden by Lucy, and was dubbed Ucy by the disguised Straw Hat captain. Charging into the midst of a large number of combatants, he swiftly eliminated them, only to accidentally run into Hajrudin's leg. Taking this as a challenge, the giant attacked the two friends, smashing them both into the ground, which rendered Fighting Bull unconscious and broke its left horn. Angered by the giant's attack on his newfound friend, Lucy avenged Fighting Bull by knocking Hajrudin out with one blow. He then carried Fighting Bull away to a safer part of the ring."}, {"type": "paragraph", "text": "He later went to the underground medical treatment facility to receive treatment for his injuries."}, {"type": "paragraph", "text": "After Doflamingo trapped Dressrosa in his \"birdcage\", he went to the surface. After finding and recognizing Luffy, he joined forces with him alongside the Chinjao Family, Hajrudin, Cavendish, Ideo, Elizabello II, Dagama, Blue Gilly, Abdullah , Jeet, Orlumbus, and Suleiman. They later marched towards the palace and began to battle against Pica."}, {"type": "paragraph", "text": "When Pica attempted to strike, Chinjao and Elizabello II shattered Pica's stone hand, enabling the group to move forward. Pica then attacked with his other arm, causing Luffy's allies to fall back. However, Fighting Bull, with Luffy, Zoro, Law, Abullah, and Jeet on its back, jumped on and ran on Pica's arm. After Luffy shattered Pica's stone head with Grizzly Magnum, Pica's true body appeared before the bull. Pica took out his sword and tried to attack the bull and the group riding on it, but Luffy carried the bull and evaded the sword strike. Zoro intercepted Pica when he attempted to strike again. With Pica held back, the Fighting Bull ran on the stone giant's back, carrying Luffy, Law, Abdullah, and Jeet closer to the palace."}, {"type": "paragraph", "text": "They eventually reached the first level of the new King's Plateau. While they charged through Doflamingo's troops, Kelly Funk (while fused to Bobby Funk) appeared seemingly to aid them and showed them a tunnel that is supposed to go directly to the fourth level. While entering the tunnel, Abdullah and Jeet fell off Ucy so the Fighting Bull, Luffy, and Law went ahead without them. Instead of reaching the fourth level, they reached a dead end where they found themselves above a pool of water. They were then ambushed by Doflamingo."}, {"type": "paragraph", "text": "Doflamingo attacked Ucy with a bullet thread, knocking him unconscious. Ucy, Luffy, and Law were saved from death by the timely arrival of Abdullah and Jeet, who both struck Doflamingo (who was only a string clone) in the back. After Luffy punched a hole to the second level, he left Ucy with Abdullah and Jeet."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/01/Ucy_defeated.png/revision/latest/scale-to-width-down/200?cb=20140511170534", "caption": "Ucy crushed by Hajrudin"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Luffy_and_the_Corrida_Colosseum_Gladiators_Going_After_Doflamingo.png/revision/latest/scale-to-width-down/250?cb=20160608200003", "caption": "Ucy ridden by Luffy, Zoro, and Law and are accompanied by the other Corrida Colosseum fighters."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Fighting Bull vs. death row prisoners", "elements": []}, {"text": "Fighting Bull vs. Corrida Colosseum Group C Gladiators", "elements": [{"text": "Fighting Bull vs. Hajrudin", "elements": []}]}, {"text": "Fighting Bull vs. Donquixote Pirates' troops", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Fighting Bull vs. Lucy", "elements": []}]}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, \"Brutal Bull\" has been used as the character's name, rather than as an epithet. \"Fighting bull\" has only been used to describe him, just as \"fighting lion\" describes Agyo.", "elements": []}, {"text": "The name was mistakenly romanized as \"Brutal Bule\" when the gladiators were introduced at the beginning of Block C.", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Luffy's nickname for Fighting Bull, Ucy, is a pun based on his own gladiator name Lucy (ルーシー, Rūshī), and the Japanese word for bull (牛, Ushi). The syllables \"U\" and \"shi\" are stretched out to match the pronunciation of Lucy (\"si\" and \"shi\" are written and pronounced the same in Japanese). The Viz translation compensates for this by using the name \"Moocy\" instead."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}]}