{"sections": [{"title": "Rolling Logan", "level": 1, "content": [{"type": "paragraph", "text": "Rolling Logan is an army commander of the Majiatsuka Kingdom. He joined as a gladiator at the Corrida Colosseum to compete for the Mera Mera no Mi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rolling Logan is a big, muscular man with large thick lips and curly dark colored hair."}, {"type": "paragraph", "text": "He has a torso and arms that appear to be rather disproportionate compared to his legs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7f/Rolling_Logan_Anime_Concept_Art.png/revision/latest/scale-to-width-down/160?cb=20190624082329", "caption": "Rolling Logan's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He seems to be a brutal man as he enjoyed crushing his opponents."}, {"type": "paragraph", "text": "In the anime, he appears to be sadistic and hungry for positive attention, bragging about how he was going to crush Rebecca just to receive cheers from the audience who despised her."}, {"type": "paragraph", "text": "However, he does have some sense of honor, as he choose to protect Luffy from Doflamingo to give him time to regain his strength to defeat the Shichibukai choosing to lay down his life for him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an army commander, Rolling Logan must have some experience in battle."}, {"type": "paragraph", "text": "He has been shown crushing opponents with his arm strength."}], "images": []}, {"title": "Anime Only Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Rolling Cradle (ローリング・クレードル, Rōringu Kurēdoru): Rolling Logan's signature attack. After grabbing onto an enemy, Logan spins around at rapid speed like a wheel, dealing damage to the person been held as well as anyone who he rams into. This was first used against a gladiator who challenged him.", "elements": []}]}, {"type": "list", "elements": [{"text": "Matasaki (股裂き, Matasaki, literally meaning \"Leg Split\"): Rolling Logan's finishing move. He splits the leg of of his opponent, breaking his/her bones and crippling the victim. This was first used against a gladiator who challenged him.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Rolling Logan entered the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block D. As the battle royale began, Rolling Logan was preparing to fight. The army commander took out two gladiators with a vicious bear hug before turning to Rebecca and asking if he should break her bones next."}, {"type": "paragraph", "text": "As Rolling Logan chased Rebecca around the arena, he mowed down all the gladiators who were also going after her."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "In the anime, he chased Rebecca and eventually caught her. While tormenting her by crushing her body, Acilia rescued Rebecca. Logan then fought Acilia, eventually sending her flying backward. Rebecca then jumped into the air and tricked Logan into thinking she was attacking him. She used her sword to somersault over him and made him lose his balance, stumble forward and fall out of the ring."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "He eventually gave up on pursuing Rebecca as she was later seen fighting other opponents. When 20 fighters remained, Cavendish's alter-ego Hakuba suddenly surfaced and proceeded to strike down all the remaining fighters in Block D. Rolling Logan fell victim to his attack and laid defeated on the arena."}, {"type": "paragraph", "text": "After Doflamingo initiated his Birdcage and was nearly defeated by Monkey D. Luffy, Rolling Logan and the other gladiators from the colosseum provided their aid to Luffy after he became exhausted. However, they did buy enough time for Luffy to recover, enabling him to defeat Doflamingo and bring down the Birdcage."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Rolling Logan vs. Corrida Colosseum Block D Gladiators", "elements": [{"text": "Rolling Logan vs. Rebecca", "elements": []}]}, {"text": "Rolling Logan and Corrida Colosseum gladiators vs. Donquixote Doflamingo", "elements": []}]}], "images": []}, {"title": "Anime-Only Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Rolling Logan vs. Acilia", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the manga, Rolling Logan was defeated during Hakuba's rampage like the other Block D gladiators. In the anime, his fight with Rebecca was extended, and he was defeated earlier when Rebecca (with Acilia's help) caused him to lose his balance and fall out of the ring.", "elements": []}]}], "images": []}]}