{"sections": [{"title": "Hack", "level": 1, "content": [{"type": "paragraph", "text": "\"Hundredth Dan\" Hack is a Japanese soldierfish Fish-Man and member of the Revolutionary Army. He went to Dressrosa to investigate the arms trafficking there and competed at the Corrida Colosseum for the Mera Mera no Mi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hack is a Fish-Man with yellow skin that has brown spots on the upper part of his head, along with scales under his eyelids, sharp teeth, and gills on the sides of his neck. The Fish-Man has a muscular stature, with long light blue flowing hair and a thick blue mustache."}, {"type": "paragraph", "text": "Similar to Kuroobi, he wears an open gi with a black belt."}, {"type": "paragraph", "text": "When he was transformed into a toy, he appeared to be shaped like a dog."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hack is a calm and proud person, and follows a dream where a path of friendship may be formed by fighting. For that reason, he will continue fighting. He finds fighting battles to be honorable and thus, dislikes those who show a lack of respect toward a fight such as Bartolomeo. He is very honorable and dislikes attacking an opponent from the back, but he will do it if said opponent is not worthy of his respect, as he did to Bartolomeo, who was urinating on the side of the fighting ring and was, in Hack's opinion, not taking the battle seriously."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Jinbe", "level": 3, "content": [{"type": "paragraph", "text": "He is a dear friend of Jinbe, and also shares the same dream - to have a friendship between humans and Fish-Men. However, the way differs between the two, as Hack stated that he wants it \"by fists\"."}], "images": []}, {"title": "Nico Robin", "level": 3, "content": [{"type": "paragraph", "text": "Hack seems to have developed a friendly relationship with Nico Robin, who was rescued by the revolutionaries just prior to the timeskip. She greeted him warmly soon after meeting again in Dressrosa."}], "images": []}, {"title": "Revolutionary Army", "level": 3, "content": [], "images": []}, {"title": "Koala", "level": 4, "content": [{"type": "paragraph", "text": "He seems to be working closely with Koala. He intended to get into contact with her after losing the Corrida Colosseum tournament but was unable to after he was turned into a toy by Sugar and forced to work. In SBS Volume 80, it is revealed by Oda that Hack was the one responsible for bringing Koala into the Revolutionary Army when she was 14. She studied Fish-Man Karate under his tutelage, eventually becoming a Master Assistant Fish-Man Karate Instructor."}], "images": []}, {"title": "Sabo", "level": 4, "content": [{"type": "paragraph", "text": "Hack also works closely with Sabo in the Revolutionary Army. However, he along with Koala, are occasionally at odds with him over his tendency to leave his post during missions. Like Koala, he is also frustrated with Sabo for neglecting his duties as a revolutionary by leaving his post. When Sabo hung up on his communication with him, he took out his anger on another revolutionary member for his rudeness. In SBS Volume 80, it is revealed by Oda that the amnesiac Sabo studied briefly martial arts under Hack, but since Sabo was already a talented fighter due to his training alongside Luffy and Ace, there was little that Hack could teach Sabo, so Dragon took Sabo under his wing."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Hack has exceptional superhuman strength. He could stop an assault from a large gladiator by grabbing his opponent's spiked club, with the man commenting that he was unable to move his weapon in Hack's grip."}], "images": []}, {"title": "Fish-Man Karate", "level": 3, "content": [{"type": "paragraph", "text": "Hack is a highly proficient expert in Fish-Man Karate, being a 100 level practitioner and an instructor. He could use high level Fish-Man Karate techniques to defeat his opponents in one hit, knocking out a gladiator larger than himself."}], "images": []}, {"title": "Fish-Man Jujutsu", "level": 3, "content": [{"type": "paragraph", "text": "Hack is a Fish-Man Jujutsu martial artist."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At an unknown time in the past, he became friends with Jinbe of the Royal Shichibukai . He also became a member of the Revolutionary Army where he trained many orphans over the years, including Sabo. By the time Sabo was 13, the child had become so strong for his age that Hack had nothing left to teach him. A year later, Hack and Sabo became acquainted with Koala. Over the years, the trio were sent on the same missions together."}], "images": []}, {"title": "Two Years Ago", "level": 4, "content": [{"type": "paragraph", "text": "After the Whitebeard War, Sabo had a mental breakdown after recovering his lost memories. When Sabo awoke from his three-day coma, Hack expressed his concerns."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Hack, Sabo, and Koala arrived at Dressrosa in order to put a stop to a weapons trade that the Donquixote Family managed."}, {"type": "paragraph", "text": "Hack entered the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block B."}, {"type": "paragraph", "text": "After Block B's battle royale had started, one of the fighters taunted Hack for being a Fish-Man, asking why a \"freak\" like him had entered a human tournament. Eyes closed, the Fish-Man mused over how pitiful the man's statements were, remarking that they are nothing but the words of a puppet, and that if he wants to talk, he should at least do it with his fists. Enraged, Hack's opponent rushes forward and attacks him with a giant spiked club, which the Fish-Man catches with one hand. As the man wonders why he can't move, Hack defeats him with Fish-Man Karate, sending him flying away. Hack then announces his desire to continue pursuing his dream of forming friendships through fighting, in the same spirit as his friend Jinbe."}, {"type": "paragraph", "text": "As he continued to defeat opponent after opponent with his Fish-Man Karate, Hack gained popularity from both the crowd and Gatz, who heartily cheered him on. When Bartolomeo began to pee over the side of the arena in front of the entire audience, Hack approached him, angrily commenting how there are people who were trying to fight seriously, and that he had no choice but to attack the Super Rookie from behind. As the crowd cheered him on, Hack unleashed his attack, only for it to be blocked by Bartolomeo's Bari Bari no Mi ability, which crushed the Fish-Man'S hand, severely injuring him. As the spectators and Gatz gape in confusion over what had just happened, Hack writhed in pain on the arena's floor, with the ferocious Bartolomeo leering over him. Continuing what he had started, the vicious Super Rookie then finished Hack off with a brutal kick to the face."}, {"type": "paragraph", "text": "Sometime later, he was supposed to receive treatment for his injuries but instead, he was thrown in an underground dungeon filled with broken toys along with some of the disqualified participants. Hack commented that it was safe to assume that they won't be receiving medical treatment at all."}, {"type": "paragraph", "text": "After Ricky was revealed to be the former king of Dressrosa, Riku Doldo III, Hack was seen secretly speaking with Koala by means of a Den Den Mushi."}, {"type": "paragraph", "text": "Hack was later seen in the underground trade port, having been transformed into a toy dog and forced to work. While moving crates, he complained bitterly that Koala was waiting for his report."}, {"type": "paragraph", "text": "When Sugar lost consciousness, Hack transformed back into his original form. He was then informed by Koala that Sabo was making his way to the basement."}, {"type": "paragraph", "text": "After Sabo and Koala arrived at the underground trade port through the surface, Hack was seen standing alongside them."}, {"type": "paragraph", "text": "After reacquainting with Robin, they later watched in shock as Doflamingo initiated his \"bird cage\" plan and created a \"game\" which gives the citizens of Dressrosa a choice to either kill him or a list of people he offers to them."}, {"type": "paragraph", "text": "Doflamingo announced his hit list, which includes Sabo, Robin, Rebecca, and Usopp. With Usopp's new followers turned against them, Hack, Koala, Sabo, Robin, Rebecca, Usopp, Bartolomeo, and the Tontatta dwarves fled from the mob."}, {"type": "paragraph", "text": "They (except for Sabo and Koala) later reached the colosseum stands. While Bartolomeo used his barrier against their pursuers, Hack noted that Sabo went off somewhere."}, {"type": "paragraph", "text": "They eventually arrived at the top of the old King's Plateau where they met up with Riku Doldo III, Viola, and Tank Lepanto. Hack remained with King Riku, Viola, and Usopp while Rebecca, Bartolomeo, Leo, Kabu, and Rebecca headed for the new King's plateau to find Luffy and the rest of the dwarves headed for the SMILE factory."}, {"type": "paragraph", "text": "The group on the old King's plateau were later joined by Kin'emon and Kanjuro."}, {"type": "paragraph", "text": "When the Dressrosa citizens reached the top of the plateau with the intent to capture King Riku and Usopp, Hack held them back long enough for Usopp to snipe at Sugar."}, {"type": "paragraph", "text": "The citizens who were originally after Doflamingo's targets then had a change of heart, realizing that they were playing in Doflamingo's hands. Sometime after the defeat of most of the Donquixote Pirates' officers, Pica arrived at the Old King's Plateau in his giant Pica statue, intending to crush everyone on the plateau. Fortunately, Pica was defeated by Zoro and the rubble from the statue was destroyed by Elizabello's King Punch. While Doldo, Tank, and the citizens were leaving the plateau, Hack stayed with the others and heard about Law's defeat from Viola."}, {"type": "paragraph", "text": "After the Birdcage started shrinking, Hack was seen climbing down the Old King's Plateau carrying Usopp on his back."}, {"type": "paragraph", "text": "They eventually reached the base of the plateau while Viola informed her father via Den Den Mushi that Doflamingo was the only enemy left."}, {"type": "paragraph", "text": "He continued carrying Usopp on his back as Luffy engaged Doflamingo in a final battle while many others worked together to slow the Birdcage down. Once Luffy finally defeated Doflamingo and brought down the Birdcage, everyone on Dressrosa rejoiced as Luffy's victory was announced."}, {"type": "paragraph", "text": "Hack was later seen at the underground trade port, waiting for Sabo along with Koala and some other revolutionaries."}, {"type": "paragraph", "text": "He then contacted Sabo, who told him that he was heading for the harbor, but abruptly hung up before Hack could say anything else. This caused Hack to become frustrated and take out his anger on the Den Den Mushi operator."}, {"type": "paragraph", "text": "The revolutionaries later left Dressrosa and they apparently took all the weapons and evidence relating to the Donquixote Family's smuggling operation before CP-0 could recover them."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Bartolomeo_Power.png/revision/latest/scale-to-width-down/210?cb=20170904223329", "caption": "Hack attacks Bartolomeo's back before being defeated."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cd/Revolutionaries_in_Dressrosa.png/revision/latest/scale-to-width-down/210?cb=20150125192049", "caption": "Hack with Sabo and Koala"}]}, {"title": "Silver Mine Arc", "level": 3, "content": [{"type": "paragraph", "text": "Hack and his fellow revolutionaries were seen on a ship stationed far away from Gran Tesoro."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hack vs. Corrida Colosseum Block B Gladiators", "elements": [{"text": "Hack vs. Bartolomeo", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Hack vs. Usopp's former followers", "elements": []}, {"text": "Hack, Riku Doldo III, and Tank Lepanto vs. pirates", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dan: Wikipedia article about the meaning of Hack's epithet.", "elements": []}]}], "images": []}]}