{"sections": [{"title": "Jinbe", "level": 1, "content": [{"type": "paragraph", "text": "\"Knight of the Sea\" Jinbe is a member of the Straw Hat Pirates, serving as a helmsman in his current capacity with them. As of now, he is officially the tenth member of the Straw Hat crew and the ninth to join. He is a whale shark fish-man who served as the second captain of the Sun Pirates after Fisher Tiger, and a former Shichibukai from 11 years ago until the Battle of Marineford two years ago. His dream is to fulfill his former captain Fisher Tiger's dying wish of coexistence and equality between humans and fish-man and continues to live his life in the hopes of seeing that dream's completion. "}, {"type": "paragraph", "text": "His name was first mentioned by Yosaku, when he was explaining about the Shichibukai. However, he is formally introduced much later, during the Impel Down Arc. He renounced his Shichibukai title at the Battle of Marineford, allying himself with the Whitebeard Pirates. After Whitebeard's death, his crew formed an alliance with Big Mom to protect Fish-Man Island. He befriended Monkey D. Luffy during the Battle of Marineford, and later allied with him and his crew to prevent the New Fish-Man Pirates' coup d'état against the Neptune Royal Family and the Ryugu Kingdom. Luffy invited him to join the Straw Hats, but Jinbe held it off until he had severed ties with Big Mom. He would later do so during the Whole Cake Island Arc and officially become a Straw Hat member."}, {"type": "paragraph", "text": "Jinbe's first bounty was 76,000,000. Eventually, his bounty raised to 250,000,000. After he resigned from the Shichibukai, his bounty increased to 438,000,000."}, {"type": "paragraph", "text": "He also is the central character from Solo Journey of Jinbe, Knight of the Sea Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jinbe is a large blue whale shark fish-man and the current tallest member of the Straw Hat Pirates. He has a stocky build similar to that of a sumo wrestler and a face that is commonly associated with various Japanese demons such as the oni. His yellow eyebrows and sideburns are distinctly shaped like those found on such demons, in addition to a bulb-like nose and an angular lower lip pointing upwards. He has a lightning-shaped scar that can be seen from his left sideburn and reaching over his left eye which he obtained sometime between Otohime's assassination and meeting Ace. He also possesses two tusk-like conical lower fangs associated with Oni as well; the rest of his teeth from the upper and lower rows are pretty much the same, albeit much smaller. He also has a severe underbite, which makes room for his huge fangs."}, {"type": "paragraph", "text": "He has long, two-toned black hair, with two long stripes, colored gold in the manga and white in the anime, coming from the roots over his forehead and trailing down the back, a topknot, and tuft of hair on his chin with a slight green hue. This topknot did not exist during his time as a member of the Sun Pirates, instead his shorter and flowing black hair trails off half way to a light color concentrated at the back of his head. He kept his chin clean-shaven before joining the Sun Pirates, after which it gradually grew out over time. His hands and feet are also webbed, typical for a fish-man, and his limbs that are somewhat thin in comparison with his enormous girth. His gills (which are pale and pinkish in color) are in between his shoulders and neck."}, {"type": "paragraph", "text": "Under his pale red coat (which he swaps for a black one two years later), he appears to be wearing a Coral colored traditional Japanese clothing covered all over with black and white square-shaped patterns with the black and white layers alternating each other (beginning with the black outline from the edge) and ending with a dark square at the middle of each and every one of them. He also ties this attire up with a purple obi like a ribbon around his waist."}, {"type": "paragraph", "text": "Jinbe is often seen wearing different traditional kimono of varying patterns: he wore a karakusa and later a floral design during his time as a member of the Sun Pirates; he wore square designs during his debut and a plain one after the Battle of Marineford. Four years ago, when fighting against Ace, he wore a black gi instead with fish designs on either side of the chest, and a red sash with a tanto tied to it. Two years after the war, while waiting for Luffy at the Sea Forest, his kimono has leaf-patterns. During Caribou's cover story, he is seen in another one patterned with flowers. For footwear, he appears to wear simple geta on his webbed feet. His Sun Pirates tattoo is on the middle of his chest. During the Whole Cake Island Arc, his kimono is yellow and has a Jolly Roger design arranged like stripes. Additionally, he is also wearing an orange colored coat."}, {"type": "paragraph", "text": "He wore a Neptune Army uniform while he was serving as a soldier, and was often seen smoking a pipe back then. During Otohime's funeral, Jinbe wore a suit."}, {"type": "paragraph", "text": "In SBS Volume 63, Oda draws the Shichibukai as children. Jinbe as a child is seen with light hair wearing a tattered gi practicing his Fish-Man Karate. He already had a black belt at this age."}], "images": []}]}