{"sections": [{"title": "Lacroix", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Lacroix is a Marine vice admiral and a member of the Giant Squad."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is one of the few giants seen so far that does not have unusual facial features or a beard. Like many giants, he has a large, bulky belly. He wears a Marine hat and a double-breasted suit with his sleeves rolled up, along with a purple tie. Like all high-ranking Marines, he wears a standard Marine coat draped over his shoulders."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Lacroix has a strong sense of justice. In the anime, he was shown to believe in absolute justice and told his subordinates not to hesitate. This, however, hasn’t been confirmed in the manga."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a giant vice admiral, he has power and authority over a great deal of the Marines below him. Because he is a giant, he is extremely strong. He is capable of easily surviving gunfire and cannon shots from enemy ships. He carries a sword but his skill with it is unknown thus far."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Lacroix can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was seen standing guard in front of the execution platform alongside Vice Admiral Ronse and the other members of the Giant Squad when Sengoku told the world of Ace's past. He was later seen with the rest of the Giant Squad. When Little Oars Jr. charged forth, he and the other Giant Squad members defended the bay. He briefly mentions to the others that this was the first time he ever had to look up at someone."}, {"type": "paragraph", "text": "At the end, when Sengoku announced that the war was over, he was seen being helped to his feet by the other giants."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Lacroix_Battles_Whitebeard_Pirates.png/revision/latest/scale-to-width-down/210?cb=20130527141427", "caption": "Lacroix battles the Whitebeard Pirates."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Lacroix was present at Red Port when the Marines intercepted a communication between Big Mom and Kaido."}], "images": []}, {"title": "Major Battle", "level": 2, "content": [{"type": "list", "elements": [{"text": "Vice Admiral Lacroix and Giant Squad vs. Little Oars Jr.", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "During the preparations of the battle formation before Whitebeard's appearance at the Marine Headquarters, he was giving lower ranking soldiers orders about to not hesitate and states that no matter what everything was going to end in three hours. In the manga this speech was said by Vice Admiral John Giant. In the anime, it shows him fighting Little Oars Jr. until his sword is shattered by him."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑ One Piece Blue Deep: Characters World Page 198, Lacroix's birthday is given", "elements": []}, {"text": "↑ One Piece Manga - Chapter 594, a doctor states Haki is a power all the vice admirals use.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 907 (p. 6) and Episode 887.", "elements": []}]}], "images": []}]}