{"sections": [{"title": "Wanze", "level": 1, "content": [{"type": "paragraph", "text": "Wanze is a member of CP7 and a cook, specializing in making ramen noodles."}, {"type": "paragraph", "text": "He was one of the antagonists during the Sea Train voyage in the Water 7 Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Wanze has an almost permanent smile on his face, even when he's afraid or mad. He also has white fluffy hair and buck teeth, with spiral-designs on his cheek and also has eyes that seem to extend off of his face with his skin and eyelids as well. Wanze wears a black shirt unbuttoned, revealing his chest, a yellow scarf, black pants with an orange belt, and roller skates. The back of his jacket reads \"MAD\"."}, {"type": "paragraph", "text": "After getting hit by Sanji's Parage Shot, Wanze's face is molded into something that resembles a stereotypical bishonen; ironically, he finds this form to be rather ugly. His face changes back to its former appearance after a kick to his torso from Sanji."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He often acts in a whimsical or uncontrolled manner to mislead his enemies into underestimating him which is a grave mistake, since he is a powerful fighter with incredible reflexes. He does take pride in his abilities and appears to be quite confident in them as shown when he states that they chose him on the train to keep intruders out. However, he is a bit dense and can be short tempered. Furthermore, he oddly becomes dizzy when he sees spirals, such as Sanji's eyebrow. One of the main key features of Wanze is his facial expression (the \"dumb\" smile), that never changes even when he claims to be scared, which often annoys and provokes his enemies  However, he did get mad when Sanji changed him into a bishonen and claimed to be mutilated. Like other One Piece characters, Wanze has his own Laughter Style, starting it with \"Sa\" (i.e. Sasasasasasa!). He also tends to say a verbal tic, \"Go-go-go!\", when he's excited."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Wanze is CP7's melee fighting expert. He is quite analytical, as he was able to figure out Sanji's weakness (in that immobilizing his legs makes him powerless) after fighting with him for only a few minutes."}], "images": []}, {"title": "Ramen Kenpo", "level": 3, "content": [{"type": "paragraph", "text": "Wanze fights with his \"Ramen Kenpo\" (noodle style), shooting ramen out of his nose and using them in various other ways, as well as using kitchen knives as darts and swords. At one point he uses this ramen to make a battle suit. He also adorns roller skates that he can use for enhancing kicks. He also uses a large poisoned knife."}, {"type": "paragraph", "text": "As part of his fighting style, Wanze is a chef, specialized in ramen, and can make ramen noodles by eating flour and using his nose hairs to cut it, something everyone who sees this finds utterly disgusting and refuses to eat it."}, {"type": "paragraph", "text": "Because of Wanze's disgusting methods of cooking, as well as his wasteful and disrespectful nature for food and cooking utensils, Sanji declares that Wanze is not fit to be a cook."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Ramen_Kenpo_Infobox.png/revision/latest/scale-to-width-down/230?cb=20130505211744", "caption": "Wanze in his Ramen Suit."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "Wanze was in the fourth car of the Sea Train going from Water 7 to Enies Lobby. Sanji, Sogeking, and Franky went into the car while invading the train, and Wanze offered them his special ramen. The trio passed up the ramen and attempted to go on ahead, but Wanze stated they would have to go through him first. Franky fired an explosive shot at Wanze, which grazed his hair and left him shocked, though Wanze's unusual expression and reaction angered the trio, and Sanji tried to kick him, which Wanze also dodged. Sanji confronted Wanze to allow Sogeking and Franky to go on, and Wanze used Ramen Beam, but they managed to dodge the noodle projectiles, and Sanji attacked Wanze again, allowing Sogeking and Franky to escape. However, Wanze laughed because Nero of CP9 was in the next car, and he ignited his roller skates before kicking at Sanji, who managed to dodge the attack and kick Wanze 12 times. Wanze and Sanji then exchanged insults before Wanze created a battle suit out of ramen. He gloated about this technique, angering Sanji due to his waste of food."}, {"type": "paragraph", "text": "Wanze managed to overpower Sanji by trapping him in his ramen fists, and Sanji tried attacking his unprotected head, but Wanze used Ramen Beam to stop him. Wanze stated that he had figured out Sanji's fighting style as he sent several waves of ramen down on him, but Sanji pulled out two knives and cut apart the ramen. Being able to use kitchen tools due to Wanze using food as his weapon, Sanji prepared to show Wanze his skills with them. Sanji cut off Wanze's ramen arms, and Wanze was intent on upholding his mission as he kicked at Sanji with ramen legs. However, Sanji cleanly cut the legs into little pieces, and Wanze used Ramen Beam once again in desperation, but Sanji cut the remainder of his suit into several pieces. He was not hurt due to Sanji not wanting to use weapons on him, and as Sanji put the knives back, he took the knives and threw them at Sanji. However, Sanji managed to dodge them and kicked Wanze several times in the face. Wanze questioned Sanji's motives for rescuing Nico Robin, but this only made Sanji angrier and caused him to use Parage Shoot on Wanze, changing his face into that of a bishōnen."}, {"type": "paragraph", "text": "Sanji stated that Wanze had committed the crimes of calling himself a chef, wasting food, and speaking ill of his friend. Intent on preventing Sanji from advancing through the train, Wanze pulled out a large poison-soaked knife and charged with it. However, Sanji repeatedly kicked him across the torso, sending him crashing into the fifth car where the CP9 agents were, leaving him lying unconscious in the aisle."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6c/Sanji_Fights_Wanze.png/revision/latest/scale-to-width-down/210?cb=20130724100811", "caption": "Sanji's knife handling vs. Wanze's Ramen Kenpo."}]}, {"title": "One Piece Film: Gold", "level": 3, "content": [{"type": "paragraph", "text": "Wanze was seen proposing to a woman on a ferris wheel in Gran Tesoro. However, a turtle car driven by Monkey D. Luffy, Usopp, and Chopper suddenly flew past their capsule, causing Wanze to panic and throw the flowers he had in his arms into his lover's face."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Wanze vs. Sanji", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Wanze was originally going to be a sexy female chef, but was changed to a male \"surfer dude\" with goggles. His third design resembled a stereotypical French chef, his 4th design was very close to Wanze's bishonen look, and his 5th design had ape-like features and goggles."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He makes a very brief appearance in Episode 303, where he is seen walking in the background and giving the audience a \"peace\" sign.", "elements": []}, {"text": "In Shonen Jump's 3rd Popularity Poll to determine the most popular One Piece characters, Wanze ranked at 75th. In the 4th and 5th, he was ranked at 122nd and 124th, respectively", "elements": []}, {"text": "Wanze is, so far, the only person to ever make Sanji use a weapon, not counting when Sanji aimed a flintlock at Robin.", "elements": []}, {"text": "\"Wanze\" in German means Heteroptera, a group of bugs.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Wanze_cameo_in_ep_303.png/revision/latest/scale-to-width-down/210?cb=20110720202932", "caption": "Wanze's cameo behind Usopp."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 38 Chapter 367 (p. 18) and Episode 257, Wanze debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 39 Chapter 368 (p. 18) and Episode 258, Wanze is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 211), Wanze's birthday is given.", "elements": []}, {"text": "↑ One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 517, two years pass in the storyline.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0400), Information about Wanze is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 39 Chapter 372, Sanji rearranges Wanze's face", "elements": []}, {"text": "↑  One Piece Manga — Vol. 39 Chapter 370, Wanze disables Sanji's legs", "elements": []}, {"text": "↑  One Piece Manga — Vol. 39 Chapter 369 (p. 6-16), Wanze starts to fight Sanji.", "elements": []}, {"text": "↑  One Piece Movie 13, Wanze is seen in Gran Tesoro.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 42, Oda shows his sketches of Wanze.", "elements": []}]}], "images": []}]}