{"sections": [{"title": "Spandine", "level": 1, "content": [{"type": "paragraph", "text": "Spandine is the father of Spandam and was CP9's chief 22 years ago during the Ohara Incident. He led the \"investigation\" in Ohara and was responsible for summoning the Buster Call. Presently, his political power within the World Government is weakening due to an unknown disease he has been stricken with."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Twenty-two years ago, during the Ohara Incident, Spandine had a square jaw, with a slight beard on it. His hair was combed neatly, but with the back flowing. He was wearing a black suit with a peach hued shirt underneath, and a striped coat over it."}, {"type": "paragraph", "text": "As of two years ago, his hair on the top of his head has turned gray from age, but the back and his beard remains black. The beard has also grown into a long and sharp goatee, and he had a small toothbrush mustache. His face has wrinkled from time as well. He changed his coat to a white one."}, {"type": "paragraph", "text": "Overall, he bears some resemblance to his son, Spandam."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He, like his son, is a coward. Spandine was proud of his rank and enjoyed stepping on the heads of \"criminals\". He is very self-centered and did not care about anything or anyone else other than himself, and he used his power to do whatever he wanted."}, {"type": "paragraph", "text": "He believes everything he does is right and is extremely loyal to the Five Elders. Spandine believed himself to be special, and nearly invincible, because he's a Government agent. He saw himself like a hero, but acted like a child. A very bossy and mean person, he intends to get his job done and always begged for promotions. He laughed when the time came to unleash the Buster Call on Ohara, and thought that activating the Buster Call would get him promoted."}, {"type": "paragraph", "text": "It should be noted, however, that he cared for his subordinates and considered what was best for them (unlike his son) as shown when he was shocked that the Buster Call had started before they got off and then ordering them to get off the island while stating that their lives were more important than the prisoner's (Nico Olvia)."}, {"type": "paragraph", "text": "Spandine is quite dramatic; when Nico Olvia shot him, he thought he was going to die. He begged his agents to report to the boss and give the position he held to his son, only to be told that the bullet went through his sleeve."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the former chief of CP9, Spandine had authority over some of the strongest agents in the World Government. In addition, shortly before the Ohara Incident, he was given authority by then Admiral Sengoku to invoke a Buster Call."}, {"type": "paragraph", "text": "Spandine does not seem to possess any abilities comparable to that of a CP9 agent. When Nico Olvia fired at his sleeve, he thought he was already defeated and was going to die. He does not fight and orders his colleagues to fight in his place."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Spandam", "level": 3, "content": [{"type": "paragraph", "text": "In spite of his egotistical behavior, Spandine seems to care for his son, Spandam, wanting him to succeed himself as chief of CP9 as far back as when he believed he was going to die at Ohara."}, {"type": "paragraph", "text": "Spandam, on the other hand, while speaking proudly of him in public, is now seeking to cure Spandine's disease solely to surpass Rob Lucci."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Twenty two years ago, Spandine was sent by the World Government to \"investigate\" Ohara Island. When the Marines tried to contact him, he would shrug it off and complain about coming over to the West Blue."}, {"type": "paragraph", "text": "After arriving at Ohara, he captured Nico Olvia and apprehended the Ohara Clan. Once he gathered all the scholars outside the Tree of Knowledge, he had his men search the tree and they found a poneglyph. Spandine also allowed Professor Clover to speak to the Five Elders through Den Den Mushi. Before Clover could reveal the name of the ancient kingdom, Spandine shot him on the Five Elders' orders. He then took out the Golden Den Den Mushi given to him by the then Admiral Sengoku and summoned the Buster Call. As Spandine was dragging Olvia away, a young girl named Nico Robin called out to her. He then learned that Robin could also decipher poneglyphs. When he was nearly hit by cannon fire, he decided to give up on Olvia and fled back to his ship. When Nico Robin attempted to board the evacuation ship, Spandine told the citizens not to let her onboard. He was then horrified to see the then Vice Admiral Sakazuki destroying the evacuation ship and killing everyone on it."}, {"type": "paragraph", "text": "After Nico Robin escaped, Spandine tried to pursue her, but his ship's rudder was frozen. He later reported to Sengoku and told him about the girl."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8c/OharaCP9.png/revision/latest/scale-to-width-down/210?cb=20130212210810", "caption": "Spandine and his agents arrive at Ohara."}]}, {"title": "CP9's Independent Report", "level": 3, "content": [{"type": "paragraph", "text": "Spandine's current standing in the Government is unknown, as command of CP9 had been passed to his son. After the events at Enies Lobby, Spandine met with his son in a hospital, plotting the assassination of the wayward CP9, who were after Spandam for trying to pin the blame on them for failing to capture Nico Robin."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the Japanese, German and English anime, he has the same voice actor as Spandam.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 392 (p. 8) and Episode 275, Spandine debuts.", "elements": []}, {"text": "↑ One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 517, two years pass in the storyline.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0428), Information about Spandine is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 94), Spandine's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 43 Chapter 419 (p. 8) and Episode 301, Spandine is revealed to be Spandam's father.", "elements": []}, {"text": "↑  One Piece Volume 777", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 394 and Episode 276, Spandine is shot by Olvia.", "elements": []}, {"text": "↑ One Piece Manga and Anime - Vol. 41 Chapter 395 and Episode 277, Spandine launches the Buster Call.", "elements": []}, {"text": "↑ One Piece Manga and Anime - Vol. 41 Chapter 392 and Episode 275, Spandine remarks about the Marines calling him.", "elements": []}, {"text": "↑ One Piece Manga and Anime - Vol. 41 Chapter 394 and Episode 276, Spandine recaptures Olvia.", "elements": []}]}], "images": []}]}