{"sections": [{"title": "Kaku", "level": 1, "content": [{"type": "paragraph", "text": "Kaku is first seen as one of the five foremen of Galley-La Company's Dock One and specializes in mechanics, diagnostics, and housecalls. It was Kaku who inspected the Going Merry and informed the Straw Hat Pirates that it was broken beyond repair."}, {"type": "paragraph", "text": "Later on, it was revealed that Kaku was a member of CP9, operating undercover in order to obtain the Pluton blueprints from Iceburg. Along with his colleagues, he has been dismissed from CP9 by Spandam. For unexplained reasons, he was later reinstated and promoted to CP-0."}, {"type": "paragraph", "text": "He was one of the major antagonists during the Water 7 and Enies Lobby Arcs."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kaku has big black eyes with 3 eyelashes on top of his eye, and a long nose similar to Usopp's, only rectangular in shape. Due to this, several characters, such as Luffy, Sanji and Zoro have mistaken him for Usopp."}, {"type": "paragraph", "text": "When he worked for the Galley-La Company, he wore a white cap, a high-collared orange shirt with blue sleeves, jeans and white sneakers."}, {"type": "paragraph", "text": "When he was revealed to be working for CP9, he wore a black cap, a black suit jacket with an orange handkerchief in the breast-pocket over a high-collared black shirt, pants and shoes."}, {"type": "paragraph", "text": "When invading Iceburg's mansion, he wore an over-sized skull mask with a black fez, and blue robes."}, {"type": "paragraph", "text": "As a child, Kaku had fluffy hair and a shorter nose (though still long by his age standards) and wore a cap backwards."}, {"type": "paragraph", "text": "After the timeskip, Kaku now wears a white variation of his black CP9 attire except for a larger hat instead of a black cap, and he also has a tie. His hair is also shown to have grown slightly longer."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Despite his role as a villain, Kaku is surprisingly honest, even to his enemies and even more so than Fukurou, though he does not seem to take insults well. As soon as his hybrid (giraffe/human) form was mocked, he sliced the Tower of Justice in half, in a rage of embarrassment."}, {"type": "paragraph", "text": "He also talks like an old man, as remarked by several characters, despite being only 23 years old. He uses the term \"washi\" (meaning I, though used mainly by elders), rather than ore (also meaning I, a masculine term used by young adults). In the FUNimation dub, he instead uses old fashion slang."}, {"type": "paragraph", "text": "After being revealed as one of the Water 7 CP9 agents, Kaku's personality becomes rather cold and dispassionate in contrast to his character on Water 7, where he was mainly seen laughing and smiling. Despite this, he often taunts his opponents during battle, ate a Devil Fruit for the fun of it, and exclaimed \"This is fun!\" during his life-and-death battle with Roronoa Zoro. He also seems to place a chance to fight over easy accomplishment of a mission; when Zoro and Sogeking were cuffed together, he wished to help them, so he would not be forced to share his target with Jabra. When neither agent had the key, both agreed that the prey was up for grabs."}, {"type": "paragraph", "text": "Kaku showed great sportsmanship after his defeat where he laughed at Zoro's comment of working in a zoo. He remarked \"too bad\" when Zoro passed Paulie's message of \"you're fired\", handed over his key without Zoro having to say a word. He also appeared to be the only one of the four members undercover in Water 7 who expressed some regret that he could not go back to the way he had been living for the last five years."}, {"type": "paragraph", "text": "Kaku has apparently not changed in disposition after the timeskip as demonstrated by his cold justification for Saint Charlos' attempts to enslave Shirahoshi. He states it is necessary for the sake of global peace and the lower ranking royal families should be wise not to oppose the Celestial Dragons."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kaku is a highly intelligent and cunning individual, being able to become a master shipwright within a 5-year period merely as a form of espionage and surveillance over his \"boss\" Iceburg. He is also skilled at developing or masquerading with personalities: ranging from fun-loving and almost childish to cold and ruthless (the former seems to be his true mentality, while the latter is a product of his assassin occupation)."}, {"type": "paragraph", "text": "Kaku can also function as a lie detector. He demonstrated the ability to tell whether something is true or not by feeling a person's wrist and then tell the truth by determining the speed of the person's pulse."}, {"type": "paragraph", "text": "He is a skilled and creative combatant, as despite having no previous experience with a Devil Fruit, he managed to hold off Roronoa Zoro largely by making up techniques on the spot, such as folding himself into a cube, using his nose as a battering ram, or using his neck as a Rankyaku medium."}], "images": []}, {"title": "Carpentry", "level": 3, "content": [{"type": "paragraph", "text": "Since Kaku worked as a shipwright during his mission in Water 7, this means he has gained masterful carpentry skills to the point that he is seen as one of Galley La's best shipwrights. Since he was an evaluator, he has great knowledge about ships. He evaluated the Going Merry and explained to them the reasons why it cannot be repaired. Like Rob Lucci, a testament of his skills is that he was able to achieve them in five years while others spent their whole life growing their skills, and that this was an undercover job. He was also able to recognize the real Pluton blueprints even when Franky was flipping through the pages quickly."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "From his training as a Rokushiki master, Kaku has immense physical power as the second strongest of CP9 next to Lucci. He has tremendous speed and agility, able to move incredibly fast and leap from buildings from amazing heights and distances without a scratch. His jumping abilities have earned him the nickname \"Mountain Wind\" (山風, Yamakaze) during his time in Galley-La Company."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Kaku is extremely proficient in all six forms of Rokushiki, but his expertise seems to be in Rankyaku, due to his many variations of the technique. With a Doriki of 2200, he is the second strongest assassin in his generation of CP9, which is said to be by far the strongest in the organization's history."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "He is also the most proficient swordsman of CP9, being able to use two giant chisels as makeshift swords when he clashed with Zoro in Iceburg's room. During his battle against Zoro in Enies Lobby, Kaku revealed that he is a user of Yontoryu (四刀流, Yontōryū, literally meaning \"Four Swords Style\") by using two Shirasaya katanas (or shikomizue) and both legs (with Rankyaku). He wielded both of his swords in reverse, similar to Strawberry and Doma. His overall swords skills are great enough to hold his own against Zoro, a powerful master of Santoryu, and even overwhelmed him on certain points during their fight."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "When he returned to Enies Lobby, Kaku ate the Ushi Ushi no Mi, Model: Giraffe, a Zoan-class Devil Fruit given by his boss, Spandam, which allows him to transform into a giraffe-human hybrid and a full giraffe. As Kaku ate the fruit just after the Straw Hat Pirates arrived to Enies Lobby, he did not have full control over it, as seen when he first showed its powers to Zoro where he accidentally transformed into full animal-form, when he intended to go animal/human-form. Jabra even laughed at the fact that he turned into a giraffe."}, {"type": "paragraph", "text": "When in animal or animal/human-form, he can make further use of Rankyaku, as he gains two additional legs. The power of his Rankyaku is also increased, as seen when he uses Rankyaku: Amanedachi to slice through the whole tower that he and Zoro are fighting in."}, {"type": "paragraph", "text": "His animal/human-form also has a square shaped nose and limbs, because of the shape of Kaku's nose while in human form. He can use this, together with his high speed to create a more powerful version of Shigan, the Bigan, by withdrawing his long neck into his body and then firing it at his opponent."}, {"type": "paragraph", "text": "Kaku's new form was very unusual to him, as he was testing the new form out on Zoro. All his transformations, including the \"Square Form\", used the same move, and even Zoro remarked that the move Kaku was using was extremely repetitive."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During his disguise as a shipwright, Kaku uses a variety of pavers/chisels as projectile weapons."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Kaku possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Five years before the current storyline, four members of the secret organization, CP9, took guises in the city of Water 7. As part of his mission, Kaku infiltrated the Galley-La Company by applying for a job as a shipwright in the attempt to retrieve the blueprints for Pluton from Iceburg, mayor and former pupil of legendary shipwright, Tom. Kaku became famous in the Galley-La Company, known notably for jumping off tall areas, clearing massive distances, earning the nickname: \"Mountain Wind\" (山風, Yamakaze). He became a respected member of the group as well. He gained the identity of a ship mechanic and diagnostic."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the pirate Mikazuki refused to pay for the repairs on his ship, the Galley-La workers beat up the Big Helmet Pirates."}, {"type": "paragraph", "text": "The Straw Hat Pirates returned to Dock 1, and Kaku stopped Monkey D. Luffy from entering the workers-only area. Luffy comically called him Usopp at first due to his long nose. Nami handed Kaku the letter from Kokoro, and he explained that Iceburg is the mayor of Water 7 and the president of the Galley-La Company. After being told the location of the Straw Hat Pirates' ship, Kaku decided he would check the ship's condition and jumped off a cliff. The Straw Hats watched in shock while Iceburg explained to them that Kaku always did that and explained he was a chief mechanic from Dock 1."}, {"type": "paragraph", "text": "Kaku leaped across the rooftops and made his way to the shore. As Sanji joked to himself about Nico Robin being able to fly, he looked up and spotted Kaku passing overhead and mistook him for Usopp. Kaku boarded the Going Merry and began evaluating the damage. Woken from his nap, Roronoa Zoro also mistook Kaku for Usopp. However, after thinking about it, he realized his mistake and demanded to know who Kaku was."}, {"type": "paragraph", "text": "With his inspection done, Kaku returned to Dock 1. He confirmed that the ship was irreparable due to a broken keel and would have no chance in reaching the next island. Luffy offered more money, but Kaku explained that money was not the issue and expressed surprise that they were able to make it to Water 7. Kaku sat and listened as the others tried to convince Luffy. When Luffy and Nami discovered that their money was gone, Lulu recalled seeing Kaku with the Franky Family, but Kaku denied it."}, {"type": "paragraph", "text": "The morning after Iceburg was shot, Kaku and Lulu discussed the situation and determined that it was not a robbery and may have been the government. While they sat outside Iceburg's room, Lulu explained to Kaku that the doors did not appear to have been opened and the only clue was a common mask. Kaku, Lulu, and Paulie were happy to hear that Iceburg had awoken, and joined the others at the mayor's bedside. Iceburg then revealed that his two attackers were a big man wearing a mask and Nico Robin. Lucci revealed that Robin came to the island with the Straw Hats, so Kaku concluded that they were behind the shooting. Tilestone then barged into the room and announced that Luffy and Franky were fighting in Dock 1. The workers left and interrupted the fight."}, {"type": "paragraph", "text": "When Franky complained about the interruption, Kaku pointed out that they were fighting in Galley-La's work space. As the fight continued, Franky fired his Weapons Left, and Kaku back flipped over him. While Franky was distracted, Tilestone knocked him up into the air, where Kaku caught him and threw him to the ground. After Paulie told Luffy that Iceburg identified Robin as the shooter, Kaku threw a chisel at Luffy, cutting his cheek. Realizing that their pistols would not work, the Galley-La workers attacked instead with cannons and saws. Kaku pinned Luffy to a wall with chisels and Tilestone blasted the pirate with a cannon. Angry that the workers were stealing his prey, Franky used Coup de Vent to blow away them away and to destroy the shipyard. Luffy and Franky escaped in the destruction, so the workers decided to prepare for the Aqua Laguna and the Straw Hats."}, {"type": "paragraph", "text": "In case of another attack, Galley-La employees crowded their headquarters while Tilestone, Lucci, Lulu, Kaku, and Paulie personally guarded Iceburg's door. During the night, Kaku questioned why Iceburg wanted to speak with Paulie alone, and the others moved away from the door to give them privacy. Afterwards Paulie left to fulfill another task, leaving the other four to guard the door. Later when a bomb went off at the entrance, Tilestone and Lulu rushed off, and Kaku yelled for them to stop but then sat back down exasperated."}, {"type": "paragraph", "text": "After donning costumes and setting up doubles, Kaku and Lucci followed Paulie to Iceburg's office and asked what was hidden in the floor. They revealed that they are from CP-9, and Kaku watched as Lucci beat up Paulie. They were surprised when Paulie revealed that the blueprints are fake, but were interrupted when Luffy crashed through the wall. Kaku aimed a kick at Luffy, cracking the wall, and pinned Paulie to the floor, after Lucci pinned Luffy. The masked pair then returned to Iceburg's bedroom, where the five agents removed their masks and revealed their true identities to Iceburg."}, {"type": "paragraph", "text": "With Iceburg cornered, they interrogated him and realized that the blueprints were not with him, but they deduced that they were with Franky by reading Iceburg's pulse. They prepared to kill Iceburg, but Luffy, Paulie, Zoro, Nami, and Tony Tony Chopper arrived to confront them. During the ensuing clash, Zoro asked Kaku if his diagnosis on the Going Merry was a lie. Kaku reiterated that although his Water 7 guise was false, his analysis was genuine and the ship could not sail. Kaku and his fellow agents displayed their fighting techniques and overpowered their opponents. Having decided to leave no evidence of their attack and their identities, they set Iceburg's mansion on fire, hoping to kill him in it, and left the Straw Hats to take the fall."}, {"type": "paragraph", "text": "As the agents made their way through the city in search of Franky, Kaku spotted the Franky Family who were announcing that they had kidnapped Usopp. The agents forced them to reveal Franky's location and headed there. After Franky was subdued, Spandam ordered CP9 to bring him in. As they left, Usopp tried to stop them but faltered before Lucci's gaze, and recognizing him as a Straw Hat, Kaku subdued him and had Kalifa tie him up. Kaku then sent the Going Merry into the midst of the Aqua Laguna and to its apparent demise. With Franky and Usopp captive, they set out for Enies Lobby on the Puffing Tom."}, {"type": "paragraph", "text": "On the way to Enies Lobby, CP9 encountered some complications when Sanji stowed away on the Puffing Tom and initiated his own rescue operation. He managed to free Franky and Usopp and they attempted to retrieve Robin. Despite Sanji's best efforts, CP9 prevented Robin's escape and recaptured Franky."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Kaku_Evaluating_the_Merry.png/revision/latest/scale-to-width-down/240?cb=20130510173926", "caption": "Kaku evaluates the Going Merry."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Kaku_Gives_Luffy_And_Nami_Sad_News.png/revision/latest/scale-to-width-down/250?cb=20130927193837", "caption": "Kaku gives Luffy and Nami sad news."}]}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Eventually, the CP9 agents arrived at Enies Lobby with Robin and Franky. At the Tower of Justice, they met up with the other members that they had not seen in years and their boss, Spandam. Fukurou then tested the others' Doriki and revealed that Kaku had a level of 2200. He and Kalifa were later given Devil Fruits by Spandam and under the urging of Lucci, they proceeded with eating them."}, {"type": "paragraph", "text": "When they heard that the Straw Hats, the Franky Family, and their Galley-La allies started attacking Enies Lobby, the CP9 agents (except Blueno) stood at the balcony and saw Luffy standing on the roof of the courthouse, having emerged victorious from his fight with Blueno. After the rest of the Straw Hats arrived at Luffy's location, Franky revealed that he had been carrying the Pluton blueprints all along and the CP9 agents could only watch as he burned the blueprints in Spandam's face. After Spandam pushed Franky off the balcony, the CP9 agents witnessed Franky and the Straw Hats entering the Tower of Justice with some assistance."}, {"type": "paragraph", "text": "After the Straw Hats split to find the key to Robin's Seastone handcuffs, Zoro came across Kaku and the two quickly battled each other with Kaku revealing his own sword-fighting style. Later in the fight, Kaku ended up causing the floor to cave in by transforming into his full giraffe form instead of his half-giraffe form. The two fell into the room where Sogeking and Jabra were fighting, and were involved in their fight as well. Jabra started to break out in uncontrollable laughter after seeing Kaku's full giraffe form. Kaku managed to transform into his half-giraffe form, but this only made Jabra laugh more hysterically and made Sogeking accidentally handcuff himself and Zoro together."}, {"type": "paragraph", "text": "All this mocking eventually got to Kaku and in his anger, he used an attack that sliced the tower in half where it remained lopsided. After a bit of arguing with Jabra on whose prey was whose, they offered to help separate Sogeking and Zoro from their handcuffs by using their keys. However, neither had the appropriate key and the two agreed to work together to defeat the pirates and escape the oncoming Buster Call, which was accidentally initiated by Spandam. Zoro managed to hold them at bay by using Usopp as a sword (moreover having Usopp hold one of his swords while he used Usopp like a hilt) until Nami freed them of their handcuffs."}, {"type": "paragraph", "text": "As Zoro and Kaku continued their one-on-one match, it seemed that Kaku had the upper hand thanks to improvising with his Devil Fruit and his swordplay until he was defeated by Zoro activating a new power called Asura. Zoro then passed on a message from Paulie to CP9, telling Kaku that he and the rest of CP9 were fired. Kaku expressed regret that he could no longer be a shipwright and that he genuinely enjoyed the profession. Zoro jokingly responded that he would always have the zoo. He laughed and gave Zoro his key before passing out. Kaku's key was the final key to be obtained by the Straw Hats and also the key to Robin's handcuffs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Zoro_vs._Human_Kaku.png/revision/latest/scale-to-width-down/250?cb=20130509221649", "caption": "Kaku faces off against Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/62/Zoro_Defeating_Kaku_with_Asura.png/revision/latest/scale-to-width-down/240?cb=20130827011759", "caption": "Kaku is defeated by Zoro's Asura."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "CP9's Independent Report", "level": 4, "content": [{"type": "paragraph", "text": "Kaku and the other CP9 agents survived the destruction of Enies Lobby by hiding with Blueno's Air Door. When World Government agents arrived, the CP9 escaped on the Sea Train tracks, with Jabra carrying Kaku due to his severe injuries."}, {"type": "paragraph", "text": "In St. Poplar, they entertained children to raise money Lucci's medical bills. In his full giraffe form, Kaku acted as a \"giraffe slide.\" While waiting for Lucci to recover from treatment, Kaku sat at a café with Fukurouu, Blueno, and Jabra."}, {"type": "paragraph", "text": "After Lucci fully recovered and was discharged, the group went bowling and Kaku kept score. However, their bowling match was interrupted when the Candy Pirates ransacked the island, so CP9 quickly dispatched the pirates on their ship. However, since Lucci crushed the skull of the captain, the crowd was horrified and the CP9 realized they could not stay in St. Poplar. They sailed off to their homeland, Guanhao, where they watched a new generation of CP9 being trained."}, {"type": "paragraph", "text": "Captain Very Good arrived to capture them, but they refused to let him disturb their old home. As the CP9 battled, and eventually defeated the Marine troops led by Very Good, Lucci contacted a physically crippled Spandam using a Den Den Mushi, and promised to come for him very soon. With that CP9 began their aim to eliminate their former director by leaving Guanhao and setting sail."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8b/Kaku_and_Fukurou_Earning_Money_for_Lucci.png/revision/latest/scale-to-width-down/250?cb=20130124164712", "caption": "Kaku acts as a slide to earn money."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Some time during the timeskip, Kaku was reinstated as a member of Cipher Pol."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "When CP-0 came to Dressrosa a second time, Rob Lucci talked to Kaku who was in the underground of the island, investigating the Revolutionary Army exploits."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As Charlos tried to enslave Shirahoshi, Sai and Leo tried to stop him, only to be thrown back by Lucci. Kaku was there along with several other CP-0 members, explaining the rights of the World Nobles."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Galley La vs. Big Helmet Pirates", "elements": []}, {"text": "Kaku, Rob Lucci, Tilestone, Peepley Lulu, and Paulie vs. Monkey D. Luffy and Franky", "elements": []}, {"text": "Kaku vs. Roronoa Zoro (Galley La Headquarters) ", "elements": []}, {"text": "Kaku and Blueno vs. Sanji  ", "elements": []}, {"text": "Kaku and Jabra vs. Zoro and Usopp", "elements": []}, {"text": "Kaku vs. Zoro (Tower of Justice) ", "elements": []}, {"text": "CP9 vs. Candy Pirates", "elements": []}, {"text": "CP9 vs. Very Good's crew", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In Color Walk 4, an early design of Kaku had him with a normal nose rather than his long rectangular nose."}, {"type": "paragraph", "text": "Also, in One Piece Green: Secret Pieces, it is revealed that he was supposed to fight Sanji instead of Zoro and partly Sogeking."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Kaku's name most likely comes from the Japanese word \"kaku\" (角, kaku, literally meaning \"angle\", but also means \"horn\" if read as \"tsuno\"), a reference to his rectangular nose along with its length."}, {"type": "paragraph", "text": "Although Kaku is 23 years old, he speaks as if he were much older, as he adds the suffix \"-ja\" to most of his sentences. \"-ja\" is commonly used amongst old men. He also uses \"washi\", a term of addressing oneself used by old men."}, {"type": "paragraph", "text": "In the FUNimation dub, to match the \"old man\" style of talking, he uses old fashioned expressions such as \"two shakes of a lamb's tail\" or words like \"skedaddle\"."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Adventure", "elements": []}, {"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Zoro giving Kaku Paulie's \"you're fired\" message is a pun on Kaku's giraffe theme; \"kubi\" (首, kubi), the Japanese word used for \"fired\", can also mean \"neck\".", "elements": []}, {"text": "Kaku's birthday is August 7 because in Japanese, 8 can be pronounced as ha, and 7 can be pronounced as na. Put together, these make hana, the Japanese word for \"nose\" in reference to his long, rectangular nose.", "elements": []}, {"text": "Kaku ranked at 70th place in the sixth Japanese popularity contest.", "elements": []}, {"text": "Kaku's key was the one that worked on Robin's handcuffs.", "elements": []}, {"text": "When CP-0 came to Dressrosa a second time, Rob Lucci talked to a man with Kaku's speech patterns. In the anime, the CP-0 member was directly shown to be Kaku, although this revelation is non-canon. During the Levely Arc Kaku was revealed to actually be part of CP-0.", "elements": []}]}], "images": []}]}