{"sections": [{"title": "Bellamy", "level": 1, "content": [{"type": "paragraph", "text": "Bellamy the Hyena is the former captain of the Bellamy Pirates, and a former member of the Donquixote Pirates. After the Dressrosa Arc, he retired from piracy and became a dyer."}, {"type": "paragraph", "text": "When he made his debut, he had a bounty of 55,000,000  and was known as the \"Big-Time Rookie\" within Mock Town. After the timeskip, his bounty has increased to 195,000,000."}, {"type": "paragraph", "text": "He is the main antagonist of the Jaya Arc. Bellamy also is one of the central characters from The Stories of the Self-Proclaimed Straw Hat Grand Fleet Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bellamy is a tall man with tan skin and short, unkempt blond hair. During the Jaya Arc, he wore white pants, a green sash with markings, and a pink sleeveless shirt with a navy blue pirate captain's coat over it. The coat tended to fall off whenever Bellamy used his spring-based jumping."}, {"type": "paragraph", "text": "He has a scar above his right eye and tattoos of eye-like designs on his arms. He has a trademark grin and sometimes sticks out his tongue in a taunting manner."}, {"type": "paragraph", "text": "After the timeskip, he grew in size dramatically. He now wears a pair of black sunglasses and bears two new scars, one across each side of his face, possibly from either his humiliating defeat by Luffy or from Doflamingo's punishment, or both. He has discarded his captain's coat and now wears a short sleeved shirt with his old jolly roger on the back (now painted over with a cross), which is left open to display Doflamingo's mark tattooed on his chest."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Before he visited an unnamed sky island, Bellamy was characterized as violent and conceited. He was very arrogant and highly confident in his own powers. He would only attack foes he thought he could win against and this attitude led to his eventual defeat at Monkey D. Luffy's hands; Bellamy thought he was weak, not knowing that he had recently defeated a Shichibukai, Crocodile, and obtained a new bounty of 100,000,000, before moving into Jaya. He loved to have an audience to witness his feats."}, {"type": "paragraph", "text": "He was ruthless, as he attacked Roshio over a trivial matter and laughed at other people's misfortune. Like Donquixote Doflamingo, he heavily believed in the \"New Age\" and thinks it will soon come after what he calls the \"Age of Dreams\", the current era in which people dream of finding One Piece and becoming the Pirate King. His philosophy of the \"New Age\" led him to taunt and laugh at anyone with such grand dreams as Luffy's; little did Bellamy know that Doflamingo himself aspired to become Pirate King. Indeed, his cruelty is well known even in the New World, after the timeskip, even though he changed a lot."}, {"type": "paragraph", "text": "Bellamy's arrogance tends to heavily influence his opinions of what the world presents before him; this became evident when he dismissed the possibility that there was someone stronger than him during his stay at Jaya when the local drunk presented him and his crew with Luffy and Zoro's new bounties. Like the rest of his crew, Bellamy misinterprets that a bounty represents a person's fighting level, causing him to believe he is fearsome despite his bounty being only a little higher than average based on Grand Line standards. His crew does nothing to discourage that belief and even goes as far as to give him the nickname \"Big-Time Rookie.\" As a result, he seems to consider himself destined for greatness."}, {"type": "paragraph", "text": "Bellamy earned his nickname from his trademark grin, constant laughter, and reputation for scavenging riches from other pirates, much like a hyena scavenges its food. He and Sarquiss usually hunt down pirates who are weaker than them, beat them mercilessly, let the rest of the crew \"pick up the trash,\" and then rob them of their treasures while mocking them."}, {"type": "paragraph", "text": "After the two-year timeskip, Bellamy has lost much of his arrogance and gained a cold, calm demeanor. He no longer mocks people, as his only ambition is to become Doflamingo's right-hand man. However, he still appears to relish battle, as seen in his fights with Tank Lepanto and with Abdullah and Jeet, wherein the commentator noted his viciousness. In addition, he has become much more observant, as he was able to recognize Luffy through his disguise and promise not to laugh at him anymore. He also has a strong sense of honor, as he was disgusted by the fact that Tank Lepanto had accepted a bribe, and after the match he told Luffy that by cheering him on he had crushed his pride. More of this reformed personality was shown when he showed reluctance to fulfill Doflamingo's order to kill Luffy."}, {"type": "paragraph", "text": "Bellamy is immensely loyal to Doflamingo, a man he has admired and idolized since his youth. He briefly refused to believe that Doflamingo had ordered Dellinger to finish him off in case he failed, and even after realizing it was true, he refused to betray the man he respected. After confronting Doflamingo and being brutally beaten, Bellamy lost his will to live and begged to be killed. Even after Doflamingo told Bellamy just how little he thought of him and forced him to fight Luffy, he did not let go of his loyalty, choosing to attack Luffy even after Doflamingo's control was lifted. Though he realized that his admiration was misplaced and considered himself a fool, Bellamy held on to his principles. Forcing a smile, he claimed that he would keep seeking Doflamingo's approval by taking Luffy down with him but winced when Luffy pointed out that Doflamingo probably knew that Bellamy would try to fight him to the death. After Doflamingo's downfall, Bellamy seems to forgo his loyalty towards Doflamingo, given Bellamy's newfound friendship with Luffy."}, {"type": "paragraph", "text": "Having finally foregone his loyalty to Doflamingo, Bellamy chose to change his way and quit piracy to find a new life as an apprentice dyer."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Bellamy_Forcing_a_Smile.png/revision/latest/scale-to-width-down/180?cb=20161221101801", "caption": "Bellamy trying to force a smile."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Like their captain, the Bellamy Pirates were attempting to usher in a \"New Age\" wherein pirates wouldn't have to search for dream treasures like the One Piece and could instead focus on the treasures present all around them, hoarding them from weaker pirates. As a captain, Bellamy was looking for strong pirates to join his cause. All of his crew members admired him and called him a big-time rookie. "}, {"type": "paragraph", "text": "Sarquiss was proud of his captain and confident in his abilities. Even after Bellamy's defeat, Sarquiss still believed Luffy's victory was by sheer luck, stubbornly refusing to accept that someone could be stronger than his captain."}, {"type": "paragraph", "text": "When Bellamy was defeated, most of the new recruits to his crew fled. The only ones that remained were the primary crew members, not because they were angry after seeing their captain defeated, but because they were appalled at the turn of events. Even Sarquiss, the second-in-command, was in such a state of panic that he could not think straight upon his captain's downfall. When the top two were forced by Doflamingo to fight each other, the rest of the crew was too overwhelmed by fear and confusion to try to stop them."}, {"type": "paragraph", "text": "During his discussion with Luffy at Dressrosa, Bellamy states he lost his crew during his journey to Sky Island."}], "images": []}, {"title": "Donquixote Pirates", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "As revealed during the Dressrosa Arc, Bellamy has greatly admired Donquixote Doflamingo since he was a kid."}, {"type": "paragraph", "text": "Bellamy and his crew made an alliance with Donquixote Doflamingo. Having allied themselves under the Donquixote Pirates, the Bellamy Pirates used to bear two jolly rogers: their own and Doflamingo's. He had adopted Doflamingo's ideals. However, after hearing of Bellamy's defeat, Donquixote Doflamingo himself came to Mock Town and forced Sarquiss to attack Bellamy, claiming that he dishonored his flag. As he forced Sarquiss to deal a finishing blow to Bellamy, he claimed that he had no use for the Bellamy Pirates, thereby dismissing them."}, {"type": "paragraph", "text": "After the timeskip, Bellamy was given another chance by Doflamingo for bringing him a gold pillar from Skypiea. He was given a chance to participate in the Corrida Colosseum, and his prize for winning the tournament would be a position as one of the leaders of the Donquixote Pirates. Unfortunately for Bellamy, his admiration for Doflamingo was misplaced. After Bellamy lost the tournament, Doflamingo seemed to have given him one more opportunity for an executive position but actually ordered Dellinger to dispose of him like garbage. Though heartbroken by this betrayal, Bellamy claimed that he still respected Doflamingo and would never turn against him."}, {"type": "paragraph", "text": "However, after confronting Doflamingo during his \"Birdcage\" game, Bellamy was horrified to hear Doflamingo's desire to destroy the world before being brutally assaulted by him, an attack to which he could only respond with tears. Doflamingo mocked Bellamy for being weak, cruelly used him as a human shield against Luffy, and finally forced him to attack his new friend against his will. Bellamy became shocked upon learning that Doflamingo was a World Noble, shot his own father and attempt to regain his status by bringing his head back to Mary Geoise, and plans to destroy the world that the World Nobles own. Regardless of all of this, even knowing that he put his faith in the wrong man, Bellamy refused to abandon his loyalty to Doflamingo just because he didn't get the answers he sought."}, {"type": "paragraph", "text": "After Doflamingo and his crew's downfall, Bellamy seems to forgo his loyalty towards him."}], "images": []}, {"title": "Dellinger", "level": 4, "content": [{"type": "paragraph", "text": "Bellamy appears to be familiar with the officer, as he was annoyed by his presence while trying to assassinate Luffy. After revealing that his order was to kill Bellamy, Dellinger severely wounded him, but he was stopped by Bartolomeo before he could finish the job. After being called away by Diamante, Dellinger swore to Bellamy and Bartolomeo that they wouldn't leave the island alive."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Luffy, Zoro, and Nami arrived in the town where Bellamy was, searching for information about the legendary Sky Island. Bellamy wanted to see if Luffy was worthy of joining him, but as soon as Nami asked for information on the sky island, he rejected that notion and instead taunted them along with the rest of his crew. However, even when the taunts escalated to violence, Luffy and Zoro chose not to fight back. After they left, Bellamy decided they were too weak to be worth following."}, {"type": "paragraph", "text": "Bellamy heard that Mont Blanc Cricket had uncovered some gold and subsequently decided to take it from him. He and his crew thoroughly assaulted the Saruyama Alliance and took the gold back to Mock Town. Seeking revenge, Luffy went back to fight Bellamy and took him out in one punch. The pirates that Bellamy's crew managed to recruit ran off in terror, leaving the main Bellamy Pirates with their unconscious captain, utterly shocked at Bellamy's defeat and unable take action against the perpetrator. This defeat was the reason Doflamingo decided to punish Bellamy."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Back at Mock Town, Bellamy held little respect for Luffy, openly mocking his beliefs in regards to legends and dreams. Later on in a fight, Bellamy continued with his mockery and it angered Luffy, who soon gave him a well-deserved punch. After his humiliating defeat at the hands of Luffy, however, Bellamy changed and became more open-minded to the idea of following one's dream."}, {"type": "paragraph", "text": "At the Corrida Colosseum, Bellamy recognized Luffy in spite of his disguise. Bellamy showed more respect for Luffy than he had on Jaya, having been to Sky Island himself at this point. He said that he held no grudges against Luffy and vowed to never laugh at him again. Later, when it looked as though Bellamy was going to lose to Bartolomeo, Luffy even cheered Bellamy on. After losing the first round, Bellamy still spoke to Luffy on friendly terms. He seemed unhappy and reluctant when Doflamingo ordered him to kill Luffy."}, {"type": "paragraph", "text": "After Doflamingo's ruthless assault on Bellamy, Luffy showed compassion toward the beaten and heart-broken man and refused to hurt him when Doflamingo forced him to fight Luffy. When Luffy called Bellamy his friend, Bellamy couldn't help bursting into tears. Upon being freed from Doflamingo's manipulation, Bellamy forced Luffy to fight him, refusing to betray his principles. Even when Luffy refused to fight back, Bellamy showed no signs of relenting and kept pummeling him. Eventually, Luffy was forced to fight back and with some hesitation defeated Bellamy with a single blow. In his thoughts, Bellamy thanked Luffy for calling him a friend while Luffy furiously yelled Doflamingo's name."}, {"type": "paragraph", "text": "Bellamy's thoughts during the fight showed that Luffy was the one other person besides Doflamingo that Bellamy looked up to."}, {"type": "paragraph", "text": "After Doflamingo was defeated, Bellamy parted ways with Luffy by refusing to be his subordinate like those who joined the Straw Hat Grand Fleet but not before stating he would keep a piece of the Vivre Card just in case he got into trouble."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Saruyama Alliance", "level": 4, "content": [{"type": "paragraph", "text": "While the Straw Hats were in Jaya's forest looking for a South Bird, the Bellamy Pirates attacked, stealing the gold artifacts that acted as their only proof of the golden city's existence. Angered, Luffy defeated Bellamy and returned the gold to Cricket before setting off for the sky island."}], "images": []}, {"title": "Bartolomeo", "level": 4, "content": [{"type": "paragraph", "text": "Although Bellamy fought against Bartolomeo during Block B, he was later saved by the rookie, who stopped Dellinger from killing him. Bellamy angrily stated that his life was a waste and tearfully asked Bartolomeo why he would save him from death. Bartolomeo replied that by fighting together, they had become friends, and he wouldn't leave a friend to die."}], "images": []}, {"title": "Trafalgar Law", "level": 4, "content": [{"type": "paragraph", "text": "Despite Bellamy only talking with Law once, they appear to be civil with each other. Bellamy questioned why Law would save him and Law responded it was because Luffy considered him a friend."}], "images": []}, {"title": "Dressrosa", "level": 4, "content": [{"type": "paragraph", "text": "Because he was \"personally handpicked\" by Doflamingo and a steadfast loyalist to him, Bellamy was very popular in Dressrosa where Doflamingo himself was the well-beloved king. The people admired Bellamy, calling him the \"Bullet of Dressrosa.\" He was a crowd favorite in the tournament and the most acclaimed by the public in Block B. The injuries he received from the unpopular Bartolomeo made the crowd worry, and upon being defeated by Elizabello II, the crowd cried out. Even the commentator of the Corrida Colosseum, Gatz, was a fan of Bellamy and saw him as a hero of Dressrosa."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Prior to the timeskip, Bellamy appeared to be an average fighter without the aid of his Bane Bane no Mi, upon which he heavily depended. Bellamy easily defeated Shoujou, who had a bounty of 36,000,000, and Roshio, who had a bounty of 42,000,000; both fights were won thanks to his Bane Bane no Mi. However, he had enough talent to receive a bounty of 55,000,000, for which he was known as \"The Big-Time Rookie.\""}, {"type": "paragraph", "text": "Before becoming a full-time member of the Donquixote Pirates, Bellamy was not particularly intelligent, mainly relying on directions from Doflamingo. He typically used underhanded tactics, deception, intimidation of civilians, and battle handicaps to promote his infamy and get his way. Much like the Shichibukai that he aligned with, the Bellamy Pirates took great pride in Bellamy's strength and felt that if he was strong enough to do something, there was no reason not to do it. This all changed after the timeskip."}, {"type": "paragraph", "text": "After the timeskip, his overall abilities have improved. After losing to Luffy, he began to improve by surviving Sky Island and returning with a large golden pillar, which he presented to Doflamingo. Furthermore, he was able to survive in the New World, with his bounty rising to 195,000,000, more than triple his first known bounty. All of this gave him a second chance in the Donquixote Pirates. Intellectually, he became far more perceptive, as he instantly recognized Luffy through his heavy disguise, a feat most of the other contestants within the room could not manage even when Luffy inadvertently blurted out his identity. He also managed to deduce Bartolomeo's Bari Bari no Mi's weakness after a few of his direct attacks were deflected. He was ultimately knocked out by King Elizabello's \"King Punch\" before he could exploit this weakness, though he regained consciousness soon after the match ended and was seen talking to Luffy."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Despite his preference for his spring-based strength, he had enough brute strength to destroy a bar and easily toss a full-grown man clean out of a window. However, he lacked endurance and was knocked out by a single punch from Luffy. When Doflamingo appeared in order to punish the crew for dishonoring his flag, Bellamy was completely powerless to stop him as he forced Sarquiss to attack Bellamy with his human puppeteer abilities."}, {"type": "paragraph", "text": "Sometime within the two years after the Battle of Marineford, Bellamy's strength increased tremendously. He was strong enough to crush the face of a fellow participant with his bare hands, and even the other contestants of his block had forsaken the thought of ganging up on him, as they considered him the most potent threat in the group. He also managed to take out Abdullah and Jeet simultaneously even though they were dangerous enough to terrorize most of their opponents in Block B. His endurance has also increased exponentially, having taken damage from his fight with Bartolomeo, Elizabello II's King Punch (though he did briefly pass out from this), and Dellinger and Doflamingo's assaults all in the same day before finally falling unconscious from a Bushoshoku Haki-hardened Gear Second punch from Luffy."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Bellamy has eaten the Bane Bane no Mi, a Paramecia-type Devil Fruit that grants him the ability to turn his body parts into a spring, allowing him to jump with great speed, height and force."}, {"type": "paragraph", "text": "Before the timeskip, Bellamy relied on his Devil Fruit power in battle to the point where he felt that nobody could defeat it, and his main style of combat was to transform his legs into springs and launch himself at high speed, utilizing the momentum to augment his punches and disorienting his opponents with the excessive boi-oi-oing sounds."}, {"type": "paragraph", "text": "After the timeskip, he used new methods to harness his fruit's power, such as compressing his wrist into a spring and then releasing it into a powerful punch, similar to Luffy's Gomu Gomu no Pistol. He also seemed to be less reliant on its power alone, now skillfully using it for evasive purposes, enhancing his jumps to avoid attacks, or getting close enough to use his own hand-to-hand skills effectively."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Bane_Bane_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20160913222919", "caption": "Bellamy turning his legs into springs."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was seen using a knife and pistol to brutalize Roshio. Bellamy also used a pair of knives to stab both Abdullah and Jeet in their feet, pinning them to the ground and immobilizing them, in order to execute further attacks."}, {"type": "paragraph", "text": "When Bellamy was heavily injured and controlled by Doflamingo, he was seen wielding a pair of rapier-like swords."}], "images": []}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "During his battle with Luffy in the Dressrosa Royal Palace, Bellamy demonstrated the ability to use Busoshoku Haki to harden his fist. By combining this with the force gained from Spring Hopper, Bellamy was able to punch Luffy with enough power to break through the latter's own Haki-hardened abs, causing him to cough up blood."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/36/Bellamy_Punches_Luffy_with_Haki.png/revision/latest/scale-to-width-down/210?cb=20160913213514", "caption": "Bellamy imbues his fist with Busoshoku Haki."}]}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Bellamy possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Bellamy and his crew members were all born in North Blue, specifically in a peaceful town known as Notice. During their childhood, they heard the fairy tale Liar Noland and were often told by adults that if they lied a lot, they'd be executed like Noland."}, {"type": "paragraph", "text": "Sometime in his youth, Bellamy formed the Bellamy Pirates and set out to the sea, having found his hometown \"boring.\" The crew approached the future Shichibukai Donquixote Doflamingo and, after stating their admiration towards the man, were allowed to use the Donquixote Family's symbol; however, Doflamingo informed them that defeat would not be tolerated. Bellamy swore that he would not lose to anyone."}, {"type": "paragraph", "text": "At some point, Bellamy earned a bounty of 55,000,000, for which he was known as \"The Big-Time Rookie.\"  "}, {"type": "paragraph", "text": "Eventually, Bellamy and his crew landed on the island of Jaya, looking for other powerful pirates to recruit for the \"New Age.\" They reserved a tropical hotel entirely for themselves."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the island, another pirate, \"Roshio the Executioner\", had a conflict with Bellamy in a bar. After Roshio fairly won against Bellamy in a game of poker, Bellamy falsely accused him of cheating and stabbed his hand. After asking Sarquiss to confirm that he saw Roshio cheating, Bellamy shot Roshio in the leg and hit him with a bottle of alcohol. With Roshio covered in alcohol, Sarquiss threw a lit match at him and set him ablaze. The ignition blasted Roshio out the window, after which Bellamy finished him off with his Spring Hopper technique."}, {"type": "paragraph", "text": "Later on the same day, Sarquiss informed Bellamy of the 30,000,000 pirate Straw Hat Luffy's presence on the island. Soon afterwards, Bellamy entered the tavern where Luffy, Zoro and Nami were and asked Luffy whether he was the man he had heard of. Luffy commented about how he had met a lot of huge people that day while Bellamy sat beside him and told the storekeeper to get an expensive drink for him and something Luffy likes for Luffy. Meanwhile, Sarquiss and the other Bellamy Pirates barged in and attacked some people to get their seats. After Bellamy encouraged Luffy to drink up, Luffy thanked him and downed it all in one gulp. Spontaneously, Bellamy grabbed Luffy's head and smashed him against the bar counter."}, {"type": "paragraph", "text": "Bellamy's crew laughed and the onlookers were shocked. Zoro put a sword up to Bellamy's neck, furious. Nami told Zoro to stop, since they had not gained any information in the town yet. Luffy got up and told Bellamy to get ready. The others cheered in anticipation of the fight. Bellamy laughed and said that this was a test, not a fight."}, {"type": "paragraph", "text": "Nami told Luffy to wait and asked the storekeeper about the Sky Island, to everyone's surprise and the Straw Hats' confusion. The crew was immediately mocked just for mentioning the island, especially by Bellamy. He told the Straw Hat crew that legends and dreams like the sky island were foolish and that pirates should not be concerned with such nonsense. This comment angered Luffy, but he decided that a fight over dreams would be meaningless, and, reluctantly, he and Zoro refused to engage in battle. This prompted Bellamy and his crew to beat up and humiliate the two. Though Bellamy and his crew gave Luffy and Zoro a mild thrashing, the Straw Hats maintained their pacifistic disposition until Nami was forced to drag the two out of the bar."}, {"type": "paragraph", "text": "Later on, Luffy and crew met up with Mont Blanc Cricket, who, much like Luffy, believed strongly in the legend of the sky island. During the night, as the Straw Hats were on a search in the nearby jungle for a bird that would help them reach the sky island, Bellamy and his crew arrived at Cricket's home. Bellamy and his crew attacked and severely wounded Cricket and his friends."}, {"type": "paragraph", "text": "Bellamy admired a golden statue of the South Bird. Mont Blanc Cricket, who was bleeding on the ground, stated that they had no right to take the gold. Sarquiss questioned him and attempted to attack him but was blocked by Masira, who took the blow to protect Cricket. Sarquiss laughed and said that because they were stronger, they had every right to take the gold from the Saruyama Alliance. Shoujou told Cricket to run and unleashed a Wail of Destruction, which hurt Bellamy's crew. Sarquiss moved to attack him, but Bellamy told him to let him take care of it, and Cricket said that the power of the Bane Bane no Mi was going to be used again. Bellamy turned his legs into springs and attacked Shoujou with a Spring Sniper. Cricket told Shoujou to run, but Bellamy hit him before he could, knocking him clean through the house of the Saruyama Alliance and leaving him afloat in the water."}, {"type": "paragraph", "text": "As Cricket thought about the fun times he had with Shoujou and Masira, Bellamy got on his ship and told Cricket to grow up, that the golden city was all Mont Blanc Noland's imagination. His crew laughed, and Bellamy stated that fantasies never come true. Suddenly, Cricket told Bellamy to wait and lit a cigarette, saying that chickens like Bellamy who can't even fight dreams shouldn't be lecturing someone on how to be a pirate. Bellamy turned around and asked Cricket what he said."}, {"type": "paragraph", "text": "Back at the bar, Bellamy and crew were laughing it up over their recent assault on Mont Blanc Cricket. Just then, the town drunk rushed in with wanted posters and news that Bellamy was in great danger. The two men that he and his crew attacked in the bar were Roronoa Zoro and Monkey D. Luffy, pirates with bounties of 60,000,000 and 100,000,000 respectively. Everyone in the bar was shocked except for Bellamy, who arrogantly claimed that the wanted posters were forgeries created by the two men in an effort to scare him into giving up in a fight with them. This caused the bar to calm down until Luffy's angry shout shocked them again."}, {"type": "paragraph", "text": "Bellamy walked out to see who was calling and saw Luffy on a building. When Luffy told him to return the stolen gold, Bellamy used his Bane Bane powers to get up on the roof as well. He told him that since he stole the gold, it was rightfully his, but Luffy told him that he was going to steal it back."}, {"type": "paragraph", "text": "Bellamy continued to mock Luffy as the drunkard became more and more distressed, but Sarquiss told him to knock it off, starting to doubt that even Luffy's 30,000,000 bounty was real. Bellamy wondered aloud whether Luffy would fight or if he was just going to stand around like their last encounter. When Luffy told him that the last time was different, Bellamy started the fight by using his powers to jump off the building and crack the tower in two."}, {"type": "paragraph", "text": "Bellamy mostly showed off by repeatedly using his Spring Snipe technique, making single bouncing shots toward Luffy. Even with this intimidating provocation, Luffy did not lift a finger towards Bellamy, nor did he take any damage. After a few more attacks on Luffy, Bellamy readied a serious shot using his Spring Hopper technique. Bellamy began ricocheting around the town, bouncing faster and faster, creating an almost deafening chorus of boi-oi-oings that echoed through the entire town."}, {"type": "paragraph", "text": "While he was powering up his attack, Bellamy endlessly insulted Luffy and Cricket over their persistent dreams and ridiculous belief in the sky island, visibly angering Luffy. For his final attack, Bellamy rocketed toward Luffy, and with a single punch, Luffy smashed Bellamy to the ground, leaving an imprint of his knuckles on the right side of his face and knocking him completely unconscious. His crew quickly realized that Luffy's wanted posters were the real thing and ran away."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Bellamy heard the ring of the Shandorian Golden Belfry Bell after Luffy defeated Enel, and witnessed the magnified shadow Luffy cast from far up in the clouds as he celebrated his victory. Bellamy realized that not only did Sky Islands exist, but that Luffy actually had made it to Skypiea. Overwhelmed and horrified at what he was witnessing, he knew he had been wrong this whole time and had wronged Luffy by mocking and attacking him. Henceforth, Bellamy began to admire and respect Luffy."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/41/Bellamy_Smashes_Luffy_into_the_Bar_Counter.png/revision/latest/scale-to-width-down/210?cb=20150922150057", "caption": "Bellamy smashes Luffy into the bar counter."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/21/Luffy_Defeats_Bellamy.png/revision/latest/scale-to-width-down/210?cb=20150914052034", "caption": "Bellamy is defeated by Luffy."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Long Ring Long Land Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later on, Bellamy was seen with an elaborate bandage around his head on Jaya. He and his crew had not left Jaya since Luffy defeated him."}, {"type": "paragraph", "text": "Donquixote Doflamingo, a Shichibukai to whom Bellamy swore allegiance, returned to Jaya and forced Bellamy and his first mate, Sarquiss, to fight each other \"as a lesson\" for disgracing his flag when Bellamy was beaten by Monkey D. Luffy. Bellamy responded that he could not leave them be because they would eventually reach Doflamingo's position and begged in vain for forgiveness to receive another chance from the Shichibukai."}, {"type": "paragraph", "text": "However, Doflamingo showed no mercy and declared that Bellamy was no longer needed. He then manipulated Sarquiss to attack Bellamy one final time, with both of them screaming for mercy at the last moment. Doflamingo then departed and left the remnants of the crew to scream in terror. Despite this, Bellamy survived."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/Sarquiss_vs._Bellamy.png/revision/latest/scale-to-width-down/210?cb=20130513213628", "caption": "Bellamy forced to fight with Sarquiss."}]}, {"title": "During The Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After his punishment, Bellamy took his crew to visit a Sky Island. Though his men did not survive the trip, he retrieved a pillar of gold, confirming that he made it to Skypiea and managed to return to the surface land and present the pillar to Doflamingo, thus redeeming himself and gaining another chance in the Donquixote Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Bellamy_Presents_a_Gold_Pillar_to_Doflamingo.png/revision/latest/scale-to-width-down/210?cb=20141214170439", "caption": "Bellamy presents a gold pillar to Doflamingo."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Bellamy entered the Corrida Colosseum to compete for a leadership position in the Donquixote Family and was assigned to Block B. He is first seen somewhere in the Colosseum crushing someone's skull."}, {"type": "paragraph", "text": "Before Block B began, Bellamy recognized Luffy despite his disguise. After a small chat, Luffy recognized him as the man who beat up Mont Blanc Cricket, though he got Bellamy's name wrong until he was corrected. Luffy asked him why he was here. Bellamy said that he did not live on Jaya and thus could go wherever he wanted. He said that he had worshipped Doflamingo ever since he was young and did not care about the Mera Mera no Mi. All that mattered to him was winning. Bellamy proceeded to explain how he visited a sky island and how he changed as a person after that. As he walked off, he told Luffy that he no longer considered there to be any bad blood between them; all he wanted was to join Doflamingo's crew."}, {"type": "paragraph", "text": "Having said his piece, Bellamy then proceeded to go into the ring. Bellamy was trying to decide where to begin when he saw several fighters get thrown back. Tank Lepanto, Elizabello II, and Dagama discussed if they should take out Bellamy first, to which the tactician said yes, as they must take out the stronger fighters while they still had numbers on their side. Bellamy asked what they are doing, and Bartolomeo remarked that the battle was not really a battle royale anymore."}, {"type": "paragraph", "text": "Bellamy then came face to face with Dressrosa's Self-Defense army commander, Tank Lepanto. Bellamy asked him why he was assisting fighters from a foreign country. Lepanto responded by saying that he was only fighting for money and attempted to strike Bellamy with a spike ball chain. Bellamy dodged the attack and countered."}, {"type": "paragraph", "text": "Lepanto was then taken out by Abdullah and Jeet. Bellamy proceeded to strike the two and easily defeated them, causing the audience to exclaim how cruel and atrocious Bellamy's actions were. "}, {"type": "paragraph", "text": "After defeating Abdullah and Jeet, he started attacking Bartolomeo. However, like Hack, whenever he tried to attack him, Bellamy ended up being the one to take the damage. He then wondered what kind of ability he was using. Despite not being able to attack him, Bellamy managed to grab and hold onto Bartolomeo while being pushed back by his barriers. His grip was so strong that he was able to spring back to his grab all the while remarking that he should not underestimate the power of a spring. At that point, however, Elizabello II was launching his legendary punch. When the king fired his \"King Punch\" not only did he take out Bellamy, but also every other remaining gladiator in the arena, except for the victor, Bartolomeo."}, {"type": "paragraph", "text": "After an injured Bellamy is moved out of the ring, while having another friendly chat with Luffy, he commented on how the other has changed. Meanwhile, Bartolomeo overheard Bellamy calling him Straw Hat."}, {"type": "paragraph", "text": "While recuperating in the Donquixote staff room, he received a letter from Doflamingo, telling him to assassinate Luffy before the end of the tournament, which would earn him a permanent spot as a family leader. The battle outside rages as Bellamy, remembering how Luffy cheered him on, seems hesitant to follow the order. Bellamy is later seen listening in on Cavendish threatening Bartolomeo to not get in the way of his goal of killing Luffy."}, {"type": "paragraph", "text": "Some time later, immediately after Luffy followed Bartolomeo's directions to find Zoro and Kin'emon outside the Colosseum, Bellamy was seen approaching Luffy from a distance, saying that he had found him, with a menacing grin on his face. He intended to go through with the assassination for the officer position, reflecting that it was nothing personal. However, before he could reach him, Dellinger showed up and asked Bellamy if he was done with the assassination. In response to this, Bellamy asked Dellinger what he wanted. Dellinger then revealed Doflamingo's order to kill Bellamy, saying that Doflamingo had no confidence in him and considered him an eyesore. Bellamy reacted by angrily questioning Dellinger's previous statement."}, {"type": "paragraph", "text": "Dellinger severely wounded Bellamy but before he could kill him, Bartolomeo got in the way and protected Bellamy with his barrier. Unable to complete his task, Dellinger, who had been called away by Diamante to guard the SMILE factory, angrily walked away and swore that both Bellamy and Bartolomeo would not leave Dressrosa alive."}, {"type": "paragraph", "text": "Bartolomeo then offered to take Bellamy to the medical room, but Bellamy rejected his offer, tearfully stating that he has nothing to live for and questioned Bartolomeo's reason for helping him. Bartolomeo stated that those who fought together are \"friends\" and he would not let a friend die without helping. As he carried Bellamy around, they ran into Luffy, who was looking for an exit. Bellamy then told Luffy to follow him but also stated that he still respected Doflamingo and would never betray him. Bellamy, Bartolomeo, and Luffy were soon approached by a stranger."}, {"type": "paragraph", "text": "During Doflamingo's \"Birdcage\" survival game, Bellamy went to the royal palace (which has been relocated to the top of the Flower Hill) and questioned Doflamingo about his betrayal. Doflamingo responded by severely injuring Bellamy."}, {"type": "paragraph", "text": "When Luffy and Trafalgar Law arrived at the palace and stood in front of Doflamingo, Bellamy was seen on the ground next to him, unconscious."}, {"type": "paragraph", "text": "Doflamingo then taunted him, calling him weak and a lowly thug. He then lifted Bellamy's head up, showing the duo his brutally beaten face. As he wept, Bellamy begged them to end his life. Luffy attempted to attack Doflamingo in anger, but Doflamingo used Bellamy's face as a shield before dropping him. When Doflamingo used his string clone to attack Law, Luffy attempted to attack the real Doflamingo again. However, Doflamingo used Parasite to control Bellamy, making him attack Luffy. Bellamy apologized for what he was doing and begged Luffy to stop him."}, {"type": "paragraph", "text": "After Doflamingo kicked Luffy with a Haki-enhanced kick and bound his arms with strings, Doflamingo forced Bellamy to slash him. Bellamy begged Luffy to dodge his attack. However, as Luffy was struck by him, Bellamy began to tear up again. Once both Luffy and Law were incapacitated, Bellamy listened in shock as Doflamingo explained his former status as a World Noble."}, {"type": "paragraph", "text": "Taking advantage of Luffy's helplessness, Doflamingo's Black Knight and the controlled Bellamy attacked only to be repelled by Luffy's Gomu Gomu no Tako Stamp. This proved to be only a brief respite as the clone managed to get behind Luffy and sent him crashing through the floor and into the palace. Dropping down alongside Doflamingo's string clone, Bellamy can only stand in silence as it proclaimed all humans to be savage creatures."}, {"type": "paragraph", "text": "Some time later, Luffy destroyed Doflamingo's Black Knight with his Jet Gatling and broke the roof of the palace, allowing Doflamingo to see Bellamy below him. On a whim, Doflamingo decided to stop using Parasite and Bellamy was free to do whatever he wanted, leaving him to fight Luffy one last time. Despite being barely able to stand up, Bellamy refused to betray his own principles and assaulted Luffy with his new and improved Spring Hopper. Luffy continued to implore Bellamy to stop, but Bellamy ignored his plea and struck him with a Haki-imbued punch."}, {"type": "paragraph", "text": "In spite of Luffy's pleas, Bellamy refused to back down and continued his assault. Luffy eventually realized that he could not dissuade Bellamy and decided to finish the battle, knocking out Bellamy in the same manner as he did at Jaya, except this time with a Busoshoku Haki-imbued punch. With his last thought, Bellamy thanked Luffy for calling him a friend."}, {"type": "paragraph", "text": "After Doflamingo was defeated, Bellamy was taken to Kyros' house, where he slept and recovered from his wounds."}, {"type": "paragraph", "text": "Three days after Doflamingo's downfall, the group at Kyros' house recovered from their injuries. When the Marines made a move to capture Luffy and all those affiliated with him, Bellamy stated that he is well enough to run. He then asked Law why he spared him. Law answered it was because Luffy considered him a friend. Bellamy and the others fled right when the Marines were about to storm Kyros' house."}, {"type": "paragraph", "text": "After the escape from Dressrosa and the birth of the Straw Hat Grand Fleet, Bellamy stated that he will not become Luffy's subordinate. He did however decide to take a piece of Luffy's Vivre Card in case if he ever needed it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Bellamy_vs_Abdullah_Jeet.png/revision/latest/scale-to-width-down/210?cb=20140323170755", "caption": "Bellamy defeats Abdullah and Jeet."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e2/Bellamy_Defeated_by_King%27s_Punch.png/revision/latest/scale-to-width-down/210?cb=20140330051103", "caption": "Bellamy lies defeated by Elizabello II's punch."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7f/Bartolomeo_and_Dellinger.png/revision/latest/scale-to-width-down/215?cb=20140928201255", "caption": "Bartolomeo thwarting Dellinger's attempt to kill Bellamy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fa/Bellamy_Brutalized_by_Doflamingo.png/revision/latest/scale-to-width-down/180?cb=20150621143716", "caption": "Bellamy brutalized by Doflamingo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/Doflamingo%27s_Black_Knight_and_Bellamy_Attack_Luffy.png/revision/latest/scale-to-width-down/210?cb=20150818211854", "caption": "Bellamy controlled to fight Luffy alongside Doflamingo's \"Black Knight\"."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8f/Luffy_Defeats_Bellamy_Dressrosa.png/revision/latest/scale-to-width-down/210?cb=20151129190414", "caption": "Luffy defeats Bellamy with one blow again."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c5/Bellamy_Takes_Piece_of_Luffy%27s_Vivre_Card.png/revision/latest/scale-to-width-down/210?cb=20160803235230", "caption": "Bellamy takes a piece of Luffy's Vivre Card before departing."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "Bellamy decided to retire from piracy. He went to Dyed Good Town and became an apprentice dyer. He was later seen drawing a jolly roger."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/Bellamy%27s_New_Life.png/revision/latest/scale-to-width-down/200?cb=20190913161133", "caption": "Bellamy's new career as a dyer."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bellamy vs. Roshio", "elements": []}, {"text": "Bellamy Pirates vs. Monkey D. Luffy and Roronoa Zoro", "elements": []}, {"text": "Bellamy Pirates vs. Mont Blanc Cricket, Masira, and Shoujou", "elements": []}, {"text": "Bellamy vs. Luffy", "elements": []}, {"text": "Bellamy vs. Sarquiss (while being controlled by Donquixote Doflamingo)", "elements": []}, {"text": "Bellamy vs. Corrida Colosseum Block B Gladiators", "elements": [{"text": "Bellamy vs. Tank Lepanto", "elements": []}, {"text": "Bellamy vs. Abdullah and Jeet", "elements": []}, {"text": "Bellamy vs. Bartolomeo", "elements": []}]}, {"text": "Bellamy vs. Dellinger", "elements": []}, {"text": "Bellamy (controlled by Doflamingo), Donquixote Doflamingo, and Trebol vs. Luffy and Trafalgar Law", "elements": []}, {"text": "Bellamy vs. Luffy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Bellamy and Roshio", "level": 3, "content": [{"type": "paragraph", "text": "The scene wherein Bellamy accuses Roshio of cheating is different in both the manga and the anime versions:"}, {"type": "paragraph", "text": "Originally in the manga, when Roshio attempts to take his winnings, Bellamy stabs Roshio's hand with a knife. After asking Sarquiss if he saw that Roshio cheated, Bellamy then shoots Roshio in the leg and hits him with a bottle filled with alcohol. With Roshio covered in alcohol, Sarquiss throws a lit match at him and sets him ablaze. The ignition throws Roshio out the window."}, {"type": "paragraph", "text": "In the anime, the scene is toned down due to its violent nature. When Roshio attempts to take his winnings, Bellamy grabs Roshio's arm and crushes it as Roshio denies that he cheated. Later after asking Sarquiss if he saw Roshio cheat, Bellamy shoots Roshio several times and kicks him out the window."}], "images": []}, {"title": "Corrida Colosseum", "level": 3, "content": [{"type": "paragraph", "text": "After being knocked out the ring by Elizabello II's King Punch, Bellamy was seen apparently floating in the water, despite being a Devil Fruit user. In the anime, Bellamy was seen on top of some rubble instead."}, {"type": "paragraph", "text": "Later, he was instructed by Diamante to kill Luffy. In the manga, he was willing to kill Luffy but was interrupted by Dellinger. In the anime, he backed out at the last minute because he could not do it and then he was confronted by Dellinger."}, {"type": "paragraph", "text": "In the anime, Dellinger's attack on Bellamy is shown and Bellamy tries to put up a fight before trying to escape and find Doflamingo for answers until his wounds get to him and allows Dellinger to attack him once more. Also in the anime, the moment where Bartolomeo steps in to save Bellamy is shown."}], "images": []}, {"title": "Dressrosa Royal Palace", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Bellamy is shown walking through the sunflower fields and making his way to the palace to confront Doflamingo about his supposed betrayal."}, {"type": "paragraph", "text": "In the manga, the aftermath of Luffy's battle with Bellamy is shown and his defeat is announced from Viola's perspective, revealing he has been knocked out by a single punch again, while the events leading up to his defeat are shown in a flashback. In the anime, the events in the flashback are shown in the present happening over the course of several episodes before Bellamy is defeated."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Grand Battle 3", "elements": []}, {"text": "One Piece: Unlimited Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bellamy's namesake comes from Samuel Bellamy, a real pirate who sailed the seas in the early 1700s.", "elements": []}, {"text": "The conflict in the bar between Luffy, Zoro, and Bellamy can be compared to the earlier \"fight\" between Shanks and Higuma. Just as Shanks also chose not to fight against Higuma, Luffy chooses to do nothing against Bellamy. This is most likely because of the fact that there was nothing Bellamy and his crew could do to actually compel Luffy and Zoro to take their abuses seriously enough to fight back, at least until they attacked their other defenseless friends, Mont Blanc Cricket and his \"sons\".", "elements": []}, {"text": "In the 5th Character Popularity Poll, Bellamy ranked 55th, tying with Baby 5.", "elements": []}, {"text": "Bellamy's bounty is higher than all of the Donquixote Pirates, except for Doflamingo and Caesar, who was declared a subordinate by Doflamingo only right before the crew's demise.", "elements": []}]}], "images": []}]}