{"sections": [{"title": "Gatz", "level": 1, "content": [{"type": "paragraph", "text": "Gatz is the announcer at the Corrida Colosseum."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gatz's appearance is that of a Spartan warrior. He wears a golden helmet with a large dark colored plume and a golden breast plate with a dark colored skirt. He has long brown hair that extends halfway down his back over a cape and a black goatee."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As the Corrida Colosseum commentator, he has to remain impartial while reporting from the commentator's booth. Even so, he still has an emotional stake in the fighting as he was shocked and disappointed when Hack was defeated during the B block fight, and was cheering for Lucy during the C block. When he learned that Sabo took Luffy's place as \"Lucy\" for the finals, he remarked how it was against the rules."}, {"type": "paragraph", "text": "He greatly admires those who are strong, complimenting Luffy for being such a competent fighter despite his small stature."}, {"type": "paragraph", "text": "He later showed his selfless side when promising to confront Doflamingo in order to buy Luffy time. While he commented on Luffy and Sabo breaking the tournament rules by switching places, he showed some empathy by stating that he was glad Luffy and Sabo got the prize since it was a part of their deceased brother Ace. He was also willing to put himself in harm's way in order to get Doflamingo away from Rebecca and Viola."}, {"type": "paragraph", "text": "He is also honorable, as he refuses to make anyone fight if they are not in the shape to do so, even if it is the only way to avert imminent doom."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 3, "content": [{"type": "paragraph", "text": "Gatz once referred to him as \"his majesty\", showing a great respect for him, as most citizens of Dressrosa did. However, he later lost this attitude after Doflamingo attempted to kill everyone on Dressrosa after his true colors were revealed. During the final phase of the Birdcage game, he aided Luffy by ensuring his safety long enough for him to regain the strength needed to defeat Doflamingo. When he broadcasted himself to Dressrosa, he openly criticized and taunted Doflamingo, calling him a false ruler. In anger, the Shichibukai stabbed him."}], "images": []}, {"title": "Corrida Colosseum Participants", "level": 3, "content": [{"type": "paragraph", "text": "Despite having to remain impartial as the announcer, Gatz's feelings toward certain fighters have gotten the better of him several times."}], "images": []}, {"title": "Bellamy", "level": 4, "content": [{"type": "paragraph", "text": "As is the case with most of the Colosseum's audience, Gatz is a fan of Bellamy and sees him as a hero of Dressrosa."}], "images": []}, {"title": "Hack", "level": 4, "content": [{"type": "paragraph", "text": "He is a fan of Hack, as the fish-man wanted to stop Bartolomeo's disrespectful behavior and Gatz was shocked when Hack became injured by seemingly nothing."}], "images": []}, {"title": "Bartolomeo", "level": 4, "content": [{"type": "paragraph", "text": "Much like the audience, he hates Bartolomeo and considers his behavior disrespectful to the tournament."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "While Luffy was disguised as Lucy, Gatz took a quick liking of him as he described him as a rising star. Gatz showed disappointment when he thought Luffy was defeated by Hajrudin and cheered for him when he won. He later swore to protect Luffy from Doflamingo while his Haki recovered. He was very surprised Luffy's brother Sabo acquired the Mera Mera no Mi but he supported it as a way to honor Ace."}, {"type": "paragraph", "text": "Gatz's respect for Luffy was so great that he even alerted Dressrosa of the latter's promise to defeat Doflamingo. After Luffy reappeared, Gatz was happy and quickly told Dressrosa of his return and cheered Luffy on as he fought Doflamingo. Once Doflamingo was defeated, Gatz proudly announced Luffy's victory to Dressrosa. Even when Luffy was accused of kidnapping Rebecca, he proclaimed that he still liked Luffy. However, it was clear that he was aware that Kyros is Rebecca's father and was happy that Luffy brought her back to him. Even after finding out his real name, Gatz and the citizens of Dressrosa still call him by his gladiator name \"Lucy\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the only commentator at Corrida Colosseum, he has the ability to sway a crowd's opinions about a fighter by how he portrays them. Even so, he has to control himself and remain unbiased in his commentary, with the only exceptions being fighters that are clearly unpopular like Bartolomeo."}, {"type": "paragraph", "text": "Despite being impaled by Doflamingo, he was able to get up and continue broadcasting, though he was weakened, indicating some physical fortitude."}, {"type": "paragraph", "text": "He also has rather sharp eyesight, able to notice where Doflamingo was and what he was doing to Viola and Rebecca. He was also able to spot Luffy being teleported by Law, despite being several kilometers away."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Before Block A began, he introduced the members of the Donquixote Pirates who would be participating and showed the audience the prize of the tournament, the Mera Mera no Mi. He then provided commentary on the Block A battle royale, announcing to the crowd that the winner, Mr. Store, was actually Jesus Burgess of the Blackbeard Pirates."}, {"type": "paragraph", "text": "Prior to Block B, Gatz introduced the next group of contestants including Bartolomeo and Bellamy. When Block B began, he again provided commentary on the fighting action. He was able to remain unbiased about the fights until Hack was defeated, at which point he broke stride to express his outrage at how Bartolomeo defeated him. A co-worker quickly reminded him he had to remain unbiased in his commentary. After Elizabello II threw his King Punch, he was about to declare the king the winner, until he realized that Bartolomeo was still standing. He shared the crowd's mutual surprise when Bartolomeo suddenly knocked the king out."}, {"type": "paragraph", "text": "During the Block C battle royale, he took a liking to Lucy after he gained popularity and while he was riding on the Fighting Bull. Gatz was then disappointed when Lucy and the Fighting Bull ran into Hajrudin and get smashed by his shield. Much to his surprise, he sees Lucy stands back up and defeats Hajrudin with one punch. Afterwards Gatz is once again having trouble remaining unbiased in his commentary as seen when Boo seemingly defeated one of the Funk Brothers with a single punch."}, {"type": "paragraph", "text": "Following the Haki blast released by Luffy and Chinjao, Gatz was surprised by how many prominent fighters were defeated by the attack and wonders what just happened to cause it. He was even more surprised when the great pirate Chinjao broke down and started crying uncontrollably in the middle of the fight."}, {"type": "paragraph", "text": "Gatz later witnessed Lucy and Chinjao clashed against each other in mid-air. After Lucy knocked out Chinjao, the former pirate fell down head first into the arena, splitting it in half, and then sank into the water. Gatz declared Chinjao out of bounds and while announcing Lucy as the winner of Block C, he commented that Lucy's victory was unexpected. Since the arena was heavily damaged and needed repairs, Gatz informed the spectators that Block D will be delayed."}, {"type": "paragraph", "text": "Once the arena was repaired, Gatz announced the commencement of Block D. Once Rebecca entered the arena, Gatz announced her appearance as the crowd booed and jeered at her. During the Block D battle royale, Gatz commented on Rebecca's style of fighting, which is defeating her opponents not by directly injuring them but by having them fall out of the ring. Gatz stated that her techniques were not ungraceful and that he does not dislike her. He then wondered how Rebecca would fair against the strong fighters from other countries, including Rolling Logan."}, {"type": "paragraph", "text": "He continued with the play-by-play of Block D until every big name fighter was mysteriously struck down almost instantaneously. He then waited in anticipation to see the last one standing and was deeply surprised that it was none other than Rebecca."}, {"type": "paragraph", "text": "With the first round over, Gatz announced that it was time for the finals and revealed that Diamante will be participating. When the finals began, Gatz shouted out Lucy's name as he (actually Sabo) entered the arena."}, {"type": "paragraph", "text": "After the rest of the finalist gathered at the arena, Gatz took note of three disqualified participants from Block D who refused to accept that Rebecca was the winner only for them to be beaten back by Diamante. When the finals commenced, Gatz provided the play by play and commented on Lucy's amazing agility as he dodged an attack by a Fighting Fish. He was later surprised when Rebecca attempted to attack Diamante."}, {"type": "paragraph", "text": "During the time the toys in the audience returned to their original forms, Gatz was shocked when Lucy demolished the arena with his bare hands. While the spectators fled, Gatz announced Lucy the winner after he grabbed the Mera Mera no Mi and acquired its power."}, {"type": "paragraph", "text": "After Doflamingo initiated his Birdcage and was nearly defeated by Luffy, Gatz and all the gladiators from the colosseum provide their aid to the pirate, whom he recognized as Lucy. An exhausted Luffy asked Gatz to give him 10 minutes to recover and Gatz proceeded to take Luffy to safety. They were then attacked by Burgess but were saved when Sabo kicked Burgess away."}, {"type": "paragraph", "text": "Gatz was surprised to learn that Sabo and Luffy were brothers before the latter entrusted Luffy's safety to him. Gatz then realized that Sabo was the Lucy who fought in the colosseum finals after seeing him use the Mera Mera no Mi. With Sabo holding back Burgess, Gatz carried Luffy far away from both Burgess and Doflamingo. While running he learns Luffy and Sabo switched places, although he notes that what they did was against the rules he states he is happy they won a memento of their late brother. When Doflamingo accelerated the shrinking of the Birdcage, Gatz wondered if they will make it out alright."}, {"type": "paragraph", "text": "Gatz then ran into Trafalgar Law, who used Room to teleport to his and Luffy's location. Law asked Gatz to leave Luffy with him and Gatz complied."}, {"type": "paragraph", "text": "Gatz then ascended up the palace mountain and broadcasted himself to the people of Dressrosa, revealing to everyone that Lucy was Luffy and that in ten seconds he would arrive and bring down Doflamingo once and for all. In an effort to draw Doflamingo's attention away from Viola and Rebecca, Gatz taunted Doflamingo, causing the Shichibukai to become enraged and stab him with a sheet of string. Gatz fell over, still trusting in Luffy."}, {"type": "paragraph", "text": "When Luffy finally got back on his feet, Gatz cried out with joy and alerted Dressrosa of his return. He then watched Luffy's fight from afar."}, {"type": "paragraph", "text": "Once Luffy finally defeated Doflamingo and brought down the Birdcage, Gatz cried with tears of joy as he proudly announced Luffy's victory to Dressrosa."}, {"type": "paragraph", "text": "Three days after Doflamingo's downfall, Gatz proudly announced to Dressrosa of Riku Doldo III's return to the throne. When he heard that Luffy took Rebecca from the palace, he was shocked but exclaimed that he still likes him."}, {"type": "paragraph", "text": "After Luffy and his group escaped the Marines, Gatz took part in the celebrations along with the other people of Dressrosa."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Gatz_Helps_Luffy.png/revision/latest/scale-to-width-down/210?cb=20161221115703", "caption": "Gatz helps Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Gatz_Is_Impaled.png/revision/latest/scale-to-width-down/210?cb=20160321200646", "caption": "Gatz is impaled by one of Doflamingo's string spears."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited World Red", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In One Piece: Unlimited World Red, Gatz appears in the game's Colosseum mode. He commentates and acts as the game mode's announcer, much like his role in the actual Corrida Colosseum. In the game, however, he lacks his facial hair and is only referred to as the \"Announcer\", despite the fact that he is in the same role and has the same voice actor.", "elements": []}]}], "images": []}]}