{"sections": [{"title": "Atmos", "level": 1, "content": [{"type": "paragraph", "text": "\"Water Buffalo\" Atmos is the commander of the 13th division of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Atmos is a huge man, roughly the size of Jozu, whose choice of clothing he somehow mirrors: he is dressed in sleeveless gray and golden armor, and wears an old-fashioned Asian-themed gray helmet that has bull horns sticking out of it, that makes him resemble a water buffalo, as per his epithet. He has long, mane-like black hair, reaching down to his waist, and his beard is just as long. He has two teeth resembling those of a walrus, but square-shaped and pointing upwards. On each of his arms, he bears a purple tattooed silhouette of Whitebeard's Jolly Roger."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Atmos is very loyal to Whitebeard, as he is willing to risk his life to save Ace from his execution. He cares deeply for his crewmates and captain, as he cried and expressed significant grief when Ace and Whitebeard were killed."}, {"type": "paragraph", "text": "Atmos is rather bold, confronting the Shichibukai Donquixote Doflamingo by himself, but he quickly admits when he is in over his head, nervously warning his crewmates after Doflamingo began manipulating him to hurt them."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the commander of the 13th division of Whitebeard's crew, Atmos has command and responsibility over the pirates within his division. He seems to be quite well known, as Doflamingo knew who he was when the two encountered each other on the battlefield."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Atmos carries around two large swords and can deal devastating blows with them, as seen when he attacked and destroyed the swords of some of his crewmates while Doflamingo controlled him. In the anime, he could even block bullets that were shot from rifles to protect his allies."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "​​​​​Thirty years ago, Atmos was with the Whitebeard Pirates when they arrived for the first time at Wano Country. The crew was shipwrecked and before going to civilization to get supplies, they encountered Kozuki Oden, who asked Newgate to let him join their crew after a brief clash."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Oden kept asking to join the crew, but he was turned down. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. After Izo was pulled up onboard, Oden accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, the crew started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Atmos arrived at Marineford along with other Division Commanders of the Whitebeard Pirates, with the intention of rescuing Ace. Seeing Doflamingo laughing at Little Oars Jr.'s sacrifice, Atmos and his men confronted the Shichibukai. However, before they could do anything, Atmos found himself being controlled by Doflamingo. He was then forced to fight his own men, who were all very surprised and tried to stop him without hurting him."}, {"type": "paragraph", "text": "Eventually he was freed from Doflamingo's control, and continued on with the battle. He made it onto the black paddle ship that raise up in the center of the bay, and he was later standing next to his fellow Whitebeard Pirates, raising his weapon to follow his captain's advance."}, {"type": "paragraph", "text": "As Whitebeard clashed with Akainu, Atmos and the other commanders continued to fight the Marines. Atmos, some other Division Commanders, and Jinbe made a defensive line behind Whitebeard to cover him. When Luffy charged Garp, Atmos watched in astonishment. Atmos stood and cheered next to Haruta and Vista as Ace was freed. However, this joy was short-lived, as he, Marco, and Vista looked on in shock as Akainu's fist penetrated Ace's body. He later cried in grief as the Blackbeard Pirates killed Whitebeard."}, {"type": "paragraph", "text": "While Jinbe and Whitebeard's allies fought to get Luffy to safety, Atmos joined his crew members, Crocodile, and Andre, ready to fight Akainu. This battle was never shown, but he is shown to be unharmed later on. Upon the arrival of Shanks and Sengoku calling the war to a close, he and the rest of Whitebeard's crew left."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ab/Atmos_body_manipulated.png/revision/latest/scale-to-width-down/230?cb=20101205195451", "caption": "Atmos' body is manipulated by Doflamingo to attack his own crew."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Atmos and the rest of the crew attended Whitebeard and Ace's funeral at an undisclosed location somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and had not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Atmos vs. Donquixote Doflamingo", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu, and Thatch), Crocodile, and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Atmos is featured in Volume 33 of the One Piece World Collectable Figure series alongside his fellow Division Commanders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/46/One_Piece_World_Collectable_Figure_One_Piece_Volume_33.png/revision/latest/scale-to-width-down/250?cb=20131123042747", "caption": "Atmos in World Collectable Figure Volume 33"}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Atmos has a water buffalo theme.", "elements": []}, {"text": "Atmos has been seen with and without his long, mane-like black hair in different shots. This is likely a drawing error.", "elements": []}, {"text": "Atmos' name in Greek (Ατμός) means steam.", "elements": []}]}], "images": []}]}