{"sections": [{"title": "Whitey Bay", "level": 1, "content": [{"type": "paragraph", "text": "\"Ice Witch\" Whitey Bay is an infamous New World pirate captain who was once a member of the Whitebeard Pirates before forming her own crew subordinate to Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Whitey Bay has long, flowing blue hair, full lips and always has a confident expression on her face. She sports a short striped dress closed by laces that have flower-shaped buttons, with loose sleeves, and a scarf. She also wears a polka-dotted bandanna, and over it a light blue and purple pirate hat with her Jolly Roger in the center, a skull with a snowflake design. She also sports a cape, hanging from her back."}, {"type": "paragraph", "text": "30 years ago, she wore a striped long-sleeved shirt that exposed her midriff and a short striped skirt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Having only appeared on a small number of occasions, there is little of her personality that can be ascertained as of late, aside from a confident stance and a somewhat laid-back demeanor. She also seems very loyal to Whitebeard, as she answered his call to arms to save Ace."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Whitey Bay is a pirate who has managed to make herself an infamous reputation in the New World and to become a subordinate of the Whitebeard Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, she is seen wielding a sword."}], "images": []}, {"title": "Pirate Ship", "level": 3, "content": [{"type": "paragraph", "text": "Whitey Bay's pirate ship is an icebreaker (砕氷船, saihyōsen). It made its debut in Chapter 556 and Episode 465."}, {"type": "paragraph", "text": "Whitey's icebreaker has a steel-plated hull instead of a wooden hull seen on most other ships in the series so far. Also in place of a figurehead, the ship has a snowflake insignia on the front. On board the ship is the cabin which also has snowflakes painted on the walls, and has cannons mounted on top. There are masts and sails with the front sail having the crew's Jolly Roger painted on it."}, {"type": "paragraph", "text": "Because of the ship's steel-plated hull, it boasts higher offensive and defensive capabilities. Its main purpose is to break through ice-covered waters, including the sea of ice created by Admiral Aokiji. This made her ship the only one of the entire Whitebeard Pirates capable of continuing onward, while the rest were trapped by the ice. Additionally, her ship broke through a section of Marineford's wall."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Whitey_Bays_Icebreaker.png/revision/latest/scale-to-width-down/210?cb=20100906092642", "caption": "Whitey Bay's icebreaker shattering Aokiji's ice."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Crewmember of the Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Thirty years ago, Whitey Bay was with the Whitebeard Pirates when they arrived for the first time at Wano Country. The crew was shipwrecked and had decided to go into the island to gather supplies. When Marco offered to go along, Whitey Bay disproved of it on the basis that he was just an apprentice. A few moments later, they encountered Kozuki Oden, who, after a brief clash, asked Whitebeard to let him join their crew."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Oden kept asking to join the crew, but he was turned down. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. After Izo was pulled up onboard, Oden accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, the crew started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Rise to Infamy", "level": 4, "content": [{"type": "paragraph", "text": "Whitey Bay later established her own crew and became an infamous pirate herself, while remaining subordinate to Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Upon learning that Ace was going to be executed, Whitey Bay and her crew joined forces with several other pirates and Whitebeard's crew to rescue Ace. Arriving at Marineford, as the war with the Marines began, the pirates found their ships frozen at sea by Aokiji. However, this setback did not stop Whitey Bay and her crew. Due to their ship being an icebreaker, they simply broke through the ice. As they sailed, they created another opening in the Marine's formations for which Whitebeard and his subordinates could progress through besides the opening created by Little Oars Jr. earlier."}, {"type": "paragraph", "text": "As the battle raged on and events unfolded, Whitey Bay and the other pirates were instructed to stop attacking Marineford straightforwardly. Whitebeard noticed something was going on with the Marines and thus instructed Bay and the rest to instead attack the base from the sides."}, {"type": "paragraph", "text": "She was not seen again for the remainder of the war. Upon the arrival of Shanks and Sengoku calling the war to a close, she along with the rest of Whitebeard's crew left."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Whitey_Bay_Marineford.png/revision/latest/scale-to-width-down/210?cb=20140604135435", "caption": "Whitey Bay at Marineford."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Whitey Bay and the rest of the allied crew, attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Under unknown circumstances, Whitey Bay encountered Edward Weevil and got into an argument. However, this small argument resulted in her defeat at the hands of Weevil. The news of her defeat was seen on Kizaru's desk."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Whitey Bay vs. Edward Weevil (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, Whitey Bay cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows Whitey Bay alongside the other attendees. Although it can be assumed that Whitey Bay was at the funeral, there is no visual evidence of her attendance in the manga to support this assumption and, as such, her attendance can only be considered non-canon."}, {"type": "paragraph", "text": "In the anime, she is among the news reports of those defeated by Edward Weevil, alongside the reports of Elmy, Ramba, Bizarre, A.O, the Decalvan Brothers, and Palms."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is very similar to the English town Whitley Bay, which is somewhat famous for its ice rink.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 556 and Episode 462, Whitey Bay is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 166), Whitey Bay's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963 (p. 14-15), Whitey Bay is shown as a member in the Whitebeard Pirates thirty years ago.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 556, Whitey Bay's ship breaks through the ice created by Aokiji.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 553, Aokiji freezes the Marineford bay, trapping Whitebeard and his allies' ships.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 559, Whitey Bay and the rest of Whitebeard's subordinates are instructed to change their tactics against Marineford.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, Whitey Bay attends Whitebeard and Ace's funeral.", "elements": []}, {"text": "↑  One Piece Anime — Episode 751, Whitey Bay's news report on Kizaru's desk.", "elements": []}]}], "images": []}]}