{"sections": [{"title": "Jesus Burgess", "level": 1, "content": [{"type": "paragraph", "text": "Jesus Burgess, nicknamed \"Champion\", is the helmsman and one of the Ten Titanic Captains of the Blackbeard Pirates, being captain of the First Ship."}, {"type": "paragraph", "text": "Due to his actions, he is a major antagonist in the Marineford Arc, and the tertiary antagonist of the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jesus Burgess is an unusually big, tall, broad, broad-chested, broad shouldered, tan-skinned, muscular man, with a broad upper body and a thin lower body in comparison. He has curly violet hair reaching down to his shoulders and always wears a dark brown mask with orange decorations on it, which covers the upper part of his face but reveals his eyes and his nose. He appears to be based on Luchador wrestlers based on his name and the face mask of Mexican origin."}, {"type": "paragraph", "text": "He wears a sleeveless black shirt and a pair of white pants with ruffles coming from the base then reaching up to his knees; he also wears black bands tied around both elbows. Burgess also appears to be always wearing a championship belt, a belt which wrestlers only obtain from winning many matches or to show that they are extremely skilled in wrestling. It is unknown if Burgess obtained this belt from his mastery in wrestling or if its just there for his wrestler appearance."}, {"type": "paragraph", "text": "After the timeskip, Burgess has grown a beard and become even more muscular. His hair has also turned a lighter shade than what it was two years ago. While at the Corrida Colosseum, Burgess dons the traditional gladiator attire of sandals and a loincloth, as well as his trademark belt. In addition, his right arm is armored, with his shoulder being covered by a plate pauldron, all held in place by a harness across his chest. He also wears a pair of black gloves. When he first entered the Colosseum as Mr. Store, he was wearing a light green paper bag mask which has eyeholes in it and the name \"Store\" which is colored aqua-blue and Happy written in black upside-down on the forehead."}, {"type": "paragraph", "text": "His regular outfit after the timeskip is mostly the same as two years ago. However, he now wears a vertically striped black and white sleeveless shirt that has the same orange symbol as his luchador mask and he now wears a pair of brown gloves. In Dressrosa, he also carries a green bag which has swirly patterns on it."}, {"type": "paragraph", "text": "After battling Sabo, he received several injuries including a bone sticking out of one of his legs, which has some of the flesh and muscles on his leg burned off completely. It appears he also lost some or all parts of his mask which he had to obscure."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Burgess is brutish and ogre-like, and is also very loud and overbearing. He seems to be overconfident, as he climbed buildings and challenged random people in Jaya, proclaiming himself as the Champion. He also appears to have an intense love of combat, wanting to test his skills out on anyone he finds. He especially enjoys strong opponents, as shown when he found out that Monkey D. Luffy was fighting at the Corrida Colosseum. Despite, or perhaps because of his profound love for combat, Burgess also appears to be a sore loser, unable to accept defeat even when he is critically injured. He is also willing to use whatever dirty and underhanded tactics he can should he or his allies be unable to win in a straight up fight, as evidenced by how he joined the rest of The Blackbeard Pirates in their nine-on-one assault against Whitebeard."}, {"type": "paragraph", "text": "He has a much more serious nature than his captain, as he scolded Blackbeard for laughing when they lost the Straw Hat Pirates. However, he seems to have become quite laid-back after the time-skip shown when meeting Monkey D. Luffy in the Corrida Colosseum hallways and letting his captain talk to him."}, {"type": "paragraph", "text": "Late into the Dressrosa Arc, Burgess also displayed a ruthless opportunistic mindset, willing to take advantage of Luffy's weakened state to kill him and take his Devil Fruit, despite the fact that Luffy was the country's best chance at saving them from the oppressive Doflamingo. This is further shown when he tried to kill Sabo just to get his hands on the Mera Mera no Mi when he interfered in his attempts to kill Luffy, believing that it was his right to have the fruit."}, {"type": "paragraph", "text": "After becoming a Yonko and gaining a fleet of ships, Blackbeard began going by the new title of \"Admiral Teach\". Burgess repeatedly forgets to address Blackbeard by this moniker after habitually calling him \"Captain Teach\", as Laffitte has needed to remind him several times in the past not to do this."}, {"type": "paragraph", "text": "According to himself, he is attached to the crew's raft."}, {"type": "paragraph", "text": "Burgess' signature laugh is \"Wiiihahaha!\""}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Burgess is extremely loyal to his captain, Blackbeard but has gotten impatient with his casual approach. When Ace attacked Blackbeard, Burgess jumped to his defense until Blackbeard ordered him not to fight the Whitebeard Pirate commander. He also cheered on his captain for successfully stealing the Gura Gura no Mi."}, {"type": "paragraph", "text": "Blackbeard also trusted Burgess as he sent him to Dressrosa to acquire Ace's Devil Fruit, the Mera Mera no Mi. Even though Laffitte reminded Burgess that Blackbeard is called Admiral Teach, he still addressed him captain."}], "images": []}, {"title": "Kuzan", "level": 4, "content": [{"type": "paragraph", "text": "Though Blackbeard was willing to recruit Kuzan, Burgess was not so quick to trust him due to him being a former Marine admiral."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "As one of the members of the Blackbeard Pirates, Burgess is Luffy's enemy. At Dressrosa, Burgess was amused after discovering that Luffy was competing for the Mera Mera no Mi and when Luffy declared that he would not let him have Ace's power. He later attempted to kill him for the Gomu Gomu no Mi only to be stopped by Sabo."}], "images": []}, {"title": "Sabo", "level": 4, "content": [{"type": "paragraph", "text": "As Luffy's sworn brother, Sabo is an enemy to Burgess. At the Corrida Colosseum, Burgess fought Sabo for the Mera Mera no Mi and was displeased when the latter ate the fruit. During the Birdcage game, Sabo stopped Burgess from killing Luffy and told him that he was Luffy's brother as well as Ace's. Burgess was amused but tried to ignore Sabo though after Sabo revealed he ate the Mera Mera no Mi, he decided to go after him."}, {"type": "paragraph", "text": "After defeating Burgess, Sabo was just going to walk away but Burgess spoke ill of Ace, in an attempt to kill Sabo. A furious Sabo evaded his attack and injured him further, by severely burning him."}, {"type": "paragraph", "text": "Burgess managed to survive and stowaway on board a ship that took him to the Revolutionary Army's base at Baltigo. When informing his comrades of his location, Burgess is shown to detest Sabo as he insulted him and told the rest of Blackbeard Pirates to attack Baltigo, forcing the revolutionaries to relocate their base of operations."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Burgess is one of the most powerful members of the Blackbeard Pirates. He managed to defeat every challenger he fought in Mock Town with ease and won the A Block of the Corrida Colosseum battle royale within seconds all without a single injury. After the time-skip, he is the Captain of the First Ship of the Blackbeard Pirates. "}, {"type": "paragraph", "text": "Based off of his attempt on Luffy's life for the Gomu Gomu no Mi and his conversation with Sabo, he is also capable of stealing Devil Fruit abilities from others. The procedure for this is still unknown."}, {"type": "paragraph", "text": "After the time-skip, at the Corrida Colosseum just his mere presence was enough to terrify all the nearby gladiators."}, {"type": "paragraph", "text": "He is also, according to Gatz, part of a group of Ten Titanic Captains that personally guard the Yonko, Blackbeard."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Burgess has tremendous physical strength. He easily ripped an entire building off its foundations and threw it at Ace across a great distance. In the Corrida Colosseum, he completely overpowered all of his opponents in Block A including a giant in the anime by himself single-handedly within seconds. Burgess's strength also extends to his legs as he jumped down from the Dressrossa palace to the second level without a scratch, allowing him to make it to Luffy's location in a very short amount of time, a feat that greatly shocked Koala."}, {"type": "paragraph", "text": "Burgess also possesses massive endurance, as seen (pre time-skip) when he took a direct hit from a Gura Gura no Mi strike from the former Yonko Edward Newgate, as well as Fleet Admiral Sengoku's shockwave in his Buddha form without suffering much damage. In Dressrossa, Burgess took Sabo's Kaen Ryuou at point blank range, which blasted him with enough firepower to smash him through buildings, and recovered enough to quickly resumed the battle. After being defeated by Sabo in a heavily injured state, Burgess survived being brutally burned by Sabo's Hiken after his failed attempt to steal the Mera Mera no Mi. Despite suffering so much damage, Burgess could stow himself away on a ship of the Revolutionary Army travelling to Baltigo for an extended period of time without any medical treatment, allowing him to contact Laffite to inform him of his location in Baltigo while still on the verge of death."}, {"type": "paragraph", "text": "Burgess is also an immensely powerful and skilled wrestler. His wrestling attacks such as elbow strikes and lariats can generate massive shockwaves that can demolish buildings with great ease."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During the battle of Marineford, he was seen using two pistols against Whitebeard."}, {"type": "paragraph", "text": "When Burgess tried to kill Luffy, he wielded a large dagger."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Burgess%27s_Dagger.png/revision/latest/scale-to-width-down/100?cb=20161221115822", "caption": "Burgess's dagger."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Burgess demonstrated the use of Busoshoku Haki when he hardened his elbow armor in an attempt to resist Sabo's attack in the Corrida Colosseum final round. However, his Haki was not strong enough to counter Sabo's own Busoshoku Haki imbued attack, which was able to shatter his armor."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Burgess possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Hado Elbow (波動エルボー, Hadō Erubō, literally meaning \"Wave Motion Elbow\"): Burgess attacks with an elbow strike powerful enough to cause huge shock waves upon the impact. It was first seen during the finals of Corrida Colosseum against a Fighting Fish, sending it flying away, and at the same time a shock wave to the audience, causing massive destruction. In the anime, his arm vibrates while preparing for the attack and his elbow emits vibrational waves similar to those of Hasshoken techniques. In the Viz manga and FUNimation subs, this is called Shockwave Elbow.", "elements": []}]}, {"type": "list", "elements": [{"text": "Galleon Lariat (ラリアット, Gareon Rariatto, literally meaning \"Unsinkable Battleship Lariat\"): Burgess swings his arm at his opponent, resulting in a shockwave powerful enough to cut buildings several meters away completely in half. This was first used against Sabo.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time after joining Blackbeard's crew, Burgess and the entire crew attacked Drum Island and forced the cowardly King Wapol to flee."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was first seen bending over a defeated man complaining about his strength. Another man then noted it and asked if he knew that he had defeated a man from Roshio's crew. Later, after Luffy had taken one of Doc Q's apples, he was seen standing on top of a building yelling out for decent challenge."}, {"type": "paragraph", "text": "After Bellamy was defeated by Luffy, he met up with his crew and asked about Laffitte and why he wasn't there. When their raft was destroyed by the Knock Up Stream he complained about his captain's easy going attitude towards their failure."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/02/Blackbeard_Pirates_in_Jaya.png/revision/latest/scale-to-width-down/210?cb=20130420053700", "caption": "The Blackbeard Pirates at Jaya."}]}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates later raided Banaro Island. They planned to travel to Water 7 to track down Luffy, but they were confronted by Ace. After Ace and Van Augur attacked one another, Burgess was quick to throw a building at Ace that was easily destroyed. Later he was struck by Ace's Hiken and he and the other Blackbeard Pirates retired to a much safer location; comically pulling the very sick Doc Q, along with his horse. Once out of the way, Burgess and the rest of the crew witnessed the fight between his captain and Ace."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d9/Hiken.png/revision/latest/scale-to-width-down/210?cb=20130525224004", "caption": "Burgess is struck by Ace's Hiken."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Burgess arrived at Impel Down unexpectedly with the rest of the Blackbeard Pirates."}, {"type": "paragraph", "text": "After exchanging some words with Impel Down's mass breakout army, Burgess and the rest of the crew are caught and poisoned by Magellan's Hydra technique. Later, the whole crew is saved by an antidote from former Chief Guard Shiryu, who accepts Blackbeard's offer and joins their crew."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Burgess is seen along with the other members of the Blackbeard Pirates near the execution platform where they were watching the events unfold on the battlefield. He joined his crew in killing Whitebeard, using a pair of pistols to shoot the Yonko."}, {"type": "paragraph", "text": "After Whitebeard dies, Burgess assists his crewmates in covering Whitebeard with a black cloth and guards Blackbeard as he starts a demonstration of his powers. Burgess and the other Blackbeard Pirates are then attacked by a shockwave created by Fleet Admiral Sengoku in his Buddha form. After his captain destroys more of Marineford, he tells Blackbeard if he goes too far they would lose their footing. In the anime, he jumps into the fight to attack Sengoku while he was distracted but was struck down by Vice Admiral Garp. When Red Hair and his crew arrive on the scene the Blackbeard Pirates retreated."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Whitebeard_vs_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/210?cb=20151018201408", "caption": "Burgess and the rest of crew killing Whitebeard."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "The crew makes their move in the New World, taking out Jewelry Bonney in the process. The crew is seen bickering amongst each other, Burgess saying that people can get attached to material things. Blackbeard Pirates' raft was brought close to the point of destruction, due to Sanjuan Wolf's size, and they seemingly got in contact with the Marines, to trade Jewelry Bonney for a battleship. Van Augur alerts the crew that the battleship has arrived, but not for trade because Akainu is on board. Knowing that the deal will not happen, the Blackbeard Pirates flee, leaving Bonney behind to be arrested."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "The Blackbeard Pirates used their captain's knowledge of Whitebeard's former territory to conquer it. Now that Blackbeard has become a Yonko, the Blackbeard Pirates are hunting down powerful Devil Fruit users in order to absorb their abilities. He eventually gained command of the Blackbeard Pirates' first fleet, and apparently became infamous himself."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Burgess entered the monthly Corrida Colosseum tournament as \"Mr. Store\" to compete for the Mera Mera no Mi and was assigned to block A. It did not take him long to defeat all of his opponents and he was declared the winner of the Block A battle royale. He then removed the paper bag mask he was wearing and revealed his identity, shocking the spectators and the other fighters."}, {"type": "paragraph", "text": "During the fight between Luffy (as Lucy) and Chinjao, Burgess went to the observation deck and commented that Block C has gotten interesting. He then wondered who Lucy was."}, {"type": "paragraph", "text": "After witnessing his victory in his group's battle royale, Burgess realized that the man was in fact Luffy and got excited."}, {"type": "paragraph", "text": "After Block C ended, Burgess spoke to Blackbeard via Den Den Mushi. Teach was discussing the possibility of recruiting Kuzan to join their crew, but Burgess stated that the former admiral cannot be trusted. When Luffy stopped by, Burgess handed the Den Den Mushi to him, allowing him to speak to Blackbeard. When Luffy declared that he would not allow the Blackbeard Pirates to get Ace's power, Burgess merely laughed."}, {"type": "paragraph", "text": "After Rebecca won Block D, Burgess looked forward for the finals."}, {"type": "paragraph", "text": "He later entered the arena alongside Lucy (now Sabo), Bartolomeo, Rebecca, and Diamante. After Diamante explained the rules of this round, a five-person battle royale commenced."}, {"type": "paragraph", "text": "A fighting fish attacked Burgess, but he easily repelled it and sent it flying towards the audience. He later clashed against Lucy, who managed to break the armor around his right arm."}, {"type": "paragraph", "text": "Despite that setback, Burgess continued to engage Lucy in heated combat, causing more damage to the colosseum in the process."}, {"type": "paragraph", "text": "During the time the toys in the audience transformed back into their original forms, Burgess was surprised when Lucy demolished the entire arena with his bare hands."}, {"type": "paragraph", "text": "After Lucy acquired the power of the Mera Mera no Mi and destroyed the arena, Burgess fell into the underground trade port. Burgess then noticed that Lucy was not Luffy and was frustrated that he lost the Devil Fruit."}, {"type": "paragraph", "text": "Burgess was then seen on top of the royal palace during the final battle between Luffy and Doflamingo. Burgess watched as the events unfold while wondering what to do next."}, {"type": "paragraph", "text": "After Luffy's Gear Fourth wore off, Burgess took an opportunity to attempt to kill Luffy for the Gomu Gomu no Mi. He jumped down from the palace and pursued him. Before he could strike Luffy, Sabo intercepted him."}, {"type": "paragraph", "text": "Sabo then informed him of his relationship to Luffy and Burgess realized that Sabo was the Lucy who fought in the colosseum final after Sabo revealed he ate the Mera Mera no Mi. With Sabo standing in his way, Burgess decided to take his Devil Fruit power and the two subsequently clashed."}, {"type": "paragraph", "text": "Despite his efforts, Burgess was eventually defeated by Sabo. As the revolutionary was leaving, Burgess asked him if he was going to kill him. Sabo replied that there was no point in doing so. However, Burgess goaded Sabo into staying by telling him what Ace said when he was captured. Burgess mocked the latter for choosing such pathetic words causing Sabo to become angered and grab Burgess' head as the latter continued to spew insults. Burgess then drew a concealed dagger, preparing to kill Sabo for his Devil Fruit. Sabo reprimanded Burgess for his words as Burgess mocked Sabo for not being there to save his brother and attempted to kill him. However, having heard enough, Sabo attacked Burgess with point blank Fire Fist, both burning and sending the screaming Burgess flying."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Jesus_Burgess_Wins_Block_A.png/revision/latest/scale-to-width-down/210?cb=20150823154046", "caption": "Burgess reveals himself to the spectators in the Corrida Colosseum."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Sabo_vs._Burgess.png/revision/latest/scale-to-width-down/210?cb=20150823143352", "caption": "Burgess and Lucy clash."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/de/Burgess_attacks_Luffy.png/revision/latest/scale-to-width-down/210?cb=20160214044651", "caption": "Burgess attempts to kill Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Sabo_defeats_Burgess.png/revision/latest/scale-to-width-down/210?cb=20160818232158", "caption": "Having enraged Sabo, Burgess is defeated by a grievous Fire Fist attack."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After his defeat at the hands of Sabo, a heavily injured Burgess secretly boarded a ship that took him to Baltigo. On the verge of death, he lost conciousness and was unable to tell his crewmates he had left Dressrosa, who came looking for him. After regaining conciousness, he later contacted Shiryu and Laffitte and confirmed the island as the Revolutionary Army's main headquarters, where Dragon and Sabo were currently residing, an island hidden from the world that neither he nor the world knew about. Burgess asked for the crew to come find him and also bring Doc Q to treat his injuries, as he was on the verge of death. He then told them to inform Teach and get the entire crew to attack the island, who would be able to reach him using his Vivre Card. The Blackbeard Pirates later attacked Baltigo, destroying the island by the time the Marines and Cipher Pol arrived, but the Revolutionary Army was able to escape. However, the Blackbeard Pirates fled after briefly clashing with Cipher Pol."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/24/Burgess_Found_the_Revolutionary_Base.png/revision/latest/scale-to-width-down/210?cb=20160807095349", "caption": "Severely wounded, Burgess informs his crew he has found the Revolutionary Army's base."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jesus Burgess and Van Augur vs. Portgas D. Ace", "elements": []}, {"text": "Blackbeard Pirates vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Fleet Admiral Sengoku", "elements": []}, {"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco, unseen)", "elements": []}, {"text": "Jesus Burgess vs. Corrida Colosseum Group A", "elements": []}, {"text": "Corrida Colosseum Finale", "elements": [{"text": "Jesus Burgess vs. Fighting Fish", "elements": []}, {"text": "Jesus Burgess vs. Lucy", "elements": []}]}, {"text": "Jesus Burgess vs. Sabo", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol (unseen)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 4, "content": [{"type": "list", "elements": [{"text": "Jesus Burgess vs. Monkey D. Garp", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "On the original TV Broadcast of the FUNimation dub, Burgess' name was changed to \"G. Zass\", keeping the phonetic pronunciation, but changing the actual spelling."}, {"type": "paragraph", "text": "Upon the release of FUNimation's \"Season Three First Voyage\" DVD set featuring Burgess for the first time, it was confirmed in the Japanese version subtitles and \"Sign and title\" subtitles for the dub that on the uncut DVDs, his name has been restored to \"Jesus Burgess\"."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name resembles that of the real life pirate, Samuel Burgess.", "elements": []}, {"text": "His birthday is on Christmas Day, a reference to his name, \"Jesus\".", "elements": []}, {"text": "When his face is shown unmasked for the first time, it is not seen in full view. This is likely a reference to Luchador culture, as it is considered shameful for a masked wrestler to be unmasked, causing the loss of their character identity/alter ego identity in the ring and their exposure of their true identity.", "elements": []}, {"text": "Of the original five Blackbeard Pirates, he had the lowest bounty at 20,000,000.", "elements": []}, {"text": "Burgess' favorite food is protein.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Lucha Libre – Wikipedia article on the Mexican wrestling style that Burgess uses.", "elements": []}]}], "images": []}]}