{"sections": [{"title": "Doc Q", "level": 1, "content": [{"type": "paragraph", "text": "Doc Q, known as \"Death God\", is the Doctor of the Blackbeard Pirates. Ironically, he has a sick body and needs his horse, Stronger (who is just as sick as he is), to get around."}, {"type": "paragraph", "text": "He is currently one of the Ten Titanic Captains and the captain of the Ninth Ship of the Blackbeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Doc Q, like the rest of his crewmates, is a very large man and is always seen traveling on the back of his horse Stronger, who is, similarly, an unusually large horse. His nose is slightly longer than normal, his face appears always unshaven, and there are straight purple tattoos coming from his hairline to the corners of his eyes. He has long and ash blonde hair, and constantly has a pallid look about him acting as though he is on the verge of death."}, {"type": "paragraph", "text": "He is seen wearing a black fur coat, a wide-brimmed, black beaten hat, and what appears to be a dark white hangman's noose around his neck. He would appear to wear a green turtleneck, and from under his coat sprouts what looks to be a brown robe, under which his hairy legs are visible. He has black, large-buckled shoes. On his back he carries a long, cylindrical bag, in which he keeps his scythe. His overall appearance resembles that of a stereotypical undertaker from Western fictions. Also, his pale skin, rather thin body, dark clothing, and use of a scythe is very similar to the typical Western image of a Grim Reaper; befitting of his epithet."}, {"type": "paragraph", "text": "As he is by his own admission very sick, this trait often shows on his expressions, as he commonly shows some level of pain and exhaustion, and sometimes stops during the middle of his sentences to cough. His chronic sickness is severe enough that he even has a gruesome tendency to bleed from his mouth. Despite these health problems, he also displays occasional smiles on matters he finds impressive."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like the rest of his crew, Doc Q believes heavily in fate, although their views seem to center more on the belief of fortune and misfortune. Q seems to note when people are lucky or unlucky, and praises those with luck, while \"pitying\" the unlucky ones. However, he is not above changing his opinion should the circumstances prove otherwise, as seen when he notes Luffy to be \"lucky\" despite deeming him out of luck when Teach decided to target the Straw Hats. He is well-aware of his ailing body, but accepts it and even laughs about it."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Despite Doc Q being chronically ill from a terminal disease, he is a very powerful pirate, having earned his place in the Blackbeard Pirates' high standard for powerful individuals. After Blackbeard became a Yonko, Doc Q was promoted to the captain of the Blackbeard Pirates' ninth ship, granting him authority over all lower-ranking members."}], "images": []}, {"title": "Medical Expertise", "level": 3, "content": [{"type": "paragraph", "text": "As the doctor of the crew, Doc Q has the medical skills to help them. When Jesus Burgess suffered massive amount of injuries from Sabo's Mera Mera no Mi, he gave specific instructions to Shiryu and Laffitte to bring Doc Q to treat him. Doc Q seems to be a skilled chemist as he developed an explosive solutions he infused inside apples that will explode in one bite. He can trick ignorant bystanders into eating his apples and should they pick one with the explosive, they explode in a gruesome manner."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Despite being stricken with a fatal chronic disease since childhood, Doc Q has formidable superhuman physical prowess as seen—along with Burgess—Doc Q could paddle their raft with fairly large paddles and is able to keep up pace with Burgess, a man with titanic strength. At the Battle of Marineford, Doc Q was able to brutally injure Whitebeard with his scythe, causing him to shed copious amount of blood. He wields his large scythe with only one arm and also attacks consecutively with great speed. In fact, as Blackbeard refuses to accept any weaklings into his crew—going so far as to reject Super Rookie Jewelry Bonney with a bounty of 140,000,000 is a further testament to Doc Q's fighting prowess."}, {"type": "paragraph", "text": "Despite his chronic illness, he has also shown himself to have extraordinary endurance. He withstood a Gura Gura no Mi shock wave from Whitebeard (albeit not a direct hit), and later took a direct hit from Sengoku's shockwave in Buddha form, then standing up with only a small amount of trouble. In fact, not only did Doc Q managed to survive into adulthood while stricken with the chronic illness that is debilitating enough to cause him to frequently cough blood, he survived being exposed to Magellan's deadly venom long enough for Shiryu to administer the antidote, an incredible feat given his extremely sickly constitution compared to other members of the Blackbeard Pirates."}], "images": []}, {"title": "Horsemanship", "level": 3, "content": [{"type": "paragraph", "text": "Doc Q mainly relies on his horse Stronger for transportation due to him being too sickly to walk on his own. At Marineford, Doc Q rode on his horse during the Blackbeard Pirates's simultaneous assault on Whitebeard. In the anime, he moved with incredible speed and maneuverability, being the second to land a hit on Whitebeard after Shiryu."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Doc Q wields a double-bladed scythe, which he used to attack Whitebeard at the Battle of Marineford."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f0/Doc_Q%27s_Scythe.png/revision/latest/scale-to-width-down/180?cb=20110130032106", "caption": "Doc Q's double-sided scythe."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Not much is known of Doc Q's past, but according to himself, he was born chronically very ill. Some time after joining Blackbeard's crew, Doc Q and the entire crew attacked Drum Island forcing the cowardly King Wapol to flee."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "He meets Luffy, Zoro, and Nami during the Jaya Arc, while in Mock Town. After the Straw Hats help him get back on his horse, he offers Luffy an apple from the basket he is carrying. Unbeknownst to Luffy, Doc Q had been offering explosive apples to other pirates in Mock Town, who would then explode once they ate it. Luckily for Luffy, he picks a dud, and Doc Q tells him he is very lucky before riding off. Strangely, he is seen rowing on Blackbeard's ship, even though his body is supposedly sick and weak."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "While plundering a town on Banaro Island, Van Augur read about the incident with the Straw Hats at Enies Lobby. Laffitte mentioned the Sea Train and the fact that Water 7 was nearby. Doc Q then agreed that the Straw Hat Pirates were an unlucky bunch. This would later be proven false by the sudden arrival of Ace."}, {"type": "paragraph", "text": "Later on, he and the rest of his crew stood on the side lines while watching the fight between Blackbeard and Ace."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "While Luffy was rioting in Level 4, Doc Q arrived at Impel Down along with his captain and crew. They had shown obvious hostility and had forced their way into the great prison. Their objective in visiting the prison uninvited appeared to have been to get strong crew members from Level 6, which Blackbeard said that it was something that would shake the world to its core. While Blackbeard was talking to Luffy, Doc Q stated that Luffy was a very lucky kid."}, {"type": "paragraph", "text": "After exchanging words with Impel Down's mass breakout army, Doc Q and the rest of the crew were caught and poisoned by Magellan's Hydra technique. Later, the whole crew was saved by an antidote given by former Chief Guard Shiryu, who accepted Blackbeard's offer and joined their crew."}, {"type": "paragraph", "text": "The crew then went to Level 6, where they had the inmates fight to the death to see who was worthy of joining them."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Doc Q and his horse Stronger are spotted along with the other members of the Blackbeard Pirates on the execution platform where they were watching the events that unfold on the battlefield. Currently he and the others came to Marineford because they wanted to witness Whitebeard's death. He then joined his crew in striking Whitebeard, slashing him with his double-bladed scythe."}, {"type": "paragraph", "text": "After Whitebeard dies, Doc Q assists his fellow crewmates in covering Whitebeard's body in a black cloth and guards Blackbeard as he begins to demonstrate his powers. Doc Q and the other Blackbeard Pirates are then attacked by a shockwave created by Sengoku in his Buddha form. He later leaves with the crew when Shanks arrives at Marineford."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Stronger_Anime_Infobox.png/revision/latest/scale-to-width-down/180?cb=20130512050437", "caption": "Doc Q and Stronger at Marineford."}]}, {"title": "Post War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Weeks later, the crew makes their move in the New World, taking out Jewelry Bonney in the process. While the crew is seen bickering amongst each other, Doc Q speaks of heavenly gods and destiny. The Blackbeard Pirates' raft was brought close to the point of destruction, due to Sanjuan Wolf's size, and they seemingly got in contact with the Marines, to trade Jewelry Bonney for a battle ship. The crew is alerted by Van Augur that the battle ship has arrived, but not for trade because Akainu is on board. Knowing that the deal will not happen, the Blackbeard Pirates flee, leaving Bonney and her crew behind to be arrested."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "The Blackbeard Pirates used their captain's knowledge of Whitebeard's former territory to conquer it. Now that Blackbeard has become a Yonko, the Blackbeard Pirates are hunting down powerful Devil Fruit users in order to absorb their abilities."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates later attacked Baltigo, the Revolutionary Army's headquarters. Baltigo was destroyed by the time the Marines and Cipher Pol arrived, but the Revolutionary Army was able to escape. However, the Blackbeard Pirates fled after briefly clashing with Cipher Pol."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events at Totto Land, he was seen listening to his Admirals's comments about Luffy being too soon to be called a Yonko."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Blackbeard Pirates vs. Drum Kingdom", "elements": []}, {"text": "Blackbeard Pirates vs. Impel Down Guards (Level 1)", "elements": []}, {"text": "Doc Q vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Fleet Admiral Sengoku", "elements": []}, {"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco, unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol (unseen)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Doc Q shares several similarities to the fourth horseman, \"Death\", of the biblical figures \"The Four Horsemen of the Apocalypse\" mentioned in Christianity. In many illustrations of what \"Death\" may look like, he is described as a gaunt figure who rides a sickly and pale (or gray) horse while wielding a scythe much like the grim reaper.", "elements": []}, {"text": "Out of the original five members of the Blackbeard Pirates, Doc Q had the highest bounty of at least 72,000,000. ", "elements": []}, {"text": "Doc Q's favorite food are apples without bombs inside. ", "elements": []}]}], "images": []}]}