{"sections": [{"title": "Ronse", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Ronse is a Marine vice admiral who is also part of the Giant Squad."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ronse is a giant who wears what appears to be a medieval helmet with a T-shaped visor, and has long dark hair. His Marine coat is white with red wrist cuffs and a pair of steel pads that are positioned on his shoulders. Beneath this, he wears a gray suit with brown pants and a lighter gray shirt beneath the suit. Around his waist, he wears a gigantic fur belt that seems to be where he sheathes his battle-axe. Ronse's face was briefly shown when Whitebeard shattered his helmet with a quake bubble, but it was barely visible for the few seconds it was seen."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Ronse has a strong sense of justice. He also has a lot of confidence in himself and his abilities, since he charged Whitebeard directly by himself. It is unknown whether he believes in moral justice or absolute justice."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Ronse has command over lower-ranking subordinates of the Marines. Battle-wise, Ronse is a giant, which grants him strength and endurance that is several times greater than that of an average human."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Vista_vs._Ronse.png/revision/latest/scale-to-width-down/230?cb=20160130163612", "caption": "Ronse vs. Vista and other pirates."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Ronse uses a giant battle-axe to fight. However, during the war Whitebeard destroyed it with his Earthquake powers."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Ronse can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was seen standing guard in front of the execution platform alongside Vice Admiral Lacroix and the other members of the Giant Squad when Sengoku told the world of Ace's past. He was later seen with the rest of the Giant Squad. When the Whitebeard Pirates and their allies invaded Marineford to rescue Ace, he took part in the fighting."}, {"type": "paragraph", "text": "After Oars Jr.'s defeat by Bartholomew Kuma, he launched a surprise attack at Whitebeard, who easily defeated Ronse with an empowered punch, which shattered his helmet, and threw him off to the side."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Whitebeard_Defeats_Ronse.png/revision/latest/scale-to-width-down/230?cb=20141206092109", "caption": "Ronse being easily defeated by Whitebeard."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ronse vs. Vista and other pirates", "elements": []}, {"text": "Ronse vs. Whitebeard", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Giant Squad vs. Little Oars Jr.", "elements": []}, {"text": "Ronse vs. Z", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 550 and Episode 459, Ronse makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 208), Ronse's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 and Episode 511, Dr. Fishbonen states Haki is a power all the vice admirals use.", "elements": []}]}], "images": []}]}