{"sections": [{"title": "Laffitte", "level": 1, "content": [{"type": "paragraph", "text": "Laffitte, nicknamed \"Demon Sheriff\", is the navigator, one of the Ten Titanic Captains, and the captain of the Fifth Ship of the Blackbeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Laffitte is incredibly pale, and tap dances while he walks because of his shoes (though his black tap dancing shoes do not seem to affect his stealthiness). He is also very tall, as much so as the majority of his crewmates, and slim. He wears an off-white collared long-sleeve shirt patterned with yellow crosses and navy jumper pants. His most distinguishing accessories are his classic black top hat and red wooden cane, with which he also wears a pair of gold hoop earrings. His lips are abnormally dark red."}, {"type": "paragraph", "text": "After becoming the captain of the 5th fleet, he added a new black (white in the anime) cape with feathered collar to his attire."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He lived in West Blue and worked as a sheriff, but was exiled because he was excessively cruel and violent. In contradiction to his past, Laffitte now seems to be a calm and cheerful individual that is constantly smiling. He has rarely show the cruelty of his past, and he apparently did not attempt to assist in fighting alongside his crew when Portgas D. Ace attacked, whistling as he ran away with the rest of the crew to a safe watching distance."}, {"type": "paragraph", "text": "When Teach ordered his crew to attack, Lafitte gleefully smiled as shot Whitebeard to death, and also when Teach used his new found Gura Gura no Mi to wretched havoc on the already devastated Marineford as Teach taunted the Marines"}, {"type": "paragraph", "text": "Despite being a malevolent pirate, Laffite has an extremely refined and sophisticated personality, always speaking in a polite and courteous manner even when threatening people such Avalo Pizarro for wanting to replace Teach as captain. He also reprimanded Burgess for his habit of referring Teach as \"captain\" instead of \"admiral\"."}, {"type": "paragraph", "text": "Like the rest of the Blackbeard Pirates, Laffitte believes strongly in luck, fate, and dreams."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Laffitte seems to be very loyal to his captain Marshall D. Teach, as seen when he jokingly threatened to kill Avalo Pizarro who suggested he should replace Teach as captain of the crew, or when he had to keep reminding Burgess that he should address Teach as \"admiral\" instead of \"captain\"."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Prior to capturing Portgas D. Ace on Banaro Island, the Blackbeard Pirates had an interest in capturing Luffy and his crew on two occasions."}], "images": []}, {"title": "Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "As part of Blackbeard's crew, Laffitte is an enemy of the Whitebeard Pirates. During the war at Marineford, Laffitte and his comrades dealt the deathblow to Whitebeard together."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Combat Prowess", "level": 3, "content": [{"type": "paragraph", "text": "After the time-skip, he is officially the Captain of the Blackbeard Pirates 5th fleet/ship and part of a group of Ten Titanic Captains that personally guard the Yonko, Blackbeard."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Laffitte seems to have eaten a Devil Fruit that allows him to obtain wings and fly. He showed his ability when the Blackbeard Pirates invaded Impel Down."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/de/Laffitte%27s_Wings.png/revision/latest/scale-to-width-down/300?cb=20190414144915", "caption": "Laffitte using angel-like wings to fly."}]}, {"title": "Stealth Master", "level": 3, "content": [{"type": "paragraph", "text": "Laffitte is skilled in infiltration. When he traveled to Mary Geoise, he easily bypassed all the security defenses of the sacred land of the World Government and joined in the meeting for the Shichibukai nomination. Later at Marineford, before the Blackbeard Pirates sailed to Impel Down, Laffitte infiltrated the control room to hypnotize the Marines without anyone knowing."}], "images": []}, {"title": "Navigational Skills", "level": 3, "content": [{"type": "paragraph", "text": "As a navigator, Laffitte guides the rest of the Blackbeard Pirates through the open seas. His level of navigational skills are as of yet unknown, though it is expected he is a significantly skilled navigator to navigate through the Grand Line including the seas of the New World. Interestingly enough, despite his occupation, he is not seen wearing a Log Pose, which is essential for navigating in the Grand Line."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Laffitte has been shown to possess a large amount of endurance by being able to continue fighting even after taking one of Whitebeard's Gura Gura no Mi shockwaves (albeit not a direct hit) and Fleet Admiral Sengoku's shockwaves with the rest of the Blackbeard Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Laffitte carries a cane that he spins to accompany his tap-dancing from time to time; it is yet unknown if it can be used as a weapon. Laffitte was using a pistol when he helped to murder Whitebeard. He was also seen holding it while keeping Marine soldiers away from Blackbeard."}], "images": []}, {"title": "Miscellaneous Skills", "level": 3, "content": [{"type": "paragraph", "text": "Aside from his navigation, Laffitte demonstrated several other abilities. He is able to move in a similar fashion to the Soru technique as shown in Blackbeard's fight with Ace. It was stated during the Marineford Arc that he was able to hypnotize marines to open the Gates of Justice for them."}, {"type": "paragraph", "text": "As a former sheriff, Laffitte had authority and power over citizens. However, due to his cruelty, he lost this authority when he was exiled. He infiltrated Mary Geoise and bypassed detection from several high ranking Marines and Shichibukai while wearing tap shoes (anime-only feature), until he intentionally made his presence noticed."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He used to be a sheriff in West Blue, but he became a pirate after being removed from the police force and exiled from West Blue for being excessively violent and unnecessarily cruel. He was eventually invited to join the Blackbeard Pirates as the navigator. Some time after joining Blackbeard's crew, Laffitte and the entire crew attacked Drum Island forcing the cowardly King Wapol to flee."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "While the rest of the crew went to Jaya, Laffitte traveled to Mary Geoise, where he made his way unnoticed and uninvited to a high-story window and interrupted a meeting between the Shichibukai and high-ranking Marine officials. He politely requested to take part in the meeting, which was being held to determine a new Shichibukai to fill the position that was previously Crocodile's, and nominated his own captain, Blackbeard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Laffitte_meeting_Mariejoa.png/revision/latest/scale-to-width-down/200?cb=20110123212108", "caption": "Laffitte sneaks into the meeting in Mary Geoise."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Laffitte was looting a town that his crew had just ransacked on Banaro Island, when Portgas D. Ace finally caught up to Blackbeard, three days before the Straw Hats' new bounties were released following the Enies Lobby incident. Mainly, he acted as a bystander, doing nothing to try to hinder Ace as he attacked, unlike his fellow crewmates Van Augur and Jesus Burgess."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates sailed to Impel Down and Laffitte hypnotized the guards at the Gates of Justice to open for all battleships."}, {"type": "paragraph", "text": "While Monkey D. Luffy was rioting on Level 4 on his way back out of the prison, the Blackbeard Pirates arrived at Impel Down. They forced their way into the great prison with obvious hostility. As they made their way through Level 1, they encountered former Head Jailer Shiryu, and then made their way down to Level 4, where they encountered the escaping prisoners."}, {"type": "paragraph", "text": "Laffitte stood by as Blackbeard and Luffy briefly fought. After exchanging words with the prisoners, the Blackbeard Pirates continued on their way to the lower levels and confronted Chief Warden Magellan, who poisoned them with his Hydra technique. Later, the whole crew was saved by an antidote from Shiryu, who accepted Blackbeard's offer and joined their crew."}, {"type": "paragraph", "text": "When they reached Level 6, the Blackbeard Pirates had the prisoners fight to the death with the survivors joining the crew."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Laffitte was spotted along with the other members of the Blackbeard Pirates, new and old, on the execution platform where they arrived to watch the events unfold on the battlefield. Blackbeard, who had apparently brought his crew back to Marineford so that he could witness Whitebeard's death, exclaimed that he was happy to have arrived in time to do so. Laffitte revealed to Sengoku that he hypnotized the Marines in the control room of the Gates of Justice. After Blackbeard confronted Whitebeard, the Blackbeard Pirates struck down Whitebeard."}, {"type": "paragraph", "text": "After Whitebeard died, Laffitte assisted his crewmates in covering Whitebeard with a black cloth and guarded Blackbeard as he started to demonstrate his powers. He warned the marines that there was no entry. When Blackbeard later emerged and demonstrated the power of the Gura Gura no Mi, Laffitte laughed at the confusion it caused amongst their enemies."}, {"type": "paragraph", "text": "Sengoku in his Buddha form then attacked the Blackbeard Pirates, blasting them with shockwaves. While Blackbeard fought against Sengoku and Monkey D. Garp, Red-Haired Shanks arrived on the battlefield. The Blackbeard Pirates decided to leave rather than fight the Red Haired Pirates."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "The crew made their move in the New World, taking out Jewelry Bonney in the process. The crew was seen bickering amongst each other. Avalo Pizarro tried to declare himself the captain, but Laffitte threatened to kill him and reminded him that they are the \"Blackbeard Pirates\". Blackbeard Pirates' raft was brought close to the point of destruction, due to Sanjuan Wolf's size, and they seemingly got in contact with the Marines, to trade Jewelry Bonney for a battle ship. Van Augur alerted Teach that the battle ship had arrived, but not for trade because Akainu was on board. Knowing that the deal would not happen, the Blackbeard Pirates fled, leaving Bonney and her crew behind to be arrested."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "The Blackbeard Pirates used their captain's knowledge of Whitebeard's former territory to conquer it. Now that Blackbeard has become a Yonko, the Blackbeard Pirates are hunting down powerful Devil Fruit users in order to absorb their abilities. Laffitte eventually assumed command of the Blackbeard Pirate's fifth ship earning the nickname \"Demon Sheriff\"."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat, the Blackbeard Pirates stopped by Dressrosa but were unable to find Burgess. At a certain sea in the New World, Laffitte and Shiryu were contacted by Burgess via Den Den Mushi. Burgess informed them that he stowed away on a ship that led him to the revolutionaries' base on Baltigo, and Laffitte had to remind Burgess that \"Captain Teach\" now went by the name \"Admiral Teach\". Burgess requested Doc Q's help, as he had been critically wounded by Sabo. He then told them to inform Teach and get the Blackbeard Pirates to attack the island. The Blackbeard Pirates later attacked Baltigo, destroying the island by the time the Marines and Cipher Pol arrived, but the Revolutionary Army was able to escape. However, the Blackbeard Pirates fled after briefly clashing with Cipher Pol."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/40/Laffitte_Post-Timeskip.png/revision/latest/scale-to-width-down/210?cb=20160807120136", "caption": "Laffitte speaks with Burgess over a Den Den Mushi."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Blackbeard Pirates vs. Drum Kingdom", "elements": []}, {"text": "Blackbeard Pirates vs. Impel Down Guards (Level 1)", "elements": []}, {"text": "Blackbeard Pirates vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Fleet Admiral Sengoku", "elements": []}, {"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco, unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol (unseen)", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the edited for TV FUNimation dub, his name is pronounced with an \"R\" as \"Raffit\". On the uncut DVDs however, his name is pronounced with an \"L\" and is spelled \"Lafitte\" in the subs."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name echoes that of Jean Lafitte, a famous real-life pirate.", "elements": []}, {"text": "His wide open eyes and ability to move silently are similar to owls, as well as his wings and overall face. He shares this theme with Fukurou.", "elements": []}, {"text": "In the anime, he was first depicted as a average-size man, smaller than the rest of his crew. This mistake was not corrected during the battle between Blackbeard and Ace in Banaro Island, even when it was clear in the manga that he was as tall as his crew members. Only in the invasion of Impel Down and Battle of Marineford was his size accurately depicted in the anime.", "elements": []}, {"text": "Laffitte's hair was drawn differently in his first appearance. In his debut, his hair seemed slightly shorter and was somewhat unkempt at the end, but in his second appearance it is completely straight.", "elements": []}, {"text": "Laffitte's favorite food is lollipop candy.", "elements": []}]}], "images": []}]}