{"sections": [{"title": "Brogy", "level": 1, "content": [{"type": "paragraph", "text": "Brogy the Red Ogre is one of the two former captains of the Giant Warrior Pirates from Elbaf. It is from his pirate life that he earned a bounty of 100,000,000."}, {"type": "paragraph", "text": "He is an ally of the Straw Hat Pirates during the Little Garden Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Brogy is a giant who dresses in a Viking costume, which consists of a red overall with golden button straps, fur linings, a leather strap around his right shoulder and another as a belt, yellow pants with black stripes and fur linings at the bottom, yellow shoes, and a red helmet with two horns. Brogy has a blond beard shaped like an axe's blade, beady eyes, a wide grin, and a pig-like nose."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like Dorry, Brogy is a good natured giant, however, his pride can sometimes get the best of him. He is a firm believer of the customs of fighting from his homeland and follows them with much honor. He would follow these even if he were severely wounded. Despite seemingly defeating Dorry after so long, Brogy did not feel any happiness when he sensed something was wrong during their battle that Mr. 3 interfered with."}, {"type": "paragraph", "text": "Brogy has his own unique laugh: \"Gaba\" (i.e. Gababababababa!)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Brogy has a bounty of 100,000,000 on his head, an indication of his danger. Moreover, like other giants, he possesses superhuman strength and resistance. However, having been one of the two captains of the Giant Warrior Pirates, he was extremely strong even compared to the other individuals of his race and had authority over one of the strongest crews in the world. As a demonstration of his strength, he fought on a par with Dorry for a hundred years and together with the latter he managed to defeat such great creatures that not even the other giants of their crew would have been able to capture. The strength of the two giants is in fact such that Galdino, a member of Baroque Works who is capable of defeating a pirate with a bounty of 42,000,000, said he could in no way defeat them without resorting to deception, even with the help from Miss Golden Week, Mr. 5 and Miss Valentine."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Brogy is also capable of easily killing the dinosaurs of Little Garden, prey he hunts daily, even remaining virtually impassive to their bite. Together with Dorry he also managed to pierce the Island Eater, despite the great distance that separated them. Even Luffy, after seeing them perform this feat, stated that the two were monstrously powerful."}, {"type": "paragraph", "text": "Brogy's strength is also such as to allow him to free himself from Galdino's wax, despite being as hard as steel."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In combat, Brogy used a shield and a battle axe called the Bruiser Axe. With it he can lauch a Flying Slash Attack, powerful enough to kill the Island Eater. However, after a hundred years of battle, the blade lost its sharpness and eventually broke."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Brogy, along with Dorry, were once two of the most feared pirates in the world as no one could bring them down. One day on a hunting trip, each had slayed a massive sea king. Then, while they were celebrating their great catch, a little girl asked them both which sea king was bigger. They could not agree on which one was bigger, so, as per the rules of Elbaf, they started to duel on Little Garden."}], "images": []}, {"title": "Little Garden Arc", "level": 3, "content": [{"type": "paragraph", "text": "One hundred years passed and their sea kings corpses turned to bones. They continued the battle every time the volcano on the island exploded, the duel always ending in a draw."}, {"type": "paragraph", "text": "One day the Straw Hat Pirates arrived on the island on their way to Alabasta with Vivi. After Luffy and Vivi went to explore, and Sanji and Zoro went to find food, Nami and Usopp were left on the Going Merry to fend for themselves. Meanwhile Brogy was exploring and came across the Going Merry and scared Nami and Usopp half to death. Nami and Usopp thought Brogy was going to eat them but he just wanted some alcohol, which they gave him. As a dinosaur stumbled upon them, Brogy sliced it's head off frightening Nami and Usopp further, who then played dead, only Brogy thought they had fainted."}, {"type": "paragraph", "text": "He then brought them to his home and started cooking for himself. Usopp and Nami panicked and ran away when he wasn't looking and ended up being chased by other carnivorous animals. They were saved by Brogy, who in turn provided them a large amount of dinosaur meat, but Usopp and Nami, who were still scared, tried to wait it out until the Log Pose set but soon found out that it would take a whole year for the log to lock onto the next island."}, {"type": "paragraph", "text": "After the volcano exploded, Brogy and Dorry go to fight each other. After yet another tie, the two giants return to their camps to relax and recuperate. Elsewhere, Dorry is defeated due to the injuries he had suffered from a bomb explosion that was hidden in rum he was consuming. Brogy fights Dorry and defeats him. He rejoices in victory after years of fighting. Mr. 3 appears and calls out to Brogy that he was the one who helped him to defeat Dorry. Brogy moved to attack Mr. 3 but is suddenly held captive by Mr. 3's wax which has immobilized his feet."}, {"type": "paragraph", "text": "Soon, Luffy arrived and battled the Baroque Works agents to free Brogy and the Straw Hats."}, {"type": "paragraph", "text": "Later, Brogy learns that Dorry survived from that fatal blow. Dorry believes that their weapons have grown old and weak over the years and are now unable to cause fatal blows. The duo is reminded of why they began their battle and head to the ocean to bid their new friends, the Straw Hats, adieu. They warn them to continue heading straight, no matter what as the crew disembarks from the isle with their newly obtained Log Pose for Alabasta."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Dorry_vs._Brogy.png/revision/latest/scale-to-width-down/250?cb=20160117175814", "caption": "Another one of Brogy and Dorry´s ties."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Brogy is still dueling it out with Dorry on Little Garden with no end in sight. Newspapers are seen flying in the background, suggesting that they have read about the Straw Hats' return."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Dorry_And_Brogy_Two_Years_Later.png/revision/latest/scale-to-width-down/225?cb=20131022030524", "caption": "Brogy and Dorry continue their duel."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Brogy vs. Dorry (at least 73,467 times)", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "So far, Oda has provided two versions of his name: Brogy was seen in the manga and later Burogy appeared in the databooks."}, {"type": "paragraph", "text": "They are edited out in the English dub, by 4Kids Entertainment, along with the entire Little Garden story arc. However, in the made-for-U.S. game One Piece: Grand Adventure, Brogy replaced Big Pan in the Davy Back Fight stage, which was renamed to a generic pirate ship."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Burning Blood (with Dorry)", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In One Piece Color Walk 2, Brogy's height was given as around 1020 cm. This is most likely incorrect, as Oda later stated in an SBS that the minimum height for a giant is 12 meters.", "elements": []}]}], "images": []}]}