{"sections": [{"title": "Dorry", "level": 1, "content": [{"type": "paragraph", "text": "Dorry the Blue Ogre is one of the two former captains of the Giant Warrior Pirates from Elbaf. It is from his pirate life that he earned a bounty of 100,000,000."}, {"type": "paragraph", "text": "He is an ally of the Straw Hat Pirates during the Little Garden Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dorry is a well-built giant with a long beard. He generally dresses in a viking attire with a helmet that goes over his eyes. He is so large that Luffy can fit in the palm of his hand. He is 160 years old, which means that he is a giant in the prime of his life."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Dorry is a good-natured giant, however, his pride can sometimes get the best of him. He is a firm believer of the customs of fighting from his homeland and follows them with much honor. He would follow these even if he were severely wounded. He did rush into his conclusion that Luffy was the one who planted a bomb into his drink, seeing he and Vivi were the only ones there (to his knowledge, at least)."}, {"type": "paragraph", "text": "Like many characters in One Piece, Dorry has a unique laugh, starting his with \"Gegya\" (i.e. Gegyagyagyagya!)."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Brogy", "level": 3, "content": [{"type": "paragraph", "text": "Dorry is Brogy's best friend. However because of the argument they had 100 years ago, they were engaged in a life and death battle against each other as per their homeland's customs. Despite this however, they are still the best of friends and deeply respect each other. Dorry and Brogy's competitive relationship with one another is comparable to that of Zoro and Sanji."}], "images": []}, {"title": "Monkey D. Luffy", "level": 3, "content": [{"type": "paragraph", "text": "Dorry instantly struck up a friendship with Luffy as well, after Luffy was eaten by a dinosaur and Dorry saved him. They had a relationship as strong as that of two old friends. Luffy took great delight in learning of his daily battles with Broggy, and the ever-present mutual respect the two giants had for one another. Their relationship was briefly soured when Dorry suffered an internal explosion after drinking alcohol that was given to him. Knowing Broggy would never sabotage their duel and seeing no other potential culprits, Dorry presumes the Straw Hats responsible. He and Luffy come to blows, as Luffy realizes he has to calm the giant warrior down. After observing Luffy's dedication to keeping him out of an unfair duel, Dorry realizes the Straw Hats are innocent and reconciles with the young captain. Despite this, he still goes off to fight Broggy in his condition, much to Luffy's protests. When the battle is further sabotaged by Mr. 3, Luffy makes a point to punish the Baroque Works agent severely for ruining the integrity of the giant's duel."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Dorry has a bounty of 100,000,000 on his head, an indication of his danger. Moreover, like other giants, he possesses superhuman strength and resistance. However, having been one of the two captains of the Giant Warrior Pirates, he was extremely strong even compared to the other individuals of his race and had authority over one of the strongest crews in the world. As a demonstration of his strength, he fought on a par with Brogy for a hundred years and together with the latter he managed to defeat such great creatures that not even the other giants of their crew would have been able to capture. The strength of the two giants is in fact such that Galdino, a member of Baroque Works who is capable of defeating a pirate with a bounty of 42,000,000, said he could in no way defeat them without resorting to deception, even with the help from Miss Golden Week, Mr. 5 and Miss Valentine."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Dorry is also capable of easily killing the dinosaurs of Little Garden, prey he hunts daily. Together with Brogy he also managed to pierce the Island Eater, despite the great distance that separated them. Even Luffy, after seeing them perform this feat, stated that the two were monstrously powerful."}, {"type": "paragraph", "text": "Dorry also survived a barrel of liquor that exploded inside his stomach, and still managed to fight Luffy. The latter also, when Dorry intended to fight him and Vivi ran away, stated that it would have made no sense to run away in front of an opponent like him. Dorry's defeat by Luffy's hand is in fact partly to be attributed to the serious conditions in which the giant was living, as well as the fact that the latter had underestimated the pirate. Later, despite all the injuries he suffered, also managed to immobilize Luffy himself and fight with Brogy, eventually being defeated by the latter only because of Galdino, who with his powers had benefited his rival."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Dorry fights with a shield and a long sword named the Terry Sword. With it he can lauch a Flying Slash Attack, powerful enough to kill the Island Eater. However, after a hundred years of battle, the blade lost its sharpness and eventually broke."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Little Garden Arc", "level": 3, "content": [{"type": "paragraph", "text": "Mr. 3 revealed that Dorry had been one of the two leaders in the Giant Pirate crew. Their crew was one of the fiercest in the world, as the crew was composed of Giants."}, {"type": "paragraph", "text": "His life as a pirate ended when he entered a contest of honor with his fellow captain Brogy over the size of the fish the two caught. It was revealed in a flashback that a little girl had asked which one had been bigger. Brogy and Dorry went to the isolated island of Little Garden to settle the feud with a duel, and have been doing so for the past 100 years."}, {"type": "paragraph", "text": "When the Straw Hat Pirates came to the island, Dorry hung out with Luffy, Vivi, and Karoo. When he was drinking rum that was given to him, an explosion occurred inside his stomach. He believe the bomb was placed there by the Straw Hats and began to attack Luffy. However, Luffy was able to subdue the giant and he accepted the Straw Hats were not responsible for the sabotage. The volcano erupted and he was barely able to stand, yet, he trudged forward to battle Brogy despite his new bomb induced injuries, but not before trapping Luffy under the skeleton of a giant Sea King, in order to prevent him from interfering. With a little extra sabotage of Mr. 3, Dorry lost the duel."}, {"type": "paragraph", "text": "Presumed dead at first, Dorry regained consciousness some time after the battle with Mr. 3 and he and Brogy embraced, both glad to be alive. Dorry believed he survived the blow as their weapons have grown old and too weak to cause serious harm. Dorry and Brogy then gave the Straw Hats a special farewell by blasting them through a legendary giant fish that blocked their way."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Dorry_vs._Brogy.png/revision/latest/scale-to-width-down/240?cb=20160117175814", "caption": "Another one of Brogy and Dorry's ties."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Dorry is still dueling it out with Brogy on Little Garden with no end in sight. Newspapers are seen flying in the background, suggesting that they have read about the Straw Hats' return."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Dorry_And_Brogy_Two_Years_Later.png/revision/latest/scale-to-width-down/225?cb=20131022030524", "caption": "Dorry and Brogy continue their duel."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "So far, Oda has provided two versions of his name: Dorry was seen in the manga and later Dorey appeared in the data books."}, {"type": "paragraph", "text": "Due to certain reasons, the entire Little Garden Arc was completely skipped in the 4Kids English dub. This created a plot hole as Dorry and Brogy's appearance not only introduced the concept of giants to the entire story, but it was relevant in certain later events concerning Oimo and Kashi."}, {"type": "paragraph", "text": "Also, Dorry was also mistranslated as Dorry the Green Giant, when in fact he is the Blue. This stems from the fact that the kanji used for the word \"Blue\" (青) can also be taken to mean \"Green\", depending on the context."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dorry vs. Brogy (at least 73,467 times)", "elements": []}, {"text": "Dorry vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Burning Blood (with Brogy)", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In One Piece Color Walk 2, Dorry's height was given as 1190 cm. This is most likely incorrect, as Oda later stated in an SBS that the minimum height for a giant is 12 meters.", "elements": []}]}], "images": []}]}