{"sections": [{"title": "Karoo", "level": 1, "content": [{"type": "paragraph", "text": "Karoo is Vivi's pet super spot-billed duck, a fast-footed riding bird (one of the fastest modes of transportation available in Alabasta). Alongside his owner Vivi, Karoo infiltrated the organization known as Baroque Works. With her, he ended up traveling with the Straw Hat Pirates for most of the Alabasta Saga after their cover was blown. He is the leader of the Super Spot-Billed Duck Troops in Alabasta."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Karoo is a large, brown (yellow in the anime) duck. His wings are tipped with black (though this is not always present), as are his tail feathers. As the name implies, he has a spot on his bill. He wears a blue chullo with a white pattern on it and pink goggles with blue lenses. During his travels in Alabasta, he carried a barrel of water around his neck, complete with a straw sticking out of it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Karoo is very loyal to Vivi as well as to her friends, the Straw Hat Pirates. He acts very uniquely, sometimes doing exactly what he is told such as extending one hand, and sometimes doing exactly the opposite such as drinking a large amount of water despite Vivi telling him to conserve his water in the desert."}, {"type": "paragraph", "text": "His role during Vivi's time with the Straw Hat Pirates is mostly that of comic relief, although he does relay valuable information to Chopper from time to time, help Luffy and Usopp to defeat the Baroque Works agents in Little Garden and save Vivi from Mr. 2 Bon Kurei in Alabasta. He is the center of several jokes in the Alabasta arc. At one point he was used as bait for fishing by Luffy and Usopp, much to Vivi's anger and chagrin, and he was mistaken for an ostrich by Sanji."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Nefertari Vivi", "level": 3, "content": [{"type": "paragraph", "text": "Karoo has been the pet and friend of Vivi since the princess's childhood. He has always been attached to her, even joining her in infiltrating Baroque Works. In Alabasta, he shows his love for her by protecting her from the rebels and taking her over to Alubarna."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Straw_Hat_Pirates%2C_Vivi_and_Karoo%27s_Friendship_Mark.png/revision/latest/scale-to-width-down/230?cb=20191102120102", "caption": "Straw Hat Pirates, Vivi and Karoo show their friendship mark."}]}, {"title": "Super Spot-Billed Duck Troops", "level": 3, "content": [{"type": "paragraph", "text": "Karoo is the leader of the Super Spot-Billed Duck Troops. The troops are very loyal to Karoo and Vivi, so much so that they assisted them and the Straw Hats in traveling through the desert, and later in the fight against Baroque Works. The newest member, Matsuge, also helped in the fight against Baroque Works and has been very close with the two ever since, even sometimes seen shopping with them."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "During his adventures with the Straw Hat Pirates, Karoo became fond of them and was proud to share the X mark with them."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Karoo has been shown to have a significant amount of speed and stamina, and the strength to carry a rider for long distances. As a spot-billed duck, a species of incredibly fast runners known to be capable of reaching speeds faster than a leopard, Karoo has proven himself to be a reliable mode of transportation for Vivi, being more than fast enough to get her and himself out of harm's way if need be. As the leader of the Super Spot-Billed Duck Troops, reputed to be the fastest troop in the Kingdom of Alabasta, Karoo's speed is top notch. Karoo also demonstrated extreme endurance and durability when he protected Vivi from a trampling stampede of the Rebel's horses, and had enough strength to later continue carrying Vivi. He subsequently survived being hit by a stray bullet, again showing his tenacity. Despite this, his actual fighting capabilities are negligible. While he was able to successfully defeat Ms. Goldenweek, it was only because she was caught by surprise. Still, Vivi as Miss Wednesday has been shown to engage in combat while riding Karoo, suggesting that the two possess a level of combat teamwork; although the actual effectiveness of the mounted pair was shoddy at best from the lack of coordination they demonstrated against Zoro."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Karoo has been Vivi's friend since childhood and has lived with and grown up with her as her pet, becoming greatly loyal and attached to her. Around this period of time, Karoo became the leader of his own group of spot-billed ducks, which came to be known as the Super Spot-Billed Duck Troops. The group was given the same royal treatment as Karoo as a result of his leadership. Years later, on a quest to save the Alabasta Kingdom, Karoo, along with Vivi and Igaram, infiltrated Baroque Works, a secret crime organization that has been manipulating the people of Alabasta Kingdom. Vivi and Igaram managed to learn the boss's identity, Crocodile, who in turn decided to take action against them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Vivi_and_Karoo_as_Children.png/revision/latest/scale-to-width-down/210?cb=20171002071022", "caption": "Vivi and Karoo when they were very young."}]}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Whisky Peak Arc", "level": 4, "content": [{"type": "paragraph", "text": "In Whisky Peak, Karoo assisted Miss Wednesday (Vivi), Mr. 9, Miss Monday, and Mr. 8 (Igaram) in their fight against Roronoa Zoro. Karoo had trouble following the simplest instructions from Miss Wednesday. Eventually, Zoro defeated the Baroque Works agents. Mr. 5 and Miss Valentine arrived on the scene with orders to eliminate Vivi. Karoo helped Vivi evade the two officer agents until Monkey D. Luffy and Zoro intervened and defeated them. After Vivi accidentally told the Straw Hat Pirates of the boss's identity and Igaram's decoy ship blew up, Karoo quickly fled Cactus Island with Vivi and the pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/Vivi_Rides_Karoo.png/revision/latest/scale-to-width-down/210?cb=20130513044433", "caption": "Vivi rides Karoo as Miss Wednesday while spinning her Peacock Slashers."}]}, {"title": "Little Garden Arc", "level": 4, "content": [{"type": "paragraph", "text": "Following the log pose, the Straw Hats arrived at Little Garden. After disembarking, Karoo and Vivi went with Luffy to explore the island and met a giant named Dorry. After Dorry drank some alcohol that had been tainted with explosives, the giant held Luffy responsible and Karoo quickly left the scene. While running through the jungle, the duck unfortunately ran into Mr. 5 and Miss Valentine. The two officer agents tried to force Karoo to cry for help, but the duck remained silent. They beat Karoo up and dragged him to Dorry's home where Luffy, Usopp, and Vivi were present. After Vivi was abducted, Karoo, Luffy, and Usopp set out to save her."}, {"type": "paragraph", "text": "They later encountered two more Baroque Works agents other than the Mr. 5 pair: Mr. 3 and Miss Goldenweek. They also found Vivi, Zoro, and Nami stuck on Mr. 3's candle set and being turned into wax figures. Karoo and Usopp spend most of the battle running from Mr. 5 and Miss Valentine, but they also helped Luffy break free from Miss Goldenweek's Color Traps. After Usopp figured out how to free Vivi, Zoro, and Nami, he had Karoo run around and wrap Mr. 3's candle set with a rope coated with oil. Luffy then lit the rope with the fire atop of Mr. 3's head, freeing the captives."}, {"type": "paragraph", "text": "Luffy and Karoo went after Mr. 3 and Miss Goldenweek as they were fleeing the scene. After Luffy knocked out Mr. 3, Karoo attacked Miss Goldenweek and quickly defeated her."}, {"type": "paragraph", "text": "After Sanji acquired an eternal pose to Alabasta from the Unluckies, Karoo, Vivi, and the Straw Hats set sail for the desert kingdom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Luffy%2C_Vivi%2C_and_Karoo_Dining_with_Dorry.png/revision/latest/scale-to-width-down/210?cb=20130525215454", "caption": "Karoo, Vivi and Luffy meet and dine with the giant Dorry."}]}, {"title": "Drum Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the journey to Alabasta, Nami suddenly became sick and the crew needed to find a doctor. They disembarked on Drum Island and Zoro and Karoo stayed behind to watch the ship. Zoro took a swim in the cold river to train himself. Karoo, fearing that Zoro would freeze in the river, decided to jump after him but ended up getting frozen in the river himself. After the crew recruited Tony Tony Chopper and returned to the ship, they found the frozen Karoo and defrosted him. Once Chopper translated Karoo's speech on how he ended up like that, Nami smacked Zoro on the head since Zoro was solely responsible for this mishap."}], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "On their way to Alabasta, the Straw Hats were short on food. Luffy and Usopp decided to use Karoo as bait to catch fish much to Vivi's dismay. After passing through a hot spot, Karoo caught Mr. 2 Bon Kurei. After Mr. 2 is picked up by his own ship and crew and leaves, the Straw Hats disembark on Alabasta. Vivi sent Karoo with a message to Alubarna to warn her father. Karoo reached the palace and successfully delivered the message."}, {"type": "paragraph", "text": "As Vivi and the Straw Hats (minus Luffy) make their way to Alubarna, Karoo and the Spot Billed Duck Troops came to their aid and they traveled to the capital. Once they reached the capital, the Straw Hats lured the Baroque Works officer agents away from Vivi. Vivi tried to stop the rebel army, but a dust cloud caused by a Baroque Works agent undercover in the royal army prevented the Rebel Army from seeing her. Karoo covered Vivi preventing her from getting trampled by the rebel army's horses. When Mr. 2 arrived attempting to finish off Vivi, Karoo ran off with her climbing the steep walls of Alubarna, but was still pursued by Mr. 2. However, Mr. 2 was delayed by Sanji, who bought Vivi time to get to the palace. On their way to the palace, Karoo was shot by a stray bullet. The Spot Billed Duck Troops took Karoo to safety while Vivi headed for the castle."}, {"type": "paragraph", "text": "After Crocodile's defeat and the rebellion came to an end, Karoo rested and recovered in the castle with the Straw Hats. When Vivi tearfully declined the offer of joining the Straw Hats, Karoo was there with her bidding farewell to the pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8e/X_Mark_Farewell.png/revision/latest/scale-to-width-down/210?cb=20150203191111", "caption": "Karoo and Vivi saying goodbye to the Straw Hat Pirates with their X Mark."}]}, {"title": "Gedatsu's Accidental Blue-Sea Life", "level": 3, "content": [{"type": "paragraph", "text": "Karoo and the Spot Billed Duck Troops later enjoyed the geothermal baths of Ukkari Hot Spring, owned and operated by Goro (Toto's brother and Koza's uncle)."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Karoo was later seen when the Straw Hats received their bounties after the Enies Lobby incident."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Battle of Marineford, Karoo and Vivi read an article about Luffy's second appearance at Marineford."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Vivi_and_Karoo_Read_About_Luffy.png/revision/latest/scale-to-width-down/210?cb=20130418211926", "caption": "Karoo and Vivi read about Luffy's reappearance at Marineford."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Karoo and Matsuge ate apples and walked around with Vivi while she greeted the townspeople."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "As the disclosure of Luffy's new bounty after his victory over Donquixote Doflamingo reached Alabasta, Vivi seemed to be happy to learn how her friends are doing while Karoo carefully added the recent news article about the Straw Hats to a scrapbook."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Karoo accompanied the Nefertari Family to Mary Geoise alongside Chaka, Pell, and Igaram."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the way to the Levely, Karoo received the news of Luffy's exploits at Totto Land."}, {"type": "paragraph", "text": "The Alabasta Kingdom participants later arrived at Mary Geoise. At the castle, Karoo accompanied Vivi as she conversed with Rebecca and Shirahoshi about Luffy."}, {"type": "paragraph", "text": "After Donquixote Mjosgard stopped Charlos from enslaving Shirahoshi, Karoo stood close to Vivi as Mjosgard promised to protect Shirahoshi during the Levely."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Karoo, Miss Wednesday, Mr. 8, Miss Monday, and Mr. 9 vs Roronoa Zoro", "elements": []}, {"text": "Karoo, Monkey D. Luffy, and Usopp vs Mr. 3, Miss Goldenweek, Mr. 5, and Miss Valentine", "elements": []}, {"text": "Karoo vs Miss Goldenweek", "elements": []}, {"text": "Karoo and Nefertari Vivi vs Mr. 2 Bon Kurei", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He is featured alongside Chopper in the One Piece Desert Kingdom Mascot Keychain/Cellphone Strap collection."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle!", "elements": []}, {"text": "Legend of the Rainbow Island", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Unlimited Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Big Secret Treasure of the Seven Phantom Islands", "elements": []}, {"text": "Grand Battle! 3", "elements": []}, {"text": "Grand Battle! Rush!", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "His name comes from the Japanese word \"karugamo\", which means \"spot-billed duck\". His name also sounds like kangaroo (kangaruu)"}, {"type": "paragraph", "text": "In the 4Kids dub, his name is pronounced as \"Kuh-roo\", but in the FUNimation dub, it is pronounced \"KAH-rue\"."}], "images": []}, {"title": "Influences", "level": 2, "content": [{"type": "paragraph", "text": "Karoo bears resemblance more to a Chocobo than to a kangaroo (a chocobo being a fictional flightless bird commonly used for transportation in the Final Fantasy series). His name resembles the Japanese word for a Sea King (kaiōrui)."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Karoo's name may be a reference to the Karoo, a semi desert in South Africa.", "elements": []}, {"text": "In the 6th Japanese Fan Poll, Karoo is ranked the 55th most popular character in One Piece.", "elements": []}, {"text": "Despite his long absence from the series and his separation from ties to the Straw Hat crew, Karoo (as well as Vivi) has been and still features multiple times on the cover pages of One Piece chapters.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Chullo – Wikipedia article about the chullo, the hat Karoo wears.", "elements": []}, {"text": "Spotbill – Wikipedia article about the real-world spot-billed duck.", "elements": []}]}], "images": []}]}