{"sections": [{"title": "Baskerville", "level": 1, "content": [{"type": "paragraph", "text": "Three-Headed Baskerville are the Chief Justices on the island of Enies Lobby in the service of the World Government. While Baskerville appeared to be a three headed person, he is actually three people who like dressing up like one person. The one on the left is Bas, the one in the middle is And, and the one on the right is Kerville."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "At first glance, Baskerville looks like a large three headed man dressed to represent the World Government. Each of his heads possess a different face from one another. In reality however, Baskerville is actually three people wearing a costume. The one in the center, And, has very large legs but small arms, while the two on both his side, Bas and Kerville, have very large arms but small legs. When in costume, Bas and Kerville sit on the thighs of And. This gives the illusion that Bas and Kerville control one arm each, and And controls the legs while they are in costume."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Each of the three men who make up Baskerville have their own personality and legal views. Bas calls himself \"Left Baskerville\" when in costume and leans more on immediately declaring any accused as guilty. Kerville calls himself \"Right Baskerville\" and leans more on immediately declaring any accused as innocent. While Bas and Kerville are relative polar opposites in legal opinions, And is a wild card whose personality is completely diverse than the other two. Instead of calling himself \"Center Baskerville\" as it should be expected, he instead uses different nicknames such as \"Center Freeway\", \"Center Lone Mainline\", \"Princess\" or simply doesn't say anything when they expect him to which causes Bas and Kerville to headbutt him out of anger. The legal viewpoints of And is also just as wild. Instead of taking the side of either Bas or Kerville, And usually offers a \"compromise\" between their views. However, his \"compromise\" is usually execution, which is actually more extreme than either of his companions' viewpoints."}], "images": []}, {"title": "Relationships", "level": 2, "content": [{"type": "paragraph", "text": "While Bas and Kerville have opposing legal views, they have a relative understanding of one another. It is however the extremely wild and random nature of And that really irks them. Whenever And does or say something completely outrageous, they would usually yell and hit him for his idiocy. Despite their differences, the three men that make up Baskerville are very close friends, which is why they pretend to be a three headed man."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a walking judicial tribune, Baskerville's main job is to judge criminals brought to Enies Lobby. Each person that makes Baskerville voices their legal opinion of an accused and the majority opinion is carried out. Due to each of their distinct opinions, they usually do not come to conclusion immediately. Regardless of what their opinions may be, the final judgment on whether a criminal is guilty or not is not controlled by them. This decision is made by the Just Eleven Jurymen."}, {"type": "paragraph", "text": "Each of the three people that makes Baskerville is capable of working perfectly together when in costume. With Bas supplying the left arm, Kerville supplying the right arm, and And supplying the legs, they are capable of giving the illusion of a three headed person. Their synchronization with each other is so perfect that it is not hindered even during battle."}, {"type": "paragraph", "text": "As an Enies Lobby official, Baskerville controls the Watchdog Unit of the Law, a group of elite guards that serve under him. When the Straw Hats and their allies invaded Enies Lobby, and Spandam could not be reached, Baskerville became the de facto leader of the entire establishment, commanding thousands of Marines and World Government Agents to defend against the invaders."}, {"type": "paragraph", "text": "Kerville wields a saber, and sometimes Bas gives assistance by utilizing a two-handed swing."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time in the past, Bas, Kerville, and And became acquainted with one another; however, they had not yet decided to assume the identity of Baskerville. Instead, they settled on the name of \"Basandkerville,\" but this ended up being shortened into their current name of \"Baskerville.\" After an unknown amount of time, they assumed the position of Chief Justice on Enies Lobby."}], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Awoken suddenly from his nap, Baskerville learned that Enies Lobby was invaded by some pirates. Seeing that Spandam could not be reached for some reason at the moment, Baskerville took up the request of the pleading Marine and Agents to lead them against this attack. Learning that the invaders had gotten passed the two giant gate guards and were then on the judicial island proper, Baskerville ordered his elite guard, the Watchdog Unit of the Law to engage the enemy."}, {"type": "paragraph", "text": "As the battle continued, Baskerville found that not only were his men unable to force the invaders back but that the invaders' leader who attacked first, Luffy, was nowhere to be found at the moment. Seeing how the battle had escalated so much, Baskerville decided to set loose the Just Eleven Jurymen to defend Enies Lobby despite the costs."}, {"type": "paragraph", "text": "As the situation got worse with the invaders storming the courthouse despite the reinforcements, Baskerville was eventually able to get back in contact with Spandam. Despite this unfortunately, the battle had completely worsened by this time. Seeing the Straw Hat pirates and their allies all in the courthouse, Baskerville decided to judge them as guilty for their actions. The pirates however completely ignored Baskerville for other pressing matters. Irked by them, Baskerville attempted to battle the pirates. Unfortunately, Baskerville's attempts were stopped by the Straw Hats' allies, the Franky Family. With them in the way, Baskerville was forced to fight them."}, {"type": "paragraph", "text": "Despite the judge's best efforts, the invaders were able to lower the drawbridge leading to the Tower of Justice. As this was happening, Baskerville was suddenly chopped up by a combination attack from two of the invaders, Paulie and Zambai. Though it looked like the judge had sustained a fatal wound, it was revealed that Baskerville was actually three people in costume. Just as it seemed like the invaders were about to succeed, in a last ditch effort to stop them, the three judges ordered his men to fire on the bridge before it could be fully lowered. Though their men succeeded in stopping the bridge, the three judges did not anticipate the incoming sea train of the invaders, the Rocket Man, to aid the pirates in crossing the gap to the tower."}, {"type": "paragraph", "text": "It is currently unknown what happened to Baskerville when the Rocket Man stormed their court house and ran over them. It is also unknown if they escaped Enies Lobby before the Buster Call that was accidentally set on the island by Spandam."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Baskerville_Chases_the_Strawhats.png/revision/latest/scale-to-width-down/230?cb=20121219224516", "caption": "Baskerville attacking the Straw Hats."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Paulie_and_Zambai_Separate_Baskerville.png/revision/latest/scale-to-width-down/180?cb=20150326173027", "caption": "Baskerville is separated by Paulie and Zambai."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Baskerville vs. Roronoa Zoro, Nami, and Tony Tony Chopper", "elements": []}, {"text": "Baskerville vs. Franky Family", "elements": []}, {"text": "Baskerville vs. Zambai and Paulie", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Eiichiro Oda seems to have drawn from a number of British sources as inspiration for Baskerville. The character's name possibly comes from the famous Sherlock Holmes novel, The Hound of the Baskervilles, by Sir Arthur Conan Doyle.", "elements": []}, {"text": "The name could also be a reference to the friar William of Baskerville from the novel Il Nome della Rosa (The Name of the Rose) by Umberto Eco. Brother William was an inquisitor, who presided at some trials in England and Italy, where he distinguished himself by his perspicacity.", "elements": []}, {"text": "Baskerville seems to have a hellhound theme. As noted above, his name may be derived from The Hound of the Baskervilles novel. Also, a comment was passed when the Straw Hats and their allies arrived at the courthouse on how they resemble the Cerberus, the three-headed watchdog of the Greek underworld.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Hound of the Baskerville – Wikipedia article about the novel Baskerville derive their name from.", "elements": []}, {"text": "Kerberos – Wikipedia article about the three-headed Greek hellhound Baskerville is compared to.", "elements": []}]}], "images": []}]}