{"sections": [{"title": "Wapol", "level": 1, "content": [{"type": "paragraph", "text": "\"Tin-Plate\" Wapol is the former monarch of the Drum Kingdom, originally named for the \"Drum Peak\" mountains which support Wapol's castle. He became a pirate after fleeing from his country when Blackbeard and his crew attacked Drum Island. After his defeat by the Straw Hat Pirates, he became the head of his own toy enterprise and married Kinderella. Two years later, he was given his own kingdom by the World Nobles and now reigns as the king of the Black Drum Kingdom."}, {"type": "paragraph", "text": "He is the main antagonist of the Drum Island Arc, and also the antagonist of the ninth One Piece movie. He also is the central character from Wapol's Omnivorous Hurrah Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Wapol is an overweight man with an unusual appearance. He has dark violet hair and a cylinder-shaped jaw made up of tin plates, hence his epithet. When Wapol uses his Slim-Up technique, he \"eats\" his body and becomes slim. During the Drum Island arc, he used to dress in tin-plate armor and a hooded cape made from White Walkie skin. He was also wearing brown thick gloves. He spotted a pair of purple and orange woolen shorts and a brown belt around his waist and a pair of thick short boots. When he was the ruler of the Drum Peak, he was wearing the same attire but the tin-plate armor. Instead he was wearing a grey shirt and his gloves had no fur on their upper edge."}, {"type": "paragraph", "text": "After the timeskip, as the monarch of the Black Drum Kingdom he spots a different attire. He wears another shirt and when it comes to his lower body, he wears a skirt with a black pattern, a pair of black sharp pointy sandals. He still has his hooded cape and he wears black gloves. His hair is now white and he has grown a black mustache and a goatee."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Wapol was once a prince of the region who succeeded his father, a King beloved by the people of Drum, as monarch when his father died. Wapol however, proved to be a spoiled and corrupt king, who held not even the slightest regard for his people. He was also cowardly and disloyal, fleeing his kingdom without even fighting back when the Blackbeard Pirates attacked, taking with him the doctors and soldiers while leaving his remaining subjects to fend for themselves. His self-centered actions ruined the kingdom's reputation, which caused all the citizens to both fear and hate him."}, {"type": "paragraph", "text": "He ruled simply to satisfy his selfish desires and he brutally beat anyone who disobeyed him. He is callous towards his people and never appears to care for their safety. Wapol loves to dominate over others with his family's power and wealth, and truly believes that none should dare question his authority. Wapol in particular has little to no understanding of politics or governmental issues, foolishly believing that everything is fine as long as it does not affect his kingdom directly. Being used to having everything go his way, he is childish enough to attack 10 year-old Nefertari Vivi, in the hopes to instigate a full-scale war simply for being scolded by her father for being irresponsible, and grew furious when she did not blame him for this act of spite."}, {"type": "paragraph", "text": "Perhaps because of his selfish nature to desire what he wants, Wapol is unable to learn from his mistakes, as even though he lived as a homeless man and was forced to make a living by selling toys, he made an enormous fortune and became just as selfish and arrogant as he was while as king. In fact, he is one to hold grudges, as he only intends to attend Levely solely so he can get revenge on Dalton for becoming the new ruler of his old Kingdom."}, {"type": "paragraph", "text": "Though Wapol may look and act foolishly, he is by no means stupid, as demonstrated when he saw through Nami's lies and managed to figure out an effective, though cruel and corrupt method of controlling the citizens. Before Wapol's ascension to power, the Drum Kingdom possessed the most numerous and skilled doctors in all of the Grand Line: he took the twenty most skilled for himself while banishing or murdering the rest, to ensure that his subjects would be absolutely loyal and grovel at his feet for medical attention. He is also not foolish enough to defy the World Nobles."}, {"type": "paragraph", "text": "Wapol is very gluttonous, which he takes to the extreme with his Devil Fruit powers. He eats as he pleases, non-stop, and causing massive collateral damage to cities which led him to be arrested once. He also has a habit of saying kaba (\"hippo\") instead of saying baka (\"idiot\"). This, along with his spoiled and childish personality, makes him a somewhat comedic villain, despite his cruelty."}, {"type": "paragraph", "text": "He also seems willing to use cannibalism, as seen when he attempted to eat Luffy and later, in Drum, after hearing from Kuromarimo that Doctor Kureha lives in his castle, he says he is going to eat her."}, {"type": "paragraph", "text": "Wapol has a unique face-fault when left utterly dumbstruck once something terrible happens at his expense- a very wide-eyed blank stare with veins bulging out of his eyes, coupled with a stupefied smile, giving off an overall look that suggests he is about to snap in a psychotic rage."}, {"type": "paragraph", "text": "Like many characters in One Piece, Wapol has a distinct laugh: starting with either \"Ma\" or a long \"Ma\" (i.e Mahahahahaha!/Maaaaaahahahahaha)."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Wapol's Father", "level": 4, "content": [{"type": "paragraph", "text": "Wapol's father was a just king who wished for the well-being of his people and was well loved. Unfortunately, Wapol never followed this type of reign. Wapol's father was well aware of his son's terrible personality while he was a child, according to Dalton it was because he spoiled Wapol. Wapol's father seemingly wanted to raise him into a kind, caring king like himself but failed to do so in the end."}], "images": []}, {"title": "Musshuru", "level": 4, "content": [{"type": "paragraph", "text": "In the ninth One Piece movie, which is a non-canonical retelling of the Drum Island Arc, Wapol has an older brother named Musshuru. Wapol's relationship with Musshuru is somewhat double sided. While he acts like a submissive younger brother when around his brother, Wapol in reality has no real respect for Musshuru. He generally views Musshuru as an idiot that he has to put up with in order for his plan in the movie to succeed. Wapol merely uses Musshuru as a tool and even goes as far as to eating his older brother in order to become a stronger combined being with both Wapol's and Musshuru's Devil Fruit powers."}], "images": []}, {"title": "Kinderella", "level": 4, "content": [{"type": "paragraph", "text": "After Wapol became successful in his toy making business and opened his own company, Kinderella married Wapol and lived a luxurious life with him. Two years later, she is still married to Wapol and they are now the king and queen of the new Evil Black Drum Kingdom."}], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Wapol used to command a large amount of soldiers. However, the only ones that he was close to were his counselors Chess and Kuromarimo. They are both very loyal to Wapol. Chess used to write every new law that Wapol made."}, {"type": "paragraph", "text": "Wapol also had Robson under his possession. He is a White Walkie, aka Wooly Hippo. Wapol killed some of his brothers and was very unhappy with him. Wapol rode him as his personal transport, to the point that he was able to take him up the Drum Rockies."}, {"type": "paragraph", "text": "Before he was exiled, Wapol initiated a \"Doctor Hunt\" throughout the nation. According to his logic, by forcing every doctor except for his Isshi-20 to leave, the citizens would have to grovel at his feet in order to get any medical attention, which would keep them under his control. While they were under Wapol's control, they secretly despised and hated him as the rest of the people did. However, they gave in to the king in order to continue their research and refine their techniques. Upon seeing the quack, Dr. Hiriluk's noble sacrifice, the Isshi-20 became determined to never lose to the quack. To this end, they hoped to use their research and techniques to help their compatriots. When Wapol fled the kingdom, he took the Isshi-20 with him."}], "images": []}, {"title": "Levely", "level": 3, "content": [{"type": "paragraph", "text": "Wapol is highly egotistical, and believes he is more important than anyone else in his kingdom. He has neither time nor care for political events concerning the world that do not affect his country, such as Dragon and the movements of his revolutionaries. He also displays a huge lack of diplomacy skills altogether in dealing with other leaders. This made him unpopular in the Levely, and Nefertari Cobra scolded Wapol for his lack of care, which resulted in Wapol storming out. On the street outside, Wapol saw Cobra's daughter, Vivi, and intentionally knocked her down as he walked past, but instead of bursting out crying, the princess tactfully apologized, saying it was her fault. Seeing that his spiteful act did not turn out as he had planned, Wapol angrily departed the summit."}, {"type": "paragraph", "text": "Years later, Wapol now only intends to attend Levely solely so he can take down Dalton."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Dalton", "level": 4, "content": [{"type": "paragraph", "text": "Dalton was once a humble servant of King Wapol, who originally obeyed the orders of his King through loyalty. Dalton however, unlike other members of the Kingdom ministers, had a conscience and once he was encouraged by Hiriluk’s actions, refused to be Wapol's obedient guard any longer. After Wapol fled Drum Island, Dalton harbored a deep hatred for his former king and refused to allow him to revert Drum Island back to what it was before his departure. Even after two years after his defeat, Wapol still thinks lowly of Dalton and intended to take him down at the Levely. When they met again at Mary Geoise, they were displeased to see other. Wapol yelled at him by calling him a servant, but Dalton firmly stated they are now equals. His tone also sounded threatening as Wapol backed off."}], "images": []}, {"title": "Hiriluk", "level": 4, "content": [{"type": "paragraph", "text": "When Wapol declared a Doctor Hunt, he saw Hiriluk as one of his two main threats to controlling the kingdom, despite the doctor being a quack. Upon Hiriluk's suicide, Wapol and his loyal subordinates Chess and Kuromarimo laughed. They were the only three to do so, having no respect for the doctor whatsoever."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "The Straw Hat Pirates first encountered the Bliking Pirates out on the sea. Using their submersible ship, the Bliking, the crew ambushed the Straw Hats, but when Wapol tried to eat Luffy, he was merely knocked into the ocean, forcing the rest to leave in order to rescue him. Dalton, who tried to form a new government on Drum, helps the crew find a doctor for a sick Nami. Later on, following the Straw Hats for revenge, the crew finally finds themselves back on their home island and Wapol decides to return to his throne. However, he was defeated by Luffy and Chopper."}, {"type": "paragraph", "text": "After the timeskip, Wapol does not seem to bear a grudge against Luffy as he mentioned that the latter's actions allowed him to regain power and a new kingdom."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As king of the Black Drum Kingdom, Wapol has full authority over the kingdom and its citizens, and is able to attend Levely. He formerly possessed this authority on Drum Island before he fled and was eventually deposed."}], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Wapol possesses a surprising amount of cunning, as he came up with a strategy to subjugate his country and later on, he came up with another strategy to catch Dr. Hiriluk by exploiting his personality. During his final fight with Luffy and Chopper, Wapol also thought of several ideas to give him an advantage, such as merging his two servants and consuming his castle's super cannon."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "He seems to lack battle or combat experience and he mainly relies on his henchmen to perform such tasks. While living as a pirate, he and his crew were capable of surviving on the treacherous waters of the Grand Line. Wapol and his cabinet managed to subdue an entire nation, and Wapol easily defeated Dalton in his \"ultimate form\". It should be noted that Wapol did not get the chance to use this ultimate form, which he would have achieved by eating all of Drum Castle's weapons, because Nami stole the key to the armory from him. Despite his obesity, Wapol has a huge durability, having quickly gotten back up after Dalton's sword strike on him and two consecutive punches in face by Luffy. He can become rather agile after using the slim Wapol technique."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Wapol ate the Baku Baku no Mi, a Paramecia-type Devil Fruit which allows him to eat virtually anything and take on its properties. Wapol has fairly excellent control over his ability; although due to his stupidity and lack of speed, this somewhat limits any other fighting abilities he could have. The first time he showed his Devil Fruit Power was when he ate a large chunk of the Going Merry when they met with the Straw Hat Pirates. He demonstrates this power many times against Luffy in acts such as merging his two advisers into a single warrior, or shooting bombs from his Baku Baku Factory pistol arms. Because of his seeming lack of combat prowess, he is heavily reliant on his Devil Fruit powers when stepping into a fight."}, {"type": "paragraph", "text": "With his powers, Wapol is able to produce a new steel called Wapometal, which makes toys and allowed him to ascend into greater wealth than he had when he was king. Throughout the manga, the mini-stories show Wapol transforming into many different objects, including trees, lamps, and benches. Eventually, he ate some scrap metal which turned into toys, which he sold for 50 berries."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Baku_Baku_no_Mi_Infobox.png/revision/latest/scale-to-width-down/250?cb=20130308040144", "caption": "Wapol using his powers to battle Luffy."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Wapol had in his possession the Royal Drum Crown 7-Shot Bliking Cannon. Wapol was going to use it to defeat Monkey D. Luffy but he could not get the cannon working due to the freezing conditions and the cannon barrels becoming a nest for Snow Birds."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "After his father (the previous king) died, Wapol inherited the throne and became the new king of Drum Island. Six years before the current storyline, Wapol exiled all of the country's doctors, with the exception of his personal doctors, the Isshi-20. These doctors were forced into servitude by Wapol as he believed he could control the citizens of Drum by forcing them to personally beg him for medical treatment. Only two other doctors, Hiriluk and Kureha, managed to elude Wapol's grasp."}, {"type": "paragraph", "text": "In the midst of his rule, Wapol attended the world meeting in Mary Geoise. There he was told of the revolutionary named Dragon and how he would be a threat to the world in the next five to six years. Wapol, not caring about the situation at all since he believed his Drum Kingdom would not fall to Dragon, simply picked his nose and shrugged the whole matter off. Nefertari Cobra, the king of Alabasta, not believing Wapol's selfish reply, scolded him for not taking the whole situation more seriously."}, {"type": "paragraph", "text": "Angered for being scolded by Cobra, Wapol tried to get even by intentionally hitting his ten year old daughter, Vivi, and saying it was an accident. Despite being hit however, Vivi simply apologized to Wapol instead of making a big deal out of the whole matter. Afterward, Vivi was seen crying with Igaram, and Dalton saw her crying. Wapol, unable to accomplish anything with his actions, decided to just leave and go back to Drum."}, {"type": "paragraph", "text": "One year later, Wapol decided to lay a trap for Hiriluk. By spreading a rumor amongst his people that the Isshi-20 were sick, Wapol believed that Hiriluk would foolishly come to save them. Sure enough, Hiriluk did respond to the news and Wapol was informed of the doctor's arrival. With several of his men, Wapol then boastfully told Hiriluk that the doctor was tricked when he finally arrived in front of Wapol's castle."}, {"type": "paragraph", "text": "However before Wapol could give the order to execute Hiriluk by firing squad, Hiriluk told the king and his men to wait and gave a speech on how there was only one way a person would truly die. This brought tears to Wapol's Captain of the Guard, Dalton. Wapol however was unmoved by the whole matter. Wapol and his men then witnessed as Hiriluk blew himself up. The entire sight made Wapol laugh as he found Hiriluk an idiot for killing himself."}, {"type": "paragraph", "text": "Wapol's laughter at Hiriluk's death however angered Chopper who had arrived at the area. Enraged, Chopper flew into a berserk rage while activating Heavy Point for the second time and attempted to attack Wapol only to be stopped by Dalton. Dalton then convinced Chopper to leave the area. Wapol, wondering why Dalton simply let him go, questioned him. Dalton then spoke up against Wapol about how cruel he and the government he controlled were towards the country. Dalton told Wapol that no matter how good their country's medical skills were, there was no cure for Wapol's foolishness. Angered by his subordinate's insubordination, Wapol transformed into a massive form consisting of various weapons and defeated Dalton. Wapol then imprisoned Dalton for a week until Dalton apologized to him for his insubordination."}, {"type": "paragraph", "text": "Wapol continued to rule tyrannically over the Drum Kingdom until the Blackbeard Pirates arrived on Drum Island about two to three months before the current storyline. The moment Wapol and those loyal to him realized that the pirates were too strong for them to fight, they immediately abandoned the country and fled to the sea on the Bliking. Only Dalton and the people of Drum Island were left behind to face the pirates alone. Wapol and his men, disguised as pirates, then wandered the seas trying to find their way back to the island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Cobra_Yells_at_Wapol.png/revision/latest/scale-to-width-down/240?cb=20180615062732", "caption": "Cobra scolds Wapol for his selfish behavior at the meeting in Mary Geoise."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Wapol_Defeats_Dalton.png/revision/latest/scale-to-width-down/220?cb=20130301053527", "caption": "Wapol defeats Dalton for his insubordination."}]}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Drum Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "After waiting patiently for a time as a pirate, Wapol decided to return to Drum and resume his throne. He and his men came across the Going Merry and boarded the ship. With the Straw Hats temporarily held up at gun point, Wapol asked if they had any Eternal Poses to Drum. The Straw Hats unfortunately neither had an Eternal Pose to Drum nor heard about the country before. Wapol, seeing as he could not get anything useful from them, decided to steal any treasure they had on them. Before stealing anything from them however, Wapol decided to dine on the ship, literally. As he ate parts of the ship, the Straw Hats started to retaliate against their captors."}, {"type": "paragraph", "text": "Luffy in particular, decided to attack Wapol directly. Wapol merely retaliated by swallowing most of Luffy. Wapol however had a hard time trying to chew Luffy due to his rubbery body and unfortunately, Luffy's unswallowed and outstretched arms came back to hit Wapol. With a strike from Luffy's arms, Wapol spat out Luffy and was catapulted to the open sea. Fortunately for Wapol, his men were able to fish him out before he could drown. He and his men then continued looking for a way back to Drum."}, {"type": "paragraph", "text": "The next day, Wapol and his men were able to reach back to Drum. Upon arriving, they were met with a small resistance from Wapol's former subjects who were guarding the entrance. After dealing with them, Wapol decided to head back to his castle aboard Robson and resume his throne. However before he could set off, Wapol was then informed by one of his men that the Straw Hats had also landed in Drum. Wanting to get back at them for what they did to him and to restart rebuilding his former kingdom, Wapol decided to go to the town of Big Horn following the Straw Hats' trail."}, {"type": "paragraph", "text": "In Bighorn, Wapol and his men seized the town. With some of the houses in ruins, Wapol began eating the town itself. Wapol was then informed that the Straw Hats had headed to his castle looking for Dr. Kureha, who decided to live there. Angered by this, Wapol decided to eat her along with Luffy for the troubles they caused him. Before he and his men could set off to his castle however, Wapol was attacked by his former Captain of the Guard, Dalton. Luckily for Wapol, the Isshi-20 were able to stitch Wapol back up from his injury from Daltons attack."}, {"type": "paragraph", "text": "After being fixed up, Wapol talked with a defiant Dalton about the way he ruled before and his decision to exile most of their kingdoms doctors. In the midst of their discussion, Wapol ordered his men to execute the traitor. Dalton however was able to dodge most of Wapol's men with the power of his Devil Fruit. Chess, Wapol's Minister of Defense, however countered this by shooting at some villagers who attempted to help Dalton. Dalton, being the person he is, stood in the line of fire and got hit by Chess' arrows. The entire situation made Wapol laugh. Suddenly, just in the middle of things, an avalanche appeared coming from Drum Peak to Bighorn."}, {"type": "paragraph", "text": "Hopping onto Robson, along with Chess and Kuromarimo, Wapol attempted to escape from the avalanche, leaving the majority of his men behind. Unfortunately he and the cohorts with him were not able to escape from the avalanche. Buried under tons of snow, Wapol chewed a way out and spat out Chess and Kuromarimo who he accidentally swallowed along with the snow. Angered by the situation, Wapol figured that the entire avalanche was part of some plan concocted by the Straw Hats. With Chess and Kuromarimo, Wapol riding aboard Robson rushed up the mountain and caught up with Luffy. Upon catching up with Luffy, Wapol was completely ignored by Luffy due to the current circumstances involving Sanji and Nami."}, {"type": "paragraph", "text": "Wapol, angered by this, created a new law stating that whoever ignores the king like that would be put to death. He then ordered Chess and Kuromarimo to attack Luffy and the two Straw Hats he was carrying. Wapol and his two cohorts then gave Luffy a hard time, though Luffy was able to keep dodging their attacks and keep both Sanji and Nami safe. Just in the middle of things however, several Lapahns came out and began protecting Luffy and company. With the Lapahns blocking their path, Luffy was able to escape from Wapol and his cohorts. After sometime battling against the Lapahns, Wapol and his cohorts were able to defeat the giant rabbits. They then continued going towards Wapols castle."}, {"type": "paragraph", "text": "Using Robson, Wapol and his two cohorts were able to scale the cliffs of the Drum Peak and reach his castle. Having returned to his castle, Wapol decided to reclaim his throne. However before he could celebrate, Wapol noticed that the Drum Kingdom's flag that usually adorned the top of his castle, was replaced with a pirate flag. Wapol was then greeted by Kureha alongside Chopper. Kureha told Wapol to leave as his castle was now Hiriluk's tomb and the kingdom he once ruled was gone. Wapol was then met by Luffy who punched him directly in the face."}, {"type": "paragraph", "text": "Having nearly been punched off the mountain by Luffy, Wapol regained his footing and decided to fight against those who stood in his way. He first sent both Chess and Kuromarimo to fight ahead. As he sent them forward to fight against Sanji, who had arrived at the scene, and Chopper, Wapol realized that Chopper was the same creature that attacked him when Hiriluk died. In the middle of the fight, Wapol swallowed Chopper as he came at Chess. Wapol however was hit in stomach by Luffy and so spat Chopper out before he could devour him. As Wapol flew due to the impact, he accidentally hit Robson along the way and sent the hippo flying away from his castle."}, {"type": "paragraph", "text": "After regaining himself once again, Wapol decided to show his opponents the power of his Baku Baku Factory and asked Chess to relate to his opponents what he ate recently. Chess did so as commanded. Wapol then showed what he could do with the stuff he ate. He transformed into a house with cannons for arms. He then devoured both Chess and Kuromarimo and combined them into a new being called Chessmarimo which emerged out of the door in the middle of Wapol's stomach. Wapol then decided to shoot down the pirate flag on top of his castle as he found it repulsive."}, {"type": "paragraph", "text": "For this however, Chopper became enraged. Passing through Chessmarimo, Chopper climbed on top of Wapol and almost punched him in the face. Chopper however instead asked Wapol to leave. Seeing an opening due to Chopper's hesitation, Wapol shoot Chopper off him. Just then Wapol noticed that Luffy restored the pirate flag to its place. With Luffy holding the flag pole up and a part of the jacket Luffy was wearing holding the entire thing together, Luffy told Wapol that he and his men were nothing but frauds since they did not know the true meaning of the flag."}, {"type": "paragraph", "text": "Wapol, upon hearing Luffy's words against him, decided to shoot Luffy down along with the flag. However despite Wapol shooting directly at Luffy, Luffy stood his ground carrying the flag. Not believing the situation at all, Wapol decided to shoot Luffy once again. However before he could, Wapol was attacked by Chopper. Fortunately, Chessmarimo blocked the attack. Protecting his master, Chessmarimo stated that he would defeat a creature like Chopper who does not have anyone. Luffy disagreed and catapulted himself towards Wapol and Chessmarimo. After getting back up from the impact created by Luffy, Wapol prepared to fight him while Chessmarimo fights against Chopper. However, while Wapol and Luffy had prepared to fight against each other, Luffy got caught up watching Chopper's fight with Chessmarimo. With Luffy and everyone busy, Wapol saw a good opportunity."}, {"type": "paragraph", "text": "While Chopper fought against Chessmarimo and everyone was not looking, Wapol snuck back into his castle without anyone noticing. Inside, he is shocked and angered by the condition his castle had become. Wapol then noticed Nami and decided to attack her. As Wapol gave chase after Nami, his fat body gets caught in one of the stairway passages. To rectify, Wapol eats himself completely until his lower jaw is all that is left. Inside his \"mouth\", which looks like a bucket, Wapol rearranged his bones and muscles in order to become a slimmer and taller version of himself. In this form, Wapol decided to continue attacking Nami. Just when Wapol caught Nami however, Luffy came in and kicked Wapol in the face."}, {"type": "paragraph", "text": "After getting back up, Wapol then tries to eat all the weapons inside his massive armory in order to turn himself into a super-weapon to fight against Luffy. Unfortunately, Nami had managed to steal the key to the armory from him when Wapol caught her earlier. Realizing he could not open the armory, Wapol decided to run away from Luffy in order to get to his trump card, the Royal Drum Crown 7-Shot Bliking Cannon, high within in his castle. Just when Wapol got to it and was about to fire the cannon at Luffy, the cannon did not fire. It turned out that the cannon had become a bird's nest while it was unmaintained and the nest was clogging up the cannon's firing mechanism. Angered by this, Wapol yelled at the bird that decided to live in the cannon. In midst of his anger however, Luffy grabbed Wapol's entire jaw with his hand."}, {"type": "paragraph", "text": "As Luffy held onto Wapol's jaw, Wapol threatened that what Luffy was doing here was an international crime since Drum is a part of the World Government. Unmoved, Luffy held firm to Wapol's mouth as he told Wapol that it did not matter to him. Wapol, responding to this, opened his mouth as wide as he could to swallow Luffy. Luffy's grip however simply stretched as it held onto Wapol's mouth. Wapol then countered this by turning his tongue into a cannon and firing it at Luffy. The resulting explosion blew a hole in Wapol's tower. Just when it seemed that Wapol had won, Luffy suddenly popped out from behind Wapol."}, {"type": "paragraph", "text": "Luffy latched onto Wapol and catapulted him up to the roof with his Gomu Gomu no Bow Gun technique. Lodged at the very tip of the roof, Wapol was placed before Hiriluk's pirate flag. Luffy then came up to the roof to finish off Wapol. As Luffy prepared to send Wapol flying off with a very long Gomu Gomu no Bazooka, Wapol pleaded to Luffy to spare him by offering various rewards such as a position in his government. In a last ditch effort before being hit by Luffy, Wapol offered make Luffy a \"Vice-King\" of Drum. Luffy completely ignored Wapol's pleas and sent Wapol flying far off from Drum."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1c/Wapol_Asks_for_Eternal_Pose.png/revision/latest/scale-to-width-down/250?cb=20130117053626", "caption": "Wapol asks if the Straw Hats have an Eternal Pose to Drum."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Wapol_Confronts_Dalton.png/revision/latest/scale-to-width-down/210?cb=20130912220151", "caption": "Dalton confronts Wapol in Bighorn."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Wapol_Attempts_to_Escape_Avalanche.png/revision/latest/scale-to-width-down/210?cb=20130912220409", "caption": "Wapol attempts to escape the avalanche aboard Robson."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b4/Wapol_House.png/revision/latest/scale-to-width-down/210?cb=20190212145053", "caption": "Wapol House."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/88/Slim_Wapol.png/revision/latest/scale-to-width-down/250?cb=20130727024301", "caption": "Slim-up Wapol."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Luffy_Defeats_Wapol.png/revision/latest/scale-to-width-down/210?cb=20140801104256", "caption": "Luffy defeats Wapol."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Wapol's Omnivorous Hurrah", "level": 4, "content": [{"type": "paragraph", "text": "After Wapol's second exile from his homeland, he wandered around the Grand Line in an eating spree and became fat again. He began eating various things from lamps to benches. He then transformed into them in order to eat more stuff. Soon even towns became his dessert. He was practically having the time of his life, eating stuff and causing misfortune to those around him."}, {"type": "paragraph", "text": "Eventually however, Wapol's actions caught the attention of the Marine and he was soon arrested by two Marines who do not recognize him as a king, shocking Wapol. A cutaway reveals that Dalton is the new king of the Sakura Kingdom. Luckily, Wapol was able to escape his captors. It was then that Wapol finally realized that he was no longer a king and became deeply depressed. He then became a homeless bum whose only companion was a dog that constantly peed on him. He tried to sell matches for a living but was cruelly turned down. Eventually Wapol, having nowhere to go, settled under a bridge. Having no money at all to spend for food, all he could afford to eat was the garbage scattered around him."}, {"type": "paragraph", "text": "While eating garbage, strange new toys were inadvertently created by Wapol using his Baku Baku Factory technique. Among these toys, the dog that constantly peed on Wapol apparently got combined with the garbage and had obtained a googly eyed box for a head (hinting that he must have eaten the dog). These toys eventually attracted children who were fascinated by these toys. Wapol, seeing how these toys attracted children, decided to set up shop and sell these toys for a living. Eventually Wapol was able to build a proper toy shop with the earnings he got from selling toys. The shop soon in a short time became very popular. It became such a success that the demand for his toys was almost overwhelming, quickly running out of stock and having customers as far as he could see."}, {"type": "paragraph", "text": "Eventually, scientists soon discovered a secret deep within Wapol's toys. It turned out that in the process of creating these toys, Wapol had also created a new type of steel. This steel, which was called Wapometal , instantly made headline news and made Wapol an instant celebrity. With the publicity he gained, Wapol was able to expand his toy shop to great lengths. Soon Wapol had an industry on his hands. He was then able to open up an actual Baku Baku Factory which produced Wapol steel and his toys. This eventually led to the creation of the Wapol Konzern with him as the CEO."}, {"type": "paragraph", "text": "With his wealth and hard work, Wapol was able to marry Miss Universe. Together with Hakowan his googly-eyed, box-headed dog and wife, Wapol was able to regain his world famous status and become even more wealthy than when he was a king."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/37/Wapol_Back_in_Power.png/revision/latest/scale-to-width-down/210?cb=20180108160905", "caption": "Wapol's rise back to power."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "During the timeskip, the World Nobles seemed to have acknowledged Wapol's success and therefore made him ruler of a new kingdom, the evil Black Drum Kingdom. He and Miss Universe are still married, and the dog that has been with him since his days of poverty is also still by his side."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "When he learned that Dalton would be attending the upcoming Levely, Wapol deviously began to wonder how he could take him down at the attendance."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Wapol and Kinderella later arrived at Mary Geoise. At the castle, Wapol approached and insulted Vivi. He was then interrupted by Dalton, who drove Wapol away through intimidation."}, {"type": "paragraph", "text": "When Charlos tried to take Shirahoshi by force, Wapol was frightened by the scene and kept his distance. He was then surprised to see Donquixote Mjosgard attacking Charlos in Shirahoshi's defense."}, {"type": "paragraph", "text": "Wapol later went to the conference room with the other kings and queens to begin the Levely. As he took his seat, Wapol grinned wickedly at Dalton."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Wapol_and_Dalton_meet_at_Mary_Geoise.png/revision/latest/scale-to-width-down/190?cb=20190519040502", "caption": "Wapol and Dalton meet again when they attend the Levely."}]}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo along with the Bliking Pirates."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "At some point after Levely ended, Wapol contacted the World Economy News Paper president Morgans, having some information for him."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Wapol vs. Dalton (offscreen)", "elements": []}, {"text": "Wapol vs. Monkey D. Luffy (on board of Going Merry)", "elements": []}, {"text": "Wapol vs. Dalton", "elements": []}, {"text": "Wapol, Chess, and Kuromarimo vs. Monkey D. Luffy (with Luffy carrying Nami and Sanji)", "elements": []}, {"text": "Wapol, Chess, and Kuromarimo vs. Lapahns", "elements": []}, {"text": "Wapol, Chess, and Kuromarimo vs. Monkey D. Luffy and Tony Tony Chopper", "elements": []}, {"text": "Wapol vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "During the scene where Dalton attacks Wapol in the manga, it is shown that Dalton had completely decapitated Wapol. He was able to survive the attack and even move without a head thanks to Isshi-20's surgical skills. In the anime, the violent nature of this scene was toned down by showing that Dalton had merely slashed across Wapol's chest instead of slashing off Wapol's head. The part where Wapol's body moved without a reconnected head was also replaced with a nearly identical scene except with Wapol's head fully connected."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "Due to the pun being lost in translation, Wapol's habit of calling people \"hippos\" is omitted from most English versions.", "elements": [{"text": "The UK release of Episode Of Chopper Plus, this is translated as \"Hippo head\".", "elements": []}, {"text": "In the English release of Pirate Warriors 3, the joke is substituted with Wapol saying \"boron\" instead of \"moron\".", "elements": []}]}, {"text": "In the 4Kids dub, Wapol speaks with a Russian accent.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Grand Battle 3", "elements": []}, {"text": "One Piece Grand Battle! Rush!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In Chapter 0, Wapol's father is seen with Dalton worrying about his son's behavior, although he remains unnamed.", "elements": []}, {"text": "Wapol had a white walkie pet named Robson that he rode around Drum Kingdom. Luffy sent him flying, and Robson has not been seen since.", "elements": [{"text": "Along with the gluttony and hippo theme, Wapol shares similarities to Dobon.", "elements": []}]}, {"text": "A drawing on the Japanese site for One Piece: Pirates' Carnival shows him without his gloves, being the only time he is shown without them in color, until his flashback in Episode 778.", "elements": []}, {"text": "He is one of the few pirates that Luffy has fought against that has had no bounty revealed.", "elements": []}, {"text": "He is the first king shown in the series.", "elements": []}, {"text": "Wapol is the first known royal figure to have been banished from his country and become a pirate.", "elements": []}, {"text": "In the ninth movie, Dalton says that Wapol's older brother (Musshuru) is thirty-three years old, which means that Wapol is less than thirty-three years old. However this is non-canon since it is revealed in a movie.", "elements": [{"text": "In the SBS Volume 84, it was revealed that Wapol is indeed younger, being 27 years old during the Drum Island Arc.", "elements": []}]}, {"text": "He shares the same Funimation dub voice actor with Don Krieg.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3b/Wapols_Father.png/revision/latest/scale-to-width-down/250?cb=20130303162007", "caption": "The king of Drum Kingdom before Wapol."}]}]}