{"sections": [{"title": "Oimo", "level": 1, "content": [{"type": "paragraph", "text": "Oimo, together with Kashii, is one of the two giants who guarded the front gate of Enies Lobby for over fifty years."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Oimo is a giant with a flat, pig-like nose and a rotund body. He has long, flowing orange hair, along with some stubble on his chin. He sports viking attire, with a light green short-sleeved shirt lined in brown-green. He also wears tab suspenders with large gold buttons, and a big pink tunic with brown lace lined on the top with a lighter colored fluff. Under that, he sports green-brown pants with big black boots. He is seen wearing a Roman style helmet, with gold around the edges and red in the middle, with pink frills on the top. He has a big black belt with a gold buckle, and is usually seen with his gargantuan wooden club."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Oimo proved to be very fond of his captains, to the point of being willing to work at Enies Lobby for a hundred years, in order to obtain their release from Impel Down. When he discovered the World Government's deception, he became angry and rebelled."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a giant, Oimo possesses superhuman strength and resistance. As a demonstration of his strength, he together with Oimo were able to successfully protect the doors of Enies Lobby for fifty years. Together with Oimo, he also managed to defeat the Kairiki Destroyers, the three strongest members of the Franky Family after Franky himself, in an instant.  Even after receiving numerous injuries from the joint efforts of the Galley-La foremen, Franky Family, Sodom and Gomorrah, Oimo still had enough strength to sow panic at Enies Lobby together with Kashii, defeating numerous marines. He also survived after taking full cannon shots from a marine battleship."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wields a large wooden club with metal studs embedded in it."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Oimo Press (オイモプレス, Oimo Puressu): Oimo using his gigantic body does a belly flop onto a large group.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Life as a Pirate", "level": 4, "content": [{"type": "paragraph", "text": "One hundred years before the beginning of the main storyline, Oimo was a member of the Giant Warrior Pirates. He was present when Yuki asked Dorry and Brogy which one of their catches were bigger. After they challenged one another to a duel, Oimo left Little Garden with the rest of the pirates."}, {"type": "paragraph", "text": "Around forty years after Dorry and Brogy started their duel, Oimo was seen at Elbaf on the day before the Winter Solstice Festival. During a conversation with other giants, Kashii wondered how the duel between Dorry and Brogy could take so long. Oimo then suggested waiting for ten more years before checking up on them."}], "images": []}, {"title": "The World Government's Lie", "level": 4, "content": [{"type": "paragraph", "text": "About fifty years ago, thinking it strange that neither one of their bosses had returned yet, Oimo, along with Kashii, left Elbaf to return to Little Garden and find out what had become of their bosses. Along the way, they were captured by Marines, and were interrogated about their crew and purpose. They were then told that Dorry and Brogy had been captured and were imprisoned in the government's great prison. The World Government made a deal with them that if they worked for them for 100 years, they would set their bosses free and allow all four of them to return home together. Oimo and Kashii agreed, and became the guardians of Enies Lobby's front gates. For fifty years, they guarded the gates successfully."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ea/Kashii_and_Oimo_22_Years_Ago.png/revision/latest/scale-to-width-down/210?cb=20130624083911", "caption": "Oimo and Kashii twenty-two years before the start of the series."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After fifty years of service, they are confronted by the Franky Family, Straw Hat Pirates, and Galley-La Company foremen's invasion of the island. Due to it being nighttime, the giants are asleep when Luffy makes it through, but are awakened by a Marine shortly afterwards, at Spandam's command. They emerge to fight the majority of the Franky Family once they reach the Main Gate, and have no difficulty in deterring their efforts. The tide soon turns against them, however, when the foremen, Zambai, Kiwi, and Mozu come to the gate riding Sodom and Gomorrah. Their combined efforts immobilize Kashii, and Zambai tricks Oimo into whacking his partner with his club, knocking him out. Oimo stands against them for a short while, but when Kiwi and Mozu manage to unlock the gate behind him, Paulie uses Top Knot and Sodom and Gomorrah pull the rope to spin the giant like a top. He falls through the gates as the invaders make it through, and briefly gets back on his feet shortly after the Houbantai deter the invaders' progress. However, he is knocked out when Rocket Man, the prototype Sea Train, crashes into his back after jumping over the main gate. He and Kashii are both unconscious as the attacking forces press forward."}, {"type": "paragraph", "text": "When Oimo awakens, he begins to cry, mourning about how the two of them had failed their bosses. Usopp (still disguised as Sogeking), who had been accidentally left behind, hears his lamentation and, after some prodding, Oimo tells his story. Realizing who Oimo meant, Usopp tells him the truth, that Dorry and Brogy were still fighting on Little Garden, proving it by speaking passionately about how they inspired him, and exposing the World Government's lie."}, {"type": "paragraph", "text": "Angered at being deceived for fifty years, Oimo and Kashii switch sides and swear vengeance upon the World Government that had kept them in the dark for so long. This is first revealed to the Houbantai, who had just managed to overwhelm the three Galley-La foremen, when they approach from the front gate and begin attacking them. The two giants rampage through the island, bringing the foremen with them, and arrive at the courthouse just in time to save the Franky Family from being overwhelmed by the Marines when Yokozuna is knocked out by one of the Just Eleven Jurymen. They take his place in guarding the door to the inner courthouse, keeping the Marines out, but not before flinging Sogeking up to the rooftop to rejoin the Straw Hats."}, {"type": "paragraph", "text": "While Oimo and Kashii prove very effective in guarding the courthouse, they eventually reach their limit, and are brought down when the Marines and Agents swarm them. They are tied up along with the invaders in the courthouse (grinning constantly while they are bound, for some reason), but before any further actions can be taken against them, Spandam broadcasts to the entire island that he accidentally triggered the Buster Call. All of the Marines and Agents flee to escape Enies Lobby, leaving the invaders and giants tied up at the courthouse."}, {"type": "paragraph", "text": "Soon afterwards, they are freed thanks to Paulie, who had tied himself up with his own ropes. Oimo and Kashi carry Sodom and Gomorrah while the Franky Family and Galley-La Foremen ride on the King Bulls. The giants encounter no difficulty as they head towards the front of the island, where the Puffing Tom waits. Upon reaching the island's entrance, however, they find themselves facing three Marine battleships, onto which the Marines and Agents stationed in Enies Lobby are boarding. The cannons and rifles on board aimed at them, they can do nothing but hold their ground until the battleships finally fire, hitting them with enough force to blow away the front gate and seemingly killing them."}, {"type": "paragraph", "text": "However, shortly after Luffy defeats Rob Lucci of the CP9, it is revealed that thanks to Paulie's ropes, they all managed to escape death by hanging on the side of the island. With nobody guarding the front gate anymore, they climb back onto the island and board the Puffing Tom, and upon hearing that the Straw Hats have escaped, they set out from Enies Lobby themselves, for a smooth voyage back to Water 7."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Franky_Family_vs._Oimo.png/revision/latest/scale-to-width-down/210?cb=20151026052115", "caption": "Franky Family vs. Oimo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Kashii_and_Oimo_Help_Allies_Escape.png/revision/latest/scale-to-width-down/210?cb=20150308231310", "caption": "The giants help the Franky Family and Galley-La foremen escape."}]}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Two days later, Oimo and Kashii are seen helping to repair Water 7 from the effects of Aqua Laguna, Usopp alongside them. The two decide that they cannot go to Little Garden if their bosses are still fighting, so they decide to stay on Water 7 for a while to help rebuild it, and then go back to Elbaf. They invite Usopp to join them, and he considers the offer, but ultimately declines in order to rejoin the Straw Hat Pirates. Later, the giants attend the Straw Hats' barbecue party after Luffy awakens, and after the Straw Hats' departure from Water 7, they express their anticipation of the crew visiting Elbaf someday."}], "images": []}, {"title": "Where They Are Now", "level": 3, "content": [{"type": "paragraph", "text": "Oimo was seen leaving for Elbaf with Kashi."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oimo and Kashi vs. Kairiki Destroyers", "elements": []}, {"text": "Oimo and Kashi vs. Franky Family", "elements": []}, {"text": "Oimo vs. Galley-La Company foremen and Franky Family", "elements": []}, {"text": "Oimo, Kashi, and Sogeking vs. Marine Officers and Government Agents", "elements": []}, {"text": "Oimo, Kashi, Franky Family, and Galley-La foremen vs. Some of Just Eleven Jurymen, Marine Officers, and Government Agents (front of the courthouse)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The scene where Usopp explains the truth to Oimo is extended in the anime. Flashbacks from the Little Garden Arc are added in, Usopp demonstrates Dorry and Brogy's signature laughs as his initial attempt to prove that he met them (suffering a horrid sore throat as a result), and after saying that the World Government had lied to them, Oimo is seen crying for joy at the news that their bosses are all right."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Considering that the entire Little Garden Arc was cut in the 4Kids version, their leaders Dorry and Brogy would never meet the Straw Hats. It is unknown how 4Kids would have avoided the potential plot hole that was created in the process."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oimo uses the personal pronoun oi, so when he says \"me too\" (oi mo), he says his name.", "elements": []}]}], "images": []}]}