{"sections": [{"title": "Kashii", "level": 1, "content": [{"type": "paragraph", "text": "Kashii, together with Oimo, was one of the two giants who guarded the front gate of Enies Lobby  for over fifty years. He was originally a member of the Giant Warrior Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kashii is a giant who wears viking attire, has long dark hair and a big semi-bearded chin. He sports orange suspenders, which hold up an orange and black kilt with yellow buttons on it; otherwise, his torso and arms are bare, exposing well-toned muscles. He has big black boots that go up his shins, as well as an orange helmet with a tan brim and two small tan striped around the middle. The top of the helmet has light blue frills reminiscent of a mohawk, supported by a tan protrusion along the center, and two small horns are on the sides. He is usually seen with his axe."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kashii proved to be very fond of his captains, to the point of being willing to work at Enies Lobby for a hundred years, in order to obtain their release from Impel Down. When he discovered the World Government's deception, he became angry and rebelled."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a giant, Kashii possesses superhuman strength and resistance. As a demonstration of his strength, he together with Oimo were able to successfully protect the doors of Enies Lobby for fifty years. Together with Oimo, he also managed to defeat the Kairiki Destroyers, the three strongest members of the Franky Family after Franky himself, in an instant.  Even after receiving numerous injuries from the joint efforts of the Galley-La foremen, Franky Family, Sodom and Gomorrah, Kashii still had enough strength to sow panic at Enies Lobby together with Oimo, defeating numerous marines. He also survived after taking full cannon shots from a marine battleship."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wields a large broad axe though how skilled he is with it is not known."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Life as a Pirate", "level": 4, "content": [{"type": "paragraph", "text": "A century before the beginning of the series, Kashii was a member of the Giant Warrior Pirates. He was present when Yuki asked Dorry and Brogy which one of their catches were bigger. After they challenged one another to a duel, Kashii left Little Garden with the rest of the pirates."}, {"type": "paragraph", "text": "Around 40 years after Dorry and Brogy started their duel, Kashii was seen at Elbaf on the day before the Winter Solstice Festival. During a conversation with other giants, Kashii wondered how the duel between Dorry and Brogy could take so long. He then asked Charlotte Linlin if she and her friends were ready for the event."}], "images": []}, {"title": "The World Government's Lie", "level": 4, "content": [{"type": "paragraph", "text": "About fifty years ago, thinking it strange that neither one of their bosses had returned yet, Kashii, along with Oimo, left Elbaf to return to Little Garden and find out what had become of their bosses. Along the way, they were captured by Marines, and were interrogated about their crew and purpose. They were then told that Dorry and Brogy had been captured and were imprisoned in the government's great prison. The World Government made a deal with them that if they worked for them for 100 years, they would set their bosses free and allow all four of them to return home together. Oimo and Kashii agreed, and became the guardians of Enies Lobby's front gates. For fifty years, they guarded the gates successfully."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ea/Kashii_and_Oimo_22_Years_Ago.png/revision/latest/scale-to-width-down/210?cb=20130624083911", "caption": "Oimo and Kashii twenty-two years before the start of the series."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After fifty years of service, they fight against the Franky Family, Straw Hat Pirates, and Galley-La Company foremen as soon as the three groups invaded the island. Due to it being nighttime, the giants are asleep when Luffy makes it through, but are awakened by a Marine shortly afterwards, at Spandam's command. They emerge to fight the majority of the Franky Family once they reach the Main Gate, and have no difficulty in deterring their efforts, bringing most of them down quickly. The tide soon turns against them, however, when the foremen, Zambai, Kiwi, and Mozu come to the gate riding Sodom and Gomorrah.  Kiwi and Mozu use their Hull Dismantler Slash to destroy Kashii's shoes, knocking him off-balance, and Paulie uses Timber Hitch Tug while Zambai blasts him in the face with a bazooka, knocking him down and against the gatehouse. Tilestone and Lulu use Tree Nail Lock to immobilize Kashii, and Zambai, standing on the giant's face, tricks Oimo into smashing his partner's face with his club, knocking him out."}, {"type": "paragraph", "text": "Kashii is unconscious while Oimo tells Usopp (still disguised as Sogeking) their story, and Usopp reveals that Dorry and Brogy were still fighting, and that the World Government had lied to them."}, {"type": "paragraph", "text": "Angered at being deceived for fifty years, Oimo and Kashii switched sides and swore vengeance upon the World Government that had kept them in the dark for so long. This was first revealed to the Houbantai, who had just managed to overwhelm the three Galley-La foremen, when they approached from the front gate and began attacking them. The two giants rampaged through the island, bringing the foremen with them, and arrived at the courthouse just in time to save the Franky Family from being overwhelmed by the Marines when Yokozuna was knocked out by one of the Just Eleven Jurymen. They took his place in guarding the door to the inner courthouse, keeping the Marines out, but not before flinging Sogeking up to the rooftop to rejoin the Straw Hats."}, {"type": "paragraph", "text": "While Oimo and Kashii proved very effective in guarding the courthouse, they eventually reached their limit, and were brought down when the Marines and Agents swarmed them. They were tied up along with the invaders in the courthouse (grinning constantly while they are bound, for some reason), but before any further actions could be taken against them, Spandam broadcasted to the entire island that he had accidentally triggered the Buster Call. All of the Marines and Agents flee to escape Enies Lobby, leaving the invaders and giants tied up at the courthouse."}, {"type": "paragraph", "text": "Soon afterwards, they are freed thanks to Paulie, who had tied himself up with his own ropes. Oimo and Kashii carry Sodom and Gomorrah while the Franky Family and Galley-La Foremen ride on the King Bulls. The giants encounter no difficulty as they head towards the front of the island, where the Puffing Tom waits. Upon reaching the sea train, however, they find themselves facing three Marine battleships, onto which the Marines and Agents stationed in Enies Lobby are boarding. The cannons and rifles on board aimed at them, they can do nothing but hold their ground until the battleships finally fire, hitting them with enough force to blow away the front gate and seemingly killing them."}, {"type": "paragraph", "text": "However, shortly after Luffy defeats Rob Lucci of the CP9, it is revealed that thanks to Paulie's ropes, they all managed to escape death by hanging on the side of the island. With nobody guarding the front gate anymore, they clamber back to the island and board the Puffing Tom. Upon hearing that the Straw Hats have escaped, they set out from Enies Lobby themselves, for a smooth voyage back to Water 7."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Kashii_and_Oimo_Help_Allies_Escape.png/revision/latest/scale-to-width-down/230?cb=20150308231310", "caption": "Oimo and Kashii help the Franky Family and Galley-La foremen escape."}]}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Oimo and Kashii are next seen helping to repair Water 7 from the effects of Aqua Laguna, Usopp alongside them. The two decide that they cannot go to Little Garden if their bosses are still fighting, so they decide to stay on Water 7 for a while to help rebuild it, and then go back to Elbaf. They invite Usopp to join them, and he considers the offer, but ultimately declines in order to rejoin the Straw Hat Pirates. The giants also attend the Straw Hats' barbecue party after Luffy awakens, and after the Straw Hats' departure from Water 7, they express their anticipation of the crew visiting Elbaf someday."}], "images": []}, {"title": "Thriller Bark Saga", "level": 3, "content": [], "images": []}, {"title": "Where They Are Now", "level": 4, "content": [{"type": "paragraph", "text": "In the aftermath of the events at Water 7, Oimo is seen leaving for Elbaf with Kashii."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kashii and Oimo vs. Kairiki Destroyers", "elements": []}, {"text": "Kashii vs. Paulie, Tilestone, Peepley Lulu, Sodom, Gomorrah, Zambai, Kiwi and Mozu", "elements": []}, {"text": "Oimo and Kashii vs. Franky Family", "elements": []}, {"text": "Oimo, Kashii, and Sogeking vs. Marine Officers and Government Agents", "elements": []}, {"text": "Oimo, Kashii, Franky Family, and Galley-La foremen vs. Some of Just Eleven Jurymen, Marine Officers, and Government Agents (front of the courthouse)", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Considering that the entire Little Garden arc was cut in the 4Kids version, their leaders Dorry and Brogy would never meet the Straw Hats. It is unknown how 4Kids would have avoided the potential plot hole that was created in the process."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}]}