{"sections": [{"title": "Pearl", "level": 1, "content": [{"type": "paragraph", "text": "Pearl the Iron Wall is the commander of the Krieg Pirates' second unit. Due to his actions, he can be considered the tertiary antagonist of the Baratie Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "A towering man, Pearl's ensemble includes two large iron plates covering his front and backside, as well as two small plates with large pearls embedded in them for strong, blunt attacks. When introduced, he claims that he is \"a shield man\", but also \"a dandy man\", referring to the iron plates he wears on his body, as well as his notably handsome face."}, {"type": "paragraph", "text": "In the manga, as seen on Volume 8's cover page, Pearls iron plates have an orange and white design, and his hair is also orange, while in the anime, his plates are shining metal gray with black linings, and his hair is black."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pearl appeared to be somewhat cocky, claiming to have never lost a drop of blood in battle, as well as calling himself \"dandy\". He also shares Krieg's belief of using any means to achieve victory, even if it means playing dirty. However, should he see even a drop of his own blood spilled, he goes into a panicked frenzy, possibly suffering from hemophobia or having his perfect record tarnished angers him. Also, despite his arrogance, Pearl acknowledges the superior strength of Gin and Krieg."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Befitting his epithet, Pearl is clad in iron plates to serve as his armor which grants him a high-level defense, as well as his gauntlets for damage augmentation. This makes him impervious to bullets and, said by his crew mates, cannonballs. With this, he claimed that he has gone 61 battles without losing a drop of blood, and also boasted about being able to take a battleship's cannon shot uninjured."}, {"type": "paragraph", "text": "Although Pearl has iron armor and uses his gauntlets to block his unarmored face, if he is by chance injured, Pearl is noted to start panicking, protecting himself by causing friction sparks to ignite his body with a defensive layer of intensely hot blue flames, becoming \"Fire Pearl\"; surprisingly, Pearl is not affected by the high heat of the flames that coat his own body. He is able to set people alight with flames in this state. He can also shoot multiple fireballs, composed of pearls that are ignited by his flames, as seen when he tried to use this to destroy the Baratie. However, these were stopped by a kick from Zeff."}, {"type": "paragraph", "text": "Pearl's attacks all involve bashing and/or crushing his enemies with his hard shields, as well as using his fire to augment his strikes, and to spread the destruction, the latter which may be more indiscriminate, as he nearly burned down the Baratie, the ship that his crew planned to take as their new flagship; this, coupled with his frenzy from bleeding, caused even Krieg to become worried, bordering on fear."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Sanji_vs._Pearl.png/revision/latest/scale-to-width-down/210?cb=20130118032959", "caption": "Pearl ignites his shields to defend himself."}]}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Pearl Present (パール　プレセント, Pāru Puresento): Pearl punches his enemy with the shield on one of his fists. This was powerful enough to knock Patty and Carne from the Baratie out of the fight for a while. In the English versions, this is called Pearl Surprise.", "elements": []}]}, {"type": "list", "elements": [{"text": "Fire Pearl Daitokuten (ファイアー パール 大特典, Faiā Pāru Daitokuten, literally meaning \"Fire Pearl Huge Favor\"): Believing himself to be in immediate danger from an opponent, Pearl lights himself on fire before throwing small, flaming pearls at a target. This is called Fire Pearl \"Lucky You!\" in the Viz Manga and Fire Pearls Special Treat in the FUNimation dub.", "elements": []}]}, {"type": "list", "elements": [{"text": "Fire Pearl Present (ファイアー パール　プレセント, Faiā Pāru Puresento): Essentially the same as Pearl Present, except Pearl's shield is on fire when he punches, making the attack more devastating. In the English versions, this is called Fire Pearl Surprise.", "elements": []}]}, {"type": "list", "elements": [{"text": "Cho Tennen Pearl Present (超天然 パール　プレセント, Chō Tennen Pāru Puresento, literally meaning \"Ultra Natural Pearl Present\"): Pearl throws a shield-punch similar to Pearl Present, only much harder. The joke behind the attack's name is that the stronger attack is named after a higher-value pearl. In the English versions, this is called Absolutely Natural Pearl Surprise.", "elements": []}]}, {"type": "list", "elements": [{"text": "Pearl Close (パール クローズ, Pāru Kurōzu): Pearl slams his left-hand and right-hand shields together on either side of his opponent's head. In the English versions, this is called Pearl Cymbals.", "elements": []}]}, {"type": "list", "elements": [{"text": "Service Pearl Ishibigin Present (サービス パール イシビギン　プレセント, Sābisu Pāru Ishibigin Puresento, literally meaning \"Service Pearl Oxidized Silver Present\"): A manga only attack, Pearl leaps into the air and lands head-first onto his opponent, crushing them using his helmet pearl and his weight. In the English versions, this is called Tarnished Silver Surprise.", "elements": []}]}, {"type": "list", "elements": [{"text": "Dameoshi Pearl Present (ダメ押し パール プレセント, Dameoshi Pāru Puresento, literally meaning \"Double-certain Pearl Present\"): When facing an opponent who's already sustained severe injuries, Pearl punches them very hard with his hand's shield to make sure they stay down. In the English versions, this is called Double-Check Pearl Surprise.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Fire_Pearl.png/revision/latest/scale-to-width-down/210?cb=20130118033528", "caption": "Pearl firing his \"Fire Pearl\"."}]}, {"title": "Video Game Only Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Krieg Kantai Delta Explosion (クリーク艦隊・デルタエクスプロージョン, Kurīku Kantai Deruta Ekusupurōjon, literally meaning \"Krieg Fleet Delta Explosion\"): Working in tandem with Krieg and Gin, the three charge an opponent simultaneously. Gin strikes with his tonfa, Krieg with his Daisenso, and Pearl with one of his handheld shields. This attack can focus on a single enemy or damage multiple enemies at once. The technique appears in One Piece Treasure Cruise.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Pearl is said to have been raised in a jungle, which is reflected in his habit to start a fire whenever he feels he is in danger. He eventually joined the Krieg Pirates and became the commander of the second division. Eventually, the crew tried to conquer the Grand Line, in which they were overwhelmed by Dracule Mihawk on the seventh day. The remaining 100 members managed to retreat and return to the East Blue due to a storm preventing the Dreadnaught Sabre from being destroyed by the Shichibukai. However, Pearl and the rest of the crew were severely weakened from starvation."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Baratie Arc", "level": 4, "content": [{"type": "paragraph", "text": "After arriving at the Baratie, Krieg fed Pearl in order to replenish his strength. During the battle against the chefs, Pearl climbed onto the ocean-going restaurant and defeated Patty and Carne, both cooks who are strong enough to hold back the lower crew members. Pearl was then initially (and accidentally) knocked out after Luffy injured him and made him bleed for the first time in battle."}, {"type": "paragraph", "text": "Pearl soon recovered and thrashed Sanji around (as Gin was holding Zeff hostage). However, Gin knocked out Pearl himself by shattering his iron plate shielding, claiming he reserved the right to kill Sanji himself. Pearl was last seen being carried off by a boat along with the rest of the defeated crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Gin_Destroys_Pearl%27s_Iron_Wall.png/revision/latest/scale-to-width-down/230?cb=20130118034609", "caption": "Gin shatters Pearl's iron shield."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Krieg Pirates vs. Dracule Mihawk", "elements": []}, {"text": "Pearl vs. Patty and Carne", "elements": []}, {"text": "Pearl vs. Sanji and Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids English dub, Pearl has a \"surfer dude\" accent, while in the FUNimation dub, he has a light English accent. Also in the English versions, he is called \"Invincible Pearl\" instead the \"Iron Wall\", as \"Iron Wall\" is a Japanese term that is synonymous with invincibility."}, {"type": "paragraph", "text": "Due to a mistranslation, VIZ Media has mislabeled Pearl as the Second Mate of the Krieg Pirates. However, in the original Japanese, he is the \"Second Unit Commander\" (第2部隊 隊長, Dainibutai Taichō)."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Pearl's jungle background is discussed in the manga but not the anime.", "elements": []}, {"text": "Pearl's favorite food is scallops.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 7 Chapter 54 (p. 7) and Episode 25, Pearl debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 7 Chapter 54 (p. 8) and Episode 25, Pearl is introduced.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Pearl's information is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 7 Chapter 59 and Episode 27, Gin defeats Pearl by easily breaking his iron shield in one strike.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 7 Chapter 55 and Episode 25, Pearl uses his iron shields to strike down Patty and Carne, and block Sanji's kicks.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 7 Chapter 55, In the manga only: Pearl's childhood is explained by the Krieg Pirates.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 6 Chapter 48 and Episode 23, Gin describes how Krieg's fleet was decimated by Mihawk.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 7 Chapter 54.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 7 Chapter 55.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 8 Chapter 67 and Episode 30, Pearl's backside shield is seen amongst the pile of pirates on the small boat.", "elements": []}]}], "images": []}]}