{"sections": [{"title": "Candre", "level": 1, "content": [{"type": "paragraph", "text": "Candre is Andre's twin brother and an officer within the Marines."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a tall man with a long squared face and a black afro. Like his twin brother, he also has thick lips. He wears a white shirt, a dark-color tie and jacket. Over them, he also wears a Marine high-ranking officer coat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Candre_as_a_Young_Marine.png/revision/latest/scale-to-width-down/150?cb=20170103201419", "caption": "Candre as a young Marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nothing is known about Candre's personality, except he chose to become a Marine while his twin brother became a pirate."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He's shown wearing a Marine high-rank officer coat, so he is supposed to be strong enough to get this rank."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "While Andre became a pirate, Candre became a Marine."}], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "Candre fought against the Whitebeard Pirates at Marineford."}, {"type": "paragraph", "text": "He was shown to be shocked by Luffy and the Impel Down prisoners' arrival at Marineford."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Z", "level": 3, "content": [{"type": "paragraph", "text": "Candre was seen attending the conference held by Fleet Admiral Sakazuki alongside other high-ranking officers to discuss former Admiral Zephyr destroying the first Endpoint in the New World."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Candre was replaced with a Marine with brown hair, rather than black hair. The only resemblance this Marine bears with Candre are their jawline and puffy hair. In terms of actual resemblance to his twin brother or the manga version of him, he bears little similarity."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/24/Candre_Anime_Infobox.png/revision/latest/scale-to-width-down/180?cb=20170103203336", "caption": "The Marine that replaces Candre in the anime."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In an SBS, a fan asked if Andre's and his twin brother Candre's names were a reference to Yōsui Inoue, a musician who debuted under the stage name Andre Candre and wore an afro at the time. Oda affirms it as well as saying that he knows nothing of Andre Candre, only knowing the name from television, and that there wasn't much thought behind it.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 57 Chapter 557 (p. 10), Candre debuts.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963 (p. 14-15), Candre's brother, Andre, is revealed to have been a pirate as early as 30 years ago.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World, Andre's birthday is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 70, Andre is revealed to have a twin brother named Candre.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 70, Candre is said to have fought at the Battle of Marineford.", "elements": []}, {"text": "↑  One Piece Anime — Episode 466, Candre is replaced by a random Marine.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 71, Is this referencing Inoue Yousui-san from around his debut over 40 years ago?", "elements": []}]}], "images": []}]}