{"sections": [{"title": "Leo", "level": 1, "content": [{"type": "paragraph", "text": "\"Warrior\" Leo is a dwarf from the Tontatta Kingdom and the leader of the \"Tonta Corps \" (トンタ兵長, Tonta-heichō), which was later reformed as a pirate crew now known as the Tontatta Pirates, with Leo now acting as the captain. He is the captain of the fifth ship of the Straw Hat Grand Fleet."}, {"type": "paragraph", "text": "He is an ally of Luffy during the Dressrosa Arc, and one of the central characters from The Stories of the Self-Proclaimed Straw Hat Grand Fleet Cover Page Serial."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Leo, like all the other dwarves, is small and has a large fluffy tail and a pointy nose. He has long brown hair and wears a green hat similar to a crown that has one of its points bent. He also wears a jumper, goggles, boots, gloves, and a tie. He usually carries a gun with him."}, {"type": "paragraph", "text": "After becoming a pirate, Leo wears a dark-colored pirate coat and a pirate hat with his crew's jolly roger on it. The hat has two feathers on the left side. He also holds a cutlass sword."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Leo has a warrior-like personality, which befits his role as the leader of his kingdom's military corps. He follows the laws of his kingdom closely, as he demanded Robin give a weapon or her clothes in exchange for her freedom. He is also trusted by the other dwarves in the kingdom to lead them into battles, and to issue commands and instructions when needed."}, {"type": "paragraph", "text": "Like his fellow dwarves, Leo is extremely gullible. However, he appears to possess an additional, humorous measure of obliviousness, as he misinterprets Princess Mansherry's flirtatious behavior towards him as selfishness, meanness, and capriciousness, not realizing that it is actually caused by her feelings of affection towards him."}, {"type": "paragraph", "text": "Despite his gullibility, Leo refused to believe Trebol when he said that Usopp lied to them about being a hero."}, {"type": "paragraph", "text": "He, like Kin'emon, appears to have little knowledge of Devil Fruits, as he referred to his and Robin's powers as magic."}, {"type": "paragraph", "text": "Leo is also righteous as when Charlos tried to enslave Shirahoshi, Leo did not hesitate to come to her defense, showing that he is willing to defy a World Noble."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Grabar", "level": 4, "content": [{"type": "paragraph", "text": "Grabar is Leo's grandmother. It is clear he loves her very much, given he stitched her to their house so she would be safe."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Mansherry", "level": 4, "content": [{"type": "paragraph", "text": "Even though Leo has stated that Mansherry is selfish, he still cares about her. Mansherry is also shown to have a crush on Leo and was very happy when he saved her. However, Leo is oblivious to Mansherry's affections for him, regularly misinterpreting her actions towards him as proof of her selfishness or fickleness."}], "images": []}, {"title": "Tontatta Kingdom", "level": 4, "content": [{"type": "paragraph", "text": "Leo has a very good relationship with his fellow Dwarves of the Tontatta Kingdom. The Dwarves all have a great trust in Leo's fighting skills, believing he would successfully save the Princess. He was also very determined to save his allies at the SMILE's factory as well."}], "images": []}, {"title": "Kyros", "level": 4, "content": [{"type": "paragraph", "text": "Kyros, while as the Thunder Soldier, was his captain of the army as Leo had a high respect for him. In fact, he views Kyros as the one responsible for giving them hope in their fight against Doflamingo since if not for him, Leo and the other Tontatta dwarves would become slaves due to their gullibility. Leo soundly believed that Kyros would be the only one able to defeat Doflamingo and, despite being all but forgotten, believed the soldier's story about him being the legendary gladiator."}, {"type": "paragraph", "text": "When meeting Kyros in his human form, he was amazed at how he resembled his statue and followed the latter's request to heal the wounded. After Doflamingo's defeat, Leo and the dwarves built a statue for Kyros to honor his status as a hero for the island."}], "images": []}, {"title": "Riku Family", "level": 4, "content": [{"type": "paragraph", "text": "Leo has known the Riku family since his childhood. He was very close with both Viola and Scarlett, to which Leo would get into trouble with Viola as children and receiving a scolding from Doldo from time to time. Leo also deeply misses Scarlett, mentioning how everyone loved her."}], "images": []}, {"title": "Usopp", "level": 4, "content": [{"type": "paragraph", "text": "Believing Usopp to be a descendant of the legendary Mont Blanc Noland, Leo worshiped him as the \"legendary hero\" and believed him to be the one who would help them complete Operation SOP. Because of his lies, Leo and the others called him \"Usoland\". Even when Trebol stated Usopp was not a hero and would just abandon them when he got the chance, Leo quickly defended him stating that he was not a coward."}, {"type": "paragraph", "text": "After Leo was brutally crushed by Trebol, Usopp returned filled with guilt for running away and although Leo was heartbroken by his lies, he was moved again upon seeing Usopp proclaiming he would become their true legendary hero in his fight with Trebol and Sugar. Though he was horribly beaten, Usopp succeeded in knocking Sugar out and saving the toy slaves. Leo then wept at Usopp's success, promising they would build him a statue alongside Noland for his efforts. He also cheered when Usopp gained followers to help the dwarves' plans to defeat Doflamingo."}, {"type": "paragraph", "text": "During Doflamingo's Birdcage game, Leo and his group protected Usopp from those who sought the bounty on his head."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Leo and the dwarves built a statue for Usopp, honoring his status as a hero."}], "images": []}, {"title": "Sai", "level": 4, "content": [{"type": "paragraph", "text": "Leo is well acquainted with Sai as they both consider each other as comrades. When Leo tried to save Shirahoshi from Charlos, Sai quickly went to back him up."}], "images": []}, {"title": "Friends of the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "Leo and Rebecca quickly befriended Vivi after knowing they share a a mutual friend. Leo even attempted to save Shirahoshi from being a slave after knowing she is also a friend of his boss even if it meant coming into conflict with the World Noble Charlos and CP-0."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Leo has nothing but bitter hatred for the Shichibukai due to his evil rule over the Dressrosa Kingdom and for enslaving his friends at the SMILE's factory. He vowed to stop Doflamingo's evil plans and return the kingdom to the rule of the Riku family."}], "images": []}, {"title": "Trebol and Sugar", "level": 4, "content": [{"type": "paragraph", "text": "Leo despises both Trebol and Sugar for being the very ones who helped enslave his people and turn the people of Dressrosa into toys with Sugar's Hobi Hobi no Mi powers. He intended to force a hot spice Tobacco ball down Sugar's throat to make her lose consciousness and undo her curse. Though the plan didn't go as he had hoped, he and the Dwarves succeeded in Operation SOP thereby ending Doflamingo's rule over Dressrosa forever."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a dwarf, Leo possesses extreme physical strength, extreme agility, and the ability to cultivate any kind of plant. He seems to be very resilient as he was able to survive an explosion. The fact that he is the chief soldier suggests that his fighting ability is higher than that of the other dwarves."}, {"type": "paragraph", "text": "With his speed, he can use a needle in conjunction with his Devil Fruit powers to swiftly bind multiple unconscious Donquixote Pirates executives and subordinates of Giolla."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Leo ate the Nui Nui no Mi, a Paramecia-class Devil Fruit that grants him the ability to stitch things together and un-stitch them like nothing happened. The stitches are strong enough to immobilize a person on the ground. Leo also uses it in combat to sew his enemies together and make them slam into each other."}, {"type": "paragraph", "text": "Leo refers to it as magic \"Nui Nui\" Power (\"ぬいぬい\"の力, Nui Nui no Chikara) rather than a Devil Fruit."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ef/Nui_Nui_Needle.png/revision/latest/scale-to-width-down/210?cb=20160615162929", "caption": "Leo uses his ability to sew together everything in his house."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Leo is seen wielding a pistol (which is as large as a bazooka in relative to his size), but his skill in using it, or whether he is actually capable of using it at all, is unknown. He wears a pair of needles strapped to his belt in order to use his Nui Nui power. The needles are also used as makeshift swords. After becoming a pirate, he carries a cutlass."}], "images": []}, {"title": "Tontatta Combat", "level": 3, "content": [{"type": "paragraph", "text": "Leo is also capable of using Tontatta Combat, although his exact skill level is unknown. He is able to at least use \"Tontatta Tail Hammer\", a technique strong enough to knock down a normal person into the ground, as it was seen being used against some of Doflamingo's underlings to sneak into the tower where Sugar was located."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "On Green Bit, Leo responded to the Marines when they asked if he was a member of the Straw Hat Pirates, and asked them whether they were good guys or bad guys. When the Marines responded that they were the good guys, Leo told them to give up their weapons. When the Marines refused, he proceeded to strip them of all their belongings. When Nico Robin caught Kabu shortly thereafter, Leo and the other dwarves present captured both Robin and Usopp by putting them to sleep with anesthetic flowers. They then brought the pirates to their underground kingdom."}, {"type": "paragraph", "text": "Leo used his Devil Fruit ability to pin Robin to the ground while the other dwarves search her body and her bag. When she woke up, the dwarves were alarmed and Leo began interrogating her, questioning if she was an evil person. When Robin told the dwarves that she meant no harm and would not tell anyone about their existence, Leo easily trusted her and removed his stitches with a cheerful smile. When Robin tried to leave, Leo demanded that she give them a weapon or they would remove all of her possessions, including clothing. Since Robin did not have any weapons with her, Leo and the other dwarves attempted to remove her clothes. However, Flapper stopped them and told them not to harm Robin because she is a friend of the \"hero\", Usoland."}, {"type": "paragraph", "text": "While Usopp and Robin were having a feast with the dwarves, Robin noticed a statue of Mont Blanc Noland. Leo then told her about how Noland helped Tontatta Kingdom in the past. Believing Usopp to be the descendant of Noland as well as a great man, Leo and the other dwarves request Usopp to lead them in the battle against the Donquixote Family."}, {"type": "paragraph", "text": "Later, Leo was seen bidding his grandmother goodbye and preparing for his journey. Outside, Usopp asked him why the dwarves want to battle Doflamingo. The dwarves laughed, and said that they of course wanted to destroy the \"Dark Factory\", in which their five hundred friends had been forced to be slaves. Leo told Usopp about Princess Mansherry who was rather rude and self centered, but they all loved her anyway because she was a friend. The dwarves began to depart, stating that they have business underneath Corrida Colosseum, where the toy factory resides."}, {"type": "paragraph", "text": "When preparations were completed, the army of dwarves marched to Dressrosa through an underground passage with the bugs and animals that they tamed while bringing Usopp and Robin along. They later gathered at the Riku Royal Army Headquarters hidden beneath Flower Hill and listened to Thunder Soldier's speech about overthrowing Donquixote Doflamingo. He, along with the rest of the dwarves present, listened as Gancho described their past history with the Donquixote Family to Robin, Usopp, and Franky, weeping at the thought of his ancestors' misfortune. When his ruler mentioned King Riku Doldo III, Leo reacted with great joy. After Gancho's speech about stopping Doflamingo from repeating his ancestor's atrocities, Leo cheered vigorously, ready for battle."}, {"type": "paragraph", "text": "After Thunder Soldier explained the tragedy of Dressrosa to the three Straw Hats, Leo declared to the dwarf army that the time for battle had come especially after realizing that Doflamingo's resignation was false news."}, {"type": "paragraph", "text": "When it was finally time to commence the decisive Operation SOP, the rebels began their infiltration to underground world through a secret tunnel. When they saw that Franky was too big to use the tunnel, Leo regrettably stated that they never assumed that big humans would be using it. While Franky took an alternative route, the rebels, Usopp, and Robin entered the tunnel. Leo, Bomba, and Rampo carried Usopp. Along the way, Leo helped explain the Donquixote Pirates hierarchy to Usopp and Robin. They eventually arrived at the trade port."}, {"type": "paragraph", "text": "After Thunder Soldier and a few dwarves separated from them, Leo explained that they went to the royal palace to attack Doflamingo as soon as Sugar is defeated. Leo then explained that Sugar is located at the central tower. When Usopp was spotted by two of Doflamingo's men, the dwarves stripped them. While they were confused, Leo and Rampo knocked them out. After Usopp and Robin put on disguises, the rebels continued on to the central tower."}, {"type": "paragraph", "text": "Once they arrived at the executive tower, Leo explained to Usopp about the connection between the tower and the scrap place. They then infiltrated the tower and went to the room where Sugar and Trebol were located. Leo devised a strategy to take down Sugar. He took out a block of Tatababasco, which is known as the hottest spice in the world and the dwarves made it shaped like a grape. Leo planned to place the spice into Sugar's basket of grapes in the hopes that Sugar would eat it. As he went forward to execute his plan, he declared that once Sugar started screaming, the operation would be a success."}, {"type": "paragraph", "text": "After seeing Trebol shoot a fly with great accuracy, Robin stopped Leo from going into the room, knowing that Trebol would be able to spot him. When Bian caused a commotion in the trade port with an army of wasps, Robin lured Trebol out of the room. Once Trebol was out of the tower, the dwarves charged in and rushed at Sugar. The attack failed as Sugar transformed some of the dwarves into her toy servants and ordered them to kill all the intruders in the tower. Having forgotten about the dwarves that were just transformed, Leo's group engaged in battle with their former comrades."}, {"type": "paragraph", "text": "They were interrupted when a ship thrown by Trebol crashed into the tower. Trebol then captured Leo and his fellow dwarves with his sticky substance. After tricking Leo into revealing with whom they were allied, Trebol ignited the sticky substance, causing it to explode. Leo was then blown away to where Usopp was. After picking up Leo, Usopp urged that they should retreat. However, Leo was insistent on completing the operation so Thunder Soldier could fight Doflamingo. When Usopp asked him why the dwarves put so much faith in the toy soldier, Leo revealed that Thunder Soldier is the only toy who can rebel against Doflamingo and that he is none other than Kyros. With all the dwarves incapacitated, Leo put his faith in Usopp."}, {"type": "paragraph", "text": "To show his faith, Leo and his fallen comrades begin chanting \"Usoland.\" When Trebol asked what he was chanting, Leo declared that Usoland will save not just the dwarves, but all the enslaved toys as well. Trebol only laughed at their faith, saying that they were lied to and their savior was not coming and probably somewhere laughing at their misery. He then told the dwarves that their faith in him was misplaced. Leo furiously dismissed Trebol's remarks, saying that Usoland will definitely save them. Before Leo can say anymore, Trebol stomped the dwarf with his foot. When Usopp showed up to save them, he admitted that he was not what he claimed to be and that he is really a lying pirate. Although saddened by the truth, the dwarves cheered for Usopp when he launched an attack against Trebol."}, {"type": "paragraph", "text": "The dwarves were worried when Usopp was overwhelmed by Trebol. When Sugar forced the spice into Usopp's mouth, Leo was shocked to see that Usopp's expression terrified Sugar so much that she lost consciousness. With the primary objective of Operation SOP completed, the dwarves wept over Usopp's success and declared that they will build a statue of Usopp. The dwarves then carried Usopp away from an enraged Trebol while Robin held him back. They were then surprised when Hajrudin picked up Usopp. When the former slaves declared their allegiance to their savior, Usopp ordered his newfound followers to destroy the SMILE factory and the dwarves shout out Usopp's name."}, {"type": "paragraph", "text": "Doflamingo later trapped Dressrosa in his \"Birdcage\" and forced everyone imprisoned into a survival game. During the chaos, Leo's group was reunited with Wicca and Kyros' dwarf group when Kin'emon arrived at the underground trade port. Leo thanked Kin'emon for bringing his comrades to them. Doflamingo also placed a price on the heads of twelve people. Leo and the dwarves were surprised when Doflamingo not only included Usopp in his hit list but also placed the highest price on his head. With Usopp's new followers turning into enemies, the dwarves, Usopp, Robin, Rebecca, Sabo, Koala, Hack, and Bartolomeo fled to the surface."}, {"type": "paragraph", "text": "After they (except for Sabo and Koala) ran through the colosseum stands, they eventually reached the top of the old King's Plateau. Leo and the other dwarves were then reunited with Riku Doldo III and Viola. During Viola's plea to her father to trust the Straw Hat Pirates, the dwarves chimed in, saying that they were saved and the curse set by Sugar was broken because of the pirates. Leo and Kabu then decided to accompany Rebecca and Bartolomeo to find Monkey D. Luffy."}, {"type": "paragraph", "text": "As Robin contacted Luffy through Den Den Mushi, Leo, Bartolomeo, Robin, and Rebecca planned to meet Luffy at the sunflower garden on the fourth level of the new King's Plateau."}, {"type": "paragraph", "text": "Leo then planned to travel to the new King's Plateau with the assistance of the beetles of the Tontatta Airlines Yellow Kabu. Robin, Rebecca, and Bartolomeo were uncertain of the idea since the beetles seemed too small to carry a person. Leo then explained that the beetles are the Tontatta Airlines \"jumping\" service and made Robin, Rebecca, and Bartolomeo jump down from the old King's Plateau. Leo rode on Rebecca's shoulder as they learned that they could use the beetles to jump from rooftop to rooftop. Leo reminded them to aim for the fourth level and warned them to watch out for attacks from below."}, {"type": "paragraph", "text": "After arriving at the new King's plateau and passing the giant Pica statue, Leo was contacted by Mansherry's aide, Maujii, via Den Den Mushi. Maujii informed Leo that Mansherry was not inside the SMILE factory and she might be located inside the royal palace. While flying over the second level, the group was attacked by Gladius. Leo, Kabu, and Rebecca were separated from Bartolomeo and Robin. After the two dwarves and Rebecca reached the fourth level, Leo and Kabu went ahead to find Mansherry."}, {"type": "paragraph", "text": "Inside the palace, Leo and Kabu fought their way through Doflamingo's men as they search for their princess. On their way to the palace chapel, Leo and Kabu were informed by Viola through Den Den Mushi that Mansherry was taken by Giolla and was being forced to use her healing powers. Leo and Kabu made haste, but Kabu was later caught in an explosion, forcing Leo to go ahead without him. Leo soon burst into the room where Mansherry was located. Giolla was about to sprinkle Mansherry's tears on the defeated Donquixote Pirates' officers, but Kabu arrived and knocked them away. While Giolla was caught off guard, Leo stitched the officers and subordinates onto Giolla's girth and pulled the string, sending them headfirst onto Giolla and knocking her out. Leo then caught Mansherry as she fell to the floor."}, {"type": "paragraph", "text": "Mansherry then gently asked Leo to carry her, saying that her legs hurt. Leo harshly declined her request, saying that her selfish side was showing. Leo then pointed out that she can heal her own legs. Mansherry grumpily stated that she would not run and told Leo that she never asked him to save her. Just when Leo was outraged at Mansherry's mood swings, Kabu whacked Leo on the head and told him to carry the princess. Leo then carried Mansherry on his back as he and Kabu left the room where Mansherry was held."}, {"type": "paragraph", "text": "After escaping the palace, the three dwarves met up with Kyros, Rebecca, and Robin at the Sunflower Field. Leo was then seen watching as the Birdcage started to shrink. Kyros then noticed that Leo was looking towards the palace with his mouth open and asked him whether something was wrong."}, {"type": "paragraph", "text": "Leo later witnessed the explosion on the palace roof in shock and asked if they should do anything to help. Robin and Kyros said that they should not because they would only become a burden to Luffy. After Luffy threw a wounded Trafalgar Law onto the Flower Field, Leo stood around him, preparing to stitch his arm back onto his body. Law decided to remain on the Flower Field, and Leo then left on Bartolomeo's staircase."}, {"type": "paragraph", "text": "After Kyros and the allied gladiators defeated the remaining Donquixote Pirates on the New King's Plateau, Leo explained to Dagama and Hajrudin that Mansherry was responsible for healing their wounds. When the Birdcage came close to the central streets, Leo aided Robin and the gladiators in their efforts to push back the Birdcage via Bartolomeo's barrier. Leo also explained that the effects of Mansherry's power are only temporarily and the healed would eventually return to their injured state."}, {"type": "paragraph", "text": "Once Luffy finally defeated Doflamingo, Leo witnessed the collapse of the Birdcage. Leo then cried with tears of joy as Luffy's victory was announced to Dressrosa. During the aftermath, the dwarves gathered in front of Kyros and saluted their commander as he disbanded the army."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, Leo and the dwarves prepared to assist the Straw Hats' escape from Dressrosa when the Marines were mobilized to pursue the pirates. Leo hindered the Marines by stitching their ships together. When he witnessed Issho preparing to strike Luffy and his allies with all the rubble from Dressrosa, Leo told his fellow dwarves to go to the Straw Hats' aid."}, {"type": "paragraph", "text": "Leo and his group later went with the Straw Hats to Orlumbus' flagship, the Yonta Maria. Leo explained that he received permission from Gancho to go with the Straw Hats. The dwarves led by Leo was then one of the seven groups that pledged their allegiance to the Straw Hats. When Luffy was asked to drink a sake cup to complete the agreement for an alliance, Luffy declined, much to the others' shock. Once Luffy explained that they can do whatever they want, the allies decided to forge the alliance anyway, forming the Straw Hat Grand Fleet. Sai, Bartolomeo, Leo, Cavendish, Ideo, Orlumbus, and Hajrudin sat down and drank their sake cups. Afterwards, they held a feast to celebrate their victory over Doflamingo."}, {"type": "paragraph", "text": "After receiving Luffy's Vivre Card and parting ways with the Straw Hats, Leo and his group returned to Dressrosa. Leo later presented some blueprints to some crafters. As the citizens were building statues of Luffy (as Lucy), Kyros, and Usopp, Leo told the citizens that the construction of the statues was their top priority."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Robin_Sewn_to_the_Ground.png/revision/latest/scale-to-width-down/210?cb=20190525224516", "caption": "Leo sews Robin to the ground and searches her."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/88/Leo_Prepares_the_Tatababasco.png/revision/latest/scale-to-width-down/210?cb=20160615151635", "caption": "Leo prepares to give Sugar the Tatababasco."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/80/Sugar_Little_Black_Bears.png/revision/latest/scale-to-width-down/210?cb=20150202024604", "caption": "Sugar turns the dwarves into little black bears."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8a/The_Dwarves_Celebrate_Usopp%27s_Victory.png/revision/latest/scale-to-width-down/210?cb=20160615152502", "caption": "The dwarves celebrate Usopp's unexpected victory."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8a/Journey_on_the_Yellow_Kabu.png/revision/latest/scale-to-width-down/210?cb=20160615163230", "caption": "Leo, Rebecca, Robin, and Bartolomeo use the Yellow Kabu to head toward the palace."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0c/Leo_Defeats_Giolla.png/revision/latest/scale-to-width-down/210?cb=20151018084429", "caption": "Leo defeats Giolla."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Rendevous_on_Flower_Field.png/revision/latest/scale-to-width-down/210?cb=20160615153550", "caption": "Leo and Mansherry treat Law's injuries."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/20/Straw_Hat_Grand_Fleet.png/revision/latest/scale-to-width-down/210?cb=20160613115353", "caption": "Leo and six other captains pledge their allegiance to Luffy."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "Sometime after the Straw Hats left Dressrosa, Leo and his group decided to become pirates. Afterwards, Leo and his group went to assist the Dressrosa citizens into rebuilding their homes. When the citizens gave them a new ship, Leo and his crew marveled at it before checking it out. Leo, Bian, and Kabu later had an audience with King Riku and they were assigned as escorts for the Levely."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As Leo and his crew traveled to the Levely with the Riku Family, they received the news of Luffy's exploits at Totto Land and they were proud of him."}, {"type": "paragraph", "text": "After arriving at Mary Geoise, he became acquainted with Nefertari Vivi after hearing her and Rebecca speak about Luffy. He later reunited with a fellow member of the Grand Fleet, Sai, who was planning to cut ties with his country after the Levely. Leo then joined Rebecca in asking Dalton if he was fond of Luffy as well."}, {"type": "paragraph", "text": "Later, Charlos tried to take Shirahoshi by force, so Leo and Sai rushed to save her but Rob Lucci stopped them. After Donquixote Mjosgard stopped Charlos and declared that he would help the Neptune Family in any way he could, Leo asked Mjosgard if he would be allowed to fight anyone to protect Shirahoshi."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/Sai_and_Leo_met_at_Mary_Geoise.png/revision/latest/scale-to-width-down/180?cb=20190519040616", "caption": "Leo and Sai meet at Mary Geoise."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tontatta dwarves vs. Trebol and Sugar", "elements": []}, {"text": "Leo vs. Giolla", "elements": []}, {"text": "Leo and Sai vs. Lucci", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Leo's favorite food is pumpkin and his least favorite is anything spicy.", "elements": []}]}], "images": []}]}