{"sections": [{"title": "Kabu", "level": 1, "content": [{"type": "paragraph", "text": "Kabu is a dwarf from Tontatta Kingdom who is the leader of the Yellow Kabu Squad and a member of the Tontatta Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Like all the other dwarves, Kabu is small and has a large fluffy tail and a pointy nose. He appears to be older and chubbier than the other dwarves. He also has a lot of facial hair. He sports a dark coat, with a double breasted button up shirt, and scarf."}, {"type": "paragraph", "text": "After becoming part of Leo's pirate crew, Kabu wears a light-colored pirate hat with the crew's jolly roger on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kabu appears to be protective of his people as he was seen warning the others about Robin's magic abilities. He is also perceptive enough to know why Mansherry is acting selfishly towards Leo alone, and derides Leo for not knowing that their princess has romantic feelings towards him. However, like the other dwarves, Kabu is also gullible."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "It can be assumed that Kabu possesses the same abilities as the rest of his people such as great strength, agility, and the ability to cultivate any plant."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Kabu ate the Mushi Mushi no Mi, Model: Kabutomushi, a Zoan-class Devil Fruit that allows him the ability to transform into a rhinoceros beetle."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries two lances on his back."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kabu and some of the other dwarves ambushed a group of Marines on Green Bit, stripping them of their clothes. As he and the others tried to run away, Nico Robin captured Kabu using her ability. While Robin spoke to him, the other dwarves put Robin and Usopp to sleep with anesthetic flowers and took them to Tontatta Kingdom. Kabu and the other dwarves searched Robin's body and backpack while she was unconscious and pinned to the ground."}, {"type": "paragraph", "text": "When Robin woke up, Kabu warned his fellow dwarves of the \"magic\" Robin uses. When Robin promised that she would not hurt them, the dwarves naively believed her and released her from her bindings."}, {"type": "paragraph", "text": "Kabu and the others believed Usopp was a great hero and the descendant of Mont Blanc Noland. When Robin and Usopp had a feast, Kabu and the other dwarves urged Usopp to eat as much as he wanted before he would lead them in the battle against the Donquixote Family."}, {"type": "paragraph", "text": "Kabu and his fellow dwarves prepared to assault a factory located beneath the Corrida Colosseum in order to rescue 500 of their captured brethren. When preparations are complete, the dwarves march towards Dressrosa through an underground passage with the animals and bugs that they tamed while bringing Usopp and Robin along."}, {"type": "paragraph", "text": "They later gathered at the Riku Royal Army Headquarters hidden beneath Flower Hill and listened to Thunder Soldier's speech about overthrowing Donquixote Doflamingo. After Usopp, Robin, and Franky were told the story about Doflamingo's takeover of Dressrosa ten years ago, Kabu and the other dwarves prepared for the battle ahead."}, {"type": "paragraph", "text": "The rebels planned to attack the underground world and their top priority is defeating Sugar, the Devil Fruit user who turned humans into toys. When it was finally time to commence the decisive operation, Kabu and Bian lead the charge and entered the secret tunnel to the underground world before Thunder Soldier, Usopp, and Robin. They eventually arrived at the trade port."}, {"type": "paragraph", "text": "After leaving Usopp, Robin, and the majority of the rebels to finish the operation, Kabu and a few other dwarves went with Thunder Soldier on a mission to assassinate Doflamingo at the royal palace. They were at the lift junction hiding in a crate while waiting for the elevator. They boarded the elevator, and when they reached mid-way to the palace, they were confronted by Lao G. Kabu tried to attack him but was easily repelled."}, {"type": "paragraph", "text": "The lift later reached the royal palace and Lao G continued to have the upper hand. When the palace shook because of Pica fighting against Luffy's group, Baxcon, Nubon, and Daikon managed to pin down Lao G. Kabu then urged Thunder Soldier to continue going after Doflamingo, and they proceeded together with Rampo."}, {"type": "paragraph", "text": "After escaping Lao G and fighting through several of Doflamingo's men, Kabu, Thunder Soldier, and Rampo run into Gladius. Kabu and Rampo attempted to attack Gladius, but the officer effortlessly caught both of them and subdued them with his powers. Kabu and Rampo were rendered unconscious afterwards."}, {"type": "paragraph", "text": "Kabu and his comrades were later found by Kin'emon and Wicca. They left the palace after the toys returned to their original forms."}, {"type": "paragraph", "text": "Sometime after Doflamingo trapped Dressrosa in his \"Birdcage\", Kabu and the other dwarves from Kyros' group reunited with Leo's group at the underground trade port when Kin'emon arrived there. After Doflamingo put a price on the heads of twelve people, including Usopp and Robin, the former toys turned on their saviors. The dwarves fled to the surface with Usopp, Robin, and their allies."}, {"type": "paragraph", "text": "After they (except for Sabo and Koala) ran through the colosseum stands, they eventually reached the top of the old King's Plateau. Kabu and the other dwarves were then reunited with Riku Doldo III and Viola. During Viola's plea to her father to trust the Straw Hat Pirates, the dwarves chimed in, saying that they were saved and the curse set by Sugar was broken because of the pirates. Kabu and Leo decided to accompany Rebecca and Bartolomeo to find Luffy."}, {"type": "paragraph", "text": "Kabu then summoned the Tontatta Airlines, a bunch of little beetles that are tied to a rope. Leo explained that using the beetles, they could glide their way to Flower Hill. Kabu accompanied the group as they jumped off the old King's Plateau and glided through the air."}, {"type": "paragraph", "text": "Kabu, Leo, Robin, Rebecca, and Bartolomeo left the old King's plateau and planned to meet Luffy at the fourth level of the new King's plateau. After reaching the new King's plateau and passing the giant Pica statue, the dwarves received word that Mansherry was not inside the SMILE Factory and could possibly be inside the royal palace. While flying over the second level, the group was attacked by Gladius. Kabu, Leo, and Rebecca were separated from Bartolomeo and Robin. After the two dwarves and Rebecca reached the fourth level, Kabu and Leo went ahead to find Mansherry."}, {"type": "paragraph", "text": "Inside the palace, Leo and Kabu fought their way through Doflamingo's men as they searched for their princess."}, {"type": "paragraph", "text": "On their way to the palace chapel, Kabu and Leo were informed by Viola through Den Den Mushi that Mansherry was taken by Giolla and was being forced to use her healing powers. Kabu and Leo made haste, but Kabu was later caught in an explosion, forcing Leo to go ahead without him. However, Kabu was able to reach Mansherry's location just in time to thwart Giolla's plan to revive the fallen Donquixote Pirates' officers by knocking them away from Mansherry's tears. After Leo defeated Giolla and saved Mansherry, Kabu thought to himself that Mansherry has not changed."}, {"type": "paragraph", "text": "After telling Leo to carry Mansherry, he and Leo then ran away with the princess. They soon met up with Kyros, Rebecca, and Robin at the Sunflower Field. He then witnessed the explosion on the palace roof, and later left Flower Hill along with the others on Bartolomeo's staircase."}, {"type": "paragraph", "text": "After Mansherry healed the Corrida Colosseum gladiators, Kabu carried her through the air so she could heal everyone in Dressrosa. When the effects of her healing began to wear off, Mansherry cried, but Kabu reassured her, saying she had saved countless lives."}, {"type": "paragraph", "text": "After Doflamingo's defeat and the collapse of the Birdcage, the dwarves gathered in front of Kyros and saluted their commander."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue the Straw Hats and their allies. The dwarves then assisted them by hindering the Marines. Leo's group, including Kabu, later went with the Straw Hats to Orlumbus' flagship, the Yonta Maria. The dwarves led by Leo was then one of the seven groups that pledged their allegiance to the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Pamu_Pamu_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20141215214103", "caption": "Gladius subdues Kabu and Rampo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6d/Kabu_Strikes_the_Fallen_Officers.png/revision/latest/scale-to-width-down/210?cb=20150127031604", "caption": "Kabu strikes the Donquixote Family officers."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "Sometime after the Straw Hats left Dressrosa, Kabu became part of Leo's newly-formed pirate group. When the citizens gave them a new ship, Kabu and the crew marveled at it before checking it out. Kabu, Bian, and Leo later had an audience with King Riku and they were assigned as escorts for the Levely."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Tonta Corps traveled to Mary Geoise with the Riku Family, they received the news of Luffy's exploits in Totto Land and they were proud of him."}, {"type": "paragraph", "text": "The Dressrosa participants later arrived at Mary Geoise. At the Mary Geoise castle, Kabu, Bian, and Leo accompanied Rebecca as she befriended Vivi and Shirahoshi."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kabu, Thunder Soldier, and members of the Tontatta Tribe vs. Lao G", "elements": []}, {"text": "Kabu and Rampo vs. Gladius", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name comes from kabutomushi (カブトムシ, kabutomushi), the Japanese name for the Japanese rhinoceros beetle.", "elements": []}]}], "images": []}]}