{"sections": [{"title": "Wicca", "level": 1, "content": [{"type": "paragraph", "text": "Wicca is a female dwarf from Tontatta Kingdom beneath Green Bit. She, along with other members of her kind often pose as Dressrosa's fairies and take their \"offerings\". She is a member of the Tontatta Pirates, the 5th Division of the Straw Hat Grand Fleet."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Wicca, like all the other dwarves, is small in stature and has a large fluffy tail and a pointy nose. She has light blue hair, and also wears a large blue hat, with a red stripe around it. She also wears a blue dress with a white scarf."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She is quite emotional and worries about her comrades, and will throw destructive tantrums when her worry gets the best of her. She is not afraid to speak her mind as shown when she insulted Zoro for his stupidity. Wicca is also older than she looks, as when Zoro asked what her age was, he was surprised to hear she was 27."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Despite her small size, she is incredibly powerful, capable of smashing the stone ground beneath her with ease, using nothing but her bare hands during her tantrum."}, {"type": "paragraph", "text": "She is also a member of the scouting unit on Dressrosa, which may further attest to her strength."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "When the Straw Hats were in a bar in Acacia, Wicca stealthily managed to steal Zoro's sword while they were not paying attention. When Zoro realized this, he spotted his sword being carried away outside and immediately went after it. A chase then ensued with the elusive Wicca trying to outrun Zoro, but eventually he captured the thief who, much to his surprise was a Dwarf."}, {"type": "paragraph", "text": "He then asked if she was a fairy and she quickly began to explain her origin as a dwarf from the Tontatta Tribe. Wicca stopped herself from saying anymore after realizing she was carelessly blurting out important information and tried to get away from Zoro, but found that she could not walk after she suffered injuries from crashing to the ground with her stolen loot when Zoro startled her. Since she sprained her leg, she begged Zoro to take her to the flower fields so she can report to her commander. She also informed Zoro that Doflamingo's crew was on their way to attack the Thousand Sunny. Zoro was about to rush to the shore, but Wicca urged him to take her to the flower field first."}, {"type": "paragraph", "text": "Wicca brought Zoro to the Riku Royal Army Headquarters hidden beneath the flower field. While Zoro watched Luffy competing in a tournament at the Corrida Colosseum via a video broadcast, Wicca tried to remind Zoro about the Thousand Sunny. Wicca and Zoro were then seen heading for the Sunny. On the way, Wicca informed Zoro about Giolla as well as Doflamingo's top three subordinates. They later ran into Sanji and Kin'emon."}, {"type": "paragraph", "text": "Sometime later when Luffy, Zoro, and Kin'emon arrived at the base of the royal plateau, Wicca informed them that they can reach the toy house and the underground factory through the royal palace. She also told them that Thunder Soldier's Operation S.O.P. had already begun and showed them the lift that leads to the entrance to the royal palace. There, Viola was waiting for them in order to lead them inside. Wicca, who happened to know Viola personally, got reacquainted with her before the group was led to a secret passage. She was surprised to know that Viola was monitoring the dwarves' and Thunder Soldier's movements using her ability. After going through a secret passage Viola knew about, Wicca and the group arrived at the palace rampart tower. Viola was about to sneak them in, but Luffy went ahead and smashed his way through the gate. Having alerted the guards, they decided to charge in."}, {"type": "paragraph", "text": "Wicca went with Kin'emon in his search for Kanjuro. While Kin'emon disguised himself as Doflamingo, Wicca guided him. When Kin'emon ran into Gladius, Wicca informed the samurai how Doflamingo's subordinates addressed their leader. Wicca and the dwarves that were with Kyros were later seen leaving the palace with Kin'emon."}, {"type": "paragraph", "text": "Doflamingo later trapped Dressrosa in his \"Birdcage\" and forced everyone imprisoned into a survival game. During the chaos, Kin'emon brought Wicca and Kyros' dwarf group to the underground trade port where they reunite with Leo's group. Doflamingo also placed a price on the heads of twelve people. The dwarves' allies, the Straw Hats, were included in his hit list. With Usopp's new followers turning into enemies, the dwarves, Usopp, Robin, Rebecca, Sabo, Koala, Hack, and Bartolomeo fled to the surface."}, {"type": "paragraph", "text": "After running through the colosseum stands, they arrived at the old King's Plateau and reunited with Riku Doldo III and Viola. Wicca and her group decided to go to the SMILE factory to assist Franky. After arriving at the factory, they used the pink bees to display a message to the enslaved dwarves, informing them of Doflamingo's trickery. The dwarves inside the factory managed to unlock the doors from the inside, allowing Franky and Wicca's group to enter."}, {"type": "paragraph", "text": "While Franky battled Senor Pink, the dwarves at the factory were contacted by Viola and they were worried when they heard that Mansherry was being forced to use her healing powers on the defeated Donquixote Pirates' officers. They were then overjoyed when Leo and Kabu successfully rescued Mansherry. They continued watching Franky's battle as he and Senor Pink took each other's blows. They cheered when Franky emerged victorious. With Senor Pink defeated, the dwarves proceed with the destruction of the SMILE factory."}, {"type": "paragraph", "text": "After the factory was demolished, the dwarves carried Franky back outside and started fleeing from the shrinking Birdcage. They later ran into Zoro, Kin'emon, and Kanjuro. Once Zoro informed them of his plan to hinder the Birdcage, the dwarves were awestruck. Since the factory could not be cut by the Birdcage, the dwarves and Franky used it to push the Birdcage back."}, {"type": "paragraph", "text": "When Luffy finally defeated Doflamingo and brought the Birdcage down, the dwarves rejoiced with tears of joy as Luffy's victory was announced to Dressrosa. During the aftermath, the dwarves gathered in front of Kyros and saluted their commander."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. The dwarves hindered the Marines by stealing their weapons. She was later seen on the Yonta Maria, celebrating the birth of the Straw Hats Grand Fleet."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/26/Zoro_Catches_Wicca.png/revision/latest/scale-to-width-down/210?cb=20160614221450", "caption": "Wicca is caught by Zoro after stealing his sword."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/Infiltrating_the_Dressrosa_Palace.png/revision/latest/scale-to-width-down/210?cb=20160614222203", "caption": "Wicca and Viola help Luffy, Zoro, and Kin'emon enter the palace."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Franky_and_Dwarves_Push_Factory.png/revision/latest/scale-to-width-down/210?cb=20160221225539", "caption": "The dwarves and Franky push on the Birdcage."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "Sometime after the Straw Hats left Dressrosa, Wicca became part of Leo's newly-formed pirate group. After they received a new ship from the Dressrosa citizens, the crew immediately checked it out."}], "images": []}]}