{"sections": [{"title": "Dwarves", "level": 1, "content": [{"type": "paragraph", "text": "Dwarves are a race in the One Piece world. They were first mentioned on a list of slave prices that Duval gave to Sanji. They sell for 700,000 as slaves."}, {"type": "paragraph", "text": "They were first seen in Green Bit when Robin and Usopp were exploring the forest at the northern part of the island off the coast of Dressrosa, they discovered a tribe of dwarves living on the island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dwarves are an extremely small sentient race. In comparison to an average sized human, their difference in height is approximately the same as that between a normal-sized human and an average-sized giant. They are mostly human in appearance, with chibi-like proportions, and often have pointed noses. Members of the Tontatta Tribe have thick fluffy tails."}], "images": []}, {"title": "Inter-species Relationships", "level": 2, "content": [{"type": "paragraph", "text": "The dwarves are valued as slaves by normal humans considering the standard price for a dwarf is 700,000."}, {"type": "paragraph", "text": "Dwarves refer to humans as \"Big Humans\" (大人間, Dai Ningen) and casually ask them whether they are good or bad and as a tradition a good human can prove him/herself by either giving up their weapons or being stripped of all their possessions. Dwarves are very careful not to be seen by any humans as they will try to kill anyone who sees them unless they promise not to tell anyone of their existence. They are also gullible to anything humans say to them, making them simple to be motivated by Kyros and easily fooled by Doflamingo. Dwarves are capable of reproducing with humans, as shown by the existence of Charlotte Normande, one of Charlotte Linlin's daughters."}, {"type": "paragraph", "text": "They are behind Dressrosa's belief in fairies and accept the country's offerings to them. However, most of the citizens are aware of their existence and only call them fairies as a facade."}, {"type": "paragraph", "text": "According to Wicca, they only show themselves to the Riku royal family, but they make an exception for Usopp and his friends."}, {"type": "paragraph", "text": "After Doldo III's return to the throne, the dwarves and the humans now coexist as peace returns to Dressrosa."}, {"type": "paragraph", "text": "Dwarves are one of the races known to live in Totto Land, where they live in harmony with other races."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Donquixote_Ancestor%27s_Cruelty.png/revision/latest/scale-to-width-down/210?cb=20160129205441", "caption": "The Donquixote king enslaving dwarves 900 years ago."}]}, {"title": "Overall Strength", "level": 2, "content": [{"type": "paragraph", "text": "Despite their small size, dwarves possess great strength, with a single dwarf being able to easily destroy a building. They are very fast, enough for them to disappear in a blink of an eye, making it nearly impossible for a normal person to see them. They are known as great cultivators as they stated that they can cultivate any plant, as evidenced by the abundance of plant life on Green Bit. However, they have trouble growing SMILE correctly, as it is artificial in nature. Dwarves are shown to be extremely gullible and trusting, easily convinced to believe anyone, even if they are obviously lying."}, {"type": "paragraph", "text": "Certain dwarves fight with a style known as Tontatta Combat, which utilizes their unique traits and strength of their race to bludgeon bigger opponents."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Franky_and_Dwarves_Push_Factory.png/revision/latest/scale-to-width-down/210?cb=20160221225539", "caption": "The dwarves were able to push an entire factory despite their size."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In real world folklore (especially in Scandinavian and other Germanic cultures), dwarves are a race of beings usually depicted as having some sort of supernatural powers and being skilled in crafting and metalworking.", "elements": [{"text": "In the same cultures, dwarves, or Tomte/Nisse (tomt being Norwegian and Danish for \"property\" or \"household\"), are beings typically depicted as small or \"the size of a horse's head\" with pointy ears and long hats similar to garden gnomes, are noted to \"borrow\" objects and food sometimes and to play pranks on humans, and are known to be immensely strong for their size, similar to the dwarves depicted in One Piece. They are said to live secretly at farms, often helping with tending to the animals, farming, or other work. However, they could also be very cross, mischievous, and even outright harmful if mistreated.", "elements": []}]}, {"text": "The Tontatta tribe is foreshadowed in the flashback of Noland's past. During one of his sessions recalling his adventures in the Grand Line, he mentions visiting a land of dwarves.", "elements": []}, {"text": "The tribe has the ability to hunt fighting fish, which are described as related to giant goldfish. Incidentally, in Chapter 24, Usopp lies to Kaya about hunting a giant goldfish and giving the meat to dwarves.", "elements": []}, {"text": "The first encounter between the dwarves and Nico Robin resembles the first encounter between Lemuel Gulliver and the Lilliputians in Gulliver's Travels.", "elements": []}, {"text": "All dwarves introduced thus far have been shown to frequently add \"-resu\" (a slurred form of -desu) to the ends of their sentences.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dwarf — Wikipedia article about fictional dwarves.", "elements": []}]}], "images": []}]}