{"sections": [{"title": "Foxy", "level": 1, "content": [{"type": "paragraph", "text": "Foxy the Silver Fox is the captain of the Foxy Pirates, and the main antagonist of the Long Ring Long Land Arc. In the anime he is also a main antagonist during the Foxy's Return Arc, and the secondary antagonist in the Spa Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Foxy is a stout man with skinny arms and legs. He has almost a cleft lip-like mouth and a unique hairstyle, with his hair split into two spikes pointing upwards. He has thick, triangles-like eyebrows, and is almost always seen grinning. His nose is also colored red, and it is long just like the nose of Kaku and Usopp. These characteristics make him look like a fox."}, {"type": "paragraph", "text": "Foxy typically wears yellow-orange pants, held up by suspenders, with large, rotund buckles on the edges, tucked inside black boots, which are white on the front part of the legs and have orange strings. Under his pants some sort of strange indument circling his waist can be seen, which is light-green with leaf-like motifs on it, and has orange laces on the front. It might be some sort of belt, even though in the anime it was shown as a pair of bermuda-like indument. In front of this, threaded in his pants, Foxy carries around a short wooden sword, which he uses to perform his Noro Noro Beam Sword technique."}, {"type": "paragraph", "text": "He has an elaborate necklace hanging on his chest, with many circular orange and yellow pendants, and a blue, bigger and more elaborate central one, with ears on it resembling those of a fox. He also sports a fur-lined coat, with a large collar and big buttons on the right side. His coat is colored purple in the anime, while it is colored silver in the manga and other manga related media."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Foxy is a cheater and trickster, who participates in the Davy Back Fight, a contest between pirate crews where the winning team can steal crew members from the losing team. Most members of Foxy's crew joined him because he won them in this contest. However, they seem to be genuinely enthusiastic about being in the Foxy Pirates, and wholeheartedly cheer on their crewmates and captain in the Davy Back Fight."}, {"type": "paragraph", "text": "Foxy also seems to honor a team's choice if they were to decide to win on their own. He thinks very highly of himself and believes that he is good-looking."}, {"type": "paragraph", "text": "Though he acts supremely confident most of the time and seems quite fond of himself, Foxy is extremely sensitive to insults or criticism. Any offensive words from others cause him to instantly become depressed, and he usually ends up losing his footing and falling to the ground, barely supporting himself with his arms, while a black cloud suddenly appears over his head. Though all it takes is a few kind words from anybody to perk him up again. In the anime, Nami and Usopp used this weakness to their advantage by alternately hurling insults and compliments at Foxy non-stop, leaving him emotionally (as well as physically) paralyzed and unable to help his team during the roller race."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "He is called \"Oyabin\" (おやびん, Oyabin, meaning \"boss\" in Japanese) by his crew members. His subordinates seem to idolize him to a degree, often commenting amazed at his techniques and deceits, and always supporting him. He's almost always accompanied by Porche and Hamburg; the first, in particular, seems to care deeply for her captain, always cheering him up whenever he gets depressed, while the latter often just start to laugh in those kind of situations."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "When Foxy first met the Straw Hats, he appeared to look down on them for their naivety and ignorance, despite their crew holding bounties far above his own. His overconfidence from being undefeated in Davy Back Fights led to him underestimating the crew, especially their captain, and believing his cheating ways would be enough to secure victories, even against a 100,000,000 bounty. He was later astounded by the crew's persistence and talents. The Straw Hats in turn were royally annoyed by Foxy's cheap tactics and continuously insulted the Silver Fox, leading him to be overly depressed (though he was quickly cheered up by his crew). After the Foxy Pirates lost, he vowed to get them back for his loss."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Due to the Straw Hats being the first to defeat him in a Davy Back Fight, Foxy has gained a grudge against them and was willing to do whatever it took to bring each of them down. Foxy later encountered them after his loss and was on more friendlier terms with them though he was comically threatened and beaten by Sanji and Nami. The Straw Hats assisted Foxy in taking back his ship but instead of thanking them, he attempted to get revenge but was once again defeated. However, Foxy was allowed to continue sailing. Foxy would then try to take the Straw Hats down after running into them at Spa Island but due to the interference of Franky and Brook (the Straw Hats' newest members), he was unsuccessful and genuinely angered that they acquired more crew mates since their last encounter."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Foxy is a very cunning character who uses his Devil Fruit powers as well as various other tricks to aid in him cheating."}, {"type": "paragraph", "text": "He also seems to have an extraordinary sense of time. Even when he had slowed down multiple cannonballs, he still knew exactly when each and every one of them was going to regain full speed."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "He is skilled in boxing and possesses considerable physical strength, as he can perform a barrage of powerful punches without getting tired."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Foxy ate the Noro Noro no Mi, a Paramecia-type Devil Fruit which allows him to fire microscopic particles as beams of light that can slow down his enemies or other objects for 30 seconds (he demonstrates this by slowing down a cannon ball fired at him, only to get hit by the cannonball anyway when he was gloating over its power for too long). When he cheats, he frequently uses these powers to increase the impact of his attacks or stop his opponents in their tracks. Luffy manages to beat this power by using a shard from a mirror he found on Foxy's ship, reflecting the Noroma photons back at him, then delivering a final blow with a 30 second delay."}, {"type": "paragraph", "text": "When Foxy uses his Noro Noro no Mi powers, he always holds his hands in the same position: his thumb, ring and middle fingers are pressed together while his other two fingers are pointing upwards. This gesture resembles the typical Japanese way of representing a fox with one's hands."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7a/Noro_Noro_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20130414195444", "caption": "Foxy using Noro Noro Beam."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Apart from his regular tricks, Foxy possesses a giant mechanical punching machine called the Gorilla Puncher #13 (ゴリラパンチャー13号, Gorira Panchā Jūsan-gō) which he can pilot to use against his opponent in the Combat portion of the Davy Back Fight. The machine's punches are capable of being set on fire and are supposedly even capable of burning sea monsters."}, {"type": "paragraph", "text": "Foxy also uses a giant ball launcher called Dead Hit-kun (デッドヒットくん, Deddo Hitto-kun)."}, {"type": "paragraph", "text": "Foxy is also seen using boxing gloves with spikes, similar to what Porchemy is seen with, during his fight with Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Gorilla_Puncher_13_Infobox.png/revision/latest/scale-to-width-down/210?cb=20130209215942", "caption": "Foxy's Gorilla Puncher #13."}]}, {"title": "Other", "level": 3, "content": [{"type": "paragraph", "text": "Aside from his Devil Fruit powers, Foxy uses various other tricks that aren't dependent on his powers. These range from disguises to using equipment that would otherwise be considered cheating in normal standards."}, {"type": "paragraph", "text": "The following are named techniques of Foxy that do not use his Devil Fruit powers:"}, {"type": "list", "elements": [{"text": "Uso Shiji Daisakusen (ウソ指示大作戦, Uso Shiji Daisakusen, literally meaning \"Great Strategy Lying Signpost\"): Foxy's 18th trick, he lays a signpost in the middle of the racetrack to mislead his opponents to take a detour and off the course. This was first used against the Barrel Tiger during the Donut Race, but Nami simply smashes the sign, as she saw through the trickery.", "elements": []}]}, {"type": "list", "elements": [{"text": "Uso Goal Daisakusen (ウソゴール大作戦, Uso Gōru Daisakusen, literally meaning \"Great Strategy Lying Goal\"): Foxy lays a fake goal post in the middle of the racetrack to mislead his opponents into thinking that they won the race and stop, allowing Foxy's own team to catch up. This was first used against the Barrel Tiger during the Donut Race, but Nami simply smashes the goal, as she saw through the trickery. On the other hand, the Cutie Wagon fell for the trickery, and stopped momentarily, thus Foxy's plan actually backfired.", "elements": []}]}, {"type": "list", "elements": [{"text": "Kyubi Rush (九尾ラッシュ, Kyūbi Rasshu, literally meaning \"Nine-Tails Rush\"): Foxy delivers a flurry of punches to his opponent at a rapid speed. The actual punches aren't particularly strong, but are made more powerful by first slowing his opponent down with his Noro Noro Beam so that, when the slowing effect ends, the force of all the punches administered by Foxy is released all at once. The name of this technique is derived by the Japanese mythological Nine-Tailed fox called Kyubi, in nod to Foxy's fox motif. A side-effect during this attack is that Foxy often loops his voice whilst punching, often yelling out \"Rush!\" repeatedly. This is called Nine-Tails Rush in the Viz Manga and Nine-Tailed Rush in the FUNimation dub. This was first seen being used against Luffy.", "elements": []}]}, {"type": "list", "elements": [{"text": "Glove Kyoka (グローブ強化, Gurōbu Kyōka, literally meaning \"Glove Upgrade\"): Realizing that Luffy cannot be seriously injured by normal punches, Foxy places blue spiked glove covers on his boxing gloves. The sharp points allow him to do more damage.", "elements": []}]}, {"type": "list", "elements": [{"text": "Foxy Shichihenge (フォクシー七変化, Fokushī Shichihenge, literally meaning \"Foxy Seven-Change Disguise\"): Foxy disguises himself in costumes to trick his opponent so that he can set up a sneak attack. Though he believes them to be brilliant, the disguises are so poor that only a complete moron (i.e. Luffy) would be fooled by them. This is called Foxy Face Transformation in the Viz Manga.", "elements": []}]}, {"type": "list", "elements": [{"text": "Counter Fox Blow (カウンターフォックスブロー, Kauntā Fokkusu Burō): Foxy slips a bear trap shaped like a fox's head on the end of his boxing glove and punches his opponent with it. This is called Fox Trap Counter-Attack in the Viz Manga.", "elements": []}]}, {"type": "list", "elements": [{"text": "Megaton Kyubi Rush (メガトン九尾ラッシュ, Megaton Kyūbi Rasshu, literally meaning \"Megaton Nine-Tails Rush\"): Foxy delivers a series of punches as with Kyubi Rush, only harder, faster, and with more punches. In the Viz Manga, this is called Megaton Nine-Tails Rush. This was first seen being used against Luffy.", "elements": []}]}, {"type": "list", "elements": [{"text": "Kuyashimagire Ipponzeoi (くやしまぎれ一本背負い, Kuyashimagire Ipponzeoi, literally meaning \"Overhead Throw of Revenge\"): A technique used by Foxy on Luffy when he lost the captain fight. Basically he offers his opponent a congratulatory handshake, but when they reach out to accept it, he just grabs their arm and flips them over his shoulder and smashes him into the ground... only to wind up smashing himself into the ground as Luffy's limbs are rubber. This is called Super Vengeance Shoulder Throw in the Viz Manga.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When he was a young adult, Foxy was a professional boxer who competed in tournaments. However, his boxing license was revoked 15 years ago after he tried to bring a weapon into the ring, disqualifying him from competing in any future tournaments. Two years later, he ate the Noro Noro no Mi. After another three years, he learned about the legend of Davy Jones and decided to become a pirate, using the Davy Back Fight to amass a crew."}], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [], "images": []}, {"title": "Challenging the Straw Hats and Donut Race", "level": 4, "content": [{"type": "paragraph", "text": "After acquiring some crewmembers from the Fanged Toad Pirates on Long Ring Long Land, Foxy decided to set his sights on some new prey, the Straw Hat pirates."}, {"type": "paragraph", "text": "Finding their captain and others interacting with Tonjit, a native of the island, Foxy decided to catch their attention by shooting the old man's horse. Having caught their attention, Foxy and his two associates, Hamburg and Porche, introduced themselves to the Straw Hats and revealed their true intentions. Explaining that he wanted to challenge the Straw Hats to a Davy Back Fight, Foxy goaded Luffy into accepting. Though Luffy hurt his pride several times in the discussion, Foxy succeeded in getting Luffy to accept his challenge.}"}, {"type": "paragraph", "text": "After the opening ceremony of the Davy Back Fight wherein Foxy paid his respects to Davy Jones, the captain slyly eyed on which Straw Hat he would like to take for his own."}, {"type": "paragraph", "text": "As the first game of the Davy Back Fight, the Donut Race, started, Foxy and the rest of his crew prepared to exploit the loop holes of the game. While his crew did what they can, Foxy accompanied with Hamburg decided to try to slow down the Straw Hats' racers with some tricks of theirs. Though the most of Foxy's tricks were rather useless against the Straw Hats, Foxy was able to slow them down with his Noro Noro powers at the last minute thus allowing his racers to win."}], "images": []}, {"title": "Groggy Ring and almost becoming a Straw Hat", "level": 4, "content": [{"type": "paragraph", "text": "With the first game won, Foxy explained his powers to the astonished Straw Hats and later took Tony Tony Chopper for his crew, the purpose of the latter was to give the Straw Hats a handicap in the next Davy Back Fight game as the reindeer doctor was a participant. Seeing the disability he gave Straw Hats in the next game by taking away one of their members, Foxy decided to not use his powers during the second game, with two of the Straw Hats with three of the biggest members of his crew, the Groggy Monsters."}, {"type": "paragraph", "text": "Though he decided on this, Foxy and the rest of his crew were surprised to find out that despite their handicap, the Straw Hats' players were able to hold their own against the Groggy Monsters. As the game went on with the Straw Hats' players coming back despite the abuse they were taking, Foxy decided to settle things once and for all by ordering a Monster Burger from the Groggy Monster. The odd request of which was an order for the Groggy Monsters to use their deadliest technique against the Straw Hats' players. Despite this however, the Straw Hats' players defeated the Groggy Monsters much to Foxy's surprise."}, {"type": "paragraph", "text": "With the second game lost to the Straw Hats, Foxy and his crew faced the consequences of either the Straw Hats regaining Chopper or having one of their taken from them. As Luffy was deciding, they learned a sly suggestion from the navigator of the Straw Hats, Nami, to choose Foxy. Since Foxy was the participant of the next and final game, not only would the Straw Hats would gain an instant win but they will not have to participate anymore in the Davy Back Fight. Hearing such an underhanded strategy, Foxy and his crew taunted the Straw Hats at thinking up such a trick even though they themselves also did such a thing in the previous game."}, {"type": "paragraph", "text": "Though their taunting convinced the Straw Hats a bit to not go through with such a strategy, they ultimately decided not to as they did not want a weirdo like Foxy in their crew. So with Foxy's feelings hurt instead, Luffy instead chooses to get Chopper back. Though the Straw Hats choose to take Chopper back, Foxy decided to pay back for the humiliation in the final game of the Davy Back, Combat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c7/Foxy_Being_Rejected_by_the_Straw_Hats.png/revision/latest/scale-to-width-down/210?cb=20140727105430", "caption": "Foxy's feelings get hurt when the Straw Hats say they do not want him in their crew."}]}, {"title": "Combat and Afterwards", "level": 4, "content": [{"type": "paragraph", "text": "After the location of the last event of Davy Back Fight, Combat, was \"conveniently\" chosen to be his ship, the Sexy Foxy, Foxy prepared himself to fight against Luffy. After some pre-battle formalities between the two, the match between Foxy and Luffy began."}, {"type": "paragraph", "text": "With the battle taking placing on his ship, Foxy exploited all the tools and tricks he had on board against Luffy. The battle raged on and took both Foxy and Luffy all over the Sexy Foxy, from on top to below deck. Eventually, the battle wore both fighters out as it continued.  At the climax of the battle with both fighters pushed to the limit, Foxy tried to use one last Noro Noro Beam on Luffy. Unfortunately, just as he fired, Luffy reflected Foxy's own beam back at him using a mirror shard he picked up during the battle. Completely unable to move fast enough due to the effects of his own Devil Fruit powers, Foxy was unable to avoid a devastating punch from Luffy. After the effects of the Noro Noro Beam wore off, Foxy took the brunt of the attack, multiplied by a huge amount, and was catapulted off his ship. Having fallen into the water and out of the bounds of the match, Foxy lost his first battle after 920 straight victories. Though having fallen into the water and unable to swim, Foxy was fortunately saved by his crew."}, {"type": "paragraph", "text": "After both his and Luffy's wounds from the match were healed a bit, Foxy decided to honorably congratulate Luffy for the match. In secret however, Foxy wanted to lay one last sneak attack on Luffy as an act of vengeance. Unfortunately, Luffy's rubbery body made Foxy's attack useless and Foxy instead fell on his face. With the final game of the Davy Back Fight won by the Straw Hats, Foxy and his crew waited anxiously for Luffy's decision. Knowing that the Straw Hats were then looking for a shipwright, they figured that he would choose one of their shipwrights."}, {"type": "paragraph", "text": "To their surprise, Luffy chose instead their flag. Though this outraged Foxy and his crew, Luffy explained that he'd just take the Foxy Pirate's Jolly Roger symbol and not the entire sail itself so that Foxy and his crew could still travel. So that they could still sail as pirates also, Luffy also explained that he would paint them a new one to use instead of the one taken. While this pleased Foxy and his crew, unfortunately Luffy's drawing skills for their new Jolly Roger deeply depressed the whole lot of them."}, {"type": "paragraph", "text": "With the Davy Back Fight with the Straw Hats finally over, Foxy and his crew sailed off vowing to get back at Luffy someday for such a disgraceful Jolly Roger."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Foxy_Defeated_by_Luffy.png/revision/latest/scale-to-width-down/210?cb=20140727105248", "caption": "Foxy being catapulted after Luffy's punch was magnified by his own powers."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/49/Foxy_Pirates%27_Current_Jolly_Roger.png/revision/latest/scale-to-width-down/210?cb=20151221171634", "caption": "The Foxy Pirates depressed over the crude new Jolly Roger Luffy drew for them."}]}, {"title": "Foxy's Return Arc", "level": 3, "content": [{"type": "paragraph", "text": "Due to the change of the outcome of the Combat portion in the anime, Foxy and his crew meet the Straw Hats again in a small arc exclusive to the anime. After he and his two remaining crew members are saved from a storm by the Straw Hats, Foxy reunites with his old crew on the Sexy Foxy. The reunion is however cut short as a new problem is discovered. It turns out that while Foxy was away, the former captain of the Fanged Toad Pirates and his men decided to take command of the crew. Seeing this, Foxy tried to reclaim his crew back but was thwarted. Fortunately however, the Straw Hats helped Foxy settle the internal dispute in Foxy's crew. Though he regains his crew back thanks to the Straw Hats, instead of thanking them Foxy uses the moment to get revenge on them. Despite this however, he is defeated by them but allowed to continue sailing with his crew."}], "images": []}, {"title": "Spa Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Thriller Bark Arc of the anime, Foxy and only his two closest crew members, Hamburg and Porche, are again encountered by the Straw Hats in an anime exclusive place called Spa Island. There, while Foxy is bitter about the Jolly Roger design given by Luffy, his main goal this time however is working alongside the corrupt owner, Doran, to steal a notebook from two sisters whose father discovered how to make jewels. While Foxy and his companions are able to initially best Luffy and most of his crew with a new mecha, their actions are thwarted by Luffy's two newest crew members, Franky and Brook. After the Straw Hats defeat Doran and his goons, his brief alliance with the owner is broken."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Foxy_Pirates_Swimsuits.png/revision/latest/scale-to-width-down/210?cb=20120510200926", "caption": "Foxy along with Porche and Hamburg returning in the Spa Island Arc."}]}, {"title": "Adventure of Nebulandia", "level": 3, "content": [{"type": "paragraph", "text": "Foxy continued sailing through the Grand Line, challenging other pirates to Davy Back Fights and winning all of them. However, he was always ridiculed by everyone for his poorly drawn Jolly Roger, until he met Komei. Claiming to be a former Marine, Komei took part in a Davy Back Fight with Foxy and lost. Komei and Dojaku joined the Foxy Pirates, and the latter did not laugh at Foxy once, making the pirate happy."}, {"type": "paragraph", "text": "Sometime before or after this event, Foxy made it into the New World. With Komei's guidance, he developed a plan to lure the Straw Hats to Mushroom Island. Some of the Foxy Pirates disguised themselves as women, and the Sexy Foxy was sent ashore as they sent an SOS to the Thousand Sunny. Foxy knew they would come to the island after Sanji saw the people disguised as women. When the Straw Hats were successfully lured onto the island, Foxy confronted them. However, Luffy did not remember who he was, sending Foxy into a depression. However, Foxy reveals that his crew has gotten stronger with the additions of Komei and Dojaku, and shows the new features of the Sexy Foxy that Dojaku added."}, {"type": "paragraph", "text": "The Davy Back Fight game began, and Foxy watched as the first round, the Eating Contest, began. Foxy asked Komei to make sure the mushrooms the competitors were eating weren't poisonous, which Komei confirmed. However, Foxy became annoyed as Komei complained about Brook competing, and was left shocked when Komei seemed to disregard his authority in dictating the game. Foxy watched the Eating Contest, and was shocked as Porche, Hamburg, Luffy, Zoro, and Sanji collapsed and got up completely unmotivated. After being reassured the mushrooms were safe, Foxy turned to confront Komei again, but saw with a shock that his underling was on the Sexy Foxy's masthead."}, {"type": "paragraph", "text": "Komei revealed to Foxy that he only joined his crew in order to achieve his plan of capturing the Straw Hats, and that working under the pirate had been humiliating. Dojaku then trapped the competitors in a cage, and they are pulled up to the Sexy Foxy, although Luffy was freed. An angered Foxy fired a Noro Noro beam at the Sexy Foxy, but Dojaku activated its reflective covering, sending the beams back and making everyone on the beach slow. Komei and Dojaku escaped with their prisoners, but left an Eternal Pose."}, {"type": "paragraph", "text": "After they are freed from the effects of the Noro Noro beam, the Straw Hats made plans to follow the Eternal Pose and rescue their captured comrades. Foxy then arrived and begged Luffy to let him come along as well, as he wanted to free Porche and Hamburg. Luffy agreed, and the Foxy Pirates cheered their captain on, although Foxy told them to stay behind and look for the Rebound Mushroom. However, Kansho, a new Foxy Pirate, asked to join Foxy and help him, which Foxy agreed to. Foxy, Kansho, and the Straw Hats then sailed away as they waved goodbye to Brook, Chopper, and the Foxy Pirates."}, {"type": "paragraph", "text": "During the voyage, Foxy talked to Luffy about his experiences after their last encounter, and they found that they share the same goal in this mission. As a token of friendship, Foxy offered Luffy a trinket of his head, which Luffy excitedly accepts. He offered them to the rest of the Straw Hats, but they refused. Later, they came to a mountainous island, and were ambushed by five Marine ships. However, Foxy used his Devil Fruit powers to bring the Marine cannonballs to a standstill, and the Thousand Sunny escaped before the cannonballs started going again, resulting in the destruction of the Marine ships."}, {"type": "paragraph", "text": "Foxy, Kansho, and the Straw Hats arrived on Nebulandia, where they were greeted by Komei. The Marine outposts in the island's numerous rock towers fired on the pirates, and a plant crept up on Foxy and wrapped around him, as it did with Robin. Robin disappeared, causing Nami to suspect the immobilized Foxy of treachery and hit him. However, Komei revealed that he had captured Robin."}, {"type": "paragraph", "text": "As night fell on Nebulandia, a seawater fog rose into the air, causing Luffy and Foxy to become weak, as they were both Devil Fruit eaters. Komei later told Luffy about his next challenge, as his crewmates had been left outside. Luffy struggled to move himself and reach his crewmates, and Foxy was shocked at how low the pirate had been brought to. However, Kansho suddenly picked up Foxy and carried him on his shoulders as he ran after Luffy, saying they could not leave Luffy to fight Komei alone."}, {"type": "paragraph", "text": "Luffy and Nami later arrived at the clearing where their crewmates were being held, but Komei trapped Luffy in seawater, forcing Nami to rescue him. As Komei prepared to attack the two of them, however, Foxy arrived on Kansho's back and held the Vice Admiral at gunpoint, allowing Nami to rescue Luffy. Foxy left Kansho to keep watch on Komei as he helped pull Nami and Luffy out of the pitfall. However, Luffy was not breathing, and Foxy desperately beat the pirate's chest to resuscitate him. He succeeded in reviving Luffy, but the Straw Hat was shot immediately afterward."}, {"type": "paragraph", "text": "Foxy realized with a shock that Kansho shot Luffy, and Komei revealed that Kansho was working for him in order to backstab them and kill Luffy at the right moment. Nami attacked Komei with a bolt of lightning, but Komei redirected it toward her and Foxy, sending the two to the ground. Foxy and Nami were then handcuffed, and the Marines celebrated their victory over the Straw Hats."}, {"type": "paragraph", "text": "Suddenly, Brook, Chopper, and the Foxy Pirates rode in on a snake-like creature and freed Foxy and the Straw Hats. Foxy was given the antidotes for Porche and Hamburg, and helped tend to Luffy, who was still not getting up. However, it was revealed Luffy is fine due to the Foxy trinket blocking the bullet. A shocked Kansho shot another bullet, but it was deflected. Foxy then angrily leaped toward his former crewmate and barraged him with punches, sending him flying into a crowd of Marines. Foxy pointed to Komei and challenged him, but Komei blew him into the pitfall with his fan. After being rescued by Robin, Foxy was pointed to Porche and Hamburg's cell by Sanji."}, {"type": "paragraph", "text": "Foxy broke into the complex, shooting Noro Noro beams at any Marines he saw. He then arrived at Porche and Hamburg's cell and returned them to their former selves, being overjoyed to see them again. Foxy and the rest of his crew prepared to escape, but Porche and Hamburg told him that there was something they must take back. Foxy prepared to head after them while the rest of his crew went on, but his crew swore to stay with him until the end."}, {"type": "paragraph", "text": "Foxy and his crew later reunited with the Straw Hats, and Foxy got an idea to help Luffy in his battle against Komei. Foxy used Noro Noro beams to slow down a cannonball Komei was firing as well as Komei himself, and told Luffy to hit the ball as many times as he could. Luffy did so and hit the ball into the ground, causing a hole in the ground that drained the flooding seawater. Luffy later defeated Komei, and Foxy and the Straw Hats returned to the Thousand Sunny as they waited for Straw Hat to arrive."}, {"type": "paragraph", "text": "The Foxy Pirates and the Straw Hats returned to Mushroom Island, and Foxy reached out his hand to thank Luffy for fighting with him. However, Foxy ended the ceasefire between them as he fired a Noro Noro beam at Luffy, but to his shock Luffy was not affected by it. It was revealed that Nami created a mirage of Luffy, having known Foxy would do that. Nami then electrocuted Foxy, Porche, and Hamburg with lightning bolts. As the Straw Hats departed, Foxy waved goodbye to them, but was left depressed after Luffy called him by the wrong name again. However, Foxy rose up and talked to his crew, telling them it was time for them to continue their own adventures, and was cheered on by them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Foxy_Meets_Komei.png/revision/latest/scale-to-width-down/210?cb=20151224174827", "caption": "Komei joins Foxy's crew."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1b/Straw_Hats_Meet_Foxy_Pirates_Again.png/revision/latest/scale-to-width-down/210?cb=20160402165209", "caption": "Foxy confronts the Straw Hats again."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Foxy_Prostrate.png/revision/latest/scale-to-width-down/210?cb=20151224174640", "caption": "Foxy begs Luffy to let him join the Straw Hats' mission."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7b/Arrival_on_Nebulandia.png/revision/latest/scale-to-width-down/210?cb=20160402165216", "caption": "Foxy, Kansho, and the Straw Hats arrive on Nebulandia."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/71/Foxy_Confronts_Komei.png/revision/latest/scale-to-width-down/210?cb=20160402165405", "caption": "Foxy confronts Komei."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Foxy_Frees_Porche_and_Hamburg.png/revision/latest/scale-to-width-down/210?cb=20151226175808", "caption": "Foxy frees Porche and Hamburg."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Nami_Outwits_Foxy_Pirates.png/revision/latest/scale-to-width-down/210?cb=20160402165415", "caption": "Foxy attempts to betray Luffy, but is tricked and beaten by Nami."}]}, {"title": "One Piece: Stampede", "level": 3, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Long Ring Long Land Arc Changes", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, the entire Long Ring Long Land Arc was changed, among these were some of Foxy's actions. First off, when Foxy wanted to get Luffy's attention, he shot Tonjit's horse, Shelly. In the manga originally, Foxy literally shot Shelly with a gun. In the anime however, this scene was drastically toned down with the bullet being replaced instead with a net."}, {"type": "paragraph", "text": "After the Groggy Ring battle was won by the Straw Hats, Foxy and his crew taunted at how disgraceful Nami was for thinking of taking Foxy from the Foxy Pirates. In the manga originally, they taunted Nami because by doing this, the Straw Hats would have an automatic win since Foxy was a participant in the next game, Combat. In the anime however, with the arc being extended to two sets of Davy Back Fight games and the next game after the Groggy Ring being an anime exclusive game, the reason they taunted Nami was because this meant the Straw Hats would take away from the Foxy Pirates their beloved leader who planned out everything for them."}, {"type": "paragraph", "text": "For the third round of Davy Back Fight which was changed to an anime exclusive game, Foxy participated in it as the coach of his team for the game called Run Roll Round. Aside from coaching them, he also helped them out by using his Devil Fruit powers mostly in conjunction with an anime exclusive crewmember of his, Girarin. Though he helped his team to the best he could, Foxy however was thwarted by Nami and Usopp who preyed on his feelings, and by Robin who interfered with his Devil Fruit powers with hers. After losing the game and Chopper back to the Straw Hats, Foxy tricks Luffy into another round of games which included the original third game from the manga, Combat."}, {"type": "paragraph", "text": "For the second round of Davy Back Fight games, due to the rules being changed, Foxy participated in two of the three games. For the first game, Hit and Deadball, Foxy as participated one of the major players for his crew. Despite the strict rules applied to the game, Foxy was still able to exploit a few loopholes to his advantage. The most prominent of these was the use of his dodgeball shooting mecha. Using the loopholes and the rules to his advantage, Foxy and his crew won the first game of the second round of Davy Back Fight. Having experienced several significant disadvantages caused by Nico Robin with her Hana Hana powers in Run Roll Round and Hit and Dead ball, Foxy decides to take her instead of taking back Chopper as requested by Porche. Knowing (or believing) that with her on his crew, his victory over the Straw Hats in the next games would be assured."}, {"type": "paragraph", "text": "After winning the second anime exclusive game, Foxy took Chopper back to his crew. Having taken Chopper, Foxy presented a dire situation for the Straw Hats in the anime. Even if they won the next game, Combat, they could only take one crewmember back. Also, since his crew was getting tired from all the Davy Back Fight games, Foxy told the Straw Hats that this game will be the last as he will not accept to play another round of games. Faced with this, Nami in desperation makes a deal with Foxy that whoever wins would take 500 people from the other captain's team. While the Straw Hats do not have nearly enough people, the deal allows Foxy to claim the Straw Hats' children and all their descendants as his crew until he has enough people."}, {"type": "paragraph", "text": "During the Combat portion of the Davy Back Fight, a particular scene was changed in the anime. During the match, Foxy entered a spiked room in hopes of tricking Luffy into impaling himself. Unfortunately, Luffy used a cannon instead to blast the room that Foxy entered. In the manga originally, after being blasted by the cannonfire, Foxy unfortunately landed on the spikes he intended to impale Luffy with (though he somehow managed to survive). In the anime, this scene was changed to Foxy quickly getting on top of the cannonball that was fired on him before he landed on the spikes."}, {"type": "paragraph", "text": "After the Combat game was won by Luffy, due to the deal made by Nami with Foxy, the winnings that Luffy took from Foxy changed in the anime. After getting Chopper and Robin from Foxy, Luffy preceded to take Foxy's Jolly Roger as per the manga. However, as this was just three things taken from Foxy's crew out of the 500 men promised, Luffy still had 497 people to choose from. Luffy then randomly chose 497 men from Foxy's crew in a very simple manner, leaving only Foxy, Porche, and Hamburg left behind. Being no longer apart of the majority of his original crew, Foxy and his two remaining crewmembers were forced to take a dinghy as the 497 crewmembers chosen by Luffy required the Sexy Foxy to sail on. However as Foxy sailed on, Luffy dismissed all the men taken from Foxy as he did not need them all. Faced with this, Foxy's captainless crew went after him, wanting him back despite the situation they put him in."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/80/Foxy%27s_Run_Roll_Round_Team.png/revision/latest/scale-to-width-down/210?cb=20121214064217", "caption": "Foxy coaching in Run Roll Round."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Foxy%27s_Mecha_in_Hit_and_Dead_Ball.png/revision/latest/scale-to-width-down/210?cb=20121214221106", "caption": "Foxy using mecha in Hit and Dead Ball."}]}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He was featured in the One Piece Full Color R Gashapon series."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "As of the Long Ring Long Land Arc, Foxy's fight record is 920 wins and one loss which was against Luffy.", "elements": []}, {"text": "Foxy seems to have a distinct laugh, following this tradition with a \"Feh\" (i.e. Fuehfehfehfeh!).", "elements": [{"text": "Foxy is one of the few characters who actually kept their unique laugh in the FUNimation dub.", "elements": []}]}, {"text": "Foxy and his Noro Noro Beam were mentioned by Luffy when Pirate Empress Boa Hancock fired her Mero Mero Mellow at him. He, at first, thought it was the Noro Noro Beam and thus comically began \"slowing down\".", "elements": []}, {"text": "In Hit and Dead ball, the moment Foxy brings out his cannon that shoots hit and dead dodgeballs on a set speed, Usopp starts to think that his brain is also split too even though that machine is the only weapon that can be used in the game says by the rulebook as Foxy is the creator of these ridiculous rules.", "elements": []}, {"text": "Foxy is, so far, the only villain who has appeared only once in the manga, but more than once in the anime.", "elements": []}, {"text": "Foxy is shown in the We Are remix opening 10. It is odd since he is shown in the background with the Straw Hat's past friends and relatives.", "elements": []}, {"text": "In many cultures, foxes appear in folklore as symbols of cunning and deception, matching Foxy's trickery.", "elements": []}, {"text": "Foxy was in the Japanese version of One Piece Grand Battle Rush!. However, he was one of 4 characters that was cut from the English version of the game. The Davy Back Games were turned into mini-games with Usopp and the Usopp Pirates as the challengers instead. Although, his crew are still seen in the background of the mini-games.", "elements": []}, {"text": "Foxy also was in the Japanese version of One Piece: Pirates Carnival, however, he was one of the many characters removed from the English version of the game. All his Davy Back Fight games were instead done by Jango and the Black Cat Pirates, with Jango using his hypnosis to replace Foxy's Noro Noro Beam.", "elements": []}, {"text": "In the fourth character popularity poll, Foxy was voted the 56th most popular character in One Piece.", "elements": []}, {"text": "In the FUNimation dub, Foxy has a thick European accent.", "elements": []}]}], "images": []}]}