{"sections": [{"title": "Five Elders", "level": 1, "content": [{"type": "paragraph", "text": "The Five Elders are the highest-ranking Celestial Dragons and the heads of the World Government. They essentially rule the entire world, with the only individual of higher authority they answer to being the mysterious Im who sits on the Empty Throne."}, {"type": "paragraph", "text": "They are the men who command the Marines and Cipher Pol, and the ones who once made a pact with the Shichibukai before they're abolished, making them one of the main antagonist groups of the series."}, {"type": "paragraph", "text": "So far, none of their names have been revealed and it is unknown how they became the leaders of the World Government or how long they have been ruling it."}], "images": []}, {"title": "Appearances", "level": 2, "content": [{"type": "paragraph", "text": "Despite being Celestial Dragons, none of the Five Elders wore the full-body white suit that their lower-ranking brethren wear. Also, none of them wear the bubble or glass case that separates their air supply from other people over their heads. It would appear that none of them has physically changed in appearance over the course of twenty-two years (from the destruction of Ohara to current times)."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Their primary concerns are protecting an unstable world from the influence of piracy and maintaining the public image of the World Government. They will go to great lengths to keep the public's view of them in a good light. They have ordered the killing of an entire island of people to hide the discovery of the Void Century, they have hidden the fact that Gecko Moria was beaten by Luffy and later ordered his silent assassination to make it look like he died in the war for a better image, and they have even kept the escape of Level 6 inmates of Impel Down a secret, a decision that even angered Sengoku, the former fleet admiral of the Marines. They are extremists who will sacrifice a countless number of innocent people for the sake of maintaining the World Government's political power and authority and even turn a blind eye to political corruption such as the atrocities of the Shichibukai Crocodile and Doflamingo, and when it should ever be exposed, they will simply give the Marines credit through falsified propaganda."}, {"type": "paragraph", "text": "They each personally bears immense hatred towards Monkey D. Luffy not only for his heritage as Dragon's son, but also for all the trouble he and his crew has caused by rebelling against them such as invading Enies Lobby and defeating CP9 to save Robin, causing the first mass breakout of Impel Down and later intruded on the Battle of Marineford to save Ace and most of all defeating multiple Shichibukai such as Crocodile, Moria and Doflamingo."}, {"type": "paragraph", "text": "Though not to the same extent as the other World Nobles, they take great pride in their heritage as at least one of them considered the Nefertari Family to be traitors for not joining their ranks 800 hundreds years ago. Unlike other World Nobles, they are capable of showing respect and reverence to a few people such as Shanks and Im, and that they do not wear the same full-body suits and bubbles that separate their air supply from the lesser status when in their presence. Also unlike their lower ranking brethren, who mainly enjoy abusing their own powers for hedonistic pleasures, the Five Elders show themselves to be more responsible and concerned of the world's activities."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Im", "level": 3, "content": [{"type": "paragraph", "text": "In the presence of Im, the Five Elders kneel in front of this individual. One member also calls Im by the honorifics of Im-sama, showing respect for this person."}], "images": []}, {"title": "Sakazuki", "level": 3, "content": [{"type": "paragraph", "text": "After the World Government played a role in falsifying the news of Doflamingo's resignation from the Shichibukai, Sakazuki did not like how the Five Elders would go out of their way to protect him, and they did not even care if it would tarnish Sakazuki's reputation. During a heated argument, Sakazuki even insulted, provoked, and mocked them because CP-0 acted over their heads, testing his limits and showing that he does not agree with everything the Five Elders do."}], "images": []}, {"title": "Nefertari Family", "level": 3, "content": [{"type": "paragraph", "text": "Despite descending from one of the 20 Kings that founded the World Government, the Five Elders consider the Nefertari Family to be traitors, since their ancestors preferred to stay in Alabasta instead of joining the other Kings who moved to Mary Geoise. It appears that they keep that opinion to themselves and they try to avoid conflict with the family."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Though Shanks would be considered an enemy given his status as a pirate, the Five Elders showed respect towards him and even allowed him to speak with them inside Mary Geoise."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "The Five Elders hold tremendous hatred towards Monkey D. Luffy not only for his heritage as the Revolutionary Dragon's son, but also for all the trouble he and his crew had caused by invading Enies Lobby and defeating CP9 to save Nico Robin, causing the first mass breakout of Impel Down, intruding on the Battle of Marineford to save Ace, and most of all for defeating multiple Shichibukai such as Crocodile, Moria, and Doflamingo."}, {"type": "paragraph", "text": "They are shown to acknowledge his strength and see that he is truly Garp's grandson, as well as a deadly element."}], "images": []}, {"title": "Ohara Scholars", "level": 4, "content": [{"type": "paragraph", "text": "The Five Elders were strongly against the research that was conducted by the Ohara Scholars and had them killed for uncovering too much information about the Void Century. Despite killing them, the Five Elders expressed some regret for their decision."}], "images": []}, {"title": "Known Knowledge", "level": 2, "content": [{"type": "paragraph", "text": "The tall thin one with the mustache (second from right) spoke with Professor Clover and ordered Spandine to kill him before the archaeologist could speak the Great Kingdom's name. They have shown to have at least a basic knowledge of the occurrences of the Void Century, according to their shocked reactions to Professor Clover's statements."}, {"type": "paragraph", "text": "They have shown a paranoid fear of someone reviving the ancient weapons, to the point of forbidding its research and ordering the utter destruction of the entire country of Ohara, though given what is known of the Void Century, they may simply be using that as an excuse in order to prevent information they do not want leaked to the public from getting out."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Known as the Highest Authority of the World Government (世界政府最高権力, Sekai Seifu Saikō Kenryoku), the Five Elders are the rulers of the entire world with tremendous political power superior to their fellow World Nobles and have complete control over all government affiliated organizations such as the police, the ten Cipher Pol units, and even the Marines as they are all completely subservient to their commands. Even the orders of the fleet admiral of the Marines can be vetoed by their decisions. They can declare a Buster Call attack on any island that they deem a threat and can pass that authority onto lower World Government ranking agents. They can revoke a Shichibukai's title, if they decide that he/she is not living up to their duties as a Shichibukai."}, {"type": "paragraph", "text": "Their primary concerns are protecting an unstable world from the influence of piracy and maintaining the public image of the World Government. They will go to great lengths to keep the public's view of them in a good light. They have ordered the killing of an entire island of people to hide the discovery of the Void Century; they have hidden the fact that Gecko Moria was beaten by Luffy and later ordered his silent assassination to make it look like he died in the war for a better image; and they have even kept the escape of Level 6 inmates of Impel Down a secret. Some of these decisions have even angered Sengoku the former fleet admiral of the Marines."}, {"type": "paragraph", "text": "Political powers aside, it is currently unknown how strong each one of the Five Elders are. However, due to their clear muscles and scars, and that one of them is wielding a sword, it would appear that they have some battle experience and fighting capabilities. Also in Robin's flashback, it appears that their appearances haven't been altered at least, despite it being taking place twenty two years ago."}, {"type": "paragraph", "text": "Like other Celestial Dragons, The Five Elders can summon a Marine Admiral if they are under attack."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Nothing is known of their early lives, and how they became the leaders of the World Government is also unknown, aside that they are the highest ranked Celestial Dragons."}, {"type": "paragraph", "text": "What is known is that they were around twenty two years ago, when they ordered the Buster Call against Ohara. Their membership (and appearances) have not altered at least in the last twenty two years. "}, {"type": "paragraph", "text": "Less than fourteen years ago, Spandam manipulated them to give him the authority to allow him to seek out the blueprints for Pluton."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Five Elders appeared for the first time when they were discussing the situation around Shanks and Whitebeard. They were determined to keep Whitebeard and Shanks from making direct contanct. They were also distressed with Crocodile due to his actions in Alabasta and his subsequent dismissal from the Shichibukai."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Long Ring Long Land Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later, they heard of Aokiji sneaking out of Marine Headquarters and became disappointed with him. They remarked that he should be careful with his rank."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later, after the Enies Lobby raid, they were shocked to hear that Shanks had successfully met with Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, they gathered to discuss the state the world was in. They talked about how Luffy has become a huge threat as well as his relations to Garp and Dragon. One of them comments on how their power structure has almost completely collapsed, and asks how they will fill the three vacant Shichibukai positions. They decide to observe world events for now until they can find influential enough people to become new Shichibukai."}, {"type": "paragraph", "text": "They then discuss Blackbeard and his activities in the New World, mentioning that he has defeated one of the Supernovas and that he is in the lead for replacing Whitebeard as one of the Yonko. They believe that the only people who can stop his rise to power are the three remaining Yonko and the Whitebeard Pirates, who are currently under Marco's command. Their last comment is on the Will of D., saying that \"D. always means danger\" and that it has reached the public too much as of late."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Following the discovered falsehood behind the story about Donquixote Doflamingo's resignation from the Shichibukai and abdication of his throne, Fleet Admiral Sakazuki confronted the Five Elders about this, where they engaged in a heated argument. Sakazuki angrily asked the elders why the whole world had to be misled for Doflamingo's sake, noting that if an incident like this were to occur again, he as fleet admiral would be disgraced. The elders ignored him, saying that they were not concerned with his reputation as the Marines are only the public face of the World Government, and that the case had been left to the Cipher Pol."}, {"type": "paragraph", "text": "Sakazuki retorted that even the elders had been walked over by the Celestial Dragons and called them their puppets. They responded in anger, blaming Sakazuki for Kuzan joining Blackbeard. Sakazuki replied that Kuzan's actions after he resigned from the Marines were not the concern of the government or the Marines. Suddenly, a Marine interrupted the meeting and reported about what transpired on Dressrosa. Much to their shock and displeasure, they learned of Doflamingo's defeat at Luffy's hands."}, {"type": "paragraph", "text": "Admiral Fujitora publicly announced Donquixote Doflamingo's defeat to the world along the exposure of the crimes he committed by abusing his Shichibukai position. Since the announcement was given before the elders were informed of it, this prevented them from covering up the debacle, allowing the Straw Hat Pirates to take credit for exposing the Heavenly Yaksha's criminal enterprises."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d1/Sakazuki_and_Five_Elders_Meeting.png/revision/latest/scale-to-width-down/250?cb=20160411034019", "caption": "The meeting between Sakazuki and the Five Elders."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Five Elders questioned Shanks on why he felt it was necessary to speak with them despite the Levely being so important and his criminal status not being appropriate for global diplomacy. They stated the only reason Shanks was granted a private audience with them was because he is one of the Yonko. Shanks expressed his gratitude and the Elders ordered their guards to leave their chambers. Shanks conveyed his desire to discuss a certain pirate with the Five Elders."}, {"type": "paragraph", "text": "Sometime after the Levely had formally begun, the Five Elders headed towards the chamber containing the Empty Throne as they discussed Nefertari Cobra's request to have an audience with them even though they saw the Nefertari Family as nothing more than traitors to the World Nobles for choosing to stay in the \"world below\". Upon arriving at the chamber of the Empty Throne, the Five Elders quickly knelt down as they were greeted by a mysterious figure who then proceeded to sit upon the Empty Throne itself, a figure whom they addressed as Im, the true ruler of the World Government."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/24/Im_Sits_on_the_Empty_Throne.png/revision/latest/scale-to-width-down/180?cb=20190618101548", "caption": "The Five Elders kneeling before Im, the true owner of the Empty Throne and the ruler of the world."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The Japanese word for the Five Elders, \"Gorōsei\", translates more closely to \"Five Elder Stars\". When Oda translated the word in Chapter 907, he left out \"star\" from the translation."}], "images": []}]}