{"sections": [{"title": "Tom", "level": 1, "content": [{"type": "paragraph", "text": "Tom was a powerful long-horned cowfish Fish-Man, known as the most skilled shipwright in the world. He was the head of his own company, Tom's Workers. He was also Iceburg's and Franky's teacher and Den's older brother. Furthermore, he was well known for being the builder of the Roger Pirates' ship, the Oro Jackson."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tom was a large cowfish Fish-Man, with short horns and a yellow body. He had markings under his eyes, black spots on his neck near his gills, sharp teeth from his lower lip pointing upward, and a white beard. White, curly hair also sprouted behind his neck from under his brown bandanna, and his large chest was covered by an unbuttoned light-blue shirt with a blue pattern on it. He had a relatively small lower body in comparison to his large upper body, and he wore brown pants and simple boots. He also had a tattoo of a flowery design on both of his shoulders that is similar to the Jolly Roger of the Sun Pirates."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Tom was a proud and kind Fish-Man. He was also extremely carefree, able to laugh at almost everything from his students' frequent quarrels and insults to even the fact that he nearly got sentenced to death for creating Roger's ship (a source of constant reprimands from Kokoro). Unlike many other Fish-Men, he showed no prejudice against humans. He built ships for anyone, even pirates, and adopted Franky and Iceburg and mentored them in the trade of building ships. His bond with them was such that he took the blame for the Battle Frankies and was executed in exchange for a pardon for them."}, {"type": "paragraph", "text": "Tom also believed that as a shipwright, one must always love his own creations, no matter what they had done. As such, he struck Franky for attempting to deny his responsibility in the Battle Franky's, and proudly claimed that he did not regret crafting the Oro Jackson for the Pirate King, despite it all being tantamount of confessing to crimes punishable by death. He also refused to hand over the blueprints for Pluton to Spandam, as a duty of his shipwright. His catchphrase was \"do it with a DON!\" (or \"do it with gusto!\" in the FUNimation dubs)."}, {"type": "paragraph", "text": "Like some of the other characters of One Piece, Tom had a unique laugh, his starting with a \"Ta\" (i.e. ta ha ha ha ha!)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Carpentry", "level": 3, "content": [{"type": "paragraph", "text": "In his life, Tom was regarded as the world's greatest shipwright, having used timber of the Treasure Tree Adam to craft the Oro Jackson, the ship that Gol D. Roger used to cross the Grand Line, and later with assistance of his disciples created the first Sea Train, the Puffing Tom, which is capable of traveling in the sea, linking together many islands and bringing back prosperity to Water 7. His skills have been passed down to Franky and Iceburg, noted as incredible master shipwrights themselves."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Even for a Fish-Man, Tom had massive amounts of strength as he easily lifted a ship with one hand without showing strain, and he held its three masts in the other hand. He was able to throw the ship to a great distance and at the same time launching the masts in their required positions, showing not only amazing strength, but also incredible accuracy. Similarly, he broke free of a pair of big handcuffs without effort. He was also extremely tough and tenacious, as he took a full bombardment from Battle Frankies ships (guided by World Government agents) which were powerful enough to kill a Sea King, and was still able to stand and fight back against the Marines during the trial afterwards."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Crown of the King", "level": 3, "content": [{"type": "paragraph", "text": "Before moving to Water 7, he lived on Fish-Man Island. At some point, he and Kokoro left there and moved to Water 7. Tom was later responsible for building the Oro Jackson, Gold Roger's ship. He also found Franky as a child after his pirate parents abandoned him."}], "images": []}, {"title": "The Trial Begins", "level": 3, "content": [{"type": "paragraph", "text": "After the death of Roger, he was arrested. Although building a ship for pirates is generally not considered a crime (as the shipwrights have no control over who mans their ships), a special case had to be made for Tom because his client was the Pirate King."}, {"type": "paragraph", "text": "To escape execution, Tom made an agreement with the judge: given 10 years, he could save his dying home city of Water 7, by constructing an unprecedented Sea Train which could traverse even the roughest of weather to deliver and receive goods and services. Thus, Tom's trial went into recess for a decade, to reconvene after the Sea Train's completion."}], "images": []}, {"title": "The Shipbuilder's Secret", "level": 3, "content": [{"type": "paragraph", "text": "Tom's trial was also a front for another mission the World Government was undertaking at the time. They knew Tom was the holder of a copy of the blueprints for Pluton, an ancient warship of power so great that its name survived the passage of time (or perhaps the cataclysm that blotted out most of the world's history. This is the same Pluton that Crocodile was seeking in Alabasta). Tom's possession of the blueprint led other factions of the Government to seek it: Of note, Spandam, who was at the time working for Cipher Pol No. 5, a secret governmental organization not overseen by the Marines."}], "images": []}, {"title": "Spandam's Plot", "level": 3, "content": [{"type": "paragraph", "text": "After Tom finally completed the Sea Train (taking 4 extra years to add extra rails), Tom was finally allowed to be pardoned for any crime he desired. However, Spandam was angry at the hassles of trying to get Tom to hand over Pluton to him, therefore, Spandam, in an effort to secure the blueprints, hired people to steal and man the ships of Tom's student, Cutty Flam, to attack Water 7 at the resumption of Tom's trial."}, {"type": "paragraph", "text": "Though he knew Franky to be innocent, Tom took responsibility for the actions of his pupil's ships and decided to claim his pardon against the attack on Water 7. This action thus reinstated his original sentence and he once again was accused of building Roger's ship. Having overheard Franky disown his creations, Tom finally owned up to building the Oro Jackson; not only that, but claimed he was proud to have done so in order to show Franky the true meaning of being a shipwright. Tom was escorted on the sea train he built to Enies Lobby, where he was allegedly executed shortly thereafter."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b1/One_Final_Lesson.png/revision/latest/scale-to-width-down/210?cb=20130529224411", "caption": "Tom teaches Franky one final lesson."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The FUNimation dub translates his signature phrase \"Do it with a Don!\" as \"Do it with gusto!\"."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces an early concept art of Tom was revealed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/52/Early_Tom.png/revision/latest/scale-to-width-down/200?cb=20150404101038", "caption": "Early concept of Tom from One Piece Green."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tom's favorite phrase to say was \"Do it with a Don!\" (\"with a Boom\" in the Viz manga and \"with Gusto\" in the FUNimation dub). His brother Den also uses this phrase. In One Piece, as well as other manga, \"Don\" is an emphatic sound effect used to punctuate surprising, meaningful, or humorous scenes. Oda has been known to use it with great frequency, and Tom's \"Do it with a Don\" stems from this.", "elements": []}, {"text": "Tom's character shares many features with Ken Follet's \"The Pillars of the Earth\" character Tom Builder. Tom Builder was an architect who aspired to build a cathedral and taught all his knowledge to his two pupils. He was killed during a raid, but one of his pupils managed to finish his dream.", "elements": []}, {"text": "According to Oda, Tom cannot secrete toxins like the real-life long-horned cowfish.", "elements": []}, {"text": "In a recent Japanese Fan Poll, Tom is currently ranked the 83rd most popular character in One Piece.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 114), Tom's birthday is given.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0389), Information about Tom is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 36 Chapter 339 (p. 19) and Episode 240.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 37 Chapter 353 (p. 18-19) and Episode 248, Tom is sentenced for building the Oro Jackson.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 37 Chapter 356 and Episode 250, Tom expresses his philosophy as a shipwright to Franky.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 37 Chapter 353 and Episode 248, Tom's status as the legendary shipwright is shown.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 37 Chapter 354 and Episode 248, Tom makes a deal with the Government in exchange for a pardon.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 37 Chapter 356 and Episode 250, Spandam frames Tom and forces him to forfeit his pardon.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 38 (p. 66), Oda confirms that Tom cannot secrete toxins.", "elements": []}]}], "images": []}]}