{"sections": [{"title": "Corgi", "level": 1, "content": [{"type": "paragraph", "text": "Corgi is a \"regular\" worker in the World Government, being something of a commander amongst the government soldiers, as he is seen speaking to the CP9 agents about the security of the Sea Train."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Corgi is an average sized man, with blonde hair, blonde sideburns and a blonde mustache. He sports black, typical Cipher Pol clothes, and has a scar running across the right side of his face."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Corgi_Anime_Concept_Art.png/revision/latest/scale-to-width-down/100?cb=20181105194639", "caption": "Corgi's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Corgi seems to be loyal to the World Government and would follow their orders blindly, as he was willing to confront Iceburg about the blueprints for Pluton on the orders of the World Government."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He claims to be able to \"sniff out\" pirates, although he sometimes wonders if his gift is right or not, he has supposedly never missed a pirate."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "He constantly tried to get Iceburg to hand over the blueprints for Pluton. However, he is denied and seen leaving in a huff. He later appears accompanying the CP9 and watches Robin aboard the Puffing Tom. He was knocked out by Sogeking during Sogeking's rescue attempt."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Corgi vs. Usopp (as Sogeking)", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 35 Chapter 328 (p. 12) and Episode 233, Corgi is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 58), His birthday is revealed.", "elements": []}, {"text": "↑ One Piece Manga and Anime - Vol. 38 Chapter 362 (p. 9) and Episode 253, Corgi informs the CP9 of the security staff they have in each cart of the Sea Train.", "elements": []}, {"text": "↑ One Piece Manga and Anime - Vol. 35 Chapter 328 and Episode 233, Corgi appears.", "elements": []}, {"text": "↑ One Piece Manga and Anime - Vol. 35 Chapter 331 and Episode 234, Corgi complains about the World Government sending him to Water 7.", "elements": []}, {"text": "↑ One Piece Manga and Anime - Vol. 35 Chapter 373 and Episode 262, Corgi is defeated by Usopp.", "elements": []}]}], "images": []}]}