{"sections": [{"title": "Kuzan", "level": 1, "content": [{"type": "paragraph", "text": "Kuzan, better known by his former epithet Aokiji, is a former Marine admiral and the first one to be revealed. He was nominated by Sengoku for the position of fleet admiral. However, after losing the position to Sakazuki, he resigned from the Marines. He has currently affiliated himself with the Blackbeard Pirates for unknown reasons."}, {"type": "paragraph", "text": "He is a minor antagonist of the Long Ring Long Land Arc, and along with the other Marines, he is one of the major antagonists of the Marineford Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kuzan is an incredibly tall, slim, yet muscular man. At 298 cm tall, he is just slightly shorter than the other two admirals pre-timeskip. He has black, curly hair cut to chin length that fans out at the tips, tanned skin, and an altogether lean, long build."}, {"type": "paragraph", "text": "His standard outfit while in the Marines consists of a white buttoned-up vest with standing collar over a long-sleeved navy blue shirt, with matching white trousers and black dress shoes. This is all rarely accompanied by a matching white suit jacket. He also wears a yellow tie divided geometrically by black lines and a sleep mask on his forehead. During his preparations for the war against Whitebeard, Kuzan had a white Marine admiral's coat (golden epaulettes and for him being the ice user, blue cuffs) draped over him like a cape, as did the other admirals. He was also seen wearing a green and purple sleep mask at all times two years ago from the present timeline. In contrast to Borsalino and Sakazuki, Kuzan is far younger than his colleagues, being less than fifty years old. His looks, combined with his manner, make him appear even younger than he actually is."}, {"type": "paragraph", "text": "As a child, Kuzan had a grimace on his face. He wore a dirty light blue shirt and a purple pair of shorts with white stripes. He carried an umbrella tied on his back, a bottle of alcohol and a backpack. Also, his hair was curlier compared to his current hairstyle."}, {"type": "paragraph", "text": "In his youth, Kuzan wore a white marine cap and a shirt."}, {"type": "paragraph", "text": "Twenty-two years ago during the Ohara Incident, Kuzan wore a dark blue bandanna with a white Marine symbol on it, as well as a pair of black round sunglasses, as well as an indigo coat with the Marine emblem on the left chest and the back. This outfit was also what he wore 27 years ago, during the Battle of Edd War."}, {"type": "paragraph", "text": "After the timeskip, his attire bears similarities to what he wore in his 20's. He wears a blue bandana that covers most of his hair, leaving only the tips which fan out. He wears a white V-neck shirt with black trousers, as well as an open dark blue-green trenchcoat that extends past his knees. He also now wears black cowboy boots and travels with a knapsack carrying his belongings, along with his old pair of green round sunglasses. Like his rival Sakazuki, he also has grown facial hair, namely, a thin mustache and a beard."}, {"type": "paragraph", "text": "After his duel on Punk Hazard, Kuzan received several burn scars spanning from the right side of his neck down to his entire right shoulder and onto his torso. His right hand is also heavily scarred and he lost part of his left leg, for which he now wears a prosthesis made of ice formed by his Devil Fruit ability."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kuzan is a very laid back man, showing no shock or surprise from almost anything. His lack of interest and \"Lazy Justice\" (だらけきった正義, Darakekitta Seigi) (as he describes his motto himself) often leads others to believe he can not possibly be a marine of such a high ranking, which leads them to underestimate him, making him all the more dangerous (it is unknown whether this is a facade or if he is genuinely lazy). However, if he deems a situation worthy, he will take action, as shown when he created a passage to another island for Tonjit at Long Ring Long Land."}, {"type": "paragraph", "text": "In accordance with the age difference between him and the other pre-time skip admirals, Kuzan does not refer to himself with \"Washi\" (儂, \"Washi\"), the \"I\" typical for older men but the \"I\" more frequently used by younger men and teens, the rather rough \"Ore\" (俺, \"Ore\"); altogether, his manner of speaking is far more lax than Borsalino’s (who’s exceedingly polite), containing a lot of ellipses and contractions, yet lacking the rude connotation of Sakazuki's speech, and being far more calm. He tends to begin addressing people with \"excuse me\"/\"I hate to interrupt, but…\" (ちょっとごめんな, chotto gomen na)."}, {"type": "paragraph", "text": "Aokiji is a compassionate man, helping Tonjit at Long Ring Land to cross the ocean with his ability and even letting Nico Robin escape the Buster Call on Ohara by providing a small boat and also a trail of ice for her to leave safely. Despite being a Marine, this compassion can even extend to pirates as long as their actions are mostly benevolent. This was shown when he chose not to arrest or kill Luffy because the young pirate had defeated Crocodile, thus saving Alabasta from the latter's malevolence. Because of this compassion, Kuzan follows Moral Justice."}, {"type": "paragraph", "text": "In contrast to his former colleague, Fleet Admiral Sakazuki, Kuzan has a sense of honor, as he keeps his word to not attack the Straw Hat Pirates after accepting a one-on-one battle with Luffy. He is disgusted by Sakazuki's brutal actions in dealing with situations (such as the Ohara Incident), calling him a fool. While he follows Moral Justice, he does understand the position his ranking puts him in, as he does not hesitate to do what is necessary for the needs of the Marines, as shown when he freezes Jaguar D. Saul to death during the Ohara incident, and attacked Luffy and Whitebeard during the Marineford War."}, {"type": "paragraph", "text": "His motto used to be \"Burning/Fired Up Justice\" (燃え上がる正義, Moeagaru Seigi) before he changed it to \"lazy justice\"."}, {"type": "paragraph", "text": "As a Marine, Kuzan was a faithful follower of the World Government. He always tried to follow orders but sometimes found his own ideals in opposition to his orders. Even as he followed his orders, he would sometimes exhibit a sense of mercy and honor other World Government officials did not. Like many characters in One Piece (for example, Jaguar D. Saul and Smoker), after witnessing the senseless murder of many innocent people, Kuzan has come to realize the depths to which the World Government will sink to accomplish their goals."}, {"type": "paragraph", "text": "His relaxed demeanor while performing the more macabre of his duties is similar to that of Borsalino, making him one of the more complicated characters in the series. Despite not really wanting the position of fleet admiral, he was even more opposed to Sakazuki getting the position due to the latter's immense ruthlessness, and dueled his fellow admiral rather than letting him take it. After being defeated, Kuzan chose to resign from the Marines rather than stay under Akainu's command."}, {"type": "paragraph", "text": "Aokiji, during the Whitebeard War at Marineford, grudgingly shredded his usual lax and friendly nature, for a more ruthless and aggressive personality, repeatedly targeting Whitebeard himself with his Hie Hie no Mi, managing to severely injure \"Diamond\" Jozu and generally hampering any attempts at rescue or escape for the invading pirate fleets."}, {"type": "paragraph", "text": "Having left the Marines and realizing just how truly corrupt the World Government and the Marines had become after the timeskip, it becomes clear that Kuzan seems to be only looking after his friends as illustrated by his rescue of Smoker from Doflamingo's fury on Punk Hazard."}, {"type": "paragraph", "text": "He has a recurring phrase, \"Arara\", meaning \"Oh, my\", which is frequently used when something surprises him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Kuzan_Relaxing.png/revision/latest/scale-to-width-down/210?cb=20130509214314", "caption": "Aokiji's lazy personality: relaxing while talking with the Straw Hat Pirates."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "According to Jinbe, Kuzan was very popular with the troops of any rank, which was why most flag officers favored him as candidate for the position of fleet admiral."}], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan also appears to have some connection to Garp, saying he once \"owed a favor\" to Garp. It is currently unknown what the nature of this favor was, or what Luffy's grandfather did for Kuzan to gain this debt. He also admired (maybe even idolized) Garp for consistently refusing promotions, since the latter was already satisfied with the rank bestowed upon him since the time of Roger. However, with Luffy's choice of piracy, even the favor and admiration are not enough to let him spare Luffy's life during their encounter at Marineford, though whether it was because he felt that Ace was too much of a risk to be left alive, because letting Luffy go publicly would get him into severe trouble, or because he has something personal against pirates is unknown."}], "images": []}, {"title": "Jaguar D. Saul", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan was a close friend of Jaguar D. Saul. Apparently, one of the reasons that he let Robin go during the destruction of Ohara is because of Saul. He states that he respected Saul's will and felt it was his duty to watch over Robin's life until she found her place. However, this friendship was not enough for Kuzan to spare Saul's life."}], "images": []}, {"title": "Sakazuki", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan detests fellow admiral Sakazuki, because the latter follows the policy of \"Absolute Justice\" to a deadly degree. This disgust dates back many years, as during the time when both were still vice admirals, Sakazuki killed innocent Ohara civilians to ensure that none of the archaeologists escaped the Buster Call, causing Kuzan to call him a fool for overdoing things."}, {"type": "paragraph", "text": "After Sengoku resigned, Admiral Aokiji was strongly opposed against Admiral Akainu becoming fleet admiral and fought him for the position, even though Kuzan himself originally had little interest in it. They battled for 10 days, but Kuzan was defeated and he resigned from the Marines rather than serve under Sakazuki. Nonetheless he was not above telling Smoker to warn Akainu about the danger Doflamingo posed to the new Marine Headquarters, showing a degree of concern for the well being of the Marines, despite disagreeing with Akainu's ideals."}], "images": []}, {"title": "Smoker", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan also seems to be familiar with Smoker, since he mentioned Smoker and the message given to him about Luffy, though Kuzan chose not to give it, as he thought it was stupid. They were also talking together in his office about Smoker's transfer to G-5. In the Punk Hazard Arc, he even goes as far as to call the Vice Admiral his friend after saving him from Donquixote Doflamingo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Kuzan_Treats_Smoker.png/revision/latest/scale-to-width-down/210?cb=20191212045635", "caption": "Kuzan treats Smoker after being defeated by Doflamingo."}]}, {"title": "Sengoku", "level": 4, "content": [{"type": "paragraph", "text": "Sengoku seems to trust and respect Kuzan well enough to lead the Marines since he nominated him to be fleet admiral."}], "images": []}, {"title": "Z", "level": 4, "content": [{"type": "paragraph", "text": "During his time as Marine Instructor, Z trained Kuzan. Due to this, Kuzan seems to very much respect him and even though he wanted to stop his former teacher from destroying the New World, he never attacked him. Also, in the end, Kuzan helps him to protect Ain, erecting an ice wall between her and Z, and consoles the young woman and Binz, talking about how great a man Z was."}], "images": []}, {"title": "World Government", "level": 3, "content": [{"type": "paragraph", "text": "During his time with the Marines, Aokiji was loyal to the World Government. He did his best to follow the creed of  'Absolute Justice', but at times found his own ideals in opposition to his orders. Even as he completed his assignments, he would sometimes exhibit a sense of mercy and honor that other World Government officials did not. Similar to many of his colleagues in One Piece (for example, Jaguar D. Saul and Smoker), after witnessing the senseless massacre of innocent people, Aokiji may have come to realize the depths to which the World Government will sink to fulfill their agendas."}], "images": []}, {"title": "Shichibukai", "level": 3, "content": [{"type": "paragraph", "text": "Kuzan also seems to have some kind of grudge against Crocodile (if not all of the Shichibukai). After sparing Luffy's life, Aokiji says, \"With your defeat of Crocodile, we'll just call it even.\" Kuzan, however, did apologize (albeit sarcastically) to Jinbe for freezing the ocean to prevent escape. He also stopped Donquixote Doflamingo from killing Smoker on Punk Hazard."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Aokiji is first encountered in the plot by the Straw Hat Pirates immediately following the conclusion of the Davy Back Fight and the fight against Foxy the Silver Fox. Initially, Aokiji stated that he is not here to arrest or execute the Straw Hats saying that he was merely here to view their progress, but also went on to say that with the collective of mavericks garnered amongst them couping with their past exploits, garnered bounties, growing strength and future potential; that inspite of his grand experience with pirates of all kinds, they deeply frightened him. However, just as the Straw Hats were about to leave, Aokiji appeared to have a change of heart, and announces that he was here to arrest Nico Robin, on the account of understanding the forbidden Poneglyph text/language, and also for being the only survivor of Ohara, her home island (which was horrendously massacred by the Marine-commissioned Buster Call, following reports that the residing scholars there had discovered the truth about the Void Century through interpreting the Poneglyphs). The Straw Hats attempted to protect her, but Aokiji soundly defeated all of them, including Luffy twice, but he let them live out of mercy and of curiosity, as to how they would survive against the odds in the Grand Line."}], "images": []}, {"title": "Nico Robin", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan shows some disappointment in the fact that Nico Robin had taken the path of piracy and had not changed her life for the better (although the government did have a bounty put on her, making it difficult to live a normal life). It is also revealed that Kuzan and Nico Robin share a past as when he was a vice admiral, he was forced to freeze and kill his good friend, former Vice Admiral Jaguar D. Saul, due to the latter refusing to participate in the Ohara massacre. As it happened, Saul was also Robin's best friend at the time, and it became a very traumatic moment for the little girl, who is fearful of Kuzan to this date. As a testament to the giant's friendship, Kuzan allowed Robin to escape from Ohara, but he warned her that should they ever cross paths again, he would be her enemy, and he would attempt to arrest or even kill her."}, {"type": "paragraph", "text": "However, later, he seemed to retain some concern for her well-being, as he was relieved to see her finally find a place to belong with the Straw Hat Pirates. The two did manage to encounter one-another during the post-Enies Lobby celebrations, but Aokiji decided against action, and even encouraged Robin to continue sailing with the Straw Hats, remarking they are unlike any of the other crews or organizations that she joined in the past, and they truly understand the concept of \"friendship\"."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan is shown to have a grudging respect for the young captain, even though he is a pirate. He immediately recognized Luffy's leadership on their first encounter; Luffy chose to settle things with him in a one-on-one duel, rather than jeopardize the entire crew being wiped out by allowing them to get involved. He felt he owed Luffy for his defeat of Crocodile, but it also indebted to his grandfather Vice Admiral Garp for a yet unknown reason. Due to Kuzan's power, the fated conflict between him and the Straw Hats prompted Luffy to be less naive towards future conflicts; for this reason Kuzan served as the starting point for Luffy to push his strength beyond his limits. Kuzan is shown to be impressed by Luffy's quick rise in infamy; Luffy and the Straw Hats escape from the Marines' strongest battle force; Luffy being able to escape Impel Down, bringing several notorious convicts with him; and Luffy being able to penetrate Marine Headquarters to ring the Ox Bell. Kuzan was also visibly shocked when Luffy used Haoshoku Haki at which point he saw the young pirate as a dangerous element and tried to kill him."}, {"type": "paragraph", "text": "He also non-canonically helped the Straw Hat Pirates by giving them information about former admiral Z’s plans to destroy the New World."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Camel", "level": 4, "content": [{"type": "paragraph", "text": "Camel is Kuzan's traveling companion, having met him after leaving the Marines. The duo is said to be very compatible."}], "images": []}, {"title": "Blackbeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After the time-skip, Kuzan became affiliated with the Blackbeard Pirates. It is unknown what standing he has with the crew, but some like Jesus Burgess are not so quick to trust him because of his past as a Marine, but Blackbeard pays it no mind."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "When he was a Marine admiral, Kuzan was able to command a vast number of Marine troops under his rank, and had the authority, prestige, influence to revoke any Shichibukai's title at any time. Most of all, he had the ability to order a Buster Call attack on any island that he deems a threat. In fact, his overall abilities were so vast that Sengoku personally suggested to World Government Commander-in-Chief Kong that Kuzan should become the succeeding fleet admiral. However, after leaving the Marines, he has forfeited these privileges."}, {"type": "paragraph", "text": "A notable example of Kuzan’s reputation is Nico Robin from the Straw Hat Pirates. Related to her childhood trauma, she constantly loses her grip and starts panicking whenever an admiral is around. This is significant, as she rarely panics even in the most dangerous situations."}, {"type": "paragraph", "text": "He is also a skilled navigator, being able to travel the Grand Line with a bike and after the timeskip traveling the New World with a penguin named Camel."}, {"type": "paragraph", "text": "Along with this, he is very powerful, as being an admiral grants him the title of the strongest individual fighter within the World Government and Marines, and is able to fight against notably powerful figures such as Diamond Jozu, the Third Division Commander of the Whitebeard Pirates, defeating him with relative ease even though Jozu was distracted during the fight, and could even fight Whitebeard himself equally. He was able to easily overpower Luffy and the other Straw Hat Pirates single-handedly. He also appears to have great speed and stealth attributes, being able to appear behind a Shichibukai, Donquixote Doflamingo, without the latter noticing until he made his presence known."}, {"type": "paragraph", "text": "Furthermore, he was able to battle against his colleague Sakazuki on equal standing, and they dealt each other severe injuries during their 10 day duel to the death before Kuzan ultimately was defeated, thus demonstrating enhanced endurance. Kuzan was considered to be a massive asset to the Marines, and his departure left a negative impact to their military strength. This was confirmed by the Five Elders calling him an 'enormous power' while discussing his affiliation with the Blackbeard Pirates, to the point of being visibly distraught while doing so."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Aside from that and his Devil Fruit powers, Kuzan's physical prowess are also extremely high, as he is able to repel simultaneous attacks from Zoro, Luffy, and Sanji without taking any damage, and took a Haki imbued kick from Marco and was seen with no injuries moments later. Kuzan even took a Haki imbuned hit from a diamond clad Jozu while only receiving a minor cut on his lip."}, {"type": "paragraph", "text": "He also jumped to a very extreme height in mere seconds, in order to freeze a pair of tsunamis caused by Whitebeard. He is also able to travel at tremendous speed, as seen when attacking Buggy. He also has extremely acute hearing, being able to hear activity underwater, before the Whitebeard War began."}, {"type": "paragraph", "text": "He was also acknowledged by Jaguar D. Saul, who had destroyed several huge warships and had lifted one by himself, that Kuzan's strength was abnormal, even before he was an admiral. Another testament to his power as an admiral is that he emerged mostly unharmed after the Whitebeard War."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Kuzan has the powers of the Hie Hie no Mi, a Logia-type Devil Fruit that allows him to control, create, and become ice. He can create enough ice to cover a giant, a Sea King or several square miles of ocean within mere moments. He was even able to freeze the tsunamis created by Whitebeard, despite their size surpassing that of Marineford. In battle, he uses his ice powers to disable and immobilize enemies, freezing their bodies solid just by touching them, and threatening to shatter their fragile forms. Like other Logia users, he is capable of breaking himself into his particular element to avoid damage from most physical attacks. Kuzan also has extreme amounts of resistance towards cold, due to his Devil Fruit's element. This fruit is so powerful that his usage of it during his ten day battle with Akainu permanently changed the weather on one side of Punk Hazard, turning that side into a frozen wasteland."}, {"type": "paragraph", "text": "In addition, Kuzan is one of the few Devil Fruit users who has adapted their powers to travel efficiently across the sea. In his case, he freezes the water underneath his bicycle, Ao Chari, and then rides across the sea, due to the water freezing as the wheels pass over it. This freezing ability, which can be used on a very large scale, renders Kuzan one of the few Devil Fruit users who can actually counteract the weakness of falling into a large body of water and drowning, as he can just freeze the water and stand on the ice."}, {"type": "paragraph", "text": "Kuzan also seems to possess some limited resistance to sea water without freezing it, as shown when he inserted a portion of his real body into the sea without any adverse effects."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Kuzan%27s_Ice_Saber.png/revision/latest/scale-to-width-down/210?cb=20151230173411", "caption": "Kuzan forming an ice sword."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so with a rank above vice admiral, Kuzan can also use the ability."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "During the Battle of Marineford, Kuzan was seen using an advanced level Busoshoku Haki to negate Whitebeard's attempt to destroy the execution platform, by creating, with his fellow admirals, a shield combination of their three Haki."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Kuzan is shown to be quite adept at using weapons formed out of his ice powers, such as swords, spears, and tridents."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Joining the Marines", "level": 4, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story.  At age 19, Kuzan enlisted in the Marines and came under the tutelage of instructor Zephyr."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "Even though he joined the Marines, he stated that he never held the World Government in high esteem to begin with."}], "images": []}, {"title": "A Storm in the Edd War", "level": 4, "content": [{"type": "paragraph", "text": "When the Marines learned that the Roger Pirates and the Golden Lion Pirates were about to battle in the Edd War, three years before the death of the Pirate King, Kuzan was seen in the Marineford, walking with Garp, Saul, Sakazuki and Tsuru, telling the Hero of the Marines that him turning down another promotion was really something cool."}], "images": []}, {"title": "Ohara Incident", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan was revealed to have been at least indirectly involved in the incident at Ohara that prompted the Marines to put a bounty on Nico Robin's head. At that time, Vice Admiral Kuzan appears to have been responsible for the deployment of CP9 in pursuit of the \"criminal\" archaeologists of Ohara."}, {"type": "paragraph", "text": "While the full extent of his involvement in the incident has yet to be revealed, it is clear that the destruction of the civilian fleet, ordered by the former vice admiral Sakazuki, who later became promoted to Admiral (and later Fleet Admiral), came as a complete shock to Kuzan. The original order that had been sent was for all those that had not been involved with the Ohara scholars and the Poneglyph, to be safely transported off the island. However, Sakazuki's course of action was the complete opposite."}, {"type": "paragraph", "text": "Kuzan then froze Jaguar D. Saul using his Devil Fruit powers, killing his friend. He helped Nico Robin to escape via the use of his Devil Fruit powers, by freezing a trail in the ocean for her boat to sail safely through. Before her departure, he warned her that he is not her ally despite this one assistance, and would be quick to come after her, if he ever felt that she was a threat."}, {"type": "paragraph", "text": "As part of his plot in saving Robin, Kuzan froze Spandine's ship's rudder, but regardless, Spandine saw Robin and had her marked for capture. Kuzan seemed troubled when he was present at the meeting between the Marines and Spandine."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Sometime after being promoted to Admiral, Aokiji came across an island being rocked by a massive disturbance. He looked around the island, seeing the ruins of a large city and a small boy named Grount huddled nearby. Wondering if Grount was responsible for the destruction, Aokiji watched as Grount revealed his monstrous left arm, which he could not control. Grount unwillingly attacked Aokiji with his left arm, but the Admiral dodged it before finally relieving the boy of his suffering by freezing his arm and knocking him out."}, {"type": "paragraph", "text": "Aokiji took Grount into the Marines, where he was given a metal attachment to control his left arm. Aokiji trained Grount alongside Bonham and Zappa, but kept him out of the front lines until he could master his power."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3f/Kuzan_Warns_Robin.png/revision/latest/scale-to-width-down/210?cb=20130630221320", "caption": "Kuzan gives young Robin a warning."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Long Ring Long Land Arc", "level": 4, "content": [{"type": "paragraph", "text": "Twenty years later, when the Marine Headquarters discovered that he was missing, they informed the Five Elders about the situation. The Five Elders were upset with Aokiji's action and remarked that he should watch his rank."}, {"type": "paragraph", "text": "Aokiji went to Long Ring Long Land island, having tracked Robin there. Standing in front of Tonjit's house, he slept."}, {"type": "paragraph", "text": "After the Straw Hat Pirates finished the Davy Back Fight, they return to Tonjit with the pirate flag. Gleefully, Tonjit walked to the door of his house, only to bump into a sleeping Aokiji standing there. This terrified Robin, because Aokiji was one of her past demons. Aokiji woke up and began to make excuses that he wanted to inspect something. He froze the water with his power to create a bridge for Tonjit to cross."}, {"type": "paragraph", "text": "After the Straw Hats bid their good byes to Tonjit, Aokiji lied by saying that he once tried to arrest Robin. He then started to talk nonsense, confusing the pirates and making Sanji and Luffy angry with him. Aokiji told Luffy that his anger reminded him of his grandfather, which startled Luffy. After that, Aokiji then announced that maybe they should just die."}, {"type": "paragraph", "text": "Aokiji decided to test the Straw Hat Pirates by saying that everyone around Robin got wiped out with her being the only person left standing, referring to the actual situation that happened to Robin's mother. The truth is Robin only ran away from people who tried to kill her or turn her in. The Straw Hats never knew about Robin's past and stand with Robin against him. Aokiji started to call Robin a demon and an unfortunate woman. He told them that one day they would regret having Robin with them."}, {"type": "paragraph", "text": "Angry and tired of Aokiji's taunting game, Robin used her Devil Fruit abilities to break him into pieces against Usopp's wishes. Thinking he was dead, the Straw Hats prepared to flee, but Aokiji returned back in one piece, grabbed some grass and breathed on the grass to create an ice saber. He attempted to strike Robin, but was parried by Zoro. The sabre was kicked away (and thus destroyed) by Sanji shortly thereafter."}, {"type": "paragraph", "text": "Zoro rushed in attempting to cut him only to be caught by the wrist. Sanji tried to kick him but was grabbed by the thigh. Luffy tried to punch him in the stomach, but when he connected, his hand was frozen. Sanji and Zoro were also frozen on the leg and arm respectively. Nami blocked Aokiji with her staff but was pushed away."}, {"type": "paragraph", "text": "He then froze Robin into solid ice and threatened to punch her into pieces, claiming that the world would be better off without her. Luffy saved Robin in the nick of time, but Aokiji said that they should not try to save her and was going to stomp on her, but Usopp and Chopper managed to save her and drag her back to the ship."}, {"type": "paragraph", "text": "Luffy ordered his crew to go back to the ship as he faced Aokiji one-on-one. Luffy tried to send him flying with his Gomu Gomu no Storm, but he was quickly frozen up by Aokiji. Having Luffy frozen solid, he realized that Luffy tricked him. By agreeing to a one-on-one fight with Luffy, he could not attack his crew. He remarked that Robin would bring him only misfortune. He then decided not to kill Luffy, saying that he did the World Government a favor by defeating Crocodile and commented that Smoker's message was too stupid. As Aokiji left on his bike across the ocean, he noticed that the Straw Hat Pirates were heading to Water 7, which is close to the Marine Headquarters."}, {"type": "paragraph", "text": "He then called Spandam, who was ready to have his unit finish a mission, and informed him that Robin was heading to Water 7. It was later stated by Spandam (though never shown) that Aokiji also gave him the Golden Den Den Mushi at this time in order summon a Buster Call. Spandam decided to wait until Robin arrived at Water 7."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/99/Kuzan_Defeats_Luffy.png/revision/latest/scale-to-width-down/210?cb=20140801104247", "caption": "Aokiji freezes Luffy."}]}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Straw Hats defeated the seemingly invincible CP9, rescued Nico Robin from Enies Lobby, and escaped the Buster Call, Aokiji was seen again witnessing the aftermath of their raid at Enies Lobby and the Buster Call attack. They had passed his \"test\" far beyond his expectations. When he was asked by a Marine over the Den Den Mushi whether they should continue to pursue the Straw Hats, Aokiji declined, noting the Marines suffered heavy casualties already, calling their battle \"a complete defeat\"."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Aokiji later visited Water 7 and had a secret conversation with Robin while the Straw Hats were having a party with the Water 7 citizens. He then revealed to Robin that he was good friends with Saul and allowed Robin to escape Ohara because of this friendship. He also said that he intended to have her eliminated by CP9, as he had come to see her as danger after 20 years of living as a rogue, but he did not expect CP9 to lose to the Straw Hats. However, when he asked Robin why she did not run from the Straw Hats, Robin told him that she does not want to see them die. Aokiji bid Robin farewell, telling her to live strong, remarking that Ohara is not fully destroyed, presumably meaning that the memory and purpose of Ohara live on within her. He then left by appearing to instantly disappear with his ice abilities."}, {"type": "paragraph", "text": "A while later, he was seen leaving Dock 1 on his bike. Sometime later, Robin speculated that he was responsible for excluding all the non-Straw Hat Pirates (outside Franky, who joined the Straw Hats after the incident) from the report on the Enies Lobby incident and instead making them out to be innocent civilians who got caught up in all the commotion."}, {"type": "paragraph", "text": "Later, he asked for Garp to lend him a ride on his ship back to Marine Headquarters because riding back there on his bike was \"such a bother\". He witnessed the Straw Hats' new ship, the Thousand Sunny, leaping into the air to escape and, seemingly impressed by it, smiled."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/70/Robin_Speaking_with_Aokiji.png/revision/latest/scale-to-width-down/210?cb=20140915110319", "caption": "Aokiji and Robin speaking in private."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Following the announcement of Portgas D. Ace's execution, Aokiji was summoned to lead the Marines in the battle against the Whitebeard Pirates and arrived at Marine Headquarters."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Aokiji sat over the execution platform of Portgas D. Ace with his fellow Admirals, watching over it."}, {"type": "paragraph", "text": "When Whitebeard's forces arrived and their captain used his Gura Gura no Mi powers to create two massive tidal waves, Aokiji freezes them both with Ice Age, then attacks Whitebeard with his Partisan. However, he is shattered by one of Whitebeard's seismic waves, which the Admiral shrugs off. He then froze the bay water of Marineford, which not only stopped all the pirate ships from moving, but also served as a foothold for them. Having reformed himself at some point, Aokiji can only remark at the motley crew that Luffy helped gather at Impel Down for his attempt at freeing Ace from the Marines."}, {"type": "paragraph", "text": "After Whitebeard is attacked by Squard, Aokiji follows Sengoku's orders and freezes Buggy and the Impel Down prisoners loyal to him, stopping them from showing the world any more of the battle. When Whitebeard fired off a shockwave towards the execution platform itself, the three admirals, including Aokiji, are seen raising their hands in order to block the sheer concussive force of the shockwave. Aokiji mutters how slow they are at raising the encircling walls in time. Akainu chides Aokiji for his ice being the problem, with Kizaru chiming in for the latter to just melt his ice."}, {"type": "paragraph", "text": "Later, when Luffy leaps over the siege wall, with a large piece of broken mast in hand, Aokiji comments on how, despite how far he has come, that Luffy was still not ready to \"play with the big boys\". When Luffy simply brings the broken mast piece to bear, Aokiji freezes it before it could somehow damage the three admirals and watches as the frozen piece of wood smashes beneath the assault of kicks almost immediately following it."}, {"type": "paragraph", "text": "Luffy, having been (once more) prevented from reaching the execution platform, then gets cornered by Aokiji. He comments that he is in debt to Luffy's grandfather but that he has no choice since Luffy himself chose this path of death for himself. He stabs Luffy through his shoulder with an Ice Saber and as he is about to impale him again, Marco intervenes and shatters the spear with a single kick that knocks Aokiji away from Luffy."}, {"type": "paragraph", "text": "Aokiji is then seen blocking Whitebeard's bisento attack with his Ice Ball. After seeing that he failed to freeze Whitebeard's earthquake, he commented that he did not know that earthquakes could not be frozen. He then got stabbed by Whitebeard's bisento, to which pirates are seen wondering if Aokiji was stabbed with Haki and if he was dead. Aokiji told them not to spout nonsense before grabbing the bisento and using his Ice Block Partisan attack. All of a sudden, Jozu attacks him and Aokiji is caught off-guard, even bleeding from his mouth."}, {"type": "paragraph", "text": "When Jozu is distracted upon seeing Marco being shot by Kizaru's laser beam, Aokiji warns him that he should not be getting distracted and freezes his right arm, and then his entire body, forcing him to fall over resulting in his right arm shattering, before commenting that the Whitebeard Pirates are finished. When Luffy unleashes a burst of Haōshoku Haki, Aokiji is seen shocked and sweating at his power."}, {"type": "paragraph", "text": "After Ace is freed, he attacks Ace and Luffy, but Ace blocked his attack with his fire. Aokiji is later seen with a solemn expression after witnessing Akainu striking Ace from behind with a magma fist. After Whitebeard's death, Aokiji froze the sea once again in order for the pirates to not leave Marineford."}, {"type": "paragraph", "text": "When Jinbe tries to escape into Marineford Bay with Luffy and notices that it was been frozen over, Aokiji is seen nearby apologizing to Jinbe. As the Heart Pirates are leaving with Luffy in their submarine, Aokiji attempts to freeze them with an Ice Age, but the Heart Pirates' submarine manages to elude him. After that, he stands down."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/49/Kuzan_Freezes_Marineford_Harbor.png/revision/latest/scale-to-width-down/210?cb=20160130155457", "caption": "Aokiji freezing the water at the Marine Headquarter's bay."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ec/Marco_vs._Kuzan.png/revision/latest/scale-to-width-down/210?cb=20130224105103", "caption": "Marco attacks Aokiji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2b/Ace_vs._Kuzan.png/revision/latest/scale-to-width-down/210?cb=20141206084341", "caption": "Aokiji vs. Ace"}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He is later seen in his office in Marineford with Commodore Smoker, commenting on Luffy's return to Marineford and the ringing of the Ox Bell. The Admiral wonders if the Ox Bell ringing was some kind of message. Aokiji then spoke with Smoker about the Commodore's request for transfer to Marine outpost G-5 in the New World. Unsure of being able to grant his transfer, he assured he would negotiate with Sengoku for approval. Aokiji was then nominated by Sengoku to be the next fleet admiral upon the latter's resignation."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [], "images": []}, {"title": "A Fierce Duel and Resignation", "level": 4, "content": [{"type": "paragraph", "text": "Even though Sengoku supported Aokiji as a candidate for the next fleet admiral, many of the upper brass of the World Government nominated Akainu. Aokiji strongly opposed Akainu becoming fleet admiral and fought him for the position. They battled on Punk Hazard, with the fight lasting for ten days."}, {"type": "paragraph", "text": "According to Smoker, the battle between these two was so ferocious that it literally changed the weather of Punk Hazard Island. Akainu ended up as the winner, but had sympathy enough to spare Aokiji's life in spite of it being meant as a battle to the death. Unfortunately, Kuzan did not escape unscathed. He parted from the battle with a staggering level of scars and with his left leg reduced to a stump. Though crippled, Kuzan used his Devil Fruit powers to generate a replacement limb out of ice. Afterwards, Kuzan resigned from the Marines, not wanting to work under Sakazuki."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Kuzan_vs._Sakazuki.png/revision/latest/scale-to-width-down/210?cb=20130521141619", "caption": "Aokiji vs. Akainu"}]}, {"title": "After the Resignation from the Marines", "level": 4, "content": [{"type": "paragraph", "text": "After leaving the Marines, Kuzan met a large penguin named Camel and the two of them became traveling companions."}, {"type": "paragraph", "text": "Donquixote Doflamingo and Smoker have speculated that sometime around the timeskip, Kuzan affiliated himself with the Underworld of Brokers. Kuzan has neither confirmed nor denied these suspicions."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Z", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan first appeared near Firs Island's on his bicycle, watching an explosion caused by the fight between Z and Borsalino. He then left after asking himself what the marines were doing."}, {"type": "paragraph", "text": "In Secon Island's springs, he met Luffy, Zoro, Sanji, and Brook. After he calmed them down by saying that he wasn't out to capture them, he warned them of Z's power and his mission to destroy the New World. Brook did not recognize him, but panicked when they told him in that he was an admiral. Kuzan reassured them he was not there to capture them, and had given up being an admiral. "}, {"type": "paragraph", "text": "Brook asked what he was then, with Kuzan finding being questioned bothersome. He thought on the question, and was unable to think of a proper answer confusing them further. However, he told them again he was not their enemy anymore and reminded them if he was he wouldn't be in a hot spring where he couldn’t use his powers. As Kuzan got out of the water, the Straw Hats saw his battle scarred body and his missing leg that he regrew with his ice powers. He merely said he got carried away, when explaining this. Kuzan and the Straw Hats were seen making their way to port, as he told about the great age of pirates. He pondered to himself if pirates were made from the One Piece existing, or if the One Piece existed because of the pirates. Kuzan looked out to sea, telling them how when some follow their dreams, it could lead to pain and sadness of others. He told them that Z planned to destroy piracy by destroying the One Piece. He had chosen to follow Z's journey, but is unsure what actions he himself must take. He then departed, telling Luffy he would find Z on the island. "}, {"type": "paragraph", "text": "After Luffy's second battle with Z, Kuzan met his former instructor. Kuzan gave him a bottle of wine and prepared to fight him but chose not to and just walked away. He told Z he used to drink that because of him, looking up to him. He told Kuzan to not lecture him, and he would go forward with his plan no matter what. Kuzan told him he might die, as Z responded that was no problem if he could rid the world of evil. Z told him to step aside, and the next time they meet they would share drinks together. Kuzan and Z faced each other, but each side unwilling to fight one another as enemies. Kuzan backed down and left Z to his machinations. "}, {"type": "paragraph", "text": "Later, he met with the Straw Hat crew again and explained Z's plan to use the Dyna Stones to destroy all the three Endpoints and then release the Grande Imbuto, which would destroy the New World and everyone in it, pirates and civilians alike. Now that two of the Endpoints had been destroyed, Z is about to go to the last one, Piriodo, and unless the Straw Hats stop him, the Pirate Era would end. The Endpoints had been considered a legend, with most thinking it was nonsense. The government covered up the truth about them, to dissuade pirates from using it. That only the World Government and highest ranking officers of the Marines knew about it. He laments that it was an admiral abusing this knowledge above all else. He reminded them that he was not doing this out of power, but to punish pirates. "}, {"type": "paragraph", "text": "Luffy remains undeterred despite being defeated twice by Z, vowing to chase him down and get his hat back. If he let Z keep his hat, he could never face Shanks or be worthy of the Pirate King title. Kuzan then gave the crew an Eternal Pose leading to Piriodo. Nami asked why he was helping them, as he ignored the question and warned them that their journey would be very dangerous. If they lost to Z, they would be destroyed along with the New World. Or, if they won they would be attacked by the Marines. With that said he left them to their own fates. The crew began making their preparations to leave, as Kuzan and Robin shared a small moment."}, {"type": "paragraph", "text": "Kuzan was then seen watching Z and Luffy's final battle. He later helped his former instructor to protect Ain, Binz, and the Straw Hat Pirates from Borsalino's fleet attack by creating an ice wall so that Z could fight to his heart's content. He was later seen at Z's grave, telling Ain and Binz that he died like he wanted to."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/01/Kuzan_Confronts_Zephyr.png/revision/latest/scale-to-width-down/210?cb=20130902175025", "caption": "Kuzan confronting his former instructor."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Ain_and_Binz_Standing_at_Zephyr%27s_Grave.png/revision/latest/scale-to-width-down/210?cb=20140722065947", "caption": "Kuzan at Z's grave."}]}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime during the events of the Punk Hazard Arc, Kuzan decided to go to Punk Hazard. He eventually arrived shortly after the conflict between the Straw Hat Pirates and the G-5 Marines. Before Doflamingo could deliver the killing blow to Smoker, Kuzan suddenly appeared, claiming that the vice admiral was his friend."}, {"type": "paragraph", "text": "Doflamingo ignored Kuzan and attempted to finish off Smoker, but the former admiral froze Doflamingo solid. The Shichibukai freed himself from the ice and walked away with Buffalo and Baby 5, having no interest in fighting Kuzan. After this, Smoker discussed with Kuzan about the latter's current status. Smoker also wondered if he had some kind of connection to the Underworld. Kuzan stated he's still himself, seemingly reassuring Smoker. He then told Smoker to be wary of Doflamingo and to ask the fleet admiral to dispatch the admirals as soon as possible. He also asked the G-5 Marines to not to reveal his presence there, to which they agreed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Kuzan_Stops_Doflamingo.png/revision/latest/scale-to-width-down/210?cb=20131208022308", "caption": "Kuzan appears behind Doflamingo."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the events of the Corrida Colosseum tournament, Jesus Burgess discussed Kuzan with his captain, Blackbeard. Burgess said that he cannot be trusted, but Blackbeard noted that the same could be said of their crewmate, Shiryu. This indicated that Kuzan had recently been in contact with the Blackbeard Pirates."}, {"type": "paragraph", "text": "The Five Elders later confirmed that Kuzan had indeed allied himself with the Blackbeard Pirates that day."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kuzan was seen reading a newspaper while Camel was cooking barbecue."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kuzan vs. Jaguar D. Saul", "elements": []}, {"text": "Kuzan vs. Nico Robin", "elements": []}, {"text": "Kuzan vs. Monkey D. Luffy, Roronoa Zoro, and Sanji", "elements": []}, {"text": "Kuzan vs. Monkey D. Luffy", "elements": []}, {"text": "Marines vs. Whitebeard Pirates and their allies", "elements": [{"text": "Kuzan vs. Whitebeard", "elements": []}, {"text": "Kuzan vs. Buggy, Mr. 3, and Impel Down's escapees", "elements": []}, {"text": "Kuzan, Borsalino and Sakazuki vs. Monkey D. Luffy", "elements": []}, {"text": "Kuzan vs. Marco", "elements": []}, {"text": "Kuzan vs. Edward Newgate", "elements": []}, {"text": "Kuzan vs. Jozu", "elements": []}, {"text": "Kuzan vs. Portgas D. Ace", "elements": []}]}, {"text": "Kuzan vs. Sakazuki (not seen)", "elements": []}, {"text": "Kuzan vs. Donquixote Doflamingo", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga originally, Aokiji met the Straw Hat Pirates at Tonjit's hut after the Davy Back Fight. In the anime, he met them much later at a different island and showed his powers helping some shipwrecked passengers as opposed to Tonjit."}, {"type": "paragraph", "text": "In the anime, after the war, Aokiji is seen standing on the bow of a warship vessel approaching Marineford, sneezing the very moment Sengoku mentions him to Kong as his chosen successor. When he enters the headquarters building, a Marine officer approaches him in tears reporting his inability to capture Luffy. Aokiji merely pats him on the shoulder and tells him that it is okay."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Kuzan's alias, \"Aokiji\", means \"Blue Pheasant\" in Japanese. 青 = Ao = Blue (this \"Ao\" Color can be referred as both blue or green, depending on the Japanese phrase) 雉 = Kiji = Pheasant. It was literally translated in most dubs. Kiji was written katakana キジ from the introduction of Kuzan, but was shown in kanji in his introduction box in the Battle of Marineford. After that, it was reverted to katakana."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Aokiji has been a choice character in several series of merchandise. He has been featured in the Portrait of Pirates Figuarts Zero, One Piece DX Figure, One Piece High Spec Coloring Figure, Super Modeling Soul One Piece lines. But also in World Collectable,One Piece Super Effect, One Piece Amazing Log Collection,Deformeister Petit One Piece,One Piece Super Deformed Figures, Anichara Heroes, One Piece Full Face Jr., One Piece Battle One Piece Attack Motions, One Piece Great Deep Collection, and the One Piece Logbox series."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/DX_Kuzan.png/revision/latest/scale-to-width-down/180?cb=20150311021459", "caption": "Aokiji in Portraits of Pirates."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The design for Kuzan's face is based on the late actor Yusaku Matsuda. The character that the actor played in the TV series and movie \"Detective Story\" (Tantei Monogatari) even had a similar hairstyle, clothing and wore the same sleep mask design. Kuzan's birthday is even based upon Matsuda's.", "elements": []}, {"text": "His alias and other admiral aliases (Aokiji, Akainu, and Kizaru), are taken from Momotaro legends (Momotaro met Pheasant, Dog, and Monkey as friends to accompany him in his journey).", "elements": []}, {"text": "In the 6th Japanese Fan Poll, Kuzan is currently ranked as the 26th most popular character, making him the most popular of the Marines (before his resignation).", "elements": []}, {"text": "He is the first admiral (though technically former) to be shown after the time skip.", "elements": []}, {"text": "Kuzan's given name can mean \"Nine Mountains\" if written in kanji (九山 (Kuzan, 九山)), a phrase repeatedly named in post-timeskip One Piece: Roronoa Zoro mentions it in reference to his ability to \"cut everything\"; specifically, he states that \"of the nine mountains and five seas, and under the sky, there's nothing [he] cannot cut\". In this sense, Kuzan (九山, Kuzan) means \"all the land\", as Gokai (五海, gokai) is \"all the seas\", and the entire phrase is an allegory for \"all the world\".", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Y%C5%ABsaku_Matsuda.png/revision/latest?cb=20130307122404", "caption": "Yūsaku Matsuda."}]}]}