{"sections": [{"title": "Gin", "level": 1, "content": [{"type": "paragraph", "text": "Gin the \"Man-Demon\" is a pirate and the Combat Commander （戦闘総隊長 Sentō sōtaichō) of the Krieg Pirates. Due to his actions, he can be considered the secondary antagonist of the Baratie Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gin is a relatively thin man with short, scruffy hair, a scruffy beard, and a slight mustache. He has dark circles under his eyes, as though he lacks sleep."}, {"type": "paragraph", "text": "Gin wears an open white (gray in the anime) jacket with a red sea-serpent design on each side with a green shirt underneath, gray pants matching with his jacket, a gray headband with blue stripes design, and two spherical earrings on each ear. While posing as Krieg, Gin wore a black jacket draped over his shoulders like a cape."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Gin is fiercely loyal to Don Krieg, carrying out whatever orders he may be given from him no matter how inhumanly brutal or ruthless without protest or hesitation, thus earning himself the epithet of \"Gin the Man-Demon\". His respect for Krieg is so great, he obeys Krieg's orders to throw away his gas mask and breathe the deadly MH5 poison gas because he is ashamed to have failed Krieg."}, {"type": "paragraph", "text": "However, unlike Krieg, Gin has a sense of honor, being unable to bring himself to kill Sanji, the first person to show him kindness (by saving him from starvation)."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Gin is fiercely loyal to Krieg, respecting him and fearing his power. However, he also wishes to escape from such followings. To this point, he was willing to risk his life to save Krieg, and to throw away his gas mask allowing himself to be poisoned by Krieg when ordered. After Krieg's defeat, Gin decides to start afresh and no longer follow Krieg."}, {"type": "paragraph", "text": "As for the rest of the Krieg Pirates, they respect Gin for his cruelty and strength amongst the crew. They were horrified when Krieg cruelly poisoned him. Even though Pearl is arrogant about his own strength, he acknowledges Gin as superior. In turn, Gin does show care for his crew, as he was horrified at the destruction of the fleet and the loss of his comrades."}], "images": []}, {"title": "Sanji", "level": 3, "content": [{"type": "paragraph", "text": "Sanji is the first person to ever show kindness to Gin, by giving him free food when the pirate was starved and penniless. As such, Gin ultimately could not kill Sanji, despite his own reputation as a \"Man-Demon\", and Krieg's orders."}], "images": []}, {"title": "Monkey D. Luffy", "level": 3, "content": [{"type": "paragraph", "text": "At first seeing Luffy as a simple young pirate, he advised Luffy to not enter the Grand Line, but Luffy does not heed the warning. After Gin takes Zeff hostage, Luffy argues against such a dirty tactic, to which Gin rebukes that is how the world works. After Gin showed his redeeming traits, Luffy stated that Gin should not follow Krieg anymore. When Luffy defeated Krieg, he earned Gin's respect, and Gin stated that he wishes to meet Luffy once again in the Grand Line."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Gin is a skilled warrior and a match for even an experienced martial artist like Sanji (although Sanji was severely injured during their fight due to the beating he received from Pearl and Gin was still feeling the effects of starving to near death and 3 days of holding in a prison cell upon Fullbody's ship). The Baratie cooks' first impression of him was due to him being starved and weakened; they believed him to be a mere lower-ranking subordinate, until he revealed his true strength later in battle, which led to the surprise of many. Having earned a bounty of 12,000,000 is considered impressive for an East Blue pirate."}, {"type": "paragraph", "text": "Gin was a man who was captured by Marines upon his first appearance, but after being starved to near death and 3 days of holding in a prison cell upon Fullbody's ship, he was still able to escape and take down 7 of Fullbody's men. He was also able to pin down Red Leg Zeff, a retired yet still powerful former pirate, and broke his peg leg."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Gin_Destroys_Pearl%27s_Iron_Wall.png/revision/latest/scale-to-width-down/210?cb=20130118034609", "caption": "Gin shatters Pearl's shield."}]}, {"title": "Man-Demon Tactics", "level": 3, "content": [{"type": "paragraph", "text": "Gin's primary fighting style, known as Man-Demon Tactics, utilizes a special pair of tonfa weighted with metal spheres. These can be used as direct bludgeons, or spun in place like flails for extra momentum and power; combined with Gin's natural strength and agility, they become highly deadly weapons capable of smashing Pearl's iron shields in a single blow (a feat even Sanji could not achieve with multiple blows)."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Gin seems to be proficient with certain firearms, as he shot Lines from the back with a flintlock from a certain distance, and held a shotgun at Zeff while taking him as a hostage. Despite this, he appears to favor his tonfa in open combat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ca/Gin_Holds_Zeff_at_Gunpoint.png/revision/latest/scale-to-width-down/210?cb=20140727110244", "caption": "Gin holds Zeff at gunpoint."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "The only known history on Gin is that he was present for Don Krieg's voyage to the Grand Line. After seven days in stormy weather Krieg's fleet came across the Shichibukai, Dracule Mihawk. To the horror of Gin, Mihawk quickly destroys Krieg's fleet with ease, leaving only their flagship to escape, under the cover of an unexpected storm. This incident left a scarring image in Gin's memory, as he lost his comrades."}, {"type": "paragraph", "text": "While retreating from the Grand Line Gin leaves the fleet disguised as Krieg in order to draw Fullbody away. He is eventually captured and was a prisoner aboard Fullbody's ship when it docked at the Baratie."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b8/Krieg_Pirates_Return_from_Grand_Line.png/revision/latest/scale-to-width-down/210?cb=20130215203336", "caption": "Gin posing as Krieg to lure Fullbody away."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Baratie Arc", "level": 4, "content": [{"type": "paragraph", "text": "After being starved for three days on board of the Marine ship, Gin defeats the seven guards and even kills Seaman First Class Lines by shooting him in the back. Then, walking into Baratie, where the prison ship so happens to be docked, Gin demands food, only to be beaten and thrown out by Patty for not having any money. However, Gin is given a plate of food by Sanji for free when he is starving on the Baratie. He also advises Luffy, who is working there as a Chore Boy, not to go to the Grand Line, due to the terrifying experience Gin himself suffered."}, {"type": "paragraph", "text": "Gin eventually returns to the Dreadnaught Sabre, where the starving remnants of the Krieg Pirates await for their battle commander to return. He brings them to Baratie to replenish their strength. However, after Krieg regains his strength, he attacks Sanji and orders the chefs to give food for the 100 men on board of the ship, and then reveals his intentions to take over Baratie as his new flagship. Gin is horrified by Krieg's lack of gratitude, but the Pirate Admiral simply strikes Gin in the shoulder, causing him to collapse from pain. After Zeff gives Krieg the food, due to the head-chef understanding how starving in the sea feels, Gin reveals to the staff of Baratie how the the Pirate Armada fell to Mihawk."}, {"type": "paragraph", "text": "After Mihawk shows himself in his attempt to wipe out the remnants of Krieg's crew, but left after a satisfying battle with Roronoa Zoro, Krieg begins his attack on Baratie. Eventually, after Pearl is taken down by Luffy and Sanji, Gin suddenly takes Zeff as hostage with a shotgun and by breaking his peg leg. He tries to offer Sanji an ultimatum: Zeff's release in exchange for Baratie, but Sanji, owing a debt to Zeff, cannot allow either to be harmed. Due to this, Sanji is at the mercy of Pearl, who got back up, and brutally attacks the now-disabled Sanji while Zeff is at risk. However, even when Luffy threatens to destroy the highly sought Baratie, Gin could not bring himself to kill Zeff, despite Krieg's orders."}, {"type": "paragraph", "text": "Eventually, Gin can take no more, and strikes down Pearl in one strike. While this angers Krieg, Gin states that the right to kill Sanji belongs to him alone. At this stage, Krieg reveals to the rest of the chefs that Gin is the Combat Commander of the crew, and is held at high regards. He orders Gin to kill Sanji, and the two combatants start to fight. At this stage, Krieg also reveals that Gin is nicknamed the \"Man-Demon\" for his cruelty and ruthlessness in combat, torturing any- and everyone to death under Krieg's orders. While gaining an upper hand due to Sanji being weakened from his fight with Pearl, and even pinning down the chef, Gin ultimately cannot kill Sanji, as Sanji was the only person to ever treat Gin with kindness of any kind."}, {"type": "paragraph", "text": "Gin absolutely refuses to kill Sanji, and even begs Krieg to spare Baratie and its chefs. For this, Krieg is severely disappointed with his subordinate, disowns Gin from his crew, and orders him to drop his gas mask into the sea. Despite the rest of the crew's thinking of how Gin is valuable to Krieg due to his immense loyalty and strength, Krieg fires the \"Deadly Poison Gas Bomb MH5\", releasing a fatal wave of poison to anyone who is not protected. Even though Luffy grabs two masks from the crew members, he failed to grab one for himself; as a result, Gin threw back that mask to Luffy, who dons it on without knowing where it came from until after the gas disperses. As a result, Gin is severely poisoned. Furious at Krieg's cruelty at Gin, Luffy charges in to fight, while telling Gin not to follow such a man anymore; even Sanji notes that Gin has chosen the wrong person to follow. Sanji requests for antidotes from his fellow chefs, and Zeff tells them that the antidote should be in the gas masks."}, {"type": "paragraph", "text": "Gin is notified by Patty and Carne that Krieg was defeated by Luffy, which brings Gin to tears. The Pirate Admiral goes into an insane rampage, refusing to acknowledge defeat, but Gin punches him in the stomach, knocking the man out, stating that they must admit defeat, and start over. He then carries away Krieg and the crew in a small boat given by Baratie. Before leaving, however, Gin gives his regards to Sanji, stating that he followed Krieg for his power but always wants to escape from it, but Krieg did teach him that victory is necessary by any means possible, and hopes to see Luffy again in the Grand Line. It is unknown whether he survived from the MH5 gases or not, for after inhaling the poisonous gases he notes that he may not live for much longer."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ef/Sanji_Gives_Gin_Food.png/revision/latest/scale-to-width-down/210?cb=20130118032028", "caption": "Sanji giving a starving Gin food."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Man-Demon_Tactics_Infobox.png/revision/latest/scale-to-width-down/210?cb=20130215204232", "caption": "Gin vs. Sanji"}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Krieg Pirates vs. Dracule Mihawk", "elements": []}, {"text": "Gin vs. Sanji", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The Japanese word \"gin\" (銀), pronounced with a hard \"g\", literally means \"silver\" and would be most accurately romanized \"Gin\". In all English anime iterations of One Piece, the name was rendered as \"Ghin\". This was done to avoid confusion and to clarify the pronunciation, as \"Gin\" in English would commonly be pronounced \"jihn\" as is the alcoholic beverage \"gin\". Both the 4kids and FUNimation dubs pronounce the word correctly as \"geen\"."}, {"type": "paragraph", "text": "Gin's status within the crew is \"Pirate Armada Combat Commander\" (海賊艦隊 戦闘“総隊長”, Kaizoku Kantai Sentō \"Sōtaichō\"). However, due to some mistranslations and confusion, he has been mislabeled as a First Mate."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Gin's favorite food is the pilaf made by Sanji.", "elements": []}]}], "images": []}]}