{"sections": [{"title": "Kuromarimo", "level": 1, "content": [{"type": "paragraph", "text": "Kuromarimo was the magistrate during Wapol's rule on Drum Island, and was the highest-ranking law officer below Wapol. After fleeing Drum Island to escape Blackbeard's attack, Kuromarimo became part of the Bliking Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kuromarimo sports a long, orange cloak, with white lining, and black afros at each end, and white afros hanging from the front. He wears gloves that cover all fingers but his thumb, and resemble an afro. He has a large black afro on his head, and three small ones on his beard. He is of medium height and normal weight. He wears a shirt that's orange in the middle and white on the sides with light yellow buttons, along with orange shorts. He has hairy legs, and black boots with white laces. Overall, Kuromarimo resembles a boxer."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kuromarimo is selfish and arrogant. He carried out every order Wapol gave him, including capturing the doctors from all over the kingdom. He thought that conscience did not serve the politics of his own kingdom and for this reason, he laughed at hearing Dalton talk about his meeting with Vivi. Despite this, he is extremely loyal to Wapol and worried about him, like when Luffy threw him into the sea. He is a great lover of alcohol, and often encouraged Dalton when both were still officials to have a drink with him instead of addressing problems within the kingdom."}, {"type": "paragraph", "text": "Kuromarimo was able to work very well with Chess, since both shared similar characteristics and ideas. Compared to Chess, however, he proved more lenient towards Dalton after his rebellion. In fact, when he went to visit him in prison to persuade him to apologize to Wapol, he merely mistreated him a little."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As magistrate and administrator of the Drum Kingdom, Kuromarimo had considerable influence over the king and great authority over the people. He temporarily lost these privileges after he fled with Wapol, only to regain them once he returned home. He also held an important role within the Bliking Pirates."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Kuromarimo is physically strong and a powerful fighter, having easily defeated an army of Drum Island's watchguards and later a group of lapahns. He has some endurance, having taken a surprise blow from a lapahn, which is powerful enough to drop trees, and quickly got back up."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He uses a pair of boxing gloves and he showed that he is a powerful boxer."}, {"type": "paragraph", "text": "Kuromarimo has the ability to do many tricks with his afros, from ejecting spikes from them to shooting them off and using them to constrict opponents."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bikkuri Marimo (ビックリマーリモ, Bikkuri Mārimo, literally meaning \"Surprise Ball Seaweed\"): Kuromarimo exposes spikes protruding from his Afro gloves and attempts to crush his opponent. Called Marimo's Surprise in the Viz Manga and FUNimation dub.", "elements": []}]}, {"type": "list", "elements": [{"text": "Eleki-Marimo (静電気 (エレキ) マーリモ, Ereki-Mārimo, literally meaning \"Electric Ball Seaweed\"): Kuromarimo throws an afro shaped hairball at his opponent that sticks to the opponent with a strong static cling. While the Afros themselves are not that dangerous they do burn quite well and make great targets for Chess' Checkmate attack. Called Marimo's Static Cling in the Viz Manga and FUNimation dub and Static Cling Attack in the 4Kids dub.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Eleki-Marimo.png/revision/latest/scale-to-width-down/190?cb=20130813051933", "caption": "Kuromarimo uses \"Eleki-Marimo\" on Sanji."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Kuromarimo became the magistrate after Wapol became king. He approved everything that Wapol did, including eliminating all of the doctors on Drum Island, except the Isshi-20."}, {"type": "paragraph", "text": "One day, Blackbeard arrived on Drum Island and began the destruction of the island. Kuromarimo, along with Chess, followed Wapol who cowardly escaped it. For a whole year in exile, he spent his life as a pirate."}], "images": []}, {"title": "Drum Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Kuromarimo and the rest of the Bliking Pirates crossed the path of the Straw Hat Pirates and begin to attack the pirates. But they stopped the attack after Luffy sent Wapol to the sea. Kuromarimo and the Bliking Pirates decided to rescue their king and swear vengeance on the Straw Hat Pirates."}, {"type": "paragraph", "text": "One day later, Kuromarimo and the Bliking Pirates returned to Drum Island after one year of exile and began to terrorize the inhabitants of Drum Island. Kuromarimo also learned that the Straw Hat Pirates were also on Drum Island. After they defeated Dalton, Kuromarimo and the Bliking Pirates were buried by an avalanche caused by the Lapahns."}, {"type": "paragraph", "text": "Thinking that the avalanche was caused by the Straw Hat Pirates, Wapol, Kuromarimo, and Chess decided to pursue the Straw Hat Pirates. Kuromarimo, Wapol, and Chess managed to find Luffy who was carrying Nami and Sanji to Kureha, who is living at Wapol's former castle. They tried to attack him but Luffy dodged the attack. They continued the attack until the Lapahns stopped Kuromarimo and Chess, giving Luffy time to escape. But soon after, Kuromarimo, Wapol and Chess defeated the Lapahns."}, {"type": "paragraph", "text": "Kuromarimo, Wapol and Chess then go to Drum Castle with the help of Robson so Wapol can evict Kureha and Chopper from his castle. Once arrived, they confronted not only Kureha and Chopper, but also Luffy and Sanji. When Luffy nearly sent Wapol off the cliff with a punch, Kuromarimo and Chess saved him just in time. Kuromarimo then send his afro-shaped hairballs at Sanji, which stick to him."}, {"type": "paragraph", "text": "After being humiliated again by Luffy, Wapol then used his Baku Baku no Mi abilities to fuse Kuromarimo and Chess into Chessmarimo. After transforming, Chessmarimo vowed to protect Wapol, and then engaged a fight with Chopper. The reindeer ate a Rumble Ball, and much to Chessmarimo's surprise, he achieved more than his regular three transformations. After Chopper evaded their attacks with Jump Point, blocked them with Guard Point, and destroyed their hammers with Arm Point, he used his Brain Point to locate Chessmarimo's weak spot. After his chin was identified as the weak point, Chessmarimo was defeated by Chopper's Kokutei Roseo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/32/Wapol_Eats_Chess_and_Kuromarimo.png/revision/latest/scale-to-width-down/230?cb=20190411144456", "caption": "Wapol eats Chess and Kuromarimo to create Chessmarimo."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "With regards to his name, \"kuro\" means \"black\" and \"marimo\" is a kind of algae that forms into round balls due to the action of the tides. So in essence, \"Kuromarimo\" is a way of referring to his hairstyle."}, {"type": "paragraph", "text": "In the 4Kids dub, Kuromarimo speaks with an American Southern accent. In the FUNimation dub, he speaks with an ebonic accent."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the manga, whenever Kuromarimo initiates his attack Eleki-Marimo, he first jumps then he throws his afros at his target. In the anime, however, he is not shown doing the former.", "elements": []}]}], "images": []}]}