{"sections": [{"title": "Chessmarimo", "level": 1, "content": [{"type": "paragraph", "text": "Chessmarimo is a fusion of Chess and Kuromarimo, created by Wapol's Baku Baku Factory."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chessmarimo appears to be a large man and a combination of Chess and Kuromarimo. He has four thin arms, short legs and a wide-set body. He wears similar clothing to his original parts, sharing the color patterns of Chess and Kuromarimo's clothes."}, {"type": "paragraph", "text": "Sanji comments that Kuromarimo is simply standing on Chess' shoulders and only their clothes were fused. Oda, however, treats Chessmarimo like it is one entity."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Chessmarimo shares the personalities of Chess and Kuromarimo. The only unique trait is that his voice sounds like both Chess and Kuromarimo speaking at the same time."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Chessmarino has access to a great amount of weapons, such as arrows, mallets, and axes. He also has four hands, increasing his attack power and doubling the amount of objects he can hold."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Yukidoke no Ya Marimo (雪解けの矢マーリモ, Yukidoke no Ya Mārimo, literally meaning \"Snow-Thawing Arrow Marimo\"): Chessmarimo fires two giant burning arrows with his four hands, each with one of Kuromarimo's afros on the end for extra power. This is called Marimo's Snow-Melting Arrow in the Viz Manga and FUNimation dub and simply Snow-Melting Arrows in the 4Kids dub.", "elements": []}, {"text": "Dobikkuri Marimo, Quatro Hammer (ドビックリマーリモ四本大槌 (クワトロハンマー), Dobikkuri Mārimo Kuwatoro Hanmā, literally meaning \"Super Surprise Marimo, Four Hammers\"): Chessmarimo wields four large wooden mallets (one in each hand) and uses them to bash the opponent senseless. This is called Marimo's Super Surprise Quattro Hammer in the Viz Manga and FUNimation dub and simply Super Surprise Quattro Hammer in the 4Kids dub.", "elements": []}, {"text": "Dobikkuri Marimo, Quatro Axe (ドビックリマーリモ四本戦斧 (クワトロアックス, Dobikkuri Mārimo Kuwatoro Akkusu, literally meaning \"Super Surprise Marimo, Four Axes\"): Chessmarimo wields four large axes. This is called Marimo's Super Surprise Quattro Axe in the Viz Manga and FUNimation dub and Supreme Quattro Axe in the 4Kids dub.", "elements": [{"text": "Yukiwariso (雪割り草, Yukiwarisō, literally meaning \"Snow-Cutting Grass\"): After using his Dobikkuri Marimo, Quatro Axe technique, Chessmarimo makes an X-shaped cleave with all four axes and sends a slicing shockwave along its path. This is called Snow-Slicing Blade in the Viz Manga and 4Kids dub and Snow-Splitting Blade in the FUNimation dub.", "elements": []}, {"text": "Happo Yukidaore (八方雪倒れ, Happō Yukidaore, literally meaning \"Snow Falling From All Directions\"): After using his Dobikkuri Marimo, Quatro Axe technique, Chessmarimo charges at his opponent slicing and slashing wildly. In the Viz Manga and 4Kids and FUNimation dubs, this attack is called Multi-Directional Snow Splitter.", "elements": []}]}]}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Chessmarimo was spit out by Wapol after he consumed Chess and Kuromarimo and combined them to create a single warrior. After transforming, Chessmarimo vowed to protect Wapol, and then engaged a fight with Chopper. The reindeer ate a Rumble Ball, and much to Chessmarimo surprise, he achieved more than his regular three transformations. After Chopper evaded their attacks with Jump Point, blocked them with Guard Point, and destroyed their hammers with Arm Point, he used his Brain Point to locate Chessmarimo's weak spot. After Chess' chin was identified as the weak point, Chessmarimo was defeated by Chopper's Kokutei Roseo. It is unknown what happened to him after Chopper defeated him."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Chessmarimo vs. Tony Tony Chopper", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 147 and Episode 87.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 18 (p. 66), Oda's response to the alleged misprint.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 149 (p. 4) and Episode 88.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 149 (p. 5-6) and Episode 88.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 149 (p. 11) and Episode 88.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 149 (p. 13) and Episode 88.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 149 and Episode 88, Chessmarimo fights Chopper.", "elements": []}]}], "images": []}]}