{"sections": [{"title": "Lily", "level": 1, "content": [{"type": "paragraph", "text": "Lily is a former member of the Bellamy Pirates. She was first seen with Sarquiss on Jaya Island. She was the only member of the minor crew members in Bellamy's crew that was openly named. Lily appeared in most of the events the crew were involved with during the Jaya Arc. She was last seen when Doflamingo came to punish Bellamy."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lily is a blonde girl wearing a red bandana, sunglasses, and a white shirt that exposes her cleavage. She has an hourglass figure that is fairly developed, and is usually seen with a grin of pride or arrogance. Her sleeves are blue fur that lay downwards which do not seem to go with the rest of her outfit."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Younger_Lily.png/revision/latest/scale-to-width-down/115?cb=20150913130013", "caption": "Lily when she was younger."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Lily seemed to boast the same overconfident personality that the rest of her crew mates demonstrated. She was most noted for telling Sarquiss not to waste money on Luffy, Zoro, and Nami when he threw money at them and acted snobby towards them, believing them to be beneath her. When Nami rejects Sarquiss who had asked to buy her off the Straw Hat Pirates, she and Mani exchange glances of disbelief."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Skypiea Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "She was there with Sarquiss as they left the villa at Jaya. Later, she was seen in the bar as Luffy and Zoro were being beaten up. She stated that Bellamy should not waste his time on Luffy and Zoro, as she thought they were just weaklings."}, {"type": "paragraph", "text": "After that, the Bellamy Pirates steal the gold from Cricket. She was seen at the bar when Jobo bursted in telling Bellamy about Luffy and Zoro's high bounties."}], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "She was seen when Doflamingo used his powers to force Bellamy and Sarquiss fight against each other as punishment for disgracing themselves under his flag."}], "images": []}, {"title": "Later Events", "level": 3, "content": [{"type": "paragraph", "text": "Later, Lily would travel with Bellamy and the other members of the crew to a Sky Island, finding a golden pillar in the process. Although Bellamy managed to bring this back to Doflamingo and regain his trust, it is unknown what became of Lily and the rest of the Bellamy Pirates when their captain forfeited his captaincy to join the Donquixote Pirates."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 223 and Episode 146, Lily is introduced.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 223 and Episode 146.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 224 and Episode 146.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 225 and Episode 147.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 706 and Episode 635, Bellamy tells Luffy he went to Sky Island and lost his crew.", "elements": []}]}], "images": []}]}