{"sections": [{"title": "Sarquiss", "level": 1, "content": [{"type": "paragraph", "text": "\"Big Knife\" Sarquiss is the former first mate of the Bellamy Pirates, with a bounty of 38,000,000 on his head. His epithet originates from the large dagger he always wields, which bears a strong resemblance to a massive kukri."}, {"type": "paragraph", "text": "Due to his actions, he can be considered a supporting antagonist of the Jaya Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sarquiss has wavy, shoulder-length blue hair and wears a purple-tinted visor over his eyes. He also wears a white-furred coat over his bare chest in addition to golden chains that are either a necklace or a clasp. He has red-and-white striped gloves and pants with the same pattern alongside a gold belt."}, {"type": "paragraph", "text": "On Sarquiss' bare chest is a tattoo of Doflamingo's Jolly Roger: a smiley with a cancel symbol. He also has the symbol on his belt."}, {"type": "paragraph", "text": "Sarquiss wields a giant curved knife that greatly resembles a kukri, and is often seen with a woman at his side, Lily."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/52/Younger_Sarquiss.png/revision/latest/scale-to-width-down/115?cb=20150913131658", "caption": "Sarquiss when he was younger."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As far as personality is concerned, Sarquiss appears to not be very bright, but just as over-confident and self-absorbed as the rest of the pirates in Bellamy's crew. He interpreted Zoro and Luffy's refusal to fight back when Bellamy challenged them at Terry's bar as an act of cowardice, and insisted that Bellamy's quick defeat at Luffy's hands was a \"lucky shot\" and even attempted to challenge the younger pirate, only to cringe once the Straw Hat captain finally gave Sarquiss his attention. Unfortunately he did not seem to learn from this, as soon after Luffy leaves, he ends up bumping into Blackbeard and made a rude remark towards him and continues to badmouth Luffy, to which the captain promptly smashes Sarquiss into the ground."}, {"type": "paragraph", "text": "Just like his captain, he strongly believes that a New Age is coming and laughs at anyone who mentions their dreams. He also falsely believes that a bounty serves as a rating of a person's fighting level, making him believe himself to be a more powerful fighter than he truly is."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Sarquiss possesses a bounty of 38,000,000, an indication of his danger. He seems to be quite agile, but Blackbeard defeated him with great ease."}], "images": []}, {"title": "Weapons", "level": 3, "content": [], "images": []}, {"title": "Big Knife", "level": 4, "content": [{"type": "paragraph", "text": "Sarquiss uses a giant dagger, which resembles a giant kukri, to fight. It's what gave him his nickname: \"Big-Knife\" Sarquiss. He usually spins the blade like a windmill in front of him, as to show off. From his one named technique, Sarquiss shows certain acrobatic skills."}, {"type": "list", "elements": [{"text": "Big Chop (大刃撃(ビッグチョップ), Biggu Choppu, lierally meaning \"Large Blade Attack\"): Sarquiss' only-known named attack, where he spins vertically and uses his trademark, the \"Big Knife\" to turn himself into a human buzz-saw. He first used this against Masira, spinning vertically while jumping, cutting Masira multiple times.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Big_Chop.png/revision/latest/scale-to-width-down/210?cb=20130117174808", "caption": "Big Chop"}]}, {"title": "Others", "level": 4, "content": [{"type": "paragraph", "text": "During the time the Bellamy Pirates were still in North Blue, Sarquiss wielded a katana on his back."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "He is first seen on Jaya in Mock Town, bad mouthing Luffy, Zoro and Nami, when they try to enter a hotel, that the Bellamy Pirates had booked up fully. After a conversation with the three pirates, Sarquiss came to the conclusion they were a pitiful bunch and threw money on the ground in front of them. As they walked away he called them useless. After seeing Luffy's 30,000,000 wanted poster, Sarquiss decides to show it to his captain Bellamy."}, {"type": "paragraph", "text": "Later, Sarquiss and the rest of the crew went to Jaya to attack the Saruyama Alliance for their gold, and Sarquiss used his Big Chop to slice Masira, but was then repelled by Shoujou. With Bellamy being the main force of the crew, they defeated their opponents and stole the gold. With that, they returned to Mock Town, only to be notified of Luffy and Zoro's new bounties, followed by Luffy himself challenging Bellamy. He at first laughs with the rest of the crew while watching the fight. But that quickly ends after Luffy easily knocks out Bellamy with one hit. In disbelief, he begs Bellamy to get back up, but the bounty poster from before flies into his face and he realizes in horror that they aren't fakes. He tries to regain his bravado as Luffy takes back Cricket's gold but shrinks back when Luffy gives him his last bit of attention."}, {"type": "paragraph", "text": "After Bellamy is defeated by Luffy, Sarquiss bumps into Blackbeard and threatens him. Blackbeard responded by smashing Sarquiss' head on the floor with ease."}], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Luffy easily defeated Bellamy, they were paid a visit by Donquixote Doflamingo, who, with his powers, forced Bellamy and Sarquiss to fight each other as punishment for disgracing themselves under his flag. Sarquiss begged for mercy, and Bellamy pleaded for another chance, but Doflamingo merely laughed and forced Sarquiss to slash his captain with his \"Big Knife\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/Sarquiss_vs._Bellamy.png/revision/latest/scale-to-width-down/210?cb=20130513213628", "caption": "Sarquiss vs. Bellamy."}]}, {"title": "Later Events", "level": 3, "content": [{"type": "paragraph", "text": "Later, he would travel with Bellamy and the other members of the crew to a Sky Island, finding a golden pillar in the process. Although Bellamy managed to bring this back to Doflamingo and regain his trust, it is unknown what became of Sarquiss and the rest of the Bellamy Pirates when their captain forfeited his captaincy to join the Donquixote Pirates."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sarquiss vs. Shoujou", "elements": []}, {"text": "Sarquiss (controlled by Donquixote Doflamingo) vs. Bellamy", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Vivre Card - One Piece Visual Dictionary romanized his name as \"Sarquiss\". However, One Piece Ten: Eternal Log revealed his wanted poster with \"Sarkies\" on it."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Grand Battle 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sarquiss has a distinct laugh, starting with \"Pa\" (i.e. Pahahahaha!)", "elements": []}, {"text": "In the third Popularity Polls Sarquiss came in at 56th place after Gommorah.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 222 and Episode 146, Sarquiss makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 223 and Episode 146, Sarquiss is introduced.", "elements": []}, {"text": "↑  https://one-piece.com/special/sbs/detail/3.html/", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0240), Information about Sarquiss is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 231 and Episode 150, Sarquiss uses his \"Big Chop\" attack on Masira.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 77 Chapter 769 and Episode 709, Sarquiss seen with a katana.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 32 Chapter 303 (p. 4-9) and Episode 207, Doflamingo punishes Bellamy for tarnishing his symbol.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 706 and Episode 635, Bellamy tells Luffy he went to Sky Island and lost his crew.", "elements": []}]}], "images": []}]}