{"sections": [{"title": "Porche", "level": 1, "content": [{"type": "paragraph", "text": "Porche is a member of the Foxy Pirates, and along with Hamburg, was one of Foxy's first crewmates. She is considered an idol by the crew and is loved by all of the men."}, {"type": "paragraph", "text": "Due to her actions, she is a major antagonist during the Long Ring Long Land Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Porche is a slender young woman with dark blue hair, blue eyes, and a long pointed nose. She is seen wearing a pink jumpsuit with extremely puffed pantlegs, which is unzipped on the top to reveal a bikini top beneath it. Her outfit is adorned by several large, white puff-balls, the most notable one being the one hanging from her hat. She is also never seen without the standard Foxy Pirate face mask."}, {"type": "paragraph", "text": "In the anime, Porche is also seen wearing a Foxy Team jersey during certain Davy Back Fight events."}, {"type": "paragraph", "text": "In the special Adventure of Nebulandia, she is briefly seen without her face mask or hat, having temporarily disguised herself."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She loves that she is worshipped by the men of the crew. In the anime, she even becomes jealous when Nico Robin becomes part of the crew and all the attention is off her. Her personality is like that of a very arrogant girl who lacks intelligence. She is very loyal to Foxy, but also has a huge obsession with Chopper since she thinks he's so cute. She refers to him as \"Choppy\" (チョッピー, Choppii). In the anime, she prefers that he stay in his Brain Point form, as shown when he turns into his Jumping Point form she yelled \"What happened to Choppy?! That's not cute at all!\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Her weapon is the Cutie Baton (キューティバトン, Kyūti Baton) a baton-like weapon that shoots shurikens covered with flowers and, in the anime only, shoots out a purple gas (presumably some kind of knockout gas) that causes those hit by it to \"blank out\", leaving them helpless and can also hypnotize."}, {"type": "list", "elements": [{"text": "Ohana Shuriken (お花手裏剣, Ohana Shuriken, literally meaning \"Flower Shuriken\"): Porche quickly spins her baton to make a spiral of flowers appear around her, and then throws the flowers at her opponents, that turn out to be rose-shaped sharpened Shurikens. This is called Flower Shuriken in the FUNimation dub.", "elements": []}, {"text": "Ohana Saimin (お花催眠, Ohana Saimin, literally meaning \"Flower Hypnosis\"): An anime-only technique. Porche transforms her baton into a bouquet of roses that hides a powerful somniferous gas.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Porche and Hamburg were the first two people to join Foxy and they formed the Foxy Pirates."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "She first appeared with Foxy and Hamburg when Foxy shot Shelly and invited Monkey D. Luffy to participate in the Davy Back Fight game."}, {"type": "paragraph", "text": "Later, once the game started, she participated in the Donut Race with Capote and Monda against Nami, Usopp, and Nico Robin of the Straw Hat Pirates. She and her teammates managed to win the Donut Race thanks to Foxy's \"help\". When Roronoa Zoro and Sanji won the Groggy Ring, Porche was really upset to see Tony Tony Chopper go because she was really attached to him."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Porche%2C_Capote%2C_and_Monda_in_Cutie_Wagon.png/revision/latest/scale-to-width-down/210?cb=20130212053856", "caption": "Porche, Capote and Monda in their boat Cutie Wagon."}]}, {"title": "Foxy's Return Arc", "level": 3, "content": [{"type": "paragraph", "text": "During a large storm, the Straw Hats saved Foxy, Porche, and Hamburg by throwing them a rope and having all three of them aboard. Porche and the rest of the crew started crying and Sanji comforted her by giving her soup."}, {"type": "paragraph", "text": "After the soup, Porche admired all the gold the Straw Hats had. They later spotted their ship, the Sexy Foxy. Once united with their crew, they started crying out of joy. It was then revealed that the Fanged Toad Pirates had taken it over."}, {"type": "paragraph", "text": "Before the the three of them could take back the ship, the captain of the Fanged Toad Pirates took Porche as a hostage. She then had to watch as Foxy and Hamburg got beaten up. Luffy then started fighting for Foxy to get his crew back."}, {"type": "paragraph", "text": "Once Luffy took back the ship, Foxy used his Noro Noro Beam to trick and capture Luffy and the rest of his crew except Chopper and Robin. Luffy and the rest of the crew escaped, leaving Porche and the rest of the Foxy Pirates behind."}], "images": []}, {"title": "Spa Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Porche later appeared alongside Foxy and Hamburg at Spa Island. She was seen wearing a bikini and accompanied Foxy and Hamburg as they worked with Doran to steal a notebook from Sayo, which contained a secret in making jewels. When stealing the notebook, they came across the Straw Hat Pirates once again. Porche went with Hamburg and Foxy into their new mecha, which bounced the Noro Noro Beam in different directions and slowed everybody in their surroundings down so that they could steal the notebook, but after they met the Straw Hat Pirates' new crew members, Franky and Brook, their mecha was destroyed and was sent flying off of Spa Island as a result. Later on, Porche was seen worrying in Doran's office as Hamburg was getting the water out of Foxy after getting back onto the island. Later, when Luffy attacked and made everything crumble, a worried Porche slapped Foxy awake. Once the treasure was found to be a circular rainbow in the sky, Porche and the rest chased Doran after he swam off."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Foxy_Pirates_Swimsuits.png/revision/latest/scale-to-width-down/210?cb=20120510200926", "caption": "Foxy along with Porche and Hamburg returning in the Spa Island Arc"}]}, {"title": "Adventure of Nebulandia", "level": 3, "content": [{"type": "paragraph", "text": "The Foxy Pirates continued their adventures into the New World, resuming their Davy Back Fight winning streak, but were always laughed at due to their Jolly Roger. Porche was present when Foxy defeated Komei in a Davy Back Fight, and watched as Komei donned his Foxy Pirates mask and shook hands with Foxy."}, {"type": "paragraph", "text": "Porche took part in a plot to disguise the Foxy Pirates and lure the Straw Hat Pirates to Mushroom Island, which was successful. Luffy accepted Foxy's challenge to a Davy Back Fight rematch, and the first round, the Eating Contest, began. Porche, Hamburg, and Dojaku competed against Luffy, Zoro, and Sanji to see who could eat a pile of mushrooms the fastest. Porche and Hamburg took off eating, and Porche asked Dojaku why he wasn't eating anything, but her crewmate replied that he had a plan. Suddenly, everyone who ate the mushrooms collapsed, only to rise up with no motivation whatsoever. Komei revealed that this was part of his plan to capture the Straw Hats as he and Dojaku turned the arena into a cage, trapping Porche, Hamburg, and the Straw Hats. The cage was then pulled up to the Sexy Foxy, which sailed away under Komei's command."}, {"type": "paragraph", "text": "Porche, Hamburg, Zoro, and Sanji were taken to Nebulandia and thrown into a cell, and Komei plotted to execute the two Foxy Pirates due to them being pirates. The next morning, Foxy arrived and freed Porche and Hamburg, administering an antidote that gave them their motivation back. However, Porche and Hamburg said they needed to get something back before heading out, and their captain and crewmates followed them."}, {"type": "paragraph", "text": "The Foxy Pirates later emerged outside as the Straw Hats beat back the Marines. They then headed back to Mushroom Island, where Foxy ended his cease-fire with Luffy and attacked him. However, Nami tricked him and attacked Foxy, Porche, and Hamburg with a lightning bolt. The Straw Hats then sailed away, and the Foxy Pirates bid them farewell as they prepared to resume their own adventures."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Foxy_Frees_Porche_and_Hamburg.png/revision/latest/scale-to-width-down/210?cb=20151226175808", "caption": "Foxy frees Porche and Hamburg from captivity."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the \"Hit and Dead ball\" matches (anime only), she, along with the other Foxy pirate females, easily takes the ball and outs Sanji by flirting with him. She then steals the ball from Luffy, as his arm stretches to throw the final pitch at Operation Bulls-eye kun, operated by Foxy."}, {"type": "paragraph", "text": "She also rides on Hamburg during the \"Who touched Daruma San\" (anime only). They manage to stay in the lead with Chiqicheetah, until she is thrown off the side of the cliff. Sanji jumps into the water to save her, to which she rewards him by kissing him on the cheek, causing him to lose his concentration and they both begin to sink. She resurfaces and yells at him to keep swimming and angrily asks if he wants her to drown."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She has a habit saying \"Nya\" (the Japanese equivalent of \"Meow\") when reacting to something.", "elements": []}, {"text": "She reappeared in a Chopperman filler episode as the damsel in distress in Zoro's television program.", "elements": []}]}], "images": []}]}