{"sections": [{"title": "Itomimizu", "level": 1, "content": [{"type": "paragraph", "text": "Itomimizu is the Foxy Pirates' game official and serves as the announcer and commentator of the Davy Back Fight events. He rides on a very large bird named Chuchun."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Itomimizu is an average size man with very distinct facial features. He has a round, pink nose, no chin and a broad mouth that makes up most of his face."}, {"type": "paragraph", "text": "He wears a purple shirt, yellow gloves, light-yellow trousers, black boots and a striped tuque covering his face down to his nose. It has holes for the eyes so he can see."}, {"type": "paragraph", "text": "He is seen carrying a bag with a Den Den Mushi that serves as a microphone."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Itomimizu comments on the Davy Back Fight itself rather objectively, though clearly leaning towards his own crew. He praises the Foxy Pirates' foul methods and on the other hand badmouths and annoys the Straw Hat crew, especially Nami during the Donut Race. Despite that, he's not above complimenting the Straw Hats on their abilities, too."}, {"type": "paragraph", "text": "He appears to be very impulsive as he gets very excited when the situation in a match turns around."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the Davy Back Fight Itomimizu takes the role of the commentator, announcing the challenge of every round and explaining the rules. While doing so he's riding the Super Sparrow Chuchun to have a better view on the events."}, {"type": "paragraph", "text": "In the anime he was one of the 497 crew members Luffy won after beating Foxy in the final round, temporarily becoming a member of the Straw Hat Pirates just to be dismissed with the rest of Foxy's men."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Adventure of Nebulandia", "level": 3, "content": [{"type": "paragraph", "text": "When Foxy challenged Luffy to a Davy Back Fight rematch on Mushroom Island, Itomimizu once again provided commentary for the event. When the competitors in the Eating Contest lost their motivation after eating mushrooms, Itomimizu reacted in shock. The Foxy Pirates' new crewmates Komei and Dojaku betrayed the crew and took the competitors prisoner, and Dojaku redirected Foxy's Noro Noro beam, immobilizing Itomimizu and everyone on the beach as the two escaped with their prisoners."}, {"type": "paragraph", "text": "Itomimizu stayed behind with the rest of the Foxy Pirates while Foxy and Kansho joined the Straw Hats in their mission to rescue their comrades. He, Chuchun, and Capote came to help Brook and Chopper look for the Rebound Mushroom. However, they were ambushed by the Marines, and Itomimizu and several other pirates sacrificed themselves to help Brook, Chopper, and Chuchun escape."}, {"type": "paragraph", "text": "However, Itomimizu and the others were freed after Brook and Chopper befriended a snake creature named Kinoconda and defeated the Marines. They then rode in Kinoconda's mouth to Nebulandia, where they freed Foxy and the Straw Hats. Itomimizu helped distract the Marines by attacking them with Sneeze Mushroom gas, gave Foxy the antidotes for Porche and Hamburg, and the Foxy Pirates helped the Straw Hats beat back the Marines. The two crews later returned to Mushroom Island, where they parted ways. Foxy then spoke to his crew, encouraging them to continue their adventure."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name means tubifex worm, leading to many fans referring to him simply as \"Tubifex\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑ Credits of Episode 209 from Season 4, First Voyage", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 26), His birthday is revealed.", "elements": []}]}], "images": []}]}