{"sections": [{"title": "Pickles", "level": 1, "content": [{"type": "paragraph", "text": "Pickles, also known as the \"Tackle Machine\", is a member of the Groggy Monsters of the Foxy Pirates."}, {"type": "paragraph", "text": "Due to his actions, he is a major antagonist during the Long Ring Long Land Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pickles is a large husky man that typically wears green schemed clothes. He has relatively long arms and relatively short legs in comparison to his body. He also has a hippo-like face. On his shoulders, he typically wears round shoulder pauldrons. In size, Pickles is larger than Hamburg and smaller than Big Pan."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pickles has a lustful attitude toward strong opponents, getting excited when Foxy selects him and his team, the Groggy Monsters, to compete in the Groggy Ring. He is also very impatient, yelling at his opponents for taking to long to pick their ball-man. While he finds arguing annoying, he is amused when his opponents are unable to work well together. He is quite cocky in his and his team's abilities, and he quickly becomes nervous when a strong opponent catches him off guard. Pickles lacks respect for his opponents, as he is willing to cheat against them to win (a standard behavior for the Foxy Pirates). He never openly acknowledges his own cheating and rather celebrates his own victories despite his use of foul play. He seems to enjoy hurting his opponents, smirking and laughing when he and his team viciously assaulted Sanji and Zoro during their match. When Pickles revealed his swords against Zoro and Sanji, he mockingly laughed and sang about slicing them up, demonstrating his devious nature."}, {"type": "paragraph", "text": "Like the rest of the Groggy Monsters, Pickles is a bit dumb and tends to laugh regularly with little reason. He, however, seems to be the smartest and strongest of the three, as he was defeated last by Zoro and Sanji."}, {"type": "paragraph", "text": "When his crew was defeated in a Davy Back Fight by the Straw Hat Pirates, Pickles was mature and respectful of their victory. He seemed prepared for a new challenge when the Straw Hat Pirates were deciding who to pick for their crew, and he was shocked and appalled like the rest of his crew by their decision to take their Jolly Roger and replace it with Luffy's drawing."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Groggy Monsters", "level": 3, "content": [{"type": "paragraph", "text": "Pickles coordinates closely with Hamburg and Big Pan, but they also share a strong friendship. Pickles has a lot of confidence in his teammates abilities, but Big Pan, who is hard of hearing, often misses his compliments. The three fall into laughing fits together because Hamburg finds things funnier than the average person. The teamwork Pickles has with his teammates is impeccable, as the three act in perfect coordination. When people hurt his teammates, Pickles becomes very aggressive and vengeful."}, {"type": "paragraph", "text": "Pickles has a lot of respect for Hamburg, who is the leader of their team. Pickles cares deeply for him, as he was very worried about him when his weapons were destroyed by Sanji and went into a complete panic when Big Pan accidentally crushed Hamburg in his steel buns."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b6/Pickles_Shocked_by_Hamburg%27s_Defeat.png/revision/latest/scale-to-width-down/180?cb=20170620191643", "caption": "Pickles becomes very concerned about his friend and team leader, Hamburg."}]}, {"title": "Foxy", "level": 3, "content": [{"type": "paragraph", "text": "Pickles, like the rest of his team, follows Foxy's orders closely and has high respect for him as their captain. He would even go as far to blatantly cheat and threaten his opponents to follow his command. However, Pickles was one of the few major crew members who seemed comfortable with the proposition of being selected for the Straw Hat Pirates' crew, showing that he may not have much allegiance outside of his position as Foxy's crew member."}], "images": []}, {"title": "Zoro and Sanji", "level": 3, "content": [{"type": "paragraph", "text": "Pickles was initially excited to face Zoro and Sanji, as Foxy selecting them meant he would be facing strong opponents. However, he quickly became frustrated with the pirates bickering, as seen when Zoro and Sanji argued over who would be the ball-man. He also found their inability to work together very funny. Despite the fact that Pickles was excited to face strong opponents, he initially underestimated the Straw Hats, as he let his guard down around Zoro when he thought his team's incomplete maneuver would be successful (and cost his team a point because of it). He was shocked by Zoro's strength, as the pirate was able to hurl him across the field with ease. To gain ground against them, Pickles resorted to using illegal weapons in-game, demonstrating a great lack of respect. This was also seen in the way he brutally beat and taunted his opponents before Sanji was spiked into the ring. By the end of their match, Pickles was aware and scared of their strength, but he was still willing to challenge them after his teammates were defeated."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Pickles' specialty is tackling and spinning. He is capable of tackling down opponents as well as spinning at great speeds. While he is a formidable opponent by himself, he is made more formidable when teamed up with his teammates, Hamburg and Big Pan. Together they are capable of performing team combinations that often overwhelm their opponents."}, {"type": "paragraph", "text": "In the special, Adventure of Nebulandia, Pickles fights with his fists. However, his use of this combat style is non-canon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/41/The_Groggy_Monsters%27_Weapons.png/revision/latest/scale-to-width-down/210?cb=20121214062859", "caption": "The Groggy Monsters with their weapons make the Monster Burger."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He normally participates in a Groggy Ring match without weapons. However, should the chance present itself, he will use illegal equipment as long the referee \"does not\" look at the field. His hidden equipment includes spiked pauldrons and swords. The spiked pauldrons make his tackles more deadly while his swords are deadly utensils when he spins around with them. The latter weapons are used in conjunction with his teammates' own concealed weapons for a devastating combo, Monster Burger."}], "images": []}, {"title": "Techniques", "level": 3, "content": [{"type": "paragraph", "text": "The attacks he uses in the Groggy Ring are as follows:"}, {"type": "list", "elements": [{"text": "Sling Tackle (投石器 (スリング) タックル, Suringu Takkuru): Pickles charges straight at the enemy and tackles him with his shoulder.", "elements": []}, {"text": "Osōji Tackle (お掃除タックル, Osōji Takkuru, literally meaning \"Sweeping Tackle\"): From the side, Pickles tackles the opposing player. This is called Wipeout Tackle in the Viz Manga and Sweeping Tackle in the FUNimation dub.", "elements": []}, {"text": "Spinning Tackle (スピニングタックル, Supiningu Takkuru): Pickles spins and either charges at the enemy, or bounces a mid-air ball-man back into the air after Hamburg's Gorilla Throw. This also prepares Hamburg for a chance to throw the ballman in the ring.", "elements": []}, {"text": "Ningen Taiho (人間大砲, Ningen Taihō, literally meaning \"Human Cannon\"): Pickles jumps into Big Pan's mouth and then is spat out at high velocity. In the Viz Manga, this is called Human Cannonball.", "elements": []}, {"text": "Size Attack S-M-L (サイズアタック S-M-L, Saizu Atakku S-M-L): A combo attack done with Hamburg and Big Pan. First, Hamburg punches the opponent in midair with his iron gauntlets, knocking them towards Pickles. Pickles then rams the target straight up into the air with his spiked shoulder pads. Finally, Big Pan slaps the unlucky target into the ground with his palm. In the Viz Manga, this is called Size Attack! Small!! Medium!! Large!!.", "elements": []}, {"text": "Monster Burger (モンスターバーガー, Monsutā Bāgā): A combo attack done with the other Groggy Monsters (Hamburg and Big Pan). While the biased referee makes sure not to watch, they bring out a bunch of normally illegal weapons to use in the Groggy Ring. Pickles uses two swords, Hamburg uses two clubs, and Big Pan uses two giant metal pans that he claps together to try to crush his enemies.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Davy Back Fight Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Straw Hat Pirates were defeated in the first game of the Davy Back Fight, Pickles, Hamburg, and Big Pan were selected to face Zoro and Sanji in the Groggy Ring. Seeing that Foxy doesn't often select them, Pickles observed that Zoro and Sanji had to be quite strong opponents. The Groggy Monsters chose to play \"ball\" (or defense) first, but Pickles got frustrated with his opponents when they argued over who would be their ball-man. Once his opponents decided, Pickles encouraged Big Pan, but, after the latter failed to hear him, the team falls into a laughing fit."}, {"type": "paragraph", "text": "As the game began, Pickles lunged straight at Sanji, but the cook jumped over him and used him as a stepping stool to reach Big Pan. When Sanji failed to hurt Big Pan because of the Wotan's slippery skin, Pickles laughed at his opponents and tackled Zoro, leaving Hamburg with an opening to grab the chef midair. He passed Sanji to Pickles, who broke through Zoro's defense with a Spinning Tackle. While still spinning, Pickles knocked Sanji up into the air for Hamburg to catch again. Pickles chuckled as his teammate closed in on victory, but his leg was grabbed by Zoro, causing him to panic. He was spun around by the swordsman and thrown into Hamburg, who Sanji escaped from, and the two were knocked out and out of bounds when they slammed into each other."}, {"type": "paragraph", "text": "While Big Pan chased around Zoro and Sanji, Pickles and Hamburg put on armored weapons, breaking the game's rules. They returned to the game, and Pickles launched Hamburg into the air with his Spinning Tackle for him to spike Zoro into the ground. Hamburg, who braced the weapons on his elbows, was then spiked by Big Pan into Zoro, severely damaging him. Immediately continuing the assault, Pickles jumped into Big Pan's mouth and was launched into Sanji. He then knocked his opponent back and forth with his teammates before Big Pan spiked Sanji into the ring and scored a point. As Pickles and his team celebrate their point, he is oblivious to Zoro and Sanji's decision to begin working together."}, {"type": "paragraph", "text": "Before Pickles and the Groggy Monsters are declared the victors, Zoro and Sanji rise from the ground and stand to challenge them. Pickles' captain, Foxy, commands them to use their \"Monster Burger\" technique, prompting Pickles and his teammates to reveal their weapons. The Groggy Monsters lined up and marched toward their opponents, with Pickles spinning and slashing out his swords. They increased their speed until they were sprinting toward the Straw Hats, but, right as Hamburg was about to hit Sanji, the chef kicked straight through his metal bat. Pickles shouted to his leader to be careful, but Hamburg was unable to defend himself from being kicked into their air. Pickles frantically begged Big Pan to stop crashing his buns together, but he failed to hear Pickles and crushed their team leader. Terrified by his leader's defeat, Pickles charged Sanji but was intervened by Zoro. Pickles, still spinning and slashing, was picked up by Zoro and thrown into the air. He flew through the air and accidentally slashed up Big Pan's chest because of his leftover spinning momentum. As Zoro ran toward Big Pan, who passed out but was still standing, Pickles moved to intercept him. Before Pickles could confront to swordsman, Sanji kicked him into the referee on the sideline. With Pickles and Hamburg unconscious, Sanji and Zoro slammed Big Pan into the ring and won the match."}, {"type": "paragraph", "text": "After the Straw Hat Pirates won the Davy Back Fight, Pickles was shown alongside the rest of his crew when their opponents decided who to take. He and his crew were shocked when Luffy picked to take their Jolly Roger. The Foxy Pirates were appalled by the replacement Jolly Roger that Luffy painted for them, but Pickles celebrated the end of the games with the rest of his crew nonetheless. They sailed off as Foxy vowed to get revenge of Luffy and his crew."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Zoro_Throws_Pickles.png/revision/latest/scale-to-width-down/210?cb=20170620191647", "caption": "Zoro throws Pickles during the Groggy Ring match."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5f/Pickles_Accidentally_Slashes_Big_Pan.png/revision/latest/scale-to-width-down/210?cb=20170620191642", "caption": "Pickles accidentally slashes Big Pan, causing him to pass out."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ab/Sanji_Defeats_Pickles.png/revision/latest/scale-to-width-down/180?cb=20170620191827", "caption": "Sanji defeats Pickles before winning the Groggy Ring."}]}, {"title": "Adventure in Nebulandia", "level": 3, "content": [{"type": "paragraph", "text": "When the Straw Hat Pirates arrived on Kinoko Island, Pickles stood alongside his crew while Foxy set up another Davy Back Fight with Luffy. He watched as his crewmates, Hamburg and Porche, as well as Zoro and Sanji, were captured by Komei and Dojaku during the first game. Pickles saw his captain and the Straw Hat Pirates off when the left to follow, and he vowed to help Chopper and Brook find the Rebound Mushroom for their captured friends."}, {"type": "paragraph", "text": "After defeating the Marines on Kinoko Island, Pickles, Brook, Chopper, and the other major members of the Foxy Pirates traveled under the sea in Kinoconda's mouth to Nebulandia. Alongside Capote and Big Pan, Pickles attacked the Marine soldiers. While Foxy, Itomimizu, and Capote went inside the Marine base to rescue Hamburg and Porche, Pickles and Big Pan were left to defeat the rest of Komei's underlings. The group reconvened as Luffy fought Komei, and they boarded the Thousand Sunny while Luffy defeated the Marine tactician."}, {"type": "paragraph", "text": "Having returned to Kinoko Island, Pickles and his crew mates stood to admire the newly-improved Sexy Foxy. He and his crew saw the Straw Hat Pirates off, and they celebrated their new adventures to come."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Groggy Monster (Pickles, Hamburg, and Big Pan vs. Roronoa Zoro and Sanji (in a Groggy Ring match)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Pickles and Big Pan vs. Marines", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Pickles' role in the Davy Back Fight changes slightly due to the fact that the arc is greatly extended. When the Foxy Pirates challenged the Straw Hat Pirates to a second Davy Back Fight, Pickles participated in the second of the three new events, Dodge Touch Mr. Daruma. Pickles competed alongside Hamburg, Big Pan, Porche, Chiqicheetah, and Capote, hoping to get revenge for being defeated in the first Davy Back Fight. When Tonjit called the first green light, Pickles followed behind Hamburg and Chiqicheetah, who took the lead. To intercept Zoro and Sanji, Pickles threw a giant rock into the air for Big Pan to spike onto them. Right before Tonjit called the first red light, Zoro and Sanji sliced and kicked the giant rock back at them. Because they were unable to move according to the rules, they were hit with the halves and knocked off course, causing them to be eliminated."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Like the other Groggy Monsters who are named after culinary names, Pickles is named after the pickles, which is a common topping for hamburgers.", "elements": []}, {"text": "Pickles appears in the video game One Piece Grand Battle Rush! where he will randomly be thrown by Big Pan into the arena on the Sexy Foxy stage and use his spin attacks on any character close to him until he falls off the stage.", "elements": []}, {"text": "Pickles makes a sort of cameo appearance in the U.S only game Grand Adventure and while not removed like Big Pan, he was altered to not have any of his Foxy Pirates gear on and performs the same challenge as he did in Grand Battle Rush!.", "elements": []}]}], "images": []}]}