{"sections": [{"title": "Roshio", "level": 1, "content": [{"type": "paragraph", "text": "\"Executioner\" Roshio was a pirate captain who had a bounty of 42,000,000. He was killed by Bellamy at the beginning of the Jaya Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Roshio was a tall and muscular man with long white dreadlocks and a wide face. His left arm was also intricately tattooed with skulls and a red pattern."}, {"type": "paragraph", "text": "He wore an indigo a-shirt with black pants and a headband with his jolly roger (a hung man on a red background) on it in a repeating pattern."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Roshio_Anime_Concept_Art.png/revision/latest/scale-to-width-down/120?cb=20190624083148", "caption": "Roshio's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Roshio was described as a crazy man by the citizens of Mock Town. He murdered a person on the spot when that person won against him in a game of cards. Ironically enough, Roshio himself got brutally attacked by Bellamy when he won against him in another game of cards. Roshio shouted angrily when he was accused of cheating."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Roshio was prominent enough to be given a bounty of 42,000,000. However, he was defeated quite easily by Bellamy."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in his life, Roshio became a pirate captain and was issued a bounty of 42,000,000."}, {"type": "paragraph", "text": "While he was staying at Mock Town, Roshio was beaten in a card game by someone, which led him to murder the winner."}], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "Roshio was seen playing cards with Bellamy the Hyena. While he won fairly, Bellamy challenged him otherwise and stabbed Roshio in the hand. As Roshio continued to deny the accusation while writhing in pain, Bellamy questioned his crewmate Sarquiss on the matter. Sarquiss also claimed to have seen him cheat, which greatly angered Roshio. Before he could do anything, however, Bellamy shot him a couple of times and smashed a bottle of alcohol on his head. Giving him no time to react, Sarquiss quickly threw a lit match at Roshio, causing the alcohol to light on fire and knocking him out of the top floor of the building they were in."}, {"type": "paragraph", "text": "When the Roshio Pirates attempted to pick their critically wounded captain off the streets for medical treatment, Bellamy then leaped down to finish him off with his Spring Hopper technique."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The scene wherein Bellamy accuses Roshio of cheating is different in the anime:"}, {"type": "paragraph", "text": "Originally in the manga, when Roshio attempts to take his winnings, Bellamy pins down Roshio's hand to the table with a knife. After asking Sarquiss if he saw Roshio cheating, Bellamy then shoots Roshio in the leg and hits him with a bottle filled with alcohol. With Roshio covered in alcohol, Sarquiss throws a lit match on him and sets him ablaze. The ignition throws Roshio out the window. In the anime, the scene is toned down due to its violent nature. When Roshio attempts to take his winnings, Bellamy grabs Roshio's arm and crushes it as Roshio denies that he cheated. Later after asking Sarquiss if he saw Roshio cheating, Bellamy shoots Roshio several times and kicks him out the window, presumably using his Devil Fruit ability. Afterwards, Roshio's crew was shown down in the streets trying to carry him away to get some much-needed medical attention, before Bellamy jumped down and finished him off."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the FUNimation dubbed TV version of the anime, Roshio is simply kicked out the window, with the gunshots being edited out to tone down the violence even further."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 222 (p. 14) and Episode 146, Roshio makes his debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  Eternal Log, Roshio's wanted poster is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 83), Roshio's death is confirmed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 222 (p. 13) and Episode 146, Roshio's brutality is commented on by a citizen of Mock Town.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 222 (p. 14-18) and Episode 146, Bellamy accuses Roshio of cheating and attacks him.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 224 (p. 2) and Episode 146, the destruction caused by Bellamy defeating Roshio is seen.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 232 (p. 17) and Episode 151, an onlooker states that Spring Hopper was used to finish off Roshio.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 24 Chapter 222 (p. 15-18), Roshio is sent flying out the window after being stabbed, kneecapped, smashed, and burned.", "elements": []}, {"text": "↑  One Piece Anime — Episode 146, Roshio is sent flying out the window after getting seized.", "elements": []}]}], "images": []}]}