{"sections": [{"title": "Mont Blanc Cricket", "level": 1, "content": [{"type": "paragraph", "text": "Mont Blanc Cricket is an inhabitant of Jaya, living in a small home behind the facade of a castle. He is the distant descendant of Mont Blanc Noland and the \"Last Boss\" (, Rasuto Bosu) of the Saruyama Alliance."}, {"type": "paragraph", "text": "He is an ally of the Straw Hat Pirates during the Jaya Arc, and along with the Saruyama Alliance aided them in getting to Skypiea."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cricket is a muscular, middle aged man with blond hair. He has a large chestnut on his head which he inherited from his ancestor, Noland. He wears dark-purple tracksuit-pants with a white stripe running along each leg, and a rope around his waist. He does not generally wear a shirt, nor shoes, due to his continuous diving explorations. He is usually seen smoking with a cigarette in his mouth. On his left arm, Cricket has a tattoo of a chestnut with the word \"Maroon\" written across it."}, {"type": "paragraph", "text": "Twenty four years ago, his appearance was the same as it was during the Jaya Arc, except he had a short beard on his chin."}, {"type": "paragraph", "text": "After the timeskip he now wears a dress shirt leaving it partly open, showing off his chest. He also wears a captain's coat hanging from his shoulders. He has also grown a  new, larger beard along his jaw line connected to his sideburns."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Cricket is a very determined and somewhat stubborn man. He can be cheerful at some times, however not to the extent of his ancestor. He believes that people should pursue their dreams even when others laugh at it, which he considers romantic and laughs when Luffy told him he want to go to a Sky Island and believes it to exist, while he himself did not know if it existed or not. Cricket also shows compassion to the Saruyama Alliance, viewing the two captains as his surrogate sons and jumping to their defense against Bellamy."}, {"type": "paragraph", "text": "Cricket was carrying a burden about his ancestor Noland, as he was labeled as a liar and was ridiculed by many because of his relation to Noland which resulted him in setting sail as a pirate."}, {"type": "paragraph", "text": "When he came across Jaya by chance, the island that Noland supposedly found the city of gold and the island that so many of Cricket's family members failed in finding, he decided to search for it believing it was fate and stated he is not doing it to clear Noland's name but just fulfilling what he believe is his destiny."}, {"type": "paragraph", "text": "Eventually, once he discovered that what his ancestor stated about the city of gold existing was true and the story about him was false, he eventually moved on to a new dream."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the leader of the Saruyama Alliance, Cricket commands two large pirate crews through his proteges, Masira and Shoujou."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Cricket is a skilled diver, being able to dive at great depths. This skill was apparently inherited from his ancestor, Noland, who also dove to great depths. However because of his constant diving without rest, the activity had taken a toll on his body. Cricket is also a skilled martial artist, being able to outclass Sarquiss in a one-on-one fight and able to keep up in his fight against Sanji before succumbing to decompression sickness. In combat he takes an unusual fighting stance and attacks mainly with kicks. He also has great stamina, completing a manual labor right after his ambush by the Bellamy Pirates. These abilities could be attributed to his long career as a pirate, as he is apparently a young veteran from Roger's times."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Since he was a kid, Cricket was always laughed at by everyone due to the shame brought by the story of his ancestor, Noland. Ashamed of his family, Cricket ran away from home and became the captain of a crew of pirates. He did not necessarily want to become a pirate then, he just wanted to escape the curse of carrying the Mont Blanc family name."}, {"type": "paragraph", "text": "However, ten years before his introduction, Cricket and his crew accidentally came across Jaya, the island that Noland supposedly found the city of gold and the island that so many of Cricket's family members failed in finding. Standing upon the cape where the city of gold was supposed to be, Cricket decided to accept his fate and find out once and for all if there was the legendary city that Noland found. His crew however, did not agree with his decision and left him alone on the island. Left all alone, Cricket decided to live in a house near the cape and began diving all alone into the waters surrounding Jaya back and forth in his search for the city of gold."}, {"type": "paragraph", "text": "He did not care if it existed or not, or to even proved Noland's innocence. He just decided then to continue doing so with the ambition that before he died, he would settle the matter once and for all."}, {"type": "paragraph", "text": "Five or six years ago before the beginning of the storyline, two fans of the King of Liars, Noland fairy tale then suddenly came to Jaya and proclaimed themselves Cricket's followers without his permission. These two fans, Masira and Shoujou, believed truly that the city of gold existed. Though they were loud and very much bothersome, Cricket allowed them to help him in his search and accepted them as his surrogate sons."}, {"type": "paragraph", "text": "To Cricket, their barging into his life out of the blue saved his life as the constant loneliness he felt before they came was unbearable. With this, Cricket became the leader of the Saruyama Alliance. Together with the two brothers and their pirate crews, Cricket had been searching all around Jaya for the lost city. They had since then found all sorts of clues such as golden bells and trinkets, remnants of the city."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Cricket_Alone.PNG/revision/latest/scale-to-width-down/240?cb=20071107041408", "caption": "Cricket is left on Jaya by his crew."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Cricket_memory.PNG/revision/latest/scale-to-width-down/250?cb=20130117173110", "caption": "Cricket, Masira, and Shoujou celebrate finding some gold, proving the existence of the golden city."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "While going out on one of his regular diving trips, Cricket came across Luffy as he came up for air. Thinking he and the people with him were people trying to steal the gold he had found so far, Cricket pulled Luffy into the water. Cricket then pulled himself out and decided to defend his gold. Cricket was soon fighting with Sanji. In the midst of the battle, Cricket pulled out a gun and began firing at Sanji. However before the fight could escalate, Cricket succumbed to decompression sickness and collapsed. He was then carried by the Straw Hats into his home and was taken care of by Chopper."}, {"type": "paragraph", "text": "After recovering, he thanked the Straw Hats for helping him and apologized for earlier. Cricket was then told that the Straw Hats had come to him in order to find a way up to Sky Island. Cricket merely laughed at the mention of the idea since he himself did not know if it existed or not. Cricket however explained that Noland, his ancestor, might know something of it. The moment the Straw Hats learned that he and Noland were related, Cricket explained his family's shame and his past. He then later explained to the Straw Hats the relationship he had with Masira and Shoujou. Luffy however, after listening to all this, asked Cricket again how to get to Sky Island. Seeing the determination in Luffy, Cricket took out Noland's log book and showed it to the Straw Hats. Within the log book, Cricket told them that evidences of a island in the sky were written there. Upon seeing the Straw Hats' excited expressions upon finding these pieces of information about Sky Island's existence, Cricket went out of his house and asked Masira and Shoujou if they should help the Straw Hats get to Sky Island. For this, they agreed."}, {"type": "paragraph", "text": "Cricket then began explaining to the Straw Hats where they could find Sky Island. There was a cloud, he explained, that was so dense that it caused sunlight to be blocked from reaching the area below. Cricket wasn't exactly sure but he believed that's where Sky Island would most likely be. Cricket then continued to explain how to get to the cloud. He explained that the Straw Hats needed to use the Knock Up Stream to get there. He however warned the Straw Hats that this journey to the cloud had to be precise and fast as the Knock-Up Stream was very dangerous and would only last for one minute. Fortunately, Cricket stated he knew when and where these two phenomenon would met up exactly. He also stated that Masira, Shoujou, and him would also help reinforce and strengthen the Going Merry for the trip. Everything seem well and good then, however, Usopp suspected that it was all too perfect. Usopp accused Cricket that he was lying and that he was actually planning something sinister for him and his compatriots. Cricket merely replied that he was just happy to have met people like the Straw Hats and just wanted to help. He then invited all the Straw Hats to his home for a party. Usopp, feeling down for his behavior, apologized to Cricket. Cricket however, was a bit disgusted by Usopp as he was rubbing his running nose on Cricket's pants while apologizing on his knees."}, {"type": "paragraph", "text": "During the party, Cricket noticed Nico Robin was reading the last page of Noland's log book. He quoted a passage from it and explained that everything after that was a blank. With this he explained to everyone why they must continue searching for the answer for such mysteries. After partying some more with everyone, Cricket continued to quote things from Noland's log book. He then showed the Straw Hats pieces of the gold he and the rest of the Saruyama Alliance had found over the years at the bottom of the ocean. Cricket then showed the Straw Hats a small golden statue of a South Bird holding a bell. As Cricket and his two protégés were explaining about the bird, they suddenly realized something then. Cricket explained to the Straw Hats that they needed to catch a South Bird found in the forest south of Cricket's house. He explained that they needed it to tell them which way is south so they could find the location where they could use the Knock-Up Stream to get to Sky Island."}, {"type": "paragraph", "text": "Since they were in the Grand Line, the Straw Hats would not know where to go south since normal compasses would not work. Also since the place that they were headed to was a location in the sea and not an island, the Log Pose would not help either. The only way they could go there is if they followed the South Bird's direction. With this Cricket gave the Straw Hats some nets to catch the bird. As the Straw Hats rushed off to the forest, Cricket said that he, Masira, and Shoujou would enhance the Going Merry in the meantime as they awaited for the Straw Hats' return."}, {"type": "paragraph", "text": "As Cricket and his two proteges were waiting for the Straw Hats' return, Bellamy the Hyena however arrives along with his entire crew ready to steal all of Cricket's hard earned artifacts. Cricket and his two proteges were able to put up a good fight against Bellamy and his crew. That was however until Bellamy started using his Devil Fruit, the Bane Bane no Mi against them. Beaten badly, Cricket tried to stop Bellamy from taking the gold. In the chaos that followed afterwards, both Masira and Shoujou were heavily injured while protecting Cricket. Seeing them wounded deeply saddened Cricket. As Bellamy took off with Cricket's gold, he mockingly told Cricket to stop dreaming of things like Noland's City of Gold as it was unfitting for a pirate in this day and age. Cricket however responded, that a person like Bellamy shouldn't be lecturing Cricket on how to be a pirate. For this remark, Bellamy beats him up."}, {"type": "paragraph", "text": "Cricket and his two proteges are then later found by the Straw Hats badly injured. Not caring for what has happened to him, Cricket apologized to Luffy for not being able to do much to enhance the Going Merry. He however stated with the rest of the Saruyama Alliance, he could fix it up before the schedule. Luffy on the other hand, did not cared about such things at the moment and decided to get Cricket's gold back. Cricket tried telling Luffy to stop and not mind Cricket's own problems, however, he was stopped and told by Zoro if he wanted to stop Luffy, he would need to use force."}, {"type": "paragraph", "text": "Unable to do anything else, Cricket allowed Luffy to reclaim his gold. After recovering from his wounds and enhancing the Going Merry the best he could, Cricket saw Luffy coming back from Mock Town with his gold. After Luffy saw the improvements on the Going Merry, he gave Cricket back his gold and thanked Cricket for the improvements."}, {"type": "paragraph", "text": "With his gold returned, Cricket told the Saruyama Alliance to not mess up with the Straw Hats' trip to Sky Island. and gave the Straw Hats a little encouragement. He stated that while the Golden City and Sky Island maybe dreams, there has yet to be anyone who could prove that they do not exist. With this, Cricket said his goodbyes with the Straw Hats and thanked them for getting his gold back."}, {"type": "paragraph", "text": "Later, as the Straw Hats rode up on the Knock-Up Stream, Cricket witnessed the event from his house."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/Cricket_Showing_his_Gold.png/revision/latest/scale-to-width-down/230?cb=20130201215540", "caption": "Cricket shows the Straw Hats a golden statue of a South Bird."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/79/Cricket_After_Fighting_Bellamy.PNG/revision/latest/scale-to-width-down/250?cb=20130117173949", "caption": "The aftermath of Bellamy's attack on Cricket and his two proteges."}]}, {"title": "Skypiea Arc", "level": 4, "content": [{"type": "paragraph", "text": "While doing business as usual, Cricket and the rest of the Saruyama Alliance hear the sound of the Golden Bell of Shandora ringing. This beautiful sound, which was accompanied with a large shadow of Luffy casted on the clouds, was proof that the city of gold that Noland found was true and that it was in the sky all along. With this proof, Cricket burst into tears of happiness at finally knowing the truth and at the knowledge that the Straw Hats were still alive after using the Knock-Up Stream to get to Sky Island. With this, the entire Saruyama Alliance rejoiced."}, {"type": "paragraph", "text": "With proof that the golden city was all along in the sky, Cricket decided to stop searching in the sea and move on. However before leaving, he invited the Saruyama Alliance to follow him onto a new dream. This they accepted wholeheartedly. Together, Cricket and the Saruyama Alliance ventured forth for a new dream to pursue."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Saruyama_Alliance_Sees_Luffy%27s_Shadow.png/revision/latest/scale-to-width-down/230?cb=20130203213134", "caption": "The sight Cricket and the Saruyama Alliance see as they hear the ringing of the Golden Bell."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Cricket, along with the Saruyama Alliance, was seen searching for Nakrowa, the Island of Dreams."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f0/The_Saruyama_Alliance_Reads_About_the_Straw_Hats%27_Return.png/revision/latest/scale-to-width-down/250?cb=20170319012832", "caption": "Cricket with the Saruyama Alliance."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mont Blanc Cricket vs. Sanji", "elements": []}, {"text": "Saruyama Alliance vs. Bellamy Pirates", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the video game One Piece: Pirates Carnival (dubbed by 4Kids), Noland and Cricket's family name is \"Mombran\". However, in the edited FUNimation dub, Noland and Cricket's family name is \"Monbran\". While this romanization of the family name is taken directly from how it is pronounced, this is not necessarily the correct romanization of it as the Japanese characters used for the family name (モンブラン) are the same characters used for the word Mont Blanc in Japanese. It is written as \"Mont Blanc\" in the Viz Manga and \"Montblanc\" in the uncut FUNimation dub."}, {"type": "paragraph", "text": "In the edited FUNimation dub, Cricket's cigarette is removed, but was accidentally left in one scene. "}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Though he owes much of the credit for finding out the truth on his ancestor Noland to Wyper, Calgara's descendant, the two never meet with each other. Also while Wyper is aware of his existence, Cricket does not even know his ancestor's old friend even has a descendant even though it was hearing about Cricket's struggles against his family curse that had led the Shandia's actions in the finals moments of the fight against Enel.", "elements": []}, {"text": "The name Mont Blanc means 'white mountain' in French and in Catalan, and is the highest mountain in the Alps. It may also refer to a French dessert made with chestnuts, which both Cricket and his ancestor have on their heads.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Underwater diving – Wikipedia article about underwater diving in general.", "elements": []}, {"text": "Decompression sickness – Wikipedia article about the diving hazard Cricket suffered from.", "elements": []}]}], "images": []}]}