{"sections": [{"title": "Masira", "level": 1, "content": [{"type": "paragraph", "text": "\"Salvage King\" Masira is the head of a simian salvage operation near Jaya Island. His sworn brother is Shoujou and both of them are members of the Saruyama Alliance."}, {"type": "paragraph", "text": "He became an ally of the Straw Hat Pirates during the Jaya Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Masira is a human with ape-like features, he wears an orange-yellow jumpsuit, and also has headphones and goggles. What makes him interesting is he apparently has a tail, although sometimes it cannot be seen. An example of when it clearly can be seen is when Bellamy first tackles him from behind, during the Bellamy Pirates vs. Saruyama Alliance fight, or when he is carrying wood to fix the Going Merry. Masira also has huge arms and some kind of piercing around his wrists."}, {"type": "paragraph", "text": "After the timeskip he no longer wears the jumpsuit, but has a shirt with the same design on the front. Other than this he looks the same as before."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Masira often acts very serious and yet is very silly in reality. He is easily angered notably most of all by the idea of someone stealing his salvage operations, yet at the same time is easily flattered if someone calls him a monkey. He is easily won over with friendship along with his brother when the Straw Hats appear at their home on Jaya Island."}, {"type": "paragraph", "text": "Like his brother, he is protective of Cricket who they have come to know as a father figure. He and his fellow Alliance members displayed a amazing spirit to get back up and continue their modifications to the Going Merry after Bellamy's attacks. On their last encounter with the Straw Hats, all sides left on good terms."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Masira is immensely strong, and has amazing lung capacity as he was able to blow up a giant balloon in nearly a single breath. He is also an excellent diver."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Saru Naguri (猿殴り, Saru Naguri, \"Monkey Punch\"): Masira winds up and delivers a punch powerful enough to fend off a giant eel.", "elements": []}, {"text": "Saru Lunge (猿ランジ, Saru Lunge, \"Monkey Lunge\"): An anime only attack, both he and Shoujo launch a strong punch against their opponents. This was first used against the Bellamy Pirates. In the Funimation dub it is called Monkey Punch.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He and his brother showed up to help Mont Blanc Cricket find the lost City of Gold some five or six years ago after reading the tale of Noland in Liar Noland."}], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "Masira first appears during the Jaya Arc, after a huge ship fell from the sky and into the ocean, and it is here where he first meets the Straw Hats. However, a sea monster and \"giants\" appearing in the ocean interrupt them. Somehow as the Straw Hats attempt to escape he winds up on the Going Merry and is quickly kicked off."}, {"type": "paragraph", "text": "After the Straw Hats meet Cricket, Masira and Shoujou (whom they run into a while later) act a bit more friendly towards them and help modify the Going Merry so it can travel to Skypiea."}, {"type": "paragraph", "text": "When Luffy successfully rang the Shandorian Golden Belfry Bell, it brought the Alliances' dream to fruition, and proved that Skypiea does exist. Masira and Shoujou then decide to follow Cricket to pursue their next dream."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, the Saruyama Alliance is seen on an adventure, in search of the island of dreams Nakrowa."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f0/The_Saruyama_Alliance_Reads_About_the_Straw_Hats%27_Return.png/revision/latest/scale-to-width-down/265?cb=20170319012832", "caption": "Masira and the rest of the Saruyama Alliance reading about the Straw Hats' return."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Masira, Shoujou and Mont Blanc Cricket vs. Bellamy and Sarquiss", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He is featured alongside Tony Tony Chopper in the One Piece Monkey Island Mascot Cellphone strap series."}], "images": []}, {"title": "Songs", "level": 3, "content": [{"type": "list", "elements": [{"text": "Saru Agari Salvage", "elements": []}]}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Grand Battle 3", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Translation Issues", "level": 2, "content": [{"type": "paragraph", "text": "His name is another way of saying monkey in Japanese."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "It is unknown if his tail is real or fake.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 219 and Episode 144.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 173), His birthday is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0235), Information about Masira is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 24 Chapter 219 (p. 15), Masira's name is romanized on his suit.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 221 and Episode 148, Mashira is angry the Straw Hats are trying to steal his treasures.", "elements": []}, {"text": "↑  One Piece Anime — Episode 150.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 221 and Episode 145, The sea monsters.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 65 Chapter 643, cover story: From the Decks of the World Vol. 26.", "elements": []}]}], "images": []}]}