{"sections": [{"title": "Mansherry", "level": 1, "content": [{"type": "paragraph", "text": "Mansherry is a dwarf and the princess of the Tontatta Kingdom. She is the daughter of Gancho, the king of the Tontatta Kingdom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mansherry has very thick and wavy blonde hair, partially tied up in two buns, that covers her body and tail. She wears a short white dress with stockings and shoes of the same color. Her eyes are light blue."}, {"type": "paragraph", "text": "In her first appearance, she was shown wearing two small, green flowers in her hair. Giolla and Tsuru, among others, seem to consider her very cute."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Leo claimed that she is selfish, mean, capricious, and short-tempered. However, this is merely a misinterpretation on Leo's part. Mansherry is truthfully benevolent and kindhearted, as shown when she realized she had been tricked by Doflamingo and refused to heal the injured officers of his crew, knowing they would just keep hurting people and exploiting the dwarves of her kingdom. This trait was fully confirmed by Kabu, who stated that Mansherry is really kind to everyone."}, {"type": "paragraph", "text": "The reason for Leo's misinterpretation is that Mansherry has a huge crush on him, as seen when she reacted happily when he saved her, calling him a knight in shining armor and even blushing when he caught her. However, this did not stop her from punching Leo after he bluntly remarked that she had gained weight; Mansherry shows a typical tsundere attitude toward Leo alone."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a dwarf, she is incredibly fast and much stronger than her size would suggest. Her speed seems to be high even among dwarves, as noted by Leo. Also, as princess of the dwarves, she has authority over all of them, second only to her father, the dwarf king."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Mansherry ate the Chiyu Chiyu no Mi, a Paramecia-type Devil Fruit that gives her the ability to instantly heal any living being's injury. Mansherry can use her power in several different ways, including her tears. This was shown to be used against her will when Giolla made her cry in an attempt to heal defeated members of the Donquixote Pirates."}, {"type": "paragraph", "text": "The greatest power of this fruit is the restoration of inanimate objects, and Doflamingo intended to have her restore the SMILE factory in the event that something happened to it. However, doing this will shorten her lifespan. This power has not been explicitly shown."}, {"type": "paragraph", "text": "Soon after Doflamingo's defeat, it was revealed that Mansherry is able to fuel her healing abilities by taking blood donations from people, creating what appear to be fluffy dandelion seed heads. When one such dandelion is applied to an injury, the injury is instantaneously, permanently, and perfectly healed. Their permanent nature makes these dandelions different from the ones she scattered over Dressrosa earlier."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Chiyu_Chiyu_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20151129192854", "caption": "Mansherry's healing liquid."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in the past 10 years, 500 dwarves, including Mansherry, were kidnapped by the Donquixote Pirates. The dwarf princess was subsequently held prisoner while the rest were forced to work in the factory. She was only kept alive for her healing abilities."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mansherry was first thought to be held captive in the factory under the Corrida Colosseum along with the other captured dwarves. During her imprisonment, Doflamingo's subordinates fooled the enslaved dwarves into thinking that Mansherry was ill and that SMILEs were required to cure her."}, {"type": "paragraph", "text": "After the enslaved dwarves revolted, they found that Mansherry was not in the factory at all. She was revealed to be imprisoned in the royal palace. While trapped in a small cell all by herself, she cried and pleaded for Leo to come save her."}, {"type": "paragraph", "text": "After Sugar passed out, Mansherry was forced to use her healing powers to revive her."}, {"type": "paragraph", "text": "Giolla later attempted to force her to heal the defeated members of the Donquixote Pirates. Mansherry refused, realizing that they were the enemy. Once Giolla learned that Mansherry's tears were also capable of healing, Giolla tried to make her cry by using force. However, before Giolla could revive her fallen comrades, Leo and Kabu arrived to save the princess. Leo defeated Giolla and rescued Mansherry by catching her, much to her joy."}, {"type": "paragraph", "text": "Mansherry gently asked Leo to carry her, saying that her legs hurt. Leo harshly declined her request, saying that her selfish side was showing and pointing out that she could heal her own legs. Mansherry grumpily stated that she wouldn't run and told Leo that she never asked him to save her. As Leo was getting more and more annoyed by Mansherry's apparent mood swings, Kabu whacked him on the head and told him to carry the princess. Leo carried her after that."}, {"type": "paragraph", "text": "The three dwarves escaped the palace and met up with Kyros, Rebecca, and Robin at the Sunflower Field. Mansherry noticed Kyros' wounds and offered to heal them, but Kyros told her to save her healing powers for people who needed it more than him."}, {"type": "paragraph", "text": "She later witnessed the explosion on the palace roof and Law's arrival at the Flower Field. She prepared to heal Law with her Watering Can, but Law refused to be taken out of the Flower Field. Mansherry then left the field via Bartolomeo's staircase."}, {"type": "paragraph", "text": "Mansherry later used her power to create dandelions that would temporarily heal the injured Corrida Colosseum fighters and Dressrosa citizens who were trying to push back or escape from the advancing bird cage. She was later seen flying above Dressrosa on Kabu's back, releasing the \"dandelixirs\" over the wrecked city. Later, the effects wore off, causing Mansherry to cry, but Kabu reassured her that her efforts had saved many people."}, {"type": "paragraph", "text": "After Doflamingo was defeated and the bird cage collapsed, the dwarves, including Mansherry, gathered in front of Kyros and saluted him."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, Mansherry was seen using her ability to help heal the injured citizens. After Sengoku and Tsuru arrived at Dressrosa, Sengoku offered his assistance to the dwarf princess."}, {"type": "paragraph", "text": "Unbeknownst to the Marines, the donations they gave to Mansherry rendered them incapacitated when they were mobilized to pursue Luffy and his allies. Mansherry wondered if it was alright to leave them immobilized, but Maujii assured her that they received permission from Kyros."}, {"type": "paragraph", "text": "As Riku Doldo III appeared before the citizens, Gancho introduced himself and Mansherry to the people. Mansherry was later seen shopping with Rebecca."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Chiyu_Chiyu_no_Mi_Healing.png/revision/latest/scale-to-width-down/210?cb=20161221095109", "caption": "Giolla forces Mansherry to heal the fallen Donquixote Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bc/Chiyupopo.png/revision/latest/scale-to-width-down/210?cb=20160221040640", "caption": "Mansherry turns her tears into healing dandelions."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mansherry was seen with Rebecca when Viola invited her niece to attend the Levely as a lady-in-waiting."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mansherry joined the Riku Family on their journey to the Levely. While speaking to Koby after he read the news of Luffy's exploits at Totto Land, Mansherry wondered if he was a fan of Luffy."}, {"type": "paragraph", "text": "The Dressrosa participants later arrived at Mary Geoise. At the castle, Mansherry accompanied Rebecca as she conversed with Vivi and Shirahoshi about Luffy. She then joined Rebecca in asking Dalton if he was fond of Luffy as well."}, {"type": "paragraph", "text": "After Rob Lucci knocked out Leo when he tried to defend Shirahoshi from Charlos, Mansherry quickly ran to Leo's side. After Mjosgard stopped Charlos from enslaving Shirahoshi, Mansherry healed Shirahoshi's bruises."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "When she was first mentioned by Leo, the silhouette depicted her to be wearing some kind of hat. However, the hat was not present during any of her appearances.", "elements": []}, {"text": "Her name may be a nod at the French phrase \"ma chérie\" (\"my darling\") which have a similar pronunciation to \"Mansherry\".", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Mansherry%27s_Silhouette.png/revision/latest/scale-to-width-down/150?cb=20150722004652", "caption": "Mansherry's original silhouette."}]}]}