{"sections": [{"title": "Milo", "level": 1, "content": [{"type": "paragraph", "text": "Milo is a citizen of Dressrosa. While he was a toy, he was known as \"Onepoco\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Milo is a chubby man with light-colored hair and beard (dark brown in the anime). He wears a light-colored shirt (light blue with white sleeves in the anime) with dark rims and collar. His shirt has his name on the front and the back has the word \"*NOT*\" over a line and \"ONEPOCO\". He also wears dark gray shorts."}, {"type": "paragraph", "text": "As Onepoco, he was a metallic toy dog with a pale gray body, floppy dark brown ears, and a light blue hat with the word \"ONE\" written in white on it. His right eye had a red X mark on it. His neck and tail were springs and his legs were made out of balls."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Onepoco.png/revision/latest/scale-to-width-down/210?cb=20160827005305", "caption": "Milo as Onepoco."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Milo is generally happy and playful around his family but during his time as a toy, he was secretly frustrated that his wife and son did not remember him at all."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Milo loves his wife and son dearly. When he was turned into a toy, they completely forgot about his existence. To stay close to them, Milo put up a cheerful facade and acted as a playmate for his son. When he was turned back into a human, his family regained their memories of him. They were shocked that they had forgotten him, but Milo was just happy that they were together again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Milo%27s_Family.png/revision/latest/scale-to-width-down/150?cb=20160222031536", "caption": "Milo's wife and son."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Milo was once a human and had a wife and a son. After Doflamingo came to Dressrosa ten years ago, Milo got turned into a dog-looking toy by Sugar's Hobi Hobi no Mi powers."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "He first appeared when his son wanted to ride him, but Milo told him he was too heavy. His wife and son denied having a husband and father, respectively. He then continued to walk around town with them."}, {"type": "paragraph", "text": "When Sugar's curse broke, Milo transformed back into a human and had a tearful reunion with his family. This reunion was soon cut short as Doflamingo trapped everyone on Dressrosa in his \"bird cage\"."}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "Instead of having dark-colored rims and collar in the manga, Milo's shirt was colored white in the anime. Also, there was an extra bit when an elephant and a lion were chasing him and his family, along with members of the Donquixote Pirates, one of which he recognized as the one who beat him mercilessly when he was still a toy and then proceeded to punch him in the face as retaliation."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The name \"Onepoco\" may be a pun: the English word \"one\" is pronounce as \"wan\", which is the Japanese onomatopoeia for a dog's bark.", "elements": []}, {"text": "When Milo returned to normal, his name was written on the front of his shirt. In a following panel, the words \"*Not* Onepoco\" can be seen on the back of his shirt.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 717 and Episode 647, Milo is shown.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 75 Chapter 743.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 74 Chapter 737.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 75 Chapter 745.", "elements": []}]}], "images": []}]}