{"sections": [{"title": "Roji", "level": 1, "content": [{"type": "paragraph", "text": "Roji was the wife of Oran, the mother of Mizuira, the sister-in-law of Nico Olvia, and the maternal aunt of Nico Robin."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Roji was a large, widely obese woman with thin limbs, wide and thick lips, small sad beady eyes, and curly red hair. She wore a simple short-sleeved orange shirt and black pants."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Roji was an extremely rude, abusive, and uncaring towards her niece Robin. She threatened Robin for crying and even treated her like a slave. Roji only cared about herself, her husband, and her only daughter."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "When Nico Olvia left Ohara to research Poneglyphs, Roji and her husband, Oran, took in Olvia's two-year-old daughter, Robin, since Oran was Oliva's older brother. Roji never liked Robin and would threaten to hit Robin if she did not stop crying. She would always make Robin do all the housework and have her eat stale bread. Roji would not allow Robin to join any family celebrations. Roji also scolded Robin for trying out Mizuira's clothes. In essence, Roji treated her niece as a slave. However, Roji's husband would always defend Robin; since he is Robin's maternal uncle, he was the only person in the household to show care for her and would deal with Roji's temper."}, {"type": "paragraph", "text": "During the Buster Call attack on Ohara, she was killed when Vice Admiral Sakazuki blew up the refugee ship."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 391 (p. 16-17) and Episode 275, Roji is first mentioned.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 392 (p. 19) and Episode 275, Roji seen in a flashback.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 393 (p. 14) and Episode 276.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 395 (p. 15) and Episode 277.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 397 (p. 11-12) and Episode 278.", "elements": []}]}], "images": []}]}