{"sections": [{"title": "Marco", "level": 1, "content": [{"type": "paragraph", "text": "Marco the Phoenix is the former 1st division commander of the Whitebeard Pirates. Once starting out as an apprentice on the crew, he had come to be Whitebeard's closest confidante and right-hand man. After his captain's death, Marco assumed leadership of the Whitebeard Pirates until the crew's disbandment following the Payback War."}, {"type": "paragraph", "text": "Since said war during the two-year timeskip, Marco works as a doctor at Whitebeard's home village, Sphinx."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Marco is a tall, lean, muscular, blonde-haired man with a rather sleepy look on his face and some stubble around his chin. He wears an open purple jacket and a light blue sash adorned with an elaborate golden-yellow belt around his waist. He has dark gray knee-long pants and black sandals, and on his left leg he wears what appears to be some sort of straw decoration, in a similar fashion to Arlong. While his chest was bare in his initial appearance, in his subsequent appearances he has the cross and crescent moon mustache symbol that resembles a black silhouette of Whitebeard's Jolly Roger tattooed on it. Robin and Luffy believe that Marco's head looks like a pineapple."}, {"type": "paragraph", "text": "Initially in the anime, Marco was given a generic crew member look of a black haired man with pale skin and different clothes. When he later became more formally recognized in the story, his appearance was changed to what is depicted in the manga, along with his light purple jacket, his black pants and his dark red tattoo. Later, starting with Opening 13 \"One Day\", he was given another color scheme. Once again his jacket was recolored in a much brighter purple, his pants were made dark blue, his tattoo blue and his skin a little brighter."}, {"type": "paragraph", "text": "Marco was a member of the Whitebeard Pirates twenty two years ago as well, and while how old he was is difficult to ascertain, his appearance, for the most part, resembles his present self."}, {"type": "paragraph", "text": "As a kid, Marco's signature tuft of hair was more curly. He sported a vertically striped shirt, with black pants, and no shoes. As a teenager, his appearance was not much different."}, {"type": "paragraph", "text": "After the timeskip, while working as a doctor on Whitebeard's home island, Marco wears a light button-up shirt as well as a pair of eyeglasses."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Marco is generally calm and level-headed in the face of adversity or challenge; the only strong emotional moments he has shown so far were directly related to Whitebeard's health (after he was stabbed in the torso by his own subordinate Squard and after his death). When Ace and Whitebeard were killed, Marco and the rest of the Whitebeard Pirates were in tears."}, {"type": "paragraph", "text": "In fact, seeing his captain, Whitebeard, get stabbed through the chest by a deceived Squard was enough for Marco to lose his usually unshakable cool-headedness that he immediately flew over to where they were to smash Squard's head against the Moby Dick's figurehead."}, {"type": "paragraph", "text": "He also demonstrates himself to be acute at detecting power, able to quickly notice the presence of Red-Haired Shanks' Haōshoku Haki before anyone else aboard the Moby Dick as well as the underlying potential of Monkey D. Luffy. He clearly cares for his crew as he warned them to stay back from Shanks' Haki."}, {"type": "paragraph", "text": "Having been a member of the Whitebeard Pirates for at least thirty years, Marco has an extremely high degree of experience with exposure and combat inside the treacherous New World. After Whitebeard's and Portgas D. Ace's deaths at Marineford, Marco took the position of commander of the Whitebeard Pirates, highlighting his level of intelligence and suitability in taking up a commanding position."}, {"type": "paragraph", "text": "He appears to be somewhat playful, pretending to be hurt from Admiral Kizaru's attack with obvious sarcasm, though he can also quickly become serious."}, {"type": "paragraph", "text": "Marco seems to appreciate raw talent, even if it comes from someone whom he had never met before (i.e. Luffy). Because of this, and based on the fact that Luffy intercepted Crocodile's attack on Whitebeard, Marco immediately took a liking to him."}, {"type": "paragraph", "text": "When he was an apprentice, he appeared to be a cheerful person. He was also encouraging as he cheered on Oden when he came close to passing Whitebeard's test to join the crew. He showed a playful side when he noticed Oden being close to Toki."}, {"type": "paragraph", "text": "Like some other characters, Marco has a very particular speech habit, which is a simple tic without meaning, ending his sentences with \"-yoi\" (～よい, \"-yoi\"): e.g. \"arigatō-yoi\" (ありがとうよい, \"arigatō-yoi\" \"thanks-yoi\") or \"mattero-yoi\" (待ってろよい, \"mattero-yoi\" \"wait-yoi\")."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Being a division head of Whitebeard's crew, Marco had a very strong bond with Whitebeard. So strong was their bond, it seemed very similar to a captain and first mate relationship, much like the one of Gol D. Roger and Silvers Rayleigh. This can be indicated by Marco's position as 1st division commander. Also, during the Battle of Marineford, Marco stood at Whitebeard's side almost the entire time in the early stages of the battle. Marco was also the first and only crewmate who rushed to Whitebeard's aid, after Whitebeard was stabbed by Squard and during his battle with Akainu. Later, Marco attempted to assist his captain in fighting Blackbeard, but was ultimately ordered to stand down. Marco, along with his crewmates, considered Whitebeard their \"father\" much in the same way the great pirate considered them his \"children\"."}, {"type": "paragraph", "text": "Marco also had a very strong bond with the other commanders as well as the rest of the crew. He and Ace seemed to have a close friendship, due to him explaining to Ace the bond between Whitebeard and his crew. Marco also trusted Vista enough to protect Luffy from Mihawk."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Edward_Newgate_Compared_to_Normal_Humans.png/revision/latest/scale-to-width-down/210?cb=20190602014027", "caption": "Marco standing next to Whitebeard during the battle of Marineford."}]}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Having heard stories about Luffy from Ace, Marco was among the first people to recognize the Straw Hat captain in the midst of the battle in Marineford, despite not having encountered him prior. While no direct interaction occurred between the two, Marco, took an immediate like to Luffy after the young pirate stopped Crocodile from attacking Whitebeard. Later, under Whitebeard's orders, he was delegated the task of ensuring that Luffy lived through the battle in Marineford. In the anime they had a short conversation after he saved Luffy from Aokiji, during which Luffy thanked him for saving him while Marco told him not to worry about it. Marco was also surprised at seeing Luffy's Haoshoku Haki and when his captain told the rest of the crew to back up Luffy. After Ace's demise, he stopped Akainu from killing Luffy and urged the other Whitebeard Pirates to save Luffy, as Ace sacrificed his life for his."}, {"type": "paragraph", "text": "Two years after the battle at Marineford, Luffy is shown to be thankful to Marco and the Whitebeard Pirates for protecting him from Akainu and wishes to meet them again one day in order to thank them for saving his life. In a talk with Nekomamushi, Marco wanted the latter to pass on a message to Luffy."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "Marco was initially hostile towards Shanks as he regarded Red Hair as an enemy. After Shanks knocked out some Whitebeard Pirates with his Haki, Marco insulted and scolded him for the damage he had done and even told him to shut up after the Yonko offered him to join his crew."}, {"type": "paragraph", "text": "After the battle of Marineford, Marco apologized to Shanks for his previous behavior and genuinely thanked him for ensuring the funerals of both Whitebeard and Ace, finally acknowledging him as more of an ally."}, {"type": "paragraph", "text": "Marco is also grateful to Shanks for burying Whitebeard near his hometown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Shanks_and_Marco_at_Whitebeard_and_Ace%27s_Funeral.png/revision/latest/scale-to-width-down/200?cb=20191208235441", "caption": "Marco talking with Shanks at the funeral of Whitebeard and Ace."}]}, {"title": "Nekomamushi", "level": 4, "content": [{"type": "paragraph", "text": "Marco is well acquainted with the mink as they sailed on Whitebeard's ship together years ago. Nekomamushi knew exactly where to find Marco when he needed help. The pair caught up on recent events and impending threats before Nekomamushi understood why he didn't want to leave the island. Marco was amused that the latter gave up on trying to recruit him so easily and asked to pass on a message to Luffy for him."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Due to his role in the capture of Ace and the deaths of Thatch & Edward Newgate, Blackbeard is considered both an enemy and a traitor to the Whitebeard Pirates. He was shocked to see the power of his captain in the hands of Teach. During the timeskip, he and the rest of Whitebeard Pirates fought against the Blackbeard Pirates in the \"Payback War\", but lost and have since disappeared."}, {"type": "paragraph", "text": "Even after the timeskip, Marco still despises Teach calling his actions deplorable and referring to him as ungrateful for taking advantage of the crew, despite everything they did for him."}], "images": []}, {"title": "Blackbeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Several members of Blackbeard's crew present at Marineford assisted their captain in killing Whitebeard. The crew later managed to takeover most of the Whitebeard Pirates former territory and are currently hunting Devil Fruit users, thus making Marco a potential target due to his rare Mythical Zoan Devil Fruit and status as the current commander of the Whitebeard Pirates in the wake of Whitebeard's death."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "As a pirate and a member of the Whitebeard Pirates, Marco was a major enemy of the Marines. Marco fought against them during the Battle of Marineford in order to rescue Ace from execution."}], "images": []}, {"title": "Sakazuki", "level": 4, "content": [{"type": "paragraph", "text": "After Akainu killed Ace, Marco fought against him to stop him from killing Ace's brother, Luffy."}], "images": []}, {"title": "Edward Weevil", "level": 4, "content": [{"type": "paragraph", "text": "Edward Weevil is the self-proclaimed biological son of Whitebeard and member of the Shichibukai who has been hunting down the Whitebeard Pirates and their subordinate crews, in order to claim Whitebeard's fortune for himself and his mother Bakkin. After defeating the A.O Pirates, including their Captain A.O, Weevil and his mother went on to search for Marco's whereabouts. Marco is aware of Weevil's hunt for him and a non-existent inheritance but he himself does not know if he is really Whitebeard's son."}], "images": []}, {"title": "Bakkin", "level": 4, "content": [{"type": "paragraph", "text": "The mother of Edward Weevil and self-proclaimed lover of Edward Newgate, who views herself and her son as the rightful heirs to Whitebeard's fortune. After her son defeated the A.O Pirates, she told her son they must find Marco in order to acquire Whitebeard's fortune. Marco is aware of Bakkin and Weevil's hunt for him and a non-existent inheritance, as well that Bakkin and Whitebeard were on the same crew while starting out as pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As commander of the 1st division of the Whitebeard Pirates, Marco has authority over the lower-ranking subordinates. Following Whitebeard's death, Marco became the highest authority of the Whitebeard Pirates, and as such the crew was under his command as they retreated from Marineford."}, {"type": "paragraph", "text": "Marco was one of the few men unaffected by the powerful Haki released by the Yonko Shanks. He is a very experienced veteran, as he was shown as a member of the Whitebeard Pirates from the times of Gol D. Roger."}, {"type": "paragraph", "text": "Marco is a very strong individual, as he demonstrated in the war that he was on a similar level of fighting as the three admirals. He was fully capable of fighting admirals Kizaru, Aokiji, and Akainu while holding his own."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Marco possesses a large amount of physical strength. With his physical power supplemented by his Devil Fruit, he could clash with the Marine Admirals, repelling two of them large distances away when they tried to assault his crew and allies. He also possesses tremendous speed and reflexes, as he instantaneously sprung to protect Whitebeard from Kizaru's Yasakani no Magatama, interposing himself between his Captain and the attack, and subsequently went on to intercept the lightning-fast Admiral and clash with him. In addition, on top of the vast regenerative powers bestowed upon him by his Mythical Zoan Fruit, he has also displayed great stamina and endurance. He had been pierced clean through his torso by several of Kizaru's laser beams and was still able to stand and function normally afterwards despite being unable to regenerate due to his Devil Fruit abilities being disabled by a Seastone manacle at the time."}, {"type": "paragraph", "text": "Marco's fighting style seems to be primarily based on using kicking techniques, as he kicked both Kizaru and Aokiji away with great force. He usually switches back to his human form to deliver his kicks, but can also enhance them with the cutting power granted by his hybrid form's talons, as shown when he attacked Akainu after the latter delivered the fatal blow to Ace."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Marco ate the Tori Tori no Mi, Model: Phoenix, a Mythical Zoan-type Devil Fruit which allows him to transform into a phoenix, granting him the ability to fly. It is an immensely powerful type of Zoan Devil Fruit, said to be the rarest type, even rarer than Logia fruits. It is because of this ability that he is identified as \"Marco the Phoenix\"."}, {"type": "paragraph", "text": "His control over his hybrid form is so great that he can transform individual parts of his body, being able to remove his hands and feet from his transformation when necessary."}, {"type": "paragraph", "text": "The greatest ability derived from his Devil Fruit however, is being able to regenerate and heal parts of his injured body by simply enveloping them with the flames of his phoenix form. In this form he can endure deadly attacks without being affected in the slightest, since it can heal any would almost instantly. Marco can also heal wounds he suffers in human form while in contact with Seastone later. In fact it is sufficient that should his contact with Seastone be broken, Marco can return to his phoenix form to heal any wound that was inflicted previously. This last ability makes it superior to Logia users, given that they cannot regenerate wounds they have received while they are in contact with Seastone once that contact is broken. It can also heal the wounds of others, even if more limited."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Tori_Tori_no_Mi%2C_Model_Phoenix_Infobox.png/revision/latest/scale-to-width-down/200?cb=20130126172323", "caption": "Marco transforms into a phoenix."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Marco has shown to be capable of using Haki proficiently during the Battle of Marineford. With his Busoshoku Haki, Marco kicked Kizaru away after the admiral tried to kill Whitebeard. He also kicked Aokiji away to save Luffy's life. After the death of Portgas D. Ace, he and Vista used their Busoshoku Haki against Akainu but did not manage to hurt him even though their attacks did irritate the admiral."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Marco possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early Life", "level": 4, "content": [{"type": "paragraph", "text": "During his childhood, he was shown studying."}], "images": []}, {"title": "Adventures With Kozuki Oden", "level": 4, "content": [{"type": "paragraph", "text": "Thirty years ago, Marco was among the Whitebeard Pirates when they arrived for the first time at Wano Country. He was 15 years old at that time and was an apprentice on the ship. The crew was shipwrecked and before going to civilization to get supplies, they encountered Kozuki Oden, who asked Newgate to let him join their crew after a brief clash."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Marco also told Inuarashi and Nekomamushi on how vast the world is. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. Marco prepared to unwrap the chain, but Whitebeard ordered him to leave it be and pull Izo up to the Moby Dick. Oden then accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, Marco started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Meeting with Shiki", "level": 4, "content": [{"type": "paragraph", "text": "Twenty two years ago, he was present on Whitebeard's ship when Shiki visited the Yonko to inform him of his plans. At this point, he had already become one of Whitebeard's commanders. He was also present on Fish-Man Island when Whitebeard claimed the island as his territory."}], "images": []}, {"title": "Ace's Arrival", "level": 4, "content": [{"type": "paragraph", "text": "During the first few days Portgas D. Ace spent on Whitebeard's ship, Marco tried to befriend him. Marco explained to Ace the kind of fatherly relationship Whitebeard had with his crew members. In fact, it was Marco who told Ace to leave the ship and start from scratch again or bear Whitebeard's mark as one of his sons."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/78/Marco_talks_to_Ace.png/revision/latest/scale-to-width-down/210?cb=20130308101436", "caption": "Marco tells Ace to make a decision."}]}, {"title": "Thatch's Murder", "level": 4, "content": [{"type": "paragraph", "text": "After the murder of Thatch at the hands of Marshall D. Teach, Ace decided to search for Blackbeard and make him pay for what he did. However, Whitebeard, who was feeling uneasy, told Ace not to go, something that Ace did not want to hear. Marco was one of the crew members who protested to Ace leaving the ship and going after Teach, but this was in vain."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Marco was aboard Whitebeard's ship when Rockstar delivered a letter from Shanks. Rockstar boasted about his own notoriety, but Marco claimed to have never heard of him."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Shanks came to visit Whitebeard personally, Marco and Jozu warned the younger and weaker crew members to stay back due to Shanks's overwhelming presence. He also told the members still standing afterward not to worry about their fallen comrades as they were just unconscious. Marco scolded Shanks for what he did to his subordinates, and Shanks recognized him as the 1st division commander and asked him if he would like to join the Red Hair Pirates, which Marco refused."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Marco showed up at Marineford with the rest of the Whitebeard Pirates and their subordinate crews from the New World. He stated that, including him, all of the Whitebeard Pirates were ready to battle anyone who had dared to lay a single finger on Ace. When Kizaru tried to attack Whitebeard with an array of laser beams, Marco nullified the attack with his powerful Devil Fruit abilities. He then proceeded to attack Kizaru, and successfully kicked him a great distance to the ground, although the admiral did not appear to be seriously injured."}, {"type": "paragraph", "text": "Marco saw Monkey D. Luffy and his Impel Down team falling from the sky and came to the realization that Ace's brother, whom Ace had always talked about, had arrived. When he witnessed Luffy stopping Crocodile's attempt to kill Whitebeard on the grounds of Whitebeard being important to Ace, Marco concluded that, \"Ace's little brother is not too shabby after all\". Just after Luffy dashed off after informing Whitebeard that Ace would be executed ahead of schedule, Marco returned to the Moby Dick to report the same news. Whitebeard, after seeing some of Luffy's resolve to save Ace, told Marco that he would not forgive him if he were to let Luffy die, to which Marco (who appeared to have developed a similar opinion and liking towards Luffy) smiled and replied, \"Roger.\""}, {"type": "paragraph", "text": "Later, after Whitebeard manipulated Buggy into joining his cause temporarily, Marco remarked at how simple-minded Buggy was. When he witnessed Luffy being attacked by Dracule Mihawk, he called out to 5th division commander Vista to go and help him out. He found it odd when Squard appeared next to Whitebeard, and was shocked when Whitebeard was stabbed by him. He was the first one to reach the Moby Dick and to incapacitate Squard, but he was repelled by Squard's sword when Squard told Marco it was also his fault that he had been forced to attack Whitebeard."}, {"type": "paragraph", "text": "After Crocodile yelled at Whitebeard for being weak, Marco commented on how Whitebeard's health was getting worse, since Whitebeard should have been able to stop any attack aimed at him, even if he was caught off guard. After the whole ordeal was sorted out, he saw Squard crying and deeply regretting his actions, and suggested to him that he should redeem himself. Marco's expression was solemn when he witnessed the Moby Dick being destroyed by Akainu's meteor magma attack. As Ace was about to be executed, Marco was prepared to swoop in and save him, but noted that he was not needed after Crocodile saved Ace first. After Luffy was heavily injured by the admirals and was about to be finished off by Aokiji, Marco arrived and kicked Aokiji away a great distance."}, {"type": "paragraph", "text": "With (seemingly) only two Marines watching over Ace, Marco flew towards the execution platform, telling Ace that he would soon save him. As he got closer, however, Monkey D. Garp intercepted him with a punch that sent him crashing to the ground. Marco, now in human form, looked up, frustrated and with a bruise on the left side of his chin."}, {"type": "paragraph", "text": "In the midst of battling Akainu, Whitebeard suddenly seized his chest, and Marco, in horror, realized what was happening just as Whitebeard coughed up a massive amount of blood. Marco thought to himself that this was what he was most afraid might happen and rushed towards his captain. However, he did not get very far before Kizaru shot him from behind with two simultaneous lasers, which clearly caused Marco pain, as he was in his human form. Enduring the pain, Marco activated his regenerative powers and continued to run towards Whitebeard, only to have Onigumo seize him and place Seastone handcuffs on his right arm. Kizaru then took the opportunity to shoot Marco with two more laser bursts. Badly injured and unable to regenerate, Marco fell."}, {"type": "paragraph", "text": "Later, after Luffy unconsciously used his Haoshoku Haki, the bloodied Marco showed surprise. By the time Squard entered the battlefield with the paddle boat Little Oars Jr. brought into the plaza, stating that Whitebeard and his subordinate crews should grab Ace and leave the enemy to him, Marco was back on his feet. He commented angrily on Squard's foolish way of redeeming himself and quickly ordered a nearby crewmate to remove his cuffs."}, {"type": "paragraph", "text": "After Whitebeard declared that he would part ways with his sons and stay behind, Marco hesitated, reluctant, as a nearby crewmate urged him to go. He was shocked by the sight of Ace taking Akainu's molten punch through the chest. When Akainu tried to strike Ace a second time and finish him off, he was stopped by Jinbe; Marco saw this and, desperate now, ordered Galdino, who was dragged over to him, to remove his handcuffs immediately."}, {"type": "paragraph", "text": "Akainu turned to launch another attack on Jinbe, and much to his annoyance was repelled by simultaneous attacks from Marco and Vista, who used Haki attacks to drive him away from the injured Jinbe, Ace, and Luffy. Marco, deep in regret, wondered how they could have allowed all this to happen. When Ace spoke his last words to Luffy, Marco joined the battle in order to keep the Marine forces away from Ace. Marco cried over as Ace died."}, {"type": "paragraph", "text": "Determined to finish off Luffy, who was incapacitated from shock caused by his grief and anguish, Akainu attacked once again; this time he was again intercepted by Marco, who shouted that Akainu would not touch Luffy. He ordered Jinbe to take Luffy and go. As Luffy was all that remained of Ace's will, Marco declared that they would protect him without fail, in place of Ace; if he too were to die, the Whitebeard Pirates would be put to shame."}, {"type": "paragraph", "text": "When Whitebeard and Blackbeard confronted each other, Marco tried to fly to the other side to assist his captain, but was commanded to stay back by his captain, who said that he would kill Blackbeard as revenge for killing Thatch. When Whitebeard was brutally killed by the Blackbeard Pirates, Marco mourned Whitebeard's death as Whitebeard left the crew under his care."}, {"type": "paragraph", "text": "Marco then witnessed Blackbeard absorbing the power of the Gura Gura no Mi, much to the commander's shock. Marco explained to a fellow crewmate that Blackbeard was no ordinary person. He then joined his fellow crewmates, with some unlikely help from Crocodile, as they prepared to face off against Akainu to defend Luffy and carry him on to the next era. When Koby yelled for all the combatants to stop, Marco wondered why a Marine was trying to stop the fight."}, {"type": "paragraph", "text": "When Shanks arrived at Marineford to stop the war, Marco was told by Shanks to withdraw peacefully from Marineford and avoid prolonging the battle any longer. Marco complied and later grieved with his crewmates over their losses."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Borsalino_vs._Marco.png/revision/latest/scale-to-width-down/210?cb=20130315154132", "caption": "Marco battles Kizaru."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ec/Marco_vs._Kuzan.png/revision/latest/scale-to-width-down/200?cb=20130224105103", "caption": "Marco kicks Aokiji to save Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a4/Garp_Punches_Marco.png/revision/latest/scale-to-width-down/200?cb=20130206014009", "caption": "Garp sends Marco crashing down."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Borsalino_Attacks_Marco.png/revision/latest/scale-to-width-down/200?cb=20130308091807", "caption": "Kizaru pierces a distracted Marco."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/01/Akainu_Attacked_With_Haki.png/revision/latest/scale-to-width-down/200?cb=20160210231535", "caption": "Marco and Vista attack Akainu"}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Marсo, along with the rest of the crew, attended Ace and Whitebeard's funeral near Whitebeard's unnamed homeland somewhere in the New World. He thanked Shanks for ensuring that Whitebeard and Ace received proper burials."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Tomb_of_Ace_and_Whitebeard.png/revision/latest/scale-to-width-down/200?cb=20141206163731", "caption": "Marco and Shanks at Ace and Whitebeard's funeral."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates, under Marco's guidance, fought against the Blackbeard Pirates in the \"Payback War\" in an attempt to avenge their fallen comrades, but suffered an overwhelming defeat. They went into hiding and have not been seen since their defeat. It was this defeat that led Blackbeard to be officially recognized as Whitebeard's replacement as a Yonko."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Payback_War_Infobox.png/revision/latest/scale-to-width-down/230?cb=20190712004413", "caption": "Marco vs. Blackbeard."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Payback War, Marco went to Whitebeard's home village and worked as a doctor there. When Nekomamushi came to the village to find him, Marco talked about Whitebeard's history with the village. He also heard about Edward Weevil attacking those connected to Whitebeard in search of a fortune that does not exist. Because of the possibility that Weevil would attack the village as well, Marco decided to remain in the village to protect it. He then asked Nekomamushi to pass on a message to Luffy."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Marco vs. Kizaru", "elements": []}, {"text": "Marco vs. Aokiji", "elements": []}, {"text": "Marco vs. Monkey D. Garp", "elements": []}, {"text": "Marco vs. Kizaru and Onigumo", "elements": []}, {"text": "Marco and Vista vs. Akainu", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Thatch and Jozu), Crocodile and Andre vs. Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime when he was first shown, he was replaced with a generic crewmember. This is a common mistake that occurs in transferring a scene from manga to anime and has been witnessed in One Piece before, in particular when characters are first shown without a formal introduction."}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "list", "elements": [{"text": "Marco is shown during the One Piece Premier Show 2012 as a member of the Whitebeard Pirates against the New World pirate, Chameleone.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Marco_Premiere_Show.png/revision/latest?cb=20130128003243", "caption": "Marco as he appears in the One Piece Premier Show 2012."}]}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Marco has been featured in various figurine series, such as Portrait of Pirates or One Piece World Collectable Figure."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/28/Portrait_of_Pirates_Marco_Figurine.png/revision/latest/scale-to-width-down/100?cb=20150308232147", "caption": "Portrait of Pirates figurine of Marco."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise SP", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Super Grand Battle! X (becomes a playable character in the 1.3 update)", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Marco is the first person to be revealed to have eaten a Mythical Zoan Devil Fruit, when its concept is first introduced.", "elements": []}, {"text": "In the sixth fan poll, he was ranked at 20th place, making him the second most popular member of the Whitebeard Pirates behind Ace.", "elements": []}, {"text": "Marco's blood type is X.", "elements": []}, {"text": "Marco's favorite food is pineapple.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Marco's birthday, October 5, comes from his name since 10-5 can be derived from Maru-co.", "elements": []}, {"text": "A fan asked Oda if Marco's penis will regenerate if it gets cut off, and Oda responded that it will regenerate.", "elements": []}]}], "images": []}]}