{"sections": [{"title": "Keroko", "level": 1, "content": [{"type": "paragraph", "text": "Keroko is a member of the Red Arrows Pirates who appeared in the sixth One Piece movie. She is also a member of the speedboat running group within the crew, the Four Wise Men."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Keroko is a small, old woman with pale skin, pink lip stick, and wrinkles on her forehead and under her eyes. She wears a pink dress with a white collar and white shoes. One her head, she wears a pink and red frog hat that has a plant sprout sticking out of the top and a yellow bow on top. The eyes on her hat are wide open and have eyelashes, referencing Keroko's gender. She is the only member of the Four Wise Men that doesn't wear gloves."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Keroko has a fairly unrealistic mindset, since she said that Nami was only a little bit younger than her. Despite this, she is very cruel and vicious against other pirates like the rest of his crew. She enjoys watching members of other crews fight and wants their friendships to end."}, {"type": "paragraph", "text": "Despite her vicious behavior, she can accidentally give out helpful advice to others, like when she told Nami that the rescue boxes in their speedboat could help put out the fire."}, {"type": "paragraph", "text": "Keroko shares a unique laughter style, \"Kerokerokero\", with the rest of the Wise Men. This style is a play on the similar start to their names."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Keroko's physical abilities, but she is skilled at speedboat racing and using different distractions."}], "images": []}, {"title": "Distractions", "level": 3, "content": [{"type": "paragraph", "text": "During the speedboat races, Keroko uses a variety of things to distract and harm her opponents. She uses a small grill built into the boat to grill fish and meat and create a lot of smoke, which is used to blind the other team. She also uses a pair of chopsticks and a fan to fling hot coals onto the opponents' boat, causing it to catch fire."}], "images": []}, {"title": "Speedboats", "level": 3, "content": [{"type": "paragraph", "text": "Though she has only been seen as a passenger of a speedboat, she is most likely skilled at driving them. She works very well with his speedboat partner, Kerojii, and together they usually overpower their opponents with his driving skills and her distractions."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/60/Kerojii_and_Keroko%27s_Speedboat.png/revision/latest/scale-to-width-down/210?cb=20190429082207", "caption": "Keroko and Kerojii's speedboat"}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Many years ago, Keroko joined the Red Arrows Pirates. They sailed on the Grand Line back when Gol D. Roger was still alive. At some point, there was a terrible storm that killed Keroko and the rest of the crew, leaving Omatsuri alone. Eventually, the lonely captain arrived on Omatsuri Island and met the Lily Carnation, which he used to revive Keroko and the rest of the crew. Since then, they have been attracting pirate crews to the island to break them up and feed them to the plant monster."}], "images": []}, {"title": "Baron Omatsuri and the Secret Island", "level": 3, "content": [{"type": "paragraph", "text": "When he was introduced, Keroko and her fellow Wise Men were standing on podiums and Omatsuri announced that they would be the representatives for the speedboat race against the Straw Hat Pirates.Nami laughed at this, since she thought they were weak due to their age and size. Keroko said she was only a little bit younger than Nami, and the rest of the Men insulted her as well, upsetting Nami."}, {"type": "paragraph", "text": "During the race, Keroko and Kerojii were in a speedboat against Nami and Usopp. While her partner was driving, Keroko used a variety of different things to distract them, such as using smoke from cooking to distract them and throwing coals at their boat to set it on fire. Throughout the match, Keroko and her partner continuously disrespected the young pirates, even to the point that they ate a meal while Nami was trying to catch them. When Nami and Usopp's boat caught on fire, she and Kerojii encouraged them to open their rescue boxes. Usopp's wrapped around him, turning into a pair of wings and carrying the sniper away. Her partner then convinced Nami that Usopp was betraying her."}, {"type": "paragraph", "text": "Later, Zoro and Sanji, after defeating Kerodeek and Keroshot, come across an ensnared Nami and have to fight against Kerojii. Keroko was ensnared prior to their arrival, but it wasn't seen. After Kerojii was captured, Keroko and her fellow Wise Men snickered at the victors, since their relationships are weakened."}, {"type": "paragraph", "text": "After Lily Carnation was killed, Keroko and the other Wise Men turned into plants."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/be/Keroko_Throws_Hot_Coals.png/revision/latest/scale-to-width-down/210?cb=20131025201638", "caption": "Keroko throws coals at Nami and Usopp."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Four Wise Men vs. The Straw Hat Pirates", "elements": [{"text": "Keroko and Kerojii vs. Nami and Usopp", "elements": []}]}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Keroko is the only member of the Four Wise Men who is female. Her membership in the group is quite ironic, due to her gender contrasting form the group's name.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Movie 6, Keroko is introduced as one of the speedboat drivers.", "elements": []}, {"text": "↑  One Piece Movie 6, Keroko is shown as the only female member of the Four Wise Men.", "elements": []}, {"text": "↑  One Piece Movie 6, Keroko and the other Wise Men talk down to Nami.", "elements": []}, {"text": "↑  One Piece Movie 6, Keroko and the Wise Men laugh at the Straw Hats' internal conflict.", "elements": []}, {"text": "↑  One Piece Movie 6, Keroko and Kerojii attack Nami and Usopp with a variety of things.", "elements": []}, {"text": "↑  One Piece Movie 6, Keroko uses a variety of different things to distract her opponents.", "elements": []}, {"text": "↑  One Piece Movie 6, Omatsuri reveals the former fate of his crew.", "elements": []}, {"text": "↑  One Piece Movie 6, Kerojii convinces Nami that Usopp betrayed her.", "elements": []}, {"text": "↑  One Piece Movie 6, Keroko and the rest of crew turn into plants.", "elements": []}]}], "images": []}]}