{"sections": [{"title": "Jim", "level": 1, "content": [{"type": "paragraph", "text": "Jim was an anime-only Marine that appears in third TV special One Piece episode as a subordinate of Randolph and the accomplice to Commander Governor in the past. He was murdered by Governor soon after."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jim was a normal-sized, tanned man with wavy black hair. He had an oval-shaped head and a triangular nose. He usually wore a Marine uniform. His casual attire was a blue v-neck shirt with a dark blue arm band."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jim was a fairly devious and treacherous person, as he chose to make illegal deals with pirates to attain success in the Marines."}, {"type": "paragraph", "text": "Despite this, Jim's true dream was to be successful in the Marines and attain fame."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "It is unknown what kind of physical abilities Jim possessed. He, along with Governor, was quite good at strategy and manipulation, since the two men were able to make multiple deals with pirate crews."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Jim was a subordinate of Randolph many years ago. At some point, Jim and Governor developed a friendship and decided to work to become the most famous Marines. Their methods of achieving those aspirations, however, involved making illegal deals with pirates. After one deal, Jim was counting money when Governor shot him in the head and murdered him."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Anime — Episode Special 3, Jim makes his debut.", "elements": []}, {"text": "↑  One Piece Anime — Episode Special 3, Jim's name was given at the ending credits.", "elements": []}, {"text": "↑  One Piece Anime — Episode Special 3, Jim is murdered by Governor.", "elements": []}]}], "images": []}]}