{"sections": [{"title": "Kerodeek", "level": 1, "content": [{"type": "paragraph", "text": "Kerodeek is a member of the Red Arrows Pirates who appeared in the sixth One Piece movie. He is also a member of the speedboat running group within the crew, the Four Wise Men."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kerodeek is a small, old man with pale skin, a small mouth, and a wrinkled forehead. He wears large glasses, a beige jacket, blue pants, and white gloves. On his head, he wears two-tone green frog hat that has a plant sprout sticking out of the top. The eyes on the hat are half shut, referencing Kerodeek's original tiredness. He is usually seen carrying a hammer and has another one on his back."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kerodeek can be quite absent minded at times, since he stated he wanted a nap when confronted by the Nami during the announcement of the race. Despite this, he is very cruel and vicious against other pirates like the rest of his crew. He enjoys watching members of other crews fight and wants their friendships to end."}, {"type": "paragraph", "text": "Kerodeek also gets intimidated easily by strong pirates like Zoro and Sanji. When the two pirates ignored Kerodeek and his partner, Keroshot, the Wise Men became annoyed and enraged."}, {"type": "paragraph", "text": "Kerodeek shares a unique laughter style, \"Kerokerokero\", with the rest of the Wise Men. This style is a play on the similar start to their names."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Kerodeek's physical abilities, but he is skilled at speedboat racing and fixing ships."}], "images": []}, {"title": "Ship Building", "level": 3, "content": [{"type": "paragraph", "text": "Kerodeek is quite skilled at ship building, since he could repair his speedboat in a matter of seconds. His skill is show not only in the speed of his repairs, but the modification he made. He equipped his speedboat with a variety of weapons and guns, and his third modification allowed the speedboat to hover over the water and plow through stone bridges with ease."}], "images": []}, {"title": "Speedboats", "level": 3, "content": [{"type": "paragraph", "text": "Kerodeek is a fairly skilled speedboat driver and works well with his speedboat partner, Keroshot, who use their skills of driving, ship building, and marksmanship together to battle their opponents. Despite this, they were easily defeated by Zoro and Sanji."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Many years ago, Kerodeek joined the Red Arrows Pirates. They sailed on the Grand Line back when Gol D. Roger was still alive. At some point, there was a terrible storm that killed Keroko and the rest of the crew, leaving Omatsuri alone. Eventually, the lonely captain arrived on Omatsuri Island and met the Lily Carnation, which he used to revive Kerodeek and the rest of the crew. Since then, they have been attracting pirate crews to the island to break them up and feed them to the plant monster."}], "images": []}, {"title": "Baron Omatsuri and the Secret Island", "level": 3, "content": [{"type": "paragraph", "text": "When he was introduced, Kerodeek and his fellow Wise Men were standing on podiums and Omatsuri announced that they would be the representatives for the speedboat race against the Straw Hat Pirates.Nami laughed at this, since she thought they were weak due to their age and size. Kerodeek asked if he could take a nap while the rest of the Men insulted her, upsetting Nami."}, {"type": "paragraph", "text": "During the race, Kerodeek and Keroshot were in a speedboat against Zoro and Sanji. Kerodeek drove the boat as Keroshot fired at the disgruntled young pirates, causing Zoro and Sanji to panic. The Wise Men sped far past them in a ploy to win the race."}, {"type": "paragraph", "text": "As the bickering Straw Hats caught up to Kerodeek and and his partner, Keroshot engaged an arm mechanism to try and catch Zoro. The young swordsman sliced it to pieces and frightened the Wise Men. Zoro then tried to make another attempt, but Keroshot fired at them again. Zoro dodged the bullets and jumped in and out of the boat, rocking it and frustrating Sanji. During their subsequent argument, Kerodeek and his partner snickered over the Straw Hats dispute. Kerodeek took a turn and veered away from the Straw Hats, frustrating Zoro and Sanji. When they met again with the Straw Hats during the race, Zoro and Sanji were arguing for another time and ignoring the Wise Men, angering them. As Kerodeek manned the speedboat, Keroshot tried multiple times to shoot them. Zoro sliced up their speedboat, and Kerodeek jumped out and fixed it. Now returning with a souped-up boat, Keroshot tried to fire again, but Sanji kicked their speedboat to pieces. Again, Kerodeek got out and fixed it to be even stronger. Returning again with a massive speedboat that hovered above the water and had a giant drill on the front, they tried to sink the Straw Hats' boat. Zoro and Sanji worked together the destroy the ship and ensnare the Wise Men in the rings. Later, while Kerojii was fighting Zoro and Sanji, Kerodeek, his partner, and Keroko laughed at the Straw Hats struggle."}, {"type": "paragraph", "text": "After Lily Carnation was killed, Kerodeek turned into a plant."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Zoro_and_Sanji_Defeat_Kerodeek_and_Keroshot.png/revision/latest/scale-to-width-down/210?cb=20131104215148", "caption": "Zoro and Sanji defeat Kerodeek and Keroshot."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Four Wise Men vs Straw Hat Pirates", "elements": [{"text": "Kerodeek and Keroshot vs. Roronoa Zoro and Sanji", "elements": []}]}]}], "images": []}]}