{"sections": [{"title": "Scarlett", "level": 1, "content": [{"type": "paragraph", "text": "Scarlett was the first daughter of the Riku Family and the former crown princess of Dressrosa until falsifying her own death. She was the elder sister of Viola, Kyros' wife and Rebecca's mother. She was killed by Diamante when Donquixote Pirates took over Dressrosa ten years ago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Scarlett looked very similar to Rebecca, wearing her pink hair in a braided ponytail with two pieces hanging down from the sides. She sported a light colored button up dress with frills at the bottom during Rebecca's flashback when they were at the Flower Field."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/de/Scarlett_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180906161758", "caption": "Scarlett's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Scarlett cared very much for her daughter and tried desperately to protect her, taking her away from the violence that went on in Dressrosa when Doflamingo took over. She was a kind person as she once told her daughter not to hurt anyone. Scarlett often show kindness for the dwarves when they would get yelled at by her father for their mischief, bringing them treats to cheer them up. Another sign of her love for Rebecca was when she risked her life to get food for her, which led to her own death."}, {"type": "paragraph", "text": "Though originally skeptical and distrusting about Kyros' redemption due to his past as a murderer, she came to see him as a good man after he rescued her. She fell in love with him, which led her to willingly give up her status as a princess. Falsifying her own death in order to elope with the man she loves and avoid a scandal, she chose a modest life in a simple cottage with her husband and daughter."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "After Kyros became the captain of the Dressrosa army, a sixteen-year-old Scarlett voiced her disapproval, still viewing Kyros as a murderer and could not understand why her father, Riku Doldo III, accepted him. After Kyros rescued her from abduction by pirates despite how harshly she treated him, Scarlett fell in love with him. Wanting to be with Kyros, Scarlett left the royal family by faking her death. She lived together with Kyros in a flower field outside the kingdom and they later conceived a child, whom they named Rebecca. Scarlett lived a happy life with her family while Doldo and Viola would come visit every once in a while. She used to pick flowers together with her daughter and then sell them in town."}, {"type": "paragraph", "text": "During the Donquixote Pirates' takeover of Dressrosa, they saw the palace burning. Before he went to the palace, Kyros told Scarlett and Rebecca to wait for him at the Red Flower Field. Later Scarlett and her daughter were attacked by a group of armed men led by Diamante. They managed to escape thanks to the help of Kyros, who had been transformed into a toy known as Thunder Soldier. Because of his transformation, Scarlett and Rebecca lost all memories of him."}, {"type": "paragraph", "text": "After two days on the run, Rebecca grew hungry and asked her mother for food. Scarlett decided to go into town to buy food and asked Rebecca to stay at the flower field and wait for her. Unfortunately, while getting food, Scarlett was ambushed and shot by Diamante. When Thunder Soldier came to her side, Scarlett told him to help Rebecca before dying in his arms. Thunder Soldier then returned to Rebecca with Scarlett's body and the food she wanted to give to her. Rebecca would eventually develop a stubbornness about admitting hunger after realizing that her mother died trying to get her food."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Kyros%2C_Rebecca_and_Scarlett.png/revision/latest/scale-to-width-down/220?cb=20150220030514", "caption": "Scarlett with her husband and daughter."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Kyros_Carries_Scarlett%27s_Dead_Body.png/revision/latest/scale-to-width-down/245?cb=20141206215953", "caption": "Thunder Soldier carries Scarlett's dead body."}]}, {"title": "Postmortem", "level": 3, "content": [{"type": "paragraph", "text": "Her body was buried in the flower field with a simple wooden pole surrounded by flowers marking her grave. Because of the reason for Scarlett's death, Rebecca would deny her hunger even if her stomach would growl in pain."}, {"type": "paragraph", "text": "Ten years after her death, Kyros, who returned to his human form, sought vengeance on Diamante for killing his wife. When Kyros defeated Diamante in the Flower Field, Diamante fell head first onto the stake that served as Scarlett's grave marker. Her husband and daughter then sat in front of the grave, reminiscing about their past and placing flowers around it."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 721 and Episode 651.", "elements": []}, {"text": "↑  One Piece Anime — Episode 650, Rebecca's short flashback in the gladiators' prison is extended to show her mother.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 74 Chapter 742 and Episode 675, She is revealed to be the former princess of Dressrosa.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 87.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 74 Chapter 735 and Episode 667.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 74 Chapter 739.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 721 and Episode 651.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 76 Chapter 753.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 78 Chapter 777 (p. 3-5) and Episode 717, Diamante falls onto Scarlett's grave marker.", "elements": []}]}], "images": []}]}