{"sections": [{"title": "Pato", "level": 1, "content": [{"type": "paragraph", "text": "Pato is a character from the One Piece: Unlimited World Red game. He was designed by Oda. He is a pen that \"ate\" the Inu Inu no Mi, Model: Bake-danuki and belongs to Patrick Redfield."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pato is a pen that takes the form of a short raccoon dog with tan fur. He has dark brown patches around his eyes and on his ears and a red nose. His tail is large and bushy, with brown and gold stripes on it. He wears a pink jacket with leaves on it that is buttoned with a yellow button at the top and is open at the bottom, exposing his belly button. He also wears blue pants. He seems to wear his hood up all the time."}, {"type": "paragraph", "text": "Pato bears a strong resemblance to Chopper's Brain Point appearance, since they are both very small, but have large heads."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ec/Pato_Pen.png/revision/latest/scale-to-width-down/180?cb=20130927201148", "caption": "Pato in his pen form."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pato is quite forgetful, having to be reminded about things repeatedly. He is also very kind and optimistic, helping the Straw Hats out of good will. He's shown to have a big respect for Patrick Redfield calling him Boss Red (レッド親分, Reddo oyabun)."}, {"type": "paragraph", "text": "Like many other characters, he has his own unique laughter style, \"Nukiki\", which is a pun on the kind of animal he is, a tanuki (raccoon dog)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Though Pato's physical strength is unknown as he has never fought anyone, he seems to have very high stamina, since he was kicked by Patrick Redfield across Trans Town into a building and was soon on his feet again."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Due to his Devil Fruit ability, Pato has the ability to transform into a bake-danuki from his original pen form, although he is usually in his zoan form."}, {"type": "paragraph", "text": "Pato has the ability to transform leaves into different objects or people by writing on them. When in his transformed state, he can use the tip of his tail to write."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/05/Inu_Inu_no_Mi%2C_Model_Bake-danuki_Infobox.png/revision/latest/scale-to-width-down/200?cb=20130929013736", "caption": "Pato uses his tail to write on a leaf."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, Pato and Redfield met and became friends. They were separated when Redfield was incarcerated in Impel Down."}, {"type": "paragraph", "text": "Later, he encountered the Straw Hat Pirates, who allowed them to travel with him until he found his \"friend\"."}], "images": []}, {"title": "Unlimited World Red", "level": 3, "content": [{"type": "paragraph", "text": "As Pato and the crew approached Trans Town, he thanked the crew for allowing him to travel with them. They all seemed sad that their time together was soon to end, wishing him well. When they docked on at the island, they split up, the crew leaving to do various things while Pato went to look for Redfield."}, {"type": "paragraph", "text": "Pato rushed to Luffy, telling him that the rest of the crew had been kidnapped. He took Luffy to Punk Hazard where they encountered Vegapunk's dragon. After Luffy defeated the creature, it disappeared. When Pato was asked where it went, he nervously stated that a horned man came and stole it. He then follows Luffy to the snowy side of the island where they encounter Caesar Clown. Pato tells Luffy that he had kidnapped some of his crew, causing Luffy to attack Caesar. After Luffy defeated him, Pato found Zoro and Franky. They all returned to Trans Town to discuss what happened."}, {"type": "paragraph", "text": "Soon after returning, Pato and the others noticed that the town was plagued by sandy winds. They traveled to a desert to investigate where they found Crocodile. They chased him to a palace in the desert, finding Usopp and Chopper along the way. They also stopped by a shallow hole in the sand, and Pato and Chopper used their Devil Fruit abilities to dig up water. They arrived at the palace, defeated Crocodile, and returned to Trans Town. Pato tried to tell his friends something but was interrupted by the sound of the Sea Train."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Similar to Edward Newgate and Perona, his laughing style came from his Devil Fruit, as nuki is probably a reference to his power to turn in a Bake-danuki.", "elements": []}, {"text": "His resemblance with Chopper might be considered ironic as he is mostly mistaken as a raccoon (tanuki in japanese).", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  http://www.bandaigames.channel.or.jp/list/opuw/story/ch02.html", "elements": []}]}], "images": []}]}