{"sections": [{"title": "Galdino", "level": 1, "content": [{"type": "paragraph", "text": "\"Loan Shark\" Galdino, alias Mr. 3, is a former officer agent of Baroque Works, alongside his partner Miss Goldenweek. He is currently a member of the Buggy Pirates."}, {"type": "paragraph", "text": "He was the main antagonist of the Little Garden Arc, and one of the central characters from Miss Goldenweek's \"Operation: Meet Baroque Works\", along with the rest of Baroque Works Officer Agents."}, {"type": "paragraph", "text": "After being sent to Impel Down, he escaped with the assistance of Buggy and Monkey D. Luffy, being one of Luffy's main allies during the Impel Down Arc and later during the Marineford Arc. When the war ended, he became a member of the Buggy and Alvida Alliance. After Buggy became a Shichibukai, the alliance evolved into the Underworld Organization known as Buggy's Delivery, of which he is currently a part of."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "When he first appeared, Galdino was an average-sized man with a rather frail-looking build. Like other male Baroque Works agents, Mr. 3 has his number hidden somewhere on his costume. For Mr. 3, he has 3's visible on his vest design, upper part of his glasses, and one big 3 achieved through his top knot. He also wears glasses and has neatly combed hair. He was also seen wearing a Log Pose on his left wrist. As a small form of comical relief, his hair seems to form various shapes according to the situation (like an \"!\" when he got scared or a \"?\" when he heard about Luffy for the first time and asked who Luffy was during the Little Garden arc, and even an arrow pointing to where he was talking about during the Impel Down Arc)."}, {"type": "paragraph", "text": "Later, like most Impel Down prisoners, he wears a striped prisoner's outfit, with his top knot sagging and his right lens of his glasses cracked. His hair became untidy and he grew a beard due to the roughness of the Beast Hell he was placed in."}, {"type": "paragraph", "text": "After the escape, he changed to a black pair of pants, and adorned a cloak over his attire. In an attempt to save Ace, Galdino disguised himself as an executioner, and somehow made himself look slightly more muscular."}, {"type": "paragraph", "text": "After the war he trimmed his hair back to its original length, but kept his beard. He is also seen wearing a orange button collar shirt and brown pants."}, {"type": "paragraph", "text": "When Galdino uses his Candle Champion technique, he gains a incredible change in size. The suit is white; however, with Miss Goldenweek's painting abilities, the suit could be colored, as shown during the Little Garden Arc."}, {"type": "paragraph", "text": "After the time-skip, not much has changed about Galdino except that he has grown a full mustache. He also currently wears a white shirt with suspenders and a red bowtie."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Galdino thinks very highly of himself, and is not afraid to show it. He believes himself to be a master of strategy, using his intellect and total lack of scruples to complete his plans. This statement is at least partly true, since Crocodile himself admitted that although Mr. 4 and Miss Merry Christmas were stronger than Galdino, he had been assigned a higher rank due to his intelligence."}, {"type": "paragraph", "text": "He also thinks of himself as a great artist, using his wax powers to turn his victims into \"living statues\" for his former partner, Miss Goldenweek, to paint over."}, {"type": "paragraph", "text": "However, when presented with situations in which he has to fight for his life, he reveals himself as little more than a coward who fears fighting (such as when a rage-filled Brogy was close to completely shattering his wax bonds)."}, {"type": "paragraph", "text": "He is also somewhat sadistic, as he prefers killing people after making them perfect human sculptures in a long and painful process, rather than killing them directly. During his fights, he prefers to prevent opponents from attacking him by trapping their body parts with his Devil Fruit."}, {"type": "paragraph", "text": "Galdino also likes tea and especially the Earl Grey."}, {"type": "paragraph", "text": "However, he apparently had some unexpected changes while in Impel Down. While he was a coward before, Galdino risked his life to repay a debt to Luffy by blocking a torrent of deadly poison. He also admits that if he is not careful, he could end up viewing Luffy as a friend. After Bentham sacrificed himself to save the escapees, he was clearly very upset and admitted that he did not think Bentham was really all that bad. This eventually results in Galdino attempting to free Ace on his own accord, stating that he wants to avenge his fallen comrade and fulfill Bentham's last wish, risking his life for a second time in doing so."}, {"type": "paragraph", "text": "Like many other characters, Galdino has a distinct speech style. He tends to end his sentences in \"gane\", for example: \"omae mo-gane\" (you too gane) or \"warau-gane\" (laugh-gane). Like many catchphrases in the series, it has no actual meaning other than a distinct way of talking."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Baroque Works", "level": 3, "content": [{"type": "paragraph", "text": "He and his partner, Miss Goldenweek, had a relationship standard of most Baroque Works pairs. While he greatly appreciated her help with her painting skills, he would also grow annoyed from time to time when she would easily give away information. She would also paint his wax sculptures for him."}, {"type": "paragraph", "text": "He thinks lowly of those who are beneath him in rank. He openly showed distaste for Mr. 5, upon learning of his defeat in Whisky Peak. He saw Mr. 5 as a fool who relied more on the power of his Devil Fruit, and should have been more tactful. He also wished for the downfall of those above him in rank as well so as to benefit him with a promotion, making him antagonistic to the other Officer Agents."}, {"type": "paragraph", "text": "Though formerly a loyal subject to Crocodile, Mr. 3 began to hate and fear him after Crocodile attempted to murder him by feeding him to the Bananawani. Ever since, the mere sight of Crocodile fills him with terror."}, {"type": "paragraph", "text": "While initially viewing Mr. 2 Bon Kurei as an idiotic nuisance, the okama's actions in Impel Down deeply moved Mr. 3; he felt that his actions in Marineford helped avenge, as he put it, his \"fallen friend\"."}], "images": []}, {"title": "Buggy", "level": 3, "content": [{"type": "paragraph", "text": "Galdino and Buggy teamed up in Impel Down in order to escape the Great Prison, and sharing a hatred for Luffy, quickly became friends. However, they usually found that their attempts to escape without the assistance of Luffy and his allies proved fruitless, and it was only through Luffy's help that they managed to break free."}, {"type": "paragraph", "text": "During their time side by side in Impel Down, Galdino acted as the more cautious of the two, frequently warning Buggy of the dangers that the two of them have triggered throughout the course of their escape from the prison; in the anime he has, on more than one occasion, had to do things himself to ensure Buggy's safety as well as his own, using his wax to supply themselves with convenient implements to fend for their lives with. Galdino was deeply shocked to learn that Buggy was once a member of the Roger Pirates and was good friends with Shanks, questioning his cowardly nature if that was true. After Buggy gains his blindly loyal followers, Galdino remains the only one who can see through Buggy's courageous façade and wonders how far he can take it."}, {"type": "paragraph", "text": "After the Battle of Marineford, Galdino stayed with Buggy and joined his crew along with the other escaped Impel Down inmates. Though his exact position within the crew is unknown, he appears to be one of the high-ranking members given his friendship with Buggy and the fact he is seen eating with the other high-ranking members of the Mohji, Richie, Cabaji, and Alvida. Presumably he was pardoned like the other Impel Down escapees that joined Buggy's crew, due to Buggy becoming a member of the Shichibukai. This also makes him a member of Buggy's Delivery, the pirate mercenary group founded by Buggy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Mr._3_joins_with_Buggy.png/revision/latest/scale-to-width-down/210?cb=20171002075940", "caption": "Galdino and Buggy team up to escape Impel Down."}]}, {"title": "Monkey D. Luffy", "level": 3, "content": [{"type": "paragraph", "text": "Mr. 3 was initially antagonistic to Luffy, after ambushing his new giant friend Dorry and causing him to almost die. Mr. 3 scoffed at Luffy's approach of following blind instinct, but was nonetheless defeated by that very same instinct."}, {"type": "paragraph", "text": "The two met up again in Impel Down, where Galdino seemed to forgive Luffy for his past actions against him. While initially showing cowardice in the walls of Impel Down, it was Luffy's actions that helped motivate Galdino to become more active in freeing all of the escapees from the Great Prison, a task that would've been impossible without him and his wax. He assisted Luffy in holding off Magellan long enough for Jinbe, Mr. 1, Crocodile, and Buggy to abscond with a ship."}, {"type": "paragraph", "text": "He later helped Luffy by disguising as one of the Marines on the scaffold attempting to execute Ace, as well as being one of the many shocked at the revelation of the world's most infamous criminal Revolutionary Dragon being Luffy's father. After being knocked out by Luffy's Haki, he awoke to see that Luffy's key had been broken by Kizaru. He helped by crafting a key of wax, and it was that act that finally freed Ace from his shackles."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Prior to the fall of Baroque Works, Mr. 3 was amongst the top-ranked members of the criminal organization, and presumably had a number of Billions (the lower ranked subordinates of Baroque Works Officer Agents) under his command."}, {"type": "paragraph", "text": "He is also highly artistic and detailed, capable of perfectly replicating the physical structure of a human being with just a visual in mind. "}, {"type": "paragraph", "text": "Crocodile only allowed Mr. 3 to hold his position in the organization as \"Mr. 3\" because Mr. 4 was too mentally slow. Otherwise, he would have been ranked lower. In Impel Down, he proves his overall lack of fighting spirit on a number of occasions; this was further proven when he fainted under Luffy's burst of Haki, though he did wake up for some time after that on his own. He acted like a coward and backed up Buggy's escape plan rather than Luffy's much more dangerous advancement to the lower levels. After Magellan showed up on the fleeing group during their escape, Galdino showed a moment of bravery, but he admitted he could only hold it together for a brief moment."}, {"type": "paragraph", "text": "In spite of his cowardice, Galdino seems to have some skill in stealth and infiltration."}], "images": []}, {"title": "Master Tactician", "level": 3, "content": [{"type": "paragraph", "text": "Galdino's tactical intellect is his greatest asset, opportunistic by nature, Galdino prefer to use cunning wits to outsmart and defeat enemies, this was shown when he manipulate everlasting battle between the giants Dorry and Brogy so as to obtain at least one 100,000,000 bounty without the need to engage in any physical combat. "}, {"type": "paragraph", "text": "He is very observant with a strong sense of danger as he noticed something was amiss in Impel Down's Level 4, after he and Buggy accidentally ended up in Level 4 with Bentham and Luffy. He noticed the guards were moving in formations and that no one was feeding the fires nor were any of the prisoners trying to escape. As a result he cautioned Buggy on following Bentham and Straw Hat to the Kitchen, fearing the possibility of a trap and told Buggy they had to check the exits, suspecting the possibility of Warden Magellan appearing to restore order to the prison and capture Luffy which is proven when Magellan personally appeared to stop Luffy."}, {"type": "paragraph", "text": "While working together, he and Buggy were able to bypass many of Impel Down's surveillance systems after abandoning Bentham in Level 5. This was further elaborated during the Marineford Arc, where he demonstrated being clever enough to avoid Aokiji's freezing powers by substituting himself with one of his wax statues without the admiral noticing, and then later succeeding at impersonating one of Ace's executioners in his secret attempt to free the 2nd Division Commander."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Galdino ate the Doru Doru no Mi, a Paramecia-type Devil Fruit which allows him to tap infinite amounts of a special candle wax from his body. He can manipulate this wax to form any shape he desires, control its motion in both liquid and hardened states, and harden it to become as strong as steel."}, {"type": "paragraph", "text": "He usually crafts artistic weapons with such wax, which, when used at its maximum peak, was strong enough to take down a pirate with a bounty of 42,000,000. The hair shaped like a 3 on his head, much like a candle (since he is a literal \"Candle-man\"), produces a flame whenever he uses his ability, and also seems to grow larger when he exerts himself more to create a large amount of wax, like with his gigantic Candle Set."}, {"type": "paragraph", "text": "One of the most invaluable abilities granted by his wax is that he can use it to create keys to open prison cell doors and shackles, even if they are made of Seastone. His wax's resilience to acid and abilities to form keys proved instrumental in the events at Impel Down, helping Luffy hold off Magellan and helping Buggy free the prisoners, as well as in Marineford, protecting and freeing Ace."}, {"type": "paragraph", "text": "His ability's weakness is fire and extreme heat, which melts his wax and makes it useless. While fire melts the wax instantly, under heat Galdino seems to be able to keep the wax's form steady for a few seconds, which is helpful when Luffy needed to use Galdino's Candle Lock to beat Minotaurus in Impel Down."}], "images": []}, {"title": "Ship", "level": 3, "content": [{"type": "paragraph", "text": "Mr. 3 owned a personal ship during his career in Baroque Works. He used this ship to arrive discreetly to Alabasta and to escape Mr. 2 Bon Kurei's vigilance. It's a small boat with 3 as a figurehead. It also has the Baroque Works Jolly Roger as the flag. Nefertari Vivi mentioned that it is powered by his Doru Doru no Mi powers, although the exact method has yet to be explained. It likely functions similarly to Smoker's Billower Bike in that his wax flows around an axle to rotate the paddles."}, {"type": "paragraph", "text": "It first appeared in Chapter 158 and Episode 93, and was later seen in the Baroque Works Mini-Series. What happened to it after Mr. 3 was arrested and sent to Impel Down is unknown, but it is unlikely that he is still using it, as he is now onboard Big Top."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c7/Galdino%27s_Baroque_Works%27_Ship.png/revision/latest/scale-to-width-down/250?cb=20130922081407", "caption": "The ship that Mr. 3 used when he was a Baroque Work agent."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Galdino's past remains unknown. However, at some point he ate the Doru Doru no Mi and he joined the Baroque Works."}, {"type": "paragraph", "text": "He also took down a criminal with a 42,000,000 bounty."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Little Garden Arc", "level": 4, "content": [{"type": "paragraph", "text": "While on Kyuka Island, Mr. 3 was enjoying his vacation break when his partner, Miss Goldenweek, complained that she was bored. He then told her to just enjoy her break and asked that she refrain from referring to him by his codename in public. Afterwards, he noticed that she had been staring at a piece of paper and asked her what she was doing. She replied that she was staring at the orders they had received from their boss a few days earlier. Mr. 3 then erupts into anger that Miss Goldenweek had not informed him of their new orders, which were to search out the Straw Hat Pirates who had beaten Mr. 5."}, {"type": "paragraph", "text": "Some time later, the duo arrived at Little Garden. Mr. 5 and Miss Valentine then arrived on the island and entered Mr. 3's wax house. Inside the hideout, Mr. 3 and Miss Goldenweek had been expecting the two while drinking tea. Mr. 3 mocked his fellow officer agents for their failure to kill Vivi, putting their organization in danger. As a second chance, he offered them to complete a job or to be killed by him. Besides killing the Straw Hats, the job consisted of capturing the two giants, Dorry and Brogy. The bounties they had before starting their fight a hundred years ago were still valid and capturing them would allow them to collect a 200,000,000 bounty. It was revealed that in order to accomplish their plan, Mr. 3 had ordered Mr. 5 to place a bomb in the rum that Dorry and Monkey D. Luffy were drinking.. Elsewhere, Zoro realized that he was lost, when he spotted what appeared to be Nami; however, meanwhile, the real Nami and Usopp had been running from a dinosaur when she spotted what appeared to be Luffy."}, {"type": "paragraph", "text": "After defeating Dorry, Brogy was ecstatic, though Luffy, knowing that the duel was rigged, was angry and demanded to know who the real culprit was. Mr. 3 then revealed himself to Brogy and asked why he was crying, to which Brogy demanded to know who he was, which prompted Mr. 3 to introduce himself and exclaimed that the giant had already been captured. When Brogy moved to take a step forward, it was revealed that he had been immobilized by wax. Meanwhile, back at Dorry's camp, Mr. 5 and Miss Valentine showed up and Luffy realized it was them that they had planted the bomb. They also revealed that they had captured Karoo and intended to use him to separate Vivi from Luffy. Angered by their lack of morals, Vivi and Usopp attacked the duo, only to be defeated easily.In the meantime, Mr. 3 had completely defeated Brogy and announced that he would make a masterpiece out of him."}, {"type": "paragraph", "text": "Mr. 3 then told Brogy how he had helped him out during his fight with Dorry by using explosives, of which angered Brogy. Vivi was then delivered to Mr. 3, at which point she insulted him for his crude ways and sabotaging the fight. He then began to make a giant candle to wax his captives. Brogy then stated that at the beginning of the fight he knew something was wrong, and at that point, he attempted to attack Mr. 3, only to be taken out by Mr. 5's bomb attack."}, {"type": "paragraph", "text": "While Brogy tried to get back up, Mr. 3 realized he needed to use more force to keep him down and he stabbed him with wax swords in his hands and his feet, immobilizing him completely. He then increased the speed of his candle technique and he explained that the Straw Hats would be turned into a group of wax statues, preserving the look of horror on their faces forever. Brogy then tried to get up once more but failed, and Zoro, inspired by his attempt, resolved to cut off his own legs to escape, and his resolve inspired Brogy to try one last time to get up. Fortunately Luffy, Karoo and Usopp arrived before they went through with it and vow to defeat the Baroque Works' agents, with Zoro asking Luffy to destroy the candle to which he agreed, but Mr. 3 saying that he would not let him."}, {"type": "paragraph", "text": "Zoro switched his pose to one more awesome, just in case he got turned into wax, and Miss Goldenweek pointed out to Mr. 3 that the prisoners were not showing fear, which annoyed him. Luffy then prepared to fight, to which Mr. 3 accepted his challenge. Luffy then started attacking but he was quickly caught in a candle lock, but he used it to his advantage by making it into a hammer technique which he used to destroy the candle. However, this did not stop the waxing process and Mr. 3 continued his attack, but Usopp interrupted with an explosive bullet, but it was eaten by Mr. 5. Luffy continued his assault but Mr. 3 also continued his attacks as well, though Luffy beat him. But then he became strangely uncooperative as Miss Goldenweek activated her \"color trap\"."}, {"type": "paragraph", "text": "Mr. 5 and Miss Valentine explain that Luffy is under the spell of \"color trap\". Vivi then tricked Luffy into getting out of the trap which returned Luffy to normal, unfortunately he then got caught in another of Miss Goldenweek's traps, while Nami, Zoro and Vivi looked on in horror of their impeding doom. Meanwhile Mr. 5 and Miss Valentine were still chasing Usopp and Karoo, who freed Luffy from his trap but he was once again unable to combat Miss Goldenweeks' abilities. As the fight between the two duos continued, Mr. 5 realized that he was not fast enough to catch Usopp and Karoo, while Usopp headed back to the candle and found his friends waxed. Usopp then fired at Luffy destroying his shirt and freeing him from color trap once again, but he was promptly shot by Mr. 5, which angered Luffy declaring that he would defeat them."}, {"type": "paragraph", "text": "Mr. 3 unveiled his Candle Champion technique to fight against Luffy, which Luffy found cool. He then started attacking Mr. 3, though his candle champion technique proved a formidable match, while Usopp realized a way to free his friends and he tried to free them, but he was stopped by Mr. 5 who bombarded him. He gave Karoo a piece of rope and some instructions, but he was overheard by Miss Valentine who then began by testing how much weight he could take. Luffy suddenly grabbed Mr. 3's hair and used his hair to light Karoo's rope, which was covered in oil, on fire."}, {"type": "paragraph", "text": "The fire from Mr. 3's hair ignited the oil covered rope and creates a furnace, freeing the waxed Zoro, Vivi, Brogy, and Nami. Mr. 3 began to run away to which Luffy ran after him. Meanwhile, the other agents were defeated. Luffy was angry at Mr. 3 for destroying the pride of the giants' battle, and finally came across a multitude of Mr. 3's, but Luffy used his instincts and picked out the real Mr. 3, beating him once and for all."}, {"type": "paragraph", "text": "At Mr. 3's wax house Sanji had a phone call with Mr. 0 and he pretended to be Mr. 3. He informed Mr. 0 that he had killed Vivi and the Straw Hats much to the pleasure of Mr. 0 who informed Sanji that the Unluckies will be at Little Garden shortly to deliver him an eternal log pose to Alabasta. The Unluckies then arrived and attack Sanji who quickly defeated them, and told Mr. 0 that one of the Straw Hats was still alive but that he finished them. This angered Mr. 0 and he hung up, and he then informed Miss All Sunday to send Mr. 2 Bon Kurei to Little Garden to assassinate Mr. 3 for giving him a false report."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Mr._3_Meets_5_and_Valentine.png/revision/latest/scale-to-width-down/230?cb=20121128223001", "caption": "Mr. 3 meets up with Mr. 5 and Miss Valentine."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Mr._3_Traps_Zoro%2C_Vivi%2C_Nami%2C_and_Brogy.png/revision/latest/scale-to-width-down/230?cb=20130308034702", "caption": "Mr. 3's art work."}]}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "He later showed up in Alabasta and had arrived at Spiders Cafe to group up with his fellow officer agents. However, instead of revealing himself, he hitched a ride behind Banchi's carriage and went along with them to the Baroque Works hideout."}, {"type": "paragraph", "text": "After Crocodile revealed Operation Utopia to the officer agents gathered, Mr. 3 came out of hiding and interrupted the meeting. Crocodile then allowed him to speak and so, Mr. 3 asked for a second chance after failing to carry out his orders. Upon hearing this, Crocodile questioned him about what he meant, to which Mr. 3 then revealed that Vivi and the Straw Hats were still alive. Upon seeing Crocodile's anger, Mr. 3 tried to explain that the intelligence he was given was wrong. Mr. 3 then asks for a second chance at killing them, but before he could continue speaking, Crocodile grabbed him by the neck and sucked the moisture out of him. Afterwards, Crocodile opened a trap door and dropped Mr. 3 into the tank of Bananawanis for their meal. In the tank, Mr. 3 looked around and wondered he had fallen. He then noticed the Bananawani approaching him."}, {"type": "paragraph", "text": "Later, when Sanji kicked a Bananawani to save his crew and retrieve the key to their cage from inside its stomach. From inside the Bananawani, however, out came a ball of wax, which is revealed to have been created by Mr. 3's powers to encapsulate himself in wax while in the gator's stomach. Upon escaping, Mr. 3 quickly drank some of the water leaking everywhere to hydrate himself. Then, Sanji demanded that Mr. 3 hand over the key to the cage, but instead, Mr. 3 threw the key. Upon being alerted by Usopp of Mr. 3's abilities, Sanji forced Mr. 3 to make a wax key. Sanji then knocked Mr. 3 unconscious. When Crocodile returned, he saw Mr. 3's body floating around in the water."}, {"type": "paragraph", "text": "During Vivi's speech when the Straw Hats were leaving Alabasta, Mr. 3 managed to escape, and he could be seen in the crowd listening to her in Rainbase."}], "images": []}, {"title": "Miss Goldenweek's Mini Story", "level": 3, "content": [{"type": "paragraph", "text": "Afterwards, Mr. 3 is shown on Kyuka Island where he is needed to turn himself in to free Miss Valentine. However, Mr. 3 decides to escape on his ship and save himself, but is stopped by Mr. 2. Despite being defeated by Mr. 2, Mr. 3 manages to escape, so Mr. 2 is forced to disguise himself as Mr. 3 to free Miss Valentine. However, Mr. 3 is later caught off-screen and is sentenced to Impel Down with Crocodile, Mr. 1, and Mr. 2."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Galdino was revealed to have been residing in Level 2 of Impel Down, appearing more ragged and with facial hair than he had prior to his sentencing, and apparently given up on hope of surviving within his confines."}, {"type": "paragraph", "text": "When Luffy and Buggy entered Level 2 and defeated the Basilisk, Buggy decided to release the prisoners in order to cause a riot. Galdino saw his chance and went out, where he addressed them and said that he would repay the debt for letting him out by helping them to Level 3. However, once he heard that Luffy was intending to go down instead of up to Level 1, he attempted to back out of the deal, but reconsidered once he realized that the Level 3 stairwell would also lead back up to Level 1."}, {"type": "paragraph", "text": "He then conspired with Buggy to ditch Luffy so they could escape, but a Sphinx blocked their way to freedom. In order to ensure that he wasn't crushed by the Sphinx, he created lots of wax copies of himself in order to trick the Sphinx, but this only resulted in the Sphinx destroying the floor, sending Galdino, Buggy, Luffy and the Sphinx plummeting straight into Level 3."}, {"type": "paragraph", "text": "With the Sphinx knocked out, Galdino explains that Level 3 is known as the \"Starvation Hell\", where the heat from Level 4 is so hot that it even reaches the one above, and the prisoners are forced to starve. Before they could go anywhere, they were captured in a Seastone-reinforced net. The guard and commander of the Blue Gorillas: Saldeath, says there is no escape, but the Sphinx, who was also captured along with the three, broke out of the net, releasing them. Galdino and Buggy climbed up and told Luffy they are ditching him to break out of prison, but Luffy gives his thanks anyway. Upon trying to find a way out, He and Buggy came across Bentham's cell, who shocked to see Galdino out of his. An embarrassed Galdino suggests that they do not let him out."}, {"type": "paragraph", "text": "Later Galdino and Buggy are mentioned to be in Level 2, but as Minotaurus landed on top of them because Luffy sent it flying, both of them had no other choice than to run. Minotaurus chased Galdino and Buggy down to Level 3 until they meet up with Luffy and Bentham. After all four of them joined up, they attacked the Minotaurus one after the other. Galdino contributed to the defeat of Minotaurus as he used his Devil Fruit powers to wax Luffy's arm so that the final blow by Luffy finished the Jailer Beast, Minotaurus, off. Only shortly after that, they realized that they were falling into the boiling point of Level 4. To their fortune, they could jump off the falling debris to land safely."}, {"type": "paragraph", "text": "When Luffy began to run in a random direction, Galdino along with Buggy and Bentham followed him as Bentham told them that there is a kitchen stuffed with food. However as Galdino and Buggy realized that there were many guards running around in order to get Luffy, they changed their mind and made up an idea to escape from Level 4. As Galdino then saw Luffy being attacked by Magellan, he could only think of getting back to Level 3 by taking down Hannyabal. Galdino and Buggy assumed that Hannyabal would be weak as he does not seem to possess a Devil Fruit, and Buggy's Muggy Balls would also be of great advantage for them. They decided to make their way to the entrance to Level 3 from Level 4."}, {"type": "paragraph", "text": "Unfortunately, they underestimated Hannyabal severely, who easily defeated them both. They were rescued by Bentham, who was disguised as Hannyabal, and he told them they needed to save Luffy, who was defeated by Magellan and taken to Level 5. Galdino is afterwards seen with Buggy and a disguised Bentham traveling down to Level 5, the Freezing Hell. However, the three of them were shocked to learn that the prisoners and a supposed Hannyabal have to discard their cloaks. As soon as they entered they saw the Wolf Unit intent to eat them. With Bentham prepared to face them, he is shown sprinting away in horror with Buggy."}, {"type": "paragraph", "text": "He is later shown alongside Buggy hiding on Level 2 using his Doru Doru powers and then making wax keys and freeing prisoners in order to cause a distraction for them to leave. Unfortunately, Magellan came to Level 2 and killed many of the rioters. He also sealed off all the entrances and exits to the level, causing Galdino to worry. Luckily, Blackbeard reopened the level and Galdino and the rioters prepared to head to Level 1. However, before they could escape out of Level 1, they were attacked by the revived Jailer Beasts, but thanks to the arrival of Luffy, Jinbe and Crocodile's group, the Jailer Beasts were quickly subdued again."}, {"type": "paragraph", "text": "Magellan quickly arrived to try to kill the group, but Galdino in a surprising move, blocked the Chief Warden's Hydra with his own Candle Wall, urging Luffy and company to escape, stating that he'd be damned if he had to keep being in Luffy's debt. As it was clear that Galdino could not actually defeat Magellan, he planned to escape, but Luffy stayed behind to back him up. Noticing his wax's defensive capabilities against Magellan's poison, Luffy asked and received a set of wax boxing gloves and boots, which he promptly used to injure Magellan."}, {"type": "paragraph", "text": "Galdino continued to hold down the fort against Magellan by creating wax barricades around some cannons until they were forced to flee from Magellan's poison golem. Galdino managed to make it out of Impel Down and onto the group's escape ship, upon which he collapsed and gave thanks to above. When Bentham sacrificed himself to enable the others' escape, Galdino was visibly stunned. He is later seen actually crying over Bentham's sacrifice and admits that he no longer actually had hard feelings towards him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Mr._3_at_Impel_Down.png/revision/latest/scale-to-width-down/250?cb=20130224142301", "caption": "Mr. 3 at Impel Down."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/56/Buggy_and_Galdino_Leading_a_Jailbreak.png/revision/latest/scale-to-width-down/250?cb=20100418095613", "caption": "Galdino and Buggy start a riot."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Candle_Wall.png/revision/latest/scale-to-width-down/250?cb=20130209010945", "caption": "Galdino uses Candle Wall to stop Magellan's Hydra."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Gomu_Gomu_no_Gigant_Stamp.png/revision/latest/scale-to-width-down/210?cb=20121229105719", "caption": "Galdino helps Luffy fight Magellan."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later, the Marines called the escape ship and revealed that Buggy was once part of the Pirate King's crew and is good friends with Shanks. Galdino wondered why Buggy is such a coward, if all that is true. When Luffy and the others reached the Gates of Justice, Galdino was seen to be very excited."}, {"type": "paragraph", "text": "He was later seen alongside with the other Impel Down fugitives, falling from the sky to Marineford, in order to support Luffy in Ace's rescue. He was also seen wearing a cloak and black pants over his original prisoner's striped shirt, understandably hysterical."}, {"type": "paragraph", "text": "When Buggy showed his shock at Kizaru's laser attack, then tried to hide it (of which most prisoners bought), Galdino cried out that they are so full of hope that they are half deaf. When Sengoku announced that Luffy's father is none other than Dragon the Revolutionary, Galdino was seen standing behind Buggy, both of them greatly shocked. Galdino then followed Buggy and his group as Buggy starts to execute his plan. Galdino is seen screaming when Buggy got caught by a sandstorm created by Crocodile."}, {"type": "paragraph", "text": "Later in the battle, Galdino disguised himself as an executioner and manages to approach Ace's execution ground. He's ready to free Ace and in doing so avenging Bentham, but had to abide by Sengoku's sudden order to have Ace instantly executed and pretended to do so, no doubt ready to reveal his true intention to liberate Ace at that point, leading to him being knocked out by Luffy's Haki. He regains consciousness when Luffy finally reaches the ground, just in time to protect Ace from Sengoku's attack with a Candle Wall. When Kizaru destroys Luffy's key, Galdino makes one himself with his powers, managing to free Ace from his chains in midair, but not before asking Luffy that if his reasons for helping him free Ace was to respect a comrade's (Bentham) final wishes, would he laugh at him, to which the Straw Hat said no, while the platform is destroyed."}, {"type": "paragraph", "text": "Both him and Luffy are thus saved by Ace, who protects them from the flames of the destroyed execution scaffold. Galdino is soon being dragged away by pirates while remarking that he thought that he was a goner when the Marines spotted him. Marco who wishes to support the others who are being attacked by Akainu, immediately orders Galdino to unlock his handcuffs with his ability and Marco is later seen engaging in battle with Akainu."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c3/Mr._3_Protects_Ace.png/revision/latest/scale-to-width-down/260?cb=20130224142938", "caption": "Galdino protects Ace using his Candle Wall."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Galdino is shown to be joining the Buggy and Alvida Alliance on an island in the Grand Line. He was last seen reading a message for Buggy from the World Government, telling him he would not believe what it said. It was later revealed that it was an invitation to Buggy to join the Shichibukai."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After Buggy is appointed a member of the Shichibukai, Galdino becomes a member of Buggy's Delivery. It is assumed that he and the rest of the escaped Impel Down convicts who joined Buggy where pardoned as a result of Buggy's Shichibukai status."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "3D2Y", "level": 4, "content": [{"type": "paragraph", "text": "Right after Buggy is made a member of the Shichibukai, the Buggy Pirates came across Luffy and Boa Hancock fighting Sebastian of the World Pirates. Galdino then informed Buggy that the World Pirates were the reason that the Shichibukai were summoned. The two then plotted to take credit for World's potential defeat at the hands of Luffy, and although he was initially worried, Galdino happily agreed with Buggy's backup plan of alerting the Marines and fleeing just in case anything went from."}, {"type": "paragraph", "text": "When Perona defeated Sebastian, both Galdino and Buggy were surprised that she had been accompanying Mihawk. They then realized that Mihawk being there would have been great for the battle, but immediately figured that Mihawk was there to \"steal\" the credit. In response, Galdino told Buggy that they had to leave their traces in the battle to make sure that others knew that they were part of the fight."}, {"type": "paragraph", "text": "On board the ship, they watched as Byrnndi World fought Luffy. When Luffy was defeated, Galdino commented on how easily he was defeated and then asked Buggy what their next move was. In response Buggy ordered his crew to revive Luffy, but this is misinterpreted as an action of friendship, to which Galdino looked at them in disbelief at their high hopes in Buggy's character. After Luffy awakened, Galdino pointed Luffy in the direction that World went and once again stood in disbelief at the crew admiring Buggy for slapping Luffy awake."}, {"type": "paragraph", "text": "Later, the crew encountered Gairam while walking through the ship, to which Galdino noted that he did not look so friendly. They are then attacked by Gairam's Cube Booster attack. When Buggy yelled at Luffy to go fight World, his crew thought they were words of encouragement, to which Galdino yet again stood in disbelief at how they had positively interpreted Buggy's words. After Buggy told Luffy that he would take care of Gairam, Galdino questioned Buggy on how he would do so, but immediately after, Gairam attacked them with his Air Cube Booster. Before it could hit, however, Galdino used his Candle Wall and blocked the attack and then told Buggy and the crew to run. Gairam then smashed his hammer against the candle wall, which then sent Galdino falling backwards."}, {"type": "paragraph", "text": "In the middle of Buggy's battle with Gairam, Buggy tried to bring his body back together, but failed when Gairam captured his main body. In response, Galdino asked Buggy what he was going to do now, to which Buggy revealed that he still had a trick up his sleeve. When Cabaji and Mohji asked if it was the Buggy Ball, Galdino remembered that that was the thing that Buggy used to fight the Jailer Beasts at Impel Down, but an annoyed Buggy then corrected him that that was actually the Muggy Ball at Impel Down, but that he was in fact actually going to use the Muggy Ball against Gairam. Gairam was then defeated when Hancock attacked him in the smoke that was created by the Muggy Ball. A surprised Galdino and Buggy then told her which way Luffy had gone. Afterwards, the crew believed that Buggy had taken down Gairam and so, Buggy happily took credit while Galdino pondered how long Buggy could keep his ruse up for."}, {"type": "paragraph", "text": "The crew then made it outside the ship and saw a fleet of Marine ships approaching. Buggy was surprised at why the Marines were there, but Galdino quickly reminded him that he was the one that called them there. The Marines, on the other hand, did not realize that it was Buggy on the ship and were ordered by Akainu to fire. Galdino then rode on Buggy's back to escape the cannonfire as the crew withdrew back to their ship."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/Buggy_Pirates_see_Luffy_on_the_Groseade.png/revision/latest/scale-to-width-down/210?cb=20191202151947", "caption": "Galdino and the rest of Buggy Pirates surprised to see Luffy and Boa Hancock fighting together on the Groseade."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/19/Galdino_Defeated_by_Gairam.png/revision/latest/scale-to-width-down/210?cb=20190102012051", "caption": "Gairam defeats Mr. 3."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Galdino made his first appearance after the timeskip at Karai Bari Island as a part of Buggy's Delivery, where he was seen sitting behind Buggy at a feast with Mohji, Richie, Cabaji, and Alvida as they celebrated the defeat of Donquixote Doflamingo and the positive effect it had on their business. Mohji then revealed to Buggy and the crew that the New Giant Warrior Pirates had quit the dispatch company to align themselves under the flag of the Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Buggy_Showing_Off_as_His_Crew_Feasts.png/revision/latest/scale-to-width-down/235?cb=20160807115245", "caption": "Buggy's dispatch company celebrates Donquixote Doflamingo's defeat."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the abolishment of the Shichibukai system, those on Karai Bari Island were confronted by a Marine fleet led by Stainless."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mr. 3 and Miss Goldenweek vs. Monkey D. Luffy, Usopp, and Karoo", "elements": []}, {"text": "Mr. 3 vs. Crocodile", "elements": []}, {"text": "Mr. 3 vs. Sanji", "elements": []}, {"text": "Galdino, Buggy, and Monkey D. Luffy vs. Sphinx", "elements": []}, {"text": "Galdino, Buggy, Mr. 2 Bon Kurei, and Monkey D. Luffy vs. Minotaurus", "elements": []}, {"text": "Galdino and Buggy vs. Hannyabal and Impel Down Guards", "elements": []}, {"text": "Galdino, Buggy, and prisoners of Impel Down vs. Magellan (Level 2)", "elements": []}, {"text": "Galdino, Buggy, and prisoners of Impel Down vs. Jailer Beasts (Level 1)", "elements": []}, {"text": "Galdino, Monkey D. Luffy, and prisoners of Impel Down vs. Magellan (Level 1)", "elements": []}, {"text": "Galdino, Portgas D. Ace, and Monkey D. Luffy vs. Fleet Admiral Sengoku", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Galdino and Buggy vs. Gairam (interrupted by Boa Hancock)", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Mr. 3 and Miss Goldenweek's involvement in the Little Garden was removed in the 4Kids dub. To explain Mr. 3's presence in Rainbase afterwards, the story was rewritten to say that he had been following the Straw Hat Pirates since Loguetown. However, this created a plot hole since before Whisky Peak, Baroque Works did not know who the Straw Hats were. Mr. 3 was also rewritten to be a joker, telling flat jokes in almost every sentence he spoke, despite being a genius in the original storyline."}, {"type": "paragraph", "text": "In the FUNimation dub, Mr. 3 speaks with a slight English accent."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "After Aokiji's attack on Buggy and the other Impel Down escapees, Galdino manages to escape using a candle copy of himself. Later, he is seen in an underground passageway below Marineford, trying to hide from the Marines, as he thinks they spotted him. Moments later, he sees the substitute executioners for Ace's execution."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Even though a Devil Fruit user cannot swim or float in the sea, Mr. 3 is seen floating on water. Oda explained that Mr. 3 landed on a plank of \"super-floating wood\", which allowed him to stay afloat. In the anime version of this scene, a table is clearly floating beneath him to hold him up. It was revealed that the wood was in fact Kuuigosu.", "elements": []}, {"text": "His ship being powered by a Devil Fruit power is similar to the vehicles used by Logia-type Devil Fruit users. This ship is also the only one that functions from a Paramecia-type Devil Fruit power.", "elements": []}, {"text": "Galdino and Perona are the only two people known to have been affiliated with two different Shichibukai. Galdino served under both Crocodile and Buggy. Perona served under Gecko Moria and lives with Dracule Mihawk.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b0/Mr.3_floating.png/revision/latest?cb=20130217134653", "caption": "Mr. 3 floating in water in the manga."}]}]}