{"sections": [{"title": "Indigo", "level": 1, "content": [{"type": "paragraph", "text": "Dr. Indigo is an ingenious member of Shiki's crew and the secondary antagonist of the tenth One Piece Movie. He is the one who created Boss and the other monstrous animals under Shiki's dominion."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Indigo is a very tall man with a clown-like appearance. He has indigo hair, with two particularly large tufts at the side of the head, and his face is white, with purple lines near his eyes, presumably some sort of make-up. He is pot bellied, with thin limbs, and a muscular torso, making his body resemble a Volumetric flask. On his forehead he has a pair of purple round-shaped eyeglasses. He wears a large yellow polka dotted indigo scarf and indigo-striped shoes (similar to Kuro's) that make a farting noise every time he takes a step. He also wears indigo overalls that exposes his chest, with two lines of buttons on the front, and a lab coat over them. On his hands there is a pair of brown gloves. It seems that in his twenty years, he did not change much in appearance, aside from his scarf being orange with a lined pattern, and he did not wear glasses on top of his forehead."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Indigo is a doctor with an eccentric personality: he has a distinct laugh which goes \"Piro piro piro\", adorns shoes that emit sounds of flatulence whenever walking, not caring if others gets irritated by this, and also often tries to act like a mime, but usually breaks character by suddenly talking, though ironically becomes completely surprised if someone actually understood his charade type speech. He also appears to be careful, as he always carries around a vial of antidote to the Draft disease, just for precaution."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Shiki", "level": 3, "content": [{"type": "paragraph", "text": "Indigo shares a rather humorous relationship with his captain Shiki. Whenever Shiki says or does something stupid, Indigo acts as a straight man and slaps him, after which they both present themselves to others like a typical comedy duo after a joke. He also has an habit of trying to explain something to Shiki through odd movements and gestures until Shiki tells him to just come out and say it (though at one point in the movie, Shiki understood what he was trying to say much to Indigo's surprise). Regardless, he is loyal to Shiki and spent twenty years creating super-powered creatures in Merveille for the Golden Lion Pirates to take over the world. He also plays a part in Shiki's dances, along with Scarlet."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/Scarlet%2C_Shiki%2C_and_Indigo.png/revision/latest/scale-to-width-down/240?cb=20141206182713", "caption": "Scarlet, Shiki, and Indigo doing a skit."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Indigo is a chemist. He was the one in charge in the development of Shiki's scheme involving all the monstrous animals, and was the one who developed the SIQ serum. He is a strong fighter who was able to fight along side Shiki and his crew when they fought against the Roger Pirates. He is possibly a proficient swordsman, as he was seen attacking Luffy with a sword fitting his size, and wielding it during the battle in Shiki's palace."}, {"type": "paragraph", "text": "Indigo is also a skilled dancer, taking part in all of his captain's little \"dance shows\"."}], "images": []}, {"title": "Chemical Juggling", "level": 3, "content": [{"type": "paragraph", "text": "Indigo has the ability to produce explosive chemical orbs from his body and attack with them, a power he calls \"Chemical Juggling\" (ケミカルジャグリング, Kemikaru Jaguringu). He can create bright green and purple chemical orbs somewhat similar to Will-o'-the-wisps, that are then arranged above him and shot from his hands one after another, in rapid succession, causing powerful explosions. He can also apparently condense his orbs into a larger one with a far more explosive effect, which he calls \"Mass Juggling\" (マスジャグリング, Masu Jaguringu), that, although much more effective than his ordinary attack, needs more time to reach critical mass. The way he manipulates the chemicals resembles the skill of Juggling, befitting his clown-like appearance."}, {"type": "paragraph", "text": "Due to Indigo being able to pull himself out of a pool of water after falling in, he is obviously not a Devil Fruit user. Instead, it appears that this ability stems from some sort of chemical he used on himself, also seen when, after being defeated by Zoro, he got enveloped by his own flames and exploded, such loss of control of own powers was only seen with Foxy at the Davy Back Fight, when Luffy redirected Foxy's Noro Noro Beam to him and he was slowed down by his own power."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Battle in the Edd War and Afterwards", "level": 3, "content": [{"type": "paragraph", "text": "Indigo was at Shiki's side during the Battle in the Edd War, where the Golden Lion Pirates confronted the Roger Pirates. After the battle, he was seen at his captain's bedside, commenting on his positive attitude towards the steering wheel stuck in his head. He then slapped him in a comedic fashion for mistaking himself with a rooster."}, {"type": "paragraph", "text": "It's unknown what happened to Indigo during Shiki's imprisonment in Impel Down, however when Golden Lion broke free of the prison and reached Merveille, the loyal scientist was one more time at his side, ready to start developing an ambitious project to defeat the World Government: he will develop the SIQ serum from the IQ plants present on the flying island, making Shiki's plan of an army of mutated animals real."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Little East Blue Arc", "level": 3, "content": [{"type": "paragraph", "text": "Indigo was briefly seen during the Little East Blue Arc, commenting on Boss having escaped from him, and then reassuring his captain of the plan's guaranteed success."}], "images": []}, {"title": "One Piece Film: Strong World", "level": 3, "content": [{"type": "paragraph", "text": "Indigo was first seen dancing before Nami with Shiki and Scarlet, in the palace's greenhouse. He proudly showed his captain the new development, a bird producing electricity from his feathers, who ended up shocking the three pirates. He spent the major part of the film at his captain's side, miming the most important news before telling him and the onlookers openly; he was quite surprised when Shiki managed to understand the news regarding Nami's attempt to blow up the Daft Green trees just through his miming actions."}, {"type": "paragraph", "text": "During the pirates meeting in the main hall, he was seen serving them something to drink. When the Straw Hat Pirates arrived and Luffy attempted to chase after Shiki, he tried to attack him with a sword, but he was stopped by Zoro. He fought alongside the others until the palace was attacked by the wild animals. Later Chopper and Usopp manage to find Nami, who has been infected due to overexposure to the Daft Green plants, and start searching for a cure. They reach the palace's laboratory, but wind up running into Indigo, who has such a cure, but refuses to hand it over, preparing to fight the two. Zoro however arrives, and proceeds to battle him. Indigo shows off his Chemical Juggling ability, attacking the swordsman with his chemical orbs, but he's rapidly defeated when Zoro uses his Asura: Ugui and he loses control of the Chemical Juggling. He was last seen falling unconscious from the sky, together with Shiki and Scarlet, after his captain's levitation control over the islands was broken. His current fate is unknown."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Zoro_Defeats_Indigo.png/revision/latest/scale-to-width-down/240?cb=20130621181353", "caption": "Indigo defeated by Zoro."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The reason his scarf is always hovering behind him (as if wind was blowing through it) is because there is a wire inside the scarf.", "elements": []}, {"text": "Of Shiki's main crew members, they all have a color in their name. Indigo's, as his name suggest, is indigo.", "elements": []}, {"text": "Like many other characters, Indigo has a distinctive laugh, \"piro piro piro piro!\". \"Piro\" sounds similar to \"Pierrot\", a stock character in pantomime, which befits his clown theme. Ironically, Pierrot is deadpan and downtrodden, while Indigo usually has a wide grin on his face.", "elements": []}, {"text": "He shares with Caesar Clown both the scientist profession, the clown theme (Caesar only in the name) and Voice actor.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/71/Indigo%27s_Scarf.png/revision/latest/scale-to-width-down/150?cb=20151007160603", "caption": "Oda explains how Indigo's scarf is always floating."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑ One Piece Manga and Anime - Vol. 0 Chapter 0 and Episode 0, Indigo is introduced alongside his captain.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 27), Indigo's birthday is given.", "elements": []}, {"text": "↑ One Piece Anime - Episode 429, Shiki mentions that Indigo is Boss' creator.", "elements": []}, {"text": "↑  One Piece Movie 10, Indigo appears in Movie 10.", "elements": []}]}], "images": []}]}