{"sections": [{"title": "Pica", "level": 1, "content": [{"type": "paragraph", "text": "Pica is one of the top three officers of the Donquixote Pirates. He occupies the Spade seat of the Donquixote Family and is the leader of the crew's Pica Army subdivision. Due to his actions and role, he one of the major antagonists in the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pica is an extremely broad, tall, intimidating and muscular man. It is shown in a flashback that even as a nine year old child he possessed a similar hulking frame, while also wearing a silvery metal chainmail headguard and a pale yellow knights helmet, in addition to white sleeveless t-shirt and black pants, that he would have until adulthood. By the age of 24, he had replaced his makeshift armor from childhood to real golden armor and took to wearing black gloves. His hair is long and lavender, wavy and light, which hangs down to his shoulders. It appears that under his mask, he has a straight mustache. His eyes are yellow. The most distinctive features on his body are his shoulders, which have three (previously two) spikes protruding out of each shoulder blade that appears to be part of his actual flesh; his shoulder grew to this point since he was wearing shoulder guards of such shape since puberty, thus causing them to shape like so. He is considerably taller than normal people, appearing as tall as Trebol and Diamante. There is a tattoo of a (black in the manga, purple in the anime) spade on the front side of both his shoulders."}, {"type": "paragraph", "text": "He wears a yellow-gold spiked helmet with a narrow four-pointed star on the front with a spade on the top point; the star covers his eyes in a visor-like fashion. Ten years ago, he wore dark gauntlets and white bandages on both of his hands that go up halfway to his shoulders. He also wears a metallic belt with a black spade emblem with a light-colored outline on the front attached by chains in a manner resembling suspenders, albeit with chains wrapping around his hips and from front-to-back instead around his body, over a pteruges skirt in the manga. In the anime they are golden-yellow colored. Underneath his pteruges is a pair of dark underwear. He also wears a pair of light-colored greaves, and a large pair of black gloves (golden-yellow in the anime) that reaches up to his forearms. His most recent appearance also shows him wearing a light-colored spade shaped armored chest plate with the spade symbol attached by light-colored leather straps and a metal chain in-between the light-colored leather straps at the top, with armor plating stretched and wrapped around his sides, and black and white armbands (light-brown and yellow gold in the anime) just around his elbows. Of all the executive officers of the Donquixote Pirates he is the most muscular and with the biggest and widest arms, hands and fingers, which are adorned with black gloves (purple in the anime) that reach up to his forearms."}, {"type": "paragraph", "text": "At a young age, Pica had a large frame, wearing only a small vest which exposed his chest, tattered shorts, and wore no shoes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pica seems to be a quiet individual, likely due to his surprisingly high pitched voice for his size. He is extremely sensitive about his voice, and in the event he does speak and is laughed at, he gets extremely upset, going as far as to brutally murder people for it. He also has some pride in his sword, as he was offended just as easily when Zoro insulted it."}, {"type": "paragraph", "text": "He is very loyal to Doflamingo as he abandoned his battle with Zoro to protect Doflamingo after the Shichibukai's string puppet was decapitated by Kyros. He also considers his crew as his family, as he set out personally to seek out the enemies who threaten their safety. Likewise, he firmly believes Doflamingo is the rightful king of Dressrosa and the country belongs to the family. However, as seen when Machvise ran from Pica's large scale attack after Luffy angered the latter, there are times where his anger gets the better of him and he may neglect the safety of his family. Also, he did not hesitate to insult Diamante for losing to Kyros, while not even bothering to give Baby 5 a chance to explain anything before attacking her for assumed treason."}, {"type": "paragraph", "text": "He believes strongly in his Devil-fruit abilities, saying that he alone would be enough to defeat the enemies in Dressrosa and prevent them from getting to Doflamingo. He openly said that three or three hundred people makes no difference to him. He is also confident in his Haki claiming Zoro would be unable to cut him after he imbued his entire body with it. This arrogance led him to underestimating Zoro, who defeated him with his own Haki."}, {"type": "paragraph", "text": "Like many One Piece characters, Pica has a distinct laugh: \"Pikkya-pikkya-pikkyarara\", something he's also sensitive about."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "The two met in their childhood, with Pica being one of the four people (who would become his elite officers) to serve Donquixote Doflamingo. Having followed him for over thirty years, Pica is incredibly loyal to his captain along with the other executives. Pica does not want Doflamingo to participate in activities that he feels are beneath him, and will often try to do those things himself. He will do anything to help his captain if he is in trouble, as shown when he left his battle with Zoro when Kyros attacked Doflamingo. This loyalty is both ways, as Doflamingo did not allow anyone to make fun of Pica's voice, going as far as preparing to kill a lower-ranking soldier for even giggling. Like the other elite officers, he refers to Doflamingo as \"Doffy\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/The_Elite_Officers_Swear_Loyalty_to_Doflamingo.png/revision/latest/scale-to-width-down/200?cb=20151227180339", "caption": "The Executive Officers bow before Doflamingo."}]}, {"title": "Diamante", "level": 4, "content": [{"type": "paragraph", "text": "Despite working along Diamante for 31 years and holding each other with high regard, Pica was not afraid to insult the executive after his defeat by Kyros. Diamante was angry at a soldier for giggling at Pica's voice."}], "images": []}, {"title": "Trebol", "level": 4, "content": [{"type": "paragraph", "text": "Although not much interaction is seen between Trebol and Pica, the two of them, alongside Diamante and Vergo, worked to together under Doflamingo for at least 31 years, faithfully and akin to family. For this, Trebol became infuriated when a soldier giggled at Pica's voice."}], "images": []}, {"title": "Baby 5", "level": 4, "content": [{"type": "paragraph", "text": "Baby 5 was an officer working directly under Pica, and held each other in high regard. She quickly shot down the soldier who giggled at Pica's voice without hesitation, much to his gratitude. However, after Baby 5 left the Donquixote Pirates for her new love for Sai, Pica immediately recognized this as betrayal and attempted to kill her without letting her give any reason for her actions."}], "images": []}, {"title": "Buffalo", "level": 4, "content": [{"type": "paragraph", "text": "When Buffalo first joined the crew, he made fun of Pica's voice, which resulted in the boy being punished by torture. Buffalo has since then became an officer in Pica's division."}], "images": []}, {"title": "Others", "level": 4, "content": [{"type": "paragraph", "text": "Pica showed absolutely no compassion for any members outside of the officer tier, as he stated that he would violently murder the soldier who giggled at his voice. He would also neglect the safety of these soldiers, and even some of the officers, when he was infuriated by Luffy and Zoro for laughing at his voice, dropping his giant fist at everything around them."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "If Pica sees any enemy of the Donquixote Pirates in a disadvantageous position, he will attempt to kill them regardless of what else is happening around him."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Like many others in the series, Pica underestimated Luffy, at first seeing him as scum whom he could eliminate without making his captain go to any trouble. However, he developed a personal hatred towards Luffy after the pirate mocked his high-pitched voice and tried several times to eliminate Luffy."}], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Pica and Zoro have fought multiple times, and Pica has displayed the intent to kill him, especially since Zoro constantly mocked his voice as well as his laugh. However, he eventually acknowledges Zoro's superiority in combat and thus attempted to avoid him to prey on weaker enemies, which angered Zoro greatly. However, this would later be his downfall as Zoro caught up to him and cut apart his giant stone statue, before engaging him in battle again. Pica was confident his Haki would outclass Zoro's, but the latter proved his Haki was superior before defeating the Donquixote officer."}], "images": []}, {"title": "Riku Doldo III", "level": 4, "content": [{"type": "paragraph", "text": "Believing Doflamingo is the true king of Dressrosa, Pica actively hates Riku to the point where Riku became his number one target when he discovered his location. Pica has hurled numerous insults at Riku, calling him unfit to be king."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Pica is powerful enough to occupy the Spade seat in the top tier of Doflamingo's crew, giving him command over a broad subdivision of the crew."}, {"type": "paragraph", "text": "Even as a 9-year-old child, Pica was strong enough to burn down an entire town alongside Vergo, Trebol and Diamante, all of whom were young at the time. At 30 years old, Pica, along with Trebol and Diamante, was able to defeat the entire army of Dressrosa."}, {"type": "paragraph", "text": "Viola also expressed worry at multiple instances regarding the interference of Pica in Luffy, Zoro, and Viola's entering of the royal palace, which further suggests Pica's might. Pica himself was confident that he alone was all that was necessary to put an end to the Straw Hats and former Colosseum fighters."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Due to his immense size, Pica is extremely strong. Before he could kill a grunt for giggling at his voice, Baby 5 intervened and shot the grunt herself, saying that he would have destroyed his body. In the anime, a nine-year-old Pica was shown lifting two men up before slamming them against each other. Pica is also capable of lifting up his giant katana that is bigger than him, able to wield it without any difficulty when he was about to hit Luffy with it or during his fight with Zoro. Even while wounded, Pica managed to survive a long fall from the air which just left him unconscious."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Pica has sufficient skill in swordsmanship to hold his own against Zoro. "}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Pica ate the Ishi Ishi no Mi, a Paramecia-class Devil Fruit that permits him to assimilate with any and all stone he comes into contact with. He was seen emerging from a stone wall at the rampart tower B-1 of the Dressrosa royal palace, looking as if he were made of or covered in the stone itself, giving him a golem-like appearance. While in this form, he becomes nearly giant-sized, dwarfing Luffy, Zoro, and Viola."}, {"type": "paragraph", "text": "According to Viola, he is not merely a \"stone man\", but instead a \"stone assimilation man\", allowing him to absorb and manipulate all of the stone he makes contact with. In areas composed entirely of stone, such as the Dressrosa royal palace, he can swim through the stone like water this way. He has absolute control over the environment, making him a formidable opponent. He can use the stone he assimilates to extend the range of his massive sword. Furthermore, he can move around the environment at will and do so at unusually fast speeds, despite his massive height, muscle, size and build. Finally, his ability grants him additional weapons: namely, his respective environment at will."}, {"type": "paragraph", "text": "As the entire Dressrosa island is laid on stone, he can even shift the entire island's geography around and become a golem of tremendous proportions."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Ishi_Ishi_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20180529180105", "caption": "Pica emerging from a stone wall he merged with."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Even at 9 years old, he was already knowledgeable of Haki, particularly that those who possess Haoshoku Haki are qualified to become king."}], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Pica can use Busoshoku Haki, and has displayed the ability to coat his entire body in it, similar to Vergo. Pica was confident that his Haki could protect him from all attacks when his stone body was disabled. However, it is inferior to Roronoa Zoro's Haki, as the latter was able to cut through it, and thus Pica, with his Busoshoku Haki-imbued swords."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a4/Pica%27s_Full_Body_Busoshoku_Haki.png/revision/latest/scale-to-width-down/210?cb=20151122071617", "caption": "Pica imbuing his entire body with Busoshoku Haki."}]}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Pica possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Pica uses an unnamed giant katana suiting his own size (or even bigger than him, parallel to the one Squard wielded) with an oval-shaped tsuba. He hid this blade inside the stone of the giant replica of himself, and is first seen using it in an attempt to cut down Luffy and Ucy, but Luffy jumped over it, and Zoro intercepted the second swing. He can also use the stone he assimilated to extend his arm's reach to stab at long range."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Pica_vs._Zoro.png/revision/latest/scale-to-width-down/210?cb=20150329215512", "caption": "Pica using his sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Thirty-one years ago, a nine year old Pica befriended a young Doflamingo along with Trebol, Diamante, and Vergo. The group, impressed with his Haoshoku Haki, decided to make him their leader and treated him like royalty, protecting and training him in the arts needed to make him the Pirate King. Their devotion for him was such that they would kill any and everyone who would so much as offend Doflamingo in even the slightest manner, going as far as burning down an entire town for having poor pavement that made Doflamingo trip."}, {"type": "paragraph", "text": "Pica was an officer in the Donquixote Pirates since before Law joined the crew sixteen years ago. Buffalo once made fun of Pica's voice, and was tortured as a result. In the North Blue at Spider Miles, Pica was seen having a meal with the other members of Doflamingo's \"family\" after Law joined for about a week. The crew then learned that Law was sick with the Amber Lead Syndrome."}, {"type": "paragraph", "text": "After Law was made an official member of the crew, the Donquixote Pirates spread their influence as they traveled to the Grand Line. They participated in various activities such as looting, making business deals, and collecting bounties."}, {"type": "paragraph", "text": "One day, Corazon suddenly left the crew and took Law with him. Six months later, Pica had a meeting with Diamante, Trebol, and Doflamingo. They noticed that the Marines were not tracking them during Corazon's absence and expressed their suspicion. The crew also made plans to steal the Ope Ope no Mi during a trade that was going to occur on Rubeck Island. They also planned to meet Corazon on Swallow Island three days before the exchange."}, {"type": "paragraph", "text": "The crew later arrived at Minion Island where the pirates who had the Ope Ope no Mi were based. Shortly after their arrival, they were informed of Corazon's treachery by Vergo."}, {"type": "paragraph", "text": "While Doflamingo covered part of the island in his birdcage, the Donquixote Pirates raided and looted the Barrels Pirates' hideout. When they found Corazon, they viciously attacked him until Doflamingo arrived. Buffalo and Baby 5 later informed Doflamingo that the Marines stationed at the island took custody of a boy. Thinking that the boy might be Law, the Donquixote Pirates left Corazon for dead and prepared for departure. Before they left the island, they found themselves under fire by Tsuru's squadron."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "One year later, the Donquixote Pirates held an auction for the Gol Gol no Mi, though Doflamingo did not intend to actually sell it. Gild Tesoro went to the auction and sent criminals to kill many people, allowing him to gain possession of the Devil Fruit. Doflamingo got angry and sent assassins to kill Tesoro, but they all failed."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "Pica was present on the night Doflamingo took over Dressrosa and aided in destroying the royal army after Doflamingo successfully made Riku Doldo III a villain in the citizens' eyes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Donquixote_Elite_Officers_Burn_Down_a_Town.png/revision/latest/scale-to-width-down/210?cb=20151227113117", "caption": "Doflamingo's four future top officers ruthlessly burning down an entire town for their poor pavement that made their leader trip."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Donquixote_Pirates_16_Years_Ago.png/revision/latest/scale-to-width-down/210?cb=20150712150319", "caption": "Pica eating dinner with the family."}]}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "At the palace, Pica was first seen sitting with Diamante and Trebol when Doflamingo gave Diamante the Mera Mera no Mi to hold for the tournament."}, {"type": "paragraph", "text": "When Franky attempted to breach the Toy House, Pica heard the commotion through a Den Den Mushi."}, {"type": "paragraph", "text": "He later intercepted Luffy, Zoro, and Viola at the rampart tower B-1 by walking out of a stone wall with which he seemingly merged, mysteriously coated in the wall itself. Using his rock-assimilating abilities, Pica attempted to crush the intruders with the palace walls. Luffy and Viola managed to escape while Zoro stayed behind to fight Pica. During the time the toys transformed back into their original forms, Pica apparently left his battle with Zoro."}, {"type": "paragraph", "text": "Pica later went the second floor suit room after Doflamingo was decapitated by Kyros. Pica held Doflamingo's body and severed head in his hand as Doflamingo revealed himself to be still alive. The decapitated Doflamingo was only a copy. After the real Doflamingo appeared and fought Luffy in a short battle, Pica threw Luffy, Law, Viola, Kyros, and Riku Doldo III out of the palace. When Doflamingo trapped everyone on Dressrosa in his \"bird cage\", Pica changed the landscape, lowering the royal plateau, raising the SMILE Factory to the surface, and moving the royal palace to the top of the Flower Field, raising it in the process."}, {"type": "paragraph", "text": "As the members of the Donquixote Pirates gathered for their strategy concerning the Straw Hats and Issho, Pica volunteered to deal with them. One member giggled at Pica's high-pitched voice, much to his fury. However, Baby 5 shot the member and Pica threw him off the palace. Pica then fused with the stones of Dressrosa, becoming a behemoth stone golem. While looking for Doflamingo's enemies, Luffy laughed at his voice, making him very angry. Pica then threw a punch at Luffy, Zoro, and Law, sending them flying away. While searching for any signs of them, Luffy's group returned with new allies. When Pica attempted to attack Luffy and his allies, Chinjao and Elizabello II attacked Pica together and broke his giant stone hand."}, {"type": "paragraph", "text": "Pica attacked with his other arm, causing Luffy's allies to fall back. He then saw Luffy, Zoro, Law, Abullah, Jeet, and Fighting Bull climbing on his arm. Pica regrew the arm that was shattered and prepared to attack Luffy again. Luffy responded by shattering Pica's stone head with Grizzly Magnum. Zoro discovered Pica's real body, which appeared in front of Luffy's group. Pica took out his sword and tried to attack the group riding on the Fighting Bull, but Luffy carried the bull and evaded the sword strike. When Pica attempted to strike again, Zoro intercepted him and initiated another battle with him."}, {"type": "paragraph", "text": "As the battle went on, Zoro was able to fight Pica without much difficulty. Pica and Zoro later noticed Robin, Rebecca, and Bartolomeo approaching from the sky with the assistance of beetles. Pica prepared to attack the trio with the stone statue, but Zoro used Senhachiju Pound Ho to strike him, halting Pica's attack and injuring him in the process. Zoro then explained to Pica that he is the man who will become the greatest swordsman in the world. Enraged that Zoro's interference allowed Rebecca's group to pass him, Pica charged at Zoro again, declaring that he would not be allowed to leave alive."}, {"type": "paragraph", "text": "Pica eventually sent Zoro crashing into the second level of the New King's Plateau. He then inhabited the plateau and when Zoro angered him by making fun of his laugh, he changed the shape of the plateau. Dellinger caught Pica's attention and scolded him for not remembering the other officers were on the plateau as well."}, {"type": "paragraph", "text": "Later on, he transported himself to the Sunflower Field, seeing a defeated Diamante and told the executive how pathetic he is. He then proceeded to ask Kyros and Rebecca what King Riku is to the people fighting on his side. Kyros told him that King Riku is the rightful king of Dressrosa. Pica then transported himself back to the second level, where Zoro had been looking for him. After attacking the wounded on that level, he asked Zoro who is standing on the Old King's Plateau. Zoro answered in a similar manner to Kyros, enraging Pica. Declaring that Doflamingo was the only king deserving to rule Dressrosa, he then left Zoro and inhabited the statue, making his way towards the Old King's Plateau with the intent to kill King Riku and everyone else on the plateau."}, {"type": "paragraph", "text": "As Pica made his way toward King Riku, he was cheered on by the Donquixote underlings. Pica called out for Riku, only to be fired upon, which prompted him to attack those who shot at him. Calling out to Pica, Riku told him to stop this, only for Pica to note that Riku had gotten over his ten year-long depression before claiming that a king who cannot defeat his enemies is not fit to be one. Upon hearing Riku's explanation that a country whose history is filled with massacres cannot have a future, Pica claimed all good people like the king are killed and forgotten by history as he attempted to crush Riku, only to be interrupted when Zoro cut his stone body in half. After the top half of his stone body was split into pieces, Pica emerged and coated his body in Busoshoku Haki in preparation for attacking Zoro, but Zoro proved his own Haki was stronger and cut Pica down with Sanzen Sekai."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Pica and his fellow officers were arrested by the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/36/Pica_vs_Zoro.png/revision/latest/scale-to-width-down/210?cb=20161221012136", "caption": "Pica battles Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/62/Giant_Pica.png/revision/latest/scale-to-width-down/210?cb=20150301133142", "caption": "Pica becomes a giant to wipe out the Donquixote Family's enemies."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f5/Pica_Confronts_Riku.png/revision/latest/scale-to-width-down/210?cb=20151124160053", "caption": "Pica prepares to annihilate Riku on the King's Plateau."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Zoro_Defeats_Pica.png/revision/latest/scale-to-width-down/210?cb=20151212173238", "caption": "Zoro defeats Pica."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Pica, Trebol, and Diamante vs. the Dressrosa army", "elements": []}, {"text": "Pica vs. Roronoa Zoro (Dressrosa Palace)", "elements": []}, {"text": "Pica vs. Chinjao and Elizabello II", "elements": []}, {"text": "Pica vs. Monkey D. Luffy (Statue Top)", "elements": []}, {"text": "Pica vs. Roronoa Zoro (Statue Top)", "elements": []}, {"text": "Pica vs. Roronoa Zoro (Old Royal Plateau)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Pica, Trebol, Diamante, and Vergo vs. unknown thugs", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Vivre Card - One Piece Visual Dictionary revealed an early concept of Pica. He is shown as a thin man, with a helmet with spikes similar to his final design, wearing a jacket, pants, and shirtless, revealing a torso with three tattoos in the form of spades. He is also shown with a spear on his back, and two weapons in his hands."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Early_Pica.png/revision/latest/scale-to-width-down/145?cb=20190509224919", "caption": "Early concept of Pica."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Pica is the Spanish, Russian and Catalan word for \"spade\", matching the card suit motif of Doflamingo's top executive officers.", "elements": [{"text": "While in Italian pica means \"magpie\" ironically a bird known for being talkative and prone for stealing fitting for Pica's occupation as a pirate.", "elements": []}]}, {"text": "Pica is the second character to have a spade symbol in relation to his name and status; the first being Ace and his crew. The non-canon Bear King of the Trump Siblings also had a spade symbol before him.", "elements": []}, {"text": "The fact that Vergo and Donquixote Rosinante were called \"Corazon\" (Spanish for \"heart\") while occupying the Heart seat within the Donquixote pirates indicates that \"Pica\" is also just a code name and not the character's real name.", "elements": []}, {"text": "Pica bears similarities to the mythological Greek half-giant Antaeus. Both are invincible as long as they remain in contact with the ground, and were ultimately defeated in the air.", "elements": []}, {"text": "Pica's favorite food is stone bowl bibimbap.", "elements": []}]}], "images": []}]}