{"sections": [{"title": "Mizuta Mawaritosuki", "level": 1, "content": [{"type": "paragraph", "text": "Mizuta Mawaritosuki was the younger of the two Mizuta Twins, identical twin brothers of the Rumbar Pirates. He and his brother, Madaisuki, were identified by Oda in a SBS question. A fan asked why one of the Rumbar Pirates that died singing had a sword in his skull. Oda explained that this was because they were two identical pirates who died two separate ways."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mawaritosuki wears polka-dot shirt with blue dots. He also has brown hair with a front part that is long, goes up, and hangs down. As an identical twin, he and Madaisuki share all of the same physical characteristics, except for differences in clothing. Mawaritosuki has less dots on his shirt than Madaisuki."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like the rest of their crew, Mawaritosuki was quite fun-loving and jolly. He enjoyed playing music and, in particular, playing for Laboon."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Rumbar Pirates, Mawaritosuki was a skilled musician and fighter. Mawaritosuki was shown to be a skilled singer. He was also a skilled swordsman."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Entering the Grand Line", "level": 3, "content": [{"type": "paragraph", "text": "A long time ago, the Mizuta Twins joined the Rumbar Pirates. They, along with the rest of their crew, met Laboon, a young whale who got separated from the rest of his pod and followed the ship due to loneliness. The twins journeyed through the West Blue with their ship mates, fighting other pirates and singing music. Eventually, the crew came upon Reverse Mountain, where they met Crocus. After staying at the crossing for three months and having fun, they decided to venture out into the Grand Line, leaving Laboon behind with Crocus."}], "images": []}, {"title": "A Sad End", "level": 3, "content": [{"type": "paragraph", "text": "After visiting a forested island, the captain, Yorki, became very ill. Mawaritosuki, with the rest of the crew, then witnessed their captain leave to prevent the disease from spreading."}, {"type": "paragraph", "text": "At some point, the Rumbar Pirates engaged in a fierce battle with another pirate crew that left them devastated. Among the fallen was Mawaritosuki's brother, Madaisuki. The crew members who survived the fight were left poisoned by the enemy weapons. As a final hurrah, Mawaritosuki and his surviving companions sang Binks' Sake a final time into a Tone Dial for Laboon. Slowly, the survivors all succumbed to the poison, leaving all of the Rumbar Pirates dead."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is also a pun as mizutama waritosuki means \"Dots ain't bad\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 50 Chapter 487 and Episode 380, The skeletal remains Madaisuki are seen with sword in his skull.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 50 Chapter 488 and Episode 380, Mawaritosuki is seen singing before succumbing to poison.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 53, Fan question: Why does the pirate who died singing have a sword in his skull?", "elements": []}]}], "images": []}]}