{"sections": [{"title": "Ginko", "level": 1, "content": [{"type": "paragraph", "text": "Ginko is a little girl who lived on Punk Hazard. She was the first person Momonusuke met when he came to the island. She is only named in the anime."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ginko is a little girl, with short brown hair, and wears a white shirt. Due to her being a recent arrival to Punk Hazard, she has not had the growth transformation that others have."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ginko is a very caring little girl, since she asked how Momonosuke was doing and was worried about him. She is also very innocent, as she believed whatever the Punk Hazard officials told her."}, {"type": "paragraph", "text": "She is quite hopeful, since she tells Momonosuke that he is not alone in missing his parents and wanting to leave."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Ginko misses her parents while away from the island and cares for them very much."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Momonosuke", "level": 4, "content": [{"type": "paragraph", "text": "Ginko was the first person at Punk Hazard whom Momonosuke opened up to and conversed with. When he said he wanted to leave and go to his father, Ginko told him that everyone missed their families and that they should try to have fun while they can. When Momonosuke transformed into a dragon, she was scared and worried about him. She later asked a Punk Hazard official about Momonosuke, who said that he was being taken care of. However, they have not been seen interacting with each other ever since Momonosuke first transformed into a dragon, even after they were all freed from Punk Hazard."}], "images": []}, {"title": "Other Children", "level": 4, "content": [{"type": "paragraph", "text": "Ginko hasn’t been seen interacting with the other children much except for playing together. They seem to be friends, since they spend a lot of time together."}], "images": []}, {"title": "Punk Hazard Staff", "level": 3, "content": [{"type": "paragraph", "text": "Ginko, like the other children, trusts the Punk Hazard staff. She believed when they told her that Momonosuke was being taken care of in another room of the laboratory, even though he was hiding in the garbage room."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, Ginko was taken from her parents after being told she was sick and would be made healthy again. She was taken to Punk Hazard, and on her way, she met Momonosuke. He was quite standoffish and did not accept food from anyone else even Ginko."}, {"type": "paragraph", "text": "When Momonosuke went to the \"secret room\" where the prototype Artificial Devil Fruit was, she followed him and walked in after he ate it. They talked and he told her his past, something that he had not told anyone since he was kidnapped. She told him that everyone else felt the same way about leaving, but he should try to have fun and forget it for now."}, {"type": "paragraph", "text": "Then, a number of Punk Hazard officials showed up. Ginko started to run and told Momonosuke to come with her, when all of a sudden he stopped and started acting strange. Ginko and the Punk Hazard officials watched in horror as Momonosuke transformed into a dragon and fled."}], "images": []}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "During her usual checkup, Ginko asked a Punk Hazard official where Momonosuke went and told him about how the young samurai turned into a dragon. The official told her that she had nothing to worry about and that he was being taken care of in another room of the laboratory."}, {"type": "paragraph", "text": "When Momonosuke's father, Kin'emon, arrived searching for him, Ginko told him about Momonosuke's transformation."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "While traveling with the G-5 Marines, Tashigi informed the children that they will see Dr. Vegapunk in a few days."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 69 Chapter 682 and Episode 608.", "elements": []}, {"text": "↑  One Piece Anime — Episode 608, Ginko's name and voice actor are seen in the opening credits.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 69 Chapter 685 and Episode 611.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 69 Chapter 683 and Episode 609.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 70 Chapter 692 (p. 9) and Episode 618.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 79 Chapter 793.", "elements": []}]}], "images": []}]}