{"sections": [{"title": "Vista", "level": 1, "content": [{"type": "paragraph", "text": "\"Flower Sword\" Vista is the 5th division commander of the Whitebeard Pirates. He is one of the most prominent members of his crew."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Vista is a tall (around Jinbe's height), muscular, broad-chested, tanned man with a curly, black mustache, a dark blue top hat, and an earring in each ear. He wears a semi-open dark blue shirt with a white diamond stripe-pattern near the top that reveals some of his hairy chest, as well as a cape that his shirt, and white gloves. He also wears light blue pants with a belt that holds two sword sheaths, one on each side. He wields two sabers, one in each hand."}, {"type": "paragraph", "text": "During Ace's flashbacks, he was shown with shorter hair and wore different attire, consisting of some sort of open jacket and his trademark hat. He did not wear gloves then. He also appeared much slimmer and less muscular than he currently is."}, {"type": "paragraph", "text": "Vista was a member of the Whitebeard Pirates 22 years ago and had his trademark mustache and top hat then as well."}, {"type": "paragraph", "text": "When Vista was a little boy, he wore his hair in a ponytail, and had bangs that hung in his forehead. He sported a black shirt, with a white collar and cross designs on either side of the chest. He also had black pants, and black shoes. He was seen holding a wooden training sword, practicing his swordsmanship skills."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like all division commanders of the Whitebeard Pirates, Vista seems to be very loyal to Whitebeard. He also seems to be modest. He expressed a desire to fight Dracule Mihawk and was happy that he got to cross blades with him. He also expressed a great hatred for Blackbeard as he mocked Whitebeard's inability to save his crew. Vista had to be held back from attacking him."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "Along with the other commanders, Vista is very attached to Whitebeard, calling him \"father\" and crying at the time of his death."}], "images": []}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "In the past, Vista was shown to be amused by Ace's audacity in his many futile attempts to assassinate Whitebeard."}, {"type": "paragraph", "text": "He eventually got attached to him, joining the mission for his rescue in the Battle of Marineford and attacking Akainu when he mortally wounded Ace."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Vista is shown to despise Blackbeard, as he openly insulted Whitebeard's age and his inability to protect his crew. Vista was angered and attempted to step in and attack Teach only to be restrained by his crewmates. This hatred for the man reached a breaking point when Teach and his crew succeeded in killing Whitebeard while the rest of the Whitebeard Pirates were forced to watch helplessly."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Yasopp", "level": 4, "content": [{"type": "paragraph", "text": "At the end of the Battle of Marineford, Vista and Yasopp were seen looking at each other with discontent. The Blue Deep databook mentions that something happened in the past between the two of them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fb/Yasopp_and_Vista_Look_at_Each_Other.png/revision/latest/scale-to-width-down/200?cb=20150421104319", "caption": "Yasopp and Vista look at each other."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As commander of the 5th division of the Whitebeard Pirates, Vista has authority over the lower-ranking subordinates. He is a very experienced veteran, as he was shown as a member of the Whitebeard Pirates from the times of Gol D. Roger. He is one of the strongest members of the Whitebeard Pirates, as shown by his position as commander. He was the one individual Marco specifically commanded and entrusted Luffy's protection to."}, {"type": "paragraph", "text": "Another indication of his strength is that during the Battle of Marineford, despite having fought against individual Shichibukai and admirals as well as numerous Marine officers, he sustained no significant injuries."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "He has tremendous physical strength as he is able to match against Dracule Mihawk, who is known as the strongest swordsman in the world. He was capable of deflecting an attack from an axe-wielding giant, as well as easily slice down cannonballs in midair."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Vista has extraordinary mastery in dual wielding swordsmanship and even Mihawk acknowledges his skills. Vista even managed to deflect Mihawk's flying slash attack which is powerful enough to cut through battleships. In the anime, he was also able to block bullets with his swords to protect his allies from being shot while escaping."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Vista wields a pair of sabers with purple hilts that are visibly distinguishable from another by their different sheaths attached to his waist. In the anime, some of his attacks generate red flower petals (in a similar way pink flower petals materialize whenever Nico Robin uses her abilities), which befits his epithet \"Flower Sword\"; also in the anime, Vista has so far only produced rose petals, but mentioned that he could produce other types of flower petals as well. Whether this means he is a Devil Fruit user has yet to be determined."}], "images": []}, {"title": "Attack List", "level": 4, "content": [{"type": "list", "elements": [{"text": "Rose Rondo (, Rōzu Rondo, literally meaning \"Rose Round Dance\"): An anime only technique, Vista jumps backwards and swings his swords, launching several red rose petals that fly towards the opponent. The effect of the rose petals remains unknown as the attack was blocked. It was first seen used against Mihawk in a filler scene of the anime and was once again used to stop Akainu's magma. In One Piece: Pirate Warriors 2, Vista rapidly slashes foes while giving off rose petals ending with a hurricane slash.", "elements": []}]}], "images": []}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Vista is capable of using Busoshoku Haki, as shown when he fought against Akainu."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Vista possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Adventures With Kozuki Oden", "level": 4, "content": [{"type": "paragraph", "text": "​​​​​Thirty years ago, Vista was among the Whitebeard Pirates when they arrived for the first time at Wano Country. The crew was shipwrecked and before going to civilization to get supplies, they encountered Kozuki Oden, who asked Newgate to let him join their crew after a brief clash."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Oden kept asking to join the crew, but he was turned down. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. After Izo was pulled up onboard, Oden accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, the crew started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Shiki's Visit", "level": 4, "content": [{"type": "paragraph", "text": "Twenty two years ago, Vista was a member of the Whitebeard Pirates. He was seen when Shiki was aboard the Moby Dick speaking about his plans."}], "images": []}, {"title": "Arrival of Ace", "level": 4, "content": [{"type": "paragraph", "text": "After Portgas D. Ace was inducted into the crew, Vista was amused by Ace's audacity in his many futile attempts to assassinate Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Vista fought alongside the other Whitebeard Pirates after Aokiji froze the bay and immobilized all the ships. Later, he deflected Vice Admiral Ronse's axe attack with his swords."}, {"type": "paragraph", "text": "When Marco commanded him to back up Luffy from Mihawk's assault, Vista successfully blocked Mihawk's sword with his two sabers before engaging in battle with the Shichibukai."}, {"type": "paragraph", "text": "As the Pacifista units moved in, Vista and Mihawk decided to postpone their battle to escape from being surrounded. He, along with his fellow crewmates, was shocked when Squard stabbed Whitebeard."}, {"type": "paragraph", "text": "He successfully made it onto Whitebeard's hidden black paddle-ship and was seen standing next to his crewmates. When Vista's fellow commanders Marco and Jozu were both defeated by the admirals, he showed panic. When Whitebeard ordered for everyone to back up Luffy to save Ace, Vista sliced down some cannonballs aimed at the Straw Hat captain, and urged him to press on. After Ace was freed and began fighting alongside Luffy, Vista commented on the remarkable teamwork the two of them had. Vista, Marco, and Atmos were then shocked to see Akainu pierce Ace through the chest with his magma fist. After that, he and Marco simultaneously attacked Akainu to keep him away from Luffy, with Vista commenting that he regretted letting his guard down."}, {"type": "paragraph", "text": "Separated from Whitebeard, who was confronting Blackbeard, Vista was getting irritated at Blackbeard for speaking ill of Whitebeard and of Ace's and Thatch's deaths, and had to be held back by his fellow crewmates. After Whitebeard's death, Vista and the other Whitebeard Pirates prepared to face off against Akainu to defend Luffy and to carry him on to the next era. He then appeared next to Marco, who was speaking to Shanks. Upon the war coming to a close, he and the remnants of Whitebeard's crew left."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Vista_vs._Ronse.png/revision/latest/scale-to-width-down/210?cb=20160130163612", "caption": "Vista and New World pirates vs. Vice Admiral Ronse."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/15/Mihawk_vs._Vista.png/revision/latest/scale-to-width-down/210?cb=20141206162103", "caption": "Vista fights Mihawk."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended the funeral of Whitebeard and Ace at an undisclosed location somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Vista and other pirates vs. Vice Admiral Ronse", "elements": []}, {"text": "Vista vs. Dracule Mihawk (postponed)", "elements": []}, {"text": "Vista and Marco vs. Admiral Akainu", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu and Thatch), Crocodile and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "\"Vista\" has several meanings in translation, such as \"perspective\" or \"view\". Strictly speaking, it can refer to either a point in the landscape or an opinion."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He has been confirmed to feature in the series of Portrait of Pirates figurines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c3/VistaDX.png/revision/latest/scale-to-width-down/140?cb=20130222093907", "caption": "Portrait of Pirates figurine of Vista."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}]}