{"sections": [{"title": "Tibany", "level": 1, "content": [{"type": "paragraph", "text": "Tibany is an okama from Momoiro Island. He and the other okamas chased after Sanji and attempted to convert him into an okama. In the anime, he was called Elizabeth (エリザベス, Erizabesu)."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tibany is a very large middle aged man with long blond hair ending in curls who has some stubble on his chin and hairy legs. He has effeminate-looking cyan colored eyes and a very noticeable unibrow and wears a dark red shade of lipstick and a frilly pink blouse with light yellow flower patterns. He also has extremely prominent cheekbones and he can always be seen blushing."}, {"type": "paragraph", "text": "In Sanji's hallucination he resembles a beautiful well-endowed young lady of regular height, with his blond hair being the only thing that remains unchanged."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As an okama, Tibany is incredibly effeminate and enjoys dressing up like a young woman. Like the other okama on the island, he has a desire to convert others into okama as seen with his interactions with Sanji. He is also quite playful especially when trying to convert Sanji and believed chasing him around was fun, however his actions may come off as somewhat intimidating due to his forceful behavior, especially when he tried to catch Sanji with a net in order to make him wear a dress."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Separation Serial: Kamabakka Kingdom", "level": 4, "content": [{"type": "paragraph", "text": "After Sanji was separated from the rest of the Straw Hat Pirates by Bartholomew Kuma, he landed in the Kamabakka Kingdom on Momoiro Island which was completely inhabited by okamas. Soon after, Tibany and a group of okamas attempted to convert Sanji into one of them and eventually succeeded after pursuing Sanji for a lengthy amount of time. He returned to normal by the time Emporio Ivankov returned to the kingdom."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Sanji returned to Sabaody Archipelago two years later to reunite with the Straw Hats, Tibany and the other okamas were there to see him off and promised that they would never forget him despite Sanji's utter dislike for them. They later aided the Straw Hats by holding back (more like tormenting) a group of Marines. Tibany then winked while the Straw Hats were setting sail. Sanji somehow sensed this and screamed briefly."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2f/Tibany_Sabaody.png/revision/latest/scale-to-width-down/180?cb=20140503153248", "caption": "Tibany \"winks\" farewell to Sanji."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "He and the other okamas prepared Kamabakka Kingdom for an event."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime the story was changed with Tibany being the one who found and took care of Sanji while he was passed out, but when he regained consciousness he hallucinated that Tibany was a young beautiful woman and chased after him. This soon led Sanji to Tibany's frilly home where Tibany attempted to convert Sanji into an okama after a little miscommunication. After pursuing Sanji for a lengthy amount of time, Tibany and the other okamas reported his presence to the substitute queen of Momoiro Island, Caroline with Tibany informing him that Sanji was no threat. The okamas then lure Sanji into the castle where Sanji challenged Caroline for a boat off the island. Tibany is later seen witnessing the match between Caroline and Sanji where Sanji is temporarily converted into an okama."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Running Chopper: Chopper and the Island of Bonds", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In One Piece: Stampede, Tibany made a small cameo appearance during the Pirates Expo.", "elements": []}]}], "images": []}]}