{"sections": [{"title": "Keroshot", "level": 1, "content": [{"type": "paragraph", "text": "Keroshot is a member of the Red Arrows Pirates who appeared in the sixth One Piece movie. He is also a member of the speedboat running group within the crew, the Four Wise Men."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Keroshot is a small, old man with a wrinkled forehead and small, mouse-like nose. He has straight, white teeth and a black, curly mustache. He wears a brown jacket with a pocket on his waist, black pants, brown boots, and brown and black goggles. He also wears a two-tone red frog hat that has a plant sprout sticking out of the top. The eyes of his hat look angry, referencing Keroshot's aggressive nature."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Keroshot thinks he is fairly mature, since he called Nami immature when she got angry at the Wise Men. Despite this, he is very cruel and vicious against other pirates like the rest of his crew. He enjoys watching members of other crews fight and wants their friendships to end."}, {"type": "paragraph", "text": "Keroshot also gets intimidated easily by strong pirates like Zoro and Sanji. When the two pirates ignored Keroshot and his partner, Kerodeek, the Wise Men became annoyed and enraged. This reaction shows that Keroshot is actually quite immature and wants attention."}, {"type": "paragraph", "text": "Keroshot shares a unique laughter style, \"Kerokerokero\", with the rest of the Wise Men. This style is a play on the similar start to their names."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Keroshot's physical abilities, but he is skilled at speedboat racing and shooting other speedboats."}], "images": []}, {"title": "Sniper Skills", "level": 3, "content": [{"type": "paragraph", "text": "Keroshot is fairly skilled marksman and operates as the gunner on his speedboat. He uses multiple different weapons such as boat-operated guns and rockets and a handheld machine gun-type firearm that looks like a cartoon face with yellow teeth."}], "images": []}, {"title": "Speedboats", "level": 3, "content": [{"type": "paragraph", "text": "Though he has only been seen as a passenger of a speedboat, he is most likely skilled at driving them. He works well with his speedboat partner, Kerodeek, who use their skills of driving, ship building, and marksmanship together to battle their opponents. Despite this, they were easily defeated by Zoro and Sanji."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Many years ago, Keroshot joined the Red Arrows Pirates. They sailed on the Grand Line back when Gol D. Roger was still alive. At some point, there was a terrible storm that killed Keroshot and the rest of the crew, leaving Omatsuri alone. Eventually, the lonely captain arrived on Omatsuri Island and met the Lily Carnation, which he used to revive Keroshot and the rest of the crew. Since then, they have been attracting pirate crews to the island to break them up and feed them to the plant monster."}], "images": []}, {"title": "Baron Omatsuri and the Secret Island", "level": 3, "content": [{"type": "paragraph", "text": "When he was introduced, Keroshot and his fellow Wise Men were standing on podiums and Omatsuri announced that they would be the representatives for the speedboat race against the Straw Hat Pirates.Nami laughed at this, since she thought they were weak due to their age and size. Keroshot called Nami immature for getting angry at them when the rest of the Men insulted her."}, {"type": "paragraph", "text": "During the race, Keroshot and his partner, Kerodeek, were in a speedboat against Zoro and Sanji. Kerodeek drove the boat as Keroshot fired at the disgruntled young pirates, causing Zoro and Sanji to panic. The Wise Men sped far past them in a ploy to win the race."}, {"type": "paragraph", "text": "As the bickering Straw Hats catch up to Keroshot and Kerodeek engaged an arm mechanism to try and catch Zoro. The young swordsman sliced it to pieces and frightened the Wise Men. Zoro then tried to make another attempt, but Keroshot fires at them again. Zoro dodged the bullets and jumped in and out of the boat, rocking it and frustrating Sanji. During their subsequent argument, Keroshot and his partner snickered over the Straw Hats dispute. The two Wise Men veered away from the Straw Hats, frustrating Zoro and Sanji."}, {"type": "paragraph", "text": "When they met again with the Straw Hats during the race, Zoro and Sanji were arguing for another time and ignoring the Wise Men, angering them. As Kerodeek manned the speedboat, Keroshot tried to shoot them with a barrage of bullets. They missed, and Zoro sliced up their speedboat, which Kerodeek quickly fixed. Now returning with a souped-up boat, Keroshot tried to fire again, this time with an array of missiles, but Sanji kicked their speedboat to pieces, which Kerodeek again fixed. Returning once again with a massive speedboat that hovered above the water and had a giant drill on the front, they tried to sink the Straw Hats' boat. Zoro and Sanji worked together the destroy the ship and ensnare the Wise Men in the rings. Later, while Kerojii was fighting Zoro and Sanji, Kerodeek, his partner, and Keroko laughed at the Straw Hats' struggle."}, {"type": "paragraph", "text": "After Lily Carnation was killed, Keroshot turned into a plant."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Zoro_and_Sanji_Defeat_Kerodeek_and_Keroshot.png/revision/latest/scale-to-width-down/210?cb=20131104215148", "caption": "Zoro and Sanji defeat Keroshot and Kerodeek."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Four Wise Men vs Straw Hat Pirates", "elements": [{"text": "Keroshot and Kerodeek vs. Roronoa Zoro and Sanji", "elements": []}]}]}], "images": []}]}