{"sections": [{"title": "Mikazuki", "level": 1, "content": [{"type": "paragraph", "text": "Mikazuki is the captain and only named member of the Big Helmet Pirates. He has a bounty of 36,000,000."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He wears a large spherical helmet similar to Kokoro's, apart from the fact that it has a crescent moon on it. He also has large canine teeth resembling a demon. His facial appearance is that of a middle aged man and his hair color is white."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He was shown to be arrogant, demanding and ungrateful when he refused to pay for his ship repairs, because of the length of time it took to repair it. He tried to threaten the shipwrights with brute force when they tried to make him pay."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "With a bounty of 36,000,000, and making it through the Grand Line to Water 7 Mikazuki is a considerable pirate by the first half of the Grand Line standards. However, he stood no chance whatsoever against the workers of Galley-La."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Mikazuki used a sword to threaten Paulie."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "Mikazuki first appeared at Galley-La Dock 1 when the company had finished their work on his ship. Although he claimed that he was grateful that they had repaired his ship, he claimed that the repairs were overpriced, and as such, refused to pay the fees. He then threatened the Paulie with his sword and thanked him for the free repairs. Paulie then warned him that he should be careful of who he was threatening, and afterwards the shipwrights swiftly knocked Mikazuki and his crew out."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e4/Mikazuki_Defeated.png/revision/latest/scale-to-width-down/210?cb=20130510171349", "caption": "Mikazuki is defeated by the Galley-La workers."}]}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Although he had been defeated by Galley-La, Mikazuki was not handed over to the authorities to collect the bounty for the repair fees. Instead, he was forced to work under the loansharks to earn enough money to pay for the repairs. As such, when the loansharks encountered Zoro during their first attempt to collect money from the orphanage's Aunt, they hired Mikazuki to act as their fighter in case they would encounter him again."}, {"type": "paragraph", "text": "During the loansharks second attempt, Mikazuki was ordered to threaten Aunt and make her pay. He and Aunt engaged in a battle, but were then interrupted by Zoro. Seeing, the swordsman, Mikazuki attempted to attack him, but was easily blown away by Zoro's Nanajuni Pound Ho."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Big Helmet Pirates vs. Galley-La Company", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Mikazuki vs. Aunt", "elements": []}, {"text": "Mikazuki vs. Roronoa Zoro", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Mikazuki\" (三日月, Mikazuki) is Japanese for \"crescent moon\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 323 and Episode 230, Mikazuki is defeated by the Galley-La Company with immense ease.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 176), Mikazuki's birthday is revealed.", "elements": []}, {"text": "↑  Eternal Log, Mikazuki's wanted poster is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 318, Mikazuki defeated by Roronoa Zoro.", "elements": []}]}], "images": []}]}