{"sections": [{"title": "Mountain Ricky", "level": 1, "content": [{"type": "paragraph", "text": "Mountain Ricky is a member of the Foxy Pirates. He fought George Mach before the third round of the Davy Back Fight."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ricky is a short, fat man with a stubby nose, missing teeth and curly dark hair. He wears boxing gloves, shorts, elbow sweat bands, and the typical Foxy Pirate mask."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Ricky's personality, but he is likely very deceptive, similar to the rest of his crew. He seems very engaged when fighting."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "It is unknown exactly what kind of abilities Ricky possesses, but he seems to be fairly weak, as he and George Mach were battling evenly before they were both knocked out of the ring when the third round of the Davy Back Fight started."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Ricky was seen punching with boxing gloves and carrying a shotgun. It is unknown how skilled he is in fighting with them."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "Ricky was seen fighting George Mach before the start of the third round of the Davy Back Fight. They were shown to be literally knocked off the ship when Monkey D. Luffy and Foxy were about to start."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mountain Ricky vs. George Mach", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 33 Chapter 313, Mountain Ricky's name is called out by the audience as he fights George Mach.", "elements": []}, {"text": "↑  One Piece Anime — Episode 217, Ricky and George are knocked off of the ship as the third round of the Davy Back Fight starts.", "elements": []}]}], "images": []}]}