{"sections": [{"title": "George Mach", "level": 1, "content": [{"type": "paragraph", "text": "George Mach is a member of the Foxy Pirates. He fought Mountain Ricky before the third round of the Davy Back Fight."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "George is a medium-height man with an angular face and hair that sticks straight up. He wears boxing gloves, shorts, boots, and the typical Foxy Pirate mask."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about George's personality, but he is likely very deceptive, similar to the rest of his crew. He seems very engaged when fighting."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "It is unknown exactly what kind of abilities George possesses, but he seems to be fairly weak, as he and Mountain Ricky were battling evenly before they were both knocked out of the ring when the third round of the Davy Back Fight started."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "George was seen fighting with a baseball bat and shield and was wearing boxing gloves. It is unknown how skilled he is in fighting with them."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "George was seen fighting Mountain Ricky before the start of the third round of the Davy Back Fight. They were shown to be literally knocked off the ship when Monkey D. Luffy and Foxy were about to start."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "George Mach vs. Mountain Ricky", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 33 Chapter 313, George Mach's name is called out by the audience as he fights Mountain Ricky.", "elements": []}, {"text": "↑  One Piece Anime — Episode 217, George and Ricky are knocked off of the ship as the third round of the Davy Back Fight starts.", "elements": []}]}], "images": []}]}