{"sections": [{"title": "Haredas", "level": 1, "content": [{"type": "paragraph", "text": "Haredas is an old man who lives in Weatheria. He was Nami's tutor in weather-manipulation during the timeskip."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Haredas is an old man who has a long, white beard and long, straight hair of the same color, that fall on his back. He wears a blue pointed hat that matches his wizard-like robe, which stretches down to his feet. In the manga, he is fairly tall, whereas in the anime, he is rather short. Sometimes, Haredas' eyes are shown large and shining, much like Nyon's when she admires Hancock's cuteness."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6a/Haredas_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180911021210", "caption": "Haredas's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Haredas has shown to have a rather carefree upbeat personality, smiling and seemingly enjoying himself mostly. He is also slightly absent-minded and bumbling, and tends to repeat certain many things he already said and introduced before. Also, he is shown to be very patient and even after Nami kept (inappropriately) hitting him, and still maintained his friendly attitude with her. He has a habit to address to people repeatedly \"oi, oi, oi, oi, oi, oi, oi, oi, oi, oi\" (\"hey, hey, hey, hey, hey, hey, hey, hey, hey, hey\") instead of only one time."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a scientist of Weatheria, Haredas has great knowledge about the weather-based science of the place, and uses it, to great effects, to control weather. This is showcased by him tutoring Nami in the arts of weather manipulation. In the anime, Haredas uses a technique in the form of a bubble-like barrier that allows him to be unfazed by the extreme weather while walking in Weatheria. Whether this is some new (or old) technique or possibly a type of technology native to the sky islands is unknown at this time."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Haredas was born on the sky island Birka 97 years ago. At the age of fifteen, he became immersed in the study of weather science. He took part in constructing the artificial sky island Weatheria, which was completed when Haredas was 30 years old. A year later, he began writing records of weather around the world."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Straw Hat's Separation Serial", "level": 4, "content": [{"type": "paragraph", "text": "Haredas first appears when Nami ends up on Weatheria, due to the events of Sabaody Archipelago. He shows her around the island, and displays to her how to use the wind knot to call forth a variety of wind phenomenons ranging from a gentle breeze to a mighty squall."}, {"type": "paragraph", "text": "When Nami was locked up for stealing weather equipment, Haredas, having felt sorry for her, let her go after hearing about her captain Monkey D. Luffy and the pain he was in after losing his brother Portgas D. Ace in the Whitebeard War. As soon as she was released, Nami kidnaps him and takes the stolen goods with her as well. Nami runs off with Haredas under her arm, telling him to help her to return to the Blue Seas. When she was crying again (this time not faking it), Haredas believed it to be once again fake, and brings it up, to which Nami snapped at him to be quiet. When Nami stops to read the article about Luffy infiltrating Marineford, Haredas reminds her that their pursuers are still chasing them."}, {"type": "paragraph", "text": "After seeing Luffy's message, Nami got the Weatheria inhabitants to give her a place to stay. Haredas agreed to teach Nami about the weather of the New World, but scolded Nami for commenting on using the Weather Ball as a weapon, which could be disastrous to the world."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bf/Nami_Training.png/revision/latest/scale-to-width-down/250?cb=20141206163457", "caption": "Haredas tells Nami about the New World climate."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "He dropped Nami off at Sabaody Archipelago. When the Straw Hats are preparing to depart for Fish-Man Island, he and the other residents of Weatheria create rain over an area of Sabaody that the Marines are in, ruining their gunpowder, so the Straw Hats can leave without being bothered. He was watching the events through a telescope, thinking out loud, telling Nami to do her best, saying that he and the other residents of Weatheria would be lonely without her there. He was about to say something else, but he never finished his sentence."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events at Dressrosa, Haredas and the other scientists wore some new clothes, hoping to impress Nami the next time they see her."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, Haredas was small in comparison with Nami. However in the manga, he is taller than her.", "elements": []}, {"text": "His name was revealed in Episode 418 credits but was never mentioned in the manga until Chapter 592.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is a pun of AMeDAS (ame (雨) means rainy) and hare (晴れ, sunny).", "elements": []}, {"text": "He somewhat resembles popular depictions of Merlin and most notable, Nami is commonly compared to a \"witch\" while Haredas resembles a wizard.", "elements": []}, {"text": "He is the oldest living male human and the second oldest human after Kureha.", "elements": []}, {"text": "Even though he is a Birkian, he has no wings just like Enel.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 523 and Episode 418, Haredas makes his debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0564), Information about Haredas is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 139), Haredas's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 61 Chapter 596, Haredas is asked by Nami to teach her everything he knows about the New World's weather and the Weather Ball.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 61 Chapter 602, Haredas is seen after the timeskip along with the rest of Weatheria's scientists.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 825, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 16.", "elements": []}]}], "images": []}]}