{"sections": [{"title": "Kitton", "level": 1, "content": [{"type": "paragraph", "text": "Kitton is a boy who lives in Karakuri Island. He has a grandfather who takes care of him, as well as a cyborg dog named Taroimo."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kitton is seen wearing a parka, a pair of boots, and a gun during his first appearance. Later on in his house, he is seen wearing a sweater. His house appears to be a mechanical looking igloo."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is shown to be brave and courageous. This was evident when he was willing to face the unknown by confronting Franky."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Grandfather", "level": 3, "content": [{"type": "paragraph", "text": "He seems to have a close relationship to his grandfather, as he lives with him and went to confront Franky with him."}], "images": []}, {"title": "Taroimo", "level": 3, "content": [{"type": "paragraph", "text": "He shows affection and love to his pet dog, Taroimo, as he cares for him and walks with him to confront Franky."}], "images": []}, {"title": "Franky", "level": 3, "content": [{"type": "paragraph", "text": "After confronting Franky, he did a dance with him and he soon became his friend. He and his grandpa allowed Franky to live and research in Vegapunk's old lab during the two year time-skip."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Straw Hat Separation", "level": 3, "content": [{"type": "paragraph", "text": "Kitton, his grandfather, and his dog discovered Franky while they were walking in a snow field. Taroimo attacked Franky when he mistook Franky for prey. When the smoke cleared, Kitton was surprised to find out that Franky was alright. He then joined Franky in doing his \"Super\" Pose. Kitton later lead Franky to Vegapunk's old lab."}, {"type": "paragraph", "text": "He later appears after the explosion of Vegapunk's lab knowing it was caused by Franky and discovers the new lab of Vegapunk with Franky. He is terrified by Franky's ruined face, which leads to Franky wearing a lion fur in order to conceal it. He is also one of the few people who knows the truth behind the two legends of Baldimore, The Legend of the Sacred Burning Beast of Baldimore and the Nightmare of Baldimore. He also promised to help Franky with his studies at Vegapunk's lab."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat, Taroimo, Kitton, Kitton's grandfather, and several cyborg animals read the news of the Straw Hats' new bounties."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, Kitton and his grandfather's roles are extended. They drag Franky to the hospital after he got frozen by the cold. After Franky recovered, he had a change in personality and behaved as a gentleman by using red tea as an alternative power source. This did not go well for Kitton as he thinks Franky's former personality is more fun. In an attempt to gain Franky's original personality back, he took Franky into a forest with vicious cyborg animals. Apparently, Franky managed to gain his former personality back and Kitton then takes Franky to Vegapunk's old lab to make more cola.", "elements": []}, {"text": "In the anime, he has a name and he is a little boy. However, in the manga, he was not given a name and he is a tall young man.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name was only revealed in the anime in Episode 418 which means his name is non-canon.", "elements": []}, {"text": "Kitton's grandfather, a native resident of Karakuri Island, bears a strong resemblance to the late Dr. Tsukimi, another resident of the island in the distant past and the scientific genius who created the automata.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 523 (p. 16-17) and Episode 418.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 61 Chapter 596 (p. 12-15).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 60 Chapter 592 (p. 12-15).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 819, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 12.", "elements": []}]}], "images": []}]}