{"sections": [{"title": "Curiel", "level": 1, "content": [{"type": "paragraph", "text": "Curiel is the 10th division commander of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Curiel is a tall, muscular, and sturdy man with purple-tinted, square-rimmed glasses who wears a watermelon-patterned bucket hat over his head and a pair of ear protectors that resemble a pair of modern headphones. He also has a purple Whitebeard's jolly roger tattooed on his chin. He wears a sleeveless green coat over a pale reddish-pink shirt, and brown and green spotted army pants tucked inside a standard pair of boots. He has two bazookas strapped to his back."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e7/Curiel_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180910160300", "caption": "Curiel's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like all division commanders of the Whitebeard Pirates, Curiel seems to be very loyal to Whitebeard, as when he battles against Moria he said he will let neither his captain nor his friend Ace go to their deaths."}, {"type": "paragraph", "text": "Curiel is one of the gutsier commanders as he challenged a Shichibukai and, later, an Admiral by himself during the war."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As commander of the 10th division of the Whitebeard Pirates, Curiel has authority over the pirates in his division. He seems to be quite well known, as Shichibukai Gecko Moria knew who he was when the two encountered each other on the battlefield. He is also quite durable, as he was able to survive a powerful direct hit from Akainu's magma-based Devil Fruit."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He appears to specialize in firearms and is proficient in using the guns and bazookas he is armed with, as he was able to single-handedly confront the Shichibukai Gecko Moria and later emerge unharmed. He has at least two bazookas and two guns."}, {"type": "paragraph", "text": "In the anime, the two guns are shown to have rapid-fire capabilities, as Curiel was able to quickly destroy all of Moria's Brick Bats with a single barrage of bullets, which also shows that Curiel possesses great accuracy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Curiel_Bazooka.png/revision/latest/scale-to-width-down/210?cb=20101215044625", "caption": "Curiel firing one of his bazookas."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the war, Curiel was first seen attacking with the other Whitebeard Pirates, after Admiral Aokiji froze the bay and immobilized all the ships. Later, he was seen fighting against Gecko Moria, claiming that he would allow neither Whitebeard nor Ace to die."}, {"type": "paragraph", "text": "When the steel walls came up, he was seen attacking them with his cannons, but to no avail. He then dodged one of Akainu's magma fists and then helped his division out of the hot water. He managed to get onto Whitebeard's black paddleship and was last seen standing next to his fellow crewmates."}, {"type": "paragraph", "text": "Later, after Akainu mortally wounded Ace, he attacked Akainu with his bazooka to keep him at bay, but this proved useless. He later cried as he watched Whitebeard being attacked and killed by the collective Blackbeard Pirates. He joined his crewmembers along with Crocodile ready to fight Akainu to rescue Luffy and Jinbe. During the confrontation, he was swiftly defeated by the admiral, lying charred at his feet. Upon the arrival of Shanks and the war coming to a close, he was presumably rescued by his departing crewmembers and then treated for his burns."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Curiel_vs._Gecko_Moria.png/revision/latest/scale-to-width-down/210?cb=20130726123230", "caption": "Curiel vs. Moria."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/11/Akainu_Defeats_Curiel.png/revision/latest/scale-to-width-down/210?cb=20140722070436", "caption": "Curiel defeated by Admiral Akainu"}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He survived the war, as he was seen along with the rest of the crew attending Whitebeard and Ace's funeral at an undisclosed location somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. Marines and Shichibukai", "elements": [{"text": "Curiel vs. Gecko Moria", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu and Thatch), Crocodile and Andre vs. Admiral Akainu", "elements": []}, {"text": "Curiel vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 552 and Episode 461, Curiel is seen next to Marco and Jozu.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 54), Curiel's birthday is given.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 58, Curiel's name and position is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 562 and Episode 471, Curiel fights Moria.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 579, Curiel is seen being punched down by Akainu.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}]}], "images": []}]}