{"sections": [{"title": "Sugar", "level": 1, "content": [{"type": "paragraph", "text": "Sugar is a special officer of the Donquixote Pirates' Trebol Army. She was one of the most integral components of Doflamingo's plan in keeping Dressrosa in line, as any dissenters were turned into toys by her Hobi Hobi no Mi powers. She is also the younger sister of Monet. Due to her actions and role, she is a supporting antagonist during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sugar appears to be a ten-year-old girl, but is actually much older, being 22. This halt in aging is due to the effects of her Devil Fruit. She has aquamarine hair and dark blue eyes. During the takeover of Dressrosa, she wore a light-colored dress and a cape with bear-like ears on the hood. While she is in the underground world, she wears a white dress with light blue polka dots, a magenta hooded cape with bear-like ears, a monocle shaped and worn like an eyepatch on her left eye, and a small crown, as well as open-toed sandals. Her monocle is pink with a purple lens."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She is loyal to Doflamingo and helped him take over the kingdom of Dressrosa. She is shown to be cruel, turning many citizens into toys and subjugating them into slavery, leaving them forgotten by anyone who knew them. She takes great pride in what she has done, as she was angry when the toys returned to their original forms and intended to exact her revenge."}, {"type": "paragraph", "text": "She has shown signs of childish behavior, as demonstrated when she ran around the palace, looking for Doflamingo, after he had already left for Punk Hazard."}, {"type": "paragraph", "text": "Sugar appears to be fairly indifferent about the events that happen around her, as she showed no reaction when Baby 5 attacked Doflamingo. However, she became utterly terrified after she forced Usopp to eat the extra-spicy Tatababasco-laced grape, at which point he made a horrifying visage of pain that scared Sugar into unconsciousness. As a result of this, she became terrified of long noses and things that looked like long noses, becoming scared when a long nosed soldier offered her some sausage."}, {"type": "paragraph", "text": "Sugar has a fondness for grapes, which are apparently her favorite food. She often eats them off her fingers. She is shown to be quite rude to Trebol, despite the latter being in charge of her protection. She seems to be annoyed when people consider her weak due to her child-like appearance, to the point where she (literally) drops everything to show off her strength."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Monet", "level": 4, "content": [{"type": "paragraph", "text": "Sugar and Monet are sisters whom Doflamingo saved from a terrible environment when Sugar was 9 years old and Monet was 17 years old. Sugar and Monet were never shown interacting with each other, and it is unknown if Sugar has heard about Monet's death."}], "images": []}, {"title": "Donquixote Pirates", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "As Donquixote Doflamingo is her captain, savior, and benefactor, Sugar and Monet are incredibly loyal to him, willing to lay down their lives for his sake. Sugar seems to have a good relationship with Doflamingo and will follow his orders unquestioningly, keeping the toys of Dressrosa transformed. She felt that her fainting was partially her own fault and tried to make up for it by turning all the citizens of Dressrosa into toys."}], "images": []}, {"title": "Trebol", "level": 4, "content": [{"type": "paragraph", "text": "Despite Trebol dutifully guarding her under the orders of Doflamingo, Sugar does not get along well with him and openly expresses her desire for him to die. In turn, Trebol often refers to her as a brat and treats her like a child."}], "images": []}, {"title": "Others", "level": 4, "content": [{"type": "paragraph", "text": "Sugar seems to be ruthless with the lower-ranking subordinates, as when one foot soldier with a long nose gave her sausages, which triggered her trauma from her battle against Usopp, she turned him into a toy.Gladius became annoyed when Sugar fainted a second time and caused her powers over the toy fighters to disperse once again.Trafalgar Law, formerly a prominent member of the crew, does not seem familiar with Sugar or her powers, as he gave no sign of acknowledgement or caution when she approached him and Luffy."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "As the central pillar to the Donquixote Pirates operations in the underworld, she is the most targeted and vulnerable of the crew, hence one of the Elite Officers acting as her bodyguard."}, {"type": "paragraph", "text": "She is especially disliked by those who she turned into toys via her Devil Fruit power. Upon inadvertently releasing all of her victims from her powers, she swears to turn them all back into slaves for Doflamingo."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After she wakes up from being scared unconscious, Sugar holds particular contempt for Usopp, reacting in horror whenever she sees someone with a long nose or anything that resembles such. The Straw Hats were among the many people she swore to turn into toys, though she ultimately fell prey to Usopp's attack again."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Despite her child-like physique and having Trebol as her bodyguard, Sugar is quite formidable in terms of speed and agility, as seen when she countered a number of attacking Tontatta dwarves, who are fast enough that normal Humans cannot see them. However, she has a rather weak constitution, as she freaked out and lost consciousness when Usopp made a horrifying visage of pain and anguish after being force-fed the Tatababasco-laced grape. This became her weakness, because whenever she sees anything that reminds her of Usopp's terrible expression, she may suffer a flashback that could cause her to faint."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Sugar%27s_Speed.png/revision/latest/scale-to-width-down/210?cb=20150612172638", "caption": "Sugar demonstrates her speed against a group of Tontattas."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Sugar has the power of the Hobi Hobi no Mi, a Paramecia-type Devil Fruit which allows her to turn people into toys and erasing their existence from the memory of everyone they ever knew. She used this ability in order to help Doflamingo take over Dressrosa, and maintaining it was the key to perpetuating the peaceful facade of Doflamingo's reign. This power instantly transforms the victim, and with Sugar's speed, she can transform a group of victims in only a few seconds."}, {"type": "paragraph", "text": "The user of this particular fruit stops aging once the fruit has been eaten, and she remains physiologically ten years old despite being chronologically twenty-two. This seems to apply to her victims as well, as Kyros, who was a toy for ten years, when reverting to normal did not show any apparent signs of aging. She is also able to make a contract with her victims and control them, leaving them helplessly trapped in their toy bodies."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sugar and her sister Monet used to live in a terrible environment. When Sugar was 9 years old and Monet was 17 years old, Donquixote Doflamingo saved them from that environment. They decided to give up their former lives for the sake of the Donquixote Family and seem to have joined the crew sometime after Trafalgar Law left, as they were not seen with the family during Law's time with the crew."}, {"type": "paragraph", "text": "Sugar ate the Hobi Hobi no Mi at age ten, ceasing to age since then. Two years after attaining her eternal youth (eight years before the Battle of Marineford), she was seen assisting the other Donquixote Pirates in the invasion of the royal palace at Dressrosa."}, {"type": "paragraph", "text": "When Doflamingo held Riku Doldo III captive at the palace, Kyros arrived to confront him. When Kyros attempted to attack Doflamingo to save Doldo from execution, Sugar transformed Kyros into a toy, making him her first known victim. Despite this, Kyros managed to escape the palace with Doldo. Because Sugar failed to make a contract with him, Kyros retained his free will even as a toy."}, {"type": "paragraph", "text": "After Doflamingo successfully took over Dressrosa, Sugar turned many more of the citizens into living toys. Over the years, her victims include Dressrosa's soldiers, pirates, Marines, Government officials, royalty from other countries, members of the Revolutionary Army, and even animals."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sugar was first seen sitting beside Doflamingo on one of his chairs outside the Dressrosa palace. She watched and ate grapes as Baby 5 attempted to attack Doflamingo and Doflamingo talked to Vergo about the situation with Law."}, {"type": "paragraph", "text": "She was later seen searching for Doflamingo. She asked Lao G and Giolla where Doflamingo had gone, who replied that he was probably in the room on the fourth floor. Sugar told him that Doflamingo was not in the room, to which Lao G sighed and replied by saying that Doflamingo had gone out by himself again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Doflamingo_at_Dressrosa.png/revision/latest/scale-to-width-down/210?cb=20141206191358", "caption": "Sugar with Doflamingo."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "She was later seen watching the Den Den Mushis in the Dressrosa palace ring, after Doflamingo's false resignation from the Shichibukai. Later on that day, Baby 5 asked her where Doflamingo was, to which she responded that she did not know."}, {"type": "paragraph", "text": "After the losers from the Corrida Colosseum tournament were imprisoned, she turned them into toys one at a time."}, {"type": "paragraph", "text": "While Franky was attempting to enter the Toy House, Sugar heard the skirmish through a Den Den Mushi. Trebol assured Sugar that the Straw Hats' goal was the SMILE factory and that she could just turn them into toys if they managed to reach that far. Trebol also told her with certainty that nobody knew of her existence, though he was wrong about that. Sugar remained calm, apparently unaware that she was the target of Usopp, Robin, Kyros, and an army of dwarves."}, {"type": "paragraph", "text": "When Cavendish was brought to the executive tower, Sugar transformed him into a toy and put him under the control of the Donquixote Family. Meanwhile, Usopp and the dwarves stood outside her room as Leo discussed poisoning Sugar with Tatababasco disguised as a grape, which would knock her out."}, {"type": "paragraph", "text": "Robin, disguised as one of Doflamingo's subordinates, entered the room and lured Trebol out of the tower. Once Trebol left, a group of dwarves charged in and rushed at Sugar. The attack failed when Sugar transformed some of the dwarves into her toy servants and ordered them to kill all the intruders in the tower. While her toys battled the rest of the dwarves, she picked up a Den Den Mushi and warned Trebol of the trap."}, {"type": "paragraph", "text": "She was taken by surprise when a ship thrown by Trebol crashed into the tower."}, {"type": "paragraph", "text": "Robin used her Devil Fruit powers in an attempt to knock out Sugar with the spice the dwarves were going to use. Sugar escaped her clutches by touching one of her arms, transforming Robin into a toy. With Trebol beside her and all the dwarves incapacitated, Sugar picked up the false grape and took a look at it."}, {"type": "paragraph", "text": "After Usopp was beaten badly from his fight with Trebol, Sugar forced the fake grape into his mouth. After a moment, Usopp started screaming in pain and made a tortured expression so startling that it caused her to echo his horrific scream, pass out, and foam at the mouth."}, {"type": "paragraph", "text": "With Sugar's loss of consciousness, her powers were broken, and every living thing she had turned into a toy over the past ten years turned back to its original form, simultaneously restoring all the lost memories associated with them. This resulted in a mass panic throughout the kingdom, as families reunited, pirates and wild beasts raged, and the Donquixote Family's control of Dressrosa crumbled."}, {"type": "paragraph", "text": "She was later seen, still unconscious, at the royal palace, which had been relocated to the top of the Flower Hill by Pica."}, {"type": "paragraph", "text": "Some time after that, she was revived thanks to the powers of Princess Mansherry's Devil Fruit ability. After re-awakening, she developed a fear of long noses and things that look like long noses. She created an army of giant nutcrackers, each consisting of eight humans, to defend the palace. She also swore to turn the people of Dressrosa into toys again and get revenge on Usopp."}, {"type": "paragraph", "text": "She headed to the Castle Garden to meet Luffy and Law after being informed of their presence by her subordinates. She prepared to exact revenge by touching them and erasing their entire existence. Just as she got close to the two, Usopp locked on to Sugar from the old King's Plateau, launching a \"Long Range Bagworm\" after awakening his Kenbunshoku Haki. The bagworm contained a recreation of Usopp's Tatababasco face made by Kanjuro, which flew by Sugar at close range and high speed. This attack caused Sugar to relive her earlier trauma and lose consciousness once again, saving both Luffy and Law from her powers."}, {"type": "paragraph", "text": "She was subsequently brought to the timeout room alongside the defeated Lao G, Machvise, Dellinger and Gladius. Giolla intended to use Mansherry's healing powers to revive them. However, Leo and Kabu thwarted Giolla's plans, defeated her, and rescued Mansherry."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Sugar and her fellow officers were arrested by the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/80/Sugar_Little_Black_Bears.png/revision/latest/scale-to-width-down/210?cb=20150202024604", "caption": "Sugar transforms several dwarves into toys."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Usopp_Scares_Sugar.png/revision/latest/scale-to-width-down/180?cb=20150405020147", "caption": "Sugar freaks out upon witnessing Usopp's visage."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Usopp_Scares_Sugar_Again.png/revision/latest/scale-to-width-down/210?cb=20150614171525", "caption": "Sugar freaks out again thanks to Usopp's technique."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sugar vs. Dwarves of Tontatta Kingdom", "elements": []}, {"text": "Sugar vs. Nico Robin", "elements": []}, {"text": "Sugar vs. Usopp", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She was the last officer of the Donquixote Pirates to be identified, although her name was dropped earlier by Cotton during her report to Thunder Soldier.", "elements": []}, {"text": "In the 5th Japanese Fan Poll, Sugar ranked 39th, making her the most popular officer of Doflamingo's crew. However, she did not place in the 6th poll.", "elements": []}, {"text": "Her fruit-capped fingers bear a resemblance to the modern Little Jack Horner nursery rhyme.", "elements": []}, {"text": "Ever since Usopp scared her to unconsciousness, her monocle has remained broken for the duration of her appearance in the arc (due to her eye comically bulging enough to actually break the glass).", "elements": []}, {"text": "Sugar is the second opponent defeated by Usopp through psychological fear (the first being Perona).", "elements": []}, {"text": "Sugar's favorite food is grapes.", "elements": []}]}], "images": []}]}