{"sections": [{"title": "Nico Olvia", "level": 1, "content": [{"type": "paragraph", "text": "Nico Olvia was the mother of Nico Robin, the younger sister of Oran, the sister-in-law of Roji, the paternal aunt of Mizuira and an archaeologist of 22 years ago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nico Olvia resembled her daughter (before timeskip appearance) in many ways: they shared almost identical facial and physical features, and had identically shaped and colored eyes (brown in the manga and blue in the anime). However, Olvia's hair was white instead of black. Her hair was also longer and slightly curly, and in the anime, she had a lighter skin tone. When she departed from Ohara in order to find the Poneglyphs, she had shorter hair."}, {"type": "paragraph", "text": "When she returned from her prison, she sported a completely different attire, consisting of a fur-lined coat over a light blue T-shirt and long green trousers. Around her waist, she had a belt decorated by many golden disk-like ornaments. A modest necklace with a thin rope and three little pearls on it circled her neck."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nico Olvia was well aware of the World Government's hostility against Ohara, and was conscious of the fact that searching for the Poneglyphs would be dangerous. Despite that, she set sail, wanting to let the world know the true history and the events that occurred during the Void Century, and endured the imprisonment without confessing, proving herself as a brave and determined woman."}, {"type": "paragraph", "text": "She was also very attached to her daughter, Robin, and the decision to leave hurt her very much. However, she did not lose hope and was willing to remain behind during the fire in the Tree of Knowledge in order to save the books, while sending Robin away with Saul, in order to give her daughter a chance to live to the fullest and to discover the true history and hand it down to others."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Nico Robin", "level": 4, "content": [{"type": "paragraph", "text": "She was the mother of Nico Robin, and was very fond of her daughter. However, her life's work called her away, forcing her to leave Robin behind. She regretted never being there for Robin, but died proud of her for being an amazing, smart child, who could even decipher Poneglyphs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Mother_and_Daughter.png/revision/latest/scale-to-width-down/200?cb=20130619000632", "caption": "Olvia saying goodbye to her 2-year-old daughter Robin as she leaves her behind."}]}, {"title": "Husband", "level": 4, "content": [{"type": "paragraph", "text": "Olvia's husband died many years before the storyline began. However, it can be assumed that she held him in high regard, as she left Ohara to study the Poneglyphs in order to honor his wishes. The absence of him from Robin's flashback suggests that he died before she was born, or when she was too young to remember him."}], "images": []}, {"title": "Oran and Roji", "level": 4, "content": [{"type": "paragraph", "text": "Oran accepted responsibility of Robin's care upon Olvia's departure, although his wife was against it."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Jaguar D. Saul", "level": 4, "content": [{"type": "paragraph", "text": "Olvia initially held the giant Vice Admiral in contempt for murdering her colleagues and blindly complying with the World Government's policies without knowledge of the entire situation. Despite still resenting Saul after he released her from incarceration, she was concerned enough to warn him that he could never return to the Marines due to his treasonous actions. Olvia finally trusted him by requesting Saul to protect her daughter and evacuate her from Ohara."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a scholar from Ohara, Olvia had the skills to read Poneglyphs, thus being one of the few people with the ability to discover the truth about the Void Century, and the exact locations of the ancient weapons. As an archaeologist, she had considerable knowledge of history."}, {"type": "paragraph", "text": "She had proven herself as a determined woman: she withstood imprisonment at the hands of the World Government without confessing that she was from Ohara, and with the help of Saul was able to escape and return to her homeland. She also has great endurance, as she sustained a beating from two CP9 members and was still able to stand up and help her companions to move books from the Tree of Knowledge to the nearby lake in order to conserve them."}, {"type": "paragraph", "text": "She also had some skill in wielding a rifle. She managed to shoot through the cloth of Spandine's coat without hurting him, but just as a way of intimidating him. Olvia was confident she would have hit him with the next shot if she had the chance."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "At the age of twenty-seven, after her husband died, she set out on a six-year journey to research the Poneglyph along with thirty three other archaeologists. Although she found it regrettable that she had to leave Robin, it was something she felt she had to do. She left Robin in her brother and his wife's care."}, {"type": "paragraph", "text": "At the end of the sixth year of the expedition, her ship was caught by the Marines. Her colleagues fought back to defend Olvia and all were killed except for her. From the moment of capture, her fate was determined. Olvia was interrogated by Jaguar D. Saul, and imprisoned. She was then set free by Saul who was disgusted by the World Government's Justice system and managed to get away with the Marine's ship. She was grateful to the giant; however, she refused to forgive him for the actions he and his men committed to stop the expeditions and for killing her comrades."}, {"type": "paragraph", "text": "Upon arriving at Ohara, Olvia went to the Tree of Knowledge's library. She apologized to her colleagues for failing in the expedition and for pitting the World Government against Ohara, but they instead apologized to Olvia for sending her on such a dangerous journey, and remarked that the World Government had always been against the scholars, as they knew how to read Poneglyphs and as such, how to presumably come into possession of the Ancient Weapons."}, {"type": "paragraph", "text": "As she was warning them about the threat they were under, she heard that a World Government ship had docked on the shore. She grabbed a rifle from a rack and ran, unaware that her daughter Robin was running past her at that exact moment going the opposite way."}, {"type": "paragraph", "text": "She later reached Spandine, and shot him in his jacket's sleeve to intimidate him. The CP9 leader explained to her that all of the World Government battleships were there in order to destroy Ohara, as a warning to all those who researched the Poneglyphs, and then ordered his subordinates to take her down. She was knocked out and arrested. She was then thrown before the faces of the incapacitated scholars, so as to force them to show their association with the woman and automatically prove their \"guilt\"."}, {"type": "paragraph", "text": "After the truth was spoken to the World Government by Clover, Olvia was confronted by Robin as she was being taken away and finally, after Robin's pleas, she admitted her relationship with her. As the Buster Call was about to begin, Spandine ordered that she be taken with them, but panicked after being almost directly hit by an explosion and ran off."}, {"type": "paragraph", "text": "Nico Olvia was left behind and was finally reunited with her daughter. She hugged her and remarked that she was very proud of her. She then pleaded to Saul to take Robin to safety and told Robin to continue to live, to hand down the history to others, and to live her life to the fullest."}, {"type": "paragraph", "text": "She assisted the other scholars in the Tree of Knowledge. As it burned down around them, she thought that she did not even leave her daughter with words said as a mother. After that, the tree fell and she along with the rest of the scholars were presumed to have perished."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Jaguar_D._Saul_Meets_Nico_Olvia.png/revision/latest/scale-to-width-down/210?cb=20100613085348", "caption": "A prisoner Olvia is brought before Saul."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/40/Nico_Olvia_and_Robin_running.png/revision/latest/scale-to-width-down/210?cb=20100613091755", "caption": "Mother and daughter miss each other by scant seconds."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cd/Nico_Olvia_faces_Spandine.png/revision/latest/scale-to-width-down/210?cb=20100613092711", "caption": "Olvia faces Spandine."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Nico_Olvia_and_Robin_hug.png/revision/latest/scale-to-width-down/210?cb=20100613100302", "caption": "Olvia and Robin finally reunited."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "It should be noted that when Robin's updated (pre-timeskip) wanted poster was released, the picture looks strikingly similar to how Olvia's poster did. The shot focuses on the right side of her face which is placed towards the left of the shot, with some sort of destructive implications in the background (flames in Olvia's poster, heavy smoke in Robin's).", "elements": []}, {"text": "She shares her birthday with her daughter.", "elements": []}, {"text": "In the Japanese and English anime, she has the same voice actress as Robin.", "elements": []}, {"text": "In a Japanese fan poll, Nico Olvia is currently the 122nd most popular character in One Piece.", "elements": []}]}], "images": []}]}