{"sections": [{"title": "Rampo", "level": 1, "content": [{"type": "paragraph", "text": "Rampo is a dwarf from Tontatta Kingdom who first appeared on Green Bit. He is one of the two vice-chiefs of the Tontatta Kingdom along with Bomba, under Gancho and Leo."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rampo, like all of the other dwarves, is very small. He has a long, pointed nose and a wide mouth with a predominant lower lip. He wears a dark colored jacket that has buttons, a light colored scarf, dark boots, and dark pants that have a hole for his tail. He also wears a large hat, similar to Absalom's, that has a dark colored v-shaped design on it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Rampo_Manga_Color_Scheme.png/revision/latest?cb=20171201222909", "caption": "Rampo's color scheme in the manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In all of his appearances so far he has been frowning, suggesting that he has a stern personality."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He possesses the speed and power characteristic of dwarves, as seen when he and Leo quickly stole the clothes and defeated two of Doflamingo's underlings."}], "images": []}, {"title": "Tontatta Combat", "level": 3, "content": [{"type": "paragraph", "text": "He has been shown to have an ability called \"Tontatta Tail Hammer\", which is strong enough to knock down a normal person and make him get stuck to the ground, as it was seen being used against some of Doflamingo's underlings to sneak into the tower where Sugar was located."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Rampo has been seen carrying a spear, like the other dwarves. It is unknown how skilled he is in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "After capturing Usopp and Robin and bringing them to Tontatta Kingdom, Rampo was seen with the other dwarves searching Robin's body while she was pinned to the ground. They released Robin when she promised that she would not harm them. However, since she could not provide a weapon, the dwarves were going to strip her. They stopped when Flapper told them that she is a friend of the \"hero\"."}, {"type": "paragraph", "text": "The dwarves later requested Usopp to help them fight against the Donquixote Pirates much to his unpleasant surprise. An army of dwarves assembled and while bringing Usopp and Robin along, traveled through an underground passage to the Riku Royal Army headquarters located beneath the flower field where they rendezvous with Thunder Soldier."}, {"type": "paragraph", "text": "The rebels planned to attack the underground world and free all the workers there, including the 500 dwarves captured by Doflamingo. Their number one target was Sugar, the Devil Fruit user who turned humans into toys. When it was time to commence the operation, they traveled through a secret tunnel and infiltrated the trade port. Rampo was one of the dwarves carrying Usopp, along with Leo and Bomba. After Thunder Soldier separated from them to go to the royal palace, the dwarves continued on with their plan to take out Sugar. After Usopp was spotted by two of Doflamingo's subordinates, the dwarves stripped them. While they were confused, Rampo and Leo knocked them out. After Usopp and Robin put on disguises, the rebels made their way to the central tower where Sugar is located."}, {"type": "paragraph", "text": "Rampo and a few other dwarves split from the group and went with Thunder Soldier on a mission to assassinate Doflamingo. They boarded a lift to the royal palace and were later confronted by Lao G. Thunder Soldier and the dwarves fought him, but they seemed to be outmatched."}, {"type": "paragraph", "text": "The lift later reached the royal palace and Lao G continued to have the upper hand. When the palace shook due to Pica's confrontation with Luffy's group, some of the dwarves took the opportunity to pin Lao G down. Rampo encouraged Thunder Soldier to continue forward, and they proceeded together with Kabu."}, {"type": "paragraph", "text": "After fighting through several of Doflamingo's men, Rampo, Kabu, and Thunder Soldier were intercepted by Gladius. The two dwarves attempted to attack him, but the officer effortlessly caught them. Gladius then attacked them with his Devil Fruit powers, knocking them out."}, {"type": "paragraph", "text": "Rampo and his comrades were later found by Kin'emon and Wicca. They left the palace after the toys returned to their original forms."}, {"type": "paragraph", "text": "Sometime after Doflamingo trapped Dressrosa in his \"Birdcage\", Rampo and the other dwarves from Kyros' group reunited with Leo's group at the underground trade port when Kin'emon arrived there."}, {"type": "paragraph", "text": "After Doflamingo put a price on the heads of twelve people, including Usopp and Robin, the former toys turned on their saviors. The dwarves fled to the surface with Usopp, Robin, and their allies."}, {"type": "paragraph", "text": "After running through the colosseum stands, they later reached the top of the old King's plateau and reunite with Doldo and Viola. While Leo and Kabu decided to go with Rebecca to find Luffy, Rampo and his group decided to go to the SMILE factory to assist Franky."}, {"type": "paragraph", "text": "Once they arrived at the factory, they used pink bees to display a message to the enslaved dwarves, informing them of Doflamingo's trickery. They soon revolted and unlocked the doors to the factory, allowing Franky and Rampo's group to enter."}, {"type": "paragraph", "text": "After Franky defeated Senor Pink, the dwarves began the destruction of the SMILE factory."}, {"type": "paragraph", "text": "After exiting the destroyed factory, the dwarves carried Franky outside and were then seen looking in unison towards the city, much to Franky's confusion. Franky then told them to stop staring and run away from the shrinking Birdcage instead."}, {"type": "paragraph", "text": "While fleeing, they ran into Zoro, Kin'emon, and Kanjuro. When Zoro informed them of his plan to stop the Birdcage, the dwarves were awestruck."}, {"type": "paragraph", "text": "Since the factory cannot be cut by the Birdcage, the dwarves and Franky used it to push the Birdcage back."}, {"type": "paragraph", "text": "When Luffy finally defeated Doflamingo and brought the Birdcage down, the dwarves rejoiced with tears of joy as Luffy's victory was announced to Dressrosa."}, {"type": "paragraph", "text": "During the aftermath, the dwarves gathered in front of Kyros and saluted their commander."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. Rampo was seen standing next to Leo after the latter stitched the Marines' ships together."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Tontatta_Combat_Infobox.png/revision/latest/scale-to-width-down/180?cb=20140611035026", "caption": "Rampo and Leo using Tontatta Tail Hammer."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Pamu_Pamu_no_Mi_Infobox.png/revision/latest/scale-to-width-down/180?cb=20141215214103", "caption": "Gladius subdues Kabu and Rampo."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Rampo and Leo vs. Dressrosa Guards", "elements": []}, {"text": "Rampo and Kabu vs. Gladius", "elements": []}]}], "images": []}]}