{"sections": [{"title": "Grabar", "level": 1, "content": [{"type": "paragraph", "text": "Grabar is a dwarf from Tontatta Kingdom who first appeared on Green Bit. She is Leo's grandmother."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Grabar is an average-sized stout female dwarf with a wrinkled face, raised cheekbones, and a light colored tail. She has light colored hair tied back into two bun-like ponytails. She wears a light colored sleeveless shirt, dark colored pants, a dark colored belt, a dark colored hair band, dark glasses, and has a tattoo on her right arm."}, {"type": "paragraph", "text": "In the anime, she has gray hair and wears a reddish-pink sleeveless shirt, indigo pants, brown belt, blue and black headphones and brown tinted shades."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Grabar cares for Leo's well-being, since she packed him a lunch for his mission."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Leo was fixing a shelf with his abilities before leaving for his mission, Grabar brought him a lunch that she had packed, but he said he did not need it. He decided to tie everything down in their house so nothing would fall. During this action, Grabar was tied to the wall. She calmly said how the hero that just arrived would be helpful to their people and commented on how she could not fall over, being sewn to the wall."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ef/Nui_Nui_Needle.png/revision/latest/scale-to-width-down/210?cb=20160615162929", "caption": "Grabar is sewn to the wall by Leo."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 717 and Episode 647, Grabar makes her first appearance.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 73, Grabar is named along with other dwarves.", "elements": []}]}], "images": []}]}