{"sections": [{"title": "Aremo Ganmi", "level": 1, "content": [{"type": "paragraph", "text": "Aremo Ganmi is a spectator at the Corrida Colosseum. She lives in Primula, a town in the west of Dressrosa."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "She is a young woman with short, light colored (orange in the anime) hair. She wears a dark colored, floral patterned dress and a light colored rose in her hair. In both of her appearances so far, she has always had her hands covering most of her face except for her eyes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She is a very shy woman. She has a habit of covering her face with her hands but leaving large gaps in her fingers so that she can still see perfectly well."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "She was first seen as a spectator watching the B block battle royale. While witnessing the brutality of a little fighting fish against the competitors who fell into the water, she covered her face with both hands, but left gaps between her ring and little fingers to see through."}, {"type": "paragraph", "text": "She did the same thing shortly after, upon witnessing Bartolomeo standing at the edge of the ring and openly urinating."}, {"type": "paragraph", "text": "She was later seen watching C Block, when Hajrudin crushed Fighting Bull and Luffy. She reacted by only covering her mouth with her hands, and was seen with her eyes closed for the first time."}, {"type": "paragraph", "text": "She also screamed out when Kelly Funk brutally kept punching a gladiator who was already defeated, while peeking through her fingers with one eye open."}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "As a background character without any importance outside of the SBS question in which she was named, she has been drawn inconsistently in all of her anime appearances."}, {"type": "list", "elements": [{"text": "In Episodes 637 and 645, her appearance closely matched her manga appearance, having orange hair, a pink top with purple dots, and a red flower in her hair. Picture above in her infobox.", "elements": []}, {"text": "In Episode 636, she had dark blue hair, a plain top, and no flower in her hair.", "elements": []}, {"text": "In Episode 642, she had purple hair without a flower, her top was plain red, and she was surrounded by different audience members (as the scene did not occur in the manga).", "elements": []}, {"text": "In Episode 644, she had darker brown hair without a flower, and her top was plain pink without dots.", "elements": []}, {"text": "In the special Episode of Sabo her appearance matches closely to the one in the manga, but she is missing her flower and her color scheme is different, having a pink top with yellow dots and dark brown hair.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  SBS One Piece Manga — Vol. 73 (p. 66), the VIZ translation for Ganmi's name in SBS Volume 73.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 707 and Episode 636, Aremo Ganmi makes her debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 73 (p. 66), fan question: Please tell me the name of the woman who covers her face but not her eyes!", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 707 (p. 8) and Episode 636, Aremo Ganmi covers her face when a little fighting fish attacks the competitors.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 708 (p. 14) and Episode 637, Aremo Ganmi covers her face when Bartolomeo openly urinates at the edge of the ring.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 714 (p. 9) and Episode 644.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 715 (p. 12) and Episode 645.", "elements": []}]}], "images": []}]}