{"sections": [{"title": "Maujii", "level": 1, "content": [{"type": "paragraph", "text": "Maujii is a dwarf from Tontatta Kingdom who first appeared in the SMILE Factory during the dwarves' rebellion."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Maujii, like all other dwarves, is quite short. He has a white beard and mustache and wears a helmet with a pompom that has goggles on it. He also wears an orange coat, purple gloves, blue pants, and purple boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about his personality, but he seems to have great care and concern for Princess Mansherry."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Maujii has yet to be seen fighting, but it is likely that he has the strength and speed similar to other dwarves. Sure enough, he ran with such speed that he failed to stop in time, resulting in him ramming open the storage door via sheer force despite his small stature."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, 500 dwarves, including Maujii and Princess Mansherry, were kidnapped by the Donquixote Pirates. The dwarves, except Mansherry, were forced to work in the SMILE Factory."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the revolt of the dwarves began, Maujii raced to find Mansherry. He ran into a door, knocking it open because he couldn't stop. Though he didn't find the princess, he managed to get a hold of a Den Den Mushi and contacted Leo, telling him that the princess was likely in the royal palace. He also relayed the information to Viola."}, {"type": "paragraph", "text": "While Franky battled Senor Pink, the dwarves at the factory were contacted by Viola and they were worried when they heard that Mansherry was being forced to use her healing powers on the defeated Donquixote Pirates' officers. They were then overjoyed when Leo and Kabu successfully rescued Mansherry."}, {"type": "paragraph", "text": "After Senor Pink's defeat, the dwarves proceed with the destruction of the SMILE factory."}, {"type": "paragraph", "text": "With the factory was demolished, the dwarves carried an injured Franky back outside and started fleeing from the shrinking Birdcage. They later ran into Zoro, Kin'emon, and Kanjuro. When Zoro informed them of his plan to hinder the Birdcage, the dwarves were awestruck."}, {"type": "paragraph", "text": "Since the factory cannot be cut by the Birdcage, the dwarves and Franky used it to push the Birdcage back."}, {"type": "paragraph", "text": "When Luffy finally defeated Doflamingo and brought the Birdcage down, the dwarves rejoiced with tears of joy as Luffy's victory was announced to Dressrosa."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, Maujii accompanied Mansherry while she was receiving donations from the Marines to heal the injured citizens. Unbeknownst to the Marines, the donations they gave to Mansherry rendered them incapacitated when they were mobilized to pursue Luffy and his allies. Mansherry wondered if it was alright to leave them immobilized, but Maujii assured her that they received permission from Kyros."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 76 Chapter 755 and Episode 692, Maujii makes his first appearance.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 88 Chapter 889, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 22.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 73, Maujii is named along with other dwarves.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 78 Chapter 779 (p. 4-5), The Dwarves destroy the SMILE factory.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 78 Chapter 785 (p. 5-6), Chao flees from the factory with the other dwarves.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 79 Chapter 787.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 79 Chapter 791.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 796.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 798.", "elements": []}]}], "images": []}]}