{"sections": [{"title": "Cotton", "level": 1, "content": [{"type": "paragraph", "text": "Cotton is a dwarf from Tontatta Kingdom who first appeared in the Riku Royal Army Headquarters beneath the Flower Field."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cotton is a normal-sized dwarf with light-colored skin, a pointed nose, large eyes, and a large, light-colored tail. She has light-colored hair that covers her right eye. She wears a light-colored hat that covers most of her head, light-colored gloves, a dark-colored jacket with light-colored buttons on it, striped legging-like pants, and dark-colored boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like the rest of the dwarves, Cotton is extremely gullible, believing that Franky and Zoro were descendants of Mont Blanc Noland."}, {"type": "paragraph", "text": "Cotton is fairly emotional, being easily moved by the story of the past conflict between the dwarves and the Donquixote Family."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Cotton's physical abilities. She seems to have an ability to recover quickly, being in perfectly capable fighting condition only mere hours after being defeated by Trebol."}, {"type": "paragraph", "text": "As a dwarf, Cotton likely has impressive speed and strength as well as the ability to cultivate any plant."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Cotton was first seen at the Riku Royal Army headquarters hidden beneath the flower fields. She and many other dwarves welcomed Thunder Soldier when he brought Franky to the headquarters. Cotton and Inhel also gave a report to the toy soldier concerning the information gathered by the scouting brigade. After Inhel spoke about the \"legendary heroes\" and said their supposed names, Cotton was shocked when Franky and Zoro confirmed that they are among the people Inhel mentioned."}, {"type": "paragraph", "text": "Once Usopp, Robin, and the dwarves from Green Bit arrived at the headquarters, Cotton listened to Thunder Soldier's speech about overthrowing Doflamingo."}, {"type": "paragraph", "text": "She and the other dwarves present listened as Gancho described their past history with the Donquixote Family to Robin, Usopp, and Franky, weeping at the thought of their ancestors' misfortune. When Gancho mentioned King Riku, Cotton reacted with great joy. After Gancho's speech about stopping Doflamingo from repeating his ancestor's atrocities, Cotton cheered vigorously, ready for battle."}, {"type": "paragraph", "text": "After Thunder Soldier explained about Riku Doldo III's dethronement and Dressrosa's tragedy in detail, the dwarves' plans, which Thunder Soldier dubbed \"Dressrosa Operation SOP\", were then revealed. They planned to infiltrate the underground world through a tunnel they created and defeat a Donquixote Pirates' officer known as Sugar, the Devil Fruit user who turned humans into toys."}, {"type": "paragraph", "text": "When it was time to commence the decisive operation, the dwarf rebels, Thunder Soldier, Usopp, and Robin entered the tunnel. Cotton helped Inhel, Baxcon, and Daikon carry Robin through it, and they later arrived at the underground trade port. The dwarf rebels then split into two groups. One group went with Thunder Soldier to go to the royal palace to assassinate Doflamingo while the other group, which included Cotton, remained with Usopp and Robin. Cotton's group made their way to the officer tower where Sugar was located."}, {"type": "paragraph", "text": "Once they infiltrated the officer tower, they arrived at the room Sugar resided in. Leo revealed his strategy to defeat Sugar. He planned to sneak a Tatababasco spice into her basket of grapes, hoping that she would eat it. Cotton cheered for Leo as he prepared to put his plan into motion."}, {"type": "paragraph", "text": "She was then shocked to see Sugar's bodyguard, Trebol, shot a fly with great accuracy. Therefore, Robin stopped Leo, knowing how risky it was with him in the room. After Robin lured Trebol out of the tower, Cotton and her group charged in. They attempted to attack Sugar, but she transformed some of them into toys and ordered them to fight their former comrades."}, {"type": "paragraph", "text": "They were interrupted when Trebol threw a ship at the officer tower, demolishing it. Trebol then captured the dwarves with his sticky substance. After learning who they were allying with, he ignited the sticky substance, causing it to explode."}, {"type": "paragraph", "text": "With the dwarves incapacitated and Robin transformed into a toy, all hope lied with Usopp to complete the operation. When the dwarves started calling out Usopp, Trebol mocked them, saying that they were deceived by a coward. However, they refused to stop believing in Usopp. Trebol then started stomping on the dwarves out of spite. Usopp finally mustered his courage and revealed himself. The dwarves were saddened when Usopp admitted his lies but then started cheering for Usopp when he found his resolve and attacked Trebol."}, {"type": "paragraph", "text": "When Sugar forced the Tatababasco into Usopp's mouth after he was subdued by Trebol, the dwarves were shocked to see that it actually led to Sugar's downfall as Usopp made a horrible expression that terrified Sugar to the point of losing consciousness. With the primary objective of Operation SOP completed, the dwarves wept over Usopp's success."}, {"type": "paragraph", "text": "The dwarves then carried Usopp away from an enraged Trebol while Robin held him back. They were then surprised when Hajrudin picked up Usopp. When the former slaves declared their allegiance to their savior, Usopp ordered his newfound followers to destroy the SMILE factory and the dwarves shout out Usopp's name."}, {"type": "paragraph", "text": "Doflamingo later trapped Dressrosa in his \"Birdcage\" and forced everyone imprisoned into a survival game. During the chaos, Cotton's group was reunited with Wicca and Kyros' dwarf group when Kin'emon arrived at the underground trade port. Doflamingo also placed a price on the heads of twelve people. The dwarves were surprised when Doflamingo not only included Usopp in his hit list but also placed the highest price on his head. With Usopp's new followers turning into enemies, the dwarves, Usopp, Robin, Rebecca, Sabo, Koala, Hack, and Bartolomeo fled to the surface."}, {"type": "paragraph", "text": "After running through the colosseum stands, they reached the top of the old King's Plateau. The dwarves were then reunited with Riku Doldo III and Viola. While Leo and Kabu volunteered to go with Rebecca to find Luffy, the rest of the dwarves decided to go to the SMILE factory to assist Franky."}, {"type": "paragraph", "text": "After arriving at the factory, Cotton's group used the pink bees to display a message to the enslaved dwarves, informing them of Doflamingo's treachery, which subsequently led them to revolt. After the dwarves inside the factory unlocked the front door, Franky and Cotton's group entered and faced off against the factory's boss, Kyuin. When Franky hugged her in a strange manner, Cotton interpreted as an act of love. The dwarves were then shocked when Franky kissed Kyuin to stop her from rampaging."}, {"type": "paragraph", "text": "While Franky battled Senor Pink, the dwarves at the factory were contacted by Viola and they were worried when they heard that Mansherry was being forced to use her healing powers on the defeated Donquixote Pirates' officers. They were then overjoyed when Leo and Kabu successfully rescued Mansherry."}, {"type": "paragraph", "text": "After Senor Pink's defeat, the dwarves proceed with the destruction of the SMILE factory."}, {"type": "paragraph", "text": "With the factory demolished, Cotton and the other dwarves carried Franky outside and were then seen looking in unison towards the city, much to Franky's confusion. Franky then told them to stop staring and run away from the shrinking Birdcage instead."}, {"type": "paragraph", "text": "While fleeing, they ran into Zoro, Kin'emon, and Kanjuro. When Zoro informed them of his plan to stop the Birdcage, the dwarves were awestruck."}, {"type": "paragraph", "text": "Since the factory cannot be cut by the Birdcage, the dwarves and Franky used it to push the Birdcage back."}, {"type": "paragraph", "text": "When Luffy finally defeated Doflamingo and brought the Birdcage down, the dwarves rejoiced with tears of joy as Luffy's victory was announced to Dressrosa."}, {"type": "paragraph", "text": "During the aftermath, the dwarves gathered in front of Kyros and saluted their commander."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. The dwarves hindered the Marines by stealing their weapons."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/SOP_Dwarves.png/revision/latest/scale-to-width-down/250?cb=20141123174726", "caption": "The SOP team: Cotton, Pellini, Inhel, Leo, Bomba, Flapper, and Bobomba."}]}]}