{"sections": [{"title": "Nubon", "level": 1, "content": [{"type": "paragraph", "text": "Nubon is a dwarf from Tontatta Kingdom who first appeared on Green Bit."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nubon is a normal sized dwarf with a stubby, round nose, thick lips, and dark lines beneath his eyes. He has bushy, light-colored hair under a large, round hat and a dark-colored mustache. He wears a long sleeved shirt with a tie and overalls."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nubon is quite gullible, believing Usopp was a descendant of Mont Blanc Noland. He is also quite brave, having sacrificed himself to allow his comrades to continue Operation SOP."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Nubon seems fairly strong, being able to topple Lao G with the assistance of Baxcon and Daikon. He was not, however, strong enough to greatly damage the pirate."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "After capturing Usopp and Robin and bringing them to the Tontatta Kingdom, Nubon was seen with the other dwarves searching Robin's body while she was pinned to the ground. They released Robin when she promised that she would not harm them. However, since she could not provide a weapon, the dwarves were going to strip her. They stopped when Flapper told them that she is a friend of the \"hero\"."}, {"type": "paragraph", "text": "The dwarves later requested Usopp to help them fight against the Donquixote Pirates much to his unpleasant surprise. An army of dwarves assembled and while bringing Usopp and Robin along, traveled through an underground passage to the Riku Royal Army HQ located beneath the flower field where they rendezvous with Thunder Soldier."}, {"type": "paragraph", "text": "After they arrived, Nubon listened to Thunder Soldier's speech about overthrowing Doflamingo."}, {"type": "paragraph", "text": "After Thunder Soldier explained about Riku Doldo III's dethronement and Dressrosa's tragedy in detail, the dwarves' plans, which Thunder Soldier dubbed \"Dressrosa Operation SOP\", were then revealed. They planned to infiltrate the underground world through a tunnel they created and defeat a Donquixote Pirates' officer known as Sugar, the Devil Fruit user who turns humans into toys."}, {"type": "paragraph", "text": "When it was time to commence the decisive operation, the dwarf rebels, Thunder Soldier, Usopp, and Robin entered the tunnel and later arrived at the underground trade port. The dwarf rebels then split into two groups. One group remained with Usopp and Robin while the other group, including Nubon, went with Thunder Soldier to go to the royal palace to assassinate Doflamingo."}, {"type": "paragraph", "text": "The group with Thunder Soldier boarded a lift to the royal palace and were later confronted by Lao G. Thunder Soldier and the dwarves fought him, but they seemed to be outmatched."}, {"type": "paragraph", "text": "The lift later reached the royal palace and Lao G continued to have the upper hand. When the palace shook due to Pica's confrontation with Luffy's group, some of the dwarves, including Nubon, took the opportunity to pin Lao G down, enabling Thunder Soldier, Kabu and Rampo to move forward."}, {"type": "paragraph", "text": "Nubon and his comrades were later found by Kin'emon and Wicca. They left the palace after the toys returned to their original forms."}, {"type": "paragraph", "text": "Sometime after Doflamingo trapped Dressrosa in his \"Birdcage\", Nubon and the other dwarves from Kyros' group reunited with Leo's group at the underground trade port when Kin'emon arrived there."}, {"type": "paragraph", "text": "After Doflamingo put a price on the heads of twelve people, including Usopp and Robin, the former toys turned on their saviors. The dwarves fled to the surface with Usopp, Robin, and their allies."}, {"type": "paragraph", "text": "After running through the colosseum stands, they later reached the top of the old King's plateau and reunite with Doldo and Viola. While Leo and Kabu decided to go with Rebecca to find Luffy, Nubon and his group decided to go to the SMILE factory to assist Franky."}, {"type": "paragraph", "text": "Once they arrived at the factory, they used pink bees to display a message to the enslaved dwarves, informing them of Doflamingo's trickery. They soon revolted and unlocked the doors to the factory, allowing Franky and Nubon's group to enter."}, {"type": "paragraph", "text": "After Franky defeated Senor Pink, the dwarves proceed with the destruction of the SMILE factory."}, {"type": "paragraph", "text": "Once the factory was demolished, the dwarves carried an injured Franky back outside and started fleeing from the shrinking Birdcage. They then ran into Zoro, Kin'emon, and Kanjuro. Once Zoro informed them of his plan to hinder the Birdcage, the dwarves were awestruck."}, {"type": "paragraph", "text": "Since the factory cannot be cut by the Birdcage, the dwarves and Franky used it to push the Birdcage back."}, {"type": "paragraph", "text": "When Luffy finally defeated Doflamingo and brought the Birdcage down, the dwarves rejoiced with tears of joy as Luffy's victory was announced to Dressrosa."}], "images": []}]}