{"sections": [{"title": "Inhel", "level": 1, "content": [{"type": "paragraph", "text": "Inhel is a dwarf from the Tontatta Kingdom who first appeared in the Riku Royal Army Headquarters beneath the Flower Field."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Inhel is a normal-sized dwarf with light-colored skin, a square face with a pointed, angular nose, a large mouth, and a large, dark-colored tail. He has dark, shoulder-length hair and wears a studded top hat. He also wears a light-colored jacket, dark-colored pants, and dark-colored boots."}, {"type": "paragraph", "text": "After becoming part of Leo's pirate crew, Inhel has a drawn scar that goes over his left eye."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Inhel_Manga_Color_Scheme.png/revision/latest/scale-to-width-down/120?cb=20171201223953", "caption": "Inhel's color scheme in the manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Inhel seems to be fairly serious when speaking with regards to Operation SOP and other business matters. He, like the rest of the dwarves, is extremely gullible."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a dwarf, Inhel can move very quickly and can lift objects several times his own weight. He is seen carrying a double-ended spear, but it is unknown how skilled his is in using it. Inhel is likely quite strong, since Leo entrusted the destruction of the SMILE Factory to his leadership."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Inhel was first seen at the Riku Royal Army headquarters hidden beneath the flower fields. He and many other dwarves welcomed Thunder Soldier when he brought Franky to the headquarters. Inhel and Cotton also gave a report to the toy soldier concerning the information gathered by the scouting brigade. After Inhel spoke about the \"legendary heroes\" and said their supposed names, he was shocked when Franky and Zoro confirmed that they are among the people he mentioned."}, {"type": "paragraph", "text": "Once Usopp, Robin, and the dwarves from Green Bit arrived at the headquarters, Inhel listened to Thunder Soldier's speech about overthrowing Doflamingo."}, {"type": "paragraph", "text": "He and the other dwarves present listened as Gancho described their past history with the Donquixote Family to Robin, Usopp, and Franky, weeping at the thought of their ancestors' misfortune. When Gancho mentioned King Riku, Inhel reacted with great joy. After Gancho's speech about stopping Doflamingo from repeating his ancestor's atrocities, Inhel cheered vigorously, ready for battle."}, {"type": "paragraph", "text": "After Thunder Soldier explained about Riku Doldo III's dethronement and Dressrosa's tragedy in detail, the dwarves' plans, which Thunder Soldier dubbed \"Dressrosa Operation SOP\", were then revealed. They planned to infiltrate the underground world through a tunnel they created and defeat a Donquixote Pirates' officer known as Sugar, the Devil Fruit user who turns humans into toys."}, {"type": "paragraph", "text": "When it was time to commence the decisive operation, the dwarf rebels, Thunder Soldier, Usopp, and Robin entered the tunnel. Inhel helped Cotton, Baxcon, and Daikon carry Robin through it, and they later arrived at the underground trade port. The dwarf rebels then split into two groups. One group went with Thunder Soldier to go to the royal palace to assassinate Doflamingo while the other group, which included Inhel, remained with Usopp and Robin. Inhel's group made their way to the officer tower where Sugar was located."}, {"type": "paragraph", "text": "Once they infiltrated the officer tower, they arrived at the room Sugar resided in. Leo revealed his strategy to defeat Sugar. He planned to sneak a Tatababasco spice into her basket of grapes, hoping that she would eat it. Inhel cheered for Leo as he prepared to put his plan into motion."}, {"type": "paragraph", "text": "He was then shocked to see Sugar's bodyguard, Trebol, shot a fly with great accuracy. Therefore, Robin stopped Leo, knowing how risky it was with him in the room. After Robin lured Trebol out of the tower, Inhel and his group charged in. They attempted to attack Sugar, but she transformed some of them into toys and ordered them to fight their former comrades."}, {"type": "paragraph", "text": "They were interrupted when Trebol threw a ship at the officer tower, demolishing it. Trebol then captured the dwarves with his sticky substance. After learning who they were allying with, he ignited the sticky substance, causing it to explode."}, {"type": "paragraph", "text": "With the dwarves incapacitated and Robin transformed into a toy, all hope lied with Usopp to complete the operation. When the dwarves started calling out Usopp, Trebol mocked them, saying that they were deceived by a coward. However, they refused to stop believing in Usopp. Trebol then started stomping on the dwarves out of spite. Usopp finally mustered his courage and revealed himself. The dwarves were saddened when Usopp admitted his lies but then started cheering for Usopp when he found his resolve and attacked Trebol."}, {"type": "paragraph", "text": "When Sugar forced the Tatababasco into Usopp's mouth after he was subdued by Trebol, the dwarves were shocked to see that it actually led to Sugar's downfall as Usopp made a horrible expression that terrified Sugar to the point of losing consciousness. With the primary objective of Operation SOP completed, the dwarves wept over Usopp's success."}, {"type": "paragraph", "text": "The dwarves then carried Usopp away from an enraged Trebol while Robin held him back. They were then surprised when Hajrudin picked up Usopp. When the former slaves declared their allegiance to their savior, Usopp ordered his newfound followers to destroy the SMILE factory and the dwarves shout out Usopp's name."}, {"type": "paragraph", "text": "Doflamingo later trapped Dressrosa in his \"bird cage\" and forced everyone imprisoned into a survival game. During the chaos, Inhel's group was reunited with Wicca and Kyros' dwarf group when Kin'emon arrived at the underground trade port. Doflamingo also placed a price on the heads of twelve people. The dwarves were surprised when Doflamingo not only included Usopp in his hit list but also placed the highest price on his head. With Usopp's new followers turning into enemies, the dwarves, Usopp, Robin, Rebecca, Sabo, Koala, Hack, and Bartolomeo fled to the surface."}, {"type": "paragraph", "text": "After they (except for Sabo and Koala) ran through the Colosseum stands, they eventually reached the top of the old King's Plateau. Inhel and the other dwarves were then reunited with Riku Doldo III and Viola. During Viola's plea to her father to trust the Straw Hat Pirates, the dwarves chimed in, saying that they were saved and the curse set by Sugar was broken because of the pirates. After Leo and Kabu decided to accompany Rebecca and Bartolomeo to find Luffy, Inhel was entrusted to lead the rest of the dwarves to help Franky destroy the SMILE Factory."}, {"type": "paragraph", "text": "Shortly afterwards, Inhel and the dwarves arrived at the Factory's entrance. Inhel told Franky that he had a plan to open the entrance and asked the pirate to deal with Senor Pink. Franky, already fighting Pink, said he would take care of it."}, {"type": "paragraph", "text": "Inhel's group used pink bees to display a message to the enslaved dwarves, informing them of Doflamingo's trickery. The dwarves inside then unlocked the doors, allowing Franky and Inhel's group to enter. During the confrontation with the factory's boss, Kyuin, Inhel was puzzled when Franky hugged her in a strange manner and was then shocked to see Franky kissed her."}, {"type": "paragraph", "text": "While Franky battled Senor Pink, the dwarves at the factory were contacted by Viola and they were worried when they heard that Mansherry was being forced to use her healing powers on the defeated Donquixote Pirates' officers. They were then overjoyed when Leo and Kabu successfully rescued Mansherry."}, {"type": "paragraph", "text": "They continued watching Franky's battle as he and Senor Pink took each other's blows. They cheered when Franky emerged victorious."}, {"type": "paragraph", "text": "With Senor Pink defeated, the dwarves proceed with the destruction of the SMILE factory."}, {"type": "paragraph", "text": "After exiting the destroyed factory, Inhel and the other dwarves carried Franky outside and were then seen looking in unison towards the city, much to Franky's confusion. Franky then told them to stop staring and run away from the shrinking Birdcage instead."}, {"type": "paragraph", "text": "While fleeing, they ran into Zoro, Kin'emon, and Kanjuro. When Zoro informed them of his plan to stop the Birdcage, the dwarves were awestruck."}, {"type": "paragraph", "text": "Since the factory cannot be cut by the Birdcage, the dwarves and Franky used it to push the Birdcage back."}, {"type": "paragraph", "text": "When Luffy finally defeated Doflamingo and brought the Birdcage down, the dwarves rejoiced with tears of joy as Luffy's victory was announced to Dressrosa."}, {"type": "paragraph", "text": "During the aftermath, the dwarves gathered in front of Kyros and saluted their commander."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, Inhel and the dwarves prepared to assist the Straw Hats' escape from Dressrosa when the Marines were mobilized to pursue the pirates."}, {"type": "paragraph", "text": "The dwarves hindered the Marines by stealing their weapons."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/SOP_Dwarves.png/revision/latest/scale-to-width-down/250?cb=20141123174726", "caption": "The SOP team: Cotton, Pellini, Inhel, Leo, Bomba, Flapper and Bobomba."}]}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "Sometime after the Straw Hats left Dressrosa, Inhel became part of Leo's newly-formed pirate group. When the citizens gave them a new ship, Inhel and the crew marveled at it before checking it out."}], "images": []}]}