{"sections": [{"title": "Kong", "level": 1, "content": [{"type": "paragraph", "text": "Kong is a former Marine and the current World Government Commander-in-Chief. He was the previous Fleet Admiral of the Marines at the time of the Battle in Edd War twenty-seven years ago. Some time after Gol D. Roger's execution twenty-four years ago Sengoku succeeded him as Fleet Admiral."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kong is an extremely muscular, broad-chested, tan-skinned, shouldered, elderly man who has his whitened hair and beard arranged in an array of spikes, some fuzz on both sides of his face, similar to a lizard's spine. He also has a stitched scar under his left eye."}, {"type": "paragraph", "text": "He wears a sleeveless dark shirt adorned with medals, revealing his muscular arms, dark green armbands, a light yellow scarf around his neck, and a white and dark grey Marine coat draped over his shoulders. The epaulettes are similar to those worn by an Admiral and Fleet Admiral, fully covered in yellow as a standard color."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Kong's personality but as a former Marine and a high ranking World Government official, he has a strong sense of justice (though it is unknown if it is moral or absolute)."}, {"type": "paragraph", "text": "He also has a large amount of pride for his position and the Marines overall, since he left Garp and Sengoku’s records untouched to prevent the Marine name from being hurt, and felt rather disappointed that they would resign."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 3, "content": [{"type": "paragraph", "text": "Kong respected Garp as he offered him the promotion to Admiral multiple times during the age of Gol D. Roger but was always rejected, something that frustrated him. He also respected Garp's decision to resign from the Marines and reassigned him as an instructor while keeping the records intact."}], "images": []}, {"title": "Sengoku", "level": 3, "content": [{"type": "paragraph", "text": "Kong selected Sengoku as his successor for becoming the next Fleet Admiral upon his promotion to Commander-in-Chief. Following Garp's resignation, he also allowed Sengoku to resign before reassigning him to General Inspector. Both are on friendly terms as they were seen having a pleasant talk at Mary Geoise upon Sengoku's resignation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "While he was the fleet admiral of the Marines, he had absolute control of the organization, under the World Government. Now, as World Government Commander-in-Chief, he works for the World Government, and possesses not only power over the Marines, but also authority over the Government's espionage agents, the Shichibukai, Enies Lobby, and the Cipher Pols. According to the World Government hierarchy, his authority is second only to the Five Elders and Im. His political powers enable him to revoke any Shichibukai title at any time, as well as being able to declare a Buster Call on any island he deems to be a threat."}, {"type": "paragraph", "text": "Political powers aside, due to his muscles, his former rank in the Marines, and his numerous scars, he could be considered rather strong, however he still has yet to reveal his powers in the series."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all Marines ranked vice admiral and above possess Haki, so with a rank above that, Kong can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Battle of the Edd War", "level": 4, "content": [{"type": "paragraph", "text": "Not much is known about Kong's past, other than by the time of the Edd War, he held the rank of Fleet Admiral of the Marines. Kong received a report about Shiki fighting Roger, and when Vice Admiral Garp went ahead to the battle, Kong was seen shouting that their conversation was not yet over, despite Garp claiming it was."}], "images": []}, {"title": "Promotion", "level": 4, "content": [{"type": "paragraph", "text": "Kong eventually was promoted from fleet admiral to World Government Commander-in-Chief, thus working directly for the World Government and leaving the Marines under Sengoku's authority."}], "images": []}, {"title": "Post-War Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Battle of Marineford, Garp approached Kong and resigned from the Marines despite the latter's attempts to persuade him otherwise. Three weeks after the war, Sengoku did the same thing. Kong was somewhat disappointed by these resignations, as both of them had been top Marines since Roger's time, but allowed them to leave on the condition that their records and titles remain untouched in order to retain their influences and legacies in order to successfully recruit new Marines in the future and also to train the next generation of young Marines. Prior to leaving, Sengoku suggested to Kong that Admiral Aokiji should be the succeeding Fleet Admiral."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Sengoku_Resigns_from_the_Marines.png/revision/latest/scale-to-width-down/210?cb=20141206163610", "caption": "Kong and Sengoku's meeting at Mary Geoise."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Kong's title is \"World Government Commander-in-Chief\" (世界政府全軍総帥, Sekai Seifu Zengun Sōsui). However, some scanlation groups on the internet originally and incorrectly translated Kong's rank as \"Pan Fleet Admiral\"."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 0 Chapter 0 (p. 3) and Episode 0, Fleet Admiral Kong receives a report in Marineford.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 64), Kong's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Kong's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 2-3) and Episode 511, Kong speaks about Sengoku's terms of resignation.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements (p. 171), A hierarchy chart of the World Government shows Kong's position.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 7) and Episode 511, Fishbonen states Haki is a power all the vice admirals and above use.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Commander-in-chief – Wikipedia article about Commander-in-chiefs.", "elements": []}]}], "images": []}]}