{"sections": [{"title": "Gion", "level": 1, "content": [{"type": "paragraph", "text": "Gion, better known by her alias Momousagi, is a Marine vice admiral."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Momousagi is a slender woman with red lipstick, long curly black hair that is tied back, and a mole on the right side of her face below her mouth. She wears a Marine coat on her shoulders like a cape, and her sleeves have pink cuffs and the epaulettes are pink. Her Marine coat has a hood, though she usually keeps it down. Underneath, she sports a short-sleeved pink shirt, with a frilled collar and an open neckline that exposes her cleavage. She wears dark brown shorts and black heels. She also possesses a black spider tattoo on her left thigh."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Gion_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20181224035813", "caption": "Gion's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Momousagi appears to be a determined and temperamental woman who is not afraid to speak her mind, even against a senior officer like Garp. She may believe in moral justice or follow her own view of justice as she seemed bothered that Garp was not the least bit worried about his grandson being in danger of being hunted down by two Yonkos, despite the latter being a pirate of the Worst Generation."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Tsuru", "level": 3, "content": [{"type": "paragraph", "text": "Momousagi and Tsuru have a close-relationship due to Tsuru treating Momousagi as her little sister."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Momousagi is capable of using Haki, and has command over all units ranked below her. She is strong enough to be considered a candidate for the promotion to admiral, despite ultimately not being selected."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Momousagi wields a sword called Konpira."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Momousagi was considered as a candidate to become one of the new admirals. However, she did not make the cut, as Issho and Ryokugyu attained the positions instead.Chaton asked her out 100 times, but she rejected him each time."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Gold", "level": 3, "content": [{"type": "paragraph", "text": "On Gran Tesoro, Momousagi was with Chaton in the VIP lounge of the casino."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Marines intercepted a communication between Big Mom and Kaido, Momousagi was at the Red Port scolding Garp for his lack of concern over two Yonko targeting Monkey D. Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/db/Gion_and_Tokikake_Arguing_With_Garp.png/revision/latest/scale-to-width-down/230?cb=20190602054141", "caption": "Gion argues with Garp and Tokikake."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She was created and named by a fan who said that she was an admiral. But since all positions of admiral had been filled, Oda made her a vice admiral instead. Oda also designed her appearance which, like the admirals, is based on a Japanese actor. In Gion's case, she's based on Michiyo Kogure.", "elements": []}, {"text": "Although she was not made admiral, she has an alias that follows the scheme of the admirals' code-names being a color and an animal. Momousagi (桃兎, Momousagi) literally means \"pink rabbit\" or \"pink hare\".", "elements": [{"text": "\"Momo\" can also mean \"peach\" in Japanese. The Japanese word for the color pink is \"momoiro\", which literally translates to \"peach-colored\", which plays off the fact that peaches are usually pink.", "elements": []}]}, {"text": "She and Tsuru are currently the highest ranked known female Marines.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  SBS One Piece Manga — Vol. 74 (p. 86), Momousagi is introduced.", "elements": []}, {"text": "↑  Anime Expo 2016", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 907 (p. 5-6) and Episode 887, Momousagi appears in the manga.", "elements": []}, {"text": "↑  One Piece Volume 777", "elements": []}, {"text": "↑ One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 7) and Episode 511, Dr. Fishbonen states Haki is a power all vice admirals use.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 75 (p. 26).", "elements": []}, {"text": "↑  One Piece Movie 13, Momousagi makes her debut.", "elements": []}]}], "images": []}]}