{"sections": [{"title": "Sealed", "level": 1, "content": [{"type": "paragraph", "text": "Sealed was an old man from One Piece: Unlimited Adventure who created Popola. He was the acting leader of the unnamed island from the game, but he sacrificed himself when he sealed himself inside of an orb with the Evil Guardian."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sealed was a tall man with light skin, white spiky hair, and a white spiky beard with part being shaped like an arrow on his lower lip. He had thin eyebrows and very prominent cheek bones, as well as deep creases around his mouth."}, {"type": "paragraph", "text": "He wore dark, round glasses and a tall, light-colored hat that has a diamond pattern on the front, a small, circular object on the top, and a feather hanging off of it. He also wore a long, light-colored cloak that has a zipper down the front, a pair of socks that go above the knee, and loafer-like shoes. He had a necklace made of large beads that holds an orb and a bell. He was usually seen sitting in his wheelchair, which has only two large wheels, and carrying a golden polearm."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sealed was quite caring, since he desired for Popola and the townspeople to be safe and happy. He was angry and disappointed at the townspeople when they wanted Popola to fight off invading pirates and when they took the orb to use for their own purposes.  He even went to the extent to protect Popola and the island to seal himself inside the orb with the Evil Guardian. He was also very intelligent, as he knew that reviving the Evil Guardian would only bring trouble to the island. He also was brave and daring, since he sacrificed himself for the good of the island."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Popola", "level": 3, "content": [{"type": "paragraph", "text": "Sealed created Popola with his magic abilities and his good-hearted spirit. He cared greatly for Popola and loved him like a father would love a son, and he also named him.  Later, when the townspeople wanted to use Popola, he defended him and told them that he was not created to be a weapon. When he sacrificed himself, Sealed entrusted Popola with the responsibility of protecting the island and keeping the Evil Guardian sealed away."}], "images": []}, {"title": "Evil Guardian", "level": 3, "content": [{"type": "paragraph", "text": "When the idea of reviving the statue of the island's ancient guardian came up in discussion of how to protect the island, Sealed strongly disapproved and warned that giving something life out of hate would only bring more pain. After the Evil Guardian was animated, it turned against the townspeople and slaughtered all of them, leaving behind only Sealed and Popola. Sealed felt that the creature's existence was his fault, so he took it upon himself to seal it away."}], "images": []}, {"title": "Towns People", "level": 3, "content": [{"type": "paragraph", "text": "Sealed seemed to be the acting leader of the island, since the townspeople addressed him for help and guidance. Sealed provided the island with bountiful harvests and cared greatly for their well being. The townspeople, however, began to trust Sealed less and blamed him for not protecting the island to the best of his ability.  They used the orb to animate the statue of their ancient guardian, but it killed everyone but Sealed and Popola in the process. Sealed vowed to seal the creature away to avenge them."}], "images": []}, {"title": "Monkey D. Luffy", "level": 3, "content": [{"type": "paragraph", "text": "Sealed was very grateful towards Luffy for his kindness to Popola and thanked him for being the creature's friend. The rest of Luffy's crew could not see him, showing that Luffy had the strongest bond with Popola."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Though Sealed may have been quite old, he did have decent endurance, since he was able to hold off the Evil Guardian for some time before sealing it inside the orb."}], "images": []}, {"title": "Unknown Ability", "level": 3, "content": [{"type": "paragraph", "text": "Sealed had a strange ability that could allow him to do miraculous things. He used this ability to create Popola, provide his island with good harvests, and seal away the Evil Guardian. It is unknown whether this ability stems from a Devil Fruit or some form of magic."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Sealed was seen carrying a polearm with a hammer on the end of it, but he has not been shown fighting with it. It is unknown how skilled he was in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Over 1000 years ago, Sealed created Popola out of a clay-like substance and named him “Popola”. Later, the townspeople of the island approached Sealed, thanking him for providing them with a bountiful harvest but demanding that he use Popola to defend the island from invaders. After refusing to use Popola as a method of defense, Sealed discovered that the townspeople had stolen his orb with plans to animate the statue of the island's guardian god. He warned the people that if something was given life out of hatred the creation would cause harm."}, {"type": "paragraph", "text": "The towns people did not listen, animating the statue, but the creation killed everyone on the island except for Sealed and Popola. The two visited the grave for the fallen, and Sealed deemed that he was personally responsible for the recent events. He and Popola approached the creation, and, after some struggle, Sealed decided that he must sacrifice himself to save Popola. Dying, Sealed asked that Popola protect the island until someone came to stop the evil force for good and uses the last of his remaining strength to seal the creature away."}], "images": []}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "After Sealed sacrificed himself, Popola erected a grave for his fallen master and vowed to protect the island like Sealed had wanted him to do."}], "images": []}, {"title": "Unlimited Adventure", "level": 3, "content": [{"type": "paragraph", "text": "Throughout the events on the island, a variety of flashbacks were shown from Popola's point of view, many of them containing Sealed. With each flashback of Popola and Sealed, another flashback with one of the Straw Hat Pirates was shown in comparison. This showed the similarities of their relationship with those of Luffy and Shanks, Sanji and Zeff, Chopper and Hiriluk, as well as others."}, {"type": "paragraph", "text": "After the Evil Guardian was defeated by the Straw Hats and Popola, Sealed's ghost appeared before them. He thanked Popola for protecting the island properly and thanked Luffy for helping him and giving him friends. When Luffy responded to him, the rest of the crew started the think their captain was crazy, since they could not see Sealed's ghost. He then used the last of his essence to restore the island to the paradise-like state that he and Popola has always wanted it to be. In his final act, he not only transformed the entire island, but created more Popola-like creatures to keep the creature company."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sealed and Popola vs. Evil Guardian", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Though he was not named in the story of the game, his name was revealed in the credits.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/56/Sealed%27s_Name_in_the_Credits.png/revision/latest/scale-to-width-down/200?cb=20140617125838", "caption": "The endgame credits where Sealed's name is revealed."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece: Unlimited Adventure, Sealed is introduced.", "elements": []}, {"text": "↑  One Piece: Unlimited Adventure, Sealed's name is revealed in the credits.", "elements": []}, {"text": "↑  One Piece: Unlimited Adventure, Sealed creates Popola and names him.", "elements": []}, {"text": "↑  One Piece: Unlimited Adventure, Sealed sacrifices himself to seal away the Evil Guardian.", "elements": []}, {"text": "↑  One Piece: Unlimited Adventure, The townspeople use the orb to animate the Evil Guardian.", "elements": []}, {"text": "↑  One Piece: Unlimited Adventure, Sealed, after having his orb stolen, warns the townspeople about animating something out of hatred.", "elements": []}, {"text": "↑  One Piece: Unlimited Adventure, Sealed reappears as a spirit, thanking Luffy for helping Popola.", "elements": []}]}], "images": []}]}