{"sections": [{"title": "Merry", "level": 1, "content": [{"type": "paragraph", "text": "Merry is Kaya's loyal servant and was the one who designed the Going Merry."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Merry is a tall, formally dressed butler whose most distinguishing feature is his lamb-themed appearance. His hair is curly like a lamb's fleece and has two lamb horns sticking out of it; these have been seen shorter 20 years before the start of the series. His lips also resemble those of a lamb's. Even his collar has a fleece around it."}, {"type": "paragraph", "text": "After the timeskip, Merry has grown his hair out somewhat longer and has also grown a light mustache and goatee. His horns are also bigger."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Merry is a dutiful butler who sees his mistress' well-being the top priority. It was for this reason that he previously saw Usopp as an untrustworthy and negative influence on Kaya, and even threatened him with a gun while declaring him a criminal. Merry is also friendly and loyal with his fellow colleagues whom he trusts, as he was cordial and jovial with Klahadore when regarding Usopp's claim about former being a pirate as ridiculous, while happy with tears when Klahadore found the present that Kaya had prepared for him, considering their mistress' thoughtful and perceptiveness."}, {"type": "paragraph", "text": "However, when Klahadore revealed his true colors as the pirate Kuro, Merry realized his mistake and affirmed his loyalty to Kaya by screaming for her to run for her life. He was logical to understand that the household was not the only ones in danger, thinking the well-being of the entire village, and that it would be better to just give Kuro the entire estate and fortune as a negotiation standpoint for sparing their lives (unaware that Kuro required Kaya's death to ensure a smooth transition into a life of peaceful luxury)."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Kaya", "level": 3, "content": [{"type": "paragraph", "text": "Merry is a very dutiful and empathetic servant to his mistress, willing to fight and even die for her. He was logical enough to persuade her to just hand over her fortune and estate to Klahadore in order to preserve their lives."}], "images": []}, {"title": "Usopp", "level": 3, "content": [{"type": "paragraph", "text": "At first, he is very antagonistic towards Usopp, who would constantly jump over the fence and hedges of Kaya's mansion and tell her eccentric stories as Merry felt that Usopp's lies would somehow corrupt Kaya. When Usopp felt he had no time to explain Klahadore's betrayal to Kaya and tried to force her to leave the village, Merry immediately came to her defense and fired a gun at Usopp, wounding him in the left arm without killing him. Merry knew the tragic story behind Usopp's chronic lying - it is the only thing that helps him cope with the death of his mother, whom he tried to save from her sickness by lying that his father, Yasopp, had returned to be with his family. He does, however, change his view of Usopp after being attacked by Kuro, when he tells Kaya that Usopp had been telling the truth."}, {"type": "paragraph", "text": "Usopp, in particular, holds a strong attachment to the ship that Merry designed for the crew, to the point where it once blinded him from the inescapable fact of being irreparable, and he nearly severed his bond with the crew over that."}], "images": []}, {"title": "Kuro/Klahadore", "level": 3, "content": [{"type": "paragraph", "text": "At first, Merry trusted his fellow butler Klahadore, as they both see their mistress' well-being as the most important factor. They had a friendly relationship during the three years of serving their mistress together. They also both saw Usopp as an untrustworthy liar who only loves to cause trouble, and as such, Merry refused to believe Usopp's claim that Klahadore was a pirate attempting to steal Kaya's fortune, and even laughed it off as something ridiculous when discussing it with Klahadore. However, when his colleague revealed his true colors, Merry's trust and liking instantly turned to fear and hate."}, {"type": "paragraph", "text": "Kuro, in turn, showed no genuine sympathy for Merry from the beginning, and even attempted to murder him for no necessary reason, but instead for the sheer pleasure under the crescent moon. If anything, Kuro was rather disappointed that Merry managed to cling onto his life despite that attack."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Kuro_Destroys_Kaya%27s_Present.png/revision/latest/scale-to-width-down/180?cb=20130321215742", "caption": "Merry shocked when Kuro reveals his true colors."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Merry, as a servant of Kaya, is capable of doing what his occupation requires of him. He also has some sense of how to design a ship. His ship designing skills, however, are only limited to luxury ships made solely for transport of the rich and how they look. In defense, he wielded a flintlock to shoot Usopp, and managed to graze his arm, as well as being durable enough to survive Kuro's claws."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Syrup Village Arc", "level": 4, "content": [{"type": "paragraph", "text": "One day while serving his duties, Merry noticed some trespassers come into the mansion while the guards who guarded the front gate went for lunch. Seeing this, Merry alerted Klahadore, another servant of Kaya's whom she confided in after the death of her parents. As Merry continued on with his duties that day, he received the special glasses that Kaya ordered from the next town and presented them to his mistress. These glasses were to be given as a present to Klahadore for his third anniversary of him working under Kaya and her family. This, Merry agreed, would be a wonderful present."}, {"type": "paragraph", "text": "Though Merry had happily given Kaya the present that she planned to give Klahadore, he soon found her later in a dire situation. Usopp had suddenly came to her window and started babbling that Klahadore was actually a pirate named Kuro who wanted to steal her wealth. Believing that this was one of Usopp's lies in an attempt to kidnap Kaya, Merry vigilantly protected Kaya from Usopp and in the process shot Usopp in the arm. As Merry directed some of the other people of the town who were chasing after Usopp, he was left with Kaya who had collapsed from the situation."}, {"type": "paragraph", "text": "That night, when Merry met with Klahadore again after Klahadore's trip out of town, Merry informed his fellow servant of the events that transpired after Klahadore left. As Merry explained to his fellow servant what happened, Klahadore found Kaya's gift for him. Merry, seeing what Klahadore found, explained to him what it was. Suddenly without warning, Merry saw Klahadore break Kaya's gift. \"Klahadore\" then reveals his true colors as \"Kuro\", and under the crescent moon, he was overcome by a lust for blood, throwing Merry into confusion and terror. When Kuro unsheathed his Cat Claws to satisfy his uncontrollable killing intent, Merry's question for his colleague's weird behavior was answered; he instantly realized that Usopp was telling was the truth. The faithful butler immediately screamed for his mistress to run, but his voice failed to reach her before Kuro slashed him down, leaving him on the floor in a pool of his own blood."}, {"type": "paragraph", "text": "Though he was left wounded that night, Merry was fortunate enough to survive and found by his mistress. Upon being found, Merry told her what happened and asked her to try and stop Kuro from continuing with his scheme. After telling his mistress, Merry was left in the mansion while the events involving Kuro, Kuro's crew, and the Straw Hats took place. After the entire ordeal took place, Merry's mistress came back and treated his wounds. As he learned from her what had happened while being treated, Merry was asked by his mistress to keep all that had happened a secret from the villagers. He was told that this was a request from Usopp who wanted it to be this way. As Merry agreed to this request, he was then asked by Kaya to give a ship to the Straw Hats as a reward for their help in the whole matter."}, {"type": "paragraph", "text": "Agreeing to Kaya's request, Merry prepared the Going Merry for the Straw Hats. Upon presenting the ship, Merry explained the basics of the ship and how to maneuver it. After a joyful scene wherein Usopp joined up with the pirates, Merry noticed his mistress actually wanted Usopp to stay as they watched the Going Merry sail away. Seeing this, Merry confided within her a part of Usopp's past and the reason why he lies so much. After revealing Usopp's story to her, Merry asked Kaya to become stronger to repay Usopp for everything he had done for her. With that, Merry's mistress agreed and told him that she would become a doctor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Kuro_Slashes_Merry.png/revision/latest/scale-to-width-down/210?cb=20130124230248", "caption": "Kuro slashes Merry."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/79/Going_Merry_Original.png/revision/latest/scale-to-width-down/210?cb=20121208225800", "caption": "Merry presents the Going Merry to the Straw Hats."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Merry was seen protecting Kaya from a group of suitors as she continued her medical studies."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/37/Merry_protecting_Kaya.png/revision/latest/scale-to-width-down/180?cb=20181108181617", "caption": "Merry protecting Kaya."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Merry is the first of three civilians that have a personal Jolly Roger, the others being Sabo (as a child) and Riku Doldo III.", "elements": [{"text": "The Jolly Roger was on the original flag of his masterpiece, the Going Merry, until it was replaced with the Straw Hats' by Usopp.", "elements": []}, {"text": "The Jolly Roger is a depiction of Merry's face with the word \"GO!\" beneath it.", "elements": []}]}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Merry%27s_Personal_Jolly_Roger.png/revision/latest/scale-to-width-down/120?cb=20190301100751", "caption": "Merry's personal Jolly Roger."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  SBS One Piece Manga — Vol. 86.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Merry's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 623, cover story: From the Decks of the World Vol. 9, Merry fends off suitors as Kaya studies.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 24 and Episode 11, Merry alerts Klahadore that some intruders came into the mansion while the guards were out for lunch.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 4 Chapter 27.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 4 Chapter 27 and Episode 11, Merry shoots Usopp in the arm.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 4 Chapter 28 and Episode 12, Kuro strikes down Merry before he could alert Kaya.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 4 Chapter 31 and Episode 13, Merry is found by Kaya and asks her to stop Kuro.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 5 Chapter 40 and Episode 17, Merry is treated by Kaya and was asked several things by his mistress.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 5 Chapter 41 and Episode 17, Merry presents the Going Merry to the Straw Hats and reveals Usopp's past to Kaya.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Domestic sheep – Wikipedia article on the animal Merry is themed after.", "elements": []}, {"text": "Mary Had a Little Lamb – Wikipedia article about the nursery rhyme Merry's appearance and name reference to.", "elements": []}]}], "images": []}]}