{"sections": [{"title": "Gardoa", "level": 1, "content": [{"type": "paragraph", "text": "Gardoa the Beautiful Bounty Hunter is a non-canon gladiator of the Corrida Colosseum."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gardoa is a fair-skinned man with burgundy-colored hair, brown eyes, and a fairly attractive facial structure, similar to Cavendish. He wears a white, frilled shirt, a pink neckerchief, gold suspenders, red pants, and silver gauntlets on his wrists."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Gardoa_Full_Body.png/revision/latest/scale-to-width-down/200?cb=20140823130147", "caption": "Gardoa's full body appearance."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like Cavendish, Gardoa seems to take pride in his good looks. He is fairly self-centered otherwise, wanting to capture pirates to use their bounties for buying new spears for himself."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Gardoa, despite being an esteemed bounty hunter with above-average strength, has fairly low endurance and pales in comparison to powerful fighters, since he was swiftly defeated by Cavendish."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Gardoa has been seen fighting with a blue halberd with a gold axehead and spearhead tip on it. It has a dragon spiral design on it, as well as gold dragon heads near each end. He is quite skilled in using it, having defeated many pirates in the past. His weapon capabilities, however, are lackluster compared to Cavendish, who quickly destroyed Gardoa's weapon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b4/Gardoa%27s_Halberd.png/revision/latest/scale-to-width-down/180?cb=20140823115800", "caption": "Gardoa wielding his halberd."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Gardoa entered a tournament at the Corrida Colosseum to compete for the Mera Mera no Mi. For the battle royale, he was placed in Block D."}, {"type": "paragraph", "text": "Gardoa battled against Cavendish and bragged about how he used the bounties of captured pirates to get shinier spears. He then stated that he will get a diamond spear after collecting Cavendish's bounty. After a brief struggle, Cavendish defeats him while cutting his spear into pieces. Before Gardoa passed out, Cavendish acknowledged his effort, saying that he does not forgive people who try to best him."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Gardoa vs. Cavendish", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Anime — Episode 654.", "elements": []}]}], "images": []}]}