{"sections": [{"title": "Kyuin", "level": 1, "content": [{"type": "paragraph", "text": "Kyuin was the boss of the SMILE Factory on Dressrosa."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kyuin is a very large woman with twintails that wears a coat and a dress with the word \"SMILE\", moreover she wears a luchador mask covering most of her head and face—a feature common amongst Donquixote Pirates subordinates. On her right upper forearm is a tattoo of the kanji for the word \"Factory\" (工場, Kōjō)."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kyuin is confident of her own powers, believing herself to be the top within the factory. She can be infuriated when injured, and will use her authority to judge and execute anyone within the factory who strikes her displeasure, as when Franky used a suplex move on her to smash against Senor Pink, she threatened him viciously. However, once Franky kissed her to silence her rambling, she showed a more reserved and shy side."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the boss of the SMILE Factory, she has authority over the entire facility. Kyuin is shown to be quite tough."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Her weapon is a vacuum cleaner, which she uses to suck in any dwarves who try to defy her."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the enslaved Tontatta dwarves revolted and attempted to open the front doors of the SMILE factory, Kyuin immediately stepped in and attacked them by sucking them with her vacuum. However, the dwarves managed to open the doors, allowing Franky to enter. After she recognized him as one of the people on Doflamingo's hit list, Franky gave her a hug. When Senor Pink charged in, Franky used a suplex move to smash her head against that of Senor Pink's, causing Kyuin to fly into a fury. Franky then shut her up by kissing her. Confused at first, she blushingly told Franky to take responsibility for his actions and become her boyfriend only to be scolded by Senor Pink. She then watched as Franky and Senor Pink continue on with their battle."}, {"type": "paragraph", "text": "Kyuin later rushed to Senor Pink's side after he was defeated by Franky."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c9/Franky_vs._Senor_Pink_and_Kyuin.png/revision/latest/scale-to-width-down/200?cb=20151130010122", "caption": "Franky suplexes Kyuin's head into Senor Pink's."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "\"Gang\" Bege's Oh My Family", "level": 4, "content": [{"type": "paragraph", "text": "Having remained in Dressrosa, an intoxicated Kyuin was seen kissing and consequently knocking out civilians and Marines that were attempting to subdue her."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is a pun on \"Kyūin\" (吸引, \"Kyūin\"), meaning suction.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 76 Chapter 755 (p. 7-13) and Episodes 692–693, Kyuin makes her debut.", "elements": []}, {"text": "↑  https://one-piece.com/special/sbs/detail/3.html/", "elements": []}, {"text": "↑  One Piece Manga — Vol. 77 Chapter 775, Kyuin rushes to Senor Pink after his defeat.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 961, cover story: \"Gang\" Bege's Oh My Family Vol. 11, Civilians point Vito and Gotti to Kyuin.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 962, cover story: \"Gang\" Bege's Oh My Family Vol. 12, An intoxicated Kyuin is seen.", "elements": []}]}], "images": []}]}