{"sections": [{"title": "Tokikake", "level": 1, "content": [{"type": "paragraph", "text": "Tokikake, better known by his alias Chaton, is a Marine vice admiral."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tokikake has broad shoulders, an angular jawline, thin eyes, and a sharp nose. He also has a large mouth, high cheekbones, and thick eyebrows. He wears a dark-colored fedora hat, a Marine jacket with a high collar similar to Issho's, a button-down long-sleeved blue shirt underneath with the sleeves partially rolled up, and a necklace that seems to have some kind of charm attached to it. He sports a yellow haramaki on his waist, and wears brown trousers. Like his friend Issho, he wears geta sandals. His Marine jacket has brown sleeve cuffs, matching the color in his alias. His jacket is also unique in that it sports a gridline pattern design. His hat has a band going around it that sports the same gridline pattern. He is often seen smoking a pipe."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/30/Tokikake_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20181224035441", "caption": "Tokikake's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Tokikake strongly believes in Justice, although he may have his own view of justice as he had no issues with Gion questioning Garp's lack of concern for his grandson, despite the latter being a pirate. He also seems to scare easily, as he panicked when a turtle car crashed in front of him on the golf course on Gran Tesoro. Despite this, he can be very relaxed and showed no concern over the threat of Kaido and Charlotte Linlin teaming up. He has a love for pretty women and will say \"pretty woman\" if speaking to one, such as Gion."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Issho", "level": 3, "content": [{"type": "paragraph", "text": "Tokikake has been stated to be friends with Fujitora."}], "images": []}, {"title": "Gion", "level": 3, "content": [{"type": "paragraph", "text": "Tokikake may have feelings for Gion, as he asked her out over 100 times. However, she does not reciprocate, as she rejected him every time."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Tokikake is capable of using Haki, and has command over all soldiers ranked below him. He is strong enough to be considered for the promotion to admiral, despite ultimately not being selected."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "During the timeskip, Tokikake was considered as a candidate to become one of the new admirals. However, he did not make the cut, as Issho and Ryokugyu attained the positions instead. He asked Momousagi out 100 times but was rejected each time."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Gold", "level": 3, "content": [{"type": "paragraph", "text": "On Gran Tesoro, Tokikake played golf with several women around him. However, a turtle car driven by Monkey D. Luffy, Usopp, and Tony Tony Chopper suddenly arrived on the golf course, sending Tokikake into a panic."}, {"type": "paragraph", "text": "Later, Tokikake was with Momousagi in the VIP lounge of the casino."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Marines intercepted a communication between Big Mom and Kaido, Tokikake was at the Red Port talking with Garp and Gion about the possibility of the two Yonko teaming up to kill Monkey D. Luffy. Despite the tense situation, he remained mostly relaxed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/db/Gion_and_Tokikake_Arguing_With_Garp.png/revision/latest/scale-to-width-down/230?cb=20190602054141", "caption": "Tokikake argues with Gion and Garp."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Although he was not made admiral, his alias follows the scheme of the admirals' code-names being a color and an animal. Chaton (茶豚, Chaton) literally means \"brown pig\", and the Japanese word for brown is cha-iro (茶色, brown color).", "elements": [{"text": "Coincidentally, Chaton is also the French word for \"kitten\", which also fits the animal theme.", "elements": []}]}, {"text": "Also like the admirals, his appearance is based on a real actor. In this case, Kiyoshi Atsumi, specifically in his most famous role as the star of the Tora-san film series. His hat, haramaki, necklace, and jacket are of similar design to the titular character Torajirō Kuruma.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  SBS One Piece Manga — Vol. 75 (p. 26).", "elements": []}, {"text": "↑  Anime Expo 2016", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 907 (p. 5-6) and Episode 887.", "elements": []}, {"text": "↑  One Piece Movie 13, Chaton makes his debut.", "elements": []}, {"text": "↑  One Piece Volume 777", "elements": []}, {"text": "↑ One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 7) and Episode 511, Dr. Fishbonen states Haki is a power all vice admirals use.", "elements": []}]}], "images": []}]}