{"sections": [{"title": "Iceburg", "level": 1, "content": [{"type": "paragraph", "text": "Iceburg is the president of the Galley-La company and the mayor of Water 7. He was formerly one of Tom's Workers."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Iceburg is a tall middle aged man with blue hair and similarly colored lips. He wears a red and orange striped jacket over an unbuttoned orange shirt with a wide collar, black suit pants and black shoes. He usually keeps his pet mouse, Tyrannosaurus, in a pocket on the left side of his jacket, caressing his little head with his right hand. During his youth, he had longer hair, almost reaching his shoulders, and was usually seen with a white bandanna; he wore simpler clothes, consisting of a brown T-shirt, beige pants and black shoes. Flashbacks to his youth also show that he has purple tattoos on both shoulders, though these have not been seen in the present since he typically wears long-sleeved shirts."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Iceburg is the mayor of Water 7 as well as president of the Galley-La Company, and thus the most important person in the city. However, he is by no means haughty: on his first appearance, he personally accompanied Luffy, Usopp and Nami around Dock 1, showing them the place, and he was seen talking informally and with pleasure with one of the shipwrights in his employ. Both his subordinates and his citizens show an incredible love for him, so it could be assumed that he's an excellent leader."}, {"type": "paragraph", "text": "Iceburg at times seems to act rather childish, canceling all of his meetings so that he can show people around, refusing to meet with people because he does not like them, finding animals on the ground and taking care of them, and other such behaviors. (He currently has a mouse that he named \"Tyrannosaurus\"). However, when the time comes, he can be very serious, and it becomes clear that his childishness is only when he is relaxed. He also has a tendency to say, \"Nmaa\" or \"Oh my\" (\"Mwell\" in the FUNimation dub) whenever he talks."}, {"type": "paragraph", "text": "Iceburg is a person who is against making weapons because he believes they are meant to hurt people even if the person who made them has no ill intent as shown when he kept telling Franky to stop making his battleships during their younger years."}, {"type": "paragraph", "text": "As a shipwright, Iceburg has a deep understanding and sympathy for ships, as he saw the Going Merry was well taken care of despite the accumulated terminal damage it has incurred. He complied with the ship's plea to repair it for one more journey despite not fully knowing if the voice was real and that it was already beyond any hope, and upon witnessing Merry sailing on its own, Iceburg was determined to see this miracle up close that he would risk sailing through the Aqua Laguna."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/df/Carefree_Iceburg.png/revision/latest/scale-to-width-down/200?cb=20130510175018", "caption": "Iceburg in a carefree mood."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Galley-La Company", "level": 3, "content": [{"type": "paragraph", "text": "Iceburg is the beloved mayor of the people of Water 7, especially by all of his workers. They enjoy his company and often ask for his opinion and input on anything having to do with building ships. They are very protective of Iceburg as they sought retribution when Iceburg was harmed and they will fight to defend him."}], "images": []}, {"title": "Tyrannosaurus", "level": 4, "content": [{"type": "paragraph", "text": "He's very attached to his pet mouse Tyrannosaurus, who can always be seen with him, usually in his left breast pocket."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Tyrannosaurus_Anime_Pre_Timeskip_Infobox.png/revision/latest/scale-to-width-down/120?cb=20130809005726", "caption": "Iceburg's pet Tyrannosaurus."}]}, {"title": "Tom's Workers", "level": 3, "content": [], "images": []}, {"title": "Tom", "level": 4, "content": [{"type": "paragraph", "text": "As his mentor, Tom held a great amount of importance to Iceburg. He was trained as a shipwright from a young age by Tom, and respected him and his skills immensely. Iceburg worked with Tom and Franky on the Sea Train. When Tom gave himself up to the World Government, Iceburg was seen crying."}], "images": []}, {"title": "Franky", "level": 4, "content": [{"type": "paragraph", "text": "Iceburg was the one who gave him the nickname \"Franky\" because he thought Cutty Flam was a weird name; later, when he passed on the Pluton blueprints, he was the one who asked Franky to use only that name to protect himself from anyone who would want to steal the plans. His relationship with Franky is strange at times as he has never really understood Franky's often weird antics, and Franky was prone to calling him \"Baka-berg\" or \"Ahoberg\" at times, \"Baka\" and \"Aho\" being the Japanese words for \"idiot\" or \"moron\" or something similar; the English dub changed this to \"Ice for brains\". Likewise, Iceburg called him \"Bakanky\", a portmanteau of \"Baka\" and \"Franky\", changed to \"Flunky\" in the English dub. His original goal to build a ship strong enough to kill a Sea King was always shunned by Iceburg who did not understand why he kept building his weird and potentially dangerous ships. When the Battle Franky's were used to hurt the innocent, Iceburg was very angry at Franky. Since then, however, Iceburg has forgiven Franky for the part his Battle Frankys played in the framing of Tom, and despite the differences between Iceburg and Franky, the two former apprentices of Tom are still the best of friends. Iceburg was relieved to the point of tears to find out Franky was alive after he was brutally hit by the Sea Train, and likewise, Franky was utterly enraged with CP9 after they told him Iceburg was supposedly dead. Iceburg was also the only person aware that Franky's grief towards Tom's death was the real reason behind Franky's actions in Water 7 and why he refused to leave. In the end, Iceburg was able to help Franky overcome that grief by helping him realize he needed to forgive himself, enabling Franky to join the Straw Hat Pirates."}], "images": []}, {"title": "Kokoro", "level": 4, "content": [{"type": "paragraph", "text": "During his time as Tom's apprentice, Kokoro served as a matronly figure to Iceburg and Franky. Iceburg maintained a relationship with Kokoro after Tom's arrest and Franky's presumed death, spending many years meeting up together as drinking buddies."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Iceburg is the Mayor of Water 7 and the CEO of Galley-La, the company he united together single-handedly, overall giving him complete control over the island."}], "images": []}, {"title": "Carpentry", "level": 3, "content": [{"type": "paragraph", "text": "Having been personally taught by Tom, who was hailed as the greatest shipwright of his time, Iceburg is a brilliant shipwright like Franky. He was able to unite all the shipyards of Water 7 under his leadership to form the Galley-La Company, which is an organization of the finest shipwrights in the world. Iceburg later became one of the five who crafted the Thousand Sunny for the Straw Hat Pirates. His skills in naval architecture were already evident in his youth, when he helped in the construction of the Sea Train with Tom. He was also able to repair the failed prototype Sea Train Rocketman in time for the Straw Hats to use it to get to Enies Lobby within a short period of time, as well as fixing the Going Merry, which was already badly damaged beyond repair, to usable condition by himself in the midst of Aqua Laguna while still injured by the attack from the CP9. His understanding of naval architecture is great enough that he intends to convert the very city of Water 7 into a giant floating boat to overcome the future problems of Aqua Laguna."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "He has proven at different times to have great endurance and resistance, as seen when he was able to stand up after he and Tom endured a bombardment from the fleet of Battle Franky ships, which were powerful enough to kill a Sea King, and when he went to the station to check the Rocket Man after receiving severe injuries from the CP9."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was seen wielding a flintlock pistol against Luffy and Nico Robin, and it might be assumed that he's capable of using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Apprentice Years", "level": 4, "content": [{"type": "paragraph", "text": "Iceburg was an apprentice of the fish-man Tom, the legendary shipwright of Water 7 along with Cutty Flam, another young boy a few years younger than himself. The two apprentices were constantly arguing with each other since all Franky wanted to do was build a weird ship that could take down a Sea King while Tom laughed at their antics."}, {"type": "paragraph", "text": "One day, Tom was put in front of a jury for building the Oro Jackson, the ship of the late Pirate King Gol D. Roger. Tom was given 10 years to complete his plans for the \"Sea Train\" to be pardoned for his crime. Iceburg believed Tom was completely innocent of building the ship and decided to work his hardest to aid Tom while Franky continued to build his ships."}, {"type": "paragraph", "text": "Finally, the day came for Tom to be pardoned. With the Sea Train working and Water 7 now enjoying a burgeoning trade business, things looked fine. However prior to the final jury service for Tom, Spandam had come to Water 7 to unsuccessfully get Tom to hand over the plans for the ancient weapon Pluton. Being sore about his rejection, Spandam stole a fleet of Franky's unmistakable battleships and attacked the jury team, slipping away quickly once the job was done, but not after having attacked Tom and Iceburg as well. All of Tom's workers were arrested and accused of trying to attack the jury ship. Since Tom was granted a pardon for his previous crime, he choose to have the attack pardoned to save his apprentices from being charged as accomplices and announced he was proud to have built Gol D. Roger's ship."}, {"type": "paragraph", "text": "After Tom was taken away in the very Sea Train he had built, news came back to Iceburg and Kokoro that Cutty Flam had died, having attempted to stop the Sea Train from taking Tom away. Iceburg, now the only survivor of the company, inherited the position of guarding the blueprints to Pluton."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Tom%27s_Workers_Finish_Sea_Train.png/revision/latest/scale-to-width-down/250?cb=20130920052206", "caption": "Tom's workers as they finished the Puffing Tom."}]}, {"title": "The Rise to Prominence", "level": 4, "content": [{"type": "paragraph", "text": "As he was considered the only surviving assistant to Tom, Iceburg saw himself as the only one who could carry out Tom's dream of transforming Water 7. He proceeded to unite all shipyards in Water 7 under one company, the Galley-La Company. With all the best shipwrights working together, he built up a world wide corporation and became a purveyor for the World Government. After ascending to mayor of Water 7, he soon became supported by the whole town. With this position came the notion that he was now an indispensable and upstanding citizen, and simply getting rid of Iceburg by illicit means was not an option anymore. He had successfully legitimized himself and the Pluton blueprints were safe."}], "images": []}, {"title": "Return of an Old Friend", "level": 4, "content": [{"type": "paragraph", "text": "Iceburg was the holder of the blueprints to Pluton for four years after Tom's death. After those four years, he secretly gave them to the man who he thought to be dead, Cutty Flam. As this was done in secret, the government still believed that Iceburg was in possession of Pluton's blueprints. As such, he was forever pestered by government agents who came to try and convince him to hand over the blueprints."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "After years of being stalked by government officers for the Pluton plans, the strongest division of the Cipher Pol were secretly sent for Iceburg. Without him knowing, four of the CP9 agents infiltrated Water 7 and disguised themselves to look like normal people, several even gaining entry into his trusted inner circle. When the infamous Straw Hat Pirates docked at Water 7, they went looking for someone to fix their ship that's when they met Iceburg and his secretary, Kalifa. As they were entering the dock, the pirate's money was stolen by the city's most notorious criminals and dismantlers, the Franky Family, led by none other than Franky himself. Luckly, Paulie and Rob Lucci, shipwrights from Dock 1, retrieved the money. Kaku, another shipwright, arrived from his inspection of the ship, and revealed that in the ship's current condition, it would be an impossible fix. Luffy was shocked and dismayed, but Iceburg simply recommended him to think about buying a new ship, and went to his house."}, {"type": "paragraph", "text": "While sleeping in the Galley-La Headquarters, Iceburg was almost shot to death. The next morning, he revealed that the one who shot him was none other than Nico Robin of the Straw Hat Pirates, along with a masked man. Upon learning this, the Galley-La Company workers came to the conclusion that the Straw Hat Pirates were the assassins, and began to actively seek them out. The Galley-La foremen confronted the confused Luffy, but luckily, he escaped their grasp just in time. To prevent any more assassination attempts on Iceburg, the entire force of Galley-La's workers guarded Iceburg closely, while searching for the Straw Hats. Luffy himself later infiltrated the headquarters looking for Iceburg. Iceburg heard that Luffy was in the building and told Kalifa to find him and send him to his room. When Luffy came to Iceburg's room he immediately questioned if it was really Robin who shot him. Iceburg responded that he had no doubt whatsoever. The Mayor of Water 7 pointed his gun at Luffy and requested that Luffy hand over Robin, immediately. Luffy replied that he had no idea of where she was. Iceburg shot him, but Luffy did not get hurt because he is a rubber man. The gun's sound prompted the main shipwrights to go to Iceburg's room, but Luffy had already escaped."}, {"type": "paragraph", "text": "Later that night, the foremen of Galley-La Dock 1: Paulie, Lucci, Kaku and Tilestone guard Iceburg's room. Iceburg calls for Paulie to show him something. He revealed to Paulie about the fake Pluton blueprints, and gave him access to his vault in the other room. But Iceburg's real intentions were to drag his enemies in with the fake blueprints, since they did not know that he had given the real ones to Franky years before. Suddenly, a huge explosion occurred in the headquarters, and masked people entered the building. His guards were defeated, he was shot again by a man in a mask. Three more masked people entered the room and revealed themselves to be not only CP9, but also people that Iceburg trusted: Lucci, Kalifa, Kaku and bartender Blueno. Lucci revealed his theory about the real Pluton blueprints' whereabouts, while Kaku felt his pulse and Iceburg's heightened and nervous reactions only confirmed it. Then Luffy, Paulie, Zoro, Chopper, and Nami break into the room, trying to save Iceburg, but are beaten by the CP9's power, Rokushiki. As another bomb exploded, CP9 left, leaving the pirates, Paulie, and Iceburg to die. But in the last minute, Chopper regained consciousness and saved everyone from the burning Galley-La Headquarters."}, {"type": "paragraph", "text": "After waking up, Iceburg took Nami aside and revealed Robin's true intentions, of which she had told him while Blueno was fighting Tilestone. He stated that if Robin did not obey CP9, they would use the World Government's most terrible attack force, the Buster Call, to destroy Water 7, and frame the Straw Hats, making them be judged at the judiciary island, Enies Lobby. But if she did obey them, the crew would be able to leave Water 7 safely. The Straw Hats then resolve to rescue Robin, as they get the help of Peepley Lulu, Tilestone, Paulie, Kokoro, Chimney, Gonbe, and the Franky Family. Knowing the craft he helped create would be their only hope to pass Aqua Laguna, Iceburg prepared the prototype sea-train, Rocket Man which the group could use to leave Water 7. As he looked on, they took off into the storm venturing for Enies Lobby."}, {"type": "paragraph", "text": "Before he could head to high ground to take shelter from the Aqua Laguna, he heard someone's voice calling out to him for help. He looked around and saw none, but then realized that the one calling out to him was the Straw Hat's ship, Going Merry. The ship asked for a second chance to help its friends, and begged Iceburg to repair it. Iceburg, still suffering from gunshot wounds, used his peerless shipwright skills to let the Going Merry sail once more. The waves took the ship off out to sea, as the Going Merry gratefully thanked him. Shocked and surprised to see this miracle, Iceburg requested a ship to follow to see it up close for himself, despite the dangers of the upcoming tidal wave, and his subordinates followed him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/36/Robin_Threatening_Iceburg.png/revision/latest/scale-to-width-down/240?cb=20121230111126", "caption": "Robin holding Iceburg at gunpoint during interrogation."}]}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "The next day, with the Aqua Laguna lifted, Iceburg sailed the Galley-La Company ship in the direction of Enies Lobby to look for the Straw Hats and the others. He found them in the miracle ship, Going Merry, after they successfully rescued Robin, whom he caught eyes with and appeared to understandably still hold some distrust towards. But just as they meet, the Going Merry broke apart straight down to the keel, and Iceburg recognized that was the moment of its death. So everyone gathered around the ship and gave it a Viking funeral. The Going Merry thanked everyone for all the good memories they had, and for letting it take them to that place, and asked them to forgive it for not being able to sail anymore. Luffy shouted that it wasn't its fault and that it would always be their friend. Iceburg watched the sad funeral with a somber eye, his shipwright heart saluting this ship among ships."}], "images": []}, {"title": "Post Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "The recent Aqua Laguna and its devastating impact on Water 7 gave Iceburg the desire to make Water 7 into a boat and float it on the water. While talking to Franky, Iceburg gave out Tom's famous quote, \"With a DON!\". Franky agreed that the phrase suited Iceburg. But before he started working on it, he helped Franky build the dream ship for the Straw Hats. As they completed it, Iceburg suggested that the ship would be \"the ship that will cross a thousand seas under the sun's light, the Thousand Sunny\"! As the Straw Hats see the new ship, Iceburg explains the situation with Franky and his absence, how he still felt obligated to remain on Water 7 (out of a duty to Tom, whose imprisonment and subsequent death Franky blamed himself for) and that only through force would Franky join. After much swim briefs hijinks and testicle clutching, Iceburg told Franky he forgave him, as well as Tom, and all that was left was for him to forgive himself. Franky started to cry, and in the end, Franky agreed to join them, to make his dream to sail on the dream ship become a reality."}], "images": []}, {"title": "Where They Are Now", "level": 3, "content": [{"type": "paragraph", "text": "Sometime after the Straw Hats left Water 7, Iceburg was seen holding interviews in his office for the vacant position of secretary. Candidate no. 151 tried to appeal to Iceburg, but he brushed her off."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Iceburg decided to pick the young, ten-year-old girl (candidate 153) who auditioned to be his secretary two years ago."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/26/Iceburg%27s_Ten-Year-Old_Secretary.png/revision/latest/scale-to-width-down/180?cb=20151120203717", "caption": "Iceburg's new secretary."}]}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Franky's new wanted poster was received, Iceburg stared at it with a shocked expression."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Despite the fact that Eiichiro Oda has spelled his name as \"Iceburg\" multiple times, this is not always used. Both the manga and the anime spelled the name as \"Icebarg\" once, while his name was romanized as \"Iceberg\" in a fan poll. It was also spelled as \"Icebarge\" on the newspaper that Crocus was reading in Episode 381."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bd/Icebarg_Sign.png/revision/latest/scale-to-width-down/210?cb=20130920050818", "caption": "\"Icebarg's\" nameplate in Tom's Workers' old headquarters."}]}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Vivre Card - One Piece Visual Dictionary revealed an early concept of Iceburg. He is shown as a man with a more severe expression, with glasses, and wearing a shirt with an adorable bear and pants with patterned flowers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Early_Iceburg.png/revision/latest/scale-to-width-down/140?cb=20190506221446", "caption": "Early concept of Iceburg."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Adventure", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the third Popularity Poll, Iceburg was voted the 19th most popular character in One Piece. In a later poll, he was voted the 60th.", "elements": []}]}, {"type": "list", "elements": [{"text": "According to an SBS, Iceburg's birthday is January 3. This is because ai is the pronunciation of the English letter \"i\", which looks like the number one. Su is the first part of the Japanese pronunciation of the word \"three\" (surī). Put together, these make Aisu (Ice), the first part of Iceburg's name.", "elements": []}, {"text": "In the anime, it is revealed in Post-Water 7 newspapers that Iceburg is holding auditions to search for a new secretary following Kalifa's leave. The photos used for the frontpage depicting his auditions are the same as the drawings used in the \"Where They Are Now\" mini-series.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Auditions_for_a_New_Iceburg%27s_Secretary_in_the_Newspaper.png/revision/latest/scale-to-width-down/210?cb=20151120175933", "caption": "Iceburg holding auditions for a new secretary in the newspaper."}]}]}