{"sections": [{"title": "Drophy", "level": 1, "content": [{"type": "paragraph", "text": "\"Town-Collapser\" Drophy, better known by her alias Miss Merry Christmas, is a former officer agent partnered with Mr. 4."}, {"type": "paragraph", "text": "She was a major antagonist during the Alabasta Arc. After the downfall of Baroque Works, she works as a \"princess\" at the new Spiders Cafe alongside most of her former colleagues."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Drophy is a stout, middle-aged woman with red hair. She wears a necktie that resembles a Christmas tree, which goes with her codename. Other notable attire include a large pair of purple-lensed sunglasses, a basket strapped to her back, and sandals."}, {"type": "paragraph", "text": "Due to her Devil Fruit, she can also turn herself into a humanoid mole."}, {"type": "paragraph", "text": "During Miss Goldenweek's \"Operation: Meet Baroque Works\", she wore a typical striped prisoner outfit and retained her glasses."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Unlike her partner, who is very slow, Drophy talks very quickly, often only pronouncing the first syllable of the word in a high-pitched, child-like voice. Due to her love of talking, she acts as the brains of the Mr. 4 pair. Much like Crocodile, she takes a cynical view towards those like Luffy who wish to become the Pirate King, and quite happily informs Usopp that Luffy is dead, and that the world will be better off without dreamers like him. She also complains about her back frequently and will command Mr. 4 to massage it for her. She has a tendency to end sentences with a \"Ba\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Mr. 4", "level": 3, "content": [{"type": "paragraph", "text": "Drophy often fusses at Mr. 4 for being so slow and orders him around all the time; for example, she commands him to massage her back. However in spite of this, they show near perfect team-work in battle without falling out of sync. Miss Merry Christmas also cares for Mr. 4 as a person, as she was shocked when she thought Usopp killed him with his fake hammer and lamented his assumed death. "}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Beyond her Devil Fruit ability Drophy has not demonstrated much fighting ability. She, however, definitely seems to be considerably smarter and therefore in charge of her partner Mr. 4's actions, as he is too slow to do much of anything without guidance. She was also able to survive having her tunnel system blown up by Lassoo and remained almost completely uninjured."}, {"type": "paragraph", "text": "Like her partner, Drophy has also been shown to be extremely stealthy, as she managed bypass the Alubarna palace's tight security in order to abduct King Cobra."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Drophy ate the Mogu Mogu no Mi, a Zoan-type Devil Fruit that gives her the ability to transform into a giant mole or a mole-human hybrid, which Usopp thinks is a penguin. Because of this transformation, she can easily dig underground in the sands of Alabasta and sneak up on opponents, and attack with her sharp digging claws."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mr. 4 and his partner Miss Merry Christmas were summoned by Crocodile along with the other remaining officer agents to meet at the Spiders Cafe in order to get assignments for the upcoming battle. Mr. 4 did not do much during that time, aside from give Miss Merry Christmas a massage, and giggle when Mr. 2 Bon Kurei started to dance. He later travels with the other officer agents to Rainbase, where they received their missions. For their job, Mr. 4 and Miss Merry Christmas were assigned to kidnap Nefertari Cobra, which they were successful in completing. They later rejoined the other officer agents to stop Nefertari Vivi from reaching the rebels and they chased after Sanji, and Tony Tony Chopper. At first, Chopper had to fight the two alone as Sanji left to check on Vivi, but later Usopp arrived to assist Chopper in fighting the Mr. 4 team in Sanji's place."}, {"type": "paragraph", "text": "After blinding Mr. 4 with his Kemuri Boshi (Smoke Star), Usopp was able to escape from Miss Merry Christmas and her partner's combined attack (Molehill Intersection Number 4), leaving Chopper (who was using Horn Point) to scoop her into his antlers. Falling for Usopp's impression of her, Mr. 4 immediately slugged her in the face with his bat and sent her flying into a stone arch. Lassoo then coughed up one last explosive baseball."}, {"type": "paragraph", "text": "After Operation Utopia failed with Luffy beating Crocodile, Miss. Merry Christmas was found and arrested by the Marines headed by Tashigi. She, along with the other arrested Baroque Works agents were then sent to prison."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/34/Mr_4_Hits_Merry_Christmas.png/revision/latest/scale-to-width-down/180?cb=20121108060926", "caption": "Miss Merry Christmas is knocked out by Mr. 4."}]}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "Miss Merry Christmas, Mr. 4, and Lassoo were taken to prison, where Miss Goldenweek, Mr. 5, and Miss Valentine visited them. They managed to escape along with Miss Doublefinger and are now working in the new Spiders Cafe."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Miss_Merry_Christmas_Princess.png/revision/latest?cb=20080705090935", "caption": "Miss Merry Christmas realizes her dream."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Miss Merry Christmas, Mr. 4, and Lassoo vs. Chopper and Usopp", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Along with her changed name Miss Groundhog's Day, Miss Merry Christmas' Christmas tree necktie is recolored to look purple and red. This change in name and look is speculated to be done to avoid offending non-Christians. Her Devil Fruit animal was also referred to as a groundhog (even though it is clearly a mole still), most likely due to her name."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Miss Goldenweek's Rainbow Color Trap reveals that her dream was to become a princess. At the conclusion of the Miss Goldenweek: Meet Baroque mini-arc, she ends up serving food at the new Spiders Cafe while dressed as a princess.", "elements": []}, {"text": "She is the first female Zoan user seen in the series.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Christmas Wikipedia article about her holiday codename.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 18 Chapter 160 (p. 8) and Episode 103, Ms. Merry Christmas makes her debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Drophy's information is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 20 Chapter 186 and Episode 114, Drophy tells Usopp about Luffy's \"death\", and laughs at Luffy's dream.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 211 (p. 14-15) and Episode 127, Miss. Merry Christmas is apprehended the Marines after being defeated.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 42 Chapter 406, cover story: Miss Goldenweek's \"Operation: Meet Baroque Works\" Vol. 36, Miss Merry Christmas' dream.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 43 Chapter 411, cover story: Miss Goldenweek's \"Operation: Meet Baroque Works\" Vol. 40, Miss Merry Christmas serves food dressed as a princess.", "elements": []}]}], "images": []}]}