{"sections": [{"title": "Mikita", "level": 1, "content": [{"type": "paragraph", "text": "\"Courier\" Mikita, more commonly known by her alias Miss Valentine, is a former officer agent who was partnered with Mr. 5. As of now, she is currently working as a chocolate lady alongside most of the other Baroque Works members at the new Spiders Cafe. She is one of the main antagonists of the Whisky Peak Arc and a major antagonist of the Little Garden Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mikita is a tall young woman with short blond hair and dark eyes (bright green in the anime)."}, {"type": "paragraph", "text": "She wears a yellow and orange hat, as well as a yellow dress with a lemon-like pattern, lemon earrings, and white high-heeled shoes. She also added a blue jacket with white stripes over this attire during the Little Garden Arc. She is almost always seen carrying a bright green parasol with blue stripes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Overconfident, she does not take her opponents seriously and greets any situation with a lighthearted laugh. She generally allows her partner Mr. 5 to do any necessary talking. Being a Baroque Works officer agent, she is quite confident in her abilities."}, {"type": "paragraph", "text": "Her chosen method of dealing with Usopp—crushing him slowly and painfully by increasing her weight—shows her preference for unnecessary cruelty. She also dislikes being ignored, especially when she is attacking."}, {"type": "paragraph", "text": "Like many other people, she possesses a unique laugh: \"Kyahahaha\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/32/Angry_Miss_Valentine.png/revision/latest/scale-to-width-down/230?cb=20150430194809", "caption": "Miss Valentine when being ignored by Zoro."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Mikita herself displays very little combat ability beyond the simple use of her Devil Fruit power. For the most part, she lets her partner, Mr. 5, do most of the fighting while she functions as support. However, she is strong enough to restrain Vivi."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Mikita has eaten the Kilo Kilo no Mi, a Paramecia-type Devil Fruit which allows her to change her mass to anything between 1 and 10,000 kilograms (changed to pounds in the 4Kids dub). She uses this power to crush her opponents, or to make her light enough to glide through the air using her umbrella. As she is partnered with Mr. 5, she can ride the force of his explosions, dropping high from midair by increasing her mass suddenly for devastating dive-bomb force."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Kilo_Kilo_no_Mi_Infobox.png/revision/latest/scale-to-width-down/235?cb=20130504175851", "caption": "Miss Valentine gliding through the air."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Whisky Peak Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mr. 5 and his lady partner Miss Valentine arrived at Whisky Peak, but were not present to aid the other, less capable agents of the organization. They reveal that the leader of Baroque Works (Mr. 0) has discovered a spy, who has somehow successfully infiltrated its ranks, and that they've been sent to dispatch them. The spies were none other than Igaram (Mr. 8, who used the alias Igarappoi as the town's leader) and Princess Nefertari Vivi (Miss Wednesday) of the Alabasta Kingdom. Mr. 9 and Miss Monday, despite being rather unaware of the situation to their own admission, decided to hold off the Mr. 5 pair so that Vivi can escape but are quickly defeated."}, {"type": "paragraph", "text": "When Mr. 5 fired at Vivi, Zoro suddenly appeared and defended her. Miss Valentine and Mr. 5 decided to assassinate Zoro thinking that he was an obstacle of their goal. Luffy then suddenly appeared and angrily fought Zoro. When she and Mr. 5 were about to get near the unprotected princess, Zoro kicked Luffy and they were both hit, crashing into a building. After taking a blow, Miss Valentine tried to bury Zoro using her abilities, but she was dodged. She and Mr. 5 got up again and saw that Luffy and Zoro were still fighting. They both attacked, but were soon sent flying and knocked unconscious."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Luffy_and_Zoro_Defeat_Miss_Valentine_and_Mr._5.png/revision/latest/scale-to-width-down/230?cb=20140801104256", "caption": "Luffy and Zoro dispatch Mr. 5 and Miss Valentine with ease."}]}, {"title": "Little Garden Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later, Miss Valentine and Mr. 5 met up with Mr. 3 and his partner Miss Goldenweek at Little Garden. Mr. 3 revealed the 100,000,000 bounty on Brogy and Dorry's individual heads, suggesting that they kill the giants along with the Straw Hats. They caught Karoo and beat the duck. They ordered him to call out to his master, Vivi, but Karoo showed an iron-will and refused to make a sound."}, {"type": "paragraph", "text": "However, Luffy was pinned under a mountain by Dorry and they were free to make their moves to capture Vivi. Later after Luffy, Usopp, Karoo arrived to save Nami, Vivi, and Zoro, she and Mr. 5 chased after Usopp and Karoo. Eventually, after Mr. 5 shot Usopp, Miss Valentine then tried her Crescendo Stone on Usopp, experimenting on how much 'weight' he can hold. But before he got crushed, he was able to execute his plan of using an oil-soaked rope for Luffy to ignite to free Nami, Vivi, and Zoro from their wax encasing. Just before an angry Miss Valentine could finish off Usopp by crushing his neck, Miss Valentine's anger turned to horror and was then swiftly defeated by Nami and Vivi."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Miss_Valentine_Captures_Vivi.png/revision/latest/scale-to-width-down/200?cb=20130926214309", "caption": "Miss Valentine captures Vivi."}]}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "She, along with Mr. 5 and Miss Goldenweek, appeared in a chapter cover mini-story where the three flew from Little Garden to visit their fellow Baroque Works agents in prison but wound up on an island resort swarming with Marines."}, {"type": "paragraph", "text": "The three later tried to disguise themselves but were unsuccessful and spotted by Captain Hina. While Mr. 5 and Miss Goldenweek escape, Miss Valentine was captured and was about to be executed by the Marines. Luckily, Mr. 2 showed up (disguised as Mr. 3 surrendering) and challenged Hina to a rematch, allowing Mr. 5 and Miss Goldenweek time to rescue Miss Valentine and escape."}, {"type": "paragraph", "text": "They managed to break many agents out of prison except for Crocodile who refused to go with them, and Mr. 1, who stayed with Crocodile. They then started a new Spiders Cafe, where they all currently work.."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Miss Valentine vs. Nefertari Vivi", "elements": []}, {"text": "Miss Valentine and Mr. 5 vs. Roronoa Zoro vs. Monkey D. Luffy", "elements": []}, {"text": "Miss Valentine and Mr. 5 vs. Usopp and Nefertari Vivi", "elements": []}, {"text": "Miss Valentine and Mr. 5 vs. Usopp and Karoo", "elements": []}, {"text": "Miss Valentine vs. Nefertari Vivi and Nami", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "While Oda had originally given her dark eyes, she has bright green eyes in the anime."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Legend of the Rainbow Island", "elements": []}, {"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Miss Goldenweek's Colors Trap reveals that her dream was to be a 'chocolate lady' or chocolatier, which is appropriate to her code name, as per the custom of giving chocolates on Valentine's Day.", "elements": []}, {"text": "Mikita was partnered with Mr. 5 because she could use his ability to create explosions to propel herself after decreasing in weight.", "elements": []}, {"text": "Mikita made a small cameo appearance along with Moodie as a background character in the filler Special Historical Arc.", "elements": []}, {"text": "Mikita is one of the few characters in the series to share the same laughter style (\"Kyahahaha\") with another, Dellinger.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Miss_Valentine_Chocolate_Lady.png/revision/latest/scale-to-width-down/115?cb=20171102072632", "caption": "Mikita realizes her dream."}]}]}