{"sections": [{"title": "Gem", "level": 1, "content": [{"type": "paragraph", "text": "Gem of the Border, better known by his alias Mr. 5, was formerly the lowest-ranked officer agent in Baroque Works along with his partner, Miss Valentine. He now works as a fireman at the new Spiders Cafe alongside most of his former colleagues. He was one of the main antagonists of the Whisky Peak Arc and the tertiary antagonist of the Little Garden Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gem is a tall, dark-skinned man with black hair in short spiky dreadlocks. He wears a brown trench coat with a pink cravat and a pair of sunglasses, regardless of the time of day. Like the other officer agents, his number is shown both on his clothing and his body. He has a \"5\" on his coat; this number is also tattooed on his right shoulder."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like most of the Baroque Works officer agents, he is extremely confident and believes that friendship is a sign of weakness. Despite this, Mr. 5 was very respectful to his partner Miss Valentine and did not get annoyed with her like some other Baroque Works partnerships would act. Mr. 3, upon hearing about his defeat at Whisky Peak, describes Mr. 5 as \"an over-ambitious fool who did not realize his limits and misused his Devil Fruit powers\"."}, {"type": "paragraph", "text": "He also appears to have a short temper, as he smacked Karoo for refusing to obey his orders to call out Vivi, viciously kicked Luffy for spitting on his shoe, made Brogy explode for talking too much, and tried to kill Usopp for tricking him into consuming spicy Tabasco sauce."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a former member of Baroque Works' officer agents, Gem has plenty of confidence in his abilities and is respected if not outright feared among the lower tier agents of Baroque Works. He is not without flaws, however, because he has a tendency to overestimate his own abilities and underestimate the capabilities of his opponents."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Gem has the power of the destructive Bomu Bomu no Mi, a Paramecia-type Devil Fruit which allows him to turn any part of his body into a bomb without harming himself, as well as rendering all explosive-based attacks useless against him. He can make any part of his body, even his entire body, explode, but he mainly uses snot from his nose. However, according to Mr. 3, he happens to make poor use of his fruit. It should be noted though, that Mr. 3 is antagonistic to others within Baroque Works like this."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/62/Nose_Fancy_Cannon.gif/revision/latest/scale-to-width-down/180?cb=20121202044821", "caption": "Gem creating explosives out of his own body parts."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Gem uses a new model pistol from South Blue, a flintlock .44 caliber 6 shot revolver (フリントロック式44口径6連発リボルバー, Furintorokku Shiki Yonjūyon Kōkei Rokurenpatsu Riborubā), which has rapid-fire capabilities. This pistol is used for his Breeze Breath Bomb, in which he breathes into the flintlock's chambers, and then empties all six rounds at his opponents quickly. He preferred to use this weapon only for tougher situations."}, {"type": "paragraph", "text": "Since his breath is explosive thanks to his Bomu Bomu no Mi, the six invisible air bullets accumulate much more damage than that of normal ones. Gem tends to empty all six rounds per attack, causing massive damage on one target, and then swiftly refill."}, {"type": "paragraph", "text": "Gem seems to be a competent sniper with this pistol, as he accurately shot Usopp with all six bombing air bullets from a fair distance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cb/Flintlock_.44_Caliber_6_Shot_Revolver_Infobox.png/revision/latest/scale-to-width-down/150?cb=20130122185243", "caption": "Mr. 5's Revolver."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point of his life, he joined Baroque Works as an agent. After some time, he obtained the Bomu Bomu no Mi's power and since then, and until he met the Straw Hat Pirates, he never failed a mission."}], "images": []}, {"title": "Whisky Peak Arc", "level": 3, "content": [{"type": "paragraph", "text": "Mr. 5 and his partner Miss Valentine arrived at Whisky Peak, but not to aid the less capable agents of the organization. They revealed that the leader of Baroque Works (Mr. 0) had discovered a spy who had somehow successfully infiltrated its ranks, and that they've been sent to dispatch them."}, {"type": "paragraph", "text": "The spies were none other than Igaram (Mr. 8, who used the alias Igarappoi as the town's leader) and Princess Nefertari Vivi (Ms. Wednesday) of the Alabasta Kingdom.Mr. 9 and Miss Monday, despite being rather unaware of the situation to their own admission, decided to hold off the Mr. 5 pair so that Vivi could escape but were quickly defeated. When Mr. 5 tried to shoot Vivi, Zoro suddenly appeared and defended her."}, {"type": "paragraph", "text": "The Mr. 5 team decided to assassinate Zoro, thinking he was a mere obstacle in their goal. However, Luffy suddenly appeared and angrily attacked Zoro, forcing Zoro to fight back. Mr. 5 and Miss Valentine were about to get near the unprotected princess when Zoro kicked Luffy, hitting both of them. Miss Valentine tried to use her ability on Zoro, only for him to easily dodge it. They both got up again and saw that Luffy and Zoro were still fighting. They were knocked away before they could attack again, rendering them unconscious."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Luffy_and_Zoro_Defeat_Miss_Valentine_and_Mr._5.png/revision/latest/scale-to-width-down/210?cb=20140801104256", "caption": "Mr. 5 and Miss Valentine are easily dispatched by Luffy and Zoro."}]}, {"title": "Little Garden Arc", "level": 3, "content": [{"type": "paragraph", "text": "Later, Mr. 5 and Miss Valentine met up with Mr. 3 and his partner Miss Goldenweek on Little Garden. Mr. 3 revealed the 100,000,000 bounty on Brogy and Dorry's individual heads, suggesting that they kill the giants. Knowing how powerful Luffy has become, Mr. 5 and Ms. Valentine caught Karoo in hopes of using its cries to lure Vivi away from him. They beat the duck and ordered him to call out to his master but Karoo showed an iron-will and refused to make a sound."}, {"type": "paragraph", "text": "However, Luffy was rendered immobile by Dorry with his body being placed under a mountain. They easily defeated him along with Usopp and took Vivi to Mr. 3. At Mr. 3's Candle Set, they let Vivi, Zoro, and Nami become wax figures. However, they were surprised when Luffy, Usopp, and Karoo returned to face them. As Mr. 3 stated that they could not handle Luffy's level, they chased Usopp and Karoo, almost catching them several times. Usopp found that his gunpowder star was useless against Mr. 5, as he ate it."}, {"type": "paragraph", "text": "After getting tired of following them around Mr. 5 used his Breeze Breath Bomb to shoot them from a distance. Though their teamwork succeeded in incapacitating Usopp, he made a teamwork play of his own by freeing Luffy from the Colors Trap. He then, along with Karoo, stretched out an oil-soaked rope around the Candle Set so Luffy could ignite it to trick Mr. 3 to save their friends. Once this was done, Vivi and Nami defeated Miss Valentine. Before Mr. 5 could try to shoot Vivi, Usopp tricked Mr. 5 into eating what he thought was another gunpowder star, but was actually filled with spicy Tabasco sauce, causing his body to become too hot. An angry Mr. 5 attempted to kill Usopp by stating he was about to have his entire body explode, but was stopped by Zoro who knocked him out with his Yaki Oni Giri attack."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Mr._3_Meets_5_and_Valentine.png/revision/latest/scale-to-width-down/210?cb=20121128223001", "caption": "Mr. 5 and Miss Valentine in a meeting with Mr. 3."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Breeze_Breath_Bomb.png/revision/latest/scale-to-width-down/210?cb=20140719024235", "caption": "Mr. 5 shoots down Usopp."}]}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "He, along with Ms. Valentine and Ms. Goldenweek, reappears in a chapter cover mini-story where the three flew away from Little Garden to visit their captured Baroque Agents only to end up on an island resort swarming with Marines. They manage to release most of the agents before forming a new Spiders Cafe, where he currently works as a fireman."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mr. 5 vs. Mr. 9", "elements": []}, {"text": "Mr. 5 vs. Miss Monday", "elements": []}, {"text": "Mr. 5 and Miss Valentine vs. Roronoa Zoro vs. Monkey D. Luffy", "elements": []}, {"text": "Mr. 5 and Miss Valentine vs. Usopp and Nefertari Vivi", "elements": []}, {"text": "Mr. 5 and Miss Valentine vs. Usopp and Karoo", "elements": []}, {"text": "Mr. 5 vs. Roronoa Zoro", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the original version, Mr. 5 appears in Little Garden but because the Little Garden Arc is removed from the 4kids dub, he is only featured in Whisky Peak for that adaption. He is mentioned in Vivi's Baroque Works explanation where Usopp comments that his booger is a bomb. This is incorrect because the Little Garden Arc has been removed and since Usopp has been sleeping the whole time in Whisky Peak, he would never have a chance to meet Mr. 5."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Legend of the Rainbow Island", "elements": []}, {"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Round the Land", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Miss Goldenweek's Colors Trap revealed that his previous dream is to become a firefighter. This is ironic as his powers can cause fires, although his immunity to most explosions would also make him an efficient fireman.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Fireman5.png/revision/latest/scale-to-width-down/120?cb=20110816092800", "caption": "Mr. 5 realizes his dream."}]}]}