{"sections": [{"title": "Yosaku", "level": 1, "content": [{"type": "paragraph", "text": "Yosaku along with Johnny are old friends and former bounty hunting partners of Roronoa Zoro."}, {"type": "paragraph", "text": "He is an ally of the Straw Hat Pirates during the Baratie Arc and the Arlong Park Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yosaku has a black shirt with a green coat and red headgear. He has plaid yellow shorts over unshaven legs and dark shoes and, like his partner, carries a sword. He is also sometimes seen with a cigarette."}, {"type": "paragraph", "text": "After the timeskip, Yosaku is no longer wearing the coat and is seen shirtless, showing he has a kanji tattoo that reads \"Big Catch\" (大漁, Tairyō) on his back. His arms have become very muscular."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When he is with Johnny, the pair often stand together side by side, with one arm across the chest and the other at their mouths. While like this, their voices and behavior become serious, however in truth, they are very silly and emotional. Yosaku is the more emotional of the pair and he can spend hours crying over stories of difficult times and struggles. He tends to get frustrated and even upset when no one pays attention to him when talking. Like Johnny, he has a fair amount of knowledge regarding rumors and the world but lacks the finer details. He was partly blamed by Zoro for their misinformation over \"Hawk-Eyes\" and \"Drunk-Eyes\"."}, {"type": "paragraph", "text": "He prefers to avoid danger like Johnny, but unlike Johnny, he quickly forgets his fears if distracted by something else like food or by being moved by a story linked to the fear. When he is spurred on is brave enough to go against Arlong and his crew and wise enough to know that if they did not stand a chance against Arlong and his crew the villagers they made suffer would be slaughtered. One quirk he shares with Johnny, perhaps out of pride, is always stating that any fight he loses, he lost only by a hair."}], "images": []}, {"title": "Relationships", "level": 2, "content": [{"type": "paragraph", "text": "He is Johnny's best friend. Both swordsmen respect and admire power, as proven by their constant praising of Zoro's power, and later the Straw Hat Pirates power. Anyone who has earned their respect will be acknowledged by them as \"Aniki\" (brother) or \"Aneki\" (sister)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Yosaku is a swordsman like Johnny, however they are relatively low in strength and power. As for example when they tried to take on the Arlong Pirates by themselves they were easily overpowered."}, {"type": "paragraph", "text": "He and Johnny are inexperienced with traveling by sea as proven when Yosaku fell ill to scurvy. However, he and Johnny are fairly knowledgeable about the world at large, such as information on the existence of the Shichibukai and the Arlong Pirates; he even identified Momoo as a Grand Line monster upon first glance when the Sea Cow confronted the boat that he, Luffy and Sanji were on, hinting some degree of experience. They are, however, still incompetent and have been known to slip up, as when they reported Hawk-Eyes had been reported at the Baratie when it was actually \"Drunk-Eyes\"."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Yosaku uses a sword, that resembles a dadao, with a red handle and a circular tsuba. The blade of the sword gets broader as it gets farther away from the hilt. He does not appear to own a sheath for it, as it is shown being hung on his waist with a piece of looped cloth rather than a sheath."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "A few years ago, Yosaku and Johnny were in a bar when Yosaku pointed out that the man behind them was worth 5,000,000. Hearing this, Johnny recommended that they don't do anything, to which Yosaku complained that they cannot simply go after small-timers. A few seconds later, Zoro walks into the bar and asks for food, saying that he will pay for it by claiming a bounty. Billy hears this and charges at Zoro, the act of which throws Yosaku and Johnny into panic. After Zoro quickly takes out Billy, Yosaku searches the wanted posters to see if he is a criminal. Johnny then asks if he could be the pirate hunter that has been making news lately, but Yosaku replies that it cannot be since the pirate hunter uses three swords, whereas the man in front of them only has one. Johnny and Yosaku then got up to confront Zoro about stealing their prey, but is ignored by the latter. Zoro then asks the two if they have heard of \"Hawk-eye\" Mihawk and explains that he only claims bounties to feed himself on his journey to become the greatest swordsman. Yosaku laughs at this goal, but Zoro explains that he has already made up his mind. Afterward, Zoro tells the two that they can keep the bounty and prepares to leave."}, {"type": "paragraph", "text": "After claiming Billy's bounty, Yosaku celebrates but notices that Johnny appears to be feeling down. Johnny asks Yosaku why he became a bounty hunter, to which he replies that it is so that he can eat. Yosaku then explains that he wanted to be like the bounty hunters that defended his village from bandits and, upon hearing this, Johnny comes to the revelation that he too wanted to be like them as a kid."}, {"type": "paragraph", "text": "Seconds later, they heard commotion coming from town and find out that Dick and his gang were attacking. They then arrive at where Dick was pillaging and watched alongside the townspeople. When Johnny wanted to help the kid that fighting Dick, Yosaku suggested against it, but could not hold Johnny back. After confronting Dick, Johnny proclaimed that he wanted to be a champion of justice, which surprised Yosaku. Hearing this, Dick laughed at them, but the two replied to his laughter by telling him that they had turned in someone worth 5,000,000 just that morning. Dick then stopped laughing and revealed in anger that he was Billy's sworn brother."}, {"type": "paragraph", "text": "Yosaku and Johnny are then easily defeated by Dick. They then revealed that they were only the ones to claim Billy's bounty, but that someone else had defeated the bandit. After hearing Dick call them weak, they charged at him, but flung backwards with a single punch. Dick then prepared to finish them off with his bazooka, but they are saved by Harry interrupting. Dick then prepared to leave, but the two of them swore that they would take him down or die while trying. They are then attacked by Dick's gang and bruised till the point that they cannot get up. Dick's henchmen then prepared to finish the two off, but they are saved by Zoro. Zoro then asked to borrow their swords to steal their prey again, and it is only then that they realized that he was the pirate hunter. After Zoro, easily defeated Dick's henchmen, the two watched in surprise. Likewise, their surprise continued as Zoro defeated Dick and then the two asked Zoro if they could join together, to which the latter accepted."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Baratie Arc", "level": 4, "content": [{"type": "paragraph", "text": "They arrive on the scene after Usopp and Luffy unknowingly shoot at the tiny island they are on for target practice. The partners had to stop because Yosaku was suffering from scurvy, but Nami was able to diagnose and treat him. This incident proved to be helpful for the Straw Hats, as it made them realize the importance of finding a cook for their crew to avoid any food-related seaborne illnesses since Yosaku only got sick from eating rotten fruit. The two help the Straw Hats with that problem by directing them to the Baratie."}, {"type": "paragraph", "text": "During the Baratie arc, Johnny and Yosaku remain on the Going Merry to rest and notice Nami's interest in their wanted posters. As Dracule Mihawk arrives at the Baratie, Nami tricked Yosaku and Johnny and escaped with their treasure and boat. She had them to drop their guard by pretending she was changing her clothes and asking them to turn around. With their backs turned, she pushes them off the Going Merry and stole the ship. After explaining what happened to Luffy, the two witness Zoro being defeated easily by Mihawk, before Johnny and Yosaku leave with Usopp and the wounded Zoro to pursue Nami."}, {"type": "paragraph", "text": "Through means that are still unknown, Yosaku later returned to the Baratie in the mouth of a wild panda shark shortly after the Krieg Pirates left to pick up Luffy, explaining that Nami was headed to a dangerous place and they needed his help. After Sanji agrees to join Luffy's crew, the three departed to Arlong Park."}], "images": []}, {"title": "Arlong Park Arc", "level": 4, "content": [{"type": "paragraph", "text": "While on the way, Yosaku explains the story about how when Jinbe agreed to become a Shichibukai, a government recognized pirate, his former comrade Arlong had founded his own crew and had been sent into the East Blue as part of the agreement. Yosaku even clearly stated that Jinbe set Arlong free to East Blue in exchange for his seat as Shichibukai. This resulted in Arlong terrorizing the East Blue, and built his own place Arlong Park which is their current destination, since both he and Johnny were able to figure out that Nami was heading there due to both the direction of the ship and that Nami's earlier behavior was related to Arlong, because of her obsession with Arlong's wanted poster."}, {"type": "paragraph", "text": "Once Luffy and Sanji defeat the Arlong Pirates' pet Momoo, they are able to use it to tow themselves to Arlong Park to get there faster. However, after recognizing that the Straw Hats will try to win Nami back by defeating Arlong, the two decide to back off and retreat out of fear for their own lives. But once they hear Nojiko's story about Nami's tragic past and why she had to join Arlong, the two attempt to face Arlong's crew for having misjudged Nami only to be easily defeated. Recognizing that only the Straw Hats can defeat Arlong and his crew, Johnny and Yosaku stop the villagers from throwing their lives away. During the battle, Yosaku, along with Johnny lend Zoro their swords to replace the ones that Mihawk broke at the Baratie so he could defeat Hatchan. After Arlong's defeat, they thank the Straw Hat crew for their assistance but continue their life as bounty hunters."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/93/Yosaku_and_Johnny_Block_Arlong_Park.png/revision/latest/scale-to-width-down/200?cb=20130622034412", "caption": "Yosaku and Johnny block Arlong Park entrance."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "He and Johnny continued as bounty hunters, but after constant failures, they decided to become fishermen of the Cocoyasi Village."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Johnny and Yosaku are seen fishing from a boat near Cocoyasi Village."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yosaku and Johnny vs. Dick Bandits (Anime only)", "elements": []}, {"text": "Yosaku and Johnny vs. Fullbody (manga only)", "elements": []}, {"text": "Yosaku and Johnny vs. Arlong Pirates (unseen)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Yosaku and Johnny vs. Dick Bandits", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, a story of Yosaku and Johnny's past appears in an episode of the Post-Alabasta Arc. It featured Johnny styling a mohawk, and Yosaku having a full head of hair. The episode recounts the two's encounter with the bandits Billy and Dick, their rescue of Harry, and how and why the two met and became friends with Zoro."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yosaku's cigarette was edited out in the 4Kids dub.", "elements": []}, {"text": "The original pronunciation of Yosaku's name was with emphasis on the second syllable. While this was kept in the 4Kids dub, the FUNimation dub pronounces it with emphasis on the first syllable.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Burning Blood (together with Johnny)", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Grand Battle!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yosaku appears alongside Johnny attempting to \"have some fun\" with Porche during Zoro's television program in a Chopperman special.", "elements": []}, {"text": "Yosaku's favorite food is stir-fried bean sprouts.", "elements": []}]}], "images": []}]}