{"sections": [{"title": "Johnny", "level": 1, "content": [{"type": "paragraph", "text": "Johnny along with Yosaku are old friends and former bounty hunting partners of Roronoa Zoro."}, {"type": "paragraph", "text": "He is an ally of the Straw Hat Pirates during the Baratie Arc and the Arlong Park Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Johnny is an average-sized man with somewhat tanned skin. He is always seen wearing a pair of sunglasses and has a black tattoo on his left cheek that reads \"sea\" (海, umi). Johnny has short, black hair and is usually seen carrying his sword. His eyebrows always seem to be pointing down to make a scowl, even when he is smiling. After the time skip his arms became more muscular. He wears a blue hooded jacket with a purple undershirt, tan pants, boots, and a watch on his left wrist."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Johnny is happy-go-lucky, much like Yosaku. Johnny tends to be the more serious and occasionally the more honorable of the pair, though he acts silly around Yosaku from time to time. Johnny is also dimwitted to some extent and while he knows much information he seems to be greatly misinformed about many things. This includes rumors of \"Hawk-Eyes\" visiting the Baratie regularly when the actual story was about \"Drunk-Eyes\", to not knowing how to cure Yosaku (and not knowing what ailed him in the first place). Johnny occasionally says that he would lose or had lost by a close margin against an opponent far stronger than he is, such as Luffy or Arlong, indicating some arrogance. Johnny is also very brave seeing how he got ready to attack Mihawk when he fought Zoro. Johnny also stands up for what he believes in, this is seen when he fights Dick the Mountain Whale."}, {"type": "paragraph", "text": "He also has a cowardly side to him, as seen when he not only tied up Zoro to prevent him from assaulting Arlong Park, but through his willingness to simply abandon him to the fish-men to run off to safety with Usopp. However, when he is spurred he is brave enough to go against Arlong and his crew and wise enough to know his action could lead to the villagers suffering. Johnny's bravery was still not enough to defeat the Arlong Pirates, leaving the Straw Hat Pirates with no other choice but to defeat Arlong and his crew on their own. One quirk he shares with Yosaku, perhaps out of pride, is always stating that any fight he loses, he lost only by a hair."}], "images": []}, {"title": "Relationships", "level": 2, "content": [{"type": "paragraph", "text": "Johnny, Yosaku and Roronoa Zoro were a team of bounty hunters at some point before the start of the One Piece story. Due to some unknown reasons, their team disbanded, but their members were on good terms with one another before disbanding. Their friendship seems to go beyond that of just bounty hunters and into the realm of brothers."}, {"type": "paragraph", "text": "Like Yosaku, Johnny is really friendly and appreciates a helping hand. In the anime, Johnny quickly befriends the Straw Hat Pirates after Nami cures Yosaku of an illness called scurvy. It is never actually revealed why they have so much respect for Roronoa Zoro, but it can be surmised that it is not just because of his power or skill. Even after Zoro's defeat by Dracule Mihawk, Johnny and Yosaku did not hesitate to protect Zoro nor did they respect Dracule Mihawk more for defeating Zoro. In both the anime and manga, their respect for anyone affiliated with Zoro is shown by the honorific they use. They refer to everyone by their name followed by \"Aniki\" (brother) or for Nami \"Nami-aneki\" (sister). "}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Johnny is a swordsman like Yosaku, however they are relatively low in strength and power. When they tried to take on the Arlong Pirates by themselves they were easily overpowered."}, {"type": "paragraph", "text": "It is still unknown if Johnny or Yosaku have any special attacks. The only time Johnny showed his true bravery, is when he attacked the Going Merry due to Monkey D. Luffy and Usopp attacking a large rock, which Johnny was taking refuge on due to Yosaku's illness. Johnny had no chance against Luffy but he did do quite a bit of damage to the Going Merry which he ended up fixing. The fight was shortly stopped soon after Zoro realized it was Johnny."}, {"type": "paragraph", "text": "Johnny and Yosaku are inexperienced with traveling by sea as proven when Yosaku fell ill to scurvy. However, they are fairly knowledgeable about the world at large, such as information on the existence of the Shichibukai and the Arlong Pirates; he even identified Momoo as a Grand Line monster upon first glance when the Sea Cow confronted the boat that he, Luffy and Sanji were on, hinting some degree of experience. They are, however, still incompetent and have been know to slip up, such as when they said Hawk-Eyes had been reported at the Baratie when it was actually \"Drunk-Eyes\"."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Johnny uses a dadao sword with a red handle and a circular tsuba. The blade of the sword gets broader as it gets farther away from the hilt. He does not appear to own a sheath for it, as it is shown being hung on his waist with a piece of looped cloth rather than a sheath."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "A few years ago, Johnny and Yosaku were in a bar when they noticed that the 5,000,000 bounty bandit, Billy, and his gang were sitting behind them. Upon being informed of this by Yosaku, Johnny recommended that they don't do anything. A few seconds later, Zoro walks into the bar and asks for food, saying that he will pay for it by claiming a bounty. Hearing this, Billy charges at Zoro, the act of which throws Johnny and Yosaku into panic. After Zoro quickly takes out Billy, Johnny comments on his skill and then wonders if he is the pirate hunter the rumors have been about, but Yosaku dismisses this idea. Johnny then gets up and walks towards Zoro, having decided that they cannot just watch as another man claims their prey. Johnny explains that they had first dibs since they saw him first, but is temporarily ignored as Zoro continues eating. Zoro then explains that he is trying to be the greatest swordsman and that bounty hunting is only so that he has money to eat. He then told Johnny and Yosaku that they could claim Billy's bounty and left."}, {"type": "paragraph", "text": "After claiming Billy's bounty, Johnny questioned Yosaku on why he became a bounty hunter. Johnny explained that his village was raided by bandits when they were young and that he wanted to be just like those bounty hunters that took out the bandits. Having just encountered Zoro, he was reminded of why he had become a bounty hunter."}, {"type": "paragraph", "text": "Seconds later, they heard commotion coming from town and find out that Dick and his gang were attacking. They then arrive at where Dick was pillaging and watched alongside the townspeople. When a child attacked Dick, Johnny could not hold back his anger and wanted to do something; however, Yosaku tried to hold him back. In response, Johnny replied that that kid was basically him when he was young. Johnny then charged at Dick and proclaimed himself to be a bounty hunter. Dick then offered to give the some charity money to go away, but they refused and Johnny stated that he just wanted to uphold justice. Hearing this, Dick laughed at them, but the two replied to his laughter by telling him that they had turned in someone worth 5,000,000 just that morning. Dick then stopped laughing and revealed in anger that he was Billy's sworn brother."}, {"type": "paragraph", "text": "Yosaku and Johnny are then easily defeated by Dick. They then revealed that they were only the ones to claim Billy's bounty, but that someone else had defeated the bandit. After hearing Dick call them weak, they charged at him, but flung backwards with a single punch. Dick then prepared to finish them off with his bazooka, but they are saved by Harry interrupting. Dick then prepared to leave, but the two of them swore that they would take him down or die while trying. They are then attacked by Dick's gang and bruised till the point that they cannot get up. Dick's henchmen then prepared to finish the two off, but they are saved by Zoro. Zoro then asked to borrow their swords to steal their prey again, and it is only then that they realized that he was the pirate hunter. After Zoro, easily defeated Dick's henchmen, the two watched in surprise. Likewise, their surprise continued as Zoro defeated Dick and then the two asked Zoro if they could join together, to which the latter accepted."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Baratie Arc", "level": 4, "content": [{"type": "paragraph", "text": "Usopp and Luffy practiced firing the ship's cannon. They blew up a nearby island, accidentally hurting Yosaku who was resting on the island. Johnny boarded the Going Merry and began attacking the ship. Luffy stopped him, and Johnny was shocked when he learned Roronoa Zoro had joined a pirate crew as he was a fellow pirate bounty hunter. Johnny brought the sick and injured Yosaku onboard, and Nami was able to diagnose and treat him for scurvy. After the Straw Hats realized they would need a cook for the crew to avoid going through a similar situation, Johnny decided to repay the favor by directing them to the Baratie, where they should be able to find a cook."}, {"type": "paragraph", "text": "They reached Baratie alongside a Marine ship. Johnny and Yosaku were worried about being mistaken for pirates, but Fullbody recognized them as small time bounty hunters. They attacked him for the insult and were easily defeated. Nami took interest in their collection of wanted posters. When Dracule Mihawk arrived at the Baratie, Nami tricked Yosaku and Johnny and escaped with their treasure and boat. She had them to drop their guard by pretending she was changing her clothes and asking them to turn around. With their backs turned, she pushed them off the Going Merry and stole the ship. Luffy ordered them, Zoro, and Usopp to go after her. They were shocked to see Zoro losing against Dracule Mihawk, and considered intervening, but Luffy prevented them from doing so. After Zoro's defeat, Johnny and Yosaku pulled the injured swordsman from the water. They continued the chase after Nami aboard their own boat, leaving Luffy behind to defend the Baratie."}], "images": []}, {"title": "Arlong Park Arc", "level": 4, "content": [{"type": "paragraph", "text": "Once they predict that the Going Merry was heading in the direction of Arlong Park, the two recall of how Nami's suspicious behavior was connected to Arlong, which helped them realize there was a connection between Nami and Arlong. While Yosaku leaves for the Baratie to inform Luffy of Nami's destination, Johnny continues to the island with Usopp and Zoro. After spotting some fish-men, they abandon their ship, leaving Zoro (whom they had tied up to prevent him from going in recklessly due to his injuries) to get captured. However after spotting another Fish-Man in Gosa Village Johnny runs off before Usopp notices, leaving an unsuspecting Usopp to fend for himself. Johnny later witnesses Nami pretending to kill Usopp and, fooled by her deception, reports that she killed him."}, {"type": "paragraph", "text": "Yosaku and Johnny overhear Nojiko telling Nami's story, and decide to go after the Arlong Pirates to make up for having misjudged her, but are easily defeated. They decide then to wait for Luffy's coming and let no one else enter into Arlong Park to not allow Cocoyasi Village's inhabitants from interfering in the battle. When the fights between the Straw Hat pirates and the Arlong pirates' officers start, they give Zoro their swords to replace the ones Mihawk broke, allowing him to defeat Hatchan. After Arlong's defeat, they thank the Straw Hat crew for their assistance, but continue their lives as bounty hunters."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/93/Yosaku_and_Johnny_Block_Arlong_Park.png/revision/latest/scale-to-width-down/200?cb=20130622034412", "caption": "Yosaku and Johnny block the Arlong Park entrance."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "He and Yosaku continued as bounty hunters, but after constant failures, they decided to become fishermen of the Cocoyasi Village."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Johnny and Yosaku are seen fishing from a boat near Cocoyasi Village."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Johnny vs. Monkey D. Luffy", "elements": []}, {"text": "Johnny and Yosaku vs. Fullbody (manga only)", "elements": []}, {"text": "Johnny and Yosaku vs. Arlong Pirates (unseen)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Johnny and Yosaku vs. Dick Bandits", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, the story on how Johnny and Yosaku met Zoro appears in an episode of the Post-Alabasta Arc. It featured Johnny styling a mohawk, and Yosaku having a full head of hair. Johnny reveals he became a bounty hunter to save people and be cool, just like the bounty hunter who saved him when he was a kid. The episode recounts the two's encounter with the bandits Bandit and Dick, their rescue of Harry, and how and why the two met and became friends with Zoro."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e4/Johnny_as_a_Child.png/revision/latest/scale-to-width-down/150?cb=20130324223256", "caption": "Johnny as a child."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Burning Blood (together with Yosaku)", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Grand Battle!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Appears alongside Yosaku attempting to \"have some fun\" with Porche during Zoro's television program in a Chopperman filler episode.", "elements": []}, {"text": "Johnny's favorite food is potato chips.", "elements": []}]}], "images": []}]}