{"sections": [{"title": "Lami", "level": 1, "content": [{"type": "paragraph", "text": "Lami was Trafalgar D. Water Law's younger sister from the town of Flevance."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lami was a young girl with brunette hair in pigtails, with a cheerful and wide smile. When she became sick with amber lead syndrome, she had white spots all over her body."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Lami was a very cheerful girl, and particularly close to her brother, Law. She liked festivals."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Trafalgar Law was Lami's older brother, and they were very close to each other. Law took care of her when she became sick with amber lead syndrome, saying that their father, the best doctor on the island, will save her. When she died, Law was devastated by her death. Along with family and classmates, Lami's death led to Law becoming the nihilistic and homicidal child he was before meeting Donquixote Rosinante."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Lami, along with the other residents of Flevance, became sick with amber lead syndrome, and her brother tried to comfort her while their parents were looking for a cure for the disease. However, when the neighboring countries carried out the extermination of the inhabitants of Flevance, the hospital she was residing in was set on fire, burning her to death. It was her death that drove Law over the edge, as he watched helplessly as the hospital burned while crying."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 76 Chapter 762 (p. 12-15) and Episode 701, Lami contracts Amber Lead Syndrome, and dies in a fire.", "elements": []}]}], "images": []}]}