{"sections": [{"title": "Wellington", "level": 1, "content": [{"type": "paragraph", "text": "Wellington is a North Blue pirate from around fourteen to sixteen years ago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Wellington is a large, burly man with a short, shaggy beard. He wears a captain's coat and shorts. His hair is unkempt with a noticeable widow's peak. He has a scar above his right eye that runs diagonally down his face."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Wellington is very brutal and ruthless. He has no qualms with attacking and killing children as shown when he tried to stab a young Trafalgar Law."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He seems to be quite strong and durable, as he did not seem fazed by the bullets that Baby 5 shot at him from her leg. In spite of his resistance to Baby 5's attack, he was effortlessly defeated by Doflamingo's strings."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wielded a large knife that he attempted to stab Law with."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "About sixteen to fourteen years before the current storyline, the Donquixote Pirates took over an island that Wellington was on. Law and Baby 5 tried to fight him but he easily overpowered the two children. As he put the knife to Law's head, the executives arrived just in time to save them both, leaving Wellington and many others unconscious (if not dead) with many slash marks across his back."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Wellington vs. The Donquixote Pirates", "elements": [{"text": "Wellington vs. Trafalgar Law and Baby 5", "elements": []}, {"text": "Wellington vs. the Donquixote executives", "elements": []}]}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is possibly a reference to Arthur Wellesley, the 1st Duke of Wellington who was a member of the Seventh Coalition that defeated Napoleon at the Battle of Waterloo.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 76 Chapter 763 (p. 14) and Episode 702, Wellington vs. Donquixote Pirates.", "elements": []}]}], "images": []}]}