{"sections": [{"title": "Diez Barrels", "level": 1, "content": [{"type": "paragraph", "text": "Diez Barrels was the father of X Drake, and was a pirate from thirteen years ago who gained possession of the Ope Ope no Mi. He is a former Marine officer and planned to trade the fruit with the Marines for money."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Barrels is a large, fair-skinned man with a prominent chin, pointed nose, and small ears. He has short orange hair, much like his son, that is slicked back, a predominant widow's peak, and sideburns. He wears a dark-colored buttoned shirt and a light colored pirate-style coat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Barrels is quite naïve, setting up a deal to sell the Ope Ope no Mi to the Marines. He does, however, realize the fruit's potential, despite not wanting it for himself, though he did not know of the ability to grant immortality; Doflamingo regarded him as a fool for not knowing the true value of the fruit's powers. His greed for monetary value made him focus more on retrieving the fruit when it was stolen by Donquixote Rosinante than tending to his own injuries."}, {"type": "paragraph", "text": "During his time as a Marine officer, he was apparently someone to look up to, as his son, Drake, did. However, once he became a pirate, he became crueler and started physically abusing Drake."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "X Drake", "level": 4, "content": [{"type": "paragraph", "text": "X Drake is Barrels' son. When Drake was a child, he looked up to his father for being a Marine officer, and wished to emulate the man. However, when Barrels descended to piracy, he started to abuse his son physically. Drake, however, continued to see the good of his past father, and continued to follow him."}, {"type": "paragraph", "text": "Their father-son relationship permanently broke down when Donquixote Doflamingo attacked their hideout, the pirates and Marines alike were moving against their will in an entrapped cage, Drake, the only one who was outside of the containment field, immediately fled, leaving his father behind. Barrels' last words were cursing Drake's absence in their greatest hour of need. Because of this, Drake held no grudge against Doflamingo for killing his father, showing that Barrels had ultimately lost his son's respect and love for him."}, {"type": "paragraph", "text": "Barrels called his son Dory (ドリィ, Dorii)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Barrels' physical abilities are unknown, but he likely has proficient strength, as he had already made a name for himself, though he was no match for Doflamingo."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Some time in the past, Diez Barrels was a Marine Officer but left to pursue piracy. His reason for leaving remains unknown. He started physically abusing his son Drake when he became a pirate. Drake, however, continued to follow his father when seeing his goodness in the past."}, {"type": "paragraph", "text": "As a pirate, he gained some infamy and acquired the Ope Ope no Mi. He made a deal with the Marines to meet on Rubeck Island to exchange the fruit for a large sum of money. He and his crew set up their base of operations in an abandoned town on Minion Island."}, {"type": "paragraph", "text": "One evening, as he and his crew were drinking and discussing the potential of the Devil Fruit, their hideout was attacked by Donquixote Rosinante. Barrels did not see or hear Rosinante because he destroyed the lights and used his abilities. Barrels was kicked in the face and had the Ope Ope no Mi stolen."}, {"type": "paragraph", "text": "When his subordinates attempted to treat his injuries, he demanded that they find the Ope Ope no Mi, exclaiming that it was worth 5,000,000,000. After Doflamingo arrived on Minion Island, Barrels and his crew became trapped on the island by the young pirate's Birdcage. Doflamingo eventually made it into Barrels' hideout, and after finding no useful information, shot Barrels and used his corpse as a chair."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Barrels Pirates vs. Donquixote Rosinante", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His surname Diez means \"ten\" in Spanish.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 77 Chapter 765 (p. 12-15) and Episode 704, Diez Barrels holds the Ope Ope no Mi, until Rosinante steals it from him.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 77 Chapter 766 (p. 3) and Episode 705, Barrels calls for his subordinates to retrieve the Ope Ope no Mi.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 78 (p. 142), Drake and Barrels' past revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 77 Chapter 767 (p. 4-6) and Episode 706, Doflamingo shoots Barrels and sits on his body.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 79 Chapter 793 (p. 11) and Episode 736, Drake confirms his father died that day.", "elements": []}]}], "images": []}]}