{"sections": [{"title": "Uholisia", "level": 1, "content": [{"type": "paragraph", "text": "Uholisia is the daughter of Chichilisia, the leader of the Niho Navy. She is the wife of 25 men and Sai's former fiancée."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Uholisia is a very muscular and masculine woman with blonde hair who is about as tall as Sai. She has red patches on her cheeks and very pronounced lips. Her facial features are very similar to those of Okama. She wears a blue dress with pink and yellow flowers on it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Uholisia_Anime_Infobox.png/revision/latest/scale-to-width-down/150?cb=20150922150753", "caption": "Uholisia in the anime, as she appeared in Sai's imagination."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She agreed to an arranged marriage with Sai for political reasons, showing her value in foreign affairs as well as the well-being of her own nation. She can be vicious, as she furiously gave Sai a beating when he broke off his engagement to her."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Fitting her muscular frame, Uholisia seems to be very strong, as she viciously beat up the powerful warrior Sai, although Sai did not seem to fight back."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, a marriage between Uholisia and Sai was arranged to unite the Happo Navy and the Niho Navy and create a political alliance."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "After the Happo Navy returned to Kano Country, Uholisia spoke to Sai about their wedding preparations."}, {"type": "paragraph", "text": "However, when Sai broke off their engagement, she responded by furiously beating him before walking away angrily. She was then seen inside a husband club, frustrated that she failed to make Sai her 26th husband."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Uholisia was first shown in an SBS in response to reader question, before making her debut in Sai's cover story.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/SBS77_5_Uholisia.png/revision/latest/scale-to-width-down/150?cb=20150427003834", "caption": "Uholisia as shown in the SBS."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 77 Chapter 771 (p. 7) and Episode 710, Uholisia is first mentioned.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 87 Chapter 879, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 13.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 77 (p. 154), Celebrate Congratulations on their marriage!! That is, Baby 5 and Sai!! By the way, what kind of woman is this \"Uholisia\" that was mentioned as Sai's ex-fiance? I imagine a rather gorilla-esque... strong, independent woman...", "elements": []}, {"text": "↑  One Piece Manga — Vol. 87 Chapter 877, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 12.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 88 Chapter 880, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 14.", "elements": []}]}], "images": []}]}