{"sections": [{"title": "Jozu", "level": 1, "content": [{"type": "paragraph", "text": "\"Diamond\" Jozu is the 3rd division commander of the Whitebeard Pirates. He is one of the most prominent members of his crew."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jozu is a big, very muscular, broad-chested, heavily-armored and dark-skinned man, called a giant by Crocodile. Even when standing in a hunched position, he is roughly twice Crocodile's height. He has a long face with black stripe-like patterns for a beard and hairstyle. His legs are relatively thin in comparison to his muscular arms. He appears battle-hardened and has a perpetual scowl on his face. The dark armor he wears and his hair style are very similar to that of an Aztec warrior, with red-bolted darl shoulder pads (the bolts were later changed to gray). On his chest he has a green cuirass, whose front and back portions are connected by metal straps that go over both his collarbones. The cuirass' color was later changed to a rusty red color. Around his waist there is a big, elaborated golden belt, worn over what looks like a green skirt similar to the ones worn by Aztecs, with golden decorations near the edge. He also wears what look like studded, black and gold large-buckled shoes or boots and matching black studded pants. During the battle at the summit, he lost his right arm when Aokiji froze him in a brief moment while Jozu's attention was turned away from him, causing the limb to become very brittle and break off once he fell over."}, {"type": "paragraph", "text": "Twenty two years ago, Jozu wore a black tanktop and a red sash instead of armor and had a much thinner neck, but otherwise looked the same as he is today. In the past when Whitebeard declared Fish-Man Island his territory, Jozu is seen wearing a different tanktop design."}, {"type": "paragraph", "text": "When Jozu was a child, he was rather round and chubby. He had stubby little legs, and and sported large black overalls, with round buttons. His hair was still in balls on top of his head, but he had less of it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jozu is a gruff, fairly quiet individual who tends to point out information to his crewmates. He has been shown as unrelenting to his enemies as he had no qualms in attempting to strike Crocodile a second time immediately after a first hit. He is loyal to Whitebeard and his crew, having protected them in at least three instances. However, this loyalty can be taken advantage of, as Aokiji freezes him the moment he was distracted by Marco being injured by Kizaru."}, {"type": "paragraph", "text": "When he was young, he had a playful side when he noticed Oden and Toki together."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the commander of the 3rd division of the Whitebeard Pirates, Jozu has authority over the lower-ranking subordinates. He was one of the few men unaffected by the powerful Haki released by the Yonko Shanks. He is very experienced, as he was shown as a member of the Whitebeard Pirates from the times of Gol D. Roger."}, {"type": "paragraph", "text": "During the Marineford war, Jozu was powerful enough to fight on par against the Shichibukai and Marine admirals."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Jozu has outstanding brute strength, comparable to that of the Giant Squad Marines, if not greater. He picked up and hurled an immense iceberg at a great distance at the giants protecting Marineford. The iceberg was so enormous that it was at least ten times as big as any of the Giant Squad's members. Thus, Jozu has demonstrated one of the greatest feats of strength seen in the series, though it is currently unknown how losing his right arm will affect his strength."}, {"type": "paragraph", "text": "Despite his massive body, his speed and reflexes are on par with his brute force. This speed, combined with his Haki, makes Jozu (especially when he's in his Diamond form) particularly dangerous against Logia users, who are normally used to simply letting strikes pass them with their intangibility; when he attacked Crocodile after the latter attempted to take Whitebeard's life, Crocodile commented on both the great speed and strength of the attack and had little time to recover from the blow. He possesses incredible endurance as well, as shown when he takes a point-blank range sandstorm from Crocodile (although Crocodile's attack was more to get him and Doflamingo out of his way, and not as an actual attack) and coming out completely uninjured despite being positioned at the eye of the storm (as well as being in his default form due to having his Devil Fruit power inactive at the time)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Jozu_Hurls_an_Iceberg.png/revision/latest/scale-to-width-down/210?cb=20130116150357", "caption": "Jozu hurling a gigantic iceberg at the Giant Squad."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Jozu ate the Kira Kira no Mi, a Paramecia-type Devil Fruit that allows him to transform parts and most likely all of his body, into diamond. This power has earned him the nickname \"Diamond Jozu\"."}, {"type": "paragraph", "text": "Jozu's powers give him the ability to greatly increase his offensive and defensive capabilities, as his already strong physical attacks are enhanced by the density of his diamond body. His defenses seem to enhance exponentially, as he is able to block the strongest slash in the world from the world's greatest swordsman, Shichibukai Dracule Mihawk, with no visible damage to himself, as diamond is one of the hardest substances in the world, along with Seastone and the Poneglyphs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ad/Kira_Kira_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20101021104815", "caption": "Jozu with most of his body covered in diamonds."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Jozu proved himself a proficient user of Busoshoku Haki when he successfully attacked and harmed Logia users in two separate instances. He launched a devastating surprise attack against Crocodile that knocked him a great distance back. Later, he launched another surprise attack against Admiral Aokiji, which shattered his ice form and caused the Admiral to bleed from the mouth."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Jozu possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early Life", "level": 4, "content": [{"type": "paragraph", "text": "He was born in the West Blue and grew up poor. He was forced to steal to survive and was never caught due to his agility."}], "images": []}, {"title": "Adventures With Kozuki Oden", "level": 4, "content": [{"type": "paragraph", "text": "Thirty years ago, Jozu was among the Whitebeard Pirates when they arrived for the first time at Wano Country. The crew was shipwrecked and before going to civilization to get supplies, they encountered Kozuki Oden, who asked Newgate to let him join their crew after a brief clash."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Oden kept asking to join the crew, but he was turned down. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. After Izo was pulled up onboard, Oden accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, the crew started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Shiki's Visit", "level": 4, "content": [{"type": "paragraph", "text": "When Shiki visited Whitebeard's ship after escaping from Impel Down two years after Gol D. Roger's execution, Jozu was seen in the background, but much thinner and without any armor."}], "images": []}, {"title": "Protection of Fishman Island", "level": 4, "content": [{"type": "paragraph", "text": "Jozu was also seen when Whitebeard declared Fish-Man Island his territory."}], "images": []}, {"title": "Thatch's Murder", "level": 4, "content": [{"type": "paragraph", "text": "After the murder of Thatch at the hands of Marshall D. Teach, Portgas D. Ace decided to search for Blackbeard and make him pay for what he did. However, Whitebeard, who was feeling uneasy, told Ace not to go, something that Ace did not want to hear. Jozu was one of the crew members who protested to Ace leaving the ship and going after Teach, but this was in vain."}], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Jozu first appeared as a background character when Rockstar was delivering a letter from Shanks to Whitebeard."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Like Marco, Jozu displayed a knowledge of what would happen when Shanks boarded their ship and commented on how Shanks' spirit was as strong as ever."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Jozu showed up at Marineford with the rest of the Whitebeard Pirates and their subordinate crews from the New World, in order to save Ace from execution. Including him and Marco, all the division commanders were ready to battle. When Dracule Mihawk, the greatest swordsman in the world, sent the strongest slash in the world towards the Moby Dick and Whitebeard, Jozu intercepted the attack, and was able to effectively stop it in its tracks by becoming diamond. Shortly afterwards, he destroyed a section of ice, picked up an enormous iceberg, and hurled it at the Marineford giants, but this was in turn nullified by Akainu's magma Devil Fruit powers. However, this failed assault proved to be indirectly useful shortly afterwards, when Monkey D. Luffy and the Impel Down prisoners arrived and were able to land safely in the water instead of the ice."}, {"type": "paragraph", "text": "He then launched a surprise assault at Crocodile after the latter's attempt to kill Whitebeard, and landed a devastating hit, thereby demonstrating his ability to use Haki. Moments before he was able to land a second blow on Crocodile, Donquixote Doflamingo, who had jumped on Jozu's back, stopped him in his tracks with his puppeteer power, and asked Crocodile if the two could team up."}, {"type": "paragraph", "text": "Crocodile refused and sent both Jozu and Doflamingo (along with several Marines and pirates, Buggy included) flying with a massive sandstorm. Jozu was then seen shocked when Squard stabbed Whitebeard. Later, Whitebeard told him to get ready for their trump card, in which Little Oars Jr. was to smash one of their ships through the opening of the Encircling Wall and into the plaza; after its success, Jozu was seen with his crewmates."}, {"type": "paragraph", "text": "When Admiral Aokiji attempted to halt Whitebeard's advance, Jozu intervened in the battle and smashed Aokiji into pieces, telling his captain to press on. As Aokiji reformed, all the while bleeding from the mouth, he murmured Jozu's epithet, and the two resumed their fight."}, {"type": "paragraph", "text": "When Jozu witnessed Marco getting struck by Kizaru's lasers, he called out Marco's name; Aokiji then took advantage of Jozu's distraction and froze over his arm. Soon afterward, he was shown entirely frozen falling to the ground. Because his right arm had become especially fragile from being frozen longer than the rest of his body, it broke off of him when Jozu fell over."}, {"type": "paragraph", "text": "Sometime after Ace had been freed, Jozu was carried away to the escape ship by his comrades, specifically by Blenheim, another division commander, where he was eventually thawed out. However, he was not present during both Ace and Whitebeard's deaths."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Jozu_vs._Crocodile.png/revision/latest/scale-to-width-down/210?cb=20130116150806", "caption": "Jozu hits Crocodile."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/aa/Jozu_Frozen.png/revision/latest/scale-to-width-down/210?cb=20101207122920", "caption": "Jozu completely frozen by Aokiji."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Jozu was seen alongside all of the other Whitebeard Pirates at Ace and Whitebeard's funeral on an island in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Jozu vs. Dracule Mihawk (just stopped Mihawk's attack on Whitebeard)", "elements": []}, {"text": "Jozu vs. Giant Squad (intercepted by Akainu)", "elements": []}, {"text": "Jozu vs. Crocodile", "elements": []}, {"text": "Jozu vs. Crocodile vs. Doflamingo", "elements": []}, {"text": "Jozu vs. Admiral Aokiji", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "First Appearance", "level": 3, "content": [{"type": "paragraph", "text": "In his first appearance in the anime, it was not known yet that he would later be revealed as a commander, and as such, he had a generic and vastly different appearance than he does now."}, {"type": "paragraph", "text": "After the correction, Jozu was shown wearing a green cuirass that had red bolts on its shoulder pads. In Opening 13, however, the color scheme had been changed: his cuirass is red, and the bolts are gray."}], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the manga, Jozu blocked the attack from Mihawk with his body. In the anime he was forced back and then deflected it into the sky."}, {"type": "paragraph", "text": "In the anime, he was seen smirking when he blocked Mihawk's strike and after he hurled the iceberg. In the manga, he has never once been depicted smiling."}], "images": []}, {"title": "Translation and Dub issues", "level": 2, "content": [{"type": "paragraph", "text": "Before the official romanization of his name was revealed, Jozu's name was often spelled differently in different translations. These include Joss, Jaws, and Jose to name a few. In One Piece Green: Secret Pieces, his name is confirmed to be Jozu."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise SP", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "After the war, Jozu appeared with his arm still intact in Chapter 590 of the Shonen Jump version; in Volume 60, however, the mistake was corrected as his bandaged arm was erased.", "elements": [{"text": "Prior to the correction, this led many people to believe that Jozu's Devil Fruit was a Logia-type, since his arm was still attached to the rest of his body.", "elements": []}]}, {"text": "Jozu is a support character in One Piece: Gigant Battle! 2 New World.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Jozu shares his birthday with Roronoa Zoro.", "elements": []}, {"text": "A fan asked Oda if Jozu's penis is a diamond, and Oda responded that it is.", "elements": []}]}], "images": []}]}