{"sections": [{"title": "Russian", "level": 1, "content": [{"type": "paragraph", "text": "Russian was Senor Pink's wife and the mother of Gimlet."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Russian was a young woman with brown, shoulder-length hair and blue eyes. On her cheeks she had two patches of freckles. When she entered a vegetative state, her eyes appeared blank looking."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c8/Russian_in_Digitally_Colored_Manga.png/revision/latest/scale-to-width-down/200?cb=20170327162949", "caption": "Russian in the digitally colored manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Russian was a very caring woman, especially toward her husband and son. She was very grieved when her son died and became distraught after she found out Senor Pink lied to her. However, she expressed a clear hatred for pirates."}, {"type": "paragraph", "text": "After Russian entered her vegetative state, she became unable to interact with the world or show her feelings; however, after her husband put on Gimlet's bonnet, pacifier and diaper when he visited her, she was able to smile again, showing that she could still subconsciously feel the love and efforts of her husband."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Senor Pink", "level": 3, "content": [{"type": "paragraph", "text": "Senor Pink was Russian's husband and lover and the two loved each other very much. However, after Russian found out that he lied to her about his job, she ran away from him, distraught and angry. However, after she entered a vegetative state and Senor Pink wore Gimlet's clothes to cheer her up, she was able to smile again, indicating that she was still quite close to her husband. Even after Russian's death, Pink continues to wear infant clothing, showing a deep sense of lingering love."}], "images": []}, {"title": "Gimlet", "level": 3, "content": [{"type": "paragraph", "text": "Gimlet was Russian's only son and she cared about him very much. She became distraught after he died of a fever. However, it was Senor Pink's attempts at reminding her of her son that allowed her to smile once more."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Russian and Senor Pink encountered each other on the streets while waiting for the rain to stop. They continued to see each other and eventually fell in love. They got married and had a son named Gimlet, and shortly afterwards Senor Pink left to raid with the Donquixote Pirates, although he lied to her and told her he was a banker."}, {"type": "paragraph", "text": "During that time Gimlet died of a fever, and Russian found out that Pink was not a banker after she called the bank that Pink was supposedly working for. She left him in disgust despite Pink's efforts to explain things to her, and also despite of the storm that was currently happening. Russian was later caught in a landslide. This put her in a vegetative state; the doctors predicted she might not become normal again and that she might no longer able to express her feelings to anyone, and then worried about how long she had left to live. Pink was saddened by this; nevertheless, he never stopped visiting Russian frequently at the hospital and tried hard to make her smile again. This became a success after Senor Pink put on Gimlet's bonnet and pacifier. Senor Pink was first shown wearing these clothes during the takeover of Dressrosa, so it can be assumed that these events happened between ten and sixteen years ago. She passed away an unknown number of years after entering her vegetative state."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Senor_Pink%27s_Family.png/revision/latest/scale-to-width-down/250?cb=20151025211659", "caption": "Russian with her husband and son."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Russian was initially planned to be named \"Margarita\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 77 Chapter 775 (p. 13-18) and Episodes 715–716, Senor Pink's past with his other family is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 78 (p. 46), Oda speaks of Gimlet and Russian's name origin.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0904).", "elements": []}]}], "images": []}]}