{"sections": [{"title": "Isshi-100", "level": 1, "content": [{"type": "paragraph", "text": "The Isshi-20 were the twenty most skilled doctors on Drum Island, whom Wapol took for himself in order to make his subjects dependent on him for their services."}, {"type": "paragraph", "text": "The Isshi-100 are the Isshi-20 renamed two years after their introduction, as they have recruited eighty additional doctors, becoming a group of one hundred doctors. They are now led by Kureha."}], "images": []}, {"title": "About", "level": 2, "content": [{"type": "paragraph", "text": "The Isshi-100 are one hundred different doctors who dress in scrubs with sunglasses. They constantly have surgery mask and gloves on them. They are all of varying height with similar builds and most of the time stand as if prepared for surgery. The Isshi-20 from two years ago wore pink scrubs, but the color of the scrubs the Isshi-100 are currently wearing remains unconfirmed."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The Isshi-20 were the some of the most highly skilled doctors of Drum Island. Their external injuries unit was skilled enough to save Wapol's life even after he was decapitated. They use various techniques, such as cutting with a scalpel, stitching injuries, setting metal plates, and reinforcing them with a hammer."}, {"type": "paragraph", "text": "As the Isshi-100, their capabilities as doctors remain to be seen."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "During King Wapol's Doctor Hunt, he ordered all doctors on Drum Island to live under his direct command, while eliminating those who did not comply either by banishment or killing. This was done to force the citizens to grovel to Wapol for medical help, so his tyrannical rule would be unopposed."}, {"type": "paragraph", "text": "The twenty doctors who complied became known as the Isshi-20 and were the only doctors on the island left aside from Kureha and Hiriluk. While they remained under Wapol's control, they secretly despised him as the rest of the people did. However, they gave in to the king in order to continue their research and refine their techniques."}, {"type": "paragraph", "text": "One day, the Isshi-20 ordered members of the Wapol’s security force in Robelle to pick mushrooms, as they were researching their effectiveness against illnesses. This lapse in security allowed Hiriluk and Tony Tony Chopper to attempt to treat the town’s ill citizens, though they failed at it."}, {"type": "paragraph", "text": "Word got out that the Isshi-20 became ill, putting the country in crisis. Hiriluk decided to travel to the Drum Castle to save them. However, the Isshi-20 were not actually sick, and the rumor was created to lure Hiriluk to him. When Hiriluk arrived at the castle, he saw the Isshi-20 in good health and realized that he had been tricked. Hiriluk fell to his knees, thankfully crying that the doctors were safe. Terminally ill and poisoned, he then decided to take his own life, speaking on his legacy before blowing himself up."}, {"type": "paragraph", "text": "Upon seeing the rogue doctor Dr. Hiriluk's noble sacrifice, the Isshi-20 became determined not to give up and lose to him as doctors. To this end, they hoped to use their research and techniques to help their compatriots. When Wapol fled the kingdom due to a a fearsome enemy's attack, he took the Isshi-20 with him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/Isshi_20.png/revision/latest/scale-to-width-down/200?cb=20180204134143", "caption": "The Isshi-20, under Wapol's command."}]}, {"title": "Drum Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Wapol and his crew returned to Drum Island, Dalton struck Wapol down, slashing him across the chest. Kuromarimo ordered the external injuries squad to operate, and they used their medical skills to treat him. When Wapol sighed in relief that he was saved, the doctors panicked, as they had yet to reattach his head. When an avalanche erupted, the Isshi-20 asked Wapol to let them ride Robson with him, but the king refused, leaving them behind to fend for themselves."}, {"type": "paragraph", "text": "Having survived the avalanche, the Isshi-20 mobilized to save Dalton, who had been gravely injured by Chess. The townspeople and Straw Hat Pirates were reluctant to trust them, but they reveal that they hated Wapol and were inspired by Hiriluk’s sacrifice to never give up hope. The doctors saved Dalton, but when he regained consciousness, he stormed out of where he was being treated and declared that he had to stilll stand up to Wapol. The doctors tried to dissuade him, but Dalton decided to go with the help of the Straw Hat Pirates."}, {"type": "paragraph", "text": "After Wapol was defeated, they were forgiven by the people of the island and rejoined them as citizens of the new Sakura Kingdom."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Two years later, the Isshi-20 grew to become the Isshi-100, working under Kureha at Sakura Kingdom's medical center. They now have a new logo: a black flag combining the cross from Chopper's hat with a silhouette of what looks like Hiriluk's hat."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "\"Isshi\" is derived from ishi (医師, ishi), which means \"doctor\". In the English version, the Isshi-20 are accurately translated as \"doctors\" or \"MDs\", the last, meaning Doctor of Medicine (from the Latin Medicinae Doctor)."}], "images": []}]}