{"sections": [{"title": "Lola (Zombie)", "level": 1, "content": [{"type": "paragraph", "text": "Lola was a General Zombie created by Dr. Hogback and animated by Gecko Moria's powers, using the shadow of Charlotte Lola."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lola was a zombie stitched together from the remains of a warthog. She had pink skin and a large, skeletal mouth with two large tusks. She had a small scar connecting her two nostrils and wore red lipstick, as well as a wedding dress with golden metal shoulder pads and corsets."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Lola_%28Zombie%29_Manga_Color_Scheme.png/revision/latest?cb=20150828101357", "caption": "Lola's manga color scheme."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Due to being animated by the shadow of a pirate known for proposing to many men, Lola was completely infatuated with her commander Absalom, whom she referred to as \"Ab-sama\", and was obsessed with marrying him. This sets her apart from the real Lola, who simply proposes to any man she has her sights on, and lets him go upon being rejected. Also, while the real Lola continuously tries finding a different man to propose to after being rejected, the zombie who carried her shadow focused entirely one man. Also, unlike the original Lola, who takes the constant rejections well and acknowledges them instantly, the zombie would employ underhanded tactics like attempting to trick Absalom into signing a marriage registration without his consent and kill anyone else whom Absalom fancied to be his wife, as well as attack anyone who tried to stop her from doing so. However, she was not without intelligence, as she immediately saw through Nami's claim of being a man and created an opportunity for her to escape from Absalom by pretending to attack her in a fit of rage during their \"wedding\". Additionally, she is perfectly capable of forming a meaningful and sententious friendship with someone who supports her feelings toward Absalom."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Thriller Bark Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Lola did not seem to hold any particular loyalty toward Gecko Moria or camaraderie with her fellow zombies, as she swiftly attacked Inuppe for getting in her way and was impressed rather than shocked when the Straw Hat Pirates defeated Oars and seemingly Moria as well."}], "images": []}, {"title": "Absalom", "level": 4, "content": [{"type": "paragraph", "text": "Lola was completely in love with Absalom and did everything in her power to get married to him, through methods both direct and deceitful. Her infatuation with him was such that she would kill any other potential brides for him and remained devoted to becoming his wife even after Absalom brutally attacked her, to the point of kissing him while he was unconscious in order to seal the deal. Absalom, on the other hand, viewed Lola's continued attempts at wedding him to be a curse and eventually attacked her for interfering with his wedding ceremony."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Lola_Sneaks_Up_On_Absalom.png/revision/latest/scale-to-width-down/190?cb=20160330214740", "caption": "Lola terrifies Absalom with another marriage proposal."}]}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "When pursuing Nami with the intention of killing her, Lola flung aside both Usopp and Tony Tony Chopper for trying to stop her; however, after befriending Nami, Lola became neutral toward the pirates and later expressed her admiration of them for defeating Oars."}], "images": []}, {"title": "Nami", "level": 4, "content": [{"type": "paragraph", "text": "After learning that Absalom planned to marry her and that she was an ideal bride for him, Lola decided to kill Nami in order to secure Absalom for herself. However, when Lola was about to kill her, Nami claimed that she was actually a man named Namizo; though Lola saw right through this, she was moved by Nami revealing that she believed Lola and Absalom would make a good couple and that she supported Lola's feelings, being the first to ever do so. Due to their friendship, Lola was willing to divulge where the treasure room was located on Thriller Bark and claimed that Nami had given her courage upon resuming her pursuit of Absalom. Later, Lola came to her aid when Nami was about to be married to Absalom; though she appeared outraged by Nami seemingly lying to her to the point of attacking her once more, Lola was actually giving her an opportunity to escape and later forgave Nami for lying about her name and gender. Lola's friendship with Nami was so deep and meaningful to her that upon regaining her shadow, Charlotte Lola addressed Nami as \"Namizo\" and noted that it felt like they had met before."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Nami_and_Lola_Talk.PNG/revision/latest/scale-to-width-down/210?cb=20130731150514", "caption": "Lola and Nami discuss how to get Absalom to finally marry Lola."}]}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Lola possessed considerable physical strength, having effortlessly wielded a large axe in combat, smacked Inuppe away with enough force to crater the wall he crashed into, and carried around the weight of both Usopp and Tony Tony Chopper (in his human form), both of whom she sent flying simultaneously with a flick of her head; using her katanas, she can cut through solid stone with ease. She also had inhuman durability and stamina; when Absalom blasted her with his bazooka, not only did she remain conscious after the blast, but she got to her feet a few minutes later without displaying any lasting injuries or fatigue beyond some moderate scratches."}], "images": []}, {"title": "Hanayome Bujutsu", "level": 3, "content": [{"type": "paragraph", "text": "While not exactly a fighting style, Lola practiced a form of martial arts called Hanayome Bujutsu (花嫁武術, Bridal Arts)(Bridal Martial Arts in the Funimation dub) that acted as a way for her to show her affection toward the one she loved rather than as a way to defeat an opponent."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Chikai no Kiss (誓いのKiss (キス), Chikai no Kisu, literally meaning \"Oath Kiss\"): Lola attempts to kiss her love in order to seal a marriage bond between them. Despite the non-combative intention of the attack, it is fairly powerful, with Lola having left a kiss mark in the ground when she missed her target. This was first witnessed being used unsuccessfully against Absalom, who blocked all of Lola's attempts to kiss him. In the Funimation dub, this is called Marital Vow Kiss.", "elements": []}]}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "list", "elements": [{"text": "Chikai no Hug (誓いのハグ, Chikai no Hagu, literally meaning \"Oath Hug\"): Lola attempts to hug her beloved in a loving, if not violent, manner. This was first witnessed being used against Absalom. In the Funimation dub, this is called Sweetie-Pie Hug.", "elements": []}]}, {"type": "list", "elements": [{"text": "Chikai no Love Attack (誓いのラブアタック, Chikai no Rabu Atakku, literally meaning \"Oath Love Attack\"): Lola pins down her beloved and attempts to force them to sign a marriage certificate. This was first witnessed being used against Absalom. In the Funimation dub, this is called Love Sign Attack: Certificate Seal.", "elements": []}]}, {"type": "list", "elements": [{"text": "Chikai no Himesama Dakko (誓いの姫様抱っこ, Chikai no Himesama Dakko, literally meaning \"Oath Princess Catch\") Lola jumps onto her beloved and pins them down in a suggestive position before attempting to kiss them. This was first witnessed being used against Absalom. In the Funimation dub, this is called Embrace of Your Princess.", "elements": []}]}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Chikai_no_Kiss.png/revision/latest/scale-to-width-down/210?cb=20160330215037", "caption": "Chikai no Kiss."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Lola wielded two large katanas that she keeps strapped to her back, similar to the original owner of her shadow. Her proficiency with them is unknown, but she could slash very rapidly with them in combat, as well as convincingly attack someone without actually hurting them."}, {"type": "paragraph", "text": "When attempting to kill Nami, Lola wielded a large, ornate axe with a golden pommel on both ends of the handle and a skull on the bottom pommel, which was snapped in two by a kick from Inuppe."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Three years before the Straw Hat Pirates came to Thriller Bark, Charlotte Lola and her crew were drawn to the ship and stripped of their shadows by Gecko Moria. Lola's shadow was placed inside a large warthog corpse stitched together by Hogback, creating the General Zombie Lola, who served under Absalom."}], "images": []}, {"title": "Thriller Bark Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Absalom woke the General Zombies and sent them out to fight the Straw Hat Pirates, Lola appeared and demanded that he marry her. Absalom claimed that they could not marry because he was a human and she was a zombie warthog, but Lola merely tried to trick him into signing a marriage registration before attempting to kiss him multiple times with Chikai no Kiss. When Absalom revealed that he had found a suitable bride in the form of Nami, Lola claimed his efforts to marry her would be in vain, only to declare that she would kill Nami upon learning that she was already on Thriller Bark."}, {"type": "paragraph", "text": "Shortly afterward, Lola found Nami in Perona's Wonder Garden and prepared to kill her with a giant axe, only for Inuppe to break the axe in half with a single kick. Annoyed by this, Lola hurled Inuppe into a nearby wall before resuming her pursuit of Nami after the latter escaped from Absalom's clutches."}, {"type": "paragraph", "text": "Eventually, Lola chased Nami down after shaking off Usopp and Tony Tony Chopper, where she prepared to kill her, only to be stunned by Nami's claim that she was actually a man named Namizo and supported Lola marrying Absalom. Incredibly happy that Nami supported her feelings, Lola accepted her declaration of friendship and began discussing how to marry Absalom, where they concluded that Lola should marry him while Absalom was unconscious because she was a zombie and thus did not have to comply with human morality. After revealing that the treasure room was located near Perona's room, Lola continued to chat with Nami before being informed that Absalom had caught up with them, which prompted her to resume her pursuit of him while declaring that Nami had given her courage. Shortly afterward, however, Lola lost track of Absalom."}, {"type": "paragraph", "text": "Later, as Absalom was attempting to seal his marriage to Nami by kissing her, a furious Lola interrupted the ceremony, claiming that Nami must have been lying about supporting her feelings and was trying to steal Absalom away from her, before attacking her. When Absalom demanded to know what she was doing to his bride, Lola revealed Nami's claim of being a man named Namizo, to Absalom's confusion, before resuming her attack on Nami. However, as Nami realized that she was not actually being harmed, Lola secretly revealed she was providing a distraction so Nami could run away before flinging herself toward Absalom in an attempt to kiss him, only for Absalom to angrily blast her with one of his bazookas for interrupting his ceremony. After knocking out Absalom, Nami rushed to Lola's side and apologized for lying about being a man, only for Lola to reveal that she knew Nami was a woman all along. Pointing out that Absalom could no longer resist, Lola pounced on him while declaring that he would be a groom."}, {"type": "paragraph", "text": "While kissing Absalom, Lola informed Nami of Monkey D. Luffy having had his shadow implanted into Oars, who was rampaging around the island."}, {"type": "paragraph", "text": "After the Straw Hat Pirates finally defeated Oars, Lola watched from a damaged section of the mansion and noted that they were impressive fighters. Shortly afterward, Gecko Moria removed Lola's shadow from her body to empower himself, leaving Lola a lifeless corpse once more."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Lola_Attempts_To_Marry_Absalom.png/revision/latest/scale-to-width-down/210?cb=20160330215150", "caption": "Lola attempts to trick Absalom into signing a marriage registration."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d1/Nami_Befriends_Lola.png/revision/latest/scale-to-width-down/210?cb=20160330215327", "caption": "Lola becomes friends with Nami."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/Absalom_Blasts_Lola.png/revision/latest/scale-to-width-down/210?cb=20160330215455", "caption": "Absalom blasts Lola with his bazooka for interrupting his ceremony."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Lola_Loses_Her_Shadow.png/revision/latest/scale-to-width-down/210?cb=20160330215615", "caption": "Lola has her shadow taken by Moria."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Lola vs. Inuppe", "elements": []}, {"text": "Lola and Nami vs. Absalom", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}]}