{"sections": [{"title": "Zambai", "level": 1, "content": [{"type": "paragraph", "text": "Zambai was a member of the Franky Family and was Franky's right hand man. After the timeskip, he, Kiev, and Tamagon have joined the Galley-La Company as Zambai's Company Union."}, {"type": "paragraph", "text": "He became an ally of the Straw Hat Pirates during the end of the Water 7 Arc and the beginning of the Enies Lobby Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Zambai is a tall man with long black hair usually sticking up and a wide grin. He typically wears the Franky Family goggles, gloves, and suspenders with stockings on his legs. He also has shamrock-shaped tattoos on his shoulders. For most of the CP9 saga, he was seen heavily bandaged, with one of his front teeth missing and with his goggles broken so that his right eye was exposed, as a result of the Franky Family's battle with Luffy, Zoro, Sanji, and Chopper."}, {"type": "paragraph", "text": "After the timeskip, Zambai now wears a Galley-La hat and shirt. He still wears his goggles (no longer broken) and now wears shorts with stockings and large boots, as well as a pair of roller-skates. His missing tooth has also been replaced."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Zambai is confident in his strength and abilities and is very brave, willing to pick a fight with any enemy regardless of how strong they appear, as shown when he engaged Baskerville with no hesitation. He shows little sympathy to any of the pirates that the Franky Family takes advantage of, but cares a great deal for his own comrades. He can be forgiving when he needs to be, shown when he let go of his grudge against the Straw Hats to be able to help Franky. Zambai also has a childish side, as shown when he and and other members of the Franky Family and Galley-La Company played \"Straw Hats\" by pretending to be them and imitated them fighting the Aqua Laguna on the Sea Train."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Franky", "level": 3, "content": [{"type": "paragraph", "text": "From the time he met Franky, he came to deeply respect him and called him \"Aniki\" just like the other Franky Family members. Franky had an extremely profound influence on Zambai's life, to the extent that he was willing to go to such extreme lengths as infiltrating Enies Lobby in order to save him, and beg the Straw Hat Pirates, who had very recently solicited hatred from him, to allow them to go with them. He was willing to do whatever he had to for Franky's happiness, to the point of practically forcing him to leave the island and join the Straw Hats."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Initially, his relationship with the Straw Hat Pirates was sour. He first attempted to beat them up and steal from them as he would from any other pirate, and developed a grudge against them when they retaliated violently. This changed when the Franky Family allied with them and the three remaining Galley-La foremen in their invasion of Enies Lobby. He quickly grew to respect them and their extraordinary power, going so far as to call them \"Aniki\" as well."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "In terms of fighting ability, Zambai seems more competent than most members of the Franky Family in both melee and long range combat. He helped to defeat Kashi, and was able to fight toe-to-toe against Baskerville (all three) before he, the Galley-La Company and the rest of the Franky Family were cornered by the Marines."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is armed with a bazooka and a pair of katanas. He is quite skilled in using them."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bazooka Bat (バズーカバット, Bazūka Batto): Zambai uses his bazooka to strike the enemy at melee range.", "elements": []}, {"text": "Kaitai Buttagiri (解体ぶった斬り, Kaitai Buttagiri, literally \"Dismantling Cut\"): Zambai uses a sword and slashes his opponents vertically, attempting to cut them in half. In the FUNimation dub, this is called Dismantler Chop.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past in the Slums", "level": 3, "content": [{"type": "paragraph", "text": "During the opening day of the Puffing Tom, a young Zambai was seen amongst the crowd. Inspired by this event, Zambai tried to become a shipwright. He however failed and instead became a gang boss of the back streets of Water 7."}, {"type": "paragraph", "text": "He and his gang were then found and defeated by Franky when he entered their turf. Afterwards, Zambai and his gang were then given jobs by Franky and were assimilated into the Franky Family."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Zambai_Young.png/revision/latest/scale-to-width-down/140?cb=20130920051752", "caption": "Zambai witnessing Puffing Tom's departure."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "Zambai was first seen when he lead the group of the Franky Family that attacked a seemingly asleep Zoro on the Going Merry. Zoro, however, was alert and countered the attack with his sword. To his question about their intention, Zambai responded that they are The Franky Family, and they came to collect the bounty on his head. Much to their effort though, Zoro was able to defeat them rather easily and sent them flying in the water before continuing his nap."}, {"type": "paragraph", "text": "Later on, Zambai and his gang attempted to steal the money Luffy, Nami and Usopp got from exchanging the treasure, while the three weren't paying attention. Just when they thought they got away with the loot however, Paulie appeared jumping of a bridge straight on their Yagaras and, using his ropes, he defeated them, threw them into the water and took their Yagara, along with the bags of money.After the money were returned and and the three Straw Hats went to the docks to get information about the reparation of their ship, Zambai's gang attacked once more, this time ambushing a distracted and isolated Usopp. By the time Nami and Luffy realized what had happened, Usopp was already taken hostage along with money contained in two of the bags. Usopp was later found beat up badly, but it was already too late for the money."}, {"type": "paragraph", "text": "Back at the Franky Family headquarters, the Franky House, the boss, Franky, is astonished by the loot his underlings managed to obtain, and states that with this money they can finally buy the thing they've been wanting for three years. Just as the gang celebrates, the door explodes and reveals the badly wounded Usopp who came determined to fight for his crew's money. Despite his effort though, he gets laughed at and beaten up once again. Franky family then started a celebration with food, drinks and gambling, when suddenly Luffy, Zoro, Sanji and Chopper came at their door, seeking revenge for their mistreated crewmate. The four Straw Hat pirates start rampaging against the Franky Family, who even presented their strongest members for the battle, but they were proven no match for the raging pirates. After the battle, all the members, Zambai included, of the Family were beaten unconscious and even the house was brought down to ruins. When Franky, along with Mozu and Kiwi, returned from shopping and found his house destroyed, Zambai informed his boss that this was done by the Straw Hats, who are staying in an Inn and are probably heading to Dock 1 right now."}, {"type": "paragraph", "text": "After his first encounter with Luffy, Franky resumes his search for the Straw Hats. He reunites with Zambai, who inform him that Usopp is alone on their ship trying to fix it, and decides to kidnap Usopp in order to lure his captain. He gives the order to Zambai and his men to walk around town and yell about the kidnapping, however, instead of the Straw Hat pirates the Franky Family's yells catch the attention of the CP9 who seek Franky for the Pluton blueprints. When they refuse to tell the agents where Franky is, the CP9 defeat them quickly. Zambai shouts for help from Franky as Lucci finishes him off."}, {"type": "paragraph", "text": "When Luffy and his crew were preparing to board the Rocket Man to rescue Nico Robin, Zambai and his groups along with Mozu and Kiwi burst into the warehouse, begging Luffy to take the Franky Family with them. Luffy easily forgave the group by telling them to hurry and board. Zambai informed him that they would be using the King Bulls cart to attach the Rocketman."}, {"type": "paragraph", "text": "Later Zambai, Paulie and Luffy formed an alliance to fight against the forces from Enies Lobby."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9a/Lucci_Defeats_Zambai.png/revision/latest/scale-to-width-down/210?cb=20130922171638", "caption": "Lucci defeats Zambai."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Straw_Hat%2C_Galley-La%2C_and_Franky_Family_Alliance_Formed.png/revision/latest/scale-to-width-down/210?cb=20190825054310", "caption": "The Straw Hat Pirates, Galley-La Foremen and Franky Family unite."}]}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Upon arriving at Enies Lobby, The Franky Family along with the Straw Hats and the Galley-La workers lay down their plan of attack. Franky family are supposed to move in and open the main gate. When they reach the main gate, they are faced against the two giants who guard it, Oimo and Kashii. Zambai leads his team into a fierce combat against the giants, and with the aid of Galley-La, they manage to bring them down, open the gate and lead the way for the upcoming Straw Hat pirates. The team, riding the giant King Bulls, advances towards the inner section of the island defeating foe after foe, until they reach the courthouse. There, they split in two groups in order to find the two separate switches that lower the bridge to the Tower of Justice. He, Paulie and a handful of Franky Family members had engaged Three-Headed judge, Baskerville, in combat but were eventually subdued and apparently defeated."}, {"type": "paragraph", "text": "Upon the news of the Buster Call's issue reaching them, Zambai and his comrades are already freed by Paulie and desperately try to make a move and escape the island. When they reach the coast, the Franky family come across the warship led by Vice Admiral Strawberry, who orders his men to attack the criminals. The team gets bombed and thrown off a cliff but are all saved at the last minute by Paulie's ropes. When finally, the Straw Hat pirates draw the attention of the marines, Zambai and Paulie lead their men aboard the sea train, thus escaping the burning island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Paulie_and_Zambai_Separate_Baskerville.png/revision/latest/scale-to-width-down/180?cb=20150326173027", "caption": "Zambai and Paulie \"defeat\" Baskerville."}]}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Straw Hats party, Zambai joined in alongside everyone else that participated in the Enies Lobby fight."}, {"type": "paragraph", "text": "Later, Zambai begged the Straw Hats to take his boss, Franky with them, saying that now that Franky is a wanted man, the Franky Family does not have the strength to protect him from bounty hunters and Marine officials. Zambai then tries to reason with Franky to join the Straw Hat Pirates, but Franky refuses. Zambai then takes part in passing the swim briefs to the Thousand Sunny, however Franky angrily wounds his family and almost gets defeated until Luffy takes it."}, {"type": "paragraph", "text": "When the time to say farewell comes, Zambai tosses a bag of Franky's stuff from the top of the ruined city stairs. He bids Franky good luck and emotionally watches the Thousand Sunny sail off with Franky. Shortly Usopp showed up to where Zambai was and told him that his friends are sailing away. He was amazed that Usopp recklessly jumped off the stairs and landed 5 feet below but managed to get up fast and screamed that he was sorry to his friends. Zambai cheered when Usopp boarded the Thousand Sunny."}, {"type": "paragraph", "text": "Later Zambai was busy repairing the damaged Franky House along with his family. However Iceburg showed up and offered them a job, Zambai and his group happily accepted and started calling him \"new bro\" which makes Iceburg feel uneasy."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Zambai was seen with Tamagon and Kiev, now as part of Galley-La. The three have set up Zambai's Company Union, and Zambai is seen trying to sell Bimine and Marumieta two ships and cola."}], "images": []}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Franky's new wanted poster reached Water 7, Zambai was shown looking at it with a shocked expression."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 324 and Episode 230, Zambai makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 72), His birthday is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0365), Information about Zambai is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 325 and Episode 230, Zambai is first seen in detail.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 35 Chapter 335 and Episode 237, Zambai after his fight with the Straw Hats", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 399 and Episode 284, Zambai uses Kaitai Buttagiri on Baskerville.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 38 (p. 146), Oda explains that Zambai also joined the event along with Paulie, Mozu, and Kiwi.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 437 and Episode 322, Franky finds and defeats Zambai's gang in a small flashback.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 433 and Episode 315, The Straw Hats, Franky Family, and Galley-La celebrate by having a pool party.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 81 Chapter 816, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 10.", "elements": []}]}], "images": []}]}