{"sections": [{"title": "Carne", "level": 1, "content": [{"type": "paragraph", "text": "Carne is one of the main cooks on the floating restaurant ship, Baratie."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Carne is about average-sized, has an unshaven face, and brown hair. He is a chef who wears the usual clothes for his job along with dark sunglasses and a chef's hat."}, {"type": "paragraph", "text": "After two years, he has grown out his hair and has grown a goatee. He also wears a larger chef's hat. He wears the same chef's uniform, and has knives on his right side. He also has a striped ascot, instead of a solid colored one, along with a new apron."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is very proud of the Baratie and loyal to Zeff. He also acts rude to Sanji, but in reality cares for him a lot."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Culinary Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Carne is one of the Baratie's best chefs. He is capable enough to be entrusted by Zeff to run the Nasugasira teppanyaki ship."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Carne has great physical strength and considerable combat skills and experience, having fought off countless pirates who tried to cause trouble at the Baratie for years. When the restaurant comes under attack by the Krieg Pirates, Carne, alonside Patty, was able to take down a large number of Kreig's men."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He fights with a large extended knife."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Carne and Patty started working at Baratie after seeing Zeff's advertisement about \"damn cooks wanted\"."}, {"type": "paragraph", "text": "Around that time, the three chefs tried to petition Zeff to hire some female chefs, but Zeff refused because his style of training would not, in his opinion, be suitable for women."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Baratie Arc", "level": 4, "content": [{"type": "paragraph", "text": "He and Patty became very essential in defending the Baratie when Don Krieg attempted to take over the restaurant, but they were defeated by Pearl."}, {"type": "paragraph", "text": "Sanji stepped up to battle Pearl and revealed his superior kicking abilities. However, the battle was cut short as Zeff had been taken hostage by Gin. Sanji refused to let any harm to come to Zeff as he owed the man with his life. Patty and Carne demanded to know their past, so Sanji informed them about how, when Sanji was young, Zeff had attacked his ship."}, {"type": "paragraph", "text": "As the battle raged on, Don Krieg launched a MH5 Poison Bomb at the Baratie. Patty and the other cooks were able to take cover from the gas until it dissipated. However, they realize the enemy commander Gin had been poisoned in a turn of events. They initially declared they would refuse to help him, but were ultimately coerced into giving Gin antidote by Sanji."}, {"type": "paragraph", "text": "They then witnessed the defeat of Don Krieg at the hands of Luffy. As they recuperate from a hard battle, Zeff overhears Sanji turn down the chance to leave the Baratie with Luffy to the Grand Line. Seeing the joy on Sanji's face and voice as he talked about his dream, Zeff had Patty and Carne help him in a plan to convince Sanji to leave. As they met to eat, they all pretended Sanji's soup tasted horrible. They told him his cooking skills were horrible and should leave. Sanji was even kicked out of the restaurant by Zeff when he challenged them and their tastes. After filling him up with supplies, Sanji prepared to push off when Patty and Carne attempted to perform one more surprise attack on Sanji. He easily defeated their attack as he took off. Zeff wished him luck and Sanji bowed and began crying as he showed the Baratie his ultimate respect. Sanji then left the the Baratie cooks and began his new life as a Straw Hat Pirate."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Enies Lobby Incident, he was seen laughing at Sanji's poorly drawn wanted poster."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Carne is seen again two years later, presenting a new ship connected to the Baratie: \"Nasugasira\"."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events at Dressrosa, Carne and the other chefs of the Baratie received Sanji's new wanted poster, with Carne ripping up the bounty poster while Patty laughed."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Some pirates visited the restaurant and demanded food. Carne was displeased with their presence but Zeff had no objections preparing a meal for them."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the 4Kids dub, Carne is given a very heavy Mexican accent.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Carne is the Spanish, Italian, Filipino, Romanian, and Portuguese word for \"meat\".", "elements": []}, {"text": "Carne's favorite food is roast beef.", "elements": []}]}], "images": []}]}