{"sections": [{"title": "Clover", "level": 1, "content": [{"type": "paragraph", "text": "Professor Clover was the director of the Ohara Library, and a leading authority on archeology. He was a professor and scholar who studied poneglyphs with his fellow colleagues in the Tree of Knowledge."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Clover was an elderly man with a shaved top, with his green hair adjusted jutting on the sides and the back top, combined with a large beard, all in the shape of leaves. This overall was a reminiscence of an upside down three-leaf clover. He wore a red-and-white striped shirt with a large belt at his waist, pants and a blue-and-black jacket."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8f/Clover_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180908233604", "caption": "Clover's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Clover was a kind and caring man, as he did not see Robin as a monster as the rest of Ohara's citizens did. He allowed her to read the books in the library, study history, and happily graduated her into archeology. He forbade her from studying the forbidden poneglyphs only to protect her from the World Government's wrath. When he learned about her ability to read the poneglyphs, he regretted not knowing despite watching over her or being able to do more for her in order to not make her feel alienated as a result. When Olvia and Robin were forced to separate again, Clover shed a tear for the mother and daughter."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a scholar from Ohara, Professor Clover had the skills to read Poneglyphs, thus being one of the few people with the ability to discover the truth about the Void Century, and the exact locations of the ancient weapons. As a leading professor of archaeology, he had immense knowledge of history, including the secret events of the Void Century. Clover's renown knowledge was so high, even Silvers Rayleigh complimented him."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "After the departure of Olvia from Ohara, Robin wandered into the Tree of Knowledge. Clover allowed her in to read the books."}, {"type": "paragraph", "text": "He later helped Robin become an official archaeologist. However, he forbade her from studying Ohara's poneglyph, not wanting her to fall prey to the World Government like her mother Nico Olvia did."}, {"type": "paragraph", "text": "Sadly, it was not to be as the World Government found out about Ohara's research and dispatched the CP9 to take care of them. Clover tried to persuade Robin to escape as the CP9 rounded up the archaeologists. The reason for this is that Clover spoke to the World Government regarding the scholar's findings in the poneglyphs. He did not want Robin to know those results, for fear that she would also be targeted by the World Government."}, {"type": "paragraph", "text": "Clover stated that before the World Government was formed, the world was ruled by a Great Kingdom. But they were wiped out by a group that would one day become the World Government. However, before Clover could reveal the name, he was shot and mortally wounded. The Buster Call was then initiated and Marine ships began to assault Ohara. Clover, along with Olvia and the other scholars, stayed behind to save as many books as they could from the Tree of Knowledge for future generations. Afterward, he and the scholars all stayed in the tree as it burned down around them and the rest of Ohara was destroyed. They were all killed when the tree fell and crushed and burned them while they were throwing books into the lake, in the hopes of preserving history. The Marines later found the books in the lake after searching the island for survivors, but they thought that it was just a coincidence."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 391 and Episode 275.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0426), Information about Clover is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 54), Clover's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 507 and Episode 400, Rayleigh spoke highly of Clover's intelligence.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 393 and Episode 276, flashback of leaving Robin after being left behind.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 392 and Episode 275, Clover forbids Robin for studying the Void Century.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 395 and Episode 277, Clover tells the World Government what he has learned.", "elements": []}]}], "images": []}]}