{"sections": [{"title": "John Giant", "level": 1, "content": [{"type": "paragraph", "text": "John Giant is a Vice Admiral in the Marine Headquarters, and the first giant to ever enlist in the Marines."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "John Giant is a giant, and towers over regular soldiers by several times. Unlike other Marines, his traditional white robe is customized, with yellow colorings, red borders, adding more rich details to his collar. He also carries awarded medals on his left breast, signifying his important rank and status. He wears a traditional red bicorne hat with the Marine's symbol. Unlike other high-ranking Marines, he actually wears his Marine coat with his arms in the sleeves. Underneath that, he wears an orange shirt, simple loose pants and boots. Overall, he appears to be a well decorated Marine. He also wields a katana that fits his size, slung over his shoulder."}, {"type": "paragraph", "text": "He is shown to have curly brown hair with a large bulbous chin. Unlike most giants who have a more heavy rounded stature, John is one of the few giants to look the most human."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "John Giant is a loyal Marine Vice Admiral, willing to risk his life during the Battle of Marineford by clashing with Whitebeard. He also seems to be very serious and stern."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "John is a giant which grants him strength and endurance that is several times greater than that of an average superhuman. As a Vice Admiral, he has command over all lower-ranking subordinates within the Marines."}, {"type": "paragraph", "text": "However, the full extent of his abilities cannot be clearly determined as he fought against the powerful Whitebeard, who quickly defeated the Vice Admiral."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3d/Whitebeard_vs._John_Giant.png/revision/latest/scale-to-width-down/210?cb=20190814193014", "caption": "John Giant attacks Whitebeard."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so John can also use the ability."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is a swordsman with a katana that fits his size. It has a clover-shaped tsuba and a tassel wrapped around its sheath."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the distant past, the child trafficker Carmel used her connections to make John Giant the first giant to be enlisted into the Marines."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was first seen during the announcement of Luffy's first bounty. At that time, he was giving a speech about maintaining \"Justice\"."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was seen again, shouting orders after the Buster Call was signaled. When the signal was received a report was given directly to him, implying his high status at the headquarters, as well as the fact that he has the powers to command others of the same rank (via the five Buster Call vice admirals)."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Giant reported to the summoning of the Marines to reinforce Marineford."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He is seen gathering alongside his fellow Marines. Three hours before Ace's execution, he is seen rallying the 100,000 troops in Marineford for the upcoming battle."}, {"type": "paragraph", "text": "After the pirates began their advance when Whitebeard began his attack, Giant charged forth entering into the plaza and attacking them. Due to his large size and strength, many of the pirates proved to be no match for him and could only flee from his rampage. He then directly attacked Whitebeard and tried cutting him down."}, {"type": "paragraph", "text": "Whitebeard effortlessly blocked his strike, easily overpowering the giant. He then tilted the island, using his quake powers making John fall, losing his balance. Afterwards, he got back up to try and attack Whitebeard again, but the Yonko attacked him first this time, hitting him with a quake punch to the chest, severely wounding and defeating the Vice Admiral."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bd/Whitebeard_Defeats_John_Giant.png/revision/latest/scale-to-width-down/210?cb=20141206161150", "caption": "John Giant is defeated by Whitebeard."}]}, {"title": "One Piece Film: Z", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "While Z was making his move to destroy the three End Points in the New World, John Giant was seen in a Marine meeting as some of the high-ranking officers were discussing on how to deal with the crisis."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Marines and Shichibukai vs. Whitebeard Pirates and Allies", "elements": [{"text": "John Giant vs. Edward Newgate", "elements": []}]}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He is the first giant to be revealed in the series, although his race was revealed much later than his first appearance.", "elements": [{"text": "Later, it was revealed that he was the first giant to enlist in the Marines.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 96 (p. 7) and Episode 45, John Giant makes his debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 55), His name and marine rank are revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 867 (p. 11) and Episode 837.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 86), His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 564 (p. 5-10) and Episode 473.", "elements": []}, {"text": "↑ One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 7) and Episode 511, Dr. Fishbonen states Haki is a power all vice admirals use.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 524 (p. 17) and Episode 421.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 42 Chapter 409 (p. 6-7) and Episode 294, John Giant orders 5 vice admirals and ten marine battleships to go to Enies Lobby.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 550 (p. 6-7) and Episode 459.", "elements": []}, {"text": "↑  One Piece Movie 12, John Giant in Film Z", "elements": []}]}], "images": []}]}