{"sections": [{"title": "Ripper", "level": 1, "content": [{"type": "paragraph", "text": "Commander Ripper was one of Morgan's officers at his base in the East Blue. After Morgan's defeat, he takes control of the base's operations."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ripper is an average man who wears the normal marine hat, shirt, and pants. However, his ascot is a light green instead of dark blue. He has tanned skin, brown hair, a pronounced jawline, and a brown mustache and beard."}, {"type": "paragraph", "text": "After the timeskip, he now wears the Marine officer cloak."}, {"type": "paragraph", "text": "When he was still a young Marine, he did not have a beard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3e/Ripper_as_a_Young_Marine.png/revision/latest/scale-to-width-down/100?cb=20130919230502", "caption": "Ripper in his youth as a Marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appears to be a devoted, yet understanding Marine, as he asked Luffy and Zoro to leave Shells Town nicely, instead of just capturing them. He also pretended to not know that Koby and the pirates were friends. He also appears to be relatively trusting since he was willing to let Koby join their ranks even though he knew of Koby's past as a pirate. The justice he follows is unique among the Marines because he is stuck between \"Absolute Justice\" and \"Moral Justice\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Ripper is able to use a gun. Not much else is known of Ripper's abilities, or how strong he may be. However, as a Marine Commander, he has jurisdiction over his subordinates."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Romance Dawn Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Morgan was defeated by Monkey D. Luffy and Roronoa Zoro, Ripper led a platoon to Rika's house to question the town's saviors. After Luffy confirms that they are pirates, Ripper requests that they leave town. He explains that, as Marines, they could not let pirates run freely and that they were obligated to report the incident to Headquarters. He, however, acknowledges that the pirates saved the town from Morgan's tyranny and so allowed them to leave quietly. Seeing as how Koby wasn't leaving, he questioned him about his relation with the pirates, and after seeing the two punch each other, he determines that Koby is not friends with the pirate and allows him to join the Marines at the objection of his subordinates. He tells Koby that, although intel discovered his past as a pirate, he would still allow him to join as a chore boy."}, {"type": "paragraph", "text": "To Koby's surprise, Ripper later orders the Marines to salute the pirates as they leave. He tells Koby that he has good friends, and in doing so, revealed that he knew all along that Koby and the pirates were friends. Afterwards, he ordered the Marines to go without food for a week as they had violated Marine code by saluting pirates."}], "images": []}, {"title": "Diary of Koby-Meppo", "level": 3, "content": [{"type": "paragraph", "text": "Ripper later escorted Morgan to be handed off to Vice Admiral Garp for a court-martial. However, in the end, Morgan ends up escaping by slicing Garp and holding Helmeppo hostage."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, Ripper is seen eating at the canteen alongside Rokkaku and informing Rika of the return of Luffy and Zoro. He now wears a Marine officer's coat, as opposed to when he used to wear the standard Marine uniform. It is unknown if this signified a promotion in the two years since Morgan's downfall."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Rokkaku_and_Ripper_Post_Timeskip.png/revision/latest/scale-to-width-down/180?cb=20140805200403", "caption": "Ripper after the timeskip with his new uniform."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "His role in the anime version of Diary of Koby-Meppo is slightly expanded. He is seen training Marines right before Koby and Helmeppo accidentally cause a cannon fire."}, {"type": "paragraph", "text": "Later, when he is escorting Morgan, he is in constant surprise at Garp falling asleep. When the Vice Admiral gets slashed by Morgan, he is seen in surprise that Garp had fallen asleep and not known he was attacked. He also apologizes to the Vice Admiral that Morgan escaped and states that Koby and Helmeppo would be kicked out after indirectly helping in Morgan's escape. To his surprise once again, Garp decides to take the two along with him to Headquarters."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Vivre Card - One Piece Visual Dictionary, Ripper's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 7 and Episode 3, Ripper assumes command and allows Koby to join.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 7 and Episode 3, Ripper orders his men to salute the pirates.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 10 Chapter 88 and Episode 68, Ripper hands Morgan off to Vice Admiral Garp.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 616, Ripper appears for the first time after the timeskip.", "elements": []}, {"text": "↑  One Piece Anime — Episode 68.", "elements": []}]}], "images": []}]}