{"sections": [{"title": "Spandam", "level": 1, "content": [{"type": "paragraph", "text": "Spandam is the former chief of CP9 and CP5. He currently serves under CP-0."}, {"type": "paragraph", "text": "He is one of the two main antagonists of the Enies Lobby Arc, along with Rob Lucci and is also one of the minor antagonists in One Piece Film: Gold."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Spandam is a pale man of slim stature with wavy, wild lavender hair in a layered style that is roughly shoulder-length and parted in the middle. He has black markings around his large eyes, and his narrow nose is a dark red, which leads to Franky's nickname for him, \"Spanda\". He is fond of leather, and wears a brown studded leather mask which covers the bridge of his nose and scars on his moderately high forehead just above his eyebrows, similar to the mask of the WWE Legend Mick Foley, or \"Mankind\". He also has a strong chin from when Franky attacked him eight years ago, as well as long brown leather gloves and a black high-collared leather vest with matching pants separated by a studded belt. He has white shoes with brown tassels extending from their heels, and wears a long-sleeved light gray shirt decorated with a diagonal squiggle pattern below his vest with the collar turned up. His face is very expressive, and he has a large smile that causes his slightly angular eyebrows to narrow in slightly."}, {"type": "paragraph", "text": "Two years later, Spandam's wounds have completely healed. He wears lighter clothes, a bowler hat, a striped vest, and a feathery coat."}, {"type": "paragraph", "text": "In Franky's flashback, Spandam's nose, not yet broken, was slightly longer, and his strong jawline was more pronounced. He wore a long black coat with gold-colored trim and the World Government symbol with oversized shoulder pads, a white shirt with a black tie, a gray vest with corset lacing and a diagonal squiggle pattern identical to that on his shirt eight years later, black pants and shoes, and short brown gloves. His hair was partially slicked back, emphasizing the prominent widow's peak on his high forehead, and he had small sideburns."}, {"type": "paragraph", "text": "In the Volume 44 SBS, Oda drew pictures of the CP9 agents as children. Based on these illustrations, it seems Spandam had a small elephant as a pet when he was a child."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Spandam is very clumsy (he tends to spill coffee on himself during moments of excitement) and short tempered, with special sensitivity towards his name. Franky's nickname for him, Spanda (due to his panda-like markings around the eyes and nose), always causes him to lose his head. As a result, Spandam comes off mostly as a comedic villain like Buggy, though he often reveals real malice when gloating over his prisoners - as seen when he broke his promise of the Straw Hat Pirates' safety, and proceeded to beat on his defenseless captive, Nico Robin. He is not detached from the idea of exploitation, backstabbing, or the use of loopholes to get his own way, as he has proven many times in the past. Spandam is also very sadistic as seen by how he treated Nico Robin. Ironically, Spandam (as a World Government figure) is also victim to the government fabricated lie that Robin is evil and intent on world destruction. Most likely this idea was put in his head by his father Spandine."}, {"type": "paragraph", "text": "Spandam is also a great believer of the absolute justice conveyed by Fleet Admiral Sakazuki, and believes that the end justifies the means, with the end being the acquisition of the Ancient Weapons and the means being as many murders or sacrifices as it takes. He sees himself as the world's greatest hero for capturing Robin, and is very interested in his rank and prestige, often coming across as extremely power-hungry, even contemplating using the weapons' power for his own benefit, instead of the world's - unlike the other agents, who do not want any recognition whatsoever. He has no consideration for the lives of others at all and does not even consider the loss of innocents, only having power at his command. He likes plans to go perfectly fine and gets annoyed when they do not."}, {"type": "paragraph", "text": "Spandam's main character trait is his cowardly outlook on life - even when he does not display his cowardice, he is constantly thinking about such things. He is confident only when he feels safe because he has no strength, seeing as he has a Doriki of 9 - an average Marine has 10, so he relies on others to protect him. Thus to this end, every move that he made throughout the Enies Lobby Arc was a move to put his safety above all others. Moreover, though the fault for the destruction of Enies Lobby falls solely in his hands, he uses the members of the CP9 as his scapegoats to avoid the blame being pinned on him. Though this granted him some protection, he made enemies of his former co-workers."}, {"type": "paragraph", "text": "He appears to underestimate the strength of pirates and overestimate the strength of Marines, as once he heard a transmission saying that Luffy had defeated 500 marines, he is quoted as saying: \"500? The soldiers aren't that weak!\" He also accused the Straw Hats of stealing all the keys to Nico Robin's handcuffs, instead of beating up all CP9 members to get them."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Organizations", "level": 3, "content": [], "images": []}, {"title": "CP9", "level": 4, "content": [{"type": "paragraph", "text": "Spandam viewed CP9 as an unbeatable force and were the World Government's greatest assets. While CP9 was loyal to Spandam, they were not above bad mouthing him even in his presence with Kalifa constantly stating he was doing something causing sexual harassment or Kumadori being over dramatic with himself and being the only one to save Spandam from Franky biting on him. Even though Spandam is a weakling, Lucci respected him as his boss. Spandam also believed in Lucci’s strength and he used to refer to him as the strongest member of the organization. He attempted to bolster their strength by giving Kaku and Kalifa Devil Fruits. However, once CP9 was defeated by the Straw Hats, Spandam framed them for the loss of Nico Robin and Enies Lobby to save himself and they became a renegade crew. Lucci also called a crippled Spandam, stating that they would come for him someday and get revenge."}], "images": []}, {"title": "CP-0", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Spandam is shown to be a member of CP-0 along with his former subordinates, Rob Lucci and Kaku, although their roles are now reversed as Lucci is Spandam's superior. While Lucci seems to have given up on taking revenge on Spandam, he does find Spandam annoying. It is currently unknown exactly how Spandam joined CP-0 and how he became Rob Lucci's subordinate within the organization."}], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Spandam is a loyal follower of the World Government. He does whatever they ask without question and, like Akainu, is a firm follower of Absolute Justice. However, Spandam was not above manipulating the Five Elders to carry out the mission of trying to gain the blueprints of Pluton to rule the world. He even believes everything the government does is right."}], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Spandine", "level": 4, "content": [{"type": "paragraph", "text": "Spandam is Spandine's son. Spandam seems to be close to him since he gloated to Robin about how he is the son of the man who forced her life to the way it is now. After his defeat at Enies Lobby, he worked together with his father to plot their obliteration together."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Spandam is a major enemy of the Straw Hats for forcing Robin to work together with CP9 and trying to kill them. He originally viewed Luffy as a weakling and believed he and his crew had no chance of defeating CP9 and rescuing Robin. This proved to be his downfall as not only did they defeat CP9 and escape with Robin, but Spandam was left with the humiliation and pain from Robin breaking his back and of the defeat he suffered at their hands."}, {"type": "paragraph", "text": "In the non-canon movie One Piece Film: Gold, Spandam tried to attack the detained Luffy out of revenge for humiliating him. He was even more annoyed that the latter forgot about him but was stopped by Rikka and Raise Max."}], "images": []}, {"title": "Franky", "level": 4, "content": [{"type": "paragraph", "text": "Spandam holds a grudge against Franky for scarring his face years ago and for destroying the blueprints for Pluton. Franky himself hates Spandam for framing him, Iceburg, and Tom for the attack on Water 7 years ago and for sending Tom to his death. Franky took his revenge by pounding Spandam and crushing him with his own weapon. Spandam also gets annoyed when Franky calls him \"Spanda\"."}], "images": []}, {"title": "Nico Robin", "level": 4, "content": [{"type": "paragraph", "text": "Spandam viewed himself as a hero for capturing Robin and forcing her to the situation she was in. He is shown to be thoroughly, even irrationally, offended by her very existence and morale because he views her as evil. He would constantly beat on her and torment her by grabbing her hair, punching her, and even shoving her face in the stone all the while laughing at her misery. He even gladly told her that he is the son of the man who forced her life the way it is, and that Ohara will die with her. Throughout this, Robin refused to give up hope, and once she was freed thanks to Franky, she took her revenge by slapping Spandam senseless and broke his spine to let him suffer for what he did to her."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Spandam is the least powerful of the group as he has a Doriki level of only 9 (a normal, armed marine has a Doriki level of 10). Being this way, he is incapable of learning and knowing any Rokushiki moves. Nonetheless, the rest of the Cipher Pol 9 do not mind and \"respect\" him as the chief of the organization, with the possible exception of Kumadori, as he was the only one who saved Spandam from being beaten further by Franky (sending Spandam flying into the ceiling in the process). Because of his physical weakness, Spandam relies on his natural talents of knowledge and deception, as opposed to actual combat."}, {"type": "paragraph", "text": "However, despite his physical weakness, he appears to be capable of enduring considerably high amounts of damage, as seen when he was still standing after two attacks from Usopp (as Sogeking), Robin's \"Seis Fleur: Slap\", and Franky's \"Strong Right\" (in Franky's case, he also instantly counter-attacked), which only seemed to swell his face, as well as having Funkfreed land on top of him after Franky threw the elephant at him. Despite the enormous amounts of crippling damage he suffered at their hands, which left him bedridden, he managed to make a full recovery, enough to join CP-0 two years later."}, {"type": "paragraph", "text": "Spandam also has many contacts, which is the reason why he was able to get hold of two Devil Fruits easily."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Spandam's main offense is his special sword, \"Funkfreed\", which somehow absorbed a Devil Fruit, Zou Zou no Mi. Using this fruit, it can turn into an elephant. Funkfreed also makes up for Spandam's weakness by being both his weapon and bodyguard. Spandam shows a slight amount of skill in swordsmanship, to the extent of being able to cleanly slice through a metal lantern with glass panels (despite immediately getting burnt by the candle that fell afterwards)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/60/Spandam_with_Funkfreed.png/revision/latest/scale-to-width-down/180?cb=20160911155139", "caption": "Spandam with Funkfreed."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Forty-one years ago, Spandam was born the son of Spandine. Later at an unknown point in his childhood, he owned a pet elephant, although it is unknown what became of it."}, {"type": "paragraph", "text": "Less than twelve years before the start of the main storyline, Spandam manipulated the Five Elders to change their policy about preventing the Ancient Weapons from being recovered and to allow him to revive the weapons to combat the increase in pirate activity. However, Spandam's machination was really to depose the government and rule the world himself."}, {"type": "paragraph", "text": "Eight years before the start of the main storyline, Spandam used to be the CP5 leader and was the first one to come after the Pluton blueprints held by Tom. When Tom refused, Spandam framed him by using Franky's battleships to attack a judiciary ship, making it seem like Tom and his apprentices (Franky and Iceburg) were the culprits. In the end, Spandam was outsmarted (as Tom safely hid the plans away) and only got a very scarred face for his trouble (courtesy of Franky). When Franky tried to stop the sea train that Tom's Workers built, Spandam ordered his men to keep going and laughed at Franky suffering when he was run down by the train."}, {"type": "paragraph", "text": "Spandam became the chief of CP9 about six years later, replacing his father Spandine."}, {"type": "paragraph", "text": "Three years after that, Spandam dispatched CP9 to Water 7 to finish what he was trying to do before: seize the Pluton blueprints."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/11/Franky_Pistol_Whips_Spandam.png/revision/latest/scale-to-width-down/231?cb=20130529224306", "caption": "Spandam being butted with the end of a rifle by Cutty Flam, scarring his face forever."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "Aokiji contacted Spandam of Robin's whereabouts. Spandam almost had his CP9 agents take action but delayed to wait for her arrival. Knowing Robin through his father and her weakness, he sent Blueno to keep an eye out for her."}, {"type": "paragraph", "text": "Spandam also acquired the authority to summon the Buster Call with the Golden Den Den Mushi on Aokiji's behalf."}, {"type": "paragraph", "text": "Spandam was first shown when the CP9 contacted him about capturing Franky. Spandam ordered them to bring Franky to Enies Lobby. Franky was shocked and angry of hearing Spandam's voice after so many years and Spandam mocked Franky for being weak like he is now, but accidentally spilled his coffee on himself and prompted Blueno to hang up on him."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Before the arrival of Lucci's CP9 group, Spandam was seen with the other members (Jabra, Fukurou, and Kumadori) over the reasons of why the mission they were assigned of only killing three people turned into over twenty people. While all of them tried to explain and Jabra losing his temper with Fukurou and Kumadori, Spandam tried telling them that it was alright since the mission was a success, but accidentally spilled coffee on himself again and screamed in pain from how hot it was. He was then informed that the Straw Hats had arrived at the gate and ordered the Marines to wake up Oimo and Kashi. He was also informed that Luffy was rampaging throughout the island, but due to the informer getting knocked out, he assumed only five marines have been defeated instead of 500."}, {"type": "paragraph", "text": "He was later seen greeting Lucci and the others while delighted at seeing Franky again after so many years and thrilled at having finally caught Robin. Having captured Franky and Robin together, Spandam was confident that he could cake control over the World Government by means of possessing Pluton. His plan was to use Robin to locate and activate the original Pluton and used the blueprints from Franky to build a second Pluton, which would be the only weapon that could stop the original from complete world destruction, thus giving him the key to ultimate power."}, {"type": "paragraph", "text": "As the CP9 members started to make fun of Spandam and noted how weak he is compared to them, he defended himself on how his sword, Funkfreed, helped make up for that. Kalifa continued to state how he kept doing sexual harassment, shocking him and was annoyed by Kumadori and Jabra's moment together. He told them about how Aokiji allowed him to possess the Golden Den Den Mushi and when Robin asked why he was given one despite him not being an admiral, Spandam punched her and told her to mind her business and stated that it did not matter since she was done for. When he laughed about how he would finally get the blueprints for Pluton, Franky bit him for mocking Tom's sacrifice and was saved (rather poorly) by Kumadori, but in the process, knocked his Den Den Mushi off the hook. Before CP9 left, he gave Kaku and Kalifa Devil Fruits that he had obtained through his many connections and told them to eat them, hoping to make CP9 even stronger. After hearing that there was an emergency call coming in, he assumed that the Straw Hats had been annihilated and began to gloat to Robin about it before answering the Den Den Mushi. Much to his shock, he was instead informed that the Straw Hats had arrived at the courthouse and Luffy had defeated over 1000 Marines, causing Spandam to ask what happened to the original five. He was even more shocked when Oimo and Kashi changed sides and allied with the Straw Hats. He then ran to the window where he saw Blueno on the courthouse roof and cried out what in the world was happening on Enies Lobby."}, {"type": "paragraph", "text": "After Luffy called out to Robin, Spandam ran back to the window. He was shocked when he saw that Blueno has been defeated by Luffy and claimed that a pirate could never defeat a CP9 agent like Blueno. Panicking, he ordered the Marines to assemble the remaining CP9 members. He was then shocked that Franky's butt was inflating. Franky stated that he would self-destruct, causing Spandam to run for his life despite tripping on the stairs. However, Franky instead used a move called Coup De Boo to fart and free him and Robin and land on the outer edge of the roof. Spandam told CP9 not to let them get away and restrain them."}, {"type": "paragraph", "text": "When Robin shouted to Luffy about how she did not want to be rescued and just wanted to die, Spandam laughed and clapped in excitement over the situation and welcomed CP9 to the top of the roof with the others. When Jabra asked if they could kill him, Spandam told him to wait and wanted to let Luffy suffer over the fact that despite coming to save Robin, she did not want to be saved and was shocked by Luffy's rudeness of picking his nose despite Spandam's threats. He was later scared over the fact that the other members of the crew were fully present to fight CP9. When Spandam decided to use the Buster Call, Robin begged him not to, stating he had no idea of the horror of what it can do."}, {"type": "paragraph", "text": "Spandam then told the crew about how challenging the World Government meant challenging the whole world and that the mark of the World Government is absolute, with over 170 nations in unity with the government and stated that all of those nations were Robin's enemies. With Luffy now understanding who Robin's enemies were, he ordered Sogeking to burn down the flag, and they officially declared war on the World Government. Spandam was shocked by this and shouted that they had no chance of surviving with the whole world as their enemy. Luffy just shouted if he wanted to see about that, causing Spandam to become afraid of him. When Franky decided to place a bet with Spandam after having witnessed the Straw Hats' valor and when Robin finally shouted out that she wanted to live, Spandam demanded to know what he meant. Franky revealed that he had the Pluton blueprints on him the whole time, much to Spandam's shock. Spandam was ecstatic that the blueprints were right in front of him all this time, ignoring Franky's bet on who would win the fight. When Franky burned the blueprints, Spandam was speechless. Franky declared that he burned them so a second Pluton could never be built and so an idiot like Spandam could never get his hands on such a weapon. Spandam, infuriated that Franky destroyed the blueprints, pushed Franky off the edge of the Tower of Justice. While he was distracted, Franky was saved (being struck by the Rocketman by Kokoro). Spandam told CP9 that it was their job to win and protect his life no matter what and keep his status safe. Afterwards, he moved with Robin and Lucci to the lower ends of the tower to take her across the Bridge of Hesitation."}, {"type": "paragraph", "text": "Spandam and Lucci were then escorting Robin to the Gates of Justice. Along the way, Lucci stayed behind to fight Monkey D. Luffy, and Spandam foolishly activated the Buster Call by accident, causing chaos and confusion to ensue on the island due to him shouting how useless the Marines were and how he did not care about their lives, only his and keeping Robin from escaping. While on the way at the end, Robin would continuously try to escape and keep herself from reaching the end by biting the edge of the bridge while Spandam mocked her for her weakness and how she had no hope left and that the Straw Hats would be killed and she would never be saved. As he bragged about how he is the son of Spandine, the man responsible for her life of misery, finally caused her to break into tears while he laughed at her pain. He dragged her to the end by her hair and nearly reached the gate. However, he was hit at long-range with one of Sogeking's explosive projectile attacks, allowing Nico Robin to escape and break free of her handcuffs thanks to Franky saving her and gaining the rest of the keys from Sogeking, much to Spandam's horror when he realized that the \"unbeatable\" CP9 had indeed been defeated. When he tried to attack Robin to prevent her from escaping, Franky crushed him with his own sword, finally settling his vendetta for what he did to Tom. Robin's first act was to beat Spandam by slapping him senseless for everything he did to her and nearly left his face swollen to great size. He passed out from the pain as well as from Sogeking shooting him again."}, {"type": "paragraph", "text": "As the Straw Hats were escaping on the returned Going Merry, he recovered (though now horribly bruised and swollen) and gave the order to fire, stating that Aokiji gave him permission to do so despite Robin being on board (though this was just another lie). He got extremely frustrated that the CP9 and the Buster Call were unable to stop a small group of pirates. Robin noticed this and, thinking about all the pain he caused her, used her \"Clutch\" move on him, to the extent that his back broke as her group sailed off."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2a/Spandam_Snipered_Down.png/revision/latest/scale-to-width-down/230?cb=20101223231439", "caption": "Spandam is sniped down by Sogeking."}]}, {"title": "CP9's Independent Report", "level": 3, "content": [{"type": "paragraph", "text": "After the battle, he decided that it was the unforgivable errors of CP9 that caused his mission to fail and ordered marines to capture them, marking the beginning of CP9's journey to evade the Marines and explained why CP9 could not turn to the government for medical help. Despite his injuries, he survived, although he was seen heavily bandaged and lying on a hospital bed. He received a Den Den Mushi and was shocked that his former subordinate, Rob Lucci, was calling him as the remainder of CP9 fought off the Marines he had sent after them. Lucci ended his call by promising to return someday. After that, he teamed up with his father, Spandine, to plot the assassination of CP9."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Spandam_Hospitalised.png/revision/latest/scale-to-width-down/200?cb=20130124144438", "caption": "Spandam in the hospital getting a phonecall."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Spandam is reintroduced as a member of CP-0 with his back completely healed. For some reason, he became Rob Lucci's subordinate. He and Lucci went to Dressrosa to recover evidence of the Donquixote Family's smuggling operations only to find that they were already taken."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Gold", "level": 4, "content": [{"type": "paragraph", "text": "Spandam came to Gran Tesoro, where he received a magnificent payment from Gild Tesoro in order to bring his forces to Gran Tesoro and help Tesoro's crew deal with the Straw Hat Pirates."}, {"type": "paragraph", "text": "The next night, as the Straw Hats and the citizens of Gran Tesoro were battling Tesoro's crew, Spandam appeared and bound Luffy in spiked seastone chains. As Spandam prepared to finish Luffy off with Funkfreed, Rikka came running in and blocked Spandam's strike with a pipe. Spandam turned around in shock, giving Luffy enough time to free himself and punch Spandam into the ground, defeating him."}, {"type": "paragraph", "text": "Spandam was later taken back to the Marine fleet, where he received medical treatment."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6a/Spandam_Captures_Luffy.png/revision/latest/scale-to-width-down/210?cb=20170122224514", "caption": "Spandam captures Luffy with Seastone chains."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Spandam vs. Franky (at Water 7)", "elements": []}, {"text": "Spandam vs. Nico Robin and Franky", "elements": []}, {"text": "Spandam and Enies Lobby Escort vs. Usopp (as Sogeking)", "elements": []}, {"text": "Spandam and Funkfreed vs. Franky", "elements": []}, {"text": "Spandam vs. Nico Robin", "elements": []}]}], "images": []}, {"title": "Filler and Movie Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Spandam vs. Rikka and Luffy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the escape scene from Enies Lobby between Marines and the Straw Hat Pirates differs between the anime and the manga. In the anime, the scene is extended. Robin uses Cien Fleurs: Defense to slow cannon balls and Franky lobs them back to the Marines. Zoro and Sanji grabs an unconscious Luffy to stop cannon balls and fling them back, while in the manga he was conscious and foaming at the mouth after they had done so. Also, Robin used Seis Fleurs: Clutch to break Spandam's spine. In the manga, she does so and there is a crack and he slumps back. In the anime, his body fades out, only showing his skeleton and showing it break directly in half.", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, an early concept of Spandam is revealed. The early concept of Spandam was originally supposed to have a more blatant panda theme, such as him having panda ears."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/31/Early_Spandam.png/revision/latest/scale-to-width-down/180?cb=20110509010311", "caption": "Early Spandam with a strong Panda theme"}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Adventure", "elements": []}, {"text": "One Piece: Unlimited Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Following CP9's animal theme, he has a panda theme, because not only does he have markings around his eyes and nose resembling that of a panda, but his name also has the word panda in it. This is also presumably the reason behind why Franky calls him Spanda, much to Spandam's chagrin.", "elements": []}, {"text": "In the 6th Japanese fan poll, Spandam ranked as the 86th popular character.", "elements": []}, {"text": "Many characters in One Piece were given distinct laughs. Spandam follows in this tradition with a short \"wa\" at the beginning of his laugh (i.e. \"Wa ha ha ha ha!\"), though it sounds more like \"Da\" in the anime.", "elements": []}, {"text": "Spandam's mask is almost identical to the mask worn by professional wrestler Mick Foley when portraying his Mankind character. Foley noticed the resemblance on Twitter and inquired as to possible gimmick infringement, only to be assured that Oda was a fan of wrestling by those familiar with Oda's tributes and references to both Eastern and Western pop culture figures within the series. After learning more about Oda's methods Foley happily approved of the resemblance calling it a \"cool tribute\".", "elements": []}]}], "images": []}]}