{"sections": [{"title": "Babe", "level": 1, "content": [{"type": "paragraph", "text": "\"Catcher-Killing\" Babe, better known by his alias Mr. 4, is a former officer agent of the Baroque Works and partner of Miss Merry Christmas."}, {"type": "paragraph", "text": "He was a major antagonist during the Alabasta Arc. After the group's dissolution, he became a pizza delivery boy, stationed at the new Spiders Cafe."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Babe is rather tall and fat, has big lips, and wears a green shirt that covers most of his body with black pants and gray running shoes. Like all other officer agents, his number is expressed somewhere on his clothing or his person. He has an obscure \"4\" design on his shirt, as well as a \"4\" on his baseball bat."}, {"type": "paragraph", "text": "During Miss Goldenweek's \"Operation: Meet Baroque Works\", he wore a typical striped prisoner uniform and retained his scarf."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Babe was the slow and dimwitted partner of Miss Merry Christmas. He seems incapable of thinking for himself at all and often just does as his partner tells him to do. He laughs freely, but speaks rarely—in contrast to his partner. He speaks very slowly, usually taking most of a scene to articulate a short sentence. However, before he swings his bat he screams \"Fore!\" slowly, something which is slightly odd as this action is more associated with the sport of golf instead of baseball."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He is one of two officer agents without a Devil Fruit ability, the other being Miss Goldenweek. He is tremendously strong, able to wield a baseball bat that weighs 4-tons with no effort and his bat swings can destroy bricks from long distances from the shockwaves alone."}, {"type": "paragraph", "text": "However, he is also extremely slow in nature and would not succeed without Miss Merry Christmas handling the \"intelligence\". His slow tendencies only apply to his intellect and casual walking speed though, as he is able to travel in Miss Merry Christmas' tunnels at tremendous speed and hit several baseballs at once. Crocodile has noted that he and his partner are actually stronger in terms of physical power than the Mr. 3 team, but are a lower rank because Mr. 3 is smarter and more tactical."}, {"type": "paragraph", "text": "Mr. 4 and Miss Merry Christmas have great teamwork during battle, with Mr. 4 being capable of using Miss Merry Christmas' hole network to surprise the enemy and Miss Merry Christmas can restrain the enemy or even bring him closer to Mr. 4 so he can directly strike the enemy with his bat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/Mr._4%27s_Bat.png/revision/latest/scale-to-width-down/180?cb=20121208035916", "caption": "Babe's four ton bat."}]}, {"title": "Lassoo", "level": 3, "content": [{"type": "paragraph", "text": "Babe has a dog called Lassoo, which was originally a gun, but \"ate\" the Inu Inu no Mi, Model: Dachshund, a Devil Fruit, and became a gun-dog. Lassoo shoots timed exploding baseballs that weigh as much as cannonballs, even when he sneezes (when he's first introduced, he has a cold). Mr. 4 then takes out his 4-ton baseball bat and hits the balls at his enemies, launching them at great velocity and accuracy at different angles. Due to the weight, the cannonballs cannot be thrown back by an opponent of normal strength."}], "images": []}, {"title": "Techniques", "level": 3, "content": [{"type": "list", "elements": [{"text": "Yonhyappon Punk Knock (四百本猛打ノック, Yonhyappon Panku Nokku, literally meaning \"Four Hundred Punk Knock\"): This attack is not named by him, but by his partner Drophy. He has Lassoo shoot a huge group of his exploding baseballs and then hits them back at a surprisingly swift speed into a cluster, so they detonate all at once and create a massive explosion. This attack is called 400 Base Hits in the Viz Manga and 400 Base Knock in the 4Kids and FUNimation dubs.", "elements": []}, {"text": "Mogurazuka Yonban Kousaten (モグラ塚4番交差点, Mogurazuka Yonban Kōsaten, literally meaning \"Molehill Intersection Number 4\"): A combo attack with Drophy, first, Drophy uses Mogurazuka Highway and carries the opponent past Babe who, upon hearing her call out the attack, smacks the captive with his 4-ton bat, causing massive damage. However, he may accidentally hit an ally as he is too dim witted to note differences in the voice. This is called Moletown Cleanup Hitter in the Viz Manga and the FUNimation dub of Movie 8, Woodchuck Batter Blaster in the 4Kids dub, and Molehill Intersection #4 in the FUNimation dub.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mr. 4 and his partner Miss Merry Christmas were summoned by Crocodile along with the other remaining officer agents to meet at the Spiders Cafe in order to get assignments for the upcoming battle. Mr. 4 did not do much during that time, aside from give Miss Merry Christmas a massage, and giggle when Mr. 2 Bon Kurei started to dance. He later travels with the other officer agents to Rainbase, where they receive their missions. For their job, Mr. 4 and Miss Merry Christmas are assigned to kidnap Nefertari Cobra, which they are successful in completing. They later rejoin the other officer agents to stop Nefertari Vivi from reaching the rebels and they chase after Sanji, and Tony Tony Chopper. At first, Chopper had to fight the two alone as Sanji left to check on Vivi, but later Usopp arrived to assist Chopper in fighting the Mr. 4 team in Sanji's place."}, {"type": "paragraph", "text": "During the battle with Usopp and Chopper, he managed to severely injure Usopp using a combined attack with Miss Merry Christmas. But Usopp tricked him into knocking out his partner. Usopp then, using Chopper's horns as a slingshot, defeated Mr. 4 by shooting an extremely fast hammer at him (the move called Hissatsu UsoCho Hammer Suisei or UsoCho Hammer Comet), knocking him (and Lassoo) into a stone structure. Mr. 4 and Miss Merry Christmas were then knocked out by one of Lassoo's exploding baseballs."}, {"type": "paragraph", "text": "After Operation Utopia failed with Luffy beating Crocodile, Mr. 4 was found and arrested by the Marines headed by Tashigi. He, along with the other arrested Baroque Works agents were then sent to prison."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/67/Usopp_Hits_Mr._4.png/revision/latest/scale-to-width-down/200?cb=20130219142548", "caption": "Mr. 4 fights Usopp."}]}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "All three were later seen in prison in Miss Goldenweek's chapter title mini-story. They (along with Miss Doublefinger) managed to escape thanks to Miss Goldenweek, Miss Valentine, and Mr. 5, and are now working in the new Spiders Cafe with them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3f/Mr._4_Realizes_His_Dream.png/revision/latest/scale-to-width-down/160?cb=20110914092149", "caption": "Mr. 4 realizes his dream as a pizzaboy."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mr. 4, Lassoo, and Miss Merry Christmas vs. Usopp and Tony Tony Chopper", "elements": []}]}], "images": []}, {"title": "Merchandside", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Treasure Wars", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Babe is likely named after the famous baseball player Babe Ruth.", "elements": []}, {"text": "Babe's codename was initially planned to be Mr. Sunny Day, and Oda meant for him to look more aggressive than he did.", "elements": []}, {"text": "Miss Goldenweek's Colors Trap reveals that his dream was to become a pizza delivery boy, which is ironic since pizza delivery boys are known to be fast with their deliveries (\"Pizza within 30 hours\" as his apron says, the saying usually used is minutes).", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "A fan asked what would happen if Babe got struck by Foxy's Noro Noro no Mi (considering that Babe speaks very slowly). Oda, pretending to be Babe, gave a response but the example was short as there wasn't enough room on the page to post the full response.", "elements": []}]}], "images": []}]}