{"sections": [{"title": "Mr. 7 (Previous)", "level": 1, "content": [{"type": "paragraph", "text": "Mr. 7 was a frontier agent of Baroque Works. He died on duty when he attempted to forcefully recruit Roronoa Zoro to the organization. His position was filled by the next Mr. 7."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The first known Mr. 7 was a round headed man with a number seven tattoo on his left cheek."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Virtually nothing is known about the late Mr. 7's personality, but he attempted to kill Zoro for refusing to join Baroque Works, showing a certain level of loyalty for the group."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Mr. 7 was apparently a swordsman, with a standard cutlass. However, his skill was most likely inferior to Roronoa Zoro. According to Zoro, he was killed in a battle against him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Mr. 7 was sent on behalf of Baroque Works to recruit Roronoa Zoro, who had gained fame as the \"Pirate Hunter\" in East Blue. Zoro retorted that he will join only if the organization takes him as the boss. Mr. 7 tried to use force against Zoro because of his refusal only to be killed by the superior swordsman."}, {"type": "paragraph", "text": "Following Mr. 7's death, he was replaced by a new agent."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  SBS One Piece Manga — Vol. 36 (p. 86), Fan question: When Zoro was being scouted for Baroque Works, what did Mr. 7 look like?", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 21 Chapter 190 (p. 8) and Episode 116, Mr. 1 and Miss Doublefinger reveal that a previous Mr. 7 asked Zoro to join Baroque Works.", "elements": []}]}], "images": []}]}