{"sections": [{"title": "Kalifa", "level": 1, "content": [{"type": "paragraph", "text": "Kalifa is a former secretary of Iceburg; as well as the only female member of CP9, until she was dismissed from the unit by Spandam, who lied and blamed the team for the failure in Enies Lobby along with her colleagues. She is also Laskey's daughter."}, {"type": "paragraph", "text": "She was one of the major antagonists during the Water 7 and Enies Lobby Arcs."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kalifa is a slim, pretty woman with blue eyes and glasses. Like Kuro, she often pushes up her glasses. Her strawberry blonde hair was about shoulder length when she first infiltrated Water 7, and she grew it out over the years she spent undercover there. She kept it tied up in a bun as a secretary, but let it fall freely when she was revealed to be an assassin."}, {"type": "paragraph", "text": "Her three measurements are (according to Vivre Card - One Piece Visual Dictionary): B93-W61-H92, making her breasts a G-cup in Japan."}, {"type": "paragraph", "text": "She has small studded earrings and usually wears outfits that reveals her legs and cleavage, much like Nami; something Paulie, who is offended by normal women's clothing, often chided her about while she was undercover. When she was Iceburg's secretary, she wore a yellow long-sleeved jacket, and high-heel boots, but as an assassin, she wore a long-sleeved short black dress over a fishnet shirt and stockings along with black gloves and high-heels."}, {"type": "paragraph", "text": "When attacking Iceburg's mansion she wore a musketeer mask and a long red cape with red long sleeves, as well as gloves and a light purple cloth over a light orange dress. In the anime, her gloves are dark brown, her cloth over her dress is white and her dress is yellow."}, {"type": "paragraph", "text": "In the Volume 44 SBS, it was revealed that Kalifa was very bookish as a child."}], "images": []}, {"title": "Personality", "level": 2, "content": [], "images": []}, {"title": "Galley-La", "level": 3, "content": [{"type": "paragraph", "text": "Kalifa is first seen as Iceburg's secretary. She seemed to be a serious and businesslike woman, and was seen to be dutifully loyal to Iceburg, accompanying him everywhere. She is known for her trademark phrase \"That's sexual harassment\" which she often uses in entirely inappropriate situations. She is shown to be very bright by the ease with which she anticipates Iceberg's needs, and how well she meets his difficult schedule. She is calm, and tries to diffuse situations, such as trying to calm Paulie when he was shocked at Nami's revealing outfit."}], "images": []}, {"title": "CP9", "level": 3, "content": [{"type": "paragraph", "text": "During the Enies Lobby Arc, Kalifa's personality becomes sly and crafty, as she enjoys embarrassing her superior, Spandam by accusing him of harassing her, again with her trademark phrase. Despite her initial impression of being completely serious and professional, she became easily flustered during her battle against Nami. She is not too bright, mistaking Monster Chopper for Nami, resulting in Kalifa being called a 'dumb blonde' by Nami. When Nami was distracted by Chopper's transformation Kalifa demonstrated attention seeking behavior and got annoyed. She is also rather vain, considering herself so beautiful and sexy that she does not need to make her skin smooth with her Devil Fruit power."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "With a Doriki of 630, Kalifa has a high degree of superhuman strength. She employs a kick-based fighting style when not using Rokushiki or Awa Awa no Mi techniques. She possesses formidable leg strength. Alongside Kaku, she could produced a cutting shockwave powerful enough to cut stone walls while using Rankyaku. She could even match Sanji's kicking power, and her attack speed is fast enough to leave residual images after striking. During the attack on Galley-La Headquarters, her fighting style was strongly intertwined with the use of her spiked whip, but she was not seen using this weapon after she ate the Awa Awa no Mi."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Like the other CP9 members, Kalifa has mastered all six techniques of the Rokushiki style. Despite being the weakest member of CP9's assassins, with a Doriki of 630, she is still considered one of CP9's strongest assets."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In Water 7, she showed great skill at using a spiked whip. She could bind Franky, a powerful cyborg, and stop a Sea Train from moving away."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Ibara Road (茨ロード, Ibara Rōdo, literally meaning \"Thorny Road\"): Kalifa leaps in the air and thrusts her whip out to decimate a group of people.", "elements": []}]}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "After the return to Enies Lobby, Kalifa ate the Awa Awa no Mi, a Paramecia-type Devil Fruit which allows her to generate bubbles to \"clean\" the strength off her opponents. The user can also shield themselves from attacks by condensing these bubbles into a giant bar of \"soap armor\". However, the effect of the devil fruit can be washed away with water."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Awa_Awa_no_Mi_Usage.png/revision/latest/scale-to-width-down/230?cb=20141001201039", "caption": "Kalifa generating soap bubbles."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Kalifa possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Childhood", "level": 4, "content": [{"type": "paragraph", "text": "Kalifa was born into a long line of assassins, being trained in assassination as a kid."}], "images": []}, {"title": "CP9's Secret Mission", "level": 4, "content": [{"type": "paragraph", "text": "Five years before the current storyline, four members of the secret organization CP9 took guises in the city of Water 7. Kalifa, as part of her mission, infiltrated the Galley-La Company by applying for a job as the personal secretary of Iceburg, mayor and former pupil of legendary shipwright Tom, in an attempt to retrieve the blueprints for Pluton. Kalifa became infamous in the Galley-La Company for being fiercely loyal to Iceburg, and for violently kicking anyone who poses a threat to him. Two other members Lucci and Kaku became a treenail specialist and a ship mechanic respectively, while the last member Blueno became a bartender. While gaining the city's trust and respect, they tried to get close enough to take the Pluton blueprints in Iceburg's possession. Unknown to them, a year after they began their mission, Iceburg had passed the blueprints to Tom's other pupil, Cutty Flam, better known as Franky."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the Straw Hat Pirates arrived in Water 7, they needed repairs to their ship. However, due to a tipping off from Admiral Aokiji, an opportunity in the form of \"Demon Child\" Nico Robin presented itself; the CP9 agents blackmailed her to attempt a fake assassination attempt on Iceburg's life to frame the Straw Hats, and leave them to be taken to Enies Lobby, under the threat of a Buster Call attack. Meanwhile, the Straw Hats themselves pleaded with the Galley-La Company to fix the Going Merry."}, {"type": "paragraph", "text": "However, the fake attempt on Iceburg's life was blamed on the Straw-Hats, who consequently got attacked by the Galley-La company, interfering with the already ongoing battle between Luffy and Franky. That evening, the CP9 agents planned to steal the Pluton blueprints and invaded Iceburg's mansion. They wore disguises, with Kaku and Lucci pretending they were defeated by the assailants, Kalifa attacking head on as a distraction, and Blueno going to Iceberg's room. Kalifa had a brief fight with Lulu, where she quickly dispatched him. The Straw Hats confronted CP9 after they had revealed themselves to Iceburg. Kalifa, along with Kaku, attacked Luffy with Rankyaku. The agents defeated the Straw Hats; but they realized that the blueprints were not with Iceburg, and discovered they were with Franky when Lucci deduced he was Cutty Flam and one of Tom's pupils."}, {"type": "paragraph", "text": "After this, they left the mansion; in order to leave no evidence of their attack and their identities, they set Iceburg's mansion on fire, trying to kill him in it. However, at the last minute, Iceburg and the Galley-La foremen were saved by Chopper. Since the CP9 agents had information about Franky's possible whereabouts, they invaded his secret hideout. Kalifa brutally knocked down Mozu and Kiwi when they tried to refuse them access. Franky attempted to fight Kalifa, but was blocked by Blueno. After interrogating the shipwright and his refusal to hand out the blueprints for Pluton, Kalifa captures and disables Franky with her thorn whip on Lucci's order, preparing for departure to the judicial island, Enies Lobby."}, {"type": "paragraph", "text": "The CP9 agents boarded the sea train, with Kalifa acting as the spokesperson for the group and talking to Corgi. When the Straw Hats tried to escape with Robin, she used her thorn whip to catch the carriage before Blueno pulled them back together."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Despite the attempts to rescue Robin, Kalifa and the other CP9 agents arrive at Enies Lobby. They meet up with the other members of CP9 that they haven't seen in years, and their boss Spandam. Fukurou tests the Water 7 team's Doriki and reveals that Kalifa has a level of 630. Kalifa and Kaku were given Devil Fruits by Spandam, and after the urging of Lucci, ate them. Both of them found the taste disgusting."}, {"type": "paragraph", "text": "During the attack on the tower, she fought against Sanji after he came to his senses (he was struck by her looks and drank tea with her at first). Kalifa told Sanji that her key was \"somewhere on her body\", before they engaged in a kick based battle. Even though Sanji was stronger than her, he kept withholding his attacks, and claimed he would never strike a woman. Kalifa showed no mercy, and after landing several hits on him, she turned him into a soap doll and threw him over the balcony."}, {"type": "paragraph", "text": "Nami arrived to confront her, but she had set a bubble trap on the floor, draining Nami's power. Nami quickly deduced Kalifa's powers, much to her dismay. Kalifa used \"Golden Awa\" and turned Nami into a soap doll. Chopper, in monster form, appeared and attacked with Kalifa, while she mistook him for Nami."}, {"type": "paragraph", "text": "Chopper knocked the bath down the stairwell, causing it to land on Sanji. Kalifa attacked Nami with \"Shinaru Shigan\" , but Nami used her Clima Tact's Rain Tempo to nullify Kalifa's ability, before following up with \"Fata Morgana\" to electrocute Kalifa. Kalifa, infuriated, attacked a final time, only for Nami to avoid and counter with Thunder Lance Tempo. Afterwards, Nami ripped Kalifa's outfit apart until she found the #2 key for Roronoa Zoro and Sogeking's handcuffs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Nami_vs._Kalifa.png/revision/latest/scale-to-width-down/250?cb=20121220132555", "caption": "Nami vs. Kalifa"}]}, {"title": "CP9's Independent Report", "level": 3, "content": [{"type": "paragraph", "text": "Blueno used his Devil Fruit's ability, Air Door, to protect his fellow CP9 agents from the Buster Call. Since her clothes had been ripped apart by Nami, Jabra lent Kalifa his shirt. After realizing that Spandam had betrayed them and lied to get them to take the blame for the failed mission, Kalifa, along with the rest of CP9, walked along the Sea Train's tracks to St. Poplar. She cleaned the streets with her Devil Fruit powers to help earn money for Lucci's medical treatment. CP9 used the rest of the money to buy clothes and other essentials; Kalifa was with Kumadori reading a book and smoking while the others wait for them to return with the shopping. She was seen smiling as Lucci, having recovered from his injuries, is discharged from the hospital. CP9 went bowling to celebrate Lucci's recovery, though her superhuman strength resulted in her essentially launching the bowling balls into the walls."}, {"type": "paragraph", "text": "However, CP9 had to stop their bowling match to deal with the problem of the Candy Pirates attacking St. Poplar; so they became temporary vigilantes and beat them up. Kalifa is shown using her signature kicks to deal with one of the pirates, as the crowd cheer, amazed at their strength. However, after Lucci violently eliminates the captain, CP9 determines that they cannot stay in St. Poplar any longer, and so they prepare to leave; but not before Kalifa receives a flower from a small girl (to the shock of Fukurou, Jabra and Kumadori)."}, {"type": "paragraph", "text": "They travel to the island where they trained as children, where they watch a new generation of CP9 being trained. Captain Very Good arrives to capture them, but they refuse to let him disturb their old home. As CP9 battled, and eventually defeated the Marine troops led by Very Good, Lucci contacted a physically crippled Spandam using a Den Den Mushi, and promised that they would return someday. With that CP9 began their plan to eliminate their former director, by leaving their homeland and setting sail."}, {"type": "paragraph", "text": "Like most of her colleagues (with the exception of Spandam, Lucci, Hattori, and Kaku being part of CP-0), her location and allegiance are currently unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/76/Kalifa_Cleans_St_Poplar.png/revision/latest/scale-to-width-down/250?cb=20160125224107", "caption": "Kalifa cleans the streets of St Poplar"}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kalifa vs. Peepley Lulu", "elements": []}, {"text": "Kalifa vs. Sanji", "elements": []}, {"text": "Kalifa vs. Nami", "elements": []}, {"text": "CP9 vs. Candy Pirates", "elements": []}, {"text": "CP9 vs. Very Good's crew", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, an early concept of Kalifa is revealed. She was supposed to have a \"scarier\" face and black hair instead of her current appearance. She was originally supposed to fight Robin, although this idea was dropped."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the sixth popularity contest, Kalifa ranked at 62th place, making her the second most popular CP9 member.", "elements": []}, {"text": "While she is acknowledged as a Rokushiki master, Kalifa is never seen using Tekkai.", "elements": []}, {"text": "Like all members of CP9, she has an animal theme, which is a sheep.  ", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "One of the CP9 agents that served under Spandine, Laskey, was seen to bear a certain resemblance to Kalifa. When asked about it in the SBS, Oda confirmed that he is her father.", "elements": []}, {"text": "Kalifa's birthday was revealed in SBS Volume 43 to be April 23. This is because Secretary's Day is celebrated on this day.", "elements": []}, {"text": "In an SBS, Oda cryptically said that the key Kalifa had tucked away on her person was \"hidden there of all places\" but didn't specify exactly where it was.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/04/Laskey_Anime_Infobox.png/revision/latest/scale-to-width-down/150?cb=20130510014456", "caption": "Kalifa's father, Laskey."}]}]}