{"sections": [{"title": "Tontatta Tribe", "level": 1, "content": [{"type": "paragraph", "text": "The Tontatta Tribe are a group of dwarves living on Green Bit, in Tontatta Kingdom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Since they are dwarves the Tontatta are rather small creatures, big enough to fit in one's palm. They have furry tails coming from their rear and most of them feature pointy noses."}], "images": []}, {"title": "Organizations", "level": 2, "content": [], "images": []}, {"title": "Miniature Riku Royal Army", "level": 3, "content": [{"type": "paragraph", "text": "After Donquixote Doflamingo took over the throne by manipulating the former King Riku Doldo III, he started his tyrannical rule. Doflamingo then captured many of the dwarves, including the princess Mansherry, and had them produce SMILE in the SMILE Factory. Learning the truth of his evil deeds from Kyros, the free Tontatta tribe formed themselves into the Miniature Riku Royal Army, a guerilla anti-Doflamingo group which intended on usurping the Shichibukai's rule and free their comrades, as well as the poor souls who were turned into toys. They were led by Thunder Soldier, the transformed Kyros."}, {"type": "paragraph", "text": "Due to the frustration of Doflamingo's sudden 'mistaken' resignation, it incited the Miniature Riku Royal Army to finally take action in the form of Operation S.O.P. They planned to take out Sugar, in order to revert people back from toys, so as to reveal the conspiracy behind Doflamingo, rescue their comrades (including the princess) and destroy the SMILE factory. Thanks to the timely arrival of the Straw Hat Pirates, the operation was a success. After the Donquixote Family was defeated, Kyros dismissed the Miniature Riku Royal Army."}], "images": []}, {"title": "Tonta Corps", "level": 3, "content": [{"type": "paragraph", "text": "The Tonta Corps (トンタ兵団, Tonta Heidan) was created with the permission of their king, Gancho. It consists of 200 Tontatta warriors led by Leo, who joined an alliance consisting of six other groups under the Straw Hat Pirates, altogether known as the Straw Hat Grand Fleet."}], "images": []}, {"title": "Overall Strength", "level": 2, "content": [{"type": "paragraph", "text": "The Tontatta are extremely strong for their size, being able to easily overpower a weak human, to the point of launching them far away. They have their own kind of martial arts known as Tontatta Combat. As far as Orlumbus mentioned, they have an army of at least 200 members."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "A Century of Slavery", "level": 4, "content": [{"type": "paragraph", "text": "Over 900 years ago, the dwarves set out to sea in search of resources. The Donquixote Family proposed a treaty in which they would provide shelter and resources in exchange for manual labor. As Gancho puts it, this was the darkest period of the Tontatta tribe. The Donquixote Family enslaved the dwarves and the humans of Dressrosa prospered from their labor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Donquixote_Ancestor%27s_Cruelty.png/revision/latest/scale-to-width-down/180?cb=20160129205441", "caption": "The Donquixote king suppressing the Tontatta dwarves."}]}, {"title": "Liberation by the Riku Family", "level": 4, "content": [{"type": "paragraph", "text": "After the Void Century, the Riku family became the rulers of Dressrosa. King Riku at the time was saddened by the mistreatment the dwarves suffered and liberated them. After forming a bond with the Riku family, the dwarves covered Dressrosa with luscious greens and blooming flowers. The dwarves were also allowed, as part of their compensation, to take anything they wanted from the country, no questions asked. To cover for them, King Riku created the legend about fairies and firmly implanted it into his people as a means of covering for the dwarves' actions."}, {"type": "paragraph", "text": "Over 400 years ago, explorer Mont Blanc Noland visited their kingdom and helped the dwarves by fighting off the \"bad humans\" who were ravaging their lands. For his actions, Noland was considered a hero by the dwarves, who built a statue to honor him as a hero."}], "images": []}, {"title": "Fight against a Return to Slavery", "level": 4, "content": [{"type": "paragraph", "text": "After Donquixote Doflamingo overthrew the Riku Royal family and ascended to the throne, the Donquixote Family kidnapped 500 dwarves and put them to work in the SMILE Factory of Dressrosa. Some of the dwarves formed an anti-Doflamingo army, the Riku Royal Army, led by Thunder Soldier."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Doflamingo falsified the news of his resignation, the rebels decided to end his rule once and for all. The dwarves and Thunder Soldier planned a decisive attack against him which involves destroying the facilities in the underground world and liberating the prisoners as well as defeating one of Doflamingo's most important subordinates, Sugar."}, {"type": "paragraph", "text": "After infiltrating the underground world, the dwarves split into two groups. One group (including Kabu, Rampo, Nubon, Daikon and Baxcon) went with Thunder Soldier to the royal palace while the other group (including Leo, Bomba, Bian, Flapper, Bobomba, Inhel, Cotton and Pellini) went with Usopp and Robin to the officer tower. The operation went awry as the dwarves with Thunder Soldier encountered Lao G inside the lift to the royal palace while the dwarves with Usopp and Robin had a major setback during their confrontation with Sugar, who turned some of the dwarves into toys and forced them to fight against their former comrades."}, {"type": "paragraph", "text": "After the lift carrying Thunder Soldier's group reached the palace, the dwarves eventually managed to hold Lao G at bay. Kabu and Rampo continued on with Thunder Soldier, but when they encountered Gladius, the two dwarves were swiftly defeated."}, {"type": "paragraph", "text": "Back at the underground trade port, the dwarves with Usopp and Robin were completely incapacitated by Trebol. With Robin turning into a toy by Sugar's powers, Usopp became the dwarves' last hope. The dwarves chanted Usopp's name, prompting him to take a stand against Trebol. Though Usopp was overpowered, he managed to make Sugar faint in an unexpected way after she forced a spice into his mouth, making Usopp gave off a horrible expression that completely terrified Sugar."}, {"type": "paragraph", "text": "With all the toys in the country returning to their original forms, the dwarves wept over Usopp's success and promised to build a statue in his honor."}, {"type": "paragraph", "text": "At the palace, the dwarves who accompanied Thunder Soldier were found by Kin'emon and Wicca. Kin'emon carried them out of the palace and brought them back to their comrades at the underground trade port."}, {"type": "paragraph", "text": "When the citizens of Dressrosa finally realized the truth about Doflamingo, he trapped all of Dressrosa in his \"birdcage\" and forced everyone into a survival game, in which they have the choice to come after his head or those on his hit list. After he placed bounties on twelve certain people, most of the former toys started going after the people on the hit list, seeking to collect the reward. The dwarves fled the underground with Usopp, Robin, and Rebecca. After running through the colosseum stands, they reached the top of the old King's plateau and reunited with Riku Doldo III and Viola."}, {"type": "paragraph", "text": "Leo and Kabu went with Rebecca and Robin to the new King's plateau to find Luffy while the rest of the dwarves went to the SMILE factory to assist Franky."}, {"type": "paragraph", "text": "The dwarves that went to the factory informed the enslaved dwarves about Doflamingo's treachery, prompting them to revolt against their captors. They managed to unlock the doors to the factory, allowing Franky to enter. However, they learned that Mansherry was not in the factory."}, {"type": "paragraph", "text": "Viola located Mansherry inside the palace and informed Leo of her whereabouts. Once Leo and Kabu reached the palace, they charged in to find Mansherry. After fighting their way to the palace chapel, Leo and Kabu rescued Mansherry from Giolla."}, {"type": "paragraph", "text": "After Franky defeated Senor Pink, the dwarves proceed with the destruction of the SMILE factory and tear it apart."}, {"type": "paragraph", "text": "After the factory's destruction, the dwarves saw the Birdcage started to shrink. While fleeing, they ran into Zoro, who planned to stop the Birdcage. Since the exterior of the factory cannot be cut, the dwarves and Franky decided to use the factory to push the Birdcage back in order to buy more time."}, {"type": "paragraph", "text": "Leo assisted the gladiators who fought alongside Luffy in pushing back the Birdcage via Bartolomeo's barrier. Kabu and Mansherry flew above Dressrosa with Mansherry using her power to heal the injured, saving them from certain death."}, {"type": "paragraph", "text": "Once Luffy finally defeated Doflamingo, the Birdcage collapsed. As Doflamingo's downfall was announced to Dressrosa, the dwarves cried with tears of joy."}, {"type": "paragraph", "text": "During the aftermath, the dwarves gathered in front of Kyros and saluted their commander."}, {"type": "paragraph", "text": "Three days after Doflamingo's defeat, the Marines were mobilized to pursue Luffy and his allies. The dwarves hindered the Marines by stealing their weapons and immobilizing them. Leo also stitched the Marines' ships together, preventing them from setting sail."}, {"type": "paragraph", "text": "Leo's group, consisting of 200 members, later boarded Orlumbus' flagship, the Yonta Maria and pledged their allegiance to the Straw Hats along with six other groups."}, {"type": "paragraph", "text": "With peace returned to Dressrosa, the dwarves then lived in coexistence with the people of Dressrosa."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Tontatta tribe is foreshadowed in the flashback of Noland's past. During one of his sessions recalling his adventures in the Grand Line, he mentions visiting a land of dwarves.", "elements": []}, {"text": "The tribe has the ability to hunt fighting fish, which are described as related to giant goldfish. Incidentally, in Chapter 24, Usopp lies to Kaya about hunting a giant goldfish and giving the meat to dwarves.", "elements": []}, {"text": "The first encounter between the Tontattas and Nico Robin resembles the first encounter between Lemuel Gulliver and the Lilliputians in Gulliver's Travels.", "elements": []}, {"text": "All dwarves introduced thus far have been shown to frequently add \"-resu\" (a slurred form of -desu) to the ends of their sentences.", "elements": []}]}], "images": []}]}