{"sections": [{"title": "Paulie", "level": 1, "content": [{"type": "paragraph", "text": "Paulie was one of the five Dock One foremen of Water 7, specializing in rigging, knots, and masts. He was recently promoted to vice president of the Galley-La Company."}, {"type": "paragraph", "text": "He became an ally of the Straw Hat Pirates during the end of the Water 7 Arc and the beginning of the Enies Lobby Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Paulie is often seen with a cigar in his mouth. His denim jacket has a flame detail, many of his cigars strapped to it (in a similar fashion to Smoker), and a big \"1\" printed on its back, most likely referring to Dock 1 (though in the Post-Enies Lobby Arc, he wore a black jacket emblazoned with roses and chains)."}, {"type": "paragraph", "text": "His hair is blond and slicked back on his head while wearing a pair of orange goggles on top. These goggles were cracked on the right side for the second half of the Water 7 arc and the duration of the Enies Lobby arc as a result of his fight with Rob Lucci and Kaku. He is quite muscular, and his attire is completed by a yellow T-shirt, with white concentric circles in the middle of it, a belt around his waist with a little bag attached to it, and a pair of loose trousers tucked inside his boots. He's usually seen frowning."}, {"type": "paragraph", "text": "In his appearance in the Where They Are Now? cover story, he was seen wearing an elegant, unbuttoned jacket over a cloud-patterned shirt, with a loose tie around the unbuttoned collar, and matching suit trousers. He still had his trademark goggles, belt and cigars strapped to his jacket, and a hammer and a small purse were attached to his belt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Paulie is shown as closest to and most trusted by Iceburg. He also shows a prudish outlook on the way many female characters dress. Unlike most other male characters such as Sanji, Paulie often becomes outraged at how much of their bodies women such as Nami (even calling her a harlot, much to her annoyance), Kalifa, and Mozu and Kiwi (who call him an overly shy man) show off when they are in the company of men."}, {"type": "paragraph", "text": "He apparently enjoys gambling, as he has many debts to pay off and is often pursued by debt-collectors. When he is first introduced, he tries to steal two suitcases full of money from Luffy to pay off his gambling debts. Though he is thwarted by Lucci and pulled back on land by his ear and gives back the suitcases, he asks for 10% of the cash if Luffy really wanted to thank him, shortly before being knocked over the head by Lucci with a hammer. However, despite this, Paulie is still a kind-hearted person, and very caring about his friends and his mentor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/Paulie_Outraged_at_Nami.png/revision/latest/scale-to-width-down/210?cb=20150419170711", "caption": "Paulie calls Nami a \"shameless girl\"."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of Dock 1's foremen, and later as the vice president of Galley-La Company, Paulie is an extraordinarily skilled shipwright, who actively took part in the realization of the Thousand Sunny for the Straw Hat Pirates."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Aside from his shipwright skills, Paulie possesses formidable physical and fighting capabilities."}, {"type": "paragraph", "text": "He has shown to be several times stronger than common humans: he effortlessly slammed many members of the Franky Family one onto another with just two ropes and the sheer strength of his arms, and he also pulled a giant to the ground with a similar method. He can throw ropes against his enemies in a straight line with enough blunt power to defeat them with one blow, and was able to open alone one of the two gigantic wings of Dock 1's door. Last but not least, he managed to slam Luffy around with his rope and actually hurt him, despite his rubber body."}, {"type": "paragraph", "text": "He is highly resistant and resilient, as he took a full beating from CP9 members and was able to stand back up in mere moments; the injuries he suffered apparently healed in a very short period of time. On Enies Lobby, he was pierced from side to side by a member of the Watchdog Unit of the Law and yet managed to fight without consequences for the rest of the story arc."}, {"type": "paragraph", "text": "Paulie is also very acrobatic and agile, as he leaped off one of Water 7's high bridges and landed on a Yagara Bull without a scratch."}], "images": []}, {"title": "Rope Action", "level": 3, "content": [{"type": "paragraph", "text": "Paulie has a unique fighting style; he makes use of an intricate array of acrobatics combined with rigging techniques that employ a complicated use of ropes that appear from under his sleeves. It is also versatile since the ropes enable him to increase the reach of his attacks - be it long-ranged, mid-ranged, or even melee - and even attack multiple targets at once, giving Paulie an advantage in battle, be it group combat or one-on-one."}, {"type": "paragraph", "text": "The amount of rope he carries is absurd, (which led some to speculate it was the power of a Devil Fruit) measuring hundreds, if not thousands of meters, as he was actually able to make a huge, complex rope-work in a split-second to keep not only himself, but also the entire Franky Family, their Kingbulls, Oimo, and Kashi from falling into the huge pit in Enies Lobby. The amount of rope that he uses as a weapon and brings with himself all the time never seems to run out, since he has been known to pull out yards upon yards from time to time."}, {"type": "paragraph", "text": "When he attacks, the ropes generally snake their way out his sleeve and wrap around the target. He typically weaves his ropes into patterns that help him to either ensnare foes or restrain their movements, making them more vulnerable to incoming attack. Paulie can also uses his ropes outside of battle, as seen when he successfully deceived the marines that he had already been captured when in reality, he deliberately tied himself up with his own ropes and was just waiting for the right time to release himself, the Franky Family, and the Giants."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Rope_Action_Infobox.png/revision/latest/scale-to-width-down/210?cb=20130724095638", "caption": "\"Rope Action: Figure of 8 Knot\"."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "During the opening day of the Puffing Tom, a young Paulie was seen attending its coronation. He appeared enthusiastic about the new amazing means of transportation, even running after the train when it started its first journey. Inspired by this event, Paulie decided to become a shipwright. He then grew up and joined the Galley-La Company, eventually becoming one of the company's top foremen."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Young_Paulie_at_Puffing_Tom%27s_Opening.png/revision/latest/scale-to-width-down/210?cb=20131003021358", "caption": "A young Paulie at Puffing Tom's opening."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "Paulie first appeared while working in Dock 1. When Mikazuki refused to pay for his ship's repairs, Paulie and the other Galley-La workers attacked the pirates."}, {"type": "paragraph", "text": "Later Paulie was running away from debt collectors. To escape, he hijacked a Yagara Bull the Franky Family was using to steal the Straw Hats' money, thus helping them in the process. However, he then tried to steal the money himself, but was stopped by Rob Lucci who then got into a brief, apparently \"friendly\" fight with him."}, {"type": "paragraph", "text": "When Galley-La refused to repair Going Merry, Paulie explained that ships are built starting with the keel and that replacing the keel would mean building a new ship. When a world government officer appeared, Paulie told Nami and Luffy to hide and wondered what the World Government wanted with Iceburg. Paulie chastised Nami and Luffy's screaming after they discovered their suitcases were empty. Peepley Lulu pointed out that Ussop was kidnapped by the Franky Family, and Paulie told Nami where the Franky House's location, although Luffy had already run off."}, {"type": "paragraph", "text": "Later, he was shocked to hear about the attempted murder on Iceburg. He angrily expelled the journalists from the Galley-La Headquarters courtyard and then searched for the Straw Hats with the other foremen of Galley La to eliminate them, believing them to be responsible for the crime. They managed to find Luffy, and Paulie showed his great mastery with ropes by smashing him around, until Franky interrupted the battle with his Coup de Vent, and Luffy and Nami managed to escape."}, {"type": "paragraph", "text": "When night fell, the whole Galley La company guarded the office thinking that the murderer might attack Iceburg again. Iceburg asked him to go to his office to retrieve a fake blueprint of the Pluton. As he was retrieving it, he was surprised by two masked strangers who had no problem in dealing with him. Right as he was about to be killed, Luffy crashed into the wall, proving to him that the attempted assassin were not the Straw Hat Crew, he was then trapped with Luffy and left to die."}, {"type": "paragraph", "text": "However, with the help of Luffy, he got free and ran to Iceburg's aid. There, it was revealed to him that Lucci, Kaku, Kalifa, and Blueno were all working undercover for the government. Shocked at first, Paulie tried to avert this truth as some misunderstanding, until Lucci revealed that he could talk without Hattori's assistance, and that he would prove his antagonism by stepping on Iceburg's face, which angered Paulie, as he recognized the voice as one of the assailants who trapped them in the office. Paulie attempted to attack his former best friend, only to be brutalized by Lucci's mastery of Rokushiki. Lucci then shocked Paulie and the others further by utilizing his Devil Fruit, the Neko Neko no Mi, Model: Leopard, and transforming into a bipedal leopard to greatly enhance his strength. Paulie, shocked and horrified, tried to get Iceburg to safety, but was stopped by Lucci, who rebuffed Paulie's claim of thinking of them as friends. As the CP9 set the building on fire and left Paulie and Iceburg tied up to burn, they were then saved by Chopper, who took the two out of the place safely."}, {"type": "paragraph", "text": "He later helped Nami and Chopper search for Luffy and Zoro to go save Nico Robin. He rescued them as they were about to get washed away by a wave. As the crew was determined to follow the train carrying Robin, he tried to stop them because of the phenomenon called Aqua Laguna, explaining its devastating effects on the city and the impossibility of navigating during it."}, {"type": "paragraph", "text": "The Straw Hats, however, eager to save their crewmate, refused to listen to him. He eventually met up with Lulu and Tilestone, and they hid themselves on the Rocket Man in order to help the Straw Hats to achieve their goal."}, {"type": "paragraph", "text": "He was later seen on the Rocket Man along with the other Galley La foremen, having joined forces with the Franky Family and Straw Hat Pirates; they passed through the Aqua Laguna and proceeded to Enies Lobby."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f6/Outrunning_the_Aqua_Laguna.png/revision/latest/scale-to-width-down/230?cb=20121227130158", "caption": "Luffy, Zoro, and Paulie outrun a wave."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Straw_Hat%2C_Galley-La%2C_and_Franky_Family_Alliance_Formed.png/revision/latest/scale-to-width-down/230?cb=20190825054310", "caption": "Luffy, Paulie and Zambai team up."}]}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "As they were reaching Enies Lobby, Paulie drew a map (he had been there before to repair the rails) and planned how they will go inside. As they were waiting for the time to land, Luffy had already flown into Enies Lobby and started rampaging there. When they attack the island, together with the Franky Family and his comrades, they defeated Oimo and Kashi. When they entered the gate, one from the Watchdog Unit of the Law leaped forward and stabbed Paulie. The Rocket Man suddenly landed with the remaining Straw Hats."}, {"type": "paragraph", "text": "As they were riding the Franky Family's King Bulls, he told Zoro, \"If you meet them (the four traitors), tell them that they are fired.\" Sodom was shot in the heart and collapsed. Together with Lulu and Tilestone, they fought the remaining Marines. Later as they were about to collapse, they saw Oimo and Kashi with Sogeking, not as enemies but as allies. When they reached the Courthouse with the Franky Family, they defeated Baskerville."}, {"type": "paragraph", "text": "As the Buster Call was summoned, he tied himself up with his own ropes as the others were tied up by the Marines, waiting for an opportunity to escape. Kashi and Oimo carried them to the front gates where battleships fired at them. Paulie caught them with his rope, and they finally escaped. They hijacked the Puffing Tom and returned to Water 7."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fa/Paulie_vs._Watchdog_Unit_of_the_Law.png/revision/latest/scale-to-width-down/210?cb=20131003021529", "caption": "Paulie is injured by a Watchdog Unit of the Law."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Paulie_and_Zambai_Separate_Baskerville.png/revision/latest/scale-to-width-down/180?cb=20150326173027", "caption": "Paulie and Zambai \"defeat\" Baskerville."}]}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events of Enies Lobby, Paulie and the others all returned to Water 7, where he led the reconstruction of the Galley-La Company's main headquarters. Along with Iceburg, Peepley Lulu, and Tilestone, he joined Franky in building a new ship for the Straw Hat Pirates."}], "images": []}, {"title": "Thriller Bark Saga", "level": 3, "content": [], "images": []}, {"title": "Where Are They Now", "level": 4, "content": [{"type": "paragraph", "text": "Some time later, Paulie has been promoted to vice-president and is shown being chased by love-struck fans and furious debt-collectors."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Paulie_W.A.T.N.png/revision/latest/scale-to-width-down/230?cb=20130409140310", "caption": "Paulie chased by fans and debt-collectors."}]}, {"title": "Fishman Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Paulie is shown after the timeskip unveiling the Puffing Ice with Lulu, Tilestone, and other Galley-La employees and celebrating with them."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Franky's new wanted poster reached Water 7, Paulie looked at it with a shocked expression."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "Paulie was originally shown without a cigar in his mouth. "}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Paulie, Tilestone, Peepley Lulu, Rob Lucci, and Kaku vs. Monkey D. Luffy (interrupted by Franky)", "elements": []}, {"text": "Paulie vs. Rob Lucci and Kaku (masked)", "elements": []}, {"text": "Paulie vs. Rob Lucci", "elements": []}, {"text": "Paulie, Tilestone, Peepley Lulu, Franky Family, and Sodom and Gomorrah vs. Oimo and Kashi", "elements": []}, {"text": "Paulie, Tilestone, and Peepley Lulu vs. Watchdog Unit of the Law and Marine Officers", "elements": []}, {"text": "Paulie and Zambai vs. Baskerville", "elements": []}, {"text": "Galley-La Company, Franky Family, Yokozuna, and Oimo and Kashi vs. Vice-admiral Strawberry and his Marine Officers", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Adventure", "elements": []}, {"text": "One Piece: Unlimited Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His birthday was revealed to be July 8. This is because, in Japanese, 7 can be pronounced as \"na\" and 8 can be pronounced as \"wa\", which creates \"nawa\", meaning rope.", "elements": []}]}], "images": []}]}