{"sections": [{"title": "Sheepshead", "level": 1, "content": [{"type": "paragraph", "text": "Sheepshead is a Headliner of the Beasts Pirates who is in charge of the Gifters."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sheepshead is a muscular man of average height with short, light blonde, slicked-back hair and two small black horns on his head. He wears goggles over his eyes and an open black cloak that exposes his bare chest. There is a scar running the length of his chest, and his left forearm is entirely tattooed. He wears a belt with the Beasts Pirates' Jolly Roger on it and long black pants."}, {"type": "paragraph", "text": "While using his Devil Fruit powers, his hair becomes longer and curlier, resembling sheep's wool."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sheepshead is very eager to kill his opponents, and will not stop until they are dead or he is no longer be able to fight. He is sadistic and loves violence, having relentlessly pursued Tristan with the intention of torturing her after the destruction of the Mokomo Dukedom and the interrogation of its inhabitants."}, {"type": "paragraph", "text": "He takes offense to people not showing proper respect when talking to his superiors and sometimes fixates on small details for no reason, such as when he berated Ginrummy for calling Raizo a samurai when she was merely using the term colloquially."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "The Gifters of the crew are very respectful to Sheepshead due to him being their headliner, referring him as \"Sheepshead-sama\". Sheepshead possesses great respect towards his captain Jack, having angrily berated the mink tribe for not speaking to him respectfully before explaining his reputation as one of Kaido's right-hand men. Despite his great admiration for Jack, the latter did not hesitate to punish Sheepshead for his failing in locating Raizo and reporting that he was not on Zou."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Mink Tribe", "level": 4, "content": [{"type": "paragraph", "text": "Sheepshead participated in the Beasts Pirates' attack on the Mokomo Dukedom, resulting in the city's destruction. Prior to that, he expressed anger at the minks' lack of respect toward Jack."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Sheepshead made an enemy of the Straw Hats when they first encountered him, as Nami immediately recognized that he was the aggressor upon seeing him chasing Tristan. The Straw Hats saved Tristan from Sheepshead, who angrily chased and attacked them, only to be defeated by Sanji."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As Headliner of the Gifters, Sheepshead holds a high position in the Beasts Pirates and has authority over them and other lower-ranking members of the crew, and he was even shown with the authority to give orders to other Headliners like Ginrummy. Sheepshead is a competent fighter, having countered Brook's freezing Soul Parade without any visible difficulty; however, Sanji managed to defeat him with a single Diable Jambe attack when Brook stalled him."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Sheepshead ate an artificial Devil Fruit known as SMILE, which grants him the ability to transform his hands into the horns of a sheep. Sheepshead was able to activate and deactivate his powers at will thanks to his advanced control over his fruit."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/15/Sheep%27s_Horn.png/revision/latest/scale-to-width-down/210?cb=20160501111902", "caption": "Sheepshead's SMILE fruit powers."}]}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Sheep's Horn (シープスホーン, Shīpusu Hōn): Sheepshead transforms his hands into sheep horns before punching his opponent. It was first witnessed being used against Brook, Nami and Momonosuke.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Sheepshead carries a large sword on his back."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sheepshead was part of the forces led by Jack that invaded the Mokomo Dukedom searching for Raizo of Wano Country. Sheepshead mocked the minks living there and became annoyed when they disrespected Jack, causing him to introduce his leader before telling them to hand over Raizo. When Ginrummy affirmed that the Beasts Pirates' only goal was to capture Raizo, Sheepshead was annoyed that she incorrectly referred to him as a samurai, but was berated for placing too much emphasis on that detail. After the Pleasures were defeated, Sheepshead was shocked by the combat prowess of the minks before joining the battle himself alongside the rest of the Gifters."}, {"type": "paragraph", "text": "The battle changed as Inuarashi and the Musketeer Squad arrived, later followed by Nekomamushi and the Guardians, but the Beasts Pirates continued fighting. The fight lasted for five days, and the minks eventually managed to gain the upper hand. However, the Beasts Pirates won the battle after Jack brought out Koro, Caesar Clown's gas weapon, and laid waste to the city and its inhabitants."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "One day after the battle, Jack left Zou to rescue Donquixote Doflamingo after learning of his defeat and capture, leaving behind some of his subordinates, including Sheepshead, to continue searching for Raizo. On the next day after Jack left, Sheepshead chased after Tristan while riding on his steed and came across Sanji, Nami, Brook, Chopper, Momonosuke, and Caesar Clown. After Brook tripped Sheepshead's alligator by covering the ground in ice, Tristan and Sanji's group ran away from him."}, {"type": "paragraph", "text": "After recovering from Brook's attack, Sheepshead tracked down Nami, Brook, and Momonosuke, wanting to know what they had done with Tristan. As Zunesha began spraying its back with seawater, Sheepshead attacked the three of them, but Brook countered his blow, allowing Sanji to defeat Sheepshead with Diable Mouton Shot. With his defeat, Ginrummy ordered the Beasts Pirates to retreat and tell Jack that Raizo was not on Zou."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Sheepshead_Chases_Tristan.png/revision/latest/scale-to-width-down/210?cb=20160425164137", "caption": "Sheepshead pursues Tristan."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Sheepshead_defeated.png/revision/latest/scale-to-width-down/210?cb=20161120001108", "caption": "Sanji defeats Sheepshead."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sheepshead and his group returned to Jack with a report that Raizo was not at Zou. Not satisfied with his report, Jack punished him by beating him up and hanging him upside down as they returned to Zou. Once they saw the giant elephant, Jack commenced his attack on it. However, Zunesha retaliated and sunk Jack's fleet with a single blow, and Sheepshead sunk into the sea."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Jack_Punishes_Sheepshead.png/revision/latest/scale-to-width-down/210?cb=20170116011456", "caption": "Jack punishes Sheepshead."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Beasts Pirates vs. Mink Tribe and Heart Pirates", "elements": []}, {"text": "Sheepshead vs. Brook and Sanji", "elements": []}, {"text": "Beasts Pirates vs. Zunesha", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sheepshead was defeated by Sanji's Mouton Shot attack, which fits his name since mouton is the French term for \"sheep\".", "elements": []}, {"text": "Sheepshead is named after the card game of the same name, following his crew's card game motif and the Headliners all being named after card games.", "elements": []}, {"text": "Sheephead's favorite food is a mix of all kinds of vegetables.", "elements": []}]}], "images": []}]}