{"sections": [{"title": "Tilestone", "level": 1, "content": [{"type": "paragraph", "text": "Tilestone is one of the five foremen of Dock One of the Galley-La Company in Water 7. Tilestone is the last of the foremen to be formally introduced in the story, although he is present from the first scene Galley-La is shown in. His specialties are cabinetry, caulking, and flag making."}, {"type": "paragraph", "text": "He became an ally of the Straw Hat Pirates during the end of the Water 7 Arc and the beginning of the Enies Lobby Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tilestone is a very large man. He has brown hair tied in a ponytail on the back, and a light-brown beard. He has a tattoo going from his chest near his shoulder to his arm with the kanji for \"shipwright\" (船大工, funadaiku), although oftentimes only the first kanji, which means \"ship\", can be seen. He wears a pair of crimson elbow-pads, knee-long pants and standard shoes. During the attack on Enies Lobby, he had a cartridge belt over the right leg and carried a big firearm held up by another belt on his back."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Tilestone yells everything he says, even if the situation calls for speaking quietly. While his fellow co-workers try to accommodate this particular trait of his, Tilestone himself however seems somewhat unaware of his constant yelling."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Galley-La Company", "level": 3, "content": [{"type": "paragraph", "text": "Because of Tilestone's inability to speak normally, he can be a bother to his fellow co-workers. They do understand his inability and even though they yell at him constantly to be quieter especially in situations that require it, they also seem to try to accommodate it. However, sometimes his constant shouting can really get on their nerves."}], "images": []}, {"title": "Iceburg", "level": 3, "content": [{"type": "paragraph", "text": "Like most of the Galley-La company and the rest of Water 7, Tilestone has a great respect and deep loyalty for Iceburg. He would do anything to protect the hero that saved his home from destitution."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Tilestone is a skilled shipwright. He also has exceptional strength that not only aids him in his occupation but also in battle. As a foreman of Dock One, Tilestone has some authority over the fellow shipwrights under his jurisdiction."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In battle, he typically fights with either a large hammer or some sort of huge, hand-held cannon."}], "images": []}, {"title": "Techniques", "level": 3, "content": [{"type": "list", "elements": [{"text": "Demi Cannon (デミ・キャノン, Demi Kyanon): Tilestone fires a demi-cannon designed for ships, using it as a hand cannon. A demi-cannon is a cannon, normally forged out of bronze and installed on ships, that uses 32-pound ammunition, while a full cannon uses 42-pound ammunition.", "elements": []}, {"text": "Ryukotsu Ori (竜骨折り, Ryūkotsu Ori, literally meaning \"Keel Crusher\"): Tilestone grabs a few enemies between his arms to crush them with a strong bearhug. In the FUNimation dub, this is called Keel Breaker.", "elements": []}, {"text": "Trunnel Lock (ロック, Toren'neru Rokku, literally meaning \"Wooden Peg Lock\"): A combined attack with Peepley Lulu. Tilestone uses his superhuman strength to manually nail some pegs onto any surface while Lulu comes from behind him fixing them with a hammer. \"Trunnel\" is the name of the wooden pegs they use. In the FUNimation dub, this is called  Machine Nail Lock.", "elements": []}, {"text": "Senkan Ho (戦艦砲, Senkan Hō, literally meaning \"Warship Cannon\"): Using the same cannon he uses for \"Demi Cannon\", Tilestone fires a more powerful blast.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0c/Demi_Cannon_Infobox.png/revision/latest/scale-to-width-down/180?cb=20121227141858", "caption": "Tilestone wielding the Demi Cannon as a hand cannon."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "Tilestone first appeared when Mikazuki's crew refused to pay for the repairs to their ship, which the Galley-La workers responded to by beating the entire crew senseless. Later, after the assassination attempt on Iceburg, Tilestone was seen chasing away some reporters who wanted to know who the culprits were."}, {"type": "paragraph", "text": "After Iceburg revealed the identities of the assassins, Tilestone told the foremen, Kalifa, and Iceburg that Franky and Luffy were fighting in the Number One Dock. The foremen then fought against Luffy and (to a lesser extent) Franky. Tilestone knocked Franky away from the site of the battle so the foremen could fight against Luffy, thinking that he had a part in the assassination attempt (as Nico Robin, one of the assassins, was part of Luffy's crew). However, due to the intervention of Franky, Luffy escaped."}, {"type": "paragraph", "text": "That night, all five foremen sat outside Iceburg's room in order to protect him from any further assassination attempts. After Paulie was told by Kalifa that Iceburg wanted to see him, Tilestone foolishly believed that Iceburg wanted to say his last words (which rewarded him with punches and kicks from the rest of the Galley-La foremen). Later, as CP9 started the attack on Iceburg's mansion, Tilestone and Peepley Lulu both stormed away to face the intruders, leaving Kaku and Lucci by themselves."}, {"type": "paragraph", "text": "However, later on, several shipwrights told Tilestone that an assassin was sitting right outside of Iceburg's room, with the fallen bodies of \"Lucci\" and \"Kaku\" next to him. Angered at the sight of his fallen co-workers and fearing for Iceburg's safety, Tilestone attacked the assassin with a giant hammer, but the assassin hardened his own skin to the point that the hammer was crushed on impact. Wondering how the assassin could be stronger than him, Tilestone was hit with an immensely powerful punch from the assassin, knocking him out in one blow."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later on, Tilestone and Lulu accompanied Paulie, the Franky Family, and the Straw Hats to Enies Lobby, where CP9 took Franky and Nico Robin. There, the two remaining foremen learned that the true assassins were, in fact, their own allies Kaku, Lucci, Kalifa, and Blueno. This fact shocked them as Tilestone and Lulu originally believed the assassins to be Michael and Hoichael from the Water 7 Backstreets."}, {"type": "paragraph", "text": "At Enies Lobby, Tilestone proved to be a valuable fighter, managing to bearhug several Marines into submission at once. He helped with defeating Oimo and Kashi, and helped Paulie and Lulu hold off the canine units of Enies Lobby's forces until the Straw Hat's arrived with the newly-converted giants."}, {"type": "paragraph", "text": "Tilestone later invaded the courthouse alongside the others. They encountered the Just Eleven Jurymen and fought them so that they could lower the drawbridge. Although they were able to defeat them and lower the bridge, they were eventually captured by reinforcements. However, before anything could be done with them, the news of the Buster Call arrived and the Marines and government officials ran, leaving Tilestone and their other captives behind. Tilestone was eventually freed by Paulie who pretended to have been tied up by his own rope."}, {"type": "paragraph", "text": "Seeing as how the island was about to be destroyed, they all ran towards the island's front gate. At the gate, they encountered Vice Admiral Strawberry and his battleships and were blasted backwards over the cliff of Enies Lobby. They were, however, saved by Paulie's rope and remained silent, pretending to be dead as to avoid the Marines attacking. With the news of the Straw Hats' survival and victory, they came out of hiding, and Tilestone and the others escaped the island on the Puffing Tom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/34/Kiwi%2C_Tilestone%2C_and_Franky_Family_Defeat_Jurymen.png/revision/latest/scale-to-width-down/210?cb=20130928000247", "caption": "Tilestone, Kiwi, and the Franky Family defeat the Just Eleven Jurymen."}]}, {"title": "Post Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Straw Hats party, Tilestone joined in alongside everyone else that participated in the Enies Lobby fight."}, {"type": "paragraph", "text": "Afterwards, Tilestone, along with the remaining foremen and Iceburg, all helped Franky build the a new ship for the Straw Hat Pirates."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Tilestone was seen after the timeskip celebrating the completion of Puffing Ice with the other Galley-La employees."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Galley-La_Workers_Post_Timeskip.png/revision/latest/scale-to-width-down/210?cb=20130909025144", "caption": "Tilestone, Paulie and Lulu with the Puffing Ice"}]}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Franky's new wanted poster reached Water 7, Tilestone looked at it with a shocked expression."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 323 (p. 18) and Episode 230, Tilestone is seen amongst his fellow shipwrights.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 35 Chapter 336 (p. 12) and Episode 238, Tilestone is introduced.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0386), Information about Tilestone is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 102), Tilestone's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 327 and Episode 232, Tilestone using a demi-cannon.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 433 and Episode 315, The Straw Hats, Franky Family, and Galley-La celebrate by having a pool party.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 66 Chapter 656, cover story: From the Decks of the World Vol. 38.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 81 Chapter 816, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 10.", "elements": []}]}], "images": []}]}