{"sections": [{"title": "Peepley Lulu", "level": 1, "content": [{"type": "paragraph", "text": "Peepley Lulu is one of the five foremen of Dock One of the Galley-La Company in Water 7. His specialties as shipwright are pitch, block and tackle, and blacksmithing."}, {"type": "paragraph", "text": "He became an ally of the Straw Hat Pirates during the end of the Water 7 Arc and the beginning of the Enies Lobby Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Peepley Lulu is a muscular man with black hair and a mustache who usually wears sunglasses. He constantly has a part of his hair sticking up. When he tries to push it down, it always pops up somewhere else, such as the other side of his head, his mustache, his hand, and other people's heads. His upper body is covered with intricate tattoos, green on his chest, and red on his arms. He wears pants that have lighter colored stripes around his waist and on the top of the legs, and standard shoes. During the travel on the Rocket Man, he was seen wearing an unbuttoned, brightly colored sleeveless shirt and carried a pair of katanas on his back."}, {"type": "paragraph", "text": "After the timeskip his appearance is nearly the same, but his mustache is thinner and straighter and the part of his hair sticking up is bigger and more conical. When he learns about Franky's new bounty, the part of his hair sticking up consists of four small parts."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Lulu seems to take his work very seriously and he cares very much for both his fellow co-workers and employer."}, {"type": "paragraph", "text": "While Lulu might appear serious at times, he certainly is a comic relief character, as evidenced by the gags he takes part in, such as sprouting the sticking part of his hair on his enemies in order to distract them, and appearing alongside the others with bleeding noses while peeping on Nami changing her clothes on the Rocket Man."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Lulu is one of the most skilled shipwrights working at the Galley-La Company, to the point of being considered one of the top five shipwrights of Water 7 alongside Franky, Iceburg, Paulie and Tilestone."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Lulu_Fighting.png/revision/latest/scale-to-width-down/230?cb=20161029214131", "caption": "Lulu fighting with swords."}]}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Like his fellow foremen, Lulu possesses incredible physical strength. He was able to injure the rubber-bodied Luffy with a mighty kick, and has also shown great combat skills."}, {"type": "paragraph", "text": "He can also use his hair in battle to make hair come out of somebody's nose to distract them, leaving them open for him to attack."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "As a fighter he employs double-weapons; what weapons he uses change at times: he has been seen fighting with swords, guns, and saws."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was first seen meeting up with the Straw Hats at Water 7."}, {"type": "paragraph", "text": "After the assassination attempt on Iceburg, he and the top five Galley La workers went to search for Luffy and his crew to defeat them and throw them in jail. They stopped attacking Luffy when Franky interrupted and used a Coup de Vent to destroy Dock 1, causing a distraction and allowing the two to escape. Later that night, they guarded the Galley La Headquarters to corner the murderer and reveal its true face. When the chaos started, he encountered Kalifa with her mask on and was beaten up before she ran away."}, {"type": "paragraph", "text": "After the assassination attempt on Iceburg was revealed to be orchestrated by CP9, he went with the Straw Hats to Enies Lobby."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Lulu was later seen riding on the Rocket Man with the Franky Family, the Straw Hat Pirates, and the other shipwrights. He commented that Kokoro somewhat resembled a frog when she was talking with Yokozuna. Along with Tilestone, he then learned that the people who tried to kill Iceburg were none other than Lucci, Kaku, Kalifa, and Blueno. When the group arrived at Enies Lobby, Lulu fought off the Marines with Paulie and Tilestone before fighting Oimo and Kashi. Lulu and Tilestone got on Kashi's shoulders and beat his face with hammers. Later, he helped the other shipwrights hold off the Marines' canine units. When the Rocket Man crashed into Oimo's back, Lulu was seen looking shocked along with everyone else, saying that opening the gate was now pointless."}, {"type": "paragraph", "text": "Lulu later invaded the courthouse alongside the others. They encountered the Just Eleven Jurymen and fought them so that they could lower the drawbridge. Although they were able to defeat them and lower the bridge, they were eventually captured by reinforcements. However, before anything could be done with them, the news of the Buster Call arrived and the Marines and government officials ran, leaving Lulu and their other captives behind. Lulu was eventually freed by Paulie who pretended to have been tied up by his own rope."}, {"type": "paragraph", "text": "Seeing as how the island was about to be destroyed, they all ran towards the island's front gate. At the gate, they encountered Vice Admiral Strawberry and his battleships and were blasted backwards over the cliff of Enies Lobby. They were, however, saved by Paulie's rope and remained silent, pretending to be dead as to avoid the Marines attacking. With the news of the Straw Hats' survival and victory, they came out of hiding, and Lulu and the others escaped the island on the Puffing Tom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Mozu%2C_Lulu%2C_and_Franky_Family_Defeat_Jurymen.png/revision/latest/scale-to-width-down/210?cb=20130928000549", "caption": "Mozu, Lulu, and the Franky Family defeat one of the Just Eleven Jurymen."}]}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Straw Hats party, Lulu joined in alongside everyone else that participated in the Enies Lobby fight."}, {"type": "paragraph", "text": "Later, Lulu assisted in building the Thousand Sunny along with Iceburg, Franky, and the rest of the Galley-La shipwrights."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Lulu was seen after the timeskip with the other Dock 1 employees for the grand unveiling of the new Sea Train, Puffing Ice."}], "images": []}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Franky's new wanted poster reached Water 7, Lulu was shown looking at it with a shocked expression."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 323 (p. 18) and Episode 230, Lulu debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 35 Chapter 328 (p. 11) and Episode 233, Lulu is introduced.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0379), Information about Peepley Lulu is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 141), his birthday is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0379), Peepley Lulu's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 81 Chapter 816, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 10.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 45 Chapter 435.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 433 and Episode 315, The Straw Hats, Franky Family, and Galley-La celebrate by having a pool party.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 66 Chapter 656, cover story: From the Decks of the World Vol. 38, Lulu is seen during the unveiling of the new Sea Train, Puffing Ice.", "elements": []}]}], "images": []}]}