{"sections": [{"title": "Nero", "level": 1, "content": [{"type": "paragraph", "text": "\"Nero the Sea Weasel\" was the newest member of CP9. He was first introduced on the Puffing Tom, where he helped to escort Nico Robin to Enies Lobby."}, {"type": "paragraph", "text": "He was one of the antagonists during the Sea Train voyage in the Water 7 Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nero is a pale, slim man, wearing a striking attire consisting of a dark-brown T-shirt, orange pants, decorated shoes and a hat adorned with a red plume. He has two necklaces around his neck, a simple one composed of green beads, and a bigger and more elaborate one, which consists of many red jewels linked together. He wears a glove on his left hand, and bracelets around the wrist. He has an unique hairstyle, with a bald top crossed by three mohawk-like strips."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Having undergone the customary training of CP9 agents, he is a calm and collected individual, seen with the casual way he spoke with Franky when they fought. Nonetheless, he is not above displaying his emotions, such as anger at being tricked, fear in the face of inevitable pain, or exasperation in the face of Franky's antics. Additionally, Nero appears to be less hardened than the other agents, as he easily believed Franky's lie when he asked what was behind him, just so that he could sucker punch him. Beneath his calm exterior, he has a measure of arrogance, thinking that knowing four of the six forms of Rokushiki made him a \"superhuman\" that could be in the same league as the other, full-fledged CP9 agents. When Rob Lucci expelled Nero from the group with a death threat, Nero became horrified and made a failed attempt to run away."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Nero, while not very strong compared to the other, fully-trained CP9 agents, was still quite intelligent, since he figured out that the attackers on the Puffing Tom would try going along the roofs of the train cars in order to reach the one containing Nico Robin as easily as possible, and he was able to quickly deduce that Franky was vulnerable to attacks aimed at his back."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "As Nero was still a new recruit, his training incomplete, he only could use four of the six Rokushiki techniques: Soru, Geppo, Kami-e, and Rankyaku. His lack of Tekkai and Shigan made him unable to block powerful strikes and pierce opponents, respectively. To compensate, he evaded enemy strikes carefully with Soru, Geppo, and Kami-e; for offense, along with slashing with Rankyaku, he used a pair of pistols instead of stabbing with his fingers. He was at least skillful enough to have one variation of Rankyaku."}, {"type": "paragraph", "text": "Regardless of his creative improvising and analytical nature, his lack of mastery of Rokushiki caused Rob Lucci to claim Nero was \"worthless\" to the unit, leading to Nero's dismissal."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "As compensation to his lack of Shigan, Nero wields a pair of derringer flintlocks. He was accurate enough to shoot Franky in the back from a fair distance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Nero%27s_Derringers.png/revision/latest/scale-to-width-down/210?cb=20160207020448", "caption": "Nero's derringers."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "Nero attempted to stop Franky from rescuing Robin but failed and was punched through the roof of Puffing Tom, into the cart where the rest of CP9 was. Nero then continued to try to fight Franky and stated he would kill him, but Lucci would not allow this, as they were simply supposed to capture him. Lucci then gave Nero three seconds to escape, at which point Lucci quickly took him out with five Shigan attacks. In the anime, this was toned down to a single Shigan that pierced his back and was enough to finish Nero on its own. Lucci then personally expelled him from CP9. Nero's wounded body was thrown into the ocean during Aqua Laguna, one of the biggest storms in the world. His current status is unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/71/Franky_Defeats_Nero.png/revision/latest/scale-to-width-down/210?cb=20130922181024", "caption": "Franky defeats Nero."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Nero vs. Franky", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Nero\" is the Italian word for \"black.\" It was also the name of a tyrannical Roman Emperor.", "elements": []}, {"text": "He has a weasel theme, due to his nickname, whiskers, ear-like hair, and tendency to say \"shao\" (a weasel noise) when he speaks.", "elements": []}, {"text": "Nero resembles a Kamaitachi, a demonic weasel that can manipulate wind from Japanese folklore. This is because he resembles a weasel, and has the agility (Geppo), flexibility (Kami-e), speed (Soru), and capability of launching air slashes (Rankyaku).", "elements": []}, {"text": "Nero was the only member of the CP9 not to have a picture of what he looked like as a child featured in SBS Volume 44, nor to have his Doriki stated by Fukurou.", "elements": []}, {"text": "In the 4th Shonen Jump Fan Poll to determine the most popular One Piece characters, Nero ranked at 122nd.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 38 Chapter 367 (p. 18) and Episode 257, Nero debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 39 Chapter 369 and Episode 259, Nero is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 130), Nero's birthday is revealed.", "elements": []}, {"text": "↑ One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 517, two years pass in the storyline.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0401), Information about Nero is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 39 Chapter 373 and Episode 262.", "elements": []}, {"text": "↑", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 39 Chapter 370 and Episode 259.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 39 Chapters 369–370.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 39 Chapters 372–373.", "elements": []}]}], "images": []}]}