{"sections": [{"title": "Kumadori", "level": 1, "content": [{"type": "paragraph", "text": "Kumadori is a former member of CP9 and one of the last agents to be introduced. He is the son of Kumadori Yamanbako and one of the few characters without a known first name."}, {"type": "paragraph", "text": "He was one of the major antagonists during the Enies Lobby Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is recognizable by his large frame, huge mane of pinkish hair, and a right eye that rarely seems to be open. His body positions (especially his penchant for holding one hand out in front of him) are also reminiscent of mie poses, and his vocal inflection is similar to that of kabuki actors. Also, in one of the covers of CP9's Independent Report, Kumadori is shown to have four scars: two large ones on his torso and a pair of smaller ones on his left arm. Like other CP9 agents, he wears a black suit, black pants, black shoes and a black shirt, but Kumadori wore a green tie. He also wore hand guards covering the backs of his hands that were tied around his palm."}, {"type": "paragraph", "text": "In the SBS Volume 44, it was revealed that Kumadori has been wearing his kabuki-style makeup since his youth and had his left eye closed instead of his right."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kumadori is, overall, an eccentric character, perhaps the most within CP9. He seems to honor the samurai code of honor very heavily as he comically attempts to take his own life after dishonoring himself. As he accepts the blame for nearly anything, even the faults of others, this happens quite often in his appearances. Before he commits seppuku, however, he instinctively uses Tekkai, unintentionally saving his own life in a rather comical way. He thinks \"real men\" shouldn't cry or give up, which is why he kept fighting, even when confronted against Chopper's monster form. Kumadori also tried to keep Chopper from crying and from giving up because of his ideals."}, {"type": "paragraph", "text": "He also seemed to be the most obedient and dutiful of the CP9 agents as he was the only one who intervened to help Spandam while he was attacked by Franky and knocked the cyborg away from his superior though he also ironically send Spandam crashing in the process, causing him more injuries."}, {"type": "paragraph", "text": "Kumadori resembles a character in kabuki (traditional Japanese theater). He is a very loud character, and often punctuates his sentences with a loud, dramatic \"YOYOI!!\" He has a strange way of speaking, talks rather slowly and tends to repeat or draw out syllables and words in the manner of kabuki actors. He also has a penchant for spouting haiku, even during battles and at other inappropriate times. He often makes references to his \"mother in heaven\", Kumadori Yamanbako, then begins to sob, even while fighting. Before killing his opponents he often asks them to visit his mother in afterlife and tell her that he is okay. He claims her \"divine protection\" is the reason for his failure at committing seppuku. However, according to Oda in SBS Volume 44, his mother is still alive."}, {"type": "paragraph", "text": "Kumadori claims to be a Sennin (仙人, Sennin a type of hermit in Japanese folklore who can control even their body's autonomic functions, as well as live forever), which explains his ability to suddenly gain or lose weight by controlling the digestion and absorption of food, and the ability to control his hair."}, {"type": "paragraph", "text": "He was also fond of his fellow CP9 agents as he helped raise money to pay for Lucci's treatment after his fight with Luffy and enjoyed spending time with his comrades at St. Poplar."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a full-fledged member of CP9, Kumadori possesses great superhuman strength, with a Doriki of 810. His fighting style consists of combining his martial arts with his staff and bodily manipulation skills to increase versatility and destructive powers."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Kumadori has mastered all six techniques of Rokushiki, having a Doriki of 810. He usually combines his skills with his staff and Seimei Kikan to increase versatility."}], "images": []}, {"title": "Seimei Kikan", "level": 3, "content": [{"type": "paragraph", "text": "As a hermit, Kumadori can use Seimei Kikan to control his bodily functions to his desire. His main style of combat is to manipulate his hair to grasp his opponents or compress them into hands. He can also allow himself to digest food in an instant and losing all the excess weight at once."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Kumadori wields a staff, known as a Khakkhara (錫杖, shakujō, literally meaning \"tin stick\"), which he uses in conjunction with his Rokushiki. He can utilize his superhuman strength to stab the blunt end of the staff with tremendous force, capable of shattering stone."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Shigan Cue (指銃 , Shigan Kyū, literally meaning \"Finger Gun: Cue\"): In this attack, Kumadori uses his blunt staff in the same way a finger is normally used in Shigan. The Q in the name is a reference to a pool cue, which is held in the same manner that Kumadori wields his staff. In the Viz Manga, this is called Finger Pistol Q.", "elements": []}, {"text": "Shishi Kebab (, Shishi Kababu, literally meaning \"Lion Kebab\"): Kumadori heats up the tip of his staff (possibly by using friction with his superhuman strength) and creates a fireball on that tip. He can shoot these fireballs as projectiles at his opponent at fast speeds, as well as use them to boost the destructive power of his staff's strikes. The name is a pun on lion (shishi) and shish kebab, which is a food made through a method similar to how the attack is performed. In the Viz Manga this is called Shishi Kabob.", "elements": []}]}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Kumadori possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [], "images": []}, {"title": "Before the battle with the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "Kumadori is shown upsidedown on a couch explaining to his boss Spandam with Jabra and Fukurou about how the mission they were on to only kill three people ended up having to kill over twenty due to Fukurou talking about it in the town. Kumadori states he will take responsibility by committing Sepuku and only uses Tekkai when he stabs himself, causing him to get depressed on how he cannot die, prompting Jabra to yell at him to just die. Kumadori and the others greet Lucci and the others after not meeting them in over five years. When Kalifa makes fun of Spandam and keeps stating whatever he does is sexual harassment, Kumadori states how rude she is and decides to commit Sepuku to atone for this and still uses Tekkai causing him to get depressed again. Jabra just states he should die already and Kumadori wonders if it is his mother that is keeping him alive, prompting Jabra to tear up by this and Kumadori asks him is he now understands and Jabra states he does of having the feeling of someone you love taken from you. They both cry and hug each other to a comedic affect over their losses (Kumadori to his mother and Jabra to Gatherine who dumped him) prompting Spandam to be annoyed by their acts. When Spandam calls out to Kumadori to save him from Franky biting on his head, Kumadori does his dance first and saves him (though he ends up causing more injuries to him than Franky did) and Kumadori states there's no need to thank him. He then witnesses Kaku and Kalifa eat the Devil Fruits that Spandam gave them. After Blueno is defeated, Kumadori and the other agents arrive atop of the building and prepare to fight the Straw Hats."}], "images": []}, {"title": "CP9 vs Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "Later, Kumadori meets Nami and tries to fight her. He almost kills her but she escapes due to her jacket coming loose. She tries to ask for where his key is, but his long speech causes her to run away from getting killed."}, {"type": "paragraph", "text": "Chopper then appeared and helped Nami (after Nami had already stolen Kumadori's key) to escape, becoming Kumadori's opponent. Chopper managed to trap Kumadori in the refrigerator, but had to consume a Rumble Ball to do so. When Kumadori broke out and resumed the battle, Chopper concluded that he would need his Arm Point or Horn Point to break Kumadori's tekkai, but due to having consumed a Rumble Ball before, had difficulty accessing the proper forms, leading Chopper to take a heavy beating in the meantime."}, {"type": "paragraph", "text": "Even when Chopper did get the desired form and managed his strongest attack, the damage Kumadori inflicted was enough to cause Chopper to pass out and be defenseless against the battered but not disabled Kumadori."}, {"type": "paragraph", "text": "After taking heavy injuries from Chopper, Kumadori went on a brutal frenzy, attacking Chopper for damaging him so much. On the verge of defeat, Chopper consumed a third Rumble Ball, and his subsequent \"Monster Point\" form severely injured Kumadori. Kumadori fought his best against the monster but was no match and was easily defeated by him. Chopper then threw him all the way back to the courthouse, bloodied and defeated."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b8/Seimei_Kikan_Infobox.png/revision/latest/scale-to-width-down/230?cb=20170331155344", "caption": "Kumadori binds Nami."}]}, {"title": "CP9's Independent Report", "level": 3, "content": [{"type": "paragraph", "text": "He and the other agents were rescued by Blueno's Air Door. Most of them were able to get back up after their fights against the Straw Hats despite their injuries, except for Rob Lucci. He then carries an unconscious Lucci along the Sea Train tracks with the others. Having arrived at St. Poplar with the others, he begins to perform in the street for medical fees as they are no longer connected to the government since Spandam blamed them for the failed mission at Enies Lobby. After paying for Lucci's medical fees, they use the rest to buy clothes and other essentials. Kumadori is seen feeding Hattori as Kalifa reads a book."}, {"type": "paragraph", "text": "Later, Lucci is discharged from the hospital to general celebration. He seemed to enjoy himself as he and the other members of CP9 went bowling, particularly when Kalifa used her explosive strength to smash the bowling ball through the wall (let alone the pins). However, the Candy Pirates appeared and began ransacking St. Poplar. Thus Kumadori, along with the rest of CP9, stopped their bowling match to save the kidnapped citizens by beating up the offending pirates. But Lucci goes too far and kills the captain, which shocks the onlookers, and CP9 realize they cannot stay in the city anymore. However, a little girl gives Kalifa a flower to thank her for saving the town, with Kumadori, Fukurou, and Jabra frightened. Taking this gift and commandeering the Candy Pirates' ship, they sailed back to their homeland."}, {"type": "paragraph", "text": "Upon arrival, they watched the next generation of CP9 agents being trained. As they were watching, they found out the pursuers that Spandam sent had caught up with them. In order to protect their homeland from these people, the agents dealt with them. They are then seen standing on Very Good's ship after dealing with the pursuers. After Lucci gave their former leader a message that they would come back for him someday, the agents commandeered their pursuer's ship and sailed off from their homeland. However, the now planted flower the grateful girl gave them is seen behind the silhouette of their ship in the distance on their homeland."}, {"type": "paragraph", "text": "Like most of his colleagues (with the exception of Spandam, Lucci, Hattori, and Kaku being part of CP-0), his location and allegiance are currently unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Kumadori_Performs.png/revision/latest/scale-to-width-down/230?cb=20130115032724", "caption": "Kumadori performs to earn money."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kumadori vs. Nami", "elements": []}, {"text": "Kumadori vs. Tony Tony Chopper", "elements": []}, {"text": "CP9 vs. Candy Pirates", "elements": []}, {"text": "CP9 vs. Very Good's crew", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces it is revealed that the early concept of Kumadori looked nothing like what he is now. His name was also different; it was originally supposed to be Apollo (アポロ). His body build was not too different from the current version, but he looked more like a gorilla in terms of the body shape, and he had what appears to be face paintings. He somewhat resembles a train conductor with his outfit."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/CP9_Early.png/revision/latest/scale-to-width-down/139?cb=20110509011139", "caption": "Above, Apollo (Kumadori) is at the very left, and below, he is second to the left."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In Volume 44 of the SBS, it is revealed that Kumadori's mother is still alive. However, Kumadori does not seem to know this.", "elements": []}, {"text": "Kumadori's first name remains unknown since with his mother's introduction, \"Kumadori\" is revealed to be their family name.", "elements": []}, {"text": "He has a lion theme, due to his mane-like hair and several attacks containing \"shishi\", or lion. He also tends to compare himself to a lion and gets angry when compared to other animals, such as an octopus.", "elements": []}, {"text": "In the 4th Weekly Shonen Jump Fan Poll to determine the most popular One Piece characters, Kumadori ranked at 122nd.", "elements": []}, {"text": "Kumadori's name most likely comes from the Japanese word kumadori (隈取り, a type of makeup used for kabuki), as his features look very similar to those of kabuki actors in their makeup.", "elements": []}, {"text": "Kumadori's staff is called Khakkhara. It was used by monks as a weapon and the rings were attached so that the jiggling-sound would scare away little animals, to make sure the monk would not accidentally kill them.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Kumadori_Yamanbako_Manga_Infobox.png/revision/latest/scale-to-width-down/150?cb=20130115033607", "caption": "Yamanbako."}]}]}