{"sections": [{"title": "Columbus", "level": 1, "content": [{"type": "paragraph", "text": "Columbus is a member of the Yonta Maria Grand Fleet."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Columbus is a short, young-looking girl with long curly hair. She wears a typical sailor's buttoned jacket with a bowtie, a belt that goes across her chest, and light leggings. She also wears dark boots and a vertically striped bicorne hat with a skull on its front."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Columbus is a loyal and trustworthy girl with some degree of leadership, as Orlumbus trusted her to deal with an attacking fleet in his stead. She appears to have the same passion for orderliness as Orlumbus, and is possibly even more fastidious, as she attacked one of her crewmates while on a cleaning check while berating the cleaners' performance."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Columbus was trusted by her captain to handle an attack by a large fleet, indicating a sense of trust in her skills. She appears to hold authority over her crewmates, as evidenced by her leadership role on Dressrosa and when she performed cleaning checks alongside Orlumbus."}, {"type": "paragraph", "text": "She also carries a sword and pistol with her, but it is unknown how proficient she is with them."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Columbus was trusted by Orlumbus to take care of the large fleet of enemies while her captain was forming the Straw Hat Grand Fleet with the other captains."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "As the Yonta Maria Grand Fleet set sail from the Standing Kingdom as a pirate crew, Columbus and Orlumbus performed a cleaning check of their ship, and Columbus attacked one of the cleaners in disapproval of the job he did. She was later seen in her captain's quarters as Orlumbus began writing a pirate behavioral guide."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "While Orlumbus' name is based on that of Christopher Columbus, Columbus is named directly after the famous explorer.", "elements": [{"text": "Orlumbus is a pun on \"Columbus\" and Ō, which means \"big\" in Japanese. On the other hand, co/ko, means \"small\" in Japanese, in reference to her size compared to him.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 90 Chapter 906, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 36, Columbus is first seen.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 800 (p. 6-7) and Episode 745, Columbus is mentioned.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 800 (p. 10-11) and Episode 745, Orlumbus swears loyalty to Monkey D. Luffy.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 908, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 38.", "elements": []}]}], "images": []}]}