{"sections": [{"title": "Jack", "level": 1, "content": [{"type": "paragraph", "text": "Jack the Drought is an All-Star of the Beasts Pirates, one of Kaido's three closest confidants, known as the Disasters, and the captain of the Mammoth. He is also currently considered as the ruler of the region of Kuri in Wano Country. He is also a giant grouper fish-man."}, {"type": "paragraph", "text": "He was first briefly mentioned when being notified of Caesar Clown's capture by viewers of Caesar's broadcast of the Punk Hazard incident. Due to his actions and role, he is the primary antagonist of the Zou Arc, and a major antagonist in the Wano Country Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jack is a giant grouper Fish-man of massive stature, dwarfing his crewmates and even the very large minks Inuarashi and Nekomamushi. However, while still being immensely muscular, Jack's limbs are disproportionately small when compared to his enormous torso (though their size is greatly increased in the anime, especially his arms). He wears a metallic jaw mask that seemingly disappears when he transforms into his mammoth form, and has a pair of horns on each side of his head. His blond hair is worn in a ponytail and a pair of long braids. He wears a dark, sleeveless, feathery coat similar to Kaido with spiked pauldrons on his shoulders, circled by a belt bearing his crew's Jolly Roger."}, {"type": "paragraph", "text": "When using Koro on the Minks, he wears a hazmat suit and wears a glass helmet around his head."}, {"type": "paragraph", "text": "He has bloodshot orange eyes and a veined forehead. He has two piercings in his right ear, and wears spiked pauldrons on his shoulders. He carries a pair of tusks around his neck which are actually sheathes containing his scythe-like blades. His mouth contains pointed teeth but while in his mammoth form he has square teeth."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jack is violent and short-tempered, as one of his subordinates worried how Jack would react once he learned about Caesar's downfall. He threatened to destroy an entire city should he not get what he wanted, and made good on his word, saying that it was the citizens' own fault because they did not comply. His ruthlessness extends to even attacking children and the elderly. He has even admitted that he has a love for causing destruction, even when there is no real benefit to it. Those who have witnessed Jack's personality in person describe these traits as madness."}, {"type": "paragraph", "text": "He is also extremely sadistic, willing to torture enemies in order to get what he wants. He is barbaric and brutal to the point of hacking off limbs and creating terrible bloodshed, only ceasing his carnage when he has more urgent matters to attend to. When Jack attacked the giant elephant Zunesha, he was determined to get to its head and came up with several horrendously cruel things he and his underlings could do to kill it."}, {"type": "paragraph", "text": "He is extremely stubborn and unreasonable. When the minks tried to tell him that Raizo was not on Zou, Jack refused to listen to or believe them, and continued to refuse when Inuarashi offered to let him search the island without any resistance to see for himself. This, along with him disregarding his crew's comment that attacking Doflamingo's convoy was dangerous, proves that he refuses to listen to logic, to the point where he actually becomes enraged when someone tries to reason with him, having no patience for civil conversations. Jack's lack of reason makes him very headstrong and reckless, as he decided to attack a convoy of four Marine ships, which were carrying powerful Marines, to rescue Doflamingo."}, {"type": "paragraph", "text": "He is not above fighting dirty in order to achieve his goals, as he brought in Caesar's gas weapon, Koro, to annihilate Zou after the minks put up a formidable fight against his forces, simply because he was losing his patience and not because he was in any actual danger of losing. He is also strategic, and desires to use the most effective methods possible to win. Upon his return to Zou, he decided to outright kill Zunesha, the elephant carrying Zou, to destroy the country in the quickest way he could and avoid having to fight the minks again while ensuring they were finished off for good. Jack is very thorough in battle, wanting to make sure his opponents are completely annihilated and presuming that they will return to full strength otherwise. Additionally, he does not tolerate it when his subordinates fail their missions, having brutally punished Sheepshead for not finding Raizo."}, {"type": "paragraph", "text": "Despite his brutal and sadistic tendencies, Jack has no love for mindless violence, as he became greatly concerned when Kaido went on a drunk rampage through Kuri and threatened the citizens that Jack valued as factory workers. He also acts respectfully to those who are not his enemies and have done nothing to annoy him. He can be subservient to those he acknowledges as stronger than him, such as his fellow All-Stars King and Queen, accepting insults from them and only replying with a quiet apology, or outright fearing his general Kaido."}, {"type": "paragraph", "text": "Jack does not appear to care about titles or fame, as he got annoyed with his subordinates for boasting about his position and bounty. However, he is still prideful, as he got angry when he read the news report about his apparent death."}, {"type": "paragraph", "text": "Although Jack is normally calm and immovable, he is still capable of feeling real fear if he is vastly overpowered and left in a helpless situation. When Zunesha swung its trunk at him and his fleet in order to repel them, Jack began sweating in fear and watched the massive limb darken the sky above his fleet with his eyes bulging in panic. Jack even trembled in the face of his general Kaido. Likewise, he was rather apprehensive when Queen brought Big Mom to Onigashima."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/66/Jack%27s_Temper.png/revision/latest/scale-to-width-down/210?cb=20161119234342", "caption": "Jack displaying his wrathful nature."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Jack's subordinates are incredibly loyal to him, but whether Jack respects his subordinates or not is largely unknown. He does seem to become annoyed with them at times, such as when they mentioned his bounty to the minks. He has also put them in unnecessary danger at times, having ordered them to attack the powerful minks when they could have entered peacefully. However, his subordinates also seem to love battle to some degree and did not have any protesting opinions. When Jack decided to attack Doflamingo's Marine escort, they were scared of the Marines' power and advised Jack to turn back, but he became annoyed and ignored their pleas."}, {"type": "paragraph", "text": "They appear to be very proud of Jack's reputation and bounty, ranting about it to the Mink Tribe. However, one of Jack's crewmates was scared of what he would do after he found out about Caesar Clown's defeat, suggesting a relationship of both respect and fear."}, {"type": "paragraph", "text": "Jack does not tolerate it when his subordinates fail a mission or end it prematurely, as he severely punished Sheepshead for leaving Zou without finding Raizo, with Ginrummy who is too afraid to reveal that they ended the mission because the Straw Hat Pirates drove them off. He is also very sarcastic towards them when they say things he feels obvious or stupid."}], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "Jack is one of Kaido's three right-hand men, implying that the Yonko has great trust in him and his power. However, upon hearing of Jack's failure to rescue Doflamingo, Kaido seemed more concerned with the loss of his SMILE supply than with the loss of his subordinate. Jack is shown to be afraid of his superior as when Kaido appeared in dragon form, Jack trembled. While stern and sometimes outright cruel to his subordinates, Jack remains subservient to those of higher rank or strength than him, such as fearing Kaido's drunk temper and promising to heed his command of locating the enemy. Also, despite his own bloodthirsty and stubborn nature, Jack believes his own captain is completely insane especially when drunk."}], "images": []}, {"title": "King and Queen", "level": 4, "content": [{"type": "paragraph", "text": "Even though Jack is looked down on and insulted by the two of them, he does not seem to resent but respect them instead. Jack respectfully calls them \"Big Brothers\", showing that they are superior to him. This was shown when he apologized to King and Queen when they insult him with an angered expression. Jack is shown to accept their mockery and does not protest. He is considered by them to be the weakest of the three All-Stars and was constantly looked down by them for it."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Via Kaido, Jack is allied with Donquixote Doflamingo, and was willing to retrieve the former Shichibukai from the Marine convoy carrying him, despite the powerful Marines guarding him. It was Doflamingo's defeat and capture that made Jack abandon Zou before he could completely destroy what was left of the island."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Mink Tribe", "level": 4, "content": [{"type": "paragraph", "text": "Jack was responsible for torturing several minks and laying waste to the Mokomo Dukedom. As such, he became hated and feared by the Mink Tribe, who have no intention of ever forgiving him; this also extends to Pekoms of the Big Mom Pirates, who was enraged that Jack ransacked his homeland."}, {"type": "paragraph", "text": "After failing to rescue Doflamingo, Jack returned to Zou with the intention on exterminating the minks completely just to prevent them from seeking revenge."}], "images": []}, {"title": "Raizo", "level": 4, "content": [{"type": "paragraph", "text": "Due to Raizo's connection with the Kozuki Family and Kaido's goal in obtaining the secret his master, Kozuki Oden, possessed, Jack went to great lengths to find the ninja and nearly reduced an entire country to rubble in the process."}], "images": []}, {"title": "Zunesha", "level": 4, "content": [{"type": "paragraph", "text": "During his second attack on Zou, Jack decided to slaughter the minks by bringing down the giant elephant carrying their civilization, Zunesha. He planned to force the elephant to its knees in order to reach its head and kill it in sadistic ways. However, Zunesha was determined to protect the minks and with Momonosuke's help, it gained permission to attack and annihilated Jack's fleet with one swing of its trunk. When Zunesha was swinging its trunk, Jack was left paralyzed in extreme fear as it destroys his fleet."}], "images": []}, {"title": "Ashura Doji", "level": 4, "content": [{"type": "paragraph", "text": "To the Beasts Pirates, Ashura Doji is well known as Shutenmaru. In their meeting, Jack brought up how Kaido wanted the thief to be a subordinate of the Beasts Pirates. Ashura refused and had no qualms in attacking Jack, with both dealing serious wounds to each other."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "As Big Mom is a rival of his general, Jack sees her as an enemy. He was more apprehensive than dominating when in her presence, even questioning Queen's motive for bringing her to their base of operation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being an All-Star of the Beasts Pirates, Jack has great authority over his crew just below his Govern-General. Jack also has authority over the region of Kuri in Wano Country, and its residents greatly fear him. In spite of his great strength, Jack is implied to be weaker than fellow All-Stars King and Queen, who both looked down upon him."}, {"type": "paragraph", "text": "His epithet is named for the fact that when he rampages on an island, it is left in a decaying state like it is suffering a drought. His bounty of 1,000,000,000 indicates that the World Government considers him extremely dangerous and threatening to their operations. He managed to sink two of the four Marine battleships that were part of Doflamingo's escort, and despite ultimately being defeated by the entire fleet carrying Vice Admirals Tsuru, Bastille, and Maynard, Admiral Fujitora, and former Fleet Admiral Sengoku; Jack survived the battle while only sustaining minor injuries."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "He possesses tremendous strength and endurance, which is enhanced by his fish-man heritage. He has fought equally with the Mink Tribe, primarily its two rulers Inuarashi and Nekomamushi, for five days and five nights without taking a break; meanwhile, the Minks, specifically Inuarashi and Nekomamushi, took turns every twelve hours. Although the Minks eventually gained the upper hand, they were never able to suppress Jack himself. Jack was shown to possess tremendous durability, having survived being hit by Zunesha's trunk with it only temporarily knocking him out despite it sinking his whole fleet."}, {"type": "paragraph", "text": "Since he is a Devil Fruit user, he has lost the ability to swim, but he can still breathe underwater."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Jack is highly proficient in dual wielding his Shotel blades, able to fight equally with Nekomamushi and Inuarashi, the two strongest minks in the Mokomo Dukedom, in one-on-one combat. He was also capable of fighting evenly against the renowned thief Shutenmaru, whom even Kaido had taken an interest in, and managed to injure Shutenmaru before their fight was cut short. Notably, even though Shutenmaru had managed to cut off most of the blade on one of his shotels, Jack was still able to fight competently with the short remainder of its blade."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Jack has eaten the Ancient Zoan-type version of the Zou Zou no Mi, which allows him to become a mammoth, granting him immense size and strength; in this form, he leveled part of a city by simply swinging his trunk."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Jack%27s_Mammoth_Form.png/revision/latest/scale-to-width-down/200?cb=20161010022211", "caption": "Jack's full mammoth form."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Jack wields two blades which he uses when in his human form. He keeps them hidden and sheathed as the tusks around his neck. Though they resemble Shotels when seen from the side, they appear even more twisted, akin to his mammoth tusks, when viewed from the front."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Jack%27s_Weapons.png/revision/latest/scale-to-width-down/190?cb=20161009155012", "caption": "Jack's blades."}]}, {"title": "Koro", "level": 4, "content": [{"type": "paragraph", "text": "Jack had access to Koro, Caesar Clown's poison gas weapon, during his invasion of Zou. He used its power to overwhelm the minks and destroy Kurau City after losing his patience from five days of battling. He (and the platoon he brought along with) also had a hazmat suit to protect himself from the gas."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Destruction of Zou", "level": 4, "content": [{"type": "paragraph", "text": "Seventeen days before Monkey D. Luffy and Trafalgar Law's arrival at Zou, Jack and his men broke through the gate to the Mokomo Dukedom, leaving it in ruins and severely injuring the guards. Jack and Sheepshead told the minks to hand over a ninja known as Raizo. The minks did not comply, causing an irritated Jack to destroy several buildings with his trunk. As the minks still denied any knowledge of Raizo, Jack ordered the Pleasures to lay waste to the country. However, the minks easily fended them off with Electro, and Monjii warned Jack that every mink was a natural-born warrior ready to fight. When Monjii asked Jack to talk with the duke, Jack refused before ordering the Gifters to attack."}, {"type": "paragraph", "text": "As Jack's subordinates were battling the Musketeer Squad, Duke Inuarashi arrived to confront Jack himself. Inuarashi tried to reason with Jack by promising that he would be allowed to search for the ninja if he ceased the destruction, but Jack responded by attacking Inuarashi with his trunk. After Inuarashi easily blocked the strike, he and Jack fought until 6pm arrived. After Inuarashi and his group left the battlefield, Master Nekomamushi arrived and slammed Jack into the ground, prompting Jack to return to his human form and prepare to continue the battle."}, {"type": "paragraph", "text": "The battle against the Mink Tribe lasted for five days, with Inuarashi and Nekomamushi's forces taking turns fighting with each passing day and night. Even though the minks had the upper hand against Jack's continuous forces, they were unable to overwhelm Jack himself. On the fifth day of the battle, Jack finally lost his patience and used Koro to claim victory by poisoning the minks. With the Mink Tribe rendered helpless, Jack tortured the strongest of them for information concerning Raizo, taking a leg from Inuarashi and an arm from Nekomamushi. The following day, Jack heard about Doflamingo's defeat and capture and promptly left Zou to rescue him, leaving behind some of his subordinates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/25/Jack_Attacks_Mokomo_Dukedom.png/revision/latest/scale-to-width-down/210?cb=20160926022551", "caption": "Jack attacks the Mokomo Dukedom."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Inuarashi_vs._Jack.png/revision/latest/scale-to-width-down/190?cb=20161119231540", "caption": "Jack battles Inuarashi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/20/Mokomo_Dukedom_Poisoned.png/revision/latest/scale-to-width-down/210?cb=20161119234238", "caption": "Jack uses Koro to claim victory over the Mokomo Dukedom."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "A few days later, Jack tailed the four Marine Ships that were escorting Doflamingo to Impel Down. Despite warnings that powerful Marines were guarding him, Jack refused to leave and prepared to attack the Marine ships."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the attack on Doflamingo's Marine escort, it was reported that Jack succeeded in sinking two of the ships, but ultimately fell to the Marines. However, the news was unable to completely confirm his death."}, {"type": "paragraph", "text": "Contrary to what was reported, Jack survived the battle, but sustained some injuries, resulting in him being bandaged and resting after the fight. While sailing back to Zou with his fleet and his damaged ship, Jack read the newspaper that explained his supposed death before angrily shredding it."}, {"type": "paragraph", "text": "When Sheepshead and his group returned to Jack with a report that Raizo was not at Zou, Jack was displeased and brutally punished Sheepshead before hanging him upside down. Soon afterward, Jack returned to Zou, intending to completely annihilate the Mink Tribe by killing the giant elephant carrying Zou."}, {"type": "paragraph", "text": "Jack commenced his attack, having his men assault the elephant's leg with cannon fire. However, Kozuki Momonosuke ordered Zunesha to attack the Beasts Pirates. Obeying Momonosuke, the elephant attacked, swinging its trunk at the fleet. Jack stared at the advancing trunk frozen in complete terror, incapable of doing anything to stop the attack, while his subordinates fled for their lives. Zunesha's trunk struck Jack, shattering his mask and knocking him out, and all of his ships were sunk in a single blow."}, {"type": "paragraph", "text": "Jack sunk underwater with the fleet's wreckage, but was still alive. Immobilized in the ocean due to being a Devil Fruit user, Jack impatiently waited for someone to pull him out."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/29/Jack_Recovering.png/revision/latest/scale-to-width-down/210?cb=20161211222233", "caption": "Jack reading about his apparent death following Doflamingo's failed rescue."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b3/Jack_And_His_Crew_Defeated_By_Zunesha.png/revision/latest/scale-to-width-down/210?cb=20170205013105", "caption": "Jack being hit by Zunesha's trunk."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Jack was eventually rescued from his predicament, and he returned to Wano Country prior to Luffy's arrival. He was notified about Holdem's defeat at the hands of Luffy and Roronoa Zoro."}, {"type": "paragraph", "text": "Jack later went to Okobore Town to search for Luffy, but he encountered a thief known as Shutenmaru. Jack told the thief to become Kaido's subordinate, but the latter responded by slicing Jack, initiating a fight. The duel was interrupted when Kaido appeared and ordered Jack to bring Luffy and Law to him. Jack then noticed that Kaido was drunk and was afraid that he would go on a rampage. Hawkins then arrived and directed Kaido's attention to Oden Castle before explaining to Jack his reasons for doing so. After Kaido destroyed Oden Castle, Jack commented that Kaido was crazy."}, {"type": "paragraph", "text": "Back at Onigashima, Jack was scolded by fellow All-Stars King and Queen because the offerings from Kuri had been decreasing lately. Cowering at the presence of his superiors, all Jack could do was quietly apologize."}, {"type": "paragraph", "text": "After Big Mom was brought to Onigashima, Jack asked Queen his reason for bringing her and Queen angrily answered that communications in Udon were cut off."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Shutenmaru_Attacks_Jack.png/revision/latest/scale-to-width-down/200?cb=20181123210643", "caption": "Jack struck by the bandit Shutenmaru."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Beasts Pirates vs. Mink Tribe and Heart Pirates", "elements": [{"text": "Jack vs. Inuarashi (multiple times)", "elements": []}, {"text": "Jack vs. Nekomamushi (multiple times)", "elements": []}]}, {"text": "Jack vs. Doflamingo's Marine escort (not shown)", "elements": []}, {"text": "Beasts Pirates vs. Zunesha", "elements": []}, {"text": "Jack vs. Shutenmaru", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Jack vs. Shishilian", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jack's bounty was the first bounty shown in the series to exceed nine figures.", "elements": []}, {"text": "Following the naming theme of the Beasts Pirates, Jack's name is an allusion to the \"Jack\" rank of a playing card, a trait shared with \"Joker\".", "elements": []}, {"text": "Jack shares his name with \"Calico\" Jack Rackham, a notorious pirate from the early 1700s.", "elements": []}, {"text": "Jack is the first main antagonist of an arc who did not interact with Luffy or any of the Straw Hat Pirates.", "elements": []}, {"text": "He is the second known fish-man to consume a Devil Fruit, the first was Vander Decken IX.", "elements": []}, {"text": "He is also the second known fish-man shown to lack webbed hands, the first was Karma.", "elements": []}, {"text": "Jack's favorite food is elephant meat steak.", "elements": []}]}], "images": []}]}