{"sections": [{"title": "Bakkin", "level": 1, "content": [{"type": "paragraph", "text": "Miss Bakkin is a former pirate and is the self-proclaimed lover of Edward Newgate and is the mother of Edward Weevil, a former Shichibukai."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bakkin is a short, elderly woman with blonde hair. On her shirt, she sports a skull symbol that is similar to the Whitebeard Pirates' jolly roger, except that it has pigtails and no crossbones. She wears a green hat, a pair of sunglasses and a leopard-print vest."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Claiming herself to be Whitebeard's lover, she believes that she and her son have the right to inherit Whitebeard's fortune. She seems to be quite greedy and manipulative, believing that money is what matters in the world, and swaying her son to follow her plans rather than his own for her alleged lover's \"fortune\". She also finds revenge unnecessary, because there is no money to be gained from it."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Edward Weevil", "level": 4, "content": [{"type": "paragraph", "text": "Edward Weevil is Bakkin's son whom she dearly doted on, referring Weevil as her treasure. Weevil is very obedient to her and is constantly being manipulated by her."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Bakkin believes that the Whitebeard Pirates are a \"make-believing family\". She and Weevil are hunting the remnants of the Whitebeard Pirates and need to find the 1st divison Commander Marco to claim Whitebeard's \"fortune\". She is unaware that Whitebeard left them nothing."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Because Marco and the Whitebeard Pirates protected Luffy during the war at Marineford, she and Weevil decided to chase him down for Marco's whereabouts."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "Bakkin was somewhat acquainted with Whitebeard, having been a fellow crewmember with him approximately 40 years ago. While the extent of their relationship is unknown, Bakkin claimed to be the woman that Whitebeard loved the most."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "During her pirate career around 40 years ago, Bakkin was on the same ship with Newgate."}], "images": []}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "She first appeared after her son, Edward Weevil, decimated A.O's crew. She told her son that they must find Marco in order to acquire the late Whitebeard's fortune. When Weevil suggested hunting Blackbeard instead, she quickly scolded him for wanting revenge. She received a newspaper from a News Coo and was shocked by Donquixote Doflamingo's defeat at the hands of Monkey D. Luffy. Knowing about Luffy's connection to the Whitebeard Pirates, Bakkin decided to search for Luffy, hoping that he would have information on Marco."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Shichibukai system was abolished, Bakkin and Weevil found themselves confronted by the Marines. Seeing that they were no longer allies, Bakkin gave Weevil permission to fight them."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "When Bakkin makes her debut and apologizes to her son, as she tells him, \"Because, I love you!!\", the phrase is shown in katakana.", "elements": []}, {"text": "\"Bakkin\" can translate to mean \"fine\" or \"penalty\", befitting her greedy nature.", "elements": []}, {"text": "At 2 feet and 3 inches, she is the shortest adult human in One Piece.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 802 (p. 9-11) and Episode 752, Bakkin makes her first appearance.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 909 (p. 7), Bakkin revealed to be a former pirate.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0948), Information about Bakkin is revealed.", "elements": []}, {"text": "↑  https://one-piece.com/special/sbs/detail/3.html/", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 802 (p. 11) and Episode 752, Bakkin reprimands Weevil.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 909.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 909.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956 (p. 17).", "elements": []}]}], "images": []}]}