{"sections": [{"title": "Edward Weevil", "level": 1, "content": [{"type": "paragraph", "text": "Edward Weevil, or \"Whitebeard Jr.\", is the self-proclaimed son of \"Whitebeard\" Edward Newgate and was one of the Shichibukai, until the organization's dissolution. His mother is Miss Bakkin, the self-proclaimed lover of Newgate. He was first mentioned by Commodore Brannew in a discussion of the current Shichibukai ranks to several high-ranking Marine officers, but was not explicitly named until after Donquixote Doflamingo's defeat."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Weevil has a stocky figure, with prominent scars going down his left eye, across his neck and around his left arm. He has bushy blond hair with two braids coming down either side of his face and similar to his self-proclaimed father, has a black bandanna and white crescent-shaped mustache which is even larger than Edward Newgate's. His legs are disproportionately small for his build and his nose also appears to be perpetually runny, evocative of his simple-minded nature. He wears overalls that are hung by chains rather than straps and bear his personal jolly roger on them."}, {"type": "paragraph", "text": "Incidentally, from behind, his appearance is similar to that of Oars or Little Oars Jr., with his large build, thick mane of hair, and his exaggeratedly long mustache which (from behind) resembles horns. They even share jagged teeth, square jaw and a scar running down the left side of their face, as well as stick-like legs in comparison to the rest of their bodies."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/Edward_Weevil_Anime_Full_Body.png/revision/latest/scale-to-width-down/210?cb=20160805233840", "caption": "Weevil's color scheme in the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Edward Weevil is a violent man as he left destruction in his wake when hunting Whitebeard's crew and allies."}, {"type": "paragraph", "text": "He is not very bright as he had a hard time telling the difference between a mirror and a photograph. As a result, he is constantly manipulated by his mother, making him believe that he is the rightful heir of the Whitebeard Pirates' fortune, not the members of the Whitebeard Pirates, to whom he believed (influenced by his mother) are unworthy. He also talks in a whiny, snot-nosed manner, making him sound like both a little kid and a simpleton. Though his claims are widely doubted, at the very least, he seems to genuinely believe them to be true."}, {"type": "paragraph", "text": "Unlike his alleged father, Weevil does not hold concepts of family in the same regard, believing that his alleged blood heritage is what makes him true family, not bonds built on friendship and camaraderie. Because of this, he violently attacked all those once affiliated with Whitebeard."}, {"type": "paragraph", "text": "He also holds grudges, as he wanted to avenge his alleged father's death upon Blackbeard, but was convinced by his mother that revenge is not important."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Bakkin", "level": 4, "content": [{"type": "paragraph", "text": "Miss Bakkin is Edward Weevil's mother. Both of them are Whitebeard's self-proclaimed family by claiming themselves as his biological family. They are hunting the remnants of the Whitebeard Pirates and their allies to take Whitebeard's \"fortune\". Weevil is extremely obedient to his mother and is constantly being manipulated by her."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Edward Weevil claimed to be Whitebeard's biological son, but the Whitebeard Pirates refused to believe him and said the only sons that Whitebeard had are the Whitebeard Pirates. He defeated 16 crews of Whitebeard's old allies. He and his mother are hunting the 1st division Commander Marco \"The Phoenix\" to claim Whitebeard's \"fortune\"."}], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Edward Weevil holds a grudge against the Yonko Blackbeard for killing his so-called \"father\" Whitebeard. He wants to kill Teach at any costs to avenge his alleged father Whitebeard's death, but his mother, Bakkin, suggested that revenge is not important."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Because Marco and the rest of the Whitebeard Pirates protected Luffy during the war at Marineford, Weevil and his mother decided to go after Luffy for Marco's whereabouts."}], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "As one of the Shichibukai, Weevil was an ally of the World Government, but he does not seem to take orders from them. During the timeskip, he had a bounty of 480,000,000 until he was invited by the World Government to become one of the Shichibukai. He accepted the offer, but he caused too much catastrophe and killed over 600 civilians, causing great concern for the Marines."}, {"type": "paragraph", "text": "Due to the Shichibukai being obsolete, he is now an enemy to the government once again as the Marines waste no time trying to arrest him. Weevil is infuriated about this as he is ready to take them down."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "Edward Weevil claimed to be the late Whitebeard's biological son, believing that it makes him special. However, his claim is heavily questioned by others. He initially wanted to avenge Whitebeard's death at the hands of Blackbeard until his mother told him that revenge was not important."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Weevil's powers have been praised by Borsalino who compared his abilities to that of a younger Whitebeard, his alleged father. He was able to single-handedly defeat 16 pirate crews affiliated with Whitebeard, including the A.O Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Like his alleged father Whitebeard, Weevil wields a naginata as a weapon of choice."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Weevil possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Weevil proclaimed that he is the son of Edward Newgate, a claim that is heavily questioned by others. He eventually joined the Shichibukai sometime during the timeskip."}, {"type": "paragraph", "text": "During the timeskip, Weevil fought and destroyed 15 pirate crews that served under Whitebeard, in order to claim Whitebeard's treasure that Bakkin promised him. All of these started as small arguments that turned into large conflicts."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Weevil defeated A.O's crew after a small argument like usual. His mother told him that they must find Marco in order to claim the late Whitebeard's fortune, but Weevil was more interested in taking vengeance on Blackbeard for killing his alleged father. After convincing him otherwise, she then read from a newspaper about how the Straw Hat Pirates defeated Doflamingo and he questioned his mother whether or not to chase after Luffy to get information on Marco."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/73/Weevil_Defeats_A.O_Pirates.png/revision/latest/scale-to-width-down/150?cb=20160731020956", "caption": "Weevil defeating the A.O Pirates."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Shichibukai system was abolished, Weevil and his mother found themselves confronted by the Marines. Seeing that they were no longer allies, Bakkin gave Weevil permission to take out the Marines, which he was happy to do."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Edward Weevil vs. 15 Whitebeard-allied crews", "elements": []}, {"text": "Weevil vs. A.O Pirates", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Weevil's hair and mustache can be seen in Chapter 801 and Episode 746.", "elements": []}, {"text": "Weevil has the highest known former bounty of all the Shichibukai.", "elements": []}, {"text": "He is the last of the Shichibukai appointed mid-timeskip to be revealed, and the most recent Shichibukai to be revealed overall.", "elements": []}, {"text": "He is the only Shichibukai who has not currently been shown as a child.", "elements": []}, {"text": "He is the only Shichibukai who did not participate in the Battle of Marineford.", "elements": []}, {"text": "At the moment, Weevil and Dracule Mihawk are the only Shichibukai who do not belong or have not belonged to a known pirate crew or organization.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e7/Weevil_Before_His_Debut.png/revision/latest/scale-to-width-down/180?cb=20160818082330", "caption": "Weevil before his official debut."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 802 (p. 7) and Episode 751, Weevil makes his first appearance.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 802 (p. 6) and Episode 751, Weevil is confirmed to be a Shichibukai.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 802.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0947), Information about Weevil is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956, Weevil's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956, The Shichibukai are dissolved.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 70 Chapter 700 (p. 13-14) and Episode 629, Brannew discusses the recent events with other high-ranked officers.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 802 (p. 6-7) and Episode 751, Kizaru notes Weevil's incredible strength and his recent string of victories over Whitebeard's former allies.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 802 (p. 7) and Episode 751, Weevil is seen wielding his large naginata.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 802 (p. 7-11), Weevil decimates the A.O. pirates and learns of Doflamingo's defeat at the hands of Luffy.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956 (p. 17).", "elements": []}]}], "images": []}]}