{"sections": [{"title": "Raizo", "level": 1, "content": [{"type": "paragraph", "text": "Raizo of the Mist is a ninja from Wano Country, a comrade of Kin'emon and Kanjuro, a retainer of the Kozuki Family, and a former member of the Kozuki Family Oniwabanshu. He is also a member of the Nine Red Scabbards."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Raizo is very large, standing about as tall as Kin'emon; his head is large enough to carry Luffy, an average sized human. His body is very disproportional, having a very large head with the rest of his body being relatively small in comparison. His hair is styled into six antennae, with three at each side of his head, a small spike on the middle, and a widow's peak. His hairstyle bears some resemblance to Gedatsu. He has bolt-shaped eyebrows and large sideburns. He also has a crescent moon-shaped scar on his forehead. He wears a dark-colored Ninja shozoku robe. As the Straw Hats pointed out, Raizo is very ugly, a fact that Raizo himself acknowledged as his fellow female ninjas of the Wano Country refused to even look at him."}, {"type": "paragraph", "text": "He bears the crest of the Kozuki Family somewhere on his body."}, {"type": "paragraph", "text": "When he was younger, his six antennae hair was shorter and he lacks the scar on his forehead."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Raizo is a reserved individual who takes his profession as a ninja very seriously. He does not like it when people talk about ninja, such as himself, in a joking manner, and can become very emotional about it, but he will gladly demonstrate his skills if coerced enough. Despite his claim that ninja do not say 'Nin Nin', Raizo ended up adopting the phrase in his speech as shown when he demonstrated ninja skills and again when he greeted the minks."}, {"type": "paragraph", "text": "He is also sensitive about his bizarre and ugly appearance and is severely depressed by the fact that the female ninjas also known as kunoichi from Wano Country do not find him attractive and would not even look at him, and does not like it when people point out his ugliness. It was this reason that before meeting Oden, he would kidnap any women he laid eyes upon."}, {"type": "paragraph", "text": "He is extremely kind, noble, and caring, and was so against the fact that the Mink Tribe was sheltering him at the risk of dying, that he had to be chained up to prevent him from fighting and making his presence known. He was worried to the point of tears over the fact the minks were heavily wounded from protecting him. It also moved him greatly that the minks were worried about his safety and glad to see he was okay. His kindness is also shown when the Straw Hats began to depressingly sulk after he refused to demonstrate his ninjutsu skills and immediately relented by showing his skills to them."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "Raizo is very loyal to his masters in the Kozuki Family as well as his fellow retainers and the feeling is reciprocated toward him. Kin'emon and Kanjuro were excited to reunite with him on Zou."}], "images": []}, {"title": "Ninjas", "level": 4, "content": [{"type": "paragraph", "text": "According to Raizo, he has a particular bad relationship with the kunoichis due to their strong disgust and revulsion towards his ugliness, to the point that they refused to even look at him, a fact that greatly depressed Raizo as he could not have any romantic relationships with any kunoichis."}], "images": []}, {"title": "Mink Tribe", "level": 4, "content": [{"type": "paragraph", "text": "Due to their generations-old relationship with the Kozuki Family from Wano Country, the entire Mink Tribe protected the whereabouts of Raizo from Jack, despite the risk of dying and the destruction of their kingdom. However, Raizo did not want them to risk their lives protecting him and would rather turn himself in instead. This forced the minks to chain him to a poneglyph inside a secret area to keep him hidden, but Raizo continually begged for his release and updates on the minks' status."}, {"type": "paragraph", "text": "When the minks happily celebrate his safety and welfare despite being brutalized by the Beast Pirates, Raizo is extremely touched and used a ninja technique to express his gratitude."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Beasts Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Due to his connection to the Kozuki Family, the Beasts Pirates hunted him down for over two weeks and even went as far as to torture Zou's citizens to flush him out."}], "images": []}, {"title": "Fukurokuju", "level": 4, "content": [{"type": "paragraph", "text": "Not much known to Raizo's relationship with Fukurokuju, but Fukurokuju is stated to be Raizo's rival as a ninja."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "In order to restrain him, the minks had to chain him to an indestructible Poneglyph. Despite his large body, Raizo is extremely agile. In the anime, he could leap extremely high and easily perform handsprings, flips, and somersaults with ninja like agility. He also has incredible speed, being able to slip past the Beasts Pirates in the Udon prison executive tower as he was stealing the keys to Luffy's Seastone handcuffs."}], "images": []}, {"title": "Stealth", "level": 3, "content": [{"type": "paragraph", "text": "A testament of his ninjutsu skills in stealth is that Raizo is able to infiltrate the prison in Udon and got close enough to speak to an imprisoned Luffy without the Beasts Pirates knowing. After stealing the keys to Luffy's Seastone handcuffs, he was able to escape the executive tower without getting caught."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Raizo has incredible skills in Shurikenjutsu, throwing multiple shurikens with perfect precision to engrave symbols or words on walls. From a far distance, Raizo could throw to Kawamatsu his sword and key to his handcuffs with great speed and accuracy, allowing the latter to quickly free himself and fight back."}], "images": []}, {"title": "Ninjutsu", "level": 3, "content": [{"type": "paragraph", "text": "As one of Wano's greatest ninjas, Raizo is an extremely powerful master of Ninjutsu (忍術, Ninjutsu), being referred as a genius ninja during his youth. His strength is acknowledged by Orochi himself and is noted to rival even Fukurokuju, the leader of the Orochi Oniwanbanshu. He has several versatile skills such as disappearing in a cloud of smoke, making clones of himself, and throwing shuriken with expert precision."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "list", "elements": [{"text": "Hana Shuriken (華手裏剣, Hana Shuriken, literally meaning \"Flower Shuriken\"): Raizo possesses large quantities of shuriken which he can throw rapidly with expert precision. For example, he can make them form the kanji for \"shinobi\" (忍, \"shinobi\").", "elements": []}, {"text": "Kaminari Shuriken (雷手裏剣, Kaminari Shuriken, literally meaning \"Thunder Shuriken\"): A technique in which Raizo throws several shuriken very quickly. In the VIZ manga, this is called Lightning Shuriken.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Raizo was once a member of the Kozuki Family Oniwabanshu, but over 41 years before the present day, he resigned after being rejected by a kunoichi. He became an infamous mountain bandit in Udon, fighting any man and kidnapping any woman he encountered. However, Kozuki Oden and his followers found Raizo after searching for him, and Raizo decided to join them. After Oden became daimyo of Kuri, Raizo became one of his retainers."}, {"type": "paragraph", "text": "After Inuarashi, Nekomamushi, and Kawamatsu joined Oden, they were running low on funds. Therefore, he and the other retainers attempted to steal money from Yasuie, but they were caught. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Oden and Wano Country. Following Yasuie's advice, they educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "After meeting the Whitebeard Pirates, Oden and his retainers were having a feast with them. Oden said that he wanted to join the crew, but Raizo, Kanjuro, Kin'emon, and Denjiro voiced out against it. After the Whitebeard Pirates left Wano two weeks later, the retainers discovered Oden, Izo, Inuarashi, and Nekomamushi to be missing."}, {"type": "paragraph", "text": "Twenty years ago, after Oden was executed in the Flower Capital by the shogun, Raizo, Kanjuro, Kin'emon, Kiku, Inuarashi, and Nekomamushi escaped the execution site and fled to Oden Castle, but Inuarashi and Nekomamushi were captured by the shogun's forces and were left behind. By the time Raizo's group reached Oden Castle, it had been set ablaze by Kaido. The retainers went inside the castle and found Momonosuke as well as his sister and mother. Toki then sent her son and the retainers 20 years into the future. After arriving at the future, they went around Wano and discovered how much it changed over the years. However, they discovered allies they could still count on and began forming a plan to take back Wano. Momonosuke, Kanjuro, Kin'emon, and Raizo decided to travel to Zou to seek aid from the Mink Tribe, but when they were leaving Wano, they were spotted by the Beasts Pirates."}, {"type": "paragraph", "text": "On the way to Zou, they were shipwrecked, during which Raizo got separated from the others. He later ended up on Zou.Jack attacked the Mokomo Dukedom to find Raizo. The Mink Tribe, being firmly loyal to the Kozuki Family, lied to Jack that Raizo was not on the island, resulting in the near destruction of their civilization. Raizo being unwilling to let his mink comrades risk their lives for him, tried to turn himself in. This led them to chain Raizo up to a poneglyph in a secret room inside the whale-shaped tree in order to keep him hidden."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Retainers_Shipwrecked.png/revision/latest/scale-to-width-down/210?cb=20191126125841", "caption": "Raizo being separated from Momonsuke's group."}]}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "Seventeen days later, the Straw Hat Pirates, Law, Inuarashi, Nekomamushi, and Raizo's samurai comrades visited him in the whale-shaped tree. Raizo wept for the minks, begging them to tell the truth about the country's status and why they did not turn him over. He was overjoyed to see his comrades and was freed from his chains, but grew annoyed as the male Straw Hats told him to perform various ninja arts that they came up with in their imaginations. Eventually, he performed various tricks for them, greatly impressing them."}, {"type": "paragraph", "text": "Raizo, Kin'emon, and Kanjuro then stood outside the Whale Tree. When he saw all the destruction the Beasts Pirates had left behind, Raizo felt deep remorse and swore to repay the Mink Tribe for their selfless actions. When Nico Robin deciphered the red Poneglyph, Nekomamushi called them back in. After Nekomamushi explained to the Straw Hats about the creation of the poneglyphs by the Kozuki Family, Raizo and the samurai revealed that Momonosuke was not able to inherit the knowledge of the poneglyphs and expressed sorrow in explaining that Lord Oden was executed by Kaido and the shogun of Wano Country Kurozumi Orochi."}, {"type": "paragraph", "text": "The samurai and the two rulers of Zou revealed Oden's will to open the country of Wano to the world and to defeat Kaido and the shogun of Wano Country. The samurai also explained that they needed allies which was the reason why they journeyed to Zou. They then formed an alliance with the Mink Tribe and the Straw Hats."}, {"type": "paragraph", "text": "They later left the secret room and Raizo and the samurais explained that they never went with Oden during his travels as leaving the borders of Wano is a crime. While discussing their plans to defeat Kaido, the alliance decided to split up and meet up again at Wano Country. Law agreed to take Raizo and the samurai back to Wano Country in his submarine. Right after they left the Whale Tree, Raizo was overjoyed to see the minks and went to greet them. This joy was short-lived as they felt Zou shaking and heard Zunesha crying."}, {"type": "paragraph", "text": "Zou's shaking was because of Jack returning and assaulting the giant elephant. On Momonosuke's command, Zunesha retaliated and sank Jack's fleet. With the threat of Jack ended, everyone became calm again."}, {"type": "paragraph", "text": "After Momonosuke decided to stay on Zou in order to communicate more with Zunesha, Raizo and his comrades prepare to go back to Wano with Law and Zoro accompanying them. As the Sanji Retrieval Team departed from Zou, everyone, except for the Straw Hat members left behind, was shocked when Monkey D. Luffy jumped off Zunesha with his party."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Raizo_Restrained.png/revision/latest/scale-to-width-down/210?cb=20191126130857", "caption": "Raizo restrained by the Mink Tribe."}]}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Raizo and his group later infiltrated Wano Country, where they remained hidden until the alliance was ready to strike."}, {"type": "paragraph", "text": "After Luffy was sent to a prison in Udon by the Beasts Pirates, Raizo informed the alliance that he would assist with rescuing Luffy. He later infiltrated the prison and while Luffy was working, Raizo appeared beside him and informed him that he located the keys to Luffy's Seastone handcuffs but it was heavily guarded. Raizo then asked Luffy to wait a little longer before vanishing."}, {"type": "paragraph", "text": "Raizo eventually managed to steal the key from the Prisoner Mine executive tower and made his way back to Luffy. However, he then discovered that Luffy was brought before Queen for causing an uproar in the prison. While Raizo was hiding behind a small wagon, Kawamatsu called out to him from a nearby cell."}, {"type": "paragraph", "text": "Raizo told Kawamatsu about the decisive battle during the Fire Festival before the latter asked Raizo to free him from his cell. Raizo was then spotted by the guards, forcing him to disappear in a smokescreen. When Queen had Luffy's handcuffs removed so he could fight in the Sumo Inferno, Raizo was dismayed that he went through a lot of trouble for nothing."}, {"type": "paragraph", "text": "With the key in his possession, Raizo freed Caribou from his cuffs and hid inside his body. After the Sumo Inferno was put on hold for the night, Caribou approached the ring with Raizo. After revealing himself, Raizo reunited with Hyogoro and learned of many potential allies locked in the prison."}, {"type": "paragraph", "text": "During the night, Raizo and Caribou stole Queen's o-shiruko supply and fed it to Luffy and Hyogoro. On the next day, Raizo and Caribou hid in the shadows and noted that Luffy and Hyogoro were obviously going to stand out after eating too much food. Raizo soon tearfully witnessed Shimotsuki Yasuie's execution when it was being broadcasted."}, {"type": "paragraph", "text": "Caribou later told Raizo how Wano Country's communication network operates. While Caribou disabled Udon's communications, Raizo worked on stealing the keys to free Kawamatsu. After Kawamatsu's cell was damaged from a fight between Big Mom and Queen, Raizo jumped out of the Executive Tower and glided into the clearing. As he flew by Kawamatsu's cell, he threw the key to Kawamatsu's handcuffs inside as well as the Scabbard's sword, Soto Muso, enabling Kawamatsu to free himself and fight back against his attackers. With the prisoners turned against Luffy, Hyogoro told Raizo to reveal himself to give them hope, which he did. Raizo then joined Luffy, Chopper, Kikunojo, Hyogoro, and Kawamatsu as they prepared for battle."}, {"type": "paragraph", "text": "As Raizo and his group fought against the Beasts Pirates, Raizo tossed keys to Eustass Kid‎ and Killer. Raizo's group were then cornered by prisoners who were infected with the Mummy virus. Raizo became worried when Luffy made contact with the infected prisoners."}, {"type": "paragraph", "text": "After the prison takeover, the prisoners became skeptical after learning that Luffy is a pirate. Raizo tried to reassure them but he was insulted when the prisoners stated that he always looked like an old man when they expressed doubts about him traveling 20 years in time. Raizo later spoke with Kawamatsu before the latter left to take care of some business."}, {"type": "paragraph", "text": "After Tama tamed Babanuki and had him give a false report to Queen, Raizo was amazed by her ability. He also thanked Caribou for his assistance. Raizo then contacted Kin'emon to inform him of the events that occurred at Udon and discussed with him about the shortage of weapons. He later joined a meeting with several key alliance members at Amigasa Village."}, {"type": "paragraph", "text": "The group then learned from Zoro and Kawamatsu that Hiyori is alive. On the day for the raid on Onigashima, Raizo marched to the rebel meeting place with Momonosuke, Kin'emon, Kanjuro, Kikunojo, Shinobu, Inuarashi, Kawamatsu, and Ashura. The group eventually arrived at the meeting place, but found none of their ships and allies. In spite of this major setback, the Scabbards were still determined to go through with the raid, knowing that they would not get another chance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1e/Raizo_talks_to_Luffy_in_prison.png/revision/latest/scale-to-width-down/220?cb=20181224020454", "caption": "Raizo talks to Luffy in prison."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3e/Luffy%27s_Group_Fights_in_Udon.png/revision/latest/scale-to-width-down/210?cb=20190709072609", "caption": "Raizo and his allies prepare to take over Udon."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Raizo, Monkey D. Luffy, Tony Tony Chopper, Hyogoro, Kikunojo, and Kawamatsu vs. Beasts Pirates (Udon Prisoner Mines)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Raizo appears to be a homage to the depiction of ninja in various media, including that of the Naruto manga series by Masashi Kishimoto.", "elements": [{"text": "His voice actor is the same as the Naruto character, Might Guy.", "elements": []}]}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ninja – Wikipedia article on Raizo's occupation.", "elements": []}]}], "images": []}]}