{"sections": [{"title": "Bariete", "level": 1, "content": [{"type": "paragraph", "text": "Bariete is a monkey mink who guards the gates of the Mokomo Dukedom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bariete is a male mink who looks like a small, humanoid monkey. He wears a striped top hat and a suit."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Bariete_Anime_Concept_Art.png/revision/latest/scale-to-width-down/100?cb=20181221195102", "caption": "Bariete's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He takes his job of guarding the Mokomo Dukedom's gates very seriously, as demonstrated when he became angry and insulted the Straw Hats after they tried to reach Zou without permission. He is also dedicated to his job of ringing the country's bells in the event of guests arriving or enemies invading."}, {"type": "paragraph", "text": "Like a stereotypical monkey, he loves bananas, to the point where he will accept them as a bribe."}, {"type": "paragraph", "text": "He has a habit of saying \"ete\" and finishing sentences with \"degosaru\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a mink, he is a natural-born warrior and can use Electro."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When the Beasts Pirates invaded Zou, an injured Bariete alerted the populace of the invaders by ringing the raid bell."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Bariete was guarding the entry gate to Mokomo Dukedom when he noticed the Straw Hat Pirates and their allies scaling Zunesha's leg. In an attempt to prevent them from entering Zou, he jumped off and crashed into Kin'emon and Kanjuro, causing them to fall with him down to the Thousand Sunny."}, {"type": "paragraph", "text": "The samurai and Bariete later attempted to climb to Zou using a cat created by Kanjuro's Devil Fruit powers, but the attempt failed due to the water from Zunesha's self-washing dissolving Kanjuro's drawing. After this, they went back to the Thousand Sunny and planned to climb up to Zou the next day."}, {"type": "paragraph", "text": "The following morning, they finally reached the top of Zou, where Kin'emon asked Bariete about Raizo. However, Bariete ran away from them and intended to announce their presence to the Mink Tribe. Once he arrived at the Mokomo Dukedom, Bariete rang the Bell of Welcoming, alerting both the minks and the Straw Hats."}, {"type": "paragraph", "text": "When Jack returned, he attempted to destroy Zou by killing Zunesha, who retaliated on Momonosuke's command and sank Jack's fleet with one blow. Having witnessed this, Bariete informed the Mink Tribe of Jack's defeat."}, {"type": "paragraph", "text": "Soon afterward, as the Sanji retrieval team departed from Zou, Bariete and the others were shocked when Luffy jumped off Zunesha with his party."}, {"type": "paragraph", "text": "After the Sanji retrieval team left Zou, Bariete informed Wanda that Carrot went with them and apologized to her for allowing Carrot to leave unnoticed. However, Wanda forgave him, which prompted Bariete to eat happily one of the bananas with which Carrot bribed him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Bariete_Falls_onto_Straw_Hats.png/revision/latest/scale-to-width-down/210?cb=20160213001505", "caption": "Bariete falls onto the Straw Hats."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The \"ete\" part of his name and verbal tic may come from \"etekō\" (猿公, \"etekō\"), a phrase that personifies the monkey.", "elements": []}]}], "images": []}]}