{"sections": [{"title": "Pedro", "level": 1, "content": [{"type": "paragraph", "text": "Pedro of the Treetops was a jaguar mink and captain of the Guardians."}, {"type": "paragraph", "text": "He was the former captain of the Nox Pirates who sailed in search of a Poneglyph, and he earned a bounty of 382,000,000 in the process, but his journey was cut short in Totto Land. He returned to Totto Land to accompany the Sanji Retrieval Team in their quest to rescue Sanji. During the escape from Whole Cake Island, Pedro sacrificed himself to ensure his team's escape, as he believed the Straw Hats will bring about the Dawn of the World."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pedro was a large, male feline mink with spotted fur, white ears, and long, wavy blonde hair. He gave up his left eye to Big Mom during his time as a pirate captain, and afterwards covered his scar with his hair. He also had a torn left ear."}, {"type": "paragraph", "text": "Upon entering Totto Land, Pedro donned a dress shirt with floral-like frills down the middle, a dark cape with the same frills on the edge, and a large dark hat which partially obscures his face. When meeting with the Fire Tank Pirates, he wore a green suit with a black shirt and a red ascot along with a green fedora."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pedro was extremely loyal to whomever he follows, and was often overly eager to use violence to help his allies during tense situations without waiting for discussion. As a Guardian, he was willing to lay down his life in order to defend the Whale Forest against intruders, though he admitted that he and the rest of the Guardians are a bit too sensitive to intruders, and would call off an attack if asked to do so. However, when not on duty as a Guardian, Pedro could be very cautious and distrusting toward strangers, quickly preparing to use force against anyone he feels may be a threat to him and his friends even if they seem to be friendly, as demonstrated during his first encounter with Charlotte Pudding."}, {"type": "paragraph", "text": "He seemed to like standing in trees and other high places, as fitting for his nickname, and was sometimes intense when he got up close to people."}, {"type": "paragraph", "text": "According to Tamago, Pedro used to highly prioritize his own survival when he was a pirate captain. He willingly gave up his left eye in order to prove to Big Mom that he needed to return to Zou alive and witness \"the dawn of the world\". Pedro believed this dream has come to fruition with the Straw Hats, so he was fine with dying as soon as his obligations to the Straw Hats were fulfilled. As a result, he became a rather reckless fighter willing to go great lengths against enemies due to his lack of regard for his own safety."}, {"type": "paragraph", "text": "He was also very perceptive and cautious; he was the only member of the Sanji Retrieval Team to be suspicious of Charlotte Pudding's motives due to her connection to Big Mom, which was later proven correct. He also berated Carrot for stowing away on the journey to Totto Land, reminding her of the danger they were heading into."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a1/Pedro_Threatens_Pudding.png/revision/latest/scale-to-width-down/210?cb=20170507183535", "caption": "Pedro threatens Pudding."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Mink Tribe", "level": 4, "content": [{"type": "paragraph", "text": "Pedro cared about Nekomamushi and Inuarashi, going as far as to beg the Straw Hat Pirates to save them despite being near death himself. He also seemed to have a rivalry with the Captain of the Musketeers, Shishilian."}, {"type": "paragraph", "text": "He is well respected among the citizens who admire his strength. Even members of the tribe that live elsewhere are shown to respect him."}, {"type": "paragraph", "text": "When learning of his demise, they built a grave marker for him on Wano Country, with Wanda, Shishilian, and Carrot honoring him."}], "images": []}, {"title": "Pekoms", "level": 4, "content": [{"type": "paragraph", "text": "Pedro and Pekoms were sworn brothers, and both have an extremely strong bond as Pedro was the only one who could calm Pekoms's mindless rampage in his Sulong form. They once sailed together as the Nox Pirates. Pekoms later left the crew, but after Pedro and Zepo's defeat at Totto Land, Pekoms begged for Pedro's life to be spared, proving that he cared about Pedro. When he heard about Pedro's death, he grieved greatly, and was willing to carry on Pedro's will even though it meant going against his crew. Although they were very close, Pekoms seemed to fear Pedro slightly, as he grew nervous when the two of them reunited on Zou and Nekomamushi stated that Pedro was the only one capable of keeping him under control."}], "images": []}, {"title": "Zepo", "level": 4, "content": [{"type": "paragraph", "text": "Zepo was a member of the Nox Pirates under Pedro. They had a good friendship, since Zepo was the only one who remained with Pedro in the crew while the others left due to a drop in morale. When Zepo died after giving up his lifespan to Big Mom, Pedro cried over his loss. Even when gouging out his left eye to survive, the jaguar mink was still tearing up for Zepo."}], "images": []}, {"title": "Carrot", "level": 4, "content": [{"type": "paragraph", "text": "As a fellow mink, Pedro got along very well with Carrot. In the past, he was the one who gave her gauntlets after he witnessed her lack of talent for swordsmanship. He then repeated the words Gol D. Roger told him in his youth to encourage her to became stronger. When he found out that Carrot snuck aboard the Thousand Sunny, he was worried about her and asked to turn around to bring her back, but after Luffy agreed to let her stay, he commented about her strength, showing a protective yet proud attitude towards her."}, {"type": "paragraph", "text": "When Pedro planned to sacrifice himself for the escape of the Sanji Retrieval Team, he warned Carrot beforehand, expressing his desire for their survival. After his presumable death, Carrot was brought to tears and tried to rush over to him, only to be stopped by Nami. She later charged towards Charlotte Katakuri in her grief."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "When Sanji and his group first arrived on Zou, Pedro realized they were not with Jack and begged them to save Inuarashi and Nekomamushi. He later defended them from a misguided and belligerent Wanda by revealing that they were there to help. When Monkey D. Luffy arrived several days later and entered the Whale Forest without permission, Pedro had the Guardians surround him with the intent to attack, but ordered everyone to retreat after Wanda told him to. When he met the Straw Hats later that night, he apologized for attacking Luffy earlier and thanked them for saving the minks' lives."}, {"type": "paragraph", "text": "Due to Sanji's efforts to help save him and his people, Pedro was very fond of Sanji and was extremely eager and willing to assist the Straw Hats in rescuing him from Big Mom's captivity. Per his request, he joined Luffy's Sanji Retrieval Team in order to fulfill his gratitude."}, {"type": "paragraph", "text": "Pedro and Brook worked well together, with Pedro trusting the other to get the rubbings of the Poneglyphs while he served as a distraction. Pedro later took part in freeing the musician from Big Mom's clutches. When reunited, Pedro was surprised that Brook was successful in his mission even though they faced many risks in completing it."}, {"type": "paragraph", "text": "Believing that the Straw Hats are the people who would lead the world to a new dawn, Pedro was willing to sacrifice his own life for them. During the escape from Whole Cake Island, he attempted to take down Perospero with a suicidal explosion in order to ensure the Straw Hats escape. Though Perospero survived the explosion, Pedro's actions freed his friends and the Sunny, allowing them to escape. The team then grieved over Pedro's death afterwards."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "As a former notorious pirate captain of the Nox Pirates, Pedro was an enemy of the World Government. Despite his intention of being a mere explorer, the government nevertheless placed a bounty of 382,000,000 on his head."}], "images": []}, {"title": "Big Mom Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After he first entered Totto Land as captain of the Nox Pirates, he clashed with the Big Mom Pirates during his search for Poneglyphs. After his defeat, Big Mom was prepared to take 70 years of his lifespan after Zepo reached the \"100 years of lifespan\" on her roulette and died after losing 30 years. However, with Pekoms' pleading and Pedro gouging out his own left eye as compensation for Tamago's lost eye, Big Mom was impressed and reduced the amount taken to 50 years, allowing Pedro to return to Zou alive."}, {"type": "paragraph", "text": "Five years later, he returned to Totto Land with the Sanji Retrieval Team and once again fought against them to help obtain their Poneglyphs. Pedro distrusted Charlotte Pudding because she is Big Mom's daughter, and suggested they restrain her, and his suspicions were initially correct as she was initially indeed an enemy. During the tea party, Charlotte Oven remembered Pedro from his past invasion and swore that he would not leave alive this time."}, {"type": "paragraph", "text": "He was familiar with Perospero, as the latter escorted him out of Big Mom's territory after his first failed invasion five years ago. Perospero mocked Pedro on his invasion and shortened lifespan. They met again during the Sanji Retrieval Team's invasion and briefly fought. With Perospero trapping his allies, Pedro blew himself up to take him out. He was unsuccessful in killing Perospero, although his sacrifice did allow the Sanji Retrieval Team to escape from Perospero, and he cursed Pedro afterward, wanting to go after Pedro's allies for revenge."}], "images": []}, {"title": "Tamago", "level": 4, "content": [{"type": "paragraph", "text": "During his time as a pirate captain, Pedro clashed with Tamago on at least one occasion, resulting in the loss of Tamago's left eye. Despite this, Tamago has always respected Pedro as a powerful opponent. While Pedro's attitude toward Tamago is unknown, his actions against him did not indicate respect as he went to great measures to try to annihilate Tamago, and he was unwilling to sacrifice his life against him due to his obligations to the Straw Hats."}, {"type": "paragraph", "text": "After Pedro sacrificed himself to help his team escape Whole Cake Island, Tamago seemed to have respect for Pedro's noble intentions. Furthermore, Pedro's self sacrifice gave him a new perspective of the Straw Hats."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Gol D. Roger", "level": 4, "content": [{"type": "paragraph", "text": "The late Pirate King, Gol D. Roger, visited Zou sometime during Pedro's childhood. After meeting the ambitious young mink, Roger declined his request to join his travels with Kozuki Oden and the Roger Pirates but comforted him, saying that his time would come."}, {"type": "paragraph", "text": "When Pedro learned about Roger's death from Wanda, he was shocked by the news. Sometime later during Carrot's training, he repeated Roger's words to her to encourage her to became stronger despite her lack of swordsmanship skills, and gave her her gauntlets instead."}, {"type": "paragraph", "text": "His relationship with Roger was similar to Luffy and Shanks' as they asked to join the latter's crew but were rejected, prompting them to start their own journey to follow their dreams."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the captain of the Guardians, Pedro had command over them, though his position and authority were below those of Nekomamushi. He also had full command over the Nox Pirates as their captain until they were defeated and dissolved. Nonetheless, the World Government acknowledged his strength and threat as a pirate, enough to have a 382,000,000 bounty placed on his head. Having traveled through the seas in search of Poneglyphs, Pedro was experienced and knowledgeable of various facts, such as the geography of Totto Land and the hierarchy and powers of the Big Mom Pirates."}, {"type": "paragraph", "text": "Pedro was shown to possesses a strong will as he was able to withstand a burst of Big Mom's Haoshoku Haki."}], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Pedro was very pragmatic in battle, using a large variety of battle tactics and weapons and going to great lengths in order to attain victory disregarding any code of honor. Pedro would even attack his opponent if they were down but still had a chance of returning for battle. His ingenuity and deception was further shown when he create a massive explosion to annihilate his enemies while appearing to commit suicide when in reality, he escaped into a nearby mirror through Brûlée's Devil Fruit powers, deceiving the Big Mom Pirates including the intelligent Niwatori to think he was dead."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As the captain of the Guardians, Pedro was an extremely powerful warrior even for a mink and could use Electro. He had tremendous tolerance to pain, having gouged out his left eye with only slight discomfort, and also stood up after being poisoned and tortured by Jack, who tortured only the strongest mink warriors. He could also jump to great heights from a standing position."}, {"type": "paragraph", "text": "He was very stealthy, as Monkey D. Luffy, a proficient Kenbunshoku Haki user, did not sense him hiding in the trees above him. His great stealth capabilities allowed him to sneak inside a Biscuit Soldier together with Brook and also to eavesdrop on Tamago without the latter noticing. He was also extremely fast and agile, allowing him to run on walls. He used this speed in conjunction with his swordsmanship to unleash hit-and-run attacks on opponents. During his fight against Tamago, he was shown able to spin his tail to use it as a helicopter to float and move in mid-air."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "During the battle with the Beasts Pirates, Pedro wielded a large machete."}, {"type": "paragraph", "text": "Upon his departure from Zou, he wielded a rapier. Pedro was shown to be an extremely skilled swordsman, as his sword swings are powerful enough to break through shields and armor, and he often attacked while running past his enemies rather than in a conventional manner. His swordsmanship was great enough to fight on par with Tamago, a powerful member of the Big Mom Pirates, and he managed to cut Tamago's eye in one of their battles as well as defeat two of his forms in their final battle."}], "images": []}, {"title": "Anime Only Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Juken: Karajishi (, Jūken Karajishi, literally meaning \"Beast Sword: Imperial Guardian Lion\"): an anime-only sword technique, used by Pedro in the Seducing Woods.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Pedro possessed a large stockpile of dynamite-shaped explosives, which he kept inside his jacket while in Totto Land. He used a single stick in order to cause a hit-and-run explosion in the Whole Cake Chateau hallways, and later detonated several on the third floor courtyard to annihilate a large horde of enemies with a massive explosion, which acted as a smokescreen as he escaped into the Mirror World. He later lit up the stash in his jacket which caused a massive explosion that engulfed both Perospero and himself, and even though it did not harm Big Mom, it was powerful enough to hurl her several feet away."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ab/Pedro%27s_Explosives.png/revision/latest/scale-to-width-down/210?cb=20180107103519", "caption": "Pedro sets off his stockpile of explosives."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Pedro possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Childhood", "level": 4, "content": [{"type": "paragraph", "text": "26 years ago, when the Roger Pirates visited Zou, Pedro asked to accompany Roger and Oden. However, Roger told Pedro to remain on Zou but also told him that he would get his moment to shine one day. Pedro was later informed of Roger's execution by Wanda."}], "images": []}, {"title": "Captain of the Nox Pirates", "level": 4, "content": [{"type": "paragraph", "text": "13 years before the start of the series, Pedro captained the Nox Expedition Party in search of a Poneglyph. Despite his intention of being only an explorer, the World Government nevertheless placed a bounty on his head, thus the group being renamed the \"Nox Pirates\". Eventually, the crew gained injuries and lost morale, so Pekoms took those who could not continue away, leaving only Pedro and Zepo."}, {"type": "paragraph", "text": "10 years after they first started sailing, Pedro and Zepo sailed into Totto Land and they reunited with Pekoms, who had joined the Yonko's crew. During their mission to steal Big Mom's Road Poneglyph, Pedro clashed with Tamago and took out his left eye. Eventually, Pedro and Zepo were overwhelmed by the Big Mom Pirates. While facing judgement from Big Mom, Pedro's comrade Zepo landed the \"100 Years of Life\" option on Big Mom's roulette wheel and was killed by the loss of 30 years. Pedro was faced with losing 70 years, but Pekoms' pleading convinced Big Mom to reduce it to 60 years. Pedro took out his own left eye to prove that he needed to return to Zou alive in order to witness the coming of a new dawn. Big Mom decided to reduce his taken lifespan to 50 years out of respect for his will. Afterwards, Pedro was handcuffed and escorted out of Totto Land along with his ship by Charlotte Perospero, who commented on the meaning of the name \"Nox Pirates\". Pedro responded by saying that \"night\" has the same meaning as \"just before dawn\"."}, {"type": "paragraph", "text": "Sometime after his return to Zou, Pedro watched a young Carrot training in swordsmanship under Shishilian. Pedro commented that Carrot was not suited for a sword, much to Shishilian's annoyance, and later gave Carrot her gauntlets."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Pedro_holding_eye.png/revision/latest/scale-to-width-down/210?cb=20171203031547", "caption": "Pedro offering his eye to Big Mom."}]}, {"title": "Jack's Invasion", "level": 4, "content": [{"type": "paragraph", "text": "When the Beasts Pirates, led by Jack, invaded Zou in search of Raizo, Pedro and the other Guardians fought against them. The battle against the Beast Pirates lasted for five days. On the fifth day of the battle, Jack lost his patience and unleashed Caesar's Koro gas, which left the Mink Tribe poisoned and drastically weakened. The following day, Jack left Zou after hearing about Doflamingo's defeat and capture."}, {"type": "paragraph", "text": "When Sanji's group arrived, Pedro noticed that they were not allies of Jack and begged them to save Inuarashi and Nekomamushi. After Caesar neutralized the poison gas, Pedro and Tristan stopped Wanda from attacking Nami by revealing that she and her group were not the enemy. Soon afterwards, the minks were saved when Sanji's group tended to their injuries."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Guardians_Rush_Into_Battle.png/revision/latest/scale-to-width-down/210?cb=20161012013517", "caption": "Pedro and the Guardians charge to battle Jack."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Monkey D. Luffy entered the Whale Forest, Pedro and the other Guardians surrounded him, while Roddy and Blackback confronted him. However, when Wanda came and stopped the attack while telling him to give the order to retreat, Pedro did so, causing the rest of the Guardians to leave."}, {"type": "paragraph", "text": "That night, when the Straw Hat Pirates returned to the Whale Forest after visiting Inuarashi, Pedro greeted them and apologized to Luffy about his men's blunder earlier before informing him that Bepo and his group were waiting, though Luffy wanted to meet Nekomamushi and Pekoms. After pressing himself against Luffy, Pedro whispered the location of Pekoms and his knowledge of Sanji's predicament to him before taking Luffy to see Pekoms."}, {"type": "paragraph", "text": "The next day, as Kin'emon and Kanjuro entered Zou, Pedro took part in the search for them by surveying Kurau City from the top of a building. Upon seeing Inuarashi below, he tried to warn Nekomamushi to retreat temporarily, but the latter did not understand why he should do so and ended up making eye contact with Inuarashi, causing the two of them to clash. However, when the samurais revealed themselves, Pedro and the minks welcomed them and revealed that Raizo was safe on Zou before standing proudly at having kept his presence a secret."}, {"type": "paragraph", "text": "Kin'emon showed Pedro and the other minks the crest of the Kozuki Family on his back to confirm his allegiance. When Inuarashi and Nekomamushi reluctantly called a truce for the sake of Kozuki Momonosuke, whom they recognized as their lord, Pedro and the rest of the minks were overjoyed."}, {"type": "paragraph", "text": "After Inuarashi and Nekomamushi took Law, the Straw Hats, and the samurais to the Whale Tree, the minks discussed the day that the two rulers began hating each other, with Pedro noting that their feud started after they returned from their voyage with Kozuki Oden barely alive. Happy that the two rulers finally made peace with each other, Pedro and the rest of the minks began to prepare a banquet to celebrate the occasion."}, {"type": "paragraph", "text": "However, when Inuarashi, Nekomamushi, the samurais, and the pirates returned from the Whale Tree with Raizo, Zou began shaking as Zunesha started crying out, throwing Pedro and the others into a state of panic. Jack had returned and was attempting to destroy Zou by killing Zunesha. When Luffy and Momonosuke heard a majestic voice in their heads, Pedro noted that both Oden and Gol D. Roger had heard the same voice, but could not converse with it. After Zunesha retaliated on Momonosuke's command and sank Jack's fleet with one blow, Pedro and the others calmed down."}, {"type": "paragraph", "text": "Later, Pedro volunteered to join the Sanji Retrieval Team, which prompted several other minks to volunteer for various reasons, to his surprise and irritation. However, Nekomamushi allowed only Pedro to accompany Luffy's group because he could keep Pekoms in line. As the team departed from Zou, everyone was shocked when Luffy jumped off Zunesha with the rest of the retrieval team."}, {"type": "paragraph", "text": "After sailing far away from Zou on the Thousand Sunny, a beleaguered Pedro was shocked to see Carrot had sneaked aboard. Pedro tried to have the ship turn around, but Carrot begged them to let her come along despite his insistence that infiltrating a Yonko's stronghold would not be a game. As Luffy permitted Carrot to stay, Pedro received a newspaper that revealed the discovery and destruction of Baltigo, the headquarters of the Revolutionary Army."}, {"type": "paragraph", "text": "While showing the newspaper to the rest of the team, Pedro assured a concerned Luffy that the story would have mentioned if a high-ranking member of the Revolutionary Army like Dragon or Sabo had been captured or killed. After passing through a storm, Luffy presented his cooking, which his team found to be completely revolting and inedible. When Luffy admitted that he used up all the food they had, the team found themselves in a food shortage crisis."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Pedro_Meets_Luffy.png/revision/latest/scale-to-width-down/210?cb=20161121001906", "caption": "Pedro offers the Guardians' help in rescuing Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/89/Sanji_Rescue_Team_Heads_Out.png/revision/latest/scale-to-width-down/210?cb=20170529031615", "caption": "Pedro heads out with the Sanji Retrieval Team and Pekoms."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Random_Curry.png/revision/latest/scale-to-width-down/210?cb=20170305182728", "caption": "The Sanji Retrieval Team is aghast at Luffy's \"Random Curry.\""}]}, {"title": "Marine Rookie Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the team ran out of food, they began to get very hungry. However, Pedro spotted Fron Island in the distance, and the team decided to go there to find food, even though Pekoms warned them that a Marine base was located there. Pedro and Pekoms stayed behind to guard the Thousand Sunny while the others traveled to the island on the Shark Submerge III."}, {"type": "paragraph", "text": "A few hours later, the others returned to the Sunny with a massive food stockpile, but Pedro and Pekoms ate most of it in 10 minutes due to being left starving on the ship."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "A few days later, Pedro and the rest of the team were famished from the lack of food and overheated as they passed through boiling waters, but they were saved from starvation when Luffy managed to catch a gigantic fish. While Luffy suffered from severe food poisoning after eating the fish's toxic skin, Pedro and the others enjoyed a meal prepared by Nami using Sanji's recipe. After entering Big Mom's waters, they were approached by a ship belonging to Germa 66."}, {"type": "paragraph", "text": "The team was confronted by Sanji's youngest brother, who refused to give them an antidote for Luffy's poisoning despite their pleas. Pedro prepared to fight Yonji, but Yonji's sister intervened and cured Luffy. After deciding not to disrupt the wedding by fighting, the two groups parted ways."}, {"type": "paragraph", "text": "The team docked at Cacao Island, where Pedro and Brook donned disguises and accompanied Luffy and Chopper onto the island. When Luffy and Chopper ate an entire cafe and were confronted by a policeman, Pedro prepared to use force to help them, but instead watched in shock as Luffy and Chopper were saved by Charlotte Pudding. Upon being approached by a wolf mink who recognized him, Pedro told the mink that he was on vacation and asked him to keep quiet about his presence. Soon afterward, he and the rest of the team accompanied Pudding to another cafe, where she fed them."}, {"type": "paragraph", "text": "The Sanji Retrieval Team was shocked to learn that the woman they were conversing with was Sanji's betrothed. When Pudding panicked upon learning that they were the Straw Hats, Pedro quickly restrained her and held a sword to her throat, to Nami's chagrin. After calming down, Pedro and the team listened as Pudding explained more about the Charlotte Family and her thoughts about Sanji. Pedro suggested keeping Pudding bound and gagged to ensure that she would not report to Big Mom, but Pudding showed them a secret route to Whole Cake Island and told them where to meet her while promising to bring Sanji to them. The Sanji Retrieval Team left in a hurry when guards arrived for Pudding and quickly returned to the Thousand Sunny; to their surprise, Pekoms was nowhere to be found, and they found a message telling them to turn back."}, {"type": "paragraph", "text": "As they traveled on Pudding's route, Pedro spotted the next island, Jam Island. After Carrot asked to take over lookout duty, Pedro went down to the deck. When Carrot saw grape-colored waters nearby, Pedro revealed that some of the islands have rivers of juice that flow into the ocean and admitted that he had been in Totto Land once before upon Nami noting his considerable knowledge of the area. Suddenly, the team was attacked by a giant sea centipede, which they began battling."}, {"type": "paragraph", "text": "Later, the team battled a swarm of giant ants before getting trapped in a frozen sea of syrup as night fell. After Pedro revealed that this sea froze every night and unfroze the next day, they worked to unfreeze the sea as Pedro revealed that the giant ants had once eaten his own ship. When Luffy wondered what he did there in the past, Pedro explained how he had once traveled with Pekoms as a pirate and came to Totto Land searching for Poneglyphs before being defeated here. Pedro also stated that since Inuarashi and Nekomamushi showed Luffy the Road Poneglyph on Zou, they must believe that he could follow in Roger's footsteps, as he was the only other stranger to see it, and so they needed to acquire Big Mom's Road Poneglyph. When Pedro offered to sneak in and steal it while the others rescued Sanji, Luffy agreed to this proposal as the ants returned. The next day, the team reached Whole Cake Island, and Pedro revealed that the tallest cake on it is Big Mom's castle."}, {"type": "paragraph", "text": "After docking at the island, Pedro and Brook split from the group in the Shark Submerge III in order to infiltrate Big Mom's palace and acquire a copy of her Road Poneglyph. Pedro apologized to Luffy, as he had ended up needing Brook's assistance despite already offering to acquire a copy of the poneglyph alone."}, {"type": "paragraph", "text": "Later, having infiltrated Sweet City, Pedro and Brook read a newspaper article stating that Jinbe reconsidered his decision to leave Big Mom's crew. Discovering Pudding with Tamago at a bridal boutique, Pedro and Brook learned that Big Mom and her crew were aware of the Sanji Retrieval Team's movements. Soon afterward, Pedro and Brook hid themselves inside a biscuit soldier and waited to be taken to Big Mom's castle."}, {"type": "paragraph", "text": "Pedro and Brook managed to infiltrate the castle and hid inside the alcohol storehouse. After surveying the Room of Treasure with his spirit, Brook saw how heavily guarded the poneglyphs were. Realizing that their chances of success were slim to none and that they would never have another chance like this even if they returned with the rest of the Straw Hats, Pedro and Brook planned to have Pedro act as a decoy."}, {"type": "paragraph", "text": "As planned, Pedro created a diversion to lead the guards away from Brook. He eliminated most of the security inside the Room of Treasure before running through the halls, where he caught Big Mom's soldiers off guard with his speed before cutting them down. Pedro then ran up a wall, past some soldiers shooting at him, and he threw a bomb at the soldiers before landing back on the floor and continuing running."}, {"type": "paragraph", "text": "Eventually, the Chess Soldiers drove Pedro into an open courtyard, where he was confronted by Tamago. As Tamago reminisced about their past clashes and reminded him of how Big Mom stole 50 years of his natural lifespan, Pedro revealed that he was well aware of this and had no intention of returning to Zou. Pedro and Tamago fought while Pedro recalled the results of his first intrusion of Totto Land. When Tamago demanded to know why Pedro had returned despite his shortened lifespan, Pedro explained that he had done so for the Straw Hats, whom he believed would one day surpass him and Tamago while causing the world to transition into its \"dawn\", but clarified that he had no intention of dying until they had achieved their goals as he cut Tamago in half."}, {"type": "paragraph", "text": "Sometime during the battle, Chopper and Carrot called out to Pedro from a nearby mirror, surprising him, and they made a plan for Pedro to win the battle and escape. Using his Devil Fruit power, Tamago evolved into Viscount Hiyoko, gaining a chicken beak and wings, and he attacked Pedro with two knives. However, Pedro quickly cut Hiyoko apart, and Hiyoko began to evolve into his next form, Count Niwatori. Pedro then set off a large collection of explosives in his jacket, causing a massive explosion that engulfed Niwatori and his soldiers. Chopper and Carrot then saved Pedro by pulling him into the Mirro-World, successfully executing their plan. He soon informed them of Nami and Luffy's capture as Chopper and Carrot prepared to search for their friends. Pedro was shocked at Carrot's drawing of them and even more so when the mirrors replied back to him telling them that Nami escaped and was with Jinbe."}, {"type": "paragraph", "text": "The team later found Nami and Jinbe and pulled them into the Mirro-World. Jinbe revealed that he had decided to leave the Big Mom Pirates without spinning the roulette wheel, and Pedro commended him for doing so, recalling the time Zepo spun it. The team then went looking for Luffy, Sanji, and Brook."}, {"type": "paragraph", "text": "Pedro's group located Brook inside Big Mom's bedroom, being held in her hands as she slept. After binding and gagging Charlotte Brûlée and Diesel to keep them from alerting Big Mom, the team witnessed Big Mom and her three homies attacking a fly. The team became terrified, wondering how they were supposed to save Brook. The team then made a skeletal lookalike of Brook, which they planned to use to make a stand-in for the real Brook. After Chopper and Carrot's unsuccessful attempts to retrieve Brook, Pedro tried next, but Big Mom started tossing and turning, forcing him to retreat. After Jinbe and Nami successfully rescued Brook, Pedro apologized to Brook for putting him in danger by sending him to a highly guarded room, but Brook replied that it was a once-in-a-lifetime chance, as they would be unlikely to succeed in reaching the poneglyphs again without fighting a full-scale war. The team were then surprised and amazed to see that Brook successfully acquired copies of the three poneglyphs, which were hidden inside his skull. The group searched for Sanji and Luffy, but none of the mirrors saw them inside the castle. Pedro listened as Jinbe explained that Pekoms was alive and safe but nearly died because of a plot he was involved in."}, {"type": "paragraph", "text": "Pedro's group later contacted Luffy through a mirror shard and he was happy to hear that Sanji was with him. After Luffy told them his intention to ruin the wedding ceremony, Pedro listened as Jinbe explained more about Capone Bege, such as his backstory and him plotting against Big Mom. He continued listening as Jinbe proposed that Luffy form an alliance with Bege. The Sanji Retrieval Team went to the Fire Tank Pirates' hideout, where they cleaned up before meeting with Bege and his crew. As Bege explained his plan to kill Big Mom, Pedro listened attentively. The meeting adjourned once Bege finished going over the plan."}, {"type": "paragraph", "text": "Bege transported the alliance members to the wedding inside his body. Before Bege walked into the wedding venue, Pedro was shown sleeping. After the wedding ceremony began, the team initially encountered a small problem when Jinbe had difficulty waking Luffy up. After they woke Luffy with food, the team went into the mirror world and prepared to charge into the venue. Once they heard the signal, the team unleashed duplicates of Luffy into the venue, causing chaos at the ceremony. Once all the duplicates were released, the team charged in. When Luffy was immobilized by Katakuri, Pedro prepared to help Luffy, but Jinbe came to his aid first."}, {"type": "paragraph", "text": "After Brook destroyed the picture of Carmel, Pedro was confronted by Oven, who used his Devil Fruit powers to transfer heat into Pedro's sword, making it too hot to touch. Pedro was later told by Bege to back up the Straw Hats as the latter initiated his assassination operation. As Katakuri went after Luffy, Pedro tried to fight him but the Sweet Commander managed to get past him. However, despite Katakuri's efforts, Luffy showed Carmel's broken portrait to Big Mom, causing her to start screaming. Pedro then quickly put on his earplugs. Pedro watched as Bege, Vito, and Gotti fired their KX Launchers at Big Mom. However, Big Mom's scream detonated the rockets before they could reach her, shocking Pedro and his allies. With the assassination attempt a failure, Caesar flew into the venue with the escape mirror and Bege signaled the alliance members to retreat. Before they could escape into the mirror, Big Mom's scream shattered it, leaving them trapped in the venue. Pedro then watched Bege transforming into a giant fortress to save the alliance."}, {"type": "paragraph", "text": "Pedro's group and the Vinsmoke Family then retreated inside the fortress. However, the alliance found themselves in a dire situation as the fortress came under attack by a furious Big Mom. As Bege's fortress continued to suffer damage from Big Mom's attacks, Pedro listened to Bege as he came up with a plan to escape with Caesar's help. Pedro remained inside Bege as turned back into human form and had Caesar carry him out of the venue. As the Big Mom Pirates hindered their escape, Luffy, Sanji, and the Vinsmoke Family were overwhelmed by the enemy. Pedro and Jinbe prepared to go out to assist them, but the Tamatebako dropped to the base of the Whole Cake Chateau and the bomb inside the chest exploded, causing the castle to topple over."}, {"type": "paragraph", "text": "As the castle collapsed, Pedro's group, Bege's crew, and the Vinsmoke Family got away. Pedro's group and the Fire Tank Pirates rendezvous at the northwest part of Whole Cake Island, where Bege decided to part ways with the Straw Hats. After Brook and Chopper separated from the group to retrieve the Shark Submerge, the rest head for the Thousand Sunny. As they approached the Seducing Woods, they ran into King Baum. Nami then used part of Big Mom's vivre card to control King Baum and forced him to transport the fleeing team. However, before they reached the Seducing Woods, a crazed Big Mom (while riding on Zeus) caught up to them."}, {"type": "paragraph", "text": "Using Napoleon in its sword form, Big Mom unleashed an air slash that cut off a part of King Baum. As Big Mom prepared to attack again, Nami diverted Zeus' attention by using thunderclouds, causing the cloud homie to veer off-course and drop Big Mom. When Pedro and his group reached the Seducing Woods, Big Mom ordered the tree homies to stop the Straw Hats, but King Baum charged through them. Pedro and his group were later forced to jump off King Baum when Prometheus attacked and burned King Baum for his betrayal. The team continued running, but the Big Mom Pirates caught up to them, and Pedro clashed with one of them. However, he was quickly pulled away by Jinbe to prevent the team from splitting up. Zeus ate Nami's Weather Egg, causing it to expand greatly, and Nami used it to hit the Big Mom Pirates with a massive thunderbolt, which the Sanji Retrieval Team barely managed to outrun."}, {"type": "paragraph", "text": "Nami's attack left Big Mom laying at the bottom of a crater. To the Straw Hats' shock, Big Mom was barely affected and continued to move. She ate through the ground as she moved back up, and the team started running again. They were then approached by Pudding and Chiffon. After Chiffon requested Sanji's help in making a cake for Big Mom, Sanji readily agreed to assist them. Big Mom then got back on her feet and unleashed another devastating air slash, and the two groups parted ways with Sanji heading to Cacao Island with Pudding and Chiffon while Pedro and his group continued fleeing to the Thousand Sunny. Pudding used her Devil Fruit powers to send memories flooding into the souls in the homies, allowing the Straw Hats to make it to the coast without trouble. They ran toward the Sunny, and came into conflict with Perospero and Katakuri, who were onboard. Pedro told Carrot not to be flustered by these events, as he believed that the Straw Hats would bring about the dawn of the world. While standing on the coast, Perospero trapped the Sunny in candy. Pedro attempted a sneak attack on him, but Perospero managed to block the mink's strike before pinning him to the ground. However, Pedro lit up his bomb stash in his jacket, causing a massive explosion that engulfed both of them. Although Perospero survived the explosion, Pedro was nowhere to be seen, fulfilling his sacrifice to the Sanji Retrieval Team."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Pedro_Stops_a_Mink.png/revision/latest/scale-to-width-down/210?cb=20170430180753", "caption": "Pedro stops a wolf mink from drawing attention to him."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c5/Sanji_Retrieval_Team_Battles_a_Centipede.png/revision/latest/scale-to-width-down/210?cb=20160620215707", "caption": "The Sanji Retrieval Team battles a giant centipede."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c9/Brook_and_Pedro_Infiltrate_Sweet_City.png/revision/latest/scale-to-width-down/210?cb=20170702072702", "caption": "Pedro and Brook discover that their every move is being traced as they infiltrate Sweet City."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/49/Pedro_Causes_a_Distraction.png/revision/latest/scale-to-width-down/210?cb=20161205035349", "caption": "Pedro takes out several soldiers in the Whole Cake Chateau."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Pedro_Defeats_Tamago.png/revision/latest/scale-to-width-down/210?cb=20180123094143", "caption": "Pedro defeats Hiyoko."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Straw_Hat_Pirates_Meet_Fire_Tank_Pirates.png/revision/latest/scale-to-width-down/210?cb=20180304023006", "caption": "Pedro at the meeting with the Fire Tank Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/46/Pedro_clashes_with_Oven.png/revision/latest/scale-to-width-down/210?cb=20180423082536", "caption": "Pedro clashes with Charlotte Oven."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/22/Straw_Hats_Clash_in_the_Seducing_Woods.png/revision/latest/scale-to-width-down/210?cb=20170821042718", "caption": "The Sanji Retrieval Team clashes with the Big Mom Pirates while trying to escape."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Pedro_Attacks_Perospero.png/revision/latest/scale-to-width-down/210?cb=20170904153436", "caption": "Pedro takes on Perospero in an act of self-sacrifice."}]}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "Through Pedro's sacrifice, he was successful in helping the Straw Hats escape Whole Cake Island. Wanting to honor Pedro's self sacrifice, Pekoms betrayed the Big Mom Pirates in his attempt to help Luffy escape Cacao Island after his victory against Katakuri inside the Mirro-World. After the Straw Hats escaped Totto Land, Sanji learned of his sacrifice and, recalling the time he first met him, mourned his death while silently blaming himself over his death."}, {"type": "paragraph", "text": "A grave was erected for Pedro near Amigasa Village in Wano Country's Kuri region."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Pedro vs. Tamago", "elements": []}, {"text": "Mink Tribe and Heart Pirates vs. Beasts Pirates", "elements": []}, {"text": "Pedro vs. Chess Soldiers", "elements": []}, {"text": "Pedro vs. Tamago (Hiyoko) (Whole Cake Chateau)", "elements": []}, {"text": "Pedro vs. Charlotte Oven", "elements": []}, {"text": "Pedro, Capone Bege, and Jinbe vs. Charlotte Katakuri", "elements": []}, {"text": "Sanji Retrieval Team vs. Big Mom Pirates", "elements": [{"text": "Pedro vs. Kato", "elements": []}]}, {"text": "Pedro vs. Charlotte Perospero", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Sanji Retrieval Team vs. Ants", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "During the escape from Whole Cake Island in the anime, Pedro defeated Kato in the Seducing Woods. In the manga, the entire pursuit squad was defeated by Nami using Zeus' thunderbolt."}], "images": []}]}