{"sections": [{"title": "Wanda", "level": 1, "content": [{"type": "paragraph", "text": "Wanda is a canine mink of the Warrior Beast Tribe, a member of the Inuarashi Musketeer Squad, and a ruler's aide."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Wanda is a tan-furred, blonde-haired, curvaceous and well-endowed canine mink with dog ears, a dog-like snout, and a large bushy tail."}, {"type": "paragraph", "text": "When first meeting Luffy's group, Wanda wore Nami's long blue pants, high-heeled shoes, and green-white striped bikini top after Nami lent them to her. Wanda also wears the Musketeer's blue cape and another blue cloth tied around her pants."}, {"type": "paragraph", "text": "During the Beasts Pirates's invasion, Wanda wore a light blue open-necked shirt, white shorts, calf-height brown boots and a white cavalier hat."}, {"type": "paragraph", "text": "After arriving at Wano Country, Wanda switched to a light-colored kimono."}, {"type": "paragraph", "text": "As a child, Wanda had shorter hair, a smaller snout, and wore a light pink dress, magenta shoes, and the Musketeer's blue cape."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Wanda is unprejudiced and judges others by who they are rather than by what they look like. She is helpful to strangers, having assisted the Straw Hat Pirates by giving them directions on Zou and protected Monkey D. Luffy from the guardians of the Whale Forest. She sometimes says things without considering their context. When she affectionately referred to Brook as a corpse, the Straw Hat Pirates thought she was talking about the dead body of one of their crewmates."}, {"type": "paragraph", "text": "Similar to a dog, she has a habit of licking the faces of others as a way of displaying affection, as demonstrated when she licked Luffy's face on two separate occasions. Also, like most canine minks, she finds Brook to be delicious because his body is comprised exclusively of bones."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Mink Tribe", "level": 4, "content": [{"type": "paragraph", "text": "Wanda cares very much for her fellow minks; she was brought to tears by the Beasts Pirates' relentless slaughter of her people and looked back on the torture they underwent during Jack's invasion with great sadness. She is very caring and fiercely loyal to Inuarashi, to the point of crying when he woke from his coma, and will not stand for anyone, including Inuarashi himself, downplaying his strength, as demonstrated when she responded to Inuarashi claiming that a defeated warrior like him could not be called \"the greatest warrior in the land\" by pointing out how he only lost due to being poisoned by the Koro gas. Wanda is also close to Carrot; though she was initially worried when the minks could not find her after the latter snuck onboard the Thousand Sunny, Wanda admitted that she was simply glad to know where she was."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "When Wanda first encountered Sanji's group, a day had passed since she and the other minks had been incapacitated by the Koro gas; assuming they were with Jack, Wanda attacked and threatened to blow herself up along with them despite being weakened, desperate to know why they were committing senseless violence. However, when she found out that the Straw Hat Pirates were going to save them, Wanda shed tears of happiness."}, {"type": "paragraph", "text": "Wanda is very grateful to the Straw Hats who arrived on Zou first because they saved the Mokomo Dukedom from total destruction. When she heard several days later that Monkey D. Luffy had trespassed in the Whale Forest, Wanda rushed there to stop a fight and revealed that he meant no harm and simply did not ring the Bell of Welcome. Wanda took him to the Right Belly Fortress, answering any questions he had along the way. Wanda is very affectionate toward Luffy, licking at his face on multiple occasions. When she encountered the other Straw Hats, she gave them directions to get to the Right Belly Fortress; though exasperated when they did not believe her and tracked her down to free Luffy, she did not hold it against them. Just like the other Minks, she is indebted to him and the rest of the Straw Hats due to the fact that if Luffy hadn't stopped Doflamingo, Jack would've wiped out the Mink Tribe."}, {"type": "paragraph", "text": "She seems to have an especially close relationship with Nami, whom she licks and hugs frequently in addition to sharing clothing with as a sign of their friendship. Wanda is also fond of Sanji and feels indebted to him for saving her race, to the point of wanting to go after him immediately when he was taken by Capone Bege. Like the other canine minks, she is very taken with Brook due to him being made of bones, such that she affectionately refers to him as \"Baron Corpse\"."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "Jack's invasion and the amount of destruction he caused traumatized Wanda, and seeing the destruction brought tears to her eyes. She swore to never forgive Jack for what he did."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Wanda holds a great deal of respect among her fellow minks, such that Pedro immediately had the Guardians withdraw from their confrontation with Monkey D. Luffy when she asked him to do so."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a member of the Musketeers, Wanda is a very powerful warrior. Like all minks, Wanda can use Electro."}, {"type": "paragraph", "text": "As a ruler's aide, she possesses very large amounts of stamina, which allows her to be active at all hours of the day. She also possesses considerable resistance to toxins, as demonstrated when she remained able to stand and fight to a degree even after being badly weakened by deadly poisonous gas, whereas most of the other minks were completely debilitated by the lethal Koro gas."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "As a member of the Inuarashi Musketeer Squad, Wanda possesses high level of skill in swordsmanship. In the anime, she could hold her own against a large Gifter in a sword fight and even disarm him of his sword. She was only taken off guard when the Gifter used his Artificial Zoan abilities."}], "images": []}, {"title": "Weapon", "level": 3, "content": [{"type": "paragraph", "text": "Wanda wields a cutlass, which she can channel Electro through."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Childhood", "level": 4, "content": [{"type": "paragraph", "text": "At some point during her childhood, Wanda heard about Roger's execution and informed Pedro about it, who was shocked by the news."}], "images": []}, {"title": "Jack's Invasion", "level": 4, "content": [{"type": "paragraph", "text": "When the Beasts Pirates, led by Jack, attacked Zou in search for a ninja called Raizo, Wanda and the other Musketeers began clashing with them. A Gifter used his Devil Fruit powers to attack Wanda, but she was saved by Shishilian and continued fighting until 6:00 PM, at which point Inuarashi ordered the Musketeers to retreat so Nekomamushi and his Guardians could take over the battle."}, {"type": "paragraph", "text": "The battle against the Beast Pirates lasted for five days. On the fifth day of the battle, Jack lost his patience and unleashed Caesar Clown's Koro gas, which left the Mink Tribe poisoned and drastically weakened. The following day, Jack left Zou after hearing about Donquixote Doflamingo's defeat and capture."}, {"type": "paragraph", "text": "After Caesar was forced to neutralize the Koro gas, Wanda attacked Nami under the assumption that she and her group were with Jack. When Nami pinned her down, Wanda took out a stick of dynamite and threatened to blow all of them up, but Tristan and Pedro stopped her by revealing that Nami and her group were not the enemy. Soon afterward, Wanda and the rest of the minks were saved when Sanji's group treated their injuries."}, {"type": "paragraph", "text": "While Sanji's group lived with the Mink Tribe, Nami lent some of her clothes to Wanda, who in turn gave Nami a new dress. When Capone Bege and Pekoms arrived, Wanda revealed that Pekoms was once an infamous delinquent on Zou. When Capone Bege ran away from Nekomamushi with Sanji inside him, Wanda tried to pursue him, but Brook told her not to because he did not believe Sanji would come back even if they caught up to him."}, {"type": "paragraph", "text": "Following this, Nekomamushi told Wanda and Carrot to keep quiet about the incident in order to respect the wishes of Nami and her friends."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Inuarashi_Musketeer_Squad_Infobox.png/revision/latest/scale-to-width-down/210?cb=20161002185351", "caption": "Wanda, Carrot, and the Musketeers attack."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Wanda_Attacks_Nami.png/revision/latest/scale-to-width-down/210?cb=20161119234938", "caption": "Wanda attacks Nami."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Carrot attacked the newly-arrived Straw Hats under the assumption that they were invading Zou, Wanda appeared on Wany and told her to stop because they needed to deal with an intruder in the Whale Forest."}, {"type": "paragraph", "text": "After Carrot surveyed the situation from high in the air, Wanda told Zoro's group where to find the \"corpse\" of their comrade before leaving in a hurry with Carrot. Once they arrived at the Whale Forest, Wanda and Carrot stopped a fight between Luffy and the Guardians, where Wanda explained to Luffy that he was attacked because he was trespassing. After Luffy got reacquainted with the Heart Pirates, Wanda revealed that Jack was the one who destroyed the Mokomo Dukedom before offering to take Luffy to his crewmates. When Luffy was excited to see Sanji and his group again, Wanda sadly looked away."}, {"type": "paragraph", "text": "While riding Wany, Wanda explained to Luffy how the sea water from Zunesha's eruption rain was filtered and sent across the country via a system of aqueducts before stating that it was a blessing. As the group passed several crucifixes, Wanda teared up while recalling Inuarashi's torture at the hands of Jack. When Luffy asked her about Jack, Wanda revealed that his obituary had appeared in the newspaper a few days ago and stated that she did not believe he was dead before proclaiming that the minks would never forgive him. Wanda's group reached Right Belly Fortress, only for the rest of the Straw Hats and Law to suddenly appear as Usopp threatened to have Roronoa Zoro cut up Wanda if she did not give Luffy and the others back to them. However, a bemused Wanda merely pointed out that they were already at the fortress before explaining the situation to the gatekeepers present, who opened the gate and told the other minks of the Straw Hats' arrival at her behest. As the Straw Hats expressed confusion at the minks' enthusiastic welcome, Wanda noted that they likely thought the minks hated humans because they had never met one until now before explaining how they considered humans to simply be hairless monkey minks. After licking Luffy's face while stating that some of the minks found humans quite attractive, Wanda looked away as Nami tearfully informed Luffy of Sanji's predicament."}, {"type": "paragraph", "text": "While feasting with the Straw Hats, Wanda explained minkship and Brook's nickname of \"Baron Corpse\" to the Straw Hats before revealing that Nami's group saved the minks when they came to Zou. When she heard that Inuarashi had regained consciousness, an overjoyed Wanda explained the two king system that Zou operated under and took the Straw Hats to meet Inuarashi while beginning to recount the invasion of the Beasts Pirates 17 days prior."}, {"type": "paragraph", "text": "After ending her recollection with the start of the battle with the Beasts Pirates, Wanda heard Luffy mentioning the ninja and asked if the Straw Hats knew something that they did not, but calmed down when Brook insisted that Luffy had been wondering about the injured. As they arrived at Inuarashi's sanatorium, Wanda introduced the Straw Hats to Shishilian after learning why he was agitated before taking them inside to meet Inuarashi himself. While speaking to Inuarashi, Wanda decried his claim of being a defeated warrior who could not be called strong while mentioning a weapon that Jack used to overwhelm the minks."}, {"type": "paragraph", "text": "When Inuarashi fell asleep, Wanda revealed that Inuarashi and Nekomamushi ruled Zou during the day and night, respectively, because they were on bad terms with each other. After concluding her recounting of the minks' battle against the Beast Pirates, which ended when Jack used the Koro gas against them, Wanda tearfully revealed that the minks were tortured until Jack departed from Zou before being informed that the Straw Hats caused Jack's departure, which caused her to note that what happened afterward was an even more amazing miracle."}, {"type": "paragraph", "text": "After concluding her recollection with how Sanji's group saved the minks by treating their injuries, Wanda took the Straw Hats to the Whale Forest alongside Carrot after they decided to visit Nekomamushi. Once they arrived, Wanda and Carrot went with Luffy, Nami, and Pedro to see Pekoms, who had been left behind by the Big Mom Pirates. As Pekoms explained Sanji's predicament in detail, Wanda and Carrot were visibly disturbed upon learning of how Big Mom persuaded guests to attend her tea parties. Shortly afterward, Wanda reprimanded Carrot for taking Big Mom's power lightly before partying with the Straw Hats and several other minks."}, {"type": "paragraph", "text": "The following day, as Bariete rang the bell and spoke of the arrival of samurai, Wanda and the rest of the minks rushed to Kurau City. When Kin'emon and Kanjuro revealed themselves, Wanda and the other minks welcomed them and revealed that Raizo was on Zou before standing proudly at having kept his presence a secret. Kin'emon showed Wanda and the other minks the crest of the Kozuki Family on his back to confirm his allegiance. When Inuarashi and Nekomamushi reluctantly called a truce for the sake of Kozuki Momonosuke, whom they recognized as their lord, Wanda and the rest of the minks were overjoyed."}, {"type": "paragraph", "text": "After Inuarashi and Nekomamushi took Law, the Straw Hats, and the samurai to the Whale Tree, the minks discussed the day that the two rulers began hating each other, with Wanda noting that she and Pedro were only children at the time. Happy that the two rulers finally made peace with each other, Wanda and the rest of the minks began to prepare a banquet to celebrate the occasion."}, {"type": "paragraph", "text": "However, when Inuarashi, Nekomamushi, the samurai, and the pirates returned from the Whale Tree with Raizo, Zou began shaking as Zunesha started crying out, throwing Wanda and the others into a state of panic. Jack had returned and was attempting to destroy Zou by killing Zunesha, who retaliated on Momonosuke's command and sank Jack's fleet with one blow, calming down Wanda and the others in the process."}, {"type": "paragraph", "text": "Soon afterward, Wanda insisted on leaving with the Sanji Retrieval Team and Pekoms, but after being told to stay on Zou, she hugged Nami and told her to be careful."}, {"type": "paragraph", "text": "After the Sanji Retrieval Team left, Bariete informed Wanda that Carrot had gone with them and apologized to her for allowing Carrot to leave unnoticed, but Wanda was not worried because she had faith in Luffy and his group. When Wanda asked Inuarashi, who was keeping watch, to rest and offered to post some guards there, Inuarashi informed her that he was deeply concerned about how the Beasts Pirates located Zou and suspected that they might return."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Wanda_Takes_Luffy_to_Right_Belly_Fortress.png/revision/latest/scale-to-width-down/210?cb=20160626203409", "caption": "Wanda takes Luffy to see his crewmates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d1/Audience_with_Inuarashi.png/revision/latest/scale-to-width-down/210?cb=20161002185325", "caption": "Wanda takes the Straw Hats to Inuarashi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/Journey_to_Nekomamushi.png/revision/latest/scale-to-width-down/210?cb=20161120002229", "caption": "Wanda and Carrot take the Straw Hats off to meet Nekomamushi."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime after infiltrating Wano Country, Wanda and the Musketeers stole food and weapons from the Beasts Pirates and left a note saying that Shutenmaru and his gang were responsible for the thefts."}, {"type": "paragraph", "text": "Prior to the raid on Onigashima, Wanda, Carrot, and Shishilian were later at the place where graves for Pedro and Yasuie were placed. In Amigasa Village, Wanda was having a discussion with Nami, Robin, Carrot, and the Three Inuarashi Musketeers. Wanda commented that their ability to use their Sulong forms would depend on their luck and that Nekomamushi and the Guardians needed to make it back on time."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mink Tribe and Heart Pirates vs. Beasts Pirates", "elements": []}, {"text": "Wanda vs. Nami", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Wanda, Carrot, and Straw Hat Pirates (except Sanji) vs. Sutchies", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is a possible pun on wan, the Japanese onomatopoeia for a dog's bark.", "elements": []}]}], "images": []}]}