{"sections": [{"title": "Nekomamushi", "level": 1, "content": [{"type": "paragraph", "text": "Master Nekomamushi is a feline mink and the guardian of the Whale Forest on Zou, dubbed the \"Ruler of Night\" as he rules over the Mokomo Dukedom from 6:00 PM to 6:00 AM. He and Inuarashi serve as retainers for the Kozuki Family of Wano Country, as members of the Nine Red Scabbards."}, {"type": "paragraph", "text": "Alongside Inuarashi, he was once a member of the Whitebeard Pirates and Roger Pirates, serving under Kozuki Oden.Pedro has claimed that he and Inuarashi must not be allowed to die because \"the world is waiting for them\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nekomamushi is a large, yellow feline mink with sharp teeth, claws, and a very thick striped tail. He has wild, bushy blonde hair resembling a lion's mane running around his neck and down his back, and there is a scar running from the left side of his forehead down to his cheek. His outfit consists of a large robe decorated with circles, a haramaki around his waist, sandals, a light-colored shirt, and pants. In addition, he frequently smokes a kiseru."}, {"type": "paragraph", "text": "Like all the retainers of the Kozuki Family, Nekomamushi bears the family crest somewhere on his body."}, {"type": "paragraph", "text": "While being tortured by Jack, he lost his left hand and part of his left forearm due to several members of the Beasts Pirates spearing them off."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nekomamushi takes great pride in his status as one of the two rulers of the Mokomo Dukedom alongside Inuarashi, having proclaimed the country to be his when the night comes during his first encounter with Jack."}, {"type": "paragraph", "text": "Unlike his former friend Inuarashi, Nekomamushi is aggressive and merciless; Inuarashi has described him as an \"obstinate and stubborn imbecile\", comparing him to Jack himself, and he is completely willing to damage the historical Mokomo Dukedom while fighting, referring to doing so as a \"minor detail\". Nekomamushi can be stubborn even when not angry, as demonstrated when he kept ignoring Tony Tony Chopper's orders to recuperate in order to have fun. He does not like to be ordered around, having claimed that he went to bed of his own volition rather than on Chopper's orders while being treated by the doctor, and describes himself as a \"freedom-loving man\"; in spite of his bravado, however, he is afraid of needles."}, {"type": "paragraph", "text": "Despite his stubborn and sometimes abrasive behavior, Nekomamushi genuinely cares for his friends and fellow minks; he took care of Bepo and the other Heart Pirates when they arrived on Zou and did not expect them to help him defend the Mokomo Dukedom against the Beasts Pirates, though he was impressed when they decided to do so anyway. Additionally, while being tortured by Jack and his men, Nekomamushi convinced the Beasts Pirates to aim their spears at him instead of at his incapacitated fellow minks. He is also firmly loyal and possesses an incredibly strong will, having absolutely refused to reveal that Raizo was on Zou despite extensive torture at the hands of Jack even when he lost his arm, and was fully willing to risk the kingdom's destruction in order to protect his friend. His loyalty to his allies means that he will treat anyone who tries to harm them viciously, having claimed he will devour any intruders he finds."}, {"type": "paragraph", "text": "Nekomamushi has many feline behaviors that can sometimes get the better of him; he likes to lick his paws, play with balls and cat toys, and eat catnip. Unlike most cats, however, he loves taking baths. His favorite food is lasagne."}, {"type": "paragraph", "text": "Like many others, Nekomamushi has his own unique laugh: \"Goronyanya\". \"Nya\" is the Japanese onomatopoeia for a cat's meow, and \"goro\" may come from \"gorogoro\", the Japanese onomatopoeia for purring."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Nekomamushi_Distracted_By_a_Ball.png/revision/latest/scale-to-width-down/210?cb=20161121002221", "caption": "Nekomamushi is instantly distracted by the sight of a bouncing ball."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "Due to Oden protecting him and Inuarashi from discrimination during their youth, Nekomamushi is extremely loyal to the Kozuki Family of Wano Country, whom he serves as a retainer alongside Inuarashi. His loyalty to Oden and his family is so great that he risked sacrificing his kingdom and its inhabitants just to protect Raizo, another retainer of the clan, and later agreed to form a truce with his bitter rival Inuarashi in order to appease Kozuki Momonosuke."}], "images": []}, {"title": "Nine Red Scabbards", "level": 4, "content": [{"type": "paragraph", "text": "Aside from Inuarashi, Nekomamushi has an extremely strong and close friendship with fellow members of the Nine Red Scabbards, even after twenty years of separation. Nekomamushi risked his life and kingdom to protect Raizo from Jack, absolutely refusing to reveal Raizo's whereabouts even when brutally tortured to the point of losing an arm. When Raizo questioned about the fate of his fellow minks from Jack's brutality, Nekmomamushi could only silently apologized."}], "images": []}, {"title": "Heart Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Nekomamushi took the Heart Pirates because Bepo is a native of Zou. He did not expect them to help him fight Jack, but Bepo insisted on defending his home, which impressed Nekomamushi."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Like the rest of the Mink Tribe, Nekomamushi is very grateful to the Straw Hat Pirates, particularly Sanji, for saving them. When Sanji was forced to leave Zou with Bege for his impending marriage, Nekomamushi understood his crewmates' anguish and asked Wanda and Carrot to not tell anyone what happened, which prompted Nami to thank him for his understanding. However, he is not completely compliant with Tony Tony Chopper's orders for him to recuperate due to them restricting his freedom. Along with Inuarashi, Nekomamushi believes that Luffy will become the Pirate King, having willingly showed him the Road Poneglyph at Zou."}, {"type": "paragraph", "text": "Upon learning of Nico Robin's ability to read Poneglyphs, Nekomamushi feared for her safety, but Robin assured him that her crewmates would protect her. He was later amused that Luffy has Shanks’ Straw Hat and was shocked to learn that Franky was Tom's apprentice and that Brook was the sole survivor of the Rumbar Pirates that Crocus had searched for."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "When night fell during the first day of the Beasts Pirates' battle with the minks, Nekomamushi was immediately informed of Jack's invasion and wasted no time in rushing to the scene before immediately attacking the pirate. After Jack incapacitated the minks with poison gas and tortured him for information regarding Raizo's whereabouts, Nekomamushi swore that he would never forget Jack's actions and that his curse would follow the pirate until he died."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Inuarashi", "level": 4, "content": [{"type": "paragraph", "text": "Nekomamushi and Inuarashi were once friends, but their friendship became strained after Oden's death. Because of this, they avoid meeting face-to-face. Upon accidentally meeting, they exchanged hostile words and insults before preparing to enter a battle to the death despite their respective injuries. It was hinted by Momonosuke that their quarrel is related to his father, Kozuki Oden."}, {"type": "paragraph", "text": "Despite their present-day enmity, Inuarashi and Nekomamushi agreed to form a truce in order to avoid agitating Momonosuke and while reminiscing about their past adventures, they became very jolly and friendly with each other again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c1/Inuarashi_vs_Nekomamushi.png/revision/latest/scale-to-width-down/210?cb=20161127204129", "caption": "Nekomamushi clashes with Inuarashi."}]}, {"title": "Pekoms", "level": 4, "content": [{"type": "paragraph", "text": "As with Bepo, Nekomamushi cares for Pekoms despite his status as a pirate; upon finding Pekoms badly injured after being shot multiple times, Nekomamushi confronted Capone Bege, who was nearby, and demanded to know who he was and why Pekoms was injured despite his own injuries having not yet fully healed."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the leader of the Whale Forest Guardians, Nekomamushi has authority over the forest's inhabitants. During night time, he also becomes the main authority figure of the Mokomo Dukedom."}, {"type": "paragraph", "text": "Nekomamushi is equal in power to his daytime counterpart and former friend Inuarashi, causing all of their battles to end in stalemates; this was proven when he fought evenly against Jack, the right hand man of the Yonko Kaido with a 1,000,000,000 bounty, before the latter poisoned him with Caesar Clown's Koro gas. Even while Nekomamushi was recovering from severe injuries, Sanji confidently left the protection of his comrades from the Fire Tank Pirates to him, while Capone Bege felt wary of facing him and called him a monster."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Noted as one of the two strongest minks of the Mokomo Dukedom, Nekomamushi possesses immense physical strength, demonstrated when he easily flipped Jack over and slammed him into the ground in his mammoth form, and despite his large size, Nekomamushi is also extremely fast, having traveled from the Whale Forest to Kurau City in a matter of seconds. While all the other minks were immediately weakened and left unable to move by the Koro gas, Nekomamushi retained much of his strength and almost tore apart the chains that bound him to his crucifix, demonstrating tremendous endurance. Like all minks, he can use Electro."}, {"type": "paragraph", "text": "It is unknown how much the loss of his hand affects his overall combat abilities, but he managed to clash evenly with an one-legged Inuarashi."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Nekomamushi has considerable skills in swordsmanship, able to fight on par with Inuarashi when they sparred during their youth."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Nekomamushi wields a staff resembling a jumonji yari with a fire-shaped blade on each end, which he can channel Electro through. "}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Nekomamushi%27s_Staff.png/revision/latest/scale-to-width-down/210?cb=20161119231824", "caption": "Nekomamushi's staff."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Retainer of the Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "In the distant past, Nekomamushi and Inuarashi were friends. When they were children, they were told of the pact the Mink Tribe made with the Kozuki Family. Curious, they left Zou and journeyed to Wano Country, but got shipwrecked. They were discovered at Kuri Beach by Kawamatsu. Afterwards, the three were caught and persecuted by some humans until Kozuki Oden came and rescued them. They then followed Oden back to Kuri and became his retainers."}, {"type": "paragraph", "text": "When they were running low on funds, the retainers attempted to steal money from Shimotsuki Yasuie, but they were caught. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Oden and Wano. Following Yasuie's advice, they educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "After meeting the Whitebeard Pirates, Oden and his retainers had a feast with them. Nekomamushi and Inuarashi also learned from Marco on how vast the world is. Two weeks later, the two minks stowed away on Whitebeard's ship before they left Wano, knowing that Oden would not stop wanting to get on their ship. They revealed themselves after Whitebeard accepted Oden into the crew three days later. Afterwards, they traveled the seas together with the crew."}, {"type": "paragraph", "text": "The two minks and Oden later sailed with Gol D. Roger. However, Nekomamushi and Inuarashi never went to Laugh Tale."}, {"type": "paragraph", "text": "After Oden was executed by the shogun Kurozumi Orochi, Nekomamushi and Inuarashi began quarreling with each other on the way to Oden Castle, but the two minks were captured by Orochi's forces and they were left behind by the other retainers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Past_Nine_Red_Scabbards.png/revision/latest/scale-to-width-down/180?cb=20191125141345", "caption": "Young Nekomamushi along with his fellow Nine Red Scabbards after they were caught stealing by Yasuie."}]}, {"title": "Ruler of the Night", "level": 4, "content": [{"type": "paragraph", "text": "They managed to escape and returned to Zou barely alive, but they continued their feud to the point that they began fighting whenever they were together, so they decided that Inuarashi would rule Zou during the day and Nekomamushi would rule during the night."}, {"type": "paragraph", "text": "When Bepo and the Heart Pirates arrived, Nekomamushi took them under his care because, despite his status as a pirate, Bepo was a native of the island."}, {"type": "paragraph", "text": "As night fell during Jack and the Beasts Pirates' invasion of Zou, Nekomamushi quickly emerged from his domain and flipped Jack over. Nekomamushi prepared to fight Jack, and was pleased to see the Heart Pirates assisting the Guardians in the battle. He fought Jack for five straight nights, switching out with Inuarashi once 6:00 AM arrived. Finally, Jack lost patience and used the Koro gas on the minks. He then crucified Nekomamushi, Inuarashi, and other strong minks and tortured them for Raizo's whereabouts. However, the minks unwaveringly refused to give the ninja's location, and Nekomamushi nearly broke free from his chains, leading Jack and his men to sever his arm."}, {"type": "paragraph", "text": "One day later, Jack left Zou and the Straw Hat Pirates led by Sanji arrived. After chasing away the remaining pirates and neutralizing Koro, the pirates tended to Nekomamushi and the wounded minks."}, {"type": "paragraph", "text": "Several days later, while Capone Bege was dealing with Sanji inside his body, Nekomamushi confronted Bege after finding an injured Pekoms, which prompted Sanji to throw his crewmates out of Bege's body. Not wanting to fight Nekomamushi despite his visible injuries, Bege fled with Sanji and Caesar Clown. Realizing that the remaining Straw Hats wanted the minks present to forget about what just happened, Nekomamushi told Wanda and Carrot to keep quiet about the incident and decided to look after Pekoms."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Nekomamushi_Flips_Jack.png/revision/latest/scale-to-width-down/210?cb=20161119231621", "caption": "Nekomamushi attacks Jack."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Nekomamushi_Confronts_Bege.png/revision/latest/scale-to-width-down/210?cb=20161120010628", "caption": "Nekomamushi confronts Bege after discovering an injured Pekoms."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Monkey D. Luffy and his group came to Zou, Tony Tony Chopper went to check up on Nekomamushi after visiting Inuarashi. Nekomamushi was disobeying Chopper's orders by eating lasagne and taking a bath, and was quickly forced back into bed as Chopper gave him more medical treatments. Shortly afterward, Nekomamushi left his bed and followed the other Straw Hats in order to meet Luffy and Roronoa Zoro. After Trafalgar Law warned Luffy about the threat of Kaido and the danger that the country would be in if they stayed on Zou, Nekomamushi decided to party with the members of the alliance and the other minks."}, {"type": "paragraph", "text": "The next morning, Nekomamushi was alerted by Bariete ringing the bells to announce the arrival of the samurai Kin'emon and Kanjuro. Nekomamushi led the Guardians to Kurau City in search of the samurai, but encountered Inuarashi. The two quickly began arguing and briefly clashed before Kin'emon interrupted them, revealing his identity and asking about Raizo. Nekomamushi and the minks then revealed that Raizo was on Zou and they had kept him safe all this time."}, {"type": "paragraph", "text": "While conversing with Kin'emon, Nekomamushi and Inuarashi began arguing again, prompting Kozuki Momonosuke to reprimand them for doing so because it would make his father sad to see them behaving like this. Not wanting to disappoint their lord, Nekomamushi and Inuarashi apologized and called a truce, to the delight of their fellow minks. Shortly afterward, Inuarashi and Nekomamushi escorted the samurai and the Straw Hats to a secret area in the Whale Forest where Raizo was hidden."}, {"type": "paragraph", "text": "After Nico Robin deciphered the Road Poneglyph hidden within the Whale Tree, Nekomamushi revealed the purpose of the Road Poneglyphs and the locations of two others. He, Inuarashi, and the samurai then revealed that the Kozuki Family invented the poneglyphs, but their ability to make them was lost after Oden was killed by Kaido and Orochi."}, {"type": "paragraph", "text": "After speaking more about Oden, Nekomamushi and Inuarashi offered the minks' help in fighting against Kaido, and after Momonosuke petitioned Luffy for his help, the minks formed an alliance with the Kozuki Family, Straw Hat Pirates, and Heart Pirates known as the Ninja-Pirate-Mink-Samurai Alliance."}, {"type": "paragraph", "text": "As the group left the secret room, Nekomamushi realized that he recognized Luffy's straw hat, which prompted Inuarashi to reveal that he and Nekomamushi once traveled with Oden aboard the ships of both Whitebeard and Roger, though they never went to Laugh Tale. As he reminisced about his days of adventure, Nekomamushi happily danced with Inuarashi while he did the same. Promising to one day detail all of Oden's adventures, Nekomamushi continued descending the Whale Tree while revealing that they intended to find and recruit Marco, whom he noted had vanished after clashing with Marshall D. Teach a year ago during the Payback War, though he had an idea of where Marco might be. Suddenly, Zou began shaking violently, causing a shocked Nekomamushi to realize that Zunesha was crying out before wondering to know what was going on. Jack's threat was ended when Momonosuke ordered Zunesha to destroy his fleet, but Nekomamushi was concerned about how Jack found Zou twice."}, {"type": "paragraph", "text": "Later on, Pedro and several other minks volunteered to join the Sanji Retrieval Team, but Nekomamushi decided to allow only Pedro to go because he could keep Pekoms in line. Soon afterward, as the Sanji Retrieval Team departed from Zou, Nekomamushi and the others were shocked when Luffy jumped off Zunesha with his party."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Raizo_is_Safe.png/revision/latest/scale-to-width-down/210?cb=20161204162210", "caption": "Nekomamushi and Inuarashi reveal that Raizo is safe."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Nekomamushi and the Guardians located Marco at Whitebeard's home village. As Nekomamushi spoke to Marco, the latter talked about Whitebeard's history with the village. Marco also heard about Edward Weevil attacking those connected to Whitebeard in search of a fortune that does not exist. After explaining that he could not leave because of the possibility that Edward Weevil would attack the village as well, Marco asked Nekomamushi to pass on a message to Luffy."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Nekomamushi vs. Inuarashi (multiple times)", "elements": []}, {"text": "Mink Tribe and Heart Pirates vs. Beasts Pirates", "elements": [{"text": "Nekomamushi vs. Jack (multiple times)", "elements": []}]}, {"text": "Nekomamushi vs. Inuarashi (Kurau City) (interrupted)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Neko Mamushi\", although not written in kanji, means \"Cat Viper\", which the VIZ translation used. The title of \"Master\" was added on later.", "elements": [{"text": "Brook's voice actor, Chō, made-up a song about \"going off to meet the Cat Viper.\" It impressed Oda enough that he decided to integrate Cat Viper into the manga, as well as the song itself.", "elements": []}]}, {"text": "His design is similar to the Cheshire Cat from Lewis Carroll's Alice's Adventures in Wonderland.", "elements": []}, {"text": "His love of lasagna is similar to the comic strip cat, Garfield, created by Jim Davis.", "elements": []}, {"text": "The song he hums while eating in the anime is reminicent to Ludwig van Beethoven's 5th Symphony in C minor.", "elements": []}]}], "images": []}]}