{"sections": [{"title": "Zunesha", "level": 1, "content": [{"type": "paragraph", "text": "Zunesha is a Naitamie-Norida elephant that wanders the New World and carries the island of Zou on its back."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Zunesha has the appearance of a massive elephant, comparable to an island in sheer scale; its two-jointed legs are disproportionately and extremely long, such that it can walk on the sea floor while its upper body, including about a third of each leg, remains above the water. However, Zunesha has comparatively small eyes sunken deep into their sockets, being barely visible at most times and giving the impression that it has no eyes at all. Its skin is heavily wrinkled, reflecting its old age, and its ears are tattered and frayed at the edges."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Most of Zunesha's personality is a mystery, but it does not mind carrying a civilization on its back, and in fact cares greatly about the Mink Tribe, as demonstrated when it warned Monkey D. Luffy and Kozuki Momonosuke that they would all be in danger if it fell."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Mink Tribe", "level": 3, "content": [{"type": "paragraph", "text": "Zunesha has a commensal relationship with the Mink Tribe and the island of Zou; twice per day, it showers itself with seawater, which helps the minks acquire food in the form of fish and water via a filtration system, causing them to consider it a blessing. When Jack and his fleet were attacking it, Zunesha worried about the minks dying if it were to fall into the sea and begged Kozuki Momonosuke to allow it to fight before this happened. After Zunesha defeated Jack, the minks were surprised to learn that it possessed a will of its own in all the time that they have lived there. The minks also tended to Zunesha's leg, which had been injured by Jack's attack, as they expressed gratitude to it for protecting them. Miyagi was excited to learn that Zunesha could understand his tribe and wanted to ask where it is going after traveling over a millennia."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "During his second attack on Zou, Jack decided to slaughter the minks by bringing down Zunesha. He planned to force the elephant to its knees in order to reach its head and kill it in sadistic ways; however, Zunesha was determined to protect the minks, and with Momonosuke's permission, it annihilated Jack's fleet with one swing of its trunk."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Zunesha has immense longevity, given its so-far more than 1000 years of life. Due to its gigantic size, it can carry the whole island of Zou on its back, and as a result of seemingly incredible endurance has been able spend an entire millenium continuously carrying Zou whilst walking."}, {"type": "paragraph", "text": "Zunesha can suck up and expel massive amounts of sea water, and with it lots of fish, using its trunk. With a single swing of its trunk, it can wipe out entire fleets of ships and swiftly defeated Jack, one of the Three Disasters of the Beast Pirates."}, {"type": "paragraph", "text": "Zunesha has extraordinary eyesight and can see faraway objects in great detail, as seen when Momonosuke saw through its eyes."}, {"type": "paragraph", "text": "However, due to having lived for so long, it is not very durable, so its weak and aged skin can be heavily damaged by concentrated cannonfire."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the ancient past, Zunesha was sentenced to walk the seas for eternity and only act upon being ordered to do so for committing an unspecified crime. Since then, it has wandered the sea of the New World and lived for centuries carrying the Mink Tribe and the other lifeforms on Zou."}, {"type": "paragraph", "text": "Seventeen days before the Straw Hat Pirates landed on Zou, Jack and the Beasts Pirates invaded Zou. Jack's massive presence was felt by Zunesha, who roared in pain."}], "images": []}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "Jack and his men returned to Zou, with Jack intending to kill Zunesha. As Jack and his fleet's attack commenced, Zunesha began shaking and crying out. As Jack's fleet heavily damaged one of its legs, Zunesha begged Kozuki Momonosuke to give it permission to fight back. After Momonosuke explained Zunesha's past and how it could not act without permission, he ordered it to drive Jack away, prompting Zunesha to wipe out Jack's fleet with a powerful swing of its trunk before resuming its walk."}, {"type": "paragraph", "text": "With Jack defeated, Tony Tony Chopper treated Zunesha's injured leg alongside Miyagi and many other minks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8c/Zunesha_Wipes_Out_Jack%27s_Fleet.png/revision/latest/scale-to-width-down/210?cb=20170205013035", "caption": "Zunesha wipes out Jack's fleet."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Zunesha vs. Beasts Pirates", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "Zunesha's eye in the manga has a circle around its pupil while in the anime it does not.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Zunesha is the oldest living creature introduced in the series, with its lifetime predating even the Void Century.", "elements": []}, {"text": "Zunesha's design was based on the painting The Elephants by the surrealist painter Salvador Dalí; its species name read backward is \"ダリノエミタイナ象\", which means \"Elephant resembling Dalí's painting\". The Elephants are notorious for being quite gigantic elephants with buildings on their back and extremely long legs similar to those of the animals on Long Ring Long Land.", "elements": []}, {"text": "Zunesha may be based on the \"World Elephant\" Hindu concept, which is that a turtle supports elephants which carry the whole world on their backs.", "elements": []}, {"text": "The kanji 象主 means \"elephant lord\".", "elements": []}, {"text": "\"Zunesha\" as a word may stem from \"Ganesha\", the elephant-headed Hindu deity.", "elements": []}, {"text": "According to Miyagi, the Minks will one day have to leave Zunesha's back and move elsewhere. He also suggested that Zunesha may not just be randomly walking the ocean, but is heading somewhere.", "elements": []}, {"text": "Zunesha's diet consists of sky island apples and giant seaweed.", "elements": []}]}], "images": []}]}