{"sections": [{"title": "Dalton", "level": 1, "content": [{"type": "paragraph", "text": "Dalton is the king of the Sakura Kingdom (formerly called the Drum Kingdom). He is a former Royal Guard who once served under Wapol."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dalton is an imposing man, with slicked black hair and a goatee. He wears a long, white fur-lined green tunic and has armor plates on his arms; these plates are retained on his fore legs when assuming his full-bison form. Sometimes he covers his head with a green and white fur lined hat, equipped with ear-flaps against Drum Island's intense cold, and he always wears long boots. He carries his weapon of choice, an extra-large spade, in a sheath that hangs on his back. In Chapter 0, he was seen wearing a more regal armor, and his hair was also parted in three points, instead of one."}, {"type": "paragraph", "text": "After the timeskip, as the king of the country, he started wearing a fur-lined cape with the kingdom's symbol on it over his standard attire."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Dalton is a brave warrior and a compassionate man who deeply cares for the people of Drum Island and in return the people of Drum have learned to trust him. As the new king of Sakura Kingdom, he lives a simple and humble life. He refuses to live in the castle, preferring to live amongst the common people of Drum Island even though Kureha has offered him a room in \"her\" castle. He claims that he likes the rice with chestnuts in the village. He has the habit of giving people completely trivial information that they never asked for."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Kureha", "level": 4, "content": [{"type": "paragraph", "text": "He is on good terms with Dr. Kureha; she approves of him as the king of Drum, though she treats him with disrespect. He displays no grudge nor protest against her for her actions; in fact, he seems to respect her for her role in the events of Wapol's ultimate defeat. The two remain on friendly terms; while Wapol disliked her for being a rogue doctor, Dalton is quite content with allowing her to do as she pleases."}], "images": []}, {"title": "Tony Tony Chopper", "level": 4, "content": [{"type": "paragraph", "text": "Dalton also has a sound view of Chopper, whom he views with the highest respect having saved the kingdom of Drum. Dalton saved his life six years ago by stopping an enraged Chopper from fighting a hopeless battle against Wapol and his army to avenge Hiriluk's death, having recognized what he was trying to do. He keeps an eye out for Dr. Kureha's \"son\" and was the first to tell her when Chopper gained a bounty."}], "images": []}, {"title": "Nefertari Vivi", "level": 4, "content": [{"type": "paragraph", "text": "He also has respect for Princess Vivi, who amazed him when she was a child. It was because of her actions that first made Dalton criticize his own king, Wapol. He compared her against Wapol and noted how even at her young age she was fully aware of her political status and how one minor incident could have escalated into a full blown war between the two kingdoms. Though the present Vivi did not reveal her identity to him on Drum Island during the Drum Island Arc, Dalton was even more amazed by her actions with the Straw Hat Pirates after realizing who she was following their departure, and how one such as her would ally herself with pirates such as them."}, {"type": "paragraph", "text": "The two would later get reacquainted two years later when they both attended the Levely. When Wapol approached Vivi and began insulting her, Dalton stood up for her by intimidating Wapol to back off."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Initially, Dalton was hostile to them because they were pirates but after being moved by Vivi and Luffy's pleas to help Nami he allowed them to pass through the Village. As they traveled, Dalton began to see they were not as bad as he thought when he witnessed their honest concern for their ill friend, Nami. His feelings were shown to have changed to gratitude for the young crew, after Luffy defeated Wapol and liberated the Kingdom from Wapol's tyranny. Ever since then, Dalton has kept an eye out for the Straw Hats, as seen in Post-Enies Lobby Arc, where Dalton was quite happy to see they were still okay. "}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Wapol", "level": 4, "content": [{"type": "paragraph", "text": "Dalton was the humble servant of King Wapol, who originally obeyed the orders of his King through loyalty. Dalton however, unlike other members of the Kingdom minsters, had a conscience and once he was encouraged by Hiriluk's actions, refused to be Wapol's obedient guard any longer. After Wapol fled Drum Island, Dalton harbored a deep hatred for his former king and refused to allow him to revert Drum Island back to what it was before his departure."}, {"type": "paragraph", "text": "Two years later, they met again at Mary Geoise and Dalton stopped Wapol from insulting Vivi. Dalton was dismayed to see Wapol had become king of another country and referred to it as despicable. Wapol yelled at him by calling him a servant, but Dalton firmly stated that they are now equals. His tone also sounded threatening (enforced by him transforming into his bison form) as Wapol backed off."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Dalton is a capable fighter. He possesses great strength, enhanced by his Devil Fruit power, and he is fast enough to surprise Wapol and decapitate him with a single blow. He is also very resistant and resilient, as he took many arrows from Chess and was covered by an avalanche, and yet survived."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "He ate the Ushi Ushi no Mi, Model: Bison, a Zoan-type Devil Fruit that enables him to transform into a bison and into a half-human/half-bison form that resembles a minotaur. His Hybrid form is primarily utilized for combat, and is powerful enough to stop Chopper's Heavy Point."}, {"type": "paragraph", "text": "The main advantage of this fruit, however, does not seem to be the enhanced strength but, strangely enough, the speed: his quadrupedal bovine state allows him to run at a much higher speed than his default human state, making it ideal for transportation. He proved to be incredibly fast, evading the bullets shot at him by Wapol's soldiers with tremendous agility. In his hybrid form Dalton uses Fiddle Banff, which allows him to twirl his sword and charge the opponent at an incredible speed, slicing up anything in its path. This attack works especially well against large groups of enemies."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bf/Ushi_Ushi_no_Mi%2C_Model_Bison_Infobox.png/revision/latest/scale-to-width-down/250?cb=20130822210202", "caption": "Dalton's bison hybrid form."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Dalton's main weapon is a spade, a large pole-arm with an over-sized blade. It is not shaped like most spades though (which have fan-like shapes such as the famous Shaolin Spade), and is rather unusual in its shape, being a long double-edged sword-like polearm with a round tip instead of a sharp point. Its overall appearance looks like an oar, but with a metal head instead of wood."}, {"type": "paragraph", "text": "Dalton proved to be quite proficient with his blade, combined with his Devil Fruit powers, which allows him to attack at tremendous speed and slice up anything in his path, defeating a large group of soldiers swiftly."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/25/Dalton%27s_Spade.png/revision/latest/scale-to-width-down/180?cb=20170927204023", "caption": "Dalton's spade."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Twenty years ago Dalton served the former kind king of Drum Island and both he and the king worried about prince Wapol's behavior. However, as time went on, the king passed away, leaving the spoiled Wapol to inherit the throne."}, {"type": "paragraph", "text": "Dalton then became a guard to the new King Wapol, but he was opposed to Wapol's treatment of his subjects. He was seen with Wapol at Mary Geoise during a Levely, where they met King Nefertari Cobra and his daughter Princess Nefertari Vivi. He was inspired to rebel by Hiriluk. After seeing Hiriluk's noble sacrifice, he turned against Wapol, but was subdued and thrown in prison, constantly mocked by Wapol and his henchmen, Chess and Kuromarimo. After Wapol abandoned his kingdom when Blackbeard invaded, Dalton took charge and kept the island from falling into disarray, soon gaining the trust of the people."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Wapol_Defeats_Dalton.png/revision/latest/scale-to-width-down/200?cb=20130301053527", "caption": "Dalton is defeated by Wapol."}]}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Drum Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Monkey D. Luffy and his crew came to Drum Island in search of a doctor to cure Nami of her illness during the mission to get Princess Nefertari Vivi to Alabasta Kingdom, they encountered Dalton and some men who thought they were there to attack the island. Dalton and his men were initially hostile to the pirates, but after seeing that they had no ill-intent, Dalton led them to Big Horn. Dalton then took them to his house to warm up. When asked about a doctor, Dalton said that the only one who could heal Nami was a witch named Kureha. Luffy and Sanji volunteered to take Nami to the doctor. Before they left, Dalton warned them of the Lapahns."}, {"type": "paragraph", "text": "Dalton then told Vivi and Usopp about the attack by the Blackbeard Pirates and how they led Wapol to flee like a coward. Dalton was then told by Negikuma Maria about Kureha's visit to Cocoa Weed. Dalton quickly took Usopp and Vivi there only to miss Kureha. After receiving word of Wapol's return, Dalton immediately went back to Big Horn in his bison form. Dalton confronted Wapol and cut him down. However, the Isshi-20 saved Wapol's life. Dalton was later seriously wounded by Chess because he defended the townsfolk from arrows launched by him. Wapol and his two henchmen then fled when an avalanche was approaching. Dalton was buried beneath the snow."}, {"type": "paragraph", "text": "The villagers wanted to dig him out, but Wapol's soldiers were preventing them from doing that until Zoro came along and defeated the soldiers. The villagers were able to dig Dalton out and the Isshi-20 treated Dalton's wounds. After Dalton slightly recovered, he planned on going to Drum Castle and put an end to Wapol. Usopp attempted to carry Dalton to the Castle but was too weak. Instead, Zoro stepped in and the crew were shown a hidden ropeway that would bring them to the top of the mountain."}, {"type": "paragraph", "text": "As they were making their way to the castle, Dalton was preparing to blow the castle up with dynamite. Before they reached the top, Luffy defeated Wapol and knocked him off the island. Upon arriving to the castle, Dalton saw Chopper and recognized him. Dalton then rested in the castle. After the Straw Hats left, Dalton then watched Hiriluk's cherry blossoms bloom. Later, the people of Drum elected Dalton as their new king and renamed the country Sakura Kingdom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9a/Dalton_and_Drum_Citizens_Reconstructing_Sakura_Kingdom.png/revision/latest/scale-to-width-down/150?cb=20130912234720", "caption": "King Dalton working with his citizens."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "He appears later as king of the newly crowned Sakura Kingdom (formerly known as Drum Island), where he shows Dr. Kureha the new bounties of the Straw Hat Pirates."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "He is seen after the timeskip employing Lapahns as peacekeeping troops while reading about the Straw Hats."}], "images": []}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "Dalton and Dr. Kureha later received news of the Straw Hats' accomplishment at Dressrosa."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Dalton was shocked to hear Kureha was going to accompany him."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Dalton read about it on a newspaper."}, {"type": "paragraph", "text": "Dalton and Kureha later arrived at Mary Geoise. When Wapol was insulting Vivi, Dalton interrupted and drove him away through intimidation. He got reacquainted with Vivi and engaged in a friendly conversation with Rebecca concerning Luffy."}, {"type": "paragraph", "text": "After Mjsogard stopped Charlos from enslaving Shirahoshi, Dalton stood beside the Neptune Family as Mjosgard promised Neptune that he would protect Shirahoshi. Dalton later went to the conference room with the other kings and queens to begin the Levely. As he took his seat, Dalton glared at Wapol."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Wapol_and_Dalton_meet_at_Mary_Geoise.png/revision/latest/scale-to-width-down/190?cb=20190519040502", "caption": "Dalton and Wapol meet again when they attend the Levely."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "Jump Ultimate Stars", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dalton has a habit of mentioning trivial things about the subject he is speaking of; such as mentioning that Kureha likes pickled plums when informing Luffy, Sanji, Usopp, and Vivi about the island's only remaining doctor; and that Gyasta is a fine place for skating when giving directions to Usopp and Vivi while they were searching for a doctor.", "elements": []}, {"text": "Dalton is the first Zoan Devil Fruit user to be introduced in the series.", "elements": []}]}], "images": []}]}