{"sections": [{"title": "Inuarashi", "level": 1, "content": [{"type": "paragraph", "text": "Duke Inuarashi is a canine mink and one of the two rulers of the Mokomo Dukedom, dubbed the \"Ruler of Day\" as he rules over the Mokomo Dukedom from 6:00 AM to 6:00 PM. He and Nekomamushi serve as retainers for the Kozuki Family of Wano Country, as members of the Nine Red Scabbards."}, {"type": "paragraph", "text": "Alongside Nekomamushi, he was once a member of the Whitebeard Pirates and Roger Pirates, serving under Kozuki Oden.Pedro has claimed he and Nekomamushi must not be allowed to die because \"the world is waiting for them\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Inuarashi is an incredibly large and grizzled canine mink. He wears a small pair of blue sunglasses and has shoulder-length black ears, a white beard, and a large and bushy tail."}, {"type": "paragraph", "text": "During the battle against Jack, he wore a dark-colored striped suit with a frilled collar, a belt, a light-colored cape, and a helmet. After waking from his coma, he wore a king-like robe, and his head and torso were covered in bandages."}, {"type": "paragraph", "text": "Like all the retainers of the Kozuki Family, Inuarashi bears the family crest somewhere on his body."}, {"type": "paragraph", "text": "While being tortured by Jack, Inuarashi lost his left leg."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Inuarashi is a kind, noble, and humble mink who is deeply loved and respected by his people due to his great benevolence. He was eager to meet the Straw Hat Pirates after they saved the Mink Tribe, indicating a grateful personality, and he downplayed his strength when he was complimented by Luffy."}, {"type": "paragraph", "text": "Inuarashi has a very refined and sophisticated personality as he is very polite and soft-spoken in speech. He refers to himself with \"watashi\" and always speaks to people including enemies in a very courteous manner. Due to his gentleman sophistication, Inuarashi strongly dislike barbarism, as he was greatly shocked by Jack's completely unreasonable and violent nature. He also hold strong contempt for Nekomamushi, who he insultingly called a Monster Cat due to the latter's aggressive and wild personality."}, {"type": "paragraph", "text": "Despite being the strongest warrior on Zou, Inuarashi prefers diplomacy over aggression when dealing with hostile parties. He cares immensely for his people and their rich cultural history, to the extent that he was willing to lay down his sword to reason with Jack and the Beasts Pirates and would have allowed them to search for Raizo if they ceased their attack. During the brutal interrogation by the Beast Pirates for Raizo's whereabouts, Inuarashi pleaded with Jack and his men to spare his citizens from their brutality despite being subjected to horrendous torture himself. However, he is also firmly loyal and possesses an incredibly strong will, having absolutely refused to reveal Raizo's presence on Zou despite the brutal torture at the hands of Jack even when he lost his leg, and was fully willing to risk the kingdom's destruction in order to protect his friend."}, {"type": "paragraph", "text": "Like the rest of the canine minks, Inuarashi finds Brook to be delicious because of his body of bones, but was willing to let him recover and chew on him later after seeing his injuries."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "Due to Oden protecting him and Nekomamushi from discrimination in Wano Country during their youth, Inuarashi is extremely loyal to the heir of the Kozuki Family, whom he serves as a retainer alongside Nekomamushi. His loyalty to Oden and his family is so great that he risked sacrificing his kingdom and its inhabitants just to protect Raizo, another retainer of the clan, and later agreed to form a truce with his bitter rival Nekomamushi in order to appease Kozuki Momonosuke."}], "images": []}, {"title": "Nine Red Scabbards", "level": 4, "content": [{"type": "paragraph", "text": "Aside from Nekomamushi, Inuarashi has an extremely strong and close friendship with fellow members of the Nine Red Scabbards, even after twenty years of separation. Inuarashi risked his life and kingdom to protect Raizo from Jack, absolutely refusing to reveal Raizo's whereabouts even when brutally tortured to the point of losing his left leg. He was also happy to see Kin'emon and Kanjuro again, while wasting no time in allying with them to defeat Kaido."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Inuarashi is very grateful to the Straw Hats for saving the citizens of Zou after they were devastated by Jack's invasion. He does believe that Luffy will become the next Pirate King since he, along with Nekomamushi, willingly showed him and his crew Zou's Road Poneglyph. Also, he finds Brook to be delicious since he's made of bones."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "Inuarashi was willing to reason with Jack when the latter and his men attacked the Mokomo Dukedom, even giving him and his underlings the opportunity to search for Raizo unimpeded as long as they did so peacefully. However, Jack refused his offer, forcing Inuarashi to enter combat with him. When Jack used Caesar Clown's gas weapon to incapacitate the minks, he crucified Inuarashi and tortured him, which led to the Duke losing his left leg when he refused to reveal Raizo's location."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Nekomamushi", "level": 4, "content": [{"type": "paragraph", "text": "Inuarashi and Nekomamushi were once friends, but their friendship became strained after Oden's death. Because of this, they avoid meeting face-to-face. Upon accidentally meeting, they exchanged hostile words and insults before preparing to enter a battle to the death despite their respective injuries. It was hinted by Momonosuke that their quarrel is related to his father, Kozuki Oden."}, {"type": "paragraph", "text": "Despite their present-day enmity, Inuarashi and Nekomamushi agreed to form a truce in order to avoid agitating Momonosuke and while reminiscing about their past adventures, they became very jolly and friendly with each other again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c1/Inuarashi_vs_Nekomamushi.png/revision/latest/scale-to-width-down/210?cb=20161127204129", "caption": "Inuarashi clashes with Nekomamushi."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of the two rulers of the Mokomo Dukedom, Inuarashi holds a large amount of influence over the Mink Tribe. Inuarashi has full authority over the entirety of the Inuarashi Musketeer Squad, to the point of having control of the combat force delegated to Shishilian and the other two members of the three Musketeers, who take their orders directly from him."}, {"type": "paragraph", "text": "According to Wanda, he is the country's strongest warrior and fought evenly against Jack, the right hand man of the Yonko Kaido with a 1,000,000,000 bounty, before the latter poisoned him with Caesar Clown's Koro gas."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Alongside Nekomamushi, Inuarashi is one of the two strongest minks of the Mokomo Dukedom. He possesses immense physical strength, durability, and endurance, having stopped Jack's enormous trunk, which had destroyed several buildings in a single swing moments before, with one hand while only becoming slightly winded from doing so. Like all minks, he can use Electro. In the anime, Inuarashi applies immense force in his swordsmanship, allowing him to defend himself multiple times from Jack's assault in his giant mammoth form with only his rapier. Inuarashi is also extremely agile despite his large physique. In the anime, he could attack Jack at extremely high speed and swiftly evade and counter his assaults. He can even run on walls as shown when he sprinted on the surrounding buildings of Kurau City to gain an advantage in speed. Inuarashi is also proficient in kicks as he could kick with great force to topple Jack, a massive man, from behind and send him crashing into a building, demolishing it in the process."}, {"type": "paragraph", "text": "It is unknown how much the loss of his leg affects his overall combat abilities, but he managed to clash evenly with a one-armed Nekomamushi. The force of their clash is sufficient enough to create a powerful shockwave that blow the surrounding minks away. Inuarashi could also clash with Shutenmaru equally in swordplay."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/99/Inuarashi_vs_Jack.png/revision/latest/scale-to-width-down/220?cb=20180927123345", "caption": "Inuarashi clashes with Jack"}]}, {"title": "Swordmanship", "level": 3, "content": [{"type": "paragraph", "text": "As the leader of the Musketeers squad, Inuarashi has an extremely high level of skill in swordsmanship. He could easily hold his own against Jack in his Ancient Zoan form and could perform strong defensive blocks to defend against Jack's attacks with his sword. In the anime, he was shown combining Electro with his sword skills to use electricity enhanced slashes for powerful offense. Inuarashi's swordsmanship is enough to clash with Nekomamushi's spearmanship."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Inuarashi wields a rapier, which he can channel Electro through. While dueling Ashura Doji, he wielded a katana."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Inuarashi possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Retainer of the Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "In the distant past, Inuarashi and Nekomamushi were friends. When they were children, they were told of the pact the Mink Tribe made with the Kozuki Family. Curious, they left Zou and journeyed to Wano Country, but got shipwrecked. They were discovered at Kuri Beach by Kawamatsu. Afterwards, the three were caught and persecuted by some humans until Kozuki Oden came and rescued them. They then followed Oden back to Kuri and became his retainers."}, {"type": "paragraph", "text": "When they were running low on funds, the retainers attempted to steal money from Shimotsuki Yasuie, but they were caught. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Oden and Wano. Following Yasuie's advice, they educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "After meeting the Whitebeard Pirates, Oden and his retainers had a feast with them. Inuarashi and Nekomamushi also learned from Marco on how vast the world is. Two weeks later, the two minks stowed away on Whitebeard's ship before they left Wano, knowing that Oden would not stop wanting to get on their ship. They revealed themselves after Whitebeard accepted Oden into the crew three days later. Afterwards, they traveled the seas together with the crew."}, {"type": "paragraph", "text": "The two minks and Oden later sailed with Gol D. Roger. However, Inuarashi and Nekomamushi never went to Laugh Tale."}, {"type": "paragraph", "text": "After Oden was executed by the shogun Orochi, Inuarashi and Nekomamushi began quarreling with each other on the way back to Oden Castle, but the two minks were captured by Orochi's forces and they were left behind by the other retainers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Past_Nine_Red_Scabbards.png/revision/latest/scale-to-width-down/180?cb=20191125141345", "caption": "Young Inuarashi along with his fellow Nine Red Scabbards after they were caught stealing by Yasuie."}]}, {"title": "Ruler of the Day", "level": 4, "content": [{"type": "paragraph", "text": "They managed to escape and return to Zou barely alive, but they continued their feud to the point that they began fighting whenever they were together, so they decided that Inuarashi would rule Zou during the day and Nekomamushi would rule during the night."}, {"type": "paragraph", "text": "When Jack and the Beasts Pirates invaded the Mokomo Dukedom in search of Raizo the ninja, Inuarashi arrived to confront Jack while the Musketeer Squad battled Jack's subordinates. Inuarashi tried to reason with Jack and stated that they would be allowed to search for Raizo if he ceased the destruction, but Jack responded by attacking Inuarashi with his trunk. After easily blocking the blow, Inuarashi clashed with Jack until 6 pm, where he and his forces retreated so that Nekomamushi and his warriors could continue the fight in their stead."}, {"type": "paragraph", "text": "The battle against the Beast Pirates lasted for five days, with Nekomamushi and Inuarashi taking turns fighting against Jack. On the fifth day of the battle, Jack lost his patience and used Caesar Clown's Koro gas to poison the minks. With the Mink Tribe rendered helpless, Jack tortured the strongest of them, including Inuarashi and Nekomamushi. During the torture, Inuarashi lost his left leg. The torture ceased when Jack heard about Doflamingo's defeat and capture, causing Jack to leave Zou in order to rescue him while leaving behind some of his subordinates."}, {"type": "paragraph", "text": "After Sanji's group arrived, they forced the Beasts Pirates to retreat and Caesar to neutralize the poison gas before tending to the wounded, which saved the Mink Tribe. However, Inuarashi fell into a deep coma."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Inuarashi_Stops_Jack.png/revision/latest/scale-to-width-down/210?cb=20161119231325", "caption": "Inuarashi stops Jack's attack."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/96/Inuarashi_Defeated.png/revision/latest/scale-to-width-down/210?cb=20161119232717", "caption": "Inuarashi is defeated by Jack and crucified."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the day Luffy's group arrived on Zou, Inuarashi awoke from his coma and wished to meet the Straw Hat Pirates, prompting Chopper, Miyagi, and Tristan to rush to his quarters in order to check up on him."}, {"type": "paragraph", "text": "After the other Straw Hats arrived with Wanda, Inuarashi thanked all of them for saving his country. When Monkey D. Luffy commented on how powerful he looked, Inuarashi dismissed this as being something that could not be said about the defeated, which prompted Wanda to remind him that the minks had the upper hand against the Beasts Pirates until Jack brought in his gas weapon."}, {"type": "paragraph", "text": "Salivating at the sight of Brook and his body of bones, which he decided to chew on later, Inuarashi noticed Luffy's straw hat and revealed that he had once traveled the seas with Nekomamushi and encountered Shanks. However, before Luffy could explain how Shanks had been the one to give him his hat, Inuarashi suddenly fell asleep due to dusk arriving. A few minutes later, Inuarashi briefly woke up to explain how Luffy's group indirectly forced Jack to leave Zou before falling asleep once more."}, {"type": "paragraph", "text": "The next morning, Inuarashi was alerted by Bariete ringing the town bells. After arriving at Kurau City, Inuarashi accidentally made eye contact with Nekomamushi, causing the two of them to confront each other. After trading insults and commenting on each other's lost limbs, Inuarashi and Nekomamushi began a fight to the death, but stopped when Kin'emon revealed himself and declared his status as a retainer of the Kozuki Family. When Kin'emon asked them if Raizo had come here, a tearful Inuarashi knelt alongside the rest of the minks and revealed that Raizo was safe before smiling as Kin'emon expressed his relief."}, {"type": "paragraph", "text": "While conversing with Kin'emon, Inuarashi and Nekomamushi began arguing again, prompting Kozuki Momonosuke to reprimand them for doing so because it would make his father sad to see them behaving like this. Not wanting to disappoint their lord, Inuarashi and Nekomamushi apologized and called a truce, to the delight of their fellow minks. Shortly afterward, Inuarashi and Nekomamushi escorted the samurais and the Straw Hats to a secret area in the Whale Forest where Raizo was hidden. When Nico Robin saw the red Poneglyph that Raizo had been chained to, Inuarashi noted that it was made for a different purpose than the regular Poneglyphs were and gave Robin permission to read it."}, {"type": "paragraph", "text": "After Robin deciphered the red Poneglyph, Inuarashi revealed that it was one of four Road Poneglyphs that would reveal the location of Laugh Tale when their information was combined. Soon afterward, he began weeping when the samurais revealed Kozuki Oden's execution at the hands of Kaido and the shogun of Wano Country."}, {"type": "paragraph", "text": "Having revealed that Oden was part of Gol D. Roger's crew, the samurais and the two rulers of Zou revealed his will to open the Wano Country to the world. After he and Nekomamushi declared that the Mink Tribe would help the Kozuki Family fight Kaido and the shogun of Wano Country, Inuarashi claimed that the minks would show their true strength the next time they faced the Beasts Pirates before shedding tears at the sight of Momonosuke vowing to avenge the deaths of his parents and protect his retainers. After Luffy agreed to help Momonosuke defeat Kaido, Inuarashi officially formed the Ninja-Pirate-Mink-Samurai Alliance with Momonosuke, Luffy, and Law. Upon learning of Sanji's arranged marriage with Big Mom's daughter Charlotte Pudding, Inuarashi asked Luffy if he would be alright while going up against a Yonko before expressing confusion at Luffy's mention of Pekomamushi."}, {"type": "paragraph", "text": "As group left the secret room, Inuarashi revealed that he and Nekomamushi once traveled with Oden aboard the ships of both Whitebeard and Roger, though they never went to Laugh Tale. As he reminisced about his days of adventure, Inuarashi happily danced with Nekomamushi while he did the same. Hearing Nami's concern about their journey to the end of the Grand Line in regards to what they had just learned about Laugh Tale's location, Inuarashi revealed that the last island on the Grand Line, while not actually Laugh Tale, still held significance and explained that the Straw Hats had merely learned the information regarding the poneglyphs and Laugh Tale that was on that island far in advance. After praising Nami's skills as a navigator, Inuarashi continued descending the Whale Tree while noting that Marco, whom they intended to have join their alliance, might not readily aid them. Suddenly, Zou began shaking violently, causing a shocked Inuarashi to note that he had never felt anything like this."}, {"type": "paragraph", "text": "As everyone scrambled to find something to hold onto, Inuarashi was shocked to learn that Luffy could also hear Zunesha's voice. Upon learning from Momonosuke that Jack had returned and was attacking Zunesha from the sea, Inuarashi mobilized the minks to send out their ships and engage Jack, but was shocked to learn that Zunesha sank Jack's fleet with its trunk at Momonosuke's command. Afterward, Inuarashi admitted he had never even considered that Zunesha possessed its own will or could respond to commands."}, {"type": "paragraph", "text": "When Momonosuke chose to remain on Zou in order to communicate further with Zunesha, Inuarashi decided to stay with him in order to guard Zou from the threat of Kaido and promised to bring Momonosuke back to Wano at a later date. Upon hearing Kin'emon wondering if the separate teams would maintain contact with one another via Den Den Mushi, Inuarashi admitted that the inhabitants of Zou did not use the communication snails. Soon afterward, as the Sanji retrieval team departed from Zou, Inuarashi, along with the rest of those present save the Straw Hats left behind, was shocked when Luffy jumped off Zunesha with his party."}, {"type": "paragraph", "text": "As Inuarashi stood watch at Zou's entrance, Wanda asked him to rest and said that they could post some guards, but Inuarashi was deeply concerned about how the Beasts Pirates located Zou and suspected that they might return."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d1/Audience_with_Inuarashi.png/revision/latest/scale-to-width-down/210?cb=20161002185325", "caption": "Inuarashi meets the Straw Hats, his saviors."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Raizo_is_Safe.png/revision/latest/scale-to-width-down/210?cb=20161204162210", "caption": "Inuarashi and the minks reveal that Raizo is safe."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/Reunion_with_Raizo.png/revision/latest/scale-to-width-down/210?cb=20161218151655", "caption": "The minks take their allies to Raizo and a red poneglyph."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Zou_Begins_Shaking.png/revision/latest/scale-to-width-down/210?cb=20160411121730", "caption": "Zou begins shaking due to Jack's attack."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Inuarashi and his group later arrived at Wano Country. At Kuri Beach, Inuarashi reminisced about his first meeting with Oden. He and his group later found a severely injured Tama at a wasteland. As they took the girl to the forest for medical treatment, Inuarashi scorned Kaido for his actions."}, {"type": "paragraph", "text": "At Mt. Atama, Inuarashi clashed with Ashura Doji, but the fight was interrupted by Kin'emon. Sometime later, the Musketeers worked to steal food and weapons from the Beasts Pirates and they left a note saying that Ashura and his gang were responsible for the thefts."}, {"type": "paragraph", "text": "At an abandoned village in Kuri, Inuarashi was surprised to hear that the Beasts Pirates found out about Kin'emon's secret message. After Mt. Atama was set on fire, Kin'emon and Inuarashi heard that Ashura was going to Bakura Town to confront the Beasts Pirates there and the two went after him. They later entered Bakura Town and caught up with Ashura on the way. They also witnessed Yasuie's execution on the broadcast and mourned his death. After the execution, Ashura asked Inuarashi and Kin'emon if they knew about the SMILE fruits."}, {"type": "paragraph", "text": "Outside Bakura Town, Ashura learned that he was framed for theft and got angry. Inuarashi and Kin'emon apologized and once again asked Ashura to join them. Ashura then told them to follow him, wanting to show them something. Later, Ashura showed them the graves of their dead comrades and explained what had happened to their allies ten years ago. He recounted how they had all lost patience and had tried to fight Kaido, but were all killed in battle. Afterwards, Ashura decided to rejoin his comrades. Inuarashi and Ashura then rejoiced and bragged to Kin'emon about how they had twenty years more fighting experience than him now. In response, Kin'emon called them a duo of geezers and the three began arguing."}, {"type": "paragraph", "text": "Ashura later took Kin'emon and Inuarashi to an abandoned port and showed them ships that could carry their troops to Onigashima. Inuarashi and Kin'emon also received the blueprints of Kaido's residence from Ashura. While Kin'emon was speaking to Raizo via Smart Tanishi, Inuarashi was surprised to hear about the number of allies Raizo's group had gained at Udon. He later joined a meeting with several key alliance members at Amigasa Village."}, {"type": "paragraph", "text": "The group then learned from Zoro and Kawamatsu that Hiyori is alive. On the day for the raid on Onigashima, Inuarashi marched to the rebel meeting place with Momonosuke, Kin'emon, Kanjuro, Raizo, Shinobu, Kikunojo, Kawamatsu, and Ashura. The group eventually arrived at the meeting place, but found none of their ships and allies. In spite of this major setback, the Scabbards were still determined to go through with the raid, knowing that they would not get another chance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ec/Shutenmaru_vs._Inuarashi.png/revision/latest/scale-to-width-down/210?cb=20181201070136", "caption": "Inuarashi clashes with Shutenmaru as the latter refuses to help the Kozuki Family again."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Inuarashi vs. Nekomamushi (multiple times)", "elements": []}, {"text": "Mink Tribe and Heart Pirates vs. Beasts Pirates", "elements": [{"text": "Inuarashi vs. Jack (multiple times)", "elements": []}]}, {"text": "Inuarashi vs. Nekomamushi (Kurau City) (interrupted)", "elements": []}, {"text": "Inuarashi vs. Shutenmaru", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Inu Arashi\" means \"Dog Storm\". The second part could also be short for \"porcupine\" (ヤマアラシ, yamaarashi), which would match Nekomamushi's naming scheme of two animals. The Viz translation originally used the latter translation, referring to him as \"Dogupine\". However, they later switched to the former translation and now refer to him as \"Dogstorm\".", "elements": []}]}], "images": []}]}