{"sections": [{"title": "Miyagi", "level": 1, "content": [{"type": "paragraph", "text": "Miyagi is a goat mink and one of Inuarashi's subjects."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Miyagi is a male goat mink with a thickset body covered in light-colored hair. He has two pointed horns on the top of his head and a long beard, and wears a white doctor's jacket, black pants, and black boots."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/ff/Miyagi_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20181123082932", "caption": "Miyagi's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He was very eager to help Tony Tony Chopper tend to Duke Inuarashi after the latter awoke from his coma because of the learning experience it would provide, having been impressed by Chopper's mix of the Sakura Kingdom's medical expertise and the Torino Kingdom's medicinal knowledge. He is also curious as to where Zunesha has been heading while it has walked the oceans for the past 1000 years."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a doctor, Miyagi has some medical expertise, having helped Chopper treat other minks who were poisoned by the Koro gas and later being called to help tend to Inuarashi after the latter woke from his coma."}, {"type": "paragraph", "text": "As a mink, he is a natural-born fighter and can use Electro."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "After Caesar Clown neutralized the poison gas that Jack used to devastate the Mokomo Dukedom, Miyagi helped Tony Tony Chopper treat the poisoned minks."}], "images": []}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "When it was reported that Inuarashi had woken from his coma, Miyagi and Tristan excitedly ran after Chopper to help him tend to the duke. At the duke's home, Miyagi, Tristan, and Chopper were tending to the duke when Wanda brought the rest of the Straw Hat Pirates. When dusk arrived, Miyagi and Tristan fell asleep."}, {"type": "paragraph", "text": "The following day, as Bariete rang the bell and spoke of the arrival of samurai, Miyagi and the rest of the minks rushed to Kurau City. When Kin'emon and Kanjuro revealed themselves, Miyagi and the minks welcomed them and revealed that Raizo was on Zou before standing proudly at having kept his presence a secret."}, {"type": "paragraph", "text": "When Inuarashi, Nekomamushi, the samurai, and the pirates returned from the Whale Tree with Raizo, Zou began shaking as Zunesha started crying out, throwing Miyagi and the others into a state of panic. Jack had returned and was attempting to destroy Zou by killing Zunesha, who retaliated on Kozuki Momonosuke's command and sank Jack's fleet with one blow, calming down Miyagi and the others in the process."}, {"type": "paragraph", "text": "Shortly afterward, Miyagi, Chopper, and several other minks treated Zunesha's injured leg, with Miyagi praising Chopper's combination of the Sakura Kingdom's medical expertise and the Torino Kingdom's medicinal knowledge. As he marveled at Zunesha's ability to hear and understand, Miyagi noted that the Mink Tribe's residence on Zou would one day come to an end before wondering where Zunesha had been heading for the past 1000 years."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Chopper_and_Minks_Heal_Zunesha.png/revision/latest/scale-to-width-down/210?cb=20160411120742", "caption": "Miyagi and the minks help Chopper treat Zunesha's injured leg."}]}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Mink Tribe later infiltrated Wano Country. Miyagi was next seen at Amigasa Village tending to Tama."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yagi (ヤギ, Yagi) means \"goat\" in Japanese.", "elements": []}]}], "images": []}]}