{"sections": [{"title": "Tristan", "level": 1, "content": [{"type": "paragraph", "text": "Tristan is a squirrel mink and one of Inuarashi's subjects."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tristan is a light blue-haired squirrel mink with tan fur, a dark patch on her forehead down to her nose, and a large bushy brown tail with two dark stripes down the center."}, {"type": "paragraph", "text": "She wears a frilly yellow blouse with short puffy sleeves, a pink skirt with two layers, and red pumps."}, {"type": "paragraph", "text": "Her nurse's uniform is a light-pink minidress and a light-pink cap with a cross on it (a red horizontal stripe in the anime)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/Tristan_Dress.png/revision/latest/scale-to-width-down/135?cb=20161119235632", "caption": "Tristan in casual clothes."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Tristan is shown to be a friendly mink to those who are kind to her and her tribe. As a nurse, Tristan does her job in tending to the injured, though she believes that doctors like Miyagi should not be overly enthusiastic when tending to their patients or learning from other doctors."}, {"type": "paragraph", "text": "Tristan is scared by strange people, having run off in fear after seeing a skeleton and a dragon talking to each other."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a mink, Tristan is a natural-born fighter and can use Electro, the skill to produce electric shocks."}, {"type": "paragraph", "text": "As a nurse, she has some medical skill, having been called by Tony Tony Chopper to help tend to Inuarashi."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Beasts Pirates' attack on Zou, Tristan was being chased by Sheepshead when she encountered Sanji, Nami, Tony Tony Chopper, Brook, Momonosuke, and Caesar Clown. After Sanji's group tripped Sheepshead's alligator by covering the ground in ice, Tristan ran away from them, having been scared by the presence of a talking skeleton and dragon."}, {"type": "paragraph", "text": "After the Straw Hats fought off the Beasts Pirates, they wondered where Tristan had run off as Tristan watched them from behind a tree."}, {"type": "paragraph", "text": "After Caesar neutralized the poison gas, Wanda attacked Nami, thinking that she and her group were with Jack, but Tristan and Pedro calmed her down by revealing that they were not the enemy. With Chopper directing them, Sanji's group and all the minks that could move began to treat the injured."}, {"type": "paragraph", "text": "Later, as the minks continued to recover from the Beasts Pirates' assault, Tristan observed that Sanji seemed to like greeting people as he went around displaying affection toward the female minks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/96/Tristan_Hiding.png/revision/latest/scale-to-width-down/210?cb=20160424225937", "caption": "Tristan hides behind a tree."}]}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "When it was reported that Duke Inuarashi had woken from his coma, Tristan followed Chopper and Miyagi to tend to him while telling Miyagi that he was being too enthusiastic. At the duke's home, Tristan, Miyagi, and Chopper tended to the duke until Wanda brought the rest of the Straw Hats. When dusk arrived, Tristan and Miyagi fell asleep."}, {"type": "paragraph", "text": "The next day, she requested to join the Sanji retrieval team as Chopper's assistant, but was turned down in favor of Pedro since he could keep Pekoms under control."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Mink Tribe later infiltrated Wano Country. Tristan was next seen at Amigasa Village tending to Tama."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her romanized name, Torisutan, contains risu, the Japanese word for squirrel.", "elements": []}]}], "images": []}]}