{"sections": [{"title": "Shishilian", "level": 1, "content": [{"type": "paragraph", "text": "\"Full Power\" Shishilian is a lion mink and the captain of the Inuarashi Musketeer Squad, as well as one of the Three Inuarashi Musketeers leading the squad."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Shishilian is a lion mink with a curly red mane that falls down to his chest, a long and curly tail, and a swirly black handlebar mustache. He wears a purple cape and a large black hat with a feathery pink plume over a olive colored dress shirt bound with a bandolier, black pants held up by a thick red belt, brown boots with puffy furred pink rims, and purple gloves."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shishilian approaches every situation with his entire being in a very over-the-top and dramatic manner, such as making a flying leap before kneeling in gratitude. If people talk about \"sweet\" things like affection and sugar in his presence, Shishilian will throw them into the Bottomless Valley near Inuarashi's sanatorium and force them to climb back up because he despises such things."}, {"type": "paragraph", "text": "Despite his aversion to \"sweet\" emotions, Shishilian is more than willing to express gratitude, having knelt before the newly-arrived Straw Hat Pirates while proclaiming that he was forever indebted to them and later tried to accompany Monkey D. Luffy on his journey to stop Sanji's wedding alongside the other two Inuarashi Musketeers. He was also saddened by the death of his rival Pedro and paid respects at his grave marker."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of the Three Inuarashi Musketeers, Shishilian has authority over the rest of the Musketeers."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Shishilian is an extremely powerful warrior even among the minks. Like his fellow minks, Shishilian can use Electro."}, {"type": "paragraph", "text": "Shishilian has extreme level of superhuman strength, as the force of his sword strikes can easily cut down multiple Artificial Zoan Devil Fruit users of the Beast Pirates. Even when injured, Shishilian can throw down multiple members of the Musketeers to roughen them up. In the anime, he even lifted an entire giant pineapple building and threw it down on his subordinates. Shishilian is also extremely fast and agile. In the anime, he could instantly cut down multiple Gifters, including the Gifters Grip Trio, without giving them time to retaliate."}], "images": []}, {"title": "Swordmanship", "level": 3, "content": [{"type": "paragraph", "text": "Shishilian is extremely skilled in swordsmanship. In the anime, alongside his fellow Inuarashi Musketeers, Shishilian expertly cut down numerous Gifters who were powerful enough to brutally overpower the other Musketeers with their Artificial Zoan Devil Fruit abilities, including the Gifters Grip Trio. Shishilian's sword style is highly aggressive, reflecting his fierce personality of going all out, swiftly cutting down numerous enemies in an instant."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Shishilian wields a rapier, which he can channel Electro through."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Shishilian tried training Carrot in swordsmanship, but Pedro commented that Carrot lacked the talent in using a sword, much to Shishilian's annoyance."}, {"type": "paragraph", "text": "When the Beasts Pirates, led by Jack, invaded Zou in search of Raizo, Shishilian and the rest of the Inuarashi Musketeer Squad fought against them, with Shishilian himself saving Wanda from a Gifter while ordering the agile Musketeers to lead the townspeople to the forest. When dusk fell, Shishilian and the musketeers fell back to allow Nekomamushi and the Guardians to take over the battle."}, {"type": "paragraph", "text": "The battle against the Beast Pirates lasted for five days. On the fifth day of the battle, Jack lost his patience and unleashed Caesar Clown's Koro gas, which left the Mink Tribe poisoned and drastically weakened. As one of the strongest mink warriors, Shishilian was crucified and tortured for information regarding Raizo, though he denied having any knowledge of the ninja and his whereabouts. The following day, Jack left Zou after hearing about Donquixote Doflamingo's defeat and capture, and the minks were later saved when Sanji and his group came to Zou."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/70/Mink_Tribe_Given_The_Koro_Antidote.png/revision/latest/scale-to-width-down/210?cb=20161119235231", "caption": "Shishilian is given an antidote to his Koro poisoning."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "While guarding Inuarashi's sanatorium, Shishilian threw several minks into the Bottomless Valley for speaking of sweet things in his presence. When Wanda brought the Straw Hat Pirates to see Inuarashi, Shishilian knelt before them and expressed his gratitude before allowing them to enter the sanatorium."}, {"type": "paragraph", "text": "At 6:00 P.M., Shishilian explained how the city-dwellers were active during the day while the forest-dwellers were active at night before falling asleep."}, {"type": "paragraph", "text": "The following day, as Bariete rang the bell and spoke of the arrival of samurai, Shishilian and the rest of the minks rushed to Kurau City. When Kin'emon and Kanjuro revealed themselves, Shishilian and the minks welcomed them and revealed that Raizo was on Zou before standing proudly at having kept his presence a secret. Kin'emon showed Shishilian and the other minks the crest of the Kozuki Family on his back to confirm his allegiance. When Inuarashi and Nekomamushi reluctantly called a truce for the sake of Kozuki Momonosuke, whom they recognized as their lord, Shishilian and the rest of the minks were overjoyed."}, {"type": "paragraph", "text": "When Inuarashi, Nekomamushi, the samurai, and the pirates returned from the Whale Tree with Raizo, Zou began shaking as Zunesha started crying out, throwing Shishilian and the others into a state of panic. Jack had returned and was attempting to destroy Zou by killing Zunesha, who retaliated on Momonosuke's command and sank Jack's fleet with one blow, calming down Shishilian and the others in the process."}, {"type": "paragraph", "text": "Later on, he requested to accompany the Sanji retrieval team to Whole Cake Island, but was told to stay behind on Zou by Nekomamushi."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Shishilian later went with Inuarashi to Wano Country. He and his group later found a severely injured Tama at a wasteland. At Mt. Mt. Atama, Shishilian witnessed Inuarashi's clash with Shutenmaru. Sometime later, the Musketeers worked to steal food and weapons from the Beasts Pirates and they left a note saying that Shutenmaru and his gang were responsible for the thefts."}, {"type": "paragraph", "text": "Prior to the raid on Onigashima, Shishilian, Wanda, and Carrot were later at the place where graves for Pedro and Yasuie were placed. While having a discussion with Nami, Robin, Wanda, and Carrot in Amigasa Village, the Three Inuarashi Musketeers talked about how the weather conditions could affect their chances in battle."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mink Tribe vs. Beasts Pirates", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Shishilian vs. Jack", "elements": []}, {"text": "Shishilian vs. Gifters Grip Trio", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Shishi\" (シシ, \"Shishi\") means lion in Japanese. His name is a portmanteau of \"Shishi\" and \"Sicilian\"", "elements": []}, {"text": "\"Shi\" means four in Japanese, so his birthday (4/4) may be a pun on his name.", "elements": []}, {"text": "Shishilian's habit of throwing people into the Bottomless Valley when they speak of sweet things reflects the exaggerated urban belief that lions throw their cubs off of cliffs in order to toughen them up.", "elements": []}]}], "images": []}]}