{"sections": [{"title": "Monjii", "level": 1, "content": [{"type": "paragraph", "text": "Monjii is a monkey mink."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Monjii is an elderly monkey mink with long, white eyebrows and a mustache connected to a chest-length beard. He wears a dark cloak, a hat, and baggy striped pants."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Monjii is a mink of enormous calm and composure; when confronted by the fearsome Beasts Pirates and the Calamity Jack, he remained undaunted and insisted on settling the matter peacefully through conversation while trying to reason with Jack, despite the latter's aggression and Monjii's own ability to fight."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a mink, Monjii is a natural-born warrior and still retained his high physical prowess in his old age and can use Electro. He is also very agile."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When the Beasts Pirates, led by Jack, arrived on Zou in search of Raizo, Monjii tried to reason with them, but Jack angrily rejected his attempt at diplomacy. After the Pleasures attacked and were repelled by the minks, Monjii revealed that all the minks were warriors from birth and tried to convince Jack to talk to Inuarashi in order to avoid a war that would cause both sides to suffer greatly, but Jack refused and ordered the Gifters to attack."}, {"type": "paragraph", "text": "The battle against the Beast Pirates lasted for five days. On the fifth day of the battle, Jack lost his patience and unleashed Caesar Clown's Koro gas, which left the Mink Tribe poisoned and drastically weakened. The following day, Jack left Zou after hearing about Donquixote Doflamingo's defeat and capture, and the minks were later saved when Sanji and his group came to Zou."}], "images": []}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the other Straw Hat Pirates came to Zou, Monjii took part in a feast with them while offering Zoro some wine."}, {"type": "paragraph", "text": "The following day, as Bariete rang the bell and spoke of the arrival of samurai, Monjii and the rest of the minks rushed to Kurau City. When Kin'emon and Kanjuro revealed themselves, Monjii and the minks welcomed them and revealed that Raizo was on Zou before standing proudly at having kept his presence a secret."}, {"type": "paragraph", "text": "When Inuarashi, Nekomamushi, the samurais, and the pirates returned from the Whale Tree with Raizo, Zou began shaking as Zunesha started crying out, throwing Monjii and the others into a state of panic. Jack had returned and was attempting to destroy Zou by killing Zunesha, who retaliated on Kozuki Momonosuke's command and sank Jack's fleet with one blow, calming down Monjii and the others in the process."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is likely a combination of monkey and jii, a way of addressing old men.", "elements": []}]}], "images": []}]}