{"sections": [{"title": "Blueno", "level": 1, "content": [{"type": "paragraph", "text": "Blueno was an assassin of CP9 who worked undercover as the bartender of a bar in Water 7."}, {"type": "paragraph", "text": "He was one of the major antagonists during the Water 7 Arc and a minor antagonist during the Enies Lobby Arc. After these events, Blueno has become a fugitive from the World Government along with the other members of CP9."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a tall man with big lips, a black beard, and black hair in which his hairstyle resembles the horns of a bull. During his time as a bartender, he wore a black and yellow polka-dotted shirt with an apron over it. As a CP9 member, he wore a black two-piece suit with white handkerchief in his breast pocket and a sweater undershirt. During his contact with Robin in Water 7 and the attempts to assassinate Iceburg, he wore a checkered pattern cloak with necklaces of beads. Accompanying this costume, he wore two masks. First he wore a female mask, then a bear mask after the former was left in the Galley-La Company."}, {"type": "paragraph", "text": "In the Volume 44 SBS, it was revealed that when Blueno was younger, he loved baseball. Otherwise, he looked similar to his current age aside from a more youthful appearance, lacking a beard, and had a bandage on the right corner of his forehead. He also seemed less bulky and a little more overweight during his training period around the time of Gol D. Roger's execution, but his limbs were much thinner during the SBS explanation."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "While the entire Water 7 CP9 unit gave the initial expression of emotionless, justice-devoted killing machines, Blueno is the only one to maintain such a facade; while the others—Kaku, Lucci, Kalifa, Jabra, Fukurou, and Kumadori—are shown taking pleasure in fighting, toying with their opponents, and so on, Blueno remains calm and collected nearly all the time, implying that this is his natural personality. As a result, Blueno comes to symbolize the cynical, evil actions of the World Government—namely using Nico Robin, by blackmailing her through traumas inflicted by the World Government in the first place."}, {"type": "paragraph", "text": "He is also a calculating and perceptive man as he was the only CP9 agent who noticed that Spandam's Den Den Mushi was off the hook and guessed that something was amiss in Enies Lobby, causing him to leave the Tower of Justice to investigate and to confront Luffy after his suspicions were proven right."}, {"type": "paragraph", "text": "Like the others, he is greatly shocked when a pirate managed to fight on par and even overwhelm him. He has great faith in his own powers and his Rokushiki ability."}, {"type": "paragraph", "text": "He also does not believe in things that are not proven to him, as demonstrated when Jabra was scared of other devil fruits due to the myth about devils inside devil fruits."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Blueno is highly intelligent and cunning, being able to maintain the disguise of a friendly bartender in Water 7 for approximately five years while simultaneously searching for the blueprints of the legendary Pluton vessel in the city, without attracting any suspicion or attention."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "From intense training in the Rokushiki martial arts, Blueno has incredible superhuman physical strength with a 820 Doriki. He can easily overpower all of Galley La shipwrights who are highly skilled and powerful fighters. He can knock out Tilestone, a very large and strong man in one punch."}, {"type": "paragraph", "text": "He is extremely agile with sharp reflexes, able to move at extreme speed while using Soru and dodged all of Luffy's punches at point blank range. Blueno also has superior durability and endurance. With his Tekkai, he destroyed Tilestone's hammer by recoil when it struck his left arm. He could also withstand Sanji's kicks that can smash steel and monsters with great ease and also all of Luffy's Gear Second enhanced attacks and later recovered enough to rescue his fellow CP9 agents by himself."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Blueno ate the Doa Doa no Mi, a Paramecia-type Devil Fruit which allows him to create doors on any surface. He has even created \"air doors\", doors in the air itself, which lead to what seems to be another dimension, allowing him to travel great distances and enter a safe haven where his opponents cannot reach."}, {"type": "paragraph", "text": "Blueno is also able to create doors on people, and did so to Luffy's face, causing it to spin like a revolving door. In battle, Blueno also uses his door to move freely through the entire environment, setting himself up for sneak attacks, and even creating small doors wherein he traps his opponents' feet."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/04/Doa_Doa_no_Mi_Infobox.png/revision/latest/scale-to-width-down/220?cb=20130629174737", "caption": "The Doa Doa no Mi being used."}]}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Blueno's Tekkai seems to be the one of the more powerful of the group, and he was the first to reveal any variations of the move. While not a master at the level of Jabra, Blueno understands the physics of Tekkai well enough to develop variants such as \"Wheel\" that allow him mobility in conjunction with Tekkai. In addition, he displays a level of tactical prowess, taking his time to determine how to minimize Luffy's increased speed."}, {"type": "paragraph", "text": "However, despite this advantage, Luffy was able to use his new Gear Second abilities to defeat him when they fought in Enies Lobby. Lucci stated that Blueno's bartender job has dulled his senses, but it might just be another show of the arrogance of most of the CP9 unit. Nevertheless, with Luffy only having recently developed his Gear Second mode around the time when he used it against Blueno for the first time in combat, Blueno has been made memorable as the first adversary to receive the honor of witnessing Gear Second's first activation, as well as the first to be subsequently felled by Luffy while in this state. Bearing a Doriki of 820, Blueno was no run-of-the-mill fighter, though his power still paled in comparison to the top three members, Jabra, Kaku, and Rob Lucci."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Blueno possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Early Years", "level": 4, "content": [{"type": "paragraph", "text": "Twenty-two years before the start of the series, a ten-year old Blueno (alongside a fifteen-year old Jabra and an eight-year old Rob Lucci) was seen training to master the Rokushiki style and in assassination with the other CP9 hopefuls on their homeland when Gol D. Roger was executed. They trained hard in order to be \"stronger than justice\"."}], "images": []}, {"title": "CP9's Secret Mission", "level": 4, "content": [{"type": "paragraph", "text": "Five years before the current storyline, four members of the secret organization CP9 took guises in the city of Water 7. While Rob Lucci, Kaku, and Kalifa became employees of the Galley-La Company (respectively carpenters and secretary), Blueno became a bartender. While gaining the city's trust and respect, they tried to get close enough to take the Pluton blueprints in Iceburg's possession. Unknown to them, a year later, Iceburg had passed the blueprints to Tom's other pupil, Cutty Flam, who is better known as Franky."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Blueno was first shown, he was a bartender in Water 7 and seemed to be the most friendly with Franky and Paulie, talking with them about life and their current activities. He had a friendly talk with Franky and Kokoro about the mystery if CP9 was real or not from what Kokoro had heard of, unaware that Blueno was a member himself."}, {"type": "paragraph", "text": "He soon showed his true nature when he, along with the rest of CP9, attacked Paulie and Iceburg for the Pluton blueprints. He was the agent that Robin ran into on the streets in Water 7 while she was with Chopper, as well as the agent whose Devil Fruit powers were used in both attempted assassinations of Iceburg. He fought with the Straw Hats and showed off the powers of his Rokushiki abilities. They left after setting the building on fire, framing the Straw Hats for it and leaving Iceburg and Paulie in the fire."}, {"type": "paragraph", "text": "CP9 later went to Franky's hideout to search for the Pluton blueprints. When they could not find the blueprints, they captured Franky and Usopp though Blueno needed Lucci's help in subduing Franky."}, {"type": "paragraph", "text": "During the journey to Enies Lobby on the Sea Train, Blueno thwarted Sanji, Franky, and Sogeking's attempt to rescue Nico Robin. Sanji tried to kick him away with his strongest kicks, and Blueno winced from the force, causing Lucci to claim that his time as a bartender weakened his skills. When Franky tried to separate the carts with his strength, Blueno used his air door ability to get to the other cart to get Robin back. He easily defeated Sogeking and mocked Sanji for being no match for CP9 while stating they knew nothing about Robin's past and it was for the best if she died. Sanji tried to stop him from leaving with Robin, but was unable to stop them from disappearing."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Eventually, Blueno and the others eventually arrived at Enies Lobby. They then met up with the other members that they had not seen in years and their boss Spandam. Fukurou then tested the others' Doriki and revealed that Blueno had a level of 820. When Spandam gave Kaku and Kalifa Devil Fruits, Jabra was shocked and scarred being around them. Blueno corrected Jabra on his view on Devil Fruits when the latter was fearful that the two fruits Spandam presented to Kaku and Kalifa would cause him to explode upon contact due to his own powers."}, {"type": "paragraph", "text": "During the debriefing, Blueno noticed Spandam's Den Den Mushi was off the hook and realized something was amiss when the Straw Hats invaded Enies Lobby. His instincts proved right as he met Luffy on the roof of the Courthouse of Justice and confronted him. He told Luffy about how there are over 170 nations in unity with the World Government all over the world and declaring war at Enies Lobby would make them enemies of the whole world. Luffy did not care about that and decided to fight Blueno to get to Robin. Unlike their last encounter at Water 7, Luffy managed to break through his Tekkai and figured out the \"Soru\" move to battle him evenly. Not only that, Luffy revealed his new Gear Second technique to him, literally pounding the CP9 agent around the roof. After a bit more fighting, Luffy went to finish him off with a Jet Bazooka. Rather than dodging the attack, Blueno decided to take it head on with his strongest Tekkai, Tekkai Gou, which allowed him to stay on his feet after the impact. Luffy was then about to show his Gear Third technique to him, but Blueno collapsed shortly thereafter, having been knocked out from the Gear Second move before in a delayed reaction."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Rokushiki_Infobox.png/revision/latest/scale-to-width-down/230?cb=20140801103658", "caption": "Blueno fighting Luffy."}]}, {"title": "CP9's Independent Report", "level": 3, "content": [{"type": "paragraph", "text": "After the Buster Call left Enies Lobby in ruins, Blueno turned out to be the savior of CP9, using his Air Door to protect them from the annihilation of the island by the Marine onslaught. They had survived through their fights against the Straw Hats despite their injuries, but Rob Lucci had sustained so much damage from his battle with Luffy that he was in need of some serious medical attention. Blueno and Jabra later overheard Spandam's plans to capture them to be used as scapegoats to blame for the failure of their mission. CP9 then left Enies Lobby by walking along the Sea Train tracks."}, {"type": "paragraph", "text": "They reached St. Poplar and became street performers to earn medical funds for Lucci. He collected the money while Jabra, in his full wolf form, thrilled audiences by jumping through hoops of fire. After paying for Lucci's medical treatment, he sat at a café with Fukurou, Kaku, and Jabra as they waited for Kalifa and Kumadori to return with the shopping, reading a newspaper as the others joked around. After Lucci was discharged from the hospital, he and the rest of CP9 went for a bowling match. However, the Candy Pirates invaded the town, so CP9 dealt with the pirate problem. Blueno was seen kicking one of the pirates on the ship. While they were initially applauded by the locals for their actions against the pirates, the townspeople's view of the agents completely changed as they witnessed Lucci deal excessive justice on the defeated pirates."}, {"type": "paragraph", "text": "Having given the residents of St. Poplar such a fearful image of themselves, the agents decided to leave the place. Just before leaving however, they were given a flower as a sign of thanks by a little girl that was taken hostage by the pirates. Taking this gift and commandeering the Candy Pirates' ship, they sailed back to their homeland. Upon arrival, they spied upon the next generation of CP9 agents being trained. As they were watching, they found out the pursuers that Spandam sent had caught up with them. In order to protect their homeland from these people, the agents dealt with them. Blueno is seen holding Very Good's head and the Den Den Mushi Lucci uses to give their former leader a message. After Lucci tells Spandam that they would come back for him someday, the agents commandeer their pursuers' ship and sailed off from their homeland. However, the now planted flower the grateful girl gave them on their homeland is seen behind the silhouette of their ship in the distance."}, {"type": "paragraph", "text": "Like most of his colleagues (with the exception of Spandam, Lucci, Hattori, and Kaku being part of CP-0), his location and allegiance are currently unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Blueno_Saves_CP9.png/revision/latest/scale-to-width-down/210?cb=20130912235233", "caption": "Blueno saves his fellow CP9 agents from the Buster Call."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Blueno vs Tilestone", "elements": []}, {"text": "Blueno vs. Monkey D. Luffy", "elements": []}, {"text": "CP9 vs. Candy Pirates", "elements": []}, {"text": "CP9 vs. Very Good's crew", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, an early concept of Blueno is revealed. Nothing in particular has seemed to change, but in early One Piece, Blueno was apparently supposed to fight Usopp instead of Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/CP9_Early.png/revision/latest/scale-to-width-down/170?cb=20110509011139", "caption": "Early fight match-ups with the CP9 agents (bottom)."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Adventure", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He has a bull theme, due to his horn-like hairstyle. He is also referred to as a cow by Luffy numerous times.", "elements": []}, {"text": "In the 4th Weekly Shonen Jump Fan Poll to determine the most popular One Piece characters, Blueno ranked at 83rd.", "elements": []}, {"text": "He is the first antagonist that Luffy used Gear Second against.", "elements": []}]}], "images": []}]}