{"sections": [{"title": "Blenheim", "level": 1, "content": [{"type": "paragraph", "text": "Blenheim is the commander of the 9th division of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Blenheim is a huge, muscular man who is not much smaller than Whitebeard. He is large enough to carry a normal-sized human on his shoulder. He has a large mouth, small eyes, a downward pointed nose, high cheekbones, and thin, arched eyebrows. He also has dark hair pulled back in a braided ponytail, a gray beard, and chest hair. He wears a gray vest, and has purple tattoos of Whitebeard's Jolly Roger on both of his deltoids, right over two pairs of yellow armbands he wears. He has loose grayish pants tucked inside standard boots."}, {"type": "paragraph", "text": "Twenty-years before the start of the series, Blenheim wore the same kind of outfit but had a black beard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Blenheim_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180910153744", "caption": "Blenheim's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Blenheim is quite loyal to the Whitebeard Pirates and Whitebeard, as he was willing to risk his own life in order to save Ace from execution during the war at Marineford. Compared to some of his more expressive comrades, Blenheim is rather stoic, and he often responds to crises more with anger and frustration than alarm or grief. This was the case when Squard stabbed Whitebeard."}, {"type": "paragraph", "text": "Though he often maintains composure when things go awry, he shows more emotion when things good happen, as seen when he cheered and pumped his arms when Ace was freed. Additionally, he was saddened and upset at his captain's decision to make Marineford his final battle, showing that he more so represses his emotions rather than being less feeling by nature."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the commander of the 9th division of the Whitebeard Pirates, Blenheim has authority over the lower-ranking subordinates. Physically, Blenheim is quite strong, as he was able to carry a frozen and unconscious Jozu back to the escape ship. Otherwise, his actual fighting skills are yet to be seen."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Near the start of the battle, Blenheim was seen carrying a huge sword, but his proficiency is unknown. Twenty-years before the series started, during the meeting of Whitebeard and Golden Lion Shiki, he already had this sword."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Shiki's Visit", "level": 4, "content": [{"type": "paragraph", "text": "When Shiki dropped by Whitebeard's ship after escaping from Impel Down two years after Gol D. Roger's execution, Blenheim was seen in the background, behind the Golden Lion and Marshall D. Teach."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "With one of his crewmates on his shoulder, Blenheim and the rest of the Whitebeard Pirates charging onto the frozen bay Marineford in their attempt to save Portgas D. Ace from execution. Later, when Luffy was confronted by Kizaru, Blenheim and the other Division Commanders helped him push through. Blenheim watched in anger as Squard stabbed Whitebeard in the chest. After Whitebeard forgave Squard and joined the battle himself, Blenheim stood alongside his comrades as they held their weapons to the sky, shouting their affirmation to save their friend."}, {"type": "paragraph", "text": "When Luffy and Galdino freed Ace, Blenheim stood next to Kingdew and Jinbe, cheering for their friend's liberation. Whitebeard decided to that Marineford would be his final battle, and Blenheim and his crewmates listened in shock and grief to their captain's declaration. Blenheim and the others refused to let Whitebeard sacrifice himself, but he demanded that they follow orders and let him. Blenheim was then asked by some other Whitebeard Pirates members to help lift an unconscious and frozen Jozu."}, {"type": "paragraph", "text": "While carrying Jozu to safety, Blenheim witnessed Admiral Akainu impale Ace. He appeared alongside his fellow Whitebeard division commanders to stop Akainu from getting to Luffy. Upon the arrival of Shanks and Sengoku calling the war to a close, he and the rest of Whitebeard's crew stood down."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Blenheim_Carrying_Jozu.png/revision/latest/scale-to-width-down/250?cb=20131005035018", "caption": "Blenheim, while carrying Jozu, witnesses Akainu's attack on Ace."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Blenheim, along with the rest of the crew, attended the funeral of Whitebeard and Ace at an undisclosed location somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Blenheim vs. Marine Officers", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu, and Thatch), Crocodile, and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Blenheim is featured in Volume 33 of the One Piece World Collectable Figure series alongside his fellow Division Commanders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/46/One_Piece_World_Collectable_Figure_One_Piece_Volume_33.png/revision/latest/scale-to-width-down/250?cb=20131123042747", "caption": "Blenheim in World Collectable Figure Volume 33"}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Blenheim\" is also the name of several ships of the British Royal Navy, which were named after the Battle of Blenheim.", "elements": []}]}], "images": []}]}