{"sections": [{"title": "Jerry", "level": 1, "content": [{"type": "paragraph", "text": "Jerry is a secret intelligence member of CP6. He was found in the seventh car of the Puffing Tom when Sanji invaded the Puffing Tom. He comes from Karate Island in the South Blue, and claims to be a boxing champion."}, {"type": "paragraph", "text": "He was one of the antagonists during the Sea Train voyage in the Water 7 Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jerry is an extremely tall man, so much so that he covers nearly the whole ceiling of the train car he was in with his upper body. His head is roughly twice as big as Sanji's. His legs are extremely long that their exact length is practically the height of the car he was in. His hair and beard are white while his mustache is black. Like other World Government agents, Jerry wears a suit, and he has a yellow pin of the World Government symbol on the right side of his chest. He personally wears red gloves that he uses for boxing."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/03/Jerry_Anime_Concept_Art.png/revision/latest/scale-to-width-down/200?cb=20181002225213", "caption": "Jerry's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of CP6, he is loyal to the World Government. While fighting Sanji, he was shown to be very sure of himself because of his skill in Karate."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Jerry is supposedly a boxing champion from Karate Island in South Blue. While Jerry has excellent boxing skills, he has a great disadvantage if he is in a situation where his movements are greatly hindered, due to his height. To compensate in such a situation, Jerry learned Yoga so he could fight in small areas by positioning his legs behind his head. However while in his Yoga position, his normally long reach is hindered due to his legs getting in the way. Overall, from what has been shown, Jerry's strength is above that of normal soldiers, but far below Sanji's."}], "images": []}, {"title": "Attack List", "level": 3, "content": [{"type": "list", "elements": [{"text": "Jerry Aurora Flicker Jab (ジェリー オーロラ フリッカー ジャブ, Jerī Ōrora Furikkā Jabbu): Supposedly Jerry's most devastating boxing attack. He sends a flurry of rapid punches that are so fast that it seems as if he has several arms punching, similar to Luffy's Gomu Gomu no Gatling.", "elements": []}]}, {"type": "list", "elements": [{"text": "Yoga One Two (ヨガ1･2, Yoga Wan Tsū): While bending his legs behind his back to shorten himself, Jerry launches two simple boxing punches that are unfortunately hindered by his own reach.", "elements": []}, {"text": "Screw Drop Kick (スクリュー ドロップ キック, Sukuryū Doroppu Kikku): Jerry delivers a spinning kick towards an opponent. This attack, however, completely ignores the basic rules of boxing.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/da/Jerry_Yoga.PNG/revision/latest/scale-to-width-down/210?cb=20130120111617", "caption": "Jerry in his Yoga position."}]}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "When Sanji was discovered by the agents in the sea train, Jerry introduced himself to Sanji, while in the midst of the cook's smoke, and told the other agents that it was unnecessary to alert CP9 of the intruder. Slightly provoked by Sanji, Jerry then attacked Sanji with a flurry of punches. Unfortunately the small space of the car he was in did not give him much room to attack properly and instead of attacking Sanji, he attacked the other agents accidentally. Trying to make up for this, Jerry folded his body over in what he claimed was his yoga style, only to find that he no longer had a long enough reach to hit Sanji. So, he simply charged at Sanji with a jumping kick move, only to be taken down in one hit."}, {"type": "paragraph", "text": "Jerry and the other agents were later discovered unconscious by a Marine on board. They were given first aid per Captain T Bone's orders. It is unknown what happened to Jerry after the incident in the Puffing Tom. He is most likely together with the Marines and Cipher Pol agents that rowed the remains of the sixth and seventh cars after Zoro cut them in half, along with T Bone."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3f/Jerry_Defeated.png/revision/latest/scale-to-width-down/210?cb=20121227131255", "caption": "Jerry is defeated by Sanji."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jerry vs. Sanji", "elements": []}]}], "images": []}]}