{"sections": [{"title": "Attach", "level": 1, "content": [{"type": "paragraph", "text": "Attach, commonly nicknamed Attachan, is a prolific photographer who once headed the Marines' Photography Department. Though he supplied photographs of many prominent outlaws - including most of the Straw Hat Pirates - for the Marines' wanted posters, his frequent blunders led to his dismissal some time after the Battle of Marineford. Subsequently, he became a reporter for the World Economic Journal, under \"Big News\" Morgans."}, {"type": "paragraph", "text": "Like Minatomo, Attach began as an SBS joke Eiichiro Oda used to \"explain\" a triviality - specifically, how the Marines always had such high-quality illustrations of the world's most dangerous and/or unreachable criminals. In time, however, he became a fully canon character, with minor but tangible impact on the story."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Based on a shadowy appearance, Attach is a short and somewhat elderly man with a grayish-brown mustache. He wears a shirt with green-and-white checkered design with white sleeves, black pants, and a white top hat."}, {"type": "paragraph", "text": "After the timeskip, he remained relatively unchanged except that he now wears an armband on his right arm with the words \"WE\" on it, which likely stand for \"World Economic\"."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Attach's personality. He did seem surprised when his boss told him the lens cap was on during Sanji's picture, so he might be confident in his skills of photography. However, it is later revealed that he did indeed leave the lens cap on accidentally, as he was eventually fired for doing so fifty-seven times. Therefore, it can be concluded that he does not pay enough attention while working and that he is a careless person."}, {"type": "paragraph", "text": "Flaming Attachan apparently received his epithet due to the fact that before he closes the shutter, he yells \"Fire!\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "According to Oda, Attach is a very skilled infiltrator, able to sneak \"anywhere he likes\" and photograph (almost) anyone he wants. It is unknown if he possesses any combat ability, or even any weapons."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Precisely when - or for how long - Attach joined the Marines is unknown, though it is known that he eventually became captain (部長, buchō) of the entire Marine Photography Department (海軍写真部, Kaigun Shashin-bu)."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [{"type": "paragraph", "text": "Attach was present for the Straw Hat Pirates' attack on Enies Lobby, and - despite the considerable chaos - successfully photographed Sogeking, Tony Tony Chopper, Nico Robin, and Franky. However, his attempts to photograph Sanji were thwarted by numerous mishaps, culminating in a \"successful\" shot where he realized too late that he had forgotten to remove the lens-cap."}], "images": []}, {"title": "Post Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the fall of Enies Lobby, Attach followed the Straw Hats and their allies back to Water 7. Finding the whole city hailing the Straw Hats as heroes, he was able to trick Nami into posing for a photograph by claiming to be a reporter for a local newspaper. Within a week, he reported back to his superiors with the new photographs, but was forced to submit a blank for Sanji."}, {"type": "paragraph", "text": "This led to the Marines using a crude facial composite for Sanji's wanted poster - a situation that greatly displeased Sanji, but ironically protected him for a time, as it led to his birth family being stymied by false leads such as Duval."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "Some time after the Battle of Marineford, Attach was dismissed by the Marines for his fifty-seventh instance of forgetting to remove his camera's lens-cap. Afterwards, he was recruited by the World Economic Journal, under the command of \"Big News\" Morgans."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "At the Red Port prior to the Levely, Attach was seen working directly under Morgans and helping to cover the arrival of the royal families from across the world and taking photos of the Mermaid Princess, Shirahoshi. He asked his boss, Morgans, if they should do a story on the princess but the latter was too enthralled by Shirahoshi's beauty to respond."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "While Morgans was ordering his employees around on how to format the front page scoop, a person who was appeared to be Attach alerted Morgans of a letter from the World Government. When Morgans discovered that it was hush money to keep a certain incident under wraps, he ordered Attach to send it back. At this moment, the man that had appeared to be Attach ripped off his face mask and pointed a gun at Morgans, revealing himself as a member of Cipher Pol. After the agent was easily knocked out by Morgans, a tied and gagged Attach was present at the headquarters before it departed the scene."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sanji's photograph error wherein Attach left the cap on is a well known mistake that both professional and amateur photographers make alike.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 436 (p. 3) and Episode 321, Attach is seen talking with a Marine officer about Sanji's poster picture.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 24.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 (p. 8) and Episode 883.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements, Oda elaborates on Attach's many failures to properly photograph Sanji. Among them are his \"Mellorine\" expression, the Awa Awa no Mi, and a happenstance kick to the groin rendering his face near-unrecognizable.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 436 (p. 2) and Episode 321, Nami complains a \"reporter\" tricked her into a photograph.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 82 Chapter 826 (p. 14-15) and Episode 785, Vinsmoke Reiju discusses the Vinsmoke Family's efforts to pinpoint Sanji through his wanted poster.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, Attach is revealed to have been fired by the Marines.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956 (p. 6-7).", "elements": []}]}], "images": []}]}