{"sections": [{"title": "Kairiki Destroyers", "level": 1, "content": [{"type": "paragraph", "text": "The Kairiki Destroyers are the three largest human members of the Franky Family. They are the biggest in the Family and are considered by the rest of the gang as some of the strongest members hence their name."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Kairiki Destroyers are large humans that are so big that they roughly reach up above the legs of a regular sized giant. Like the rest of the gang, they each wear the Franky Family uniform, which consists of a metal lederhosen with a pink star on it and a pair of specialized goggles."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3f/Franky_Family_and_Giants.png/revision/latest/scale-to-width-down/210?cb=20130724094520", "caption": "The Kairiki Destroyers compared to giants and the rest of the Franky Family."}]}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "When they met Franky, the Kairiki Destroyers came to deeply respect him and called him \"Aniki\" just like the other Franky Family members."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Due to their size and builds, the Kairiki Destroyers have remarkable strength above that of an average human. Having gained their strength from the various ships they dismantled, they are considered some of the strongest in the Franky Family. They are however only strong enough against regular opponents. Against really strong opponents like giants, they are no match without help."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "As fighters, the Kairiki Destroyers use regular run of mill weapons to fight. The Destroyer with the orange afro has a specialized super armor that is strong enough to withstand a cannon. It however cannot withstand really strong attacks."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Kairiki Destroyers were first seen partying alongside the rest of the Franky Family after they stole 200,000,000 from the Straw Hats. They were, however, easily defeated by the enraged crew, who intended to flatten the Franky House for attacking Usopp."}], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Along with the rest of the Family, they accompanied the Straw Hat Pirates to Enies Lobby to save their \"aniki\" (big brother/gang boss) Franky from CP9. Upon reaching the island, their first task was to force the first of three island gates open, which they did after Mozu and Kiwi pick the lock. Once they reached the second gate, they got attacked by foes even larger than themselves: the giants Oimo and Kashi, who quickly knocked them out. They, along with Galley-La and the rest of the Franky Family eventually escaped the Buster Call, and rode the Sea Train Puffing Tom back to Water 7."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the Straw Hats party, the Kairiki Destroyers joined in alongside everyone else that participated in the Enies Lobby fight."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Kairiki (怪力) means superhuman strength. Because of this, the Kairiki Destroyers name are sometimes translated as Mighty Destroyers, Monstrous Strength Death Trio, and others in various scanlations."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑ One Piece Manga - Chapter 377, The Kairiki Destroyers are dwarfed by the giants in front of them.", "elements": []}, {"text": "↑ One Piece Manga - Chapter 378, The Destroyers note where they get their strength from.", "elements": []}, {"text": "↑ One Piece Manga - Chapter 330, The Destroyer with the orange afro dons an armor to fight against Luffy.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 433 and Episode 315, The Straw Hats, Franky Family, and Galley-La celebrate by having a pool party.", "elements": []}]}], "images": []}]}