{"sections": [{"title": "Fukurou", "level": 1, "content": [{"type": "paragraph", "text": "Fukurou is a former member of CP9 and one of the last to be introduced."}, {"type": "paragraph", "text": "He was one of the major antagonists during the Enies Lobby Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Fukurou is a big, round, oddly-shaped man with a zipper across his mouth, which he must unzip if he needs to speak. He dresses in black formal wear and has green, well groomed hair, purple dimples on his cheeks and strands of hair on his chin."}, {"type": "paragraph", "text": "As a child, Fukurou had a black belt in an unnamed martial arts. He also had the zipper across his mouth, so it might be assumed that he was actually born with it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Despite having the ability to \"zip it\", his biggest personality quirk is having a big mouth (both figuratively and literally); he also has the strange habit of saying \"chapapa\" after almost every sentence and has a strangely high voice considering his bulky appearance. He often blurts things out inconsiderately; in the mission they had before the Straw Hat Pirates invaded Enies Lobby, he announced his team's presence to the town and their intentions forcing them to kill an additional 20 people instead of only the three that were slated for assassination. Also, moments before Fukurou announced that, he told Spandam and Kumadori that Jabra had a girlfriend named Gatherine, who worked in Enies Lobby's cafeteria as a waitress. However, he unfortunately was dumped by her only days before Straw Hat Pirates' assault on Enies Lobby began. Strangely, he calls himself \"Fukurou the Silent\", and not as strangely adds: \"Lover of Rumors\". The \"Silent\" may refer to his theme of an owl, a predatory bird who attacks silently at night."}, {"type": "paragraph", "text": "He is also a prideful individual as he stopped dodging Franky's attacks after the latter accused him of being a coward and proceeded to trade punches with him. He also exchanged childish insults with the cyborg on how \"weak\" Franky's punches were while Franky was out of cola and later let Franky attack him with \"Strong Hammer\" after the latter was recharged with cola by Chopper, thinking that Franky's punch would be useless against his Tekkai which led him to be severely injured as the punch proved too strong for his defense."}, {"type": "paragraph", "text": "He is shown to care for his comrades as he panicked when Chopper locked Kumadori in a fridge and tried to free him and later, he worked hard along with his comrades to raise money to pay the fees for Lucci's treatment after he was seriously injured by Luffy. He also enjoyed spending time and doing activites together with them while in St. Poplar."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "From his training in the Rokushiki martial arts, Fukurou has great superhuman physical strength. With a Doriki of 800, he could punch with extreme force, able to damage Franky's cybernetically enhanced durability. He is extremely agile for his size, able to move at incredible speed when using Soru. He could perform Geppo with one leg, able to levitate both himself and Franky, a very heavy cyborg, when the latter was holding onto his other leg. He has vast endurance, able to withstand multiple powerful punches from Franky that can easily break his Tekkai and even a full Cola powered Strong Hammer that sent him flying."}], "images": []}, {"title": "Te-Awase", "level": 3, "content": [{"type": "paragraph", "text": "Fukurou's special te-awase ability allows him to measure the Doriki of his fellow teammates, giving an unbiased and honest ranking of CP9 by power. This ranking, however, does not account for Devil Fruit powers, only physical strength."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Fukurou claims he is a master of the Soru technique, and is the first CP9 member to have used any variations of the move. He says that in this way he is like an owl, unseen and unheard by its prey until it is too late."}, {"type": "paragraph", "text": "Fukurou's fighting style revolves mostly around a refined Shigan (the Jugon technique), and his strange body frame seems to require him to perform some of the Rokushiki slightly differently than the other CP9 members do. With a Doriki of 800, Fukurou is one of the weaker members of CP9, but nonetheless is easily powerful enough to damage the cyborg Franky."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Fukurou possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Fukurou, Jabra, and Kumadori attended a meeting with Spandam over how their mission ended up having over twenty people killed due to Fukurou having talked about it in the town. Jabra continued to bicker with Fukurou and Kumadori for how useless his zipper on his mouth is, and they tried explaining the mission to their boss. Once Rob Lucci and the others arrived, Fukurou decided to measure each CP9 member's Doriki levels and was shocked to see that Lucci's was exactly 4000. Fukurou then told Blueno about how Gatherine dumped Jabra and how he talked about it with everyone, causing Jabra to be depressed with himself. He witnessed Kaku and Kalifa eat the Devil Fruits that Spandam gave them. The agents gathered on a balcony after Monkey D. Luffy defeated Blueno."}, {"type": "paragraph", "text": "Afterwards, once all of the Straw Hat Pirates entered the building, Fukurou informed them that all the CP9 members have a key but only one of them has the key to free Nico Robin. He then dashed away. Fukurou later tried to crush Franky, who was running to find more cola. During their fight, Fukurou was surprised that Franky's punches could hurt him through his Tekkai. Fukurou began dodging all of Franky's attacks until Franky called him a coward. The two traded punches and insults and crashed through the floor into a kitchen. Fukurou repeatedly pounded the weakened Franky until Tony Tony Chopper managed to refuel Franky evening the odds."}, {"type": "paragraph", "text": "As their fight continued, Fukurou smashed into Franky, sending them both crashing into the water outside of the tower. Fukurou escaped the current with Geppo and, when Franky attempted to swim upstream, knocked him back underwater. When Franky launched himself into the air, Fukurou kicked him down again but Franky extended his arm and grabbed Fukurou's leg, dragging him down too. Fukurou managed to keep them aloft with one-legged Geppo and slowly made their way to shore. Fukurou stated he would end the fight with one blow, to which Franky said he would too. Fukurou rapidly cartwheeled toward the tower, planning to slam Franky into the wall, but Franky stopped their momentum with a Coup de Vent and then used another to launching Fukrou into the ground, knocking him out."}, {"type": "paragraph", "text": "Afterward, Franky took the key Fukurou carried."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0b/Franky_vs._Fukurou.png/revision/latest/scale-to-width-down/230?cb=20140621234903", "caption": "Franky punches Fukurou."}]}, {"title": "CP9's Independent Report", "level": 3, "content": [{"type": "paragraph", "text": "Fukurou and the other CP9 agents survived the destruction of Enies Lobby by hiding with Blueno's Air Door. When World Government agents arrived, the CP9 escaped on the Sea Train tracks."}, {"type": "paragraph", "text": "Having arrived at St. Poplar, Fukurou had taken over carrying Lucci from Kumadori, and later when they were raising money for Lucci's medical bills, Fukurou was the one collecting money for Kaku's \"Giraffe slide\". While waiting for Lucci to recover from treatment, Fukurou sat at a café with Kaku, Blueno, and Jabra."}, {"type": "paragraph", "text": "After Lucci fully recovered and was discharged, the group went bowling to celebrate. However, their bowling match was interrupted when the Candy Pirates ransacked the island, so CP9 quickly dispatched the pirates on their ship. However, since Lucci crushed the skull of the captain, the crowd was horrified and the CP9 realized they could not stay in St. Poplar. However, a girl gave Kalifa a flower as thanks, which concerened Fukurou, Kumadori, and Jabra."}, {"type": "paragraph", "text": "They shipped off to their homeland, where they watch a new generation of CP9 being trained. Captain Very Good arrived to capture them, but they refused to let him disturb their old home. As CP9 battled and eventually defeated the Marine troops led by Very Good, Lucci contacted a physically crippled Spandam using a Den Den Mushi, and promised to come for him soon. With that, CP9 began their aim to eliminate their former director by leaving their homeland and setting sail."}, {"type": "paragraph", "text": "Like most of his colleagues (with the exception of Spandam, Lucci, Hattori, and Kaku being part of CP-0), his location and allegiance are currently unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8b/Kaku_and_Fukurou_Earning_Money_for_Lucci.png/revision/latest/scale-to-width-down/230?cb=20130124164712", "caption": "Kaku and Fukurou try to earn money for Lucci's medical treatment."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Fukurou vs. Franky", "elements": []}, {"text": "CP9 vs. Candy Pirates", "elements": []}, {"text": "CP9 vs. Very Good's crew", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, an early concept of Fukurou is presented. He was originally supposed to be more muscular than round, and had a slim hip. He did not have a zipper on his mouth, and was originally planned to fight with Nami."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/CP9_Early.png/revision/latest/scale-to-width-down/139?cb=20110509011139", "caption": "An early concept of Fukurou is shown on the bottom; third to the right"}]}, {"title": "Translation and Dub issues", "level": 2, "content": [{"type": "paragraph", "text": "Fukurou (梟, Fukurou) is the Japanese word for owl, and this is likely where his name came from. Another possible influence on his name is the word fukurou (袋, \"bag or sack\"), as with the zipper on his mouth and his round body he somewhat resembles a bag."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, Fukurou was given a voice actress, giving him a voice like a young child. Although this voice does not seem to match his appearance, it does somewhat fit his personality, as he often comes across as very playful and innocent.", "elements": []}, {"text": "He has an owl theme, due to his name meaning \"owl\" and how he compares his fighting style to it.", "elements": []}, {"text": "Fukurou ranked at 78th in the 4th Weekly Shonen Jump popularity contest.", "elements": []}]}], "images": []}]}