{"sections": [{"title": "Vito", "level": 1, "content": [{"type": "paragraph", "text": "\"Monster Gun\" Vito is a member of the Fire Tank Pirates, working as the crew's advisor."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Vito is a tall man with a long snake-like curling tongue that sticks out of his grinning mouth. His hands are disproportionately large for his body and have a tattoo on the back of them that matches the one on his forehead. He has black hair that is slicked back and sticks up in a curl on the back of his head. In the anime, his skin is rather pale."}, {"type": "paragraph", "text": "Like most members of the crew, he wears a magenta suit coupled with a yellow cravat and a black coat draped over his shoulders. His coat has a feathered collar and his eyes are covered by a pair of small round sunglasses. He also has a pair of holsters where he keeps his eponymous 'Monster Guns', a pair of large revolvers."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Vito treats his superiors with respect and even praises them occasionally, as shown with Capone Bege and Big Mom. Despite his high regard for them, he recognizes that their actions are often quite cruel and selfish, and expresses a measured degree of sympathy for those negatively impacted by them. This is best shown when he gave Sanji a photo of his bride-to-be, in order to soften the blow of his forcefully arranged marriage. He has a tendency to finish his sentences with \"rero\", the onomatopoeia for licking."}, {"type": "paragraph", "text": "Vito is talkative and has a tendency to follow people around, even when they do not desire his company. He also has a tendency to put people off with his mannerisms, especially when his tongue is involved."}, {"type": "paragraph", "text": "He is also compassionate, as he readily helped Sanji by ambushing Bobbin, despite Sanji's previous rude and disrespectful attitude towards him. Vito also specifically explained to Sanji the consequences of refusing to participate in Big Mom's Tea Party so the latter would be more careful in choosing to refuse. While helping Chiffon search for her twin sister Lola at Dressrosa, Vito lend a helping hand to citizens who were mysteriously attacked."}, {"type": "paragraph", "text": "Like many other people, he has his own unique laugh, which is \"Nyororo\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Capone Bege", "level": 4, "content": [{"type": "paragraph", "text": "Vito respects his captain and obeys his orders. He also lit Bege's cigar without being asked. Like the rest of the Fire Tank Pirates members, he addressed Bege as \"Father\". He fully supported Bege's plan to assassinate Big Mom, despite knowing that it would make them enemies of those he considered to be \"monsters\" in Big Mom's crew, and he even assisted Bege in his attempt to kill her."}], "images": []}, {"title": "Gotti", "level": 4, "content": [{"type": "paragraph", "text": "Vito and Gotti have some mutual respect for each other as when Sanji disrespected Vito, Gotti pointed his gun arm at Sanji and warned the chef not to cross the Fire Tank Pirates but Vito begged him not to harm Sanji."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Vito holds a reverential view of Big Mom, or at least her tea parties, as he stated that even demons would come to them and those who did not would immediately regret it. Despite not directly being in the Big Mom Pirates, Vito still refers to her as \"Mama\". However, Vito took part in his captain's plan to overthrow Big Mom. After the failed assassination attempt, Vito and the rest of the Fire Tank Pirates became targets of Big Mom, her family, and her crew."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Vito's first encounter with Sanji was hostile, as he held Nami and Chopper hostage while telling Sanji the repercussions of refusing to attend Big Mom's Tea Party. He also conveyed to Sanji Big Mom's personal threat to take retribution against someone Sanji loved if he dishonored her invitation."}, {"type": "paragraph", "text": "Vito later becomes markedly more friendly to Sanji, revealing that he is an enormous fan of the fictional comic strip, Sora, Warrior of the Sea, and that he idolized its villain group, Germa 66. Because of this reverence, he was excited and pleased to meet Sanji, a member of the family that commands the Germa, and constantly tries to engage Sanji in a conversation about them. Sanji, by contrast, finds Vito's enthusiasm about his family irritating and attempts to shake Vito off whenever the latter follows him around."}, {"type": "paragraph", "text": "Despite Sanji's irritation at him, Sanji's heritage as a Germa prince led Vito to help Sanji by ambushing and shoot down Bobbin when the latter chased after the Straw Hat cook. Vito explained later to his captain that he did so because Germa 66 are his idols. He expressed great excitement in meeting Sanji again when the latter arrived at the Fire Tank Pirates' hideout calling him his hero. He was also impressed with Sanji's strength when he used a kick to lift a large carriage holding a group of chefs and a massive wedding cake onto the deck of Bege's ship."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Vito is physically strong enough to capture Nami and Tony Tony Chopper, the latter of which was in his Kung-Fu Point, and drag them by the back of their heads to his captain without resistance. Vito is also very fast. After Bege's assassination attempt on Big Mom failed, he could swiftly outrun the Big Mom Pirates who were after them."}], "images": []}, {"title": "Stealth Master", "level": 3, "content": [{"type": "paragraph", "text": "He appears to be highly skilled in sneak attacks, as he laid a successful ambush on Bobbin, who is a powerful pirate and noted to be a heavyweight in the Big Mom Pirates."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Vito appears to be extremely skilled in marksmanship. With the element of surprise, Vito easily shot down Bobbin, who is a very powerful member of the Big Mom Pirates. Alongside Gotti, Vito was entrusted by Bege to use a KX Launcher to assassinate Big Mom, further proving his capabilities."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries a pair of dark revolver pistols, from which he earned his epithet, that are big enough for him to use with his large hands."}, {"type": "paragraph", "text": "During the assassination attempt on Big Mom, Vito used a KX Launcher."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/78/Vito%27s_Revolver.png/revision/latest/scale-to-width-down/125?cb=20160125063253", "caption": "One of Vito's revolvers."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "He came to Zou inside his captain's body to capture Caesar Clown and the Straw Hat Pirates. After one of his crewmates shot Pekoms through Bege's arm, he got out on his captain's orders. Bege told him to bring the Straw Hat Pirates with him and captured Nami and Tony Tony Chopper after they just showed up. After he entered back into his captain's fortress and Bege materialized inside, Vito lit him a cigar."}, {"type": "paragraph", "text": "After Sanji refused Bege's invitation to Big Mom's tea party, Vito told Sanji that refusing was not an option as he whispered something to the pirate, who reacted with extreme shock. After Bege ran into Nekomamushi, he departed from Zou, carrying his subordinates with him."}, {"type": "paragraph", "text": "On Big Mom's ship, Sanji was still displeased with being forced into an arranged marriage. Vito then showed Sanji a photo of his bride-to-be, Charlotte Pudding, causing Sanji to become love-struck."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Vito_Captures_Nami_and_Chopper.png/revision/latest/scale-to-width-down/210?cb=20161120005512", "caption": "Vito takes Nami and Chopper hostage per his captain's orders."}]}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Vito then told Sanji about a comic strip in the World Economic Times, about Sora fighting the Germa 66. The strip is intended to be propaganda to get children to idolize the Marines, but Vito ended up idolizing the Germa 66, and was honored to meet Sanji, who was insulted to be lumped with the army and told Vito that he has nothing to do with them. Sanji went to his private room, but Vito followed him in. Caesar complained that he was kept in a cage while Sanji received special treatment. Vito told him that Caesar was just a prisoner while Sanji's upcoming marriage will bring the Charlotte and Vinsmoke families together. Sanji insisted that he was not going to marry anyone and told him to get out. Gotti was angry at Sanji's disrespect for Vito and aimed his weapon at him. Vito tried to calm Gotti, but was unable to stop him until Charlotte Chiffon interrupted Gotti, telling him not to harm Sanji in any way, or their leader will be punished. As Chiffon scolded Gotti, Vito decided to continue the conversation about Germa 66 later."}, {"type": "paragraph", "text": "After disembarking on Whole Cake Island, Sanji gave Caesar's heart to Vito, much to Caesar's chagrin. Bege and his crew and family took Pekoms to an edge of a cliff at the northeastern coast of Whole Cake Island. Vito watched as his captain shot Pekoms, causing the mink to fall into the shark-infested waters below."}, {"type": "paragraph", "text": "On the day of the wedding, Vito ambushed and shot Bobbin while he was pursuing Sanji. Later in Bege's hideout, Vito attended the meeting about forming an alliance with the Straw Hats. When Monkey D. Luffy and Sanji arrived at the hideout, Vito greeted them and asked them to take a bath since his boss does not like meeting with dirty people. After Luffy and his team took their bath, Vito was seen in the meeting room as Bege and Luffy began their negotiations. During a small quarrel between Bege and Luffy, Vito tried to calm Gotti as the latter prepared to attack Luffy. After Jinbe broke up the quarrel, Vito took part in discussing Bege's assassination plot."}, {"type": "paragraph", "text": "Later, the Fire Tank Pirates guarded the door to the banquet hall as the wedding guests arrived. After the wedding began, Vito took a peek inside the venue and was nervous once he saw some of the Charlotte children attending there. The Fire Tank Pirates went into Bege's body as he entered inside the wedding venue. As Luffy was causing chaos at the wedding venue, Bege told Vito and Gotti to prepare their KX Launchers. After Brook destroyed Mother Carmel's portrait, Vito and Gotti waited patiently for Big Mom to scream."}, {"type": "paragraph", "text": "When Luffy successfully caused Big Mom to start screaming, Vito and Gotti exited Bege's body and they all aimed their KX Launchers at her. They then fired the launchers, but Big Mom's scream caused the rockets to detonate before they reached her, shocking Vito and his allies. The alliance then tried to escape through the mirror that Caesar brought to the venue only for Big Mom's scream to shatter the mirror. The alliance then found themselves surrounded by the Big Mom Pirates, who were given earplugs by Katakuri. After Bege transformed into Big Father, Vito instructed the alliance and the Vinsmoke Family to get inside. Once inside, Vito approached the Vinsmokes in excitement. As Bege's fortress came under attack by Big Mom, Bege swore not to allow his crew and family to die, causing Vito to cry in happiness. Bege later returned to his human form and had Caesar carrying him out of the venue. While Caesar was evading the Big Mom Pirates with Bege in tow, Vito cheered for the Vinsmokes when they cleared a path for Caesar. After the Vinsmokes, Luffy, and Sanji were overwhelmed by the Big Mom Pirates, Vito prepared to go out to help them alongside Jinbe and Pedro."}, {"type": "paragraph", "text": "When the Tamatebako dropped to the base of the Whole Cake Chateau, the bomb inside the chest exploded, causing the castle to topple over. As the castle collapsed, Caesar, Bege's crew, Luffy's group, and the Vinsmokes got away. Bege later met up with the Sanji Retrieval Team at the northwest part of Whole Cake Island, where he decided to part ways with them. As Bege was leaving Luffy and his team behind, Vito asked if they could at least say goodbye to Luffy's group. Bege responded by telling him not to get friendly with them and that it was time for them to escape."}, {"type": "paragraph", "text": "As Bege was pursued by Tart Tanks, Vito was seen still inside Bege's body when Pudding caught up to them to ask for Chiffon's help. After Chiffon left with Pudding, the Fire Tank Pirates returned to their ship and escaped Whole Cake Island. They then head for Cacao Island to pick up Chiffon."}, {"type": "paragraph", "text": "As the crew reached the front of the harbor of Cacao Island, they were besieged by Tarteships. They were then contacted by Oven, who was holding Chiffon as a hostage to force Bege to surrender and Vito was worried for Chiffon's safety. However, upon nearing the harbor, Bege shot Oven in the face and rescued Chiffon, much to Vito's cheerful joy."}, {"type": "paragraph", "text": "As the Nostra Castello moved onto Cacao Island with tank treads, Vito was impressed with Sanji when he used a kick to lift the carriage holding the chefs (including Chiffon and Pudding) and the substitute wedding cake onto the deck of Bege's ship. After the ship returned to the sea, Oven tried preventing their escape by boiling the sea, but he was thwarted by Pound, enabling the ship to sail away from Cacao Island."}, {"type": "paragraph", "text": "On the way to the Thousand Sunny, Vito watched as Sanji and Bege argued over what to do with the cake. After Sanji fed Bege his special ingredient and made him faint, Vito and several members of the Fire Tank Pirates pointed their guns at Sanji until they saw the bliss on Bege's face. When the chefs finally completed the cake, Vito cheered for their success. The Fire Tank Pirates later approached the Thousand Sunny and gained Big Mom's attention. After Pudding and Sanji left the Nostra Castello, the Fire Tank Pirates lured Big Mom away from the Sunny and headed for Liqueur Island. As they were getting close to Liqueur Island, they planned on dropping the cake there. However, Chiffon insisted that they change course to Funwari Island to give Nami and her friends more time to escape."}, {"type": "paragraph", "text": "The crew managed to reach Funwari Island but their ship was destroyed. After dropping off the cake, they fled and stole a tarteship. As they sailed away from Funwari Island, Vito expressed concern for Germa 66, with Bege telling him to shut it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/Gotti_Threatens_Sanji.png/revision/latest/scale-to-width-down/210?cb=20170409022717", "caption": "Vito tries to stop Gotti from attacking Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Straw_Hat_Pirates_Meet_Fire_Tank_Pirates.png/revision/latest/scale-to-width-down/210?cb=20180304023006", "caption": "The Fire Tank Pirates form an alliance with the Straw Hat Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Fire_Tank_Pirates_Attack_Linlin.png/revision/latest/scale-to-width-down/210?cb=20170612033323", "caption": "Vito, Bege, and Gotti attempt to assassinate Big Mom."}]}, {"title": "\"Gang\" Bege's Oh My Family", "level": 4, "content": [{"type": "paragraph", "text": "After the escape from Totto Land, Chiffon declared to the Fire Tank Pirates that she wanted to locate and reunite with Lola. The Fire Tank Pirates then began the quest to find Lola. The crew later took over a pirate ship before planning to go to Thriller Bark. They later reached the Red Line, but they could not pass over it because of the Levely. They later went to Dressrosa to gather supplies. After disembarking, they learned that Lola arrived at Dressrosa a few days before. Vito then joined in the search for Lola and later stumbled upon Kyuin kissing Marine troops. When the Germs Pirates came and attacked Dressrosa, Vito helped Bege fight and subdue them."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Vito has the same name as Vito \"Don Vito\" Genovese, a mobster and crime boss from the same era as Capone's namesake, as well as the fictional mob boss Vito Corleone from Mario Puzo's The Godfather.", "elements": []}]}], "images": []}]}