{"sections": [{"title": "Kozuki Oden", "level": 1, "content": [{"type": "paragraph", "text": "Kozuki Oden was the daimyo of Kuri in Wano Country, the son of former Wano shogun Kozuki Sukiyaki, the husband of Kozuki Toki, father of Kozuki Momonosuke and Kozuki Hiyori, and the Kozuki Family patriarch until his execution 20 years ago at Kurozumi Orochi's hands. Notably, he was served by the Nine Red Scabbards, his extremely loyal, powerful retainers."}, {"type": "paragraph", "text": "Oden was also a division commander of the Whitebeard Pirates and later a member of the Roger Pirates. "}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Oden was a muscular man of towering height that is shown to have been about half that of Whitebeard (6.6 m), much taller than normal people. He had long, wild dark hair that was notably gathered into a large, flat, circular plane at the top."}, {"type": "paragraph", "text": "At age 18, he wore a light kimono, leaving most of his legs exposed; the kimono had two crescent moon designs on it. Oden also wore a large nio-dasuki tied around his shoulders that ran down his back."}, {"type": "paragraph", "text": "While partying with the Whitebeard Pirates, he wore a light colored shirt, dark colored pants, and crown on his head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Oden was an extremely brash, confident, and self-willed man. This motivated him to commit outrageous and violent actions for his own benefit during his youth and adolescence, such as burning down the yakuza casino after being banned from it and kidnapping women at night to form a harem in the mountains. Overall, Oden was known for getting into a significant number of violent fights, and he cared little for the consequences of his actions, as he gladly stood his ground against the yakuza and the loved ones of the women when fighting broke out as a result of the two aforementioned incidents. Although most men were appalled by his actions, his attitude made him very attractive to women, including the ones he kidnapped for his harem as they stayed with him willingly."}, {"type": "paragraph", "text": "After being sentenced to work in the quarries, Oden became less selfish and started acting to improve the lives of the Flower Capital citizens around him. However, these actions were just as outrageous and ill-thought-out as the ones Oden committed to benefit himself. The most notable example is when he attempted to help out the citizens during a drought by diverting a river into the city, which caused the city to become flooded. Additionally, when a Mountain God attacked the Flower Capital, Oden quickly went to action to try to deal with it. Oden seemed to often mean well, but acted in ways that were reckless and potentially alienating to those around him. For example, to honor a deceased man he once knew, Oden cooked a pot of oden soup over the cremated remains and \"shared one last drink\" with his former friend, much to the dismay of his mourning family members. After being exiled by Sukiyaki, he seemed to have found an outlet for his unconventional attempts at heroism, as he was able to bring peace to Kuri and rebuild its infrastructure in only two years."}, {"type": "paragraph", "text": "Despite his rowdy behavior, Oden was a very compassionate man. While at first annoyed by Kin'emon and Denjiro acting as his followers, he still cared for their well-being. He also took in other people like the orphaned Izo and Kikunojo, the persecuted Kanjuro and the lonely Raizo. Oden did not tolerate discrimination, considering it a symbol of ignorance. He saved Kawamatsu, Inuarashi, and Nekomamushi from being publically humiliated and tortured, beating up the ones responsible for it. He also saw the three as helpless children rather than monsters and was amazed by their uniqueness."}, {"type": "paragraph", "text": "Oden was also extremely adventurous and wanted to illegally set sail away from Wano Country, viewing it as too cramped. In his youth, he viewed this dream as more important than preparing to succeed his father as shogun. In fact, Oden's determination to set sail was so immense. He kept trying to do so 38 times before he became daimyo, and when Whitebeard constantly refused and tried to secretly set sail without notifying him, Oden jumped straight into the sea holding onto the Moby Dick by a chain, shocking the Whitebeard Pirates. Thus, Whitebeard imposed him an extremely difficult challenge which Oden readily agreed to accept it as Oden could braved through the harshest weathers and obstacles without flinching. After he officially joined the Whitebeard Pirates, Oden became immensely excited and curious when they arrived at every new island, learning new discoveries which were unknown to Wano, to the point he ended up recklessly throwing himself into danger. After sailing with the Roger Pirates, Oden decided that he wanted to succeed his father as shogun and open Wano's borders, wanting to change the entire world."}, {"type": "paragraph", "text": "Oden's favorite food was oden soup which is the only food he ever ate and also cooked to feed his retainers during his journey around Wano and also after becoming the daimyo of Kuri. Oden also loved to drink sake, having started drinking alcohol when he was only eight years old."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Oden_Writing.png/revision/latest/scale-to-width-down/200?cb=20191209082947", "caption": "Oden adopting the mannerisms of sailors by keeping a log."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Kozuki Sukiyaki", "level": 4, "content": [{"type": "paragraph", "text": "As Kozuki Sukiyaki's son, Oden was the heir of his clan and also to the Wano's shogunate. However, due to Oden's tendency to pick violent fights, Sukiyaki was frustrated by his son's violent and out-of-control nature. He exiled Oden from the Flower Capital and even barred him from stepping into the castle. Yasuie believed that the banishment was simply tough love though Oden did not actually resent his father for banishing him. When Oden restored order and peace to the lawless region of Kuri, Sukiyaki was deeply impressed with his son that he withdrew his disownment and made him the daimyo of Kuri."}, {"type": "paragraph", "text": "In their last meeting, Sukiyaki was surprised and proud of his son for maturing when becoming a daimyo."}], "images": []}, {"title": "Kozuki Toki", "level": 4, "content": [{"type": "paragraph", "text": "Oden married Toki, a time traveler from the past, during his youth. Toki loved Oden dearly as, after his execution by Orochi and Kaido, she used her Devil Fruit powers to send his retainers Kin'emon, Kanjuro, Raizo, Kikunojo, and Momonosuke to the future in order for them to realize Oden's dream of opening the borders of the Wano Country. She chose to remain behind in the burning castle of Kuri to meet her end hoping to join her husband in the afterlife."}], "images": []}, {"title": "Children", "level": 4, "content": [{"type": "paragraph", "text": "Oden loved his children, having bequeathed his favorite swords Ame no Habakiri and Enma to both Momonosuke and Hiyori as heirlooms before his execution. Oden would encourage Momonosuke to follow his footsteps to travel overseas in order to learn more about the world, and Momonosuke was deeply saddened by his death. His daughter Hiyori held such immense respect for him, that she lived by a strict code of dignity as a samurai's daughter and absolutely refused to bow to his archenemy and murderer Orochi even when threatened with death."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Nine Red Scabbards", "level": 4, "content": [{"type": "paragraph", "text": "When Oden restored order to Kuri, he became particularly close to seven outlaws: Kin'emon, Kanjuro, Raizo, Kikunojou, Kawamatsu, Denjiro, and Ashura Doji. They became extremely loyal to Oden and would do anything to support him. They became Oden's direct retainers and closest confidants known as the Nine Red Scabbards. Later, after being set up by Orochi's schemes to usurp the shogunate, Oden sacrificed himself to allow his retainers to escape the Beasts Pirates. Kin'emon, Kanjuro, and Raizo were shown grieving over his death."}, {"type": "paragraph", "text": "When Kawamatsu, Inuarashi, and Nekomamushi were persecuted in Wano for being of different races, Oden defended them from discrimination. From that point on, all three of them became extremely loyal to Oden"}, {"type": "paragraph", "text": "At Yasuie’s persuasion, the group trained in manners and strength in order to make themselves into proper retainers. Oden was surprised by their abrupt change but came around to the idea of his followers."}, {"type": "paragraph", "text": "After Oden's death, the group fell apart with Kawamatsu and Ashura being regarded as criminals. While Inuarashi and Nekomamushi’s friendship became strained to the point that they became archenemies, refusing to meet each other for over twenty years. When Kozuki Momonosuke saw Inuarashi and Nekomamushi he questioned whether Oden was the reason for their bitterness toward each other. Momonosuke claimed that his father would be saddened if he saw them fighting, a remark that caused the two to reconcile their feud, showing their respect toward his father. Alongside Momonosuke, Kin'emon, Kanjuro, and Raizo, they too grieved at the mention of Oden's demise."}], "images": []}, {"title": "Mink Tribe", "level": 4, "content": [{"type": "paragraph", "text": "Due to the loyalty of their rulers, all the minks on Zou respect Oden and the Kozuki Family enough to sacrifice their lives for one of their retainers."}], "images": []}, {"title": "Wano Country Citizens", "level": 4, "content": [{"type": "paragraph", "text": "Before his exile from the Flower Capital, he was despised and feared by the citizen for many outrageous things in his life."}, {"type": "paragraph", "text": "After becoming the daimyo of Kuri, Oden had worked hard to improve the lives of Wano citizens by creating rivers and wharfs to connect various villages and people, thus most Wano citizens including samurais held immense love and respect for Oden. When Oden was unjustly executed by Orochi and Kaido, the countless Wano samurais banded together to stage a massive rebellion to avenge Oden only to be thwarted by Kaido. After twenty years, surviving Kozuki loyalists such as Shinobu patiently waited for Momonosuke and Kin'emon, Raizo and Kanjuro's return in order to overthrow Kaido and Orochi and to realize Oden's dream of opening the borders of Wano."}], "images": []}, {"title": "Shimotsuki Family", "level": 4, "content": [{"type": "paragraph", "text": "As the heir of the Kozuki Family, Oden has a close friendship with the renowned Shimotsuki Family, particularly Yasuie, whom he referred to as \"uncle\". After he was exiled from the Flower Capital by his father, Oden had sought refuge in Hakumai under Yasuie's care. Oden was even perfectly content to relinquish his birthright of becoming the next Wano Country Shogun to Yasuie which the latter strictly berated him for. Heeding Yasuie's advice to prove himself a great samurai, Oden traveled to the lawless region of Kuri to restore order and prosperity to the region. Yasuie also showed his support for Oden by giving away massive amounts of money to the Nine Red Scabbards including encouraging them to become the best samurais in Wano in order to effectively support Oden. After Oden was executed, Yasuie and Ushimaru had also tried to avenge Oden by staging a rebellion only for it to end in failure due to Kaido."}], "images": []}, {"title": "Yakuza", "level": 4, "content": [{"type": "paragraph", "text": "Oden held absolute respect for his idol Hyogoro of the Flower for his immense chivalry as a samurai. Twenty years after his death, Hyogoro joined Momonosuke and the Nine Red Scabbards in the revolution to overthrow Kaido and Orochi in Oden's memory."}], "images": []}, {"title": "Roger Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Before meeting Oden, Roger expressed interest in meeting Oden after hearing stories of him as a member of the Whitebeard Pirates. Also, Buggy and Shanks were somewhat jealous of Oden for getting great reputation as a pirate."}, {"type": "paragraph", "text": "As a member of the Roger Pirates, he was a well-respected individual among his crew. Roger and Shanks both took a liking to Oden. He referred to Shanks and Buggy as his respective first and second sons, though the latter was annoyed for being called one. The entire crew wanted to help Oden’s wish to make Wano Country open to the world but Oden declined as he wanted to solve the problem on his own."}], "images": []}, {"title": "Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Before becoming a member of the Roger Pirates, Oden was once a member of the Whitebeard Pirates, as well as a Division Commander. According to both Inuarashi and Sengoku, Whitebeard was extremely fond of Oden. The introduction started off rocky, when Oden clashed with the captain and declared his intention to join."}, {"type": "paragraph", "text": "The other members were at first angry at Oden for attacking their captain without warning. Whitebeard was also against him joining; while he acknowledged Oden's strength, Whitebeard was cautious due to his wild nature and feeling that Oden was not the kind of person who would serve someone, knowing from experience of the consequences that could bring. Whitebeard also did not want to cause an incident in Wano. After Whitebeard and his crewmates witnessed Oden’s unbreakable determination and immense kindness, they became deeply impressed and welcomed Oden officially, with the members tossing Oden up into the air congratulating him. Eventually, Whitebeard's trust in Oden became great enough that he made him a division commander of his crew while Oden became extremely close friends with the other members as they would rush to help him when Oden's reckless excitement led him to danger."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Oden_and_the_Whitebeard_Pirates.png/revision/latest/scale-to-width-down/220?cb=20191203114756", "caption": "Oden and the Whitebeard Pirates."}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Beasts Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Kaido sought the Kozuki Family because Oden had been to Laugh Tale. Refusing to let Kaido get the information, Oden retaliated by attacking Kaido, giving him a massive scar, and also sacrificed himself to allow his retainers to escape. The Beasts Pirates were eager to kill him in sadistic ways, including boiling him like his namesake."}], "images": []}, {"title": "Kurozumi Orochi", "level": 4, "content": [{"type": "paragraph", "text": "When they first met, Oden did find him strange and Orochi was willing to lay on a puddle on Oden's behalf. After Orochi quit being Yasuie's servant, Oden lent him money out of kindness."}, {"type": "paragraph", "text": "Rather than repaying Oden's generousity, Orochi orchestrated a despicable scheme to become Shogun, by setting up Oden and sentencing him to death. After Oden's death, his legacy has become taboo to Orochi, who became paranoid over his wife's prophecy that after twenty years, nine samurais would exact vengeance on him in Oden's name. Yasuie even used Oden's namesake to mock Orochi's cowardice."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "As a Pirate, he was issued a bounty by the Marines."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As daimyo of Kuri, Oden had a large amount of power and influence over the region before his death. Nami even deduced that given his position, he must had possessed a large sum of wealth. He also had the ability to hear the \"Voice of All Things\", which his son also inherited. Being a former member of both the Whitebeard Pirates, as a former Divison Commander, and the Roger Pirates, Oden was regarded as being a tremendously powerful pirate with a great level of influence in both crews. His influence even extends toward the members of the Mink Tribe on Zou, with the leaders Inuarashi and Nekomamushi being members of the Nine Red Scabbards."}, {"type": "paragraph", "text": "Additionally, the rest of the Mink Tribe has shown enough respect and loyalty toward the Kozuki Family that all of them were willing to die rather than to allow one of Oden's retainers from being captured even after Oden died. In spite of all the conflicts that he had with the Yakuza over the years, his death had such an impact on the leaders of the Yakuza that they staged their own rebellion against Kurozumi Orochi who had allied with Kaido before they were all captured and sent to Udon prison."}, {"type": "paragraph", "text": "Oden possessed a tremendous combination of combat skills and charisma. His combat prowess was seen at an early age, when he got into massive battles and altercations with powerful samurai and yakuza and survived, causing an implied high number of casualties over the years. Despite being frequently pursued by authorities in his youth, he was only captured once and eluded capture many times afterward. His combat and charisma combination was best seen in his restoration of peace to Kuri, where he defeated the powerful Ashura Doji and then proceeded to round up the rest of the dangerous criminals and get them to work under him, including Ashura. Prior to this, he also demonstrated his charisma by quickly becoming a figure of high repute as a laborer in the quarry."}, {"type": "paragraph", "text": "As Oden admitted himself, he had no talent in sailing and navigation."}], "images": []}, {"title": "Literary Skills", "level": 3, "content": [{"type": "paragraph", "text": "Despite his brash personality, Oden has great literary skills, having started writing a log book detailing his journey around Wano Country. As a descendant of the Kozuki Family, Oden also inherited from his ancestors the knowledge and skill to read Poneglyphs and write its ancient language."}], "images": []}, {"title": "Culinary Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Oden was an expert in cooking oden soup, having managed to use the fire of Katsuou's cremation to cook a large pot of oden soup. Oden was also the one in charge of cooking food for his retainers during his journey around Wano. Kawamatsu and Inuarashi greatly enjoyed Oden's delicious oden soup."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Oden had tremendous physical strength since infancy, during which he flung his wet nurse across the room. By age two, he could catch rabbits with his bare hands, and at age four, he killed a bear by throwing a boulder at it. At adulthood, Oden could carry a giant Koi carp which he caught at sea by himself, and exerted enough physical power in his swordsmanship to clash with Whitebeard's Meito Murakumogiri. To match his tremendous strength, Oden also had astounding tolerance to pain, as he could hold a hot pot with his bare hands.."}, {"type": "paragraph", "text": "He had immense stamina and endurance, as he was able to fight against the criminals and ronin of Kuri joined led by Ashura Doji for an entire night alone with multiple wounds such as arrows sticking out of his body yet still came out victorious. Additionally, he held onto a chain being pulled by the Moby Dick and faced the many dangers and climates of the New World ocean with no protection for three days before eventually letting go. When he washed ashore on an island after his chain ride, he received slight treatment from Toki and slept for one night before getting up with exuberant energy, surprising Toki with his tremendous recovery speed."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Oden was an extremely powerful master samurai, dual-wielding a pair of legendary blades in a style of swordsmanship called Daito Nitoryu (大刀二刀流, Daitō Nitōryū, literally meaning \"Long-Sword Two-Sword Style\"). At least during his younger days, Oden himself referred to his swordsmanship as Oden Nitoryu (おでん二刀流, Oden Nitōryū, literally meaning \"Oden Two Swords Style\"), known in the VIZ manga as Oden Two-Sword Style."}, {"type": "paragraph", "text": "Even at age nine, Oden could fight an entire Yakuza gang in the Flower Capital. At age 18, he struck down a massive beast known as the Mountain God. Oden also easily sank a large pirate ship, cutting it in half. As Kin'emon stated, it was by his swordsmanship that Oden was able to tame the formerly lawless Kuri, fighting all of its outlaws and ronins alone, including defeating the region's most dangerous criminal, Ashura Doji (someone noted to be worth 100 men in battle). Even more notably according to Tenguyama Hitetsu, Oden was the only one who fully mastered Enma's negative drawbacks, and was able to use it to permanently scar the near-invulnerable Kaido, something no one else has been able to before and after."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Togen Shirataki (, Tōgen Shirataki, literally meaning \"Paradise White Waterfall\"): Oden hardens both his swords with Busoshoku Haki, then delivers a diagonal slash with each one of them at the same time. This technique has immense power and range, as seen when Oden used the technique to cut down the massive Mountain God, cleanly bisecting it in half. \"Shirataki\" is a type of Japanese noodles. In the VIZ manga, this is called Paradise Waterfall.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Oden wielded two Meito of the O Wazamono grade: Ame no Habakiri (the sword said to be able to cut \"heaven\" itself) and its sister sword Enma (the sword said to be able to cut to the \"bottom of hell\"), with the latter being the only known blade that has ever harmed Kaido."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Oden%27s_Swords.png/revision/latest/scale-to-width-down/200?cb=20190917085405", "caption": "Oden's swords."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Haoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Oden possessed Haoshoku Haki, a very rare type of Haki whose users are said to have the qualities of a king. During his initial encounter with Edward Newgate 30 years ago, their sudden clash created a notable effect similar to lightning and released a large burst."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/94/Oden%27s_and_Whitebeard%27s_Haoshoku_Haki_Clash.png/revision/latest/scale-to-width-down/200?cb=20191125131103", "caption": "Oden and Whitebeard's clash of Haoshoku Haki."}]}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Oden was an exceptionally skilled master of Busoshoku Haki, which is known as \"Ryuo\" in Wano. This is most noted as he was the only samurai who could tame the Meito, Enma despite its dangerous haki-draining properties, which even Kin'emon, a member of the Nine Red Scabbards, feared to accept. As a true and further testament to his skills, he was able to wound even the nigh-invincible Kaido whereas even Luffy using Boundman could not even damage him, displaying his supreme mastery of this Haki compared to Zoro who had his arm emaciated after his initial attempt at using Enma although he forced his Haki back into his arm."}, {"type": "paragraph", "text": "Even at the age of eighteen, he was already masterful in using \"Ryuo\", as he could imbue it into both his swords (Ame no Habakiri and Enma) hardening them and cleanly bisect the gigantic Mountain God of Wano in a single slash. At the age of twenty-nine, Oden could harden his swords and clashed against Busoshoku Haki enhanced Murakumogiri, one of the 12 Saijo O Wazamono belonging to Edward Newgate, who was an immensely powerful Busoushoku Haki master in his own right."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/10/Oden_Using_Busoshoku_Haki.png/revision/latest/scale-to-width-down/200?cb=20191107073502", "caption": "Oden using \"Ryuo\" to harden his swords."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Chaotic Youth", "level": 3, "content": [{"type": "paragraph", "text": "Oden was born in the Flower Capital of Wano Country to the shogun Kozuki Sukiyaki 59 years before the present day, and he began committing outrageous acts as soon as infancy. When he was less than a year old, he threw his wet nurse across the room. When he was 2, he caught two rabbits with his bare hands, and at age 4, he killed a bear by throwing a large boulder at it. Starting at age 6, he started roaming the Red-Light District and participating in casinos, and by the time he was 8, he started drinking booze and began picking fights with gamblers. At age 9, even the yakuza had banned him from their casino. This resulted in Oden setting their casino on fire and starting a conflict with them, culminating in his capture a year later after he almost killed someone."}, {"type": "paragraph", "text": "As punishment, Oden was sentenced to hard labor in the quarries, and he worked well enough there to gain significant prestige. When he was 14, he attempted to help the Flower Capital citizens during a great drought by diverting a river to the city. However, this resulted in the Capital becoming flooded, and the authorities attempted to capture Oden again. To escape, Oden set out to sea for the very first time, but was quickly forced to return to land. When he was 15 and still in hiding, he started working at a mountain temple, where he formed a harem of women whom he kidnapped from the Capital at night. The women's loved ones, as well as many powerful samurai, went after Oden to stop him, but Oden stood his ground, resulting in the massive Harem Revolt (ハーレムの乱, Hāremu no Ran, VIZ Media: Harem War)."}, {"type": "paragraph", "text": "For the next three years, Oden attempted to set out to sea 38 times. He quickly failed every time, though he managed to survive. At age 18, he went into the Flower Capital and proceeded to cook a pot of oden soup over the cremated remains of a man named Katsuzo. After leaving the crematorium, he saw that a Mountain God was attacking the Flower Capital, and overheard Kin'emon and Denjiro talking about the Mountain God's offspring being in their possession. Oden then told them to give him the giant boar's offspring."}, {"type": "paragraph", "text": "Oden then took the white boar when Kin'emon tried attacking the Mountain God. After Kin'emon was overpowered, Oden used the white boar to get the Mountain God's attention. As the giant beast charged at him, Oden struck it down. When Kin'emon was going to take responsibility for the Mountain God's attack, Oden knocked him out and took the blame himself. His father's aide then delivered a message to him, saying that he was disowned and exiled from the Flower Capital. Out of gratitude and awe, Kin'emon and Denjiro began following him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3d/Oden_Vs_Yakuza.png/revision/latest/scale-to-width-down/200?cb=20191209082723", "caption": "Oden waging war against the yakuza."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Oden_Being_Exiled.png/revision/latest/scale-to-width-down/200?cb=20191124042939", "caption": "Oden being exiled from the Flower Capital after becoming disowned."}]}, {"title": "Reforming Kuri", "level": 3, "content": [{"type": "paragraph", "text": "After leaving the capital, Oden moved to Shimotsuki Yasuie's residence at Hakumai, where he also met Kurozumi Orochi, who was working as a servant there. Yasuie later got mad at Oden for living as a vagabond instead of rising to his father's challenge. Oden told Yasuie how he wanted to set out to sea, and Yasuie replied that he had to become a competent samurai before he could be so selfish."}, {"type": "paragraph", "text": "After hearing about Ashura Doji, Oden decided to journey to Kuri, which was Wano's most lawless region. During the journey, he was followed by Kin'emon and Denjiro. Along the way, the group was joined by Kikunojo and Izo at Ringo, Kanjuro at Kibi, and Raizo at Udon. Oden entered Kuri alone and fought all the bandits there, including Ashura, Kuri's most dangerous criminal. By the time his companions arrived, Oden had defeated all of his enemies. With the help of his companions, Oden rounded up the other criminals to bring peace to Kuri. He had the residents work to build a village to live in, and he built the Paradise Farm to feed them. Oden was then granted the title of daimyo of Kuri at the age of 20 after Sukiyaki heard about his deeds. In addition, Oden chose the companions he made on his journey as well as the reformed Ashura to be his retainers. After Orochi quit being Yasuie's servant, Oden lent him money to support him."}, {"type": "paragraph", "text": "While fishing at Kuri Beach, Oden discovered Inuarashi, Nekomamushi, and Kawamatsu being tormented by humans who persecuted them. Oden rescued the three and they followed him back to Kuri and became his retainers. 30 years ago, Oden heard that his father had fallen ill and he visited the Flower Capital with his retainers. Oden then spoke with his father one last time."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Oden_Becomes_Daimyo.png/revision/latest/scale-to-width-down/200?cb=20191124042932", "caption": "Oden becomes daimyo of Kuri."}]}, {"title": "Leaving Wano", "level": 3, "content": [{"type": "paragraph", "text": "Some time later, Oden heard that a pirate ship arrived and he rushed off to meet the crew. Oden encountered the Whitebeard Pirates and he asked to join the crew after a brief clash with Whitebeard. Afterwards, Oden and his retainers had a feast with Whitebeard's crew. Oden kept asking to join only to be turned down. Two weeks later, the Whitebeard Pirates tried to leave Oden behind, but he caught up to them and held onto a chain he attached to the ship. Izo also held onto Oden and got dragged away with him. After pulling Izo up onto the ship, Whitebeard gave Oden a test. If he could hold onto the chain for three days, he would be allowed into the crew. Just when Oden only had ten minutes left, he heard a woman in trouble and let go. He drifted to an island and scared away some kidnappers who mistook him for a sea monster, saving the woman in the process. On the next day, he got acquainted with the woman, who was named Toki. They were then confronted by Karma and his crew, but Whitebeard came and defeated Karma. Whitebeard then finally allowed Oden to join his crew. After boarding, Oden discovered that Inuarashi and Nekomamushi had stowed away on the ship, waiting for Oden. Afterwards, Oden went on adventures with the Whitebeard Pirates."}, {"type": "paragraph", "text": "On his journey, Oden charmed Whitebeard, and also became a notorious outlaw with a bounty, while finding the geography of the world and the World Government overseeing it as both astounding and unbelievable. Having grown closer with Toki and marrying her at some point, the pair became parents on their second year aboard the Moby Dick, and named their son Kozuki Momonosuke. Later, as the crew was growing in numbers, Whitebeard split its members into five divisions, leading to him appointing Oden as the commander of the second division. Sometime later, he and Toki would have a daughter whom they named Kozuki Hiyori."}, {"type": "paragraph", "text": "Sometime after Oden's fourth year of his voyage, Gol D. Roger poached him to accompany the Roger Pirates on their final voyage. Joined by Nekomamushi and Inuarashi again, his retainers left him by the time the crew reached Laugh Tale. Having captivated Roger, he was favored by both him and Shanks. Grateful he joined Roger, he declined offers from his crew members with assisting him in opening Wano's borders, and instead sought to make his envisionment a reality with the aid of his retainers and by becoming shogun."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/82/Oden_Leaving_Wano.png/revision/latest/scale-to-width-down/200?cb=20191209083041", "caption": "Oden leaving Wano."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Oden_Sailing_With_Roger_Pirates.png/revision/latest/scale-to-width-down/200?cb=20191124043941", "caption": "Oden sailing with the Roger Pirates."}]}, {"title": "Death", "level": 3, "content": [{"type": "paragraph", "text": "Over 20 years before the present, Oden left Roger's crew and returned to Wano Country, despite the country's rules on leaving and returning to its borders. Around that time, he was executed in the Flower Capital by Kaido and Kurozumi Orochi for refusing to divulge information of Laugh Tale, and he died without passing on the knowledge of the Poneglyphs to Momonosuke and Hiyori. His last words to his son and retainers were his wish to open Wano to the outside world."}], "images": []}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "After this, Kaido would later attack the rest of his family and retainers and burn down Oden Castle in an attempt to kill his heirs and prevent the Kozuki Family from fulfilling Oden's final wishes, an attempt that was ultimately foiled by his wife sending Momonosuke and the remaining retainers 20 years into the future with her Toki Toki no Mi power. Inuarashi and Nekomamushi, both of whom began arguing after the execution, were caught and not sent forward through time. Both of them escaped and returned to Zou alive, but became bitter towards each other for the next twenty years until Momonosuke, who arrived via Toki's power, persuaded them to reconcile for Oden's sake."}, {"type": "paragraph", "text": "With Kaido and his crew occupying the Wano Country, and with Orochi now the Shogun of Wano, the two went to great lengths to undo Oden's work within the country, with Orochi and his followers destroying the reputation of Oden and the entire Kozuki Family throughout the country, and with the Beasts Pirates, under the leadership of Jack of the Disasters taking control over Kuri and all of its resources."}, {"type": "paragraph", "text": "His dream to open Wano to the rest of the world now lives on in his son, Momonosuke, as well as his retainers, as they planned to recruit allies from both inside and outside of the country to overthrow Orochi and Kaido. After meeting and befriending Monkey D. Luffy and Trafalgar D. Water Law, Momonosuke and his retainers formed an alliance with the Straw Hat and Heart Pirates and the entire Mink Tribe in the pursuit of achieving this goal, forming the Ninja-Pirate-Mink-Samurai Alliance as a result.Jibuemon, a former retainer of Oden's father, gathered people who still supported their cause within the country, all in anticipation for the return of the missing members of the Kozuki Family."}, {"type": "paragraph", "text": "A simple grave with a wooden post bearing his name was later made for him on the ruins of his old castle which stood alongside the \"graves\" of his son and retainers who were presumed deceased by Wano's natives. Oden also passed on his two swords to each of his children: the Ame no Habakiri for Momonosuke and Enma for Hiyori. The swords were left in the care of Tenguyama Hitetsu until the children could claim them. Believing himself not strong enough yet to wield his designated heirloom, Momonosuke refused to accept the Ame no Habakiri out of respect for his father's legendary strength. Hiyori chose to relinquish Enma to Zoro, her second savior and protector as well as one of the Kozuki Family's greatest allies in their goals to overthrow Kaido and Orochi and open the borders of Wano Country."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kozuki Oden vs. Yakuza gangs", "elements": []}, {"text": "Kozuki Oden vs. Mountain God", "elements": []}, {"text": "Kozuki Oden vs. Bandits of Kuri", "elements": []}, {"text": "Kozuki Oden vs. Ashura Doji", "elements": []}, {"text": "Kozuki Oden vs. Edward Newgate", "elements": []}, {"text": "Kozuki Oden vs. Kaido", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oden is the name of a traditional Japanese winter dish.", "elements": []}, {"text": "Oden is similar to Mont Blanc Noland, as they are both the main protagonists of flashback stories in which they are executed in the end by greedy nobles, who then besmirched their family names through lies and misinformation.", "elements": []}, {"text": "Oden bears a resemblance to Heracles, a divine hero in Greek mythology:", "elements": [{"text": "Both possessed tremendous strength since infancy.", "elements": []}, {"text": "Both had numerous affairs with women.", "elements": []}, {"text": "Some of Oden's actions are based on the Twelve Labours of Heracles:", "elements": [{"text": "Oden defeating the Mountain God is based on the fourth labour, the capture of the Erymanthian Boar.", "elements": []}, {"text": "Oden's attempt to help the Flower Capital citizens during a great drought by diverting a river to the city is based on the fifth labour, cleaning the Augean stables in a single day. Unlike Heracles, Oden's action ended in disaster.", "elements": []}]}, {"text": "Both were rejected and disowned by one of their family members (Heracles' nemesis was Hera and Oden was disowned by his father, Kozuki Sukiyaki).", "elements": []}, {"text": "Both were sailors (Heracles was part of the Argonauts and Oden sailed with the Whitebeard Pirates and Roger Pirates).", "elements": []}, {"text": "Both had fathers who were rulers of their respective domains (Heracles's father was Zeus, King and ruler of Olympus; Oden's father was the head of the Kozuki family and shogun of Wano).", "elements": []}]}]}], "images": []}]}