{"sections": [{"title": "Raise Max", "level": 1, "content": [{"type": "paragraph", "text": "Raise Max is a non-canon member of the Revolutionary Army who appeared in One Piece Film: Gold."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Max is a very short and bedraggled man with unkempt long green hair, a tattered hat, and large glasses, which shattered when he fell into a large fan. On his left cheek is an orange number 7. He wears an open coat exposing his chest, striped pants, and pointed shoes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e9/Raise_Max_Concept.png/revision/latest/scale-to-width-down/150?cb=20180927002428", "caption": "Max's full appearance."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Max was initially a bold and confident hero, but after receiving a huge loss in Gran Tesoro, he started resigning himself to his imprisonment and losing hope. However, Max was swayed by Monkey D. Luffy's determination, giving him the motivation to risk his life to help him and his allies escape from their confines."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Max possesses tremendous strength and durability, as he was able to slow down an extremely large and fast fan just by pressing his body against the wall and holding one of the blades back. He was able to withstand being tossed around by the fan's blades and regain his composure enough to allow him to crawl on the fan."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Max was a member of the Revolutionary Army, but he went to Gran Tesoro and experienced a huge loss, causing him to be imprisoned in a giant chamber with nothing but gold inside."}], "images": []}, {"title": "One Piece Film: Gold", "level": 3, "content": [{"type": "paragraph", "text": "Monkey D. Luffy and Franky were sent down to the gold chamber, and Max revealed to them what this place was. In response to Luffy's attempts to break apart the gold that Gild Tesoro had encased his arms in, Max revealed that there was a room containing a pipe system of seawater that could wash away the gold, and it was accessible through a giant pipe nearby. The chances of making it all the way to the room were very slim, but Luffy decided to go there anyways. Franky followed him, and Max and his fellow prisoners eventually decided to go after the two pirates."}, {"type": "paragraph", "text": "The group fought off a swarm of bats in the pipe, and they came to a vertical pipe that had a giant fan spinning rapidly underneath them. Max advised Luffy to go back, but Luffy refused and was thus batted away and injured by the fan blades. Impressed by Luffy's resolve, Max decided to help him, and he jumped into the fan. However, he was caught and tossed around by the fan blades as well, but he eventually managed to regain his composure and hold on to one of the blades. Max then crawled on the blade until he reached the wall, and he put his back against the wall as he put all his strength into stopping the fan. Max eventually managed to start slowing the fan down, and his subordinates became inspired by the effort and jumped down as well, which allowed them to completely stop the fan."}, {"type": "paragraph", "text": "The group managed to make it down to the seawater room, and Luffy managed to break open the seawater tank. However, Gild Tesoro sent water flooding into the room as part of his plan to eliminate the Straw Hats. However, this went according to the Straw Hats' plan, as Max, his fellow prisoners, Luffy, and Franky were sent up with the seawater, emerging from Gran Tesoro's fountains."}, {"type": "paragraph", "text": "As the Straw Hats began their battle against Tesoro's crew, Max led his fellow prisoners in battle against Tesoro's men, motivated by Luffy's example to put his all into fighting. After Luffy defeated Tesoro, Max reunited with his fellow revolutionaries Sabo and Koala, and the three sailed away from Gran Tesoro."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 83 Chapter 829, Raise Max appears on Chapter 829's color spread.", "elements": []}, {"text": "↑  One Piece Movie 13, Raise Max makes his debut.", "elements": []}, {"text": "↑  Weekly Shonen Jump 2016 Issue 15", "elements": []}]}], "images": []}]}