{"sections": [{"title": "Shin Detamaruka", "level": 1, "content": [{"type": "paragraph", "text": "Shin Detamaruka is a citizen of Dressrosa and a former dancer. She is the grandmother of Shin Jaiya."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Detamaruka is an old woman with white hair and a large number of wrinkles. She wears a pink and purple polka dotted dress."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Detamaruka cares about her granddaughter, wanting to ensure she was safe from the Birdcage despite her impending death."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Due to being advanced in age, Detamaruka is frail, and after a long time running from the Birdcage she collapsed without being able to get back up. However, after being spurred on by former King Riku, she gained the willpower to run fast again."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Detamaruka and Jaiya ran from the Birdcage as Donquixote Doflamingo began closing it. Suddenly, Detamaruka fell and was unable to get back up. She told Jaiya to leave her and keep going, but Jaiya refused. They then listened to their former king, Riku Doldo III, encouraging everyone to keep staying alive and that there was hope, which caused Detamaruka to get back up and started running at a very fast pace, much to the joy of her granddaughter."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Shinde tamaruka (死んでたまるか, Shinde tamaruka) literally means \"There's no way I'm dying\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 78 Chapter 785 and Episode 727, Detamaruka is shown.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 81, Detamaruka's name is revealed.", "elements": []}]}], "images": []}]}