{"sections": [{"title": "Shin Jaiya", "level": 1, "content": [{"type": "paragraph", "text": "Shin Jaiya is a citizen of Dressrosa. She is the granddaughter of Shin Detamaruka."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jaiya is a little girl with a long blonde hair in two ponytails, and brown eyes. She wears a blue long-sleeved dress with white collar. "}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Shin Detamaruka", "level": 3, "content": [{"type": "paragraph", "text": "Jaiya was distraught when her grandmother was unable to get up and was left to be killed by the Birdcage, and cried with tears of joy when she got back up."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Jaiya and her grandmother ran from the Birdcage as Donquixote Doflamingo began closing it. Suddenly, Detamaruka fell and was unable to get back up. She told Jaiya to leave her and keep going, but Jaiya refused. They then listened to their former king, Riku Doldo III, encouraging everyone to keep staying alive and that there was hope, which caused Detamaruka to get back up. As she watched her grandmother ran at a very fast pace, Jaiya cried tears of joy."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jaiya aspires to be a dancer.", "elements": []}, {"text": "Shinja Iya (死んじゃいや, Shinja Iya) literally means \"I don't want you to die\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 78 Chapter 785 and Episode 727, Jaiya is shown.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 81, Jaiya's name is revealed.", "elements": []}]}], "images": []}]}