{"sections": [{"title": "Tegata Ringana", "level": 1, "content": [{"type": "paragraph", "text": "Tegata Ringana is a doctor on Dressrosa."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ringana is a middle-aged man with bushy black hair on the sides of his head and a comb-over on top. He wears glasses and a suit and tie, which is covered by a doctor's lab coat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a doctor, Ringana cares about his patients, and was determined to get all of them to safety despite the threat of the closing Birdcage nearby."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a doctor, Ringana has some medical expertise, though how much he has is unknown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "As Donquixote Doflamingo started closing the Birdcage on Dressrosa, Ringana and some nurses tried evacuating every patient who could not walk out of the hospital. As the Birdcage neared, Ringana began losing hope since there were still many patients inside, and none of the citizens would help him. However, when former king Riku Doldo III told all the citizens to keep living and that there was hope, Ringana increased his efforts to evacuate the patients regardless of how many people helped him or not."}, {"type": "paragraph", "text": "He later watched in surprise at how the floating dandelions in the air were able to heal one of his patients' legs. He and his patients then continued running away from the closing Birdcage."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ringana plays guitar as a hobby.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 78 Chapter 785 and Episode 727, Ringana is shown.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 81, his name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 79 Chapter 788, Rigana witnesses the healing powers of the floating dandelions created by Mansherry.", "elements": []}]}], "images": []}]}