{"sections": [{"title": "Sarie Nantokanette", "level": 1, "content": [{"type": "paragraph", "text": "Sarie Nantokanette is the queen of Goa Kingdom and Sterry's wife."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nantokanette is a tall thin woman, with long bright wavy blonde hair, blue eyes and a pointy nose. She wears a yellow-orange dress with flower motifs and a feather on her hair."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/18/Sarie_Nantokanette_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180913155518", "caption": "Nantokanette's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She is somewhat optimistic compared to other nobles from her kingdom as she did not complain about her hotel room in Loguetown. However, Oda stated that she is likely as bad as her husband. She did show concern for Sterry as she was appalled at Vice Admiral Garp's derision of her husband during the reception of the various royals prior to the Levely."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As queen of the Goa Kingdom, Nantokanette has authority over its subjects as well as considerable wealth, and she can attend Levely."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, she married Sterry. Following the unexpected deaths of the previous king and prince of Goa, Sterry took the throne and then Princess Nantokanette became his queen."}], "images": []}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Nantokanette and Sterry were staying at a hotel for royalty in Loguetown."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Nantokanette and her husband later arrived at the Red Port, where she was shocked by Garp's rudeness towards Sterry. They then took the bondola to go up to Mary Geoise. After reaching the top of the Red Line, they made their way to the Mary Geoise castle."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Nantokanette, Sterry, and their loyal subjects left the Levely, she expressed shock to find out Sabo had infiltrated Mary Geoise."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is a reference to Marie Antoinette (マリー・アントワネット, Marī Antowanetto). The name Nantokanette, ナントカネット, translates to \"Something-nette\". Oda stated that he was lazy when coming up with it because he believed she would be as bad of a person as Sterry.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 82 Chapter 823 (p. 6).", "elements": []}, {"text": "↑  https://one-piece.com/special/sbs/detail/7.html", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 84.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 (p. 9) and Episode 883, Nantokanette is shocked at Garp's mockery of Sterry despite his position as a monarch.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 905.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 and Episode 883.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 906.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956.", "elements": []}]}], "images": []}]}