{"sections": [{"title": "Gotti", "level": 1, "content": [{"type": "paragraph", "text": "Gotti is an assassin in the Fire Tank Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gotti is a very large man with spiky light purple hair (dark purple in the anime) on the sides of his head and beard, although the top of his head is bald. He wears a black vest with a white suit underneath it, with a large green cape over it. He has a large silver metal plate (black in the anime) on his left shoulder going down his left side with his name and the same symbol as Vito's tattoos on it."}, {"type": "paragraph", "text": "His right forearm has a giant red, green, and yellow (orange, black, and yellow in the anime) three-barreled machine gun attached to it, which has a chain on it. Whether this is an additional attachment or a limb replacement has yet to be confirmed."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Gotti is a hotheaded man who acts very violently to people who disrespect his fellow crew members, and his violent rages are difficult for even his crewmates to stop. However, Gotti is deeply afraid of Charlotte Chiffon."}, {"type": "paragraph", "text": "Gotti follows Bege's orders and ideas without question and carries them out with brutal conviction. When a Door Homie saw the pirates with Caesar and realized they were plotting something, Gotti wasted no time carving the homie's face out of the door."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Capone Bege", "level": 4, "content": [{"type": "paragraph", "text": "As with the other crew members, Gotti is very loyal to his captain, whom he addresses as \"Father\". During the meeting between the Straw Hat Pirates and Fire Tank Pirates, Gotti was willing to intervene when Luffy stated his intentions of wanting to attack Bege and stated he would not let anyone disrespect his captain. At the tea party, Gotti gave Bege his full support in his plot to assassinate Big Mom. He silenced a door homie to prevent it from alerting Big Mom of his captain's plan and later prepared to fire a KX Launcher at the Yonko while she was in a vulnerable state."}], "images": []}, {"title": "Vito", "level": 4, "content": [{"type": "paragraph", "text": "When Gotti heard Sanji yell at Vito, he became very enraged and attempted to kill Sanji for the disrespectful act, despite Vito telling him to stop."}], "images": []}, {"title": "Charlotte Chiffon", "level": 4, "content": [{"type": "paragraph", "text": "Gotti is shown to fear his captain's wife, Charlotte Chiffon, as she was able to stop him from attacking Sanji and capable of dragging him by the ear. Chiffon also berated him as endangering her mother's plans by harming Sanji as it would have lead to fatal consequences for Capone Bege."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Despite his immense value to Big Mom (and, by extension, to Gotti's captain, Capone Bege), Gotti threatened Sanji when the cook disrespected Vito. Sanji responded to his anger apathetically, causing Gotti to become even angrier."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Even with only one arm, Gotti is a skilled swordsman. Using a cutlass, he swiftly and cleanly carved the entire face of a massive door homie without causing any excessive damage to the door."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Gotti has a giant, three-barreled machine gun installed onto his right forearm. During the assassination attempt on Big Mom, Gotti attached a KX Launcher to his arm installment."}, {"type": "paragraph", "text": "He also used a cutlass as a secondary weapon."}, {"type": "paragraph", "text": "Gotti's metal plate on his left shoulder can also function as a shield, as shown when he used it to block Katakuri's bullets."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point after joining the Fire Tank Pirates, Gotti lost his right arm and replaced it with a machine gun."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Vito entered Sanji's room on the Big Mom Pirates' ship and Sanji told him to get out, Gotti heard this and became enraged. Vito attempted to stop him as Gotti held his machine gun at Sanji, who responded by telling them both to get out. This enraged Gotti even more, but Charlotte Chiffon entered the room, telling Gotti that severe retributions would be exacted against his captain if anything were to happen to Sanji. Gotti fell to the floor in fear, apologizing profusely."}, {"type": "paragraph", "text": "Bege's family and his crew took a captive Pekoms to an edge of a cliff at the northeastern coast of Whole Cake Island. Gotti watched as his captain shot Pekoms, causing the mink to fall into the shark-infested waters below."}, {"type": "paragraph", "text": "Two days later, Gotti was with his crew in Bege's hideout as Bege prepared to meet with Monkey D. Luffy to negotiate an alliance to take down Big Mom. When the Fire Tank Pirates met with Luffy a few hours later, Gotti attempted to attack Luffy when Luffy tried punching Bege for shooting Pekoms. After Jinbe broke up the quarrel, Gotti sat next to Bege as the latter went over his assassination plot."}, {"type": "paragraph", "text": "As guests arrived at the wedding venue, the Fire Tank Pirates acted as security. When Bege went over the plan with Caesar Clown, the crew noticed a door homie listening to them, so Gotti cut off its face in order to silence it. The Fire Tank Pirates went into Bege's body as he entered inside the wedding venue. As Luffy was causing chaos at the wedding venue, Bege told Gotti and Vito to prepare their KX Launchers. After Brook destroyed Mother Carmel's portrait, Gotti and Vito waited patiently for Big Mom to scream."}, {"type": "paragraph", "text": "When Luffy successfully caused Big Mom to start screaming, Gotti and Vito exited Bege's body and they all aimed their KX Launchers at her. They then fired the launchers, but Big Mom's scream detonated the rockets before they reached her, shocking Gotti and his allies. The alliance then tried to escape through the mirror that Caesar brought to the venue, but Big Mom's scream shattered the mirror. The alliance then found themselves surrounded by the Big Mom Pirates, who had been given earplugs by Charlotte Katakuri."}, {"type": "paragraph", "text": "Bege then transformed into a fortress and the members of the alliance quickly retreated. Katakuri shot several jellybeans at the alliance, but Gotti managed to block them with his shield as he went inside. As Bege's fortress came under attack by Big Mom, Bege swore not to allow his crew and family to die, causing Gotti to cry in happiness. Bege later returned to human form and had Caesar carry him out of the venue. Gotti remained inside Bege and cheered for the Vinsmokes as they assisted Caesar in the escape. When the Tamatebako dropped to the base of the Whole Cake Chateau, the bomb inside the chest exploded and caused the castle to topple over. Bege's crew, Luffy's group, and the Vinsmokes got away during the castle's destruction. At the northwest part of Whole Cake Island, the Fire Tank Pirates and the Sanji Retrieval Team went their separate ways."}, {"type": "paragraph", "text": "As Bege was pursued by Tart Tanks, Gotti was seen still inside Bege's body when Pudding caught up to them to ask for Chiffon's help. After Chiffon left with Pudding, the Fire Tank Pirates returned to their ship and escaped Whole Cake Island. They then head for Cacao Island to pick up Chiffon. As the crew reached the front of the harbor of Cacao Island, they were besieged by Tarteships. They were then contacted by Oven, who was holding Chiffon as a hostage to force Bege to surrender and Gotti was worried for Chiffon's safety. However, upon nearing the harbor, Bege shot Oven in the face and rescued Chiffon, much to Gotti's cheerful joy. As the Nostra Castello moved onto Cacao Island with tank treads, Sanji used a kick to lift the carriage holding the chefs (including Chiffon and Pudding) and the substitute wedding cake onto the deck of Bege's ship. After the ship returned to the sea, Oven tried preventing their escape by boiling the sea, but he was thwarted by Pound, enabling the ship to sail away from Cacao Island."}, {"type": "paragraph", "text": "On the way to the Thousand Sunny, Gotti watched as Sanji and Bege argued over what to do with the cake. After Sanji fed Bege his special ingredient and made him faint, Gotti and several members of the Fire Tank Pirates pointed their guns at Sanji until they saw the bliss on Bege's face. When the chefs finally completed the cake, Gotti cheered for their success. The Fire Tank Pirates later approached the Thousand Sunny and gained Big Mom's attention. After Pudding and Sanji left the Nostra Castello, the Fire Tank Pirates lured Big Mom away from the Sunny and headed for Liqueur Island. As they were getting close to Liqueur Island, they planned on dropping the cake there. However, Chiffon insisted that they change course to Funwari Island to give Nami and her friends more time to escape."}, {"type": "paragraph", "text": "The crew managed to reach Funwari Island but their ship was destroyed. After dropping off the cake, they fled and stole a tarteship."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/Gotti_Threatens_Sanji.png/revision/latest/scale-to-width-down/210?cb=20170409022717", "caption": "Gotti threatens Sanji despite Vito's pleas."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Fire_Tank_Pirates_Attack_Linlin.png/revision/latest/scale-to-width-down/210?cb=20170612033323", "caption": "Gotti, Bege, and Vito fire KX Launchers at Big Mom."}]}, {"title": "\"Gang\" Bege's Oh My Family", "level": 3, "content": [{"type": "paragraph", "text": "After the escape from Totto Land, Chiffon declared to the Fire Tank Pirates that she wanted to locate and reunite with Lola. The Fire Tank Pirates then began the quest to find Lola. The crew later took over a pirate ship before planning to go to Thriller Bark. They later reached the Red Line, but they could not pass over it because of the Levely. They later went to Dressrosa to gather supplies. They then learned that Lola arrived at Dressrosa a few days before. Gotti then assisted Bege in searching for Lola."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "During the wedding in the Whole Cake Island Arc, Gotti's name was written as \"Gotty\" on his shoulderplate. However, it was changed to \"Gotti\" in Chapter 889, making it the same as John Gotti's name."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Misnamed_Gotti.png/revision/latest/scale-to-width-down/120?cb=20180527034148", "caption": "Gotti's name spelled with a \"Y\" on his shoulderplate."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Gotti is possibly named after John Gotti, a mobster who was the head of the Gambino crime family.", "elements": []}]}], "images": []}]}