{"sections": [{"title": "Bill", "level": 1, "content": [{"type": "paragraph", "text": "Bill was the leader of the Silver Pirate Alliance and the main antagonist of the Silver Mine Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bill is a muscular man with long, light brown hair. He wears an open blue jacket, purple pants with a blue star on the left leg, gray boots, a silver necklace as well as earrings, a belt wrapped around his waist multiple times, a red scarf tied to the belt, and a red cap with goggles on top. His belt has the letter \"S\" on its buckle. He also got his Jolly Roger tattooed on his left arm."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bill is very greedy, as his dream is to live the most luxurious lifestyle possible. He seems to be a charismatic man who is well respected by his subordinates, but in reality only views them as tools to help him gain wealth. He intends to dispose of all his crew members eventually in order to gain their bounties, and puts crew members who are not worth anything to him in servitude in the underground mines. He is very conniving, having nearly destroyed an entire pirate crew just to trick their captain into serving him. He is easily angered if things go wrong for him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the leader of the Silver Pirate Alliance, Bill has control over the crew. He also withstood Luffy's display of Haoshoku Haki, indicating stronger than average mental fortitude, and quickly recovered from a Busoshoku-enhanced Gear Second attack, demonstrating a fair amount of resilience."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Bill ate the Gutsu Gutsu no Mi, a Paramecia-type Devil Fruit that makes him a smelting man. By eating ore, he can heat it up into a molten substance in his body. He can then pull it out of his body and turn it into whatever object he wants, and can also shoot out the molten ore as an attack. This ability to create weapon allows him to stockpile on armaments for the Silver Pirate Alliance, and being situated in the Silver Mines grants him a large supply of materials to work with. If Bill eats enough ore, he becomes much larger and is capable of destroying entire islands with large amounts of molten ore. If he is covered in the molten ore, he becomes encased in silver, but unlike other victims of it, he can still move around and use the silver as armor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7a/Gutsu_Gutsu_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20160717205338", "caption": "Bill creates swords from the molten ore stored in his body."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When he was attacking Luffy and Bartolomeo, he wielded two swords created from his Devil Fruit power. In his final fight with Luffy, Bill created two more swords, an axe, and a bazooka with his Devil Fruit. However, despite his ability to make these weapons, he has shown no true proficiency in using them."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Bill and his crew were once defeated by Gild Tesoro, and since then Bill has paid Tesoro a monthly tribute of silver."}, {"type": "paragraph", "text": "Some time in the past, Bill attacked the Sweet Pirates and killed all but four of them. He then staged a rescue of the survivors in order to gain the trust of their captain, Desire, and use her capabilities for his own gain."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Tesoro_Defeats_Bill.png/revision/latest/scale-to-width-down/210?cb=20160718233409", "caption": "Bill lays defeated by Gild Tesoro's immense wealth."}]}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Bill sat on a throne in Silver Mine, eating ore and heating up his body."}], "images": []}, {"title": "Silver Mine Arc", "level": 3, "content": [{"type": "paragraph", "text": "Bill spoke to his subordinates in their silver fortress, receiving reports of the wanted pirates his men had captured. Desire then presented Monkey D. Luffy to him, and Bill prepared to kill the pirate. However, Bartolomeo arrived, and he and Luffy managed to escape from Bill and his subordinates. Bill ordered his men to go after the pirates."}, {"type": "paragraph", "text": "Later, Bill presented an offering of silver for Tanaka to take to Gild Tesoro. He received a report from Peseta that Luffy, Bartolomeo, and Desire had fallen underground, and Bill told him to call Aveyron. The Sweet Pirates came to Bill to tell him about Desire, but Bill assured them she would be all right. After Aveyron lost to Luffy and Bartolomeo, Bill decided to bury everyone inside the underground mine."}, {"type": "paragraph", "text": "After the pirates and enslaved miners escaped the mine, and after Roronoa Zoro defeated Peseta, Bill cut off Luffy and Bartolomeo's escape path as he was intent on getting Luffy's bounty. Desire confronted him over his betrayal of her and her crew, and Bill revealed to her that he only valued her for the profits she brought and that he was the one who had annihilated her crew."}, {"type": "paragraph", "text": "Bill taunted Desire and mocked the pirates' dreams as childish, but was suddenly punched by Luffy. Bill attempted to fight back with his weapons, but Luffy overwhelmed him as members of the Silver Pirate Alliance arrived. Bill told his subordinates that Desire had betrayed them, causing them to go after the pirates, but Luffy knocked them all out with Haoshoku Haki. Luffy then punched Bill into the underground mine, and Bill was approached by Tanaka, who told him that Gild Tesoro would not look kindly upon his loss to a pirate and would probably dispose of him. This gave Bill a drive to win and protect his life, and he started consuming massive amounts of ore."}, {"type": "paragraph", "text": "Bill later emerged as a giant, spewing large amounts of molten ore from his body, which caused Silver Mine to start crumbling away. Bill attacked Luffy, Bartolomeo, and Desire, but Bartolomeo managed to send all the molten ore that Bill had fired back toward him. The ore encased Bill's body in silver, and he prepared to annihilate the pirates with a ball of molten ore, but Luffy destroyed Bill's ball with Gomu Gomu no Grizzly Magnum and sent Bill flying into his fortress. Silver Mine later sank due to Bill's molten ore destroying it, and Tanaka later confirmed to Gild Tesoro that Bill had sunk along with it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/57/Muscle_Bill.png/revision/latest/scale-to-width-down/210?cb=20160717161934", "caption": "Bill gains a large figure after eating large amounts of ore."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bill vs. Monkey D. Luffy", "elements": []}, {"text": "Bill vs. Luffy and Bartolomeo", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His character design bears a heavy resemblance to Axl Rose, frontman of the hard rock band Guns N' Roses.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Anime — Episode 746, Bill makes his first appearance.", "elements": []}, {"text": "↑  https://one-piece.com/news/detail/20160606_3853", "elements": []}, {"text": "↑  One Piece Anime — Episode 750.", "elements": []}, {"text": "↑  One Piece Anime — Episode 747.", "elements": []}, {"text": "↑  One Piece Anime — Episode 748.", "elements": []}, {"text": "↑  One Piece Anime — Episode 749.", "elements": []}]}], "images": []}]}