{"sections": [{"title": "Charlotte Moscato", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Moscato is the 16th son and 25th child of the Charlotte Family and the eldest triplet brother of Mash and Cornstarch. He also is an officer of the Big Mom Pirates and serves as Totto Land's Minister of Gelato (ジェラート大臣, Jerāto Daijin), governing over Ice Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Moscato has a thick torso with comparatively thin arms and legs. His face is long and unshaven, and he has pink and blue hair slicked upward at the front, in the shape of a pompadour. He wears a dark blue jacket with tasseled, ice cream-shaped pauldrons and a thick belt with \"SM\" printed on the buckle over a striped suit. After being attacked by Big Mom, he had a bandage wrapped around his forehead and one on his neck."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Charlotte_Moscato_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180917033808", "caption": "Moscato's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Moscato cares greatly about Sweet City and its citizens, as shown when he ignored warnings from Mont-d'Or and stood up to Big Mom is an attempt to prevent his mother from destroying it in her craving-induced rampages. He continued to demonstrate his caring nature and bravery when he continued to ask his mother to stop even after she had begun to ask for his life. However, his bravery was no match for the horror of his mother's willingness to kill even him if he got in her way, and so Moscato was forced to flee in terror."}, {"type": "paragraph", "text": "Furthermore, he is loyal to his crew and family in spite of his mother's actions, as shown by his involvement in chasing after the Straw Hat Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Gelato, Moscato is in charge of procuring and distributing gelato to whoever needs it, and has authority over Ice Island of Totto Land, and as an officer of the Big Mom Pirates, he has authority over lower-ranking members of his crew. His combat powers and abilities are unknown, but he is presumably strong as he is an officer of a Yonko crew."}, {"type": "paragraph", "text": "He was able to jump back and dodge one of his mother's punches, though he was otherwise powerless to stop her rampage."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Moscato carries a long sword with a handle shaped like an ice cream cone on his back."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "When his mother went on a rampage and started devouring everything in Sweet City in an attempt to satisfy her craving for croquembouche, Moscato attempted to calm his mother. After hearing a seemingly random voice, Big Mom struck down a flaming ball of fire in front of Moscato and questioned who was interrupting her. Seeing as how Moscato was her son, the citizens became overjoyed and were confident that he could put a stop to Big Mom's hunger pang. Moscato then promised to get her the croquembouche as soon as possible, but Mont-d'Or warned him that it was no use. However, Moscato refused to back down, claiming that he would not abandon the city and let it be destroyed. Big Mom then struck down yet again with a ray of thunder and Moscato questioned her if she recognized him. However, the response he received was \"Life or Treat?\" Moscato still tried to calm Big Mom once more, but he was soon overwhelmed by the fact that she was willing to take his own life, and so turned around and fled. He begged for mercy and promised not to get in her way anymore, but it was too late, and Big Mom ended up stealing forty years of his life, leaving him incapacitated and presumed to be dead by everyone that witnessed the horrific scene."}, {"type": "paragraph", "text": "Later, after she had regained her senses, Big Mom left to speak with Jinbe and Moscato's body was carried away by the Chess Soldiers while Mont-d'Or ordered Big Mom's Incarnations to collect every last second of his stolen years."}, {"type": "paragraph", "text": "Some time later, Moscato recovered and three days later, he was on the Queen Mama Chanter when it attacked the Straw Hat Pirates on the Thousand Sunny. He expressed his shock as the Sunny was replaced with the Sun Pirates' ship before it could be destroyed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Soru_Soru_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20170521101146", "caption": "Moscato’s lifespan is stolen by Big Mom during one of her craving-induced rampages."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Muscat (Moscato in Italian) is a variety of grape used for wine, table grapes, and raisins. This follows the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}, {"text": "Gelato is the Italian word for \"ice cream\", and is used in English for ice creams made in the Italian style.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 83 Chapter 829 (p. 11-14) and Episodes 788–789, Moscato debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 83 Chapter 829 (p. 11) and Episode 789, Moscato's infobox reveals that he is the 16th son of the Charlotte Family and the Minister of Gelato.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 901 (p. 3) and Episode 876, Moscato is seen on the Queen Mama Chanter days after being attacked by Big Mom.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 83 Chapter 829 (p. 12) and Episode 789, Moscato dodges one of his mother's punches.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 83 Chapter 830 (p. 8) and Episode 790, Moscato's body is moved from the scene.", "elements": []}]}], "images": []}]}