{"sections": [{"title": "Charlotte Brûlée", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Brûlée is the eighth daughter and 19th child of the Charlotte Family and the older twin sister of Broyé. She is also an officer of the Big Mom Pirates."}, {"type": "paragraph", "text": "She was stationed in the Seducing Woods to ambush the Sanji Retrieval Team, but after being defeated, the team used her Devil Fruit ability to enter an alternate dimension known as Mirro-World to move around Totto Land. Due to her actions and role, she is a major antagonist in the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Brûlée looks in many respects like the stereotypical witch. She is an extremely tall, slightly hunched, and gray-skinned woman with a well-endowed yet thin figure, which makes her limbs appear to be exceptionally long. She stands at roughly twice Nami's height (170 cm), with her legs alone being noticeably longer than said woman is overall. She also has very long, gnarled fingers with overlong, sharp nails painted blue. The woman's face has very striking, hag-like features. Her droopy eyes have yellow irises and long lashes, and are topped by viridian eye shadow and black, high-arched eyebrows, which she keeps perpetually furrowed. She has a huge and over-projected, reddish hook nose (similar to her mother's), a large mouth with purple lipstick that is usually seen devilishly smiling, a square jaw, and a brown, sharp-cornered scar stretching diagonally down her face from right to left. Brûlée's hair is lavender and divided into two side locks that cascade over her breasts, as well as four other, similarly long, and sharp, lock-like segments that stick to the sides, slightly curved upward."}, {"type": "paragraph", "text": "She takes to wearing a whitish, creased gown. Its main upper section has a frilly scoop neckline, loose, flaring sleeves that are tattered at the edges, and stops quite below the waist in a frilled hemline, adorned by a horizontal row of red roses above. The lower, seemingly separate part of the dress, which begins under the upper one, falls to the ground and, too, has roses stitched onto itself in the aforementioned manner. Brûlée's clothing is completed by a feathered, sleeveless overcoat in moss green color (the latter, in addition to her grayish skin, earning her comparison to a tree by Carrot and to a branch by Monkey D. Luffy)."}, {"type": "paragraph", "text": "When she was taken to Capone Bege's hideout, her attire is forcefully changed into a more clean and elegant dress by the Fire Tank Pirates, which is also light in color, with two frilled hemlines and closer-fitting sleeves, as well as a light-colored coat above with actual sleeves and a light fur trim. Her hair was brushed into two sideward wicks. But after being saved by Katakuri, she changed her hair back to having four locks."}, {"type": "paragraph", "text": "As a young child, Brûlée's hair was shorter and partitioned into eight locks, and her nose was small and cone-shaped. She wore a white short sleeve dress with flowers around the neckline."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Brûlée is prideful, as she was rather offended when Carrot referred to her as a talking tree and Luffy called her a branch, as well as when her mother sent Charlotte Cracker to fight the Straw Hats in her stead due to not considering her powerful enough. Brûlée is confident in her powers and claims that she could kill the Straw Hats in an instant, not liking to be underestimated. Due to the terrible scar on her face, she is envious of those with alluring faces to the point that she wants to slice them up. Her jealousy is also tempered with a very sadistic nature as shown when she intended to boil Carrot alive, Brûlée was excited in disfiguring Carrot's face with horrible burns. She scoffs at the notion of anyone succeeding against a Yonko like Big Mom, believing it to be ridiculous and impossible. She also thinks very little of the Worst Generation, believing their actions in the first half of the Grand Line were not that big of an achievement. Like most of her siblings, Brûlée is arrogant and has the upmost pride in her crew and family. This is shown when she boasted to Luffy about Katakuri's strength and how he had never lost before. This leads her to underestimate her opponents, as she was shocked to learn that Brook managed to get copies of the Poneglyphs and hid them from Big Mom, and became devastated when Katakuri was defeated by Luffy."}, {"type": "paragraph", "text": "Brûlée seems to share her mother's dream of creating a paradise with every race united, and finds great joy in discovering new kinds of creatures, especially animals. However, she seems to be extremely close-minded about non-humans, as she considers minks to be mere animals and has no qualms about threatening to consume them, even disregarding their begging for mercy. She also thinks very little of her mother's husbands, as she jeeringly declared her ex-stepfather, Pound, an enemy with no chance of returning from his actions. She also cackled with glee when revealing that none of Big Mom's affiliates could leave her alive."}, {"type": "paragraph", "text": "Brûlée is very loyal to her mother, as she followed her orders to keep Luffy and his group away from Sanji. She is also loyal to her family, as she went with Katakuri's plans to ambush the Straw Hats on their ship. She detests traitors, yelling angrily at Jinbe when she discovered him with the Sanji Retrieval Team, as well as questioning Chiffon in her participation in her husband's plot to assassinate their mother. She also became enraged at Pekoms for using her to assist Luffy in escaping."}, {"type": "paragraph", "text": "Brûlée is noted by her own family to be very careless and clumsy as proven when she easily ended up getting herself captured by her enemies for them to exploit her Devil Fruit powers as shown with Chopper and Luffy."}, {"type": "paragraph", "text": "Due to her arrogance and carelessness, Brûlée is very cowardly if she is caught in a helpless situation that would endanger her life. When Brûlée was being used by the Straw Hats and Fire Tank Pirates, she became terrified if her mother considered her a traitor and that she would be killed. When Luffy found her while he was retreating from Katakuri, Brûlée became terrified as she was taken hostage to escape the Mirro-World while pleading to Katakuri to save her. On Nuts Island, after being spotted, Brûlée pleaded for Perospero and Amande, and a deranged Big Mom to save her."}, {"type": "paragraph", "text": "Brûlée is tricky and deceptive, using her Devil Fruit to separate Luffy from his group by disguising as him and deceiving the retrieval team, and managed to capture Carrot in the Mirro-World. Though she is not always perceptive, as she failed to notice the frog transformed into Carrot was not actually speaking and also did not piece together that the duplicate mink came from her own Devil Fruit ability. Brûlée also seems very susceptible to tickle torture, as she easily gave Chopper and Carrot all the answers they needed when they tickled her."}, {"type": "paragraph", "text": "Despite being usually cruel to enemies, Brûlée has a kind and caring side as she genuinely loved her family, as she was crying when the Whole Cake Chateau was falling over with her family on it. Even as a child, she tried to comfort Katakuri, telling him not to blame himself for her brutal disfigurement by his bullies. She also tearfully reported Katakuri's defeat at Luffy's hands to her family and crew in order to ensure that neither he nor Sanji manage to escape. However, she was more concerned about Katakuri being hurt by Luffy rather than his loss against the latter. Brûlée cares for his brother in high regards, that she knew that Katakuri lays on his back and kept quiet about it out of respect towards him."}, {"type": "paragraph", "text": "Like other people, Brûlée has a unique laughing style: \"Wiwwiwwiwwi\" (ウィッウィッ, \"Wiwwiwwiwwi\")."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "As her eighth daughter, Brûlée is very loyal to her mother. Because of her loyalty, Brûlée followed her mother's orders in keeping Luffy from meeting Sanji. Big Mom sent Brûlée's brother, Cracker, to assist her against both Luffy and Nami because Luffy was able to defeat Doflamingo. When the Sanji Retrieval arrived at Big Mom's chamber, Brûlée attempted to shout for her mother's aid only to be gagged immediately. Brûlée is also aware of her mother's complete ruthlessness towards her own children should they defy her as Brûlée was terrified that she would be murdered by Big Mom if she were considered an associate of the Fire Tank Pirates in their plot to assassinate her."}, {"type": "paragraph", "text": "Despite her fear of her mother, Brûlée cried out for her when she was falling with the collapsing chateau."}], "images": []}, {"title": "Siblings", "level": 4, "content": [{"type": "paragraph", "text": "Due her caring nature towards her family, Brûlée appears to be on good terms with a majority of her siblings. As brother and sister, Brûlée and Charlotte Cracker both get along very well. Even though Brûlée was annoyed that her older brother was sent to help her, they did cooperate in fighting Luffy and Nami. During the many times that she was captured by the Straw Hat Pirates, her siblings Perospero and Amande rushed to her aid when she called for help.Oven became enraged upon seeing Pekoms holding his \"beloved\" little sister Brûlée at gunpoint and immediately saved her."}, {"type": "paragraph", "text": "However, Brûlée shows to bears hostility towards any traitors to the family, such as her younger half-sister, Chiffon, due to her joining Bege to kill their own mother, Big Mom. Chiffon told Brûlée that her only family were Lola, Bege, and Pez due to the abuse she suffered at their mother's hand."}], "images": []}, {"title": "Charlotte Katakuri", "level": 4, "content": [{"type": "paragraph", "text": "After Bege's attempt to assassinate Big Mom failed, Katakuri saved her from being used any further by their enemies and grabbed her by her collar as he noted that the enemy had been using her a lot in their plans. Brûlée showed fear in his presence as she frantically explained that she was a hostage who had no choice, before she implored her brother to finish off their enemies. She holds Katakuri's strength in the highest regard, as shown when she proudly bragged about it to Luffy while the Straw Hat captain was struggling in his fight against the Sweet Commander. She refers Katakuri as the Charlotte Family's greatest creation. She also cares greatly about Katakuri as she fanatically cried when Luffy defeated him and when she tearfully reported his defeat to her family and crew."}, {"type": "paragraph", "text": "They were extremely close since childhood as Brûlée does not discriminate Katakuri for his pelican eel like mouth. Even after Katakuri's bullies took revenge by scarring her face, Brûlée did not blame Katakuri and told him he is fine just the way he is. Later, Katakuri gets his revenge by attacking the bullies for scarring his sister. Brûlée also has a habit of spying on Katakuri from the Mirro-World, thus learning all of his secrets including the fact he had laid on his back, which she kept to herself out of respect for the latter."}, {"type": "paragraph", "text": "Brûlée calls Katakuri affectionately as \"onii-chan\" (お兄ちゃん, \"onii-chan\"), compared to the more neutral \"nii-san\" (兄さん, \"nii-san\") she uses with Cracker. She also called Katakuri the absolute best brother in the world which proves the immense affection and respect Brûlée held for him."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Kingbaum", "level": 4, "content": [{"type": "paragraph", "text": "Kingbaum was loyal to Brûlée and respects her authority. However, when Nami pulled out Big Mom's Vivre Card, Kingbaum and the Homies stopped attacking Nami because they sensed Big Mom's soul."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Worst Generation", "level": 4, "content": [{"type": "paragraph", "text": "Brûlée mocked the Worst Generation when they came to Totto Land. Only four known members before Luffy came: Eustass Kid, Scratchmen Apoo, Capone Bege, and Urouge."}, {"type": "paragraph", "text": "Though Brûlée mocked the Worst Generation, she did acknowledge Urouge's achievement in defeating one of the then Four Sweet Commanders. However, Brûlée was proud to mention Urouge's defeat at the hands of Cracker."}, {"type": "paragraph", "text": "Brûlée's dislike of the Worst Generation increased when she found out that Bege was really feigning loyalty and recruited Luffy in his plot to overthrow her mother."}], "images": []}, {"title": "Sanji Retrieval Team", "level": 4, "content": [{"type": "paragraph", "text": "On her mother's orders, Brûlée served as an adversary to the Sanji Retrieval Team and an obstacle in their efforts to rescue Sanji."}, {"type": "paragraph", "text": "Due to Luffy being a part of the Worst Generation, Brûlée mocked him and the others from the same generation. Brûlée is very antagonistic towards Nami and Carrot, saying that she wants to slice them because of how pretty they are. After seeing Chopper's abilities, Brûlée took an interest in him and promised to collect him for her mother. After she trapped Carrot and Chopper in the Mirro-World, she battled Nami, who managed to outwit and defeat her. After catching Chopper and Carrot in the Mirro-World, she prepared to put Carrot in boiling soup, although this failed. Chopper and Carrot soon forced Brûlée into guiding them through the Mirro-World and helping them find their friends. She was angered when Luffy later used her powers to make copies of himself and destroyed the wedding cake that her mother was looking forward to."}, {"type": "paragraph", "text": "After being freed by her brother Katakuri, Brûlée did not hesitate to stand in the Straw Hats' way of escape, determined to settle the score with them for using her. After the Whole Cake Chateau collapsed and the Straw Hats escaped, she told her brother Katakuri to kill them for all the time they held her hostage and she made sure to hinder their escape. She took great joy in helping her family attack the Straw Hats' ship while Big Mom was chasing them."}, {"type": "paragraph", "text": "Unfortunately for Brûlée, she was yet again taken prisoner by Luffy, who used her to travel from island to island through the Mirro-World. After seeing Luffy defeat Katakuri, Brûlée was extremely furious. On Cacao Island, she reported Katakuri's defeat at Luffy's hands to her family and crew in order to ensure that he and Sanji can't escape. While complaining to her brother, she was upset that the Straw Hats managed to escape Totto Land."}], "images": []}, {"title": "Pound", "level": 4, "content": [{"type": "paragraph", "text": "Brûlée made enemies with her former step-father and labeled him as an enemy to the Charlotte Family."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Brûlée was very enraged to see Jinbe with the Sanji Retrieval Team, saying that his actions meant betrayal to Big Mom. After Brûlée told Jinbe the true purpose of the punishment roulette wheel, she bragged that his actions would result in punishment by death, but her warning was ignored. She was later angered when he twice listed her as a member of the group to overthrow Big Mom."}], "images": []}, {"title": "Pekoms", "level": 4, "content": [{"type": "paragraph", "text": "Pekoms captured Brûlée to use her to assist Luffy in escaping the Big Mom Pirates. Brûlée was infuriated at Pekoms' betrayal and bragged that he will be executed as a traitor."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Brûlée holds a high position in the crew and has authority over lower-ranking members."}, {"type": "paragraph", "text": "Brûlée is a fairly powerful fighter, as Big Mom had enough confidence in her to prevent the Sanji Retrieval Team from escaping the Seducing Woods. She is also capable of coordinating with several homies in the forest to fight against them."}, {"type": "paragraph", "text": "However, her family notes that Brûlée is actually very clumsy and not as strong as she perceives herself. True enough, Chopper and Carrot were able to defeat her by using her powers against her and was even captured by an exhausted Luffy when he needed to escape from his fight with Katakuri. She was also easily captured by Pekoms and held hostage."}, {"type": "paragraph", "text": "Brûlée possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Brûlée is rather strong, as she was easily able to lift and hold Nami by the neck with one hand. She also uses her long and sharp fingernails to slice people. Brûlée also has fast reflexes. She was able to dodge Pound's punch easily and defend against Carrot, an extremely fast Mink in her own right. She has considerable endurance, as she was able to withstand being scalded by a giant pot of soup as well as being electrocuted by Carrot's Electro and Nami's Thundercloud Rod, then regain consciousness shortly afterwards."}], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "She is skilled in tactics such as ambush, traps, and trickery as seen when she easily separated Luffy from the Sanji Retrieval Team, sneaked up on Nami by disguising herself as Luffy, and easily trapped Carrot, a capable mink fighter, with only minimal effort."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Brûlée ate the Mira Mira no Mi, a Paramecia-type Devil Fruit that allows her to create and manipulate mirrors. She can use her mirrors to reflect attacks back at her opponents, trap them inside her \"Mirro-World\", or travel by emerging from mirrors. She is also able to transform herself and animals into mirror images of different people. As a mirror image, she will do and say exactly whatever her target does and says, like a perfect reflection, and it seems she can also force the target to reflect her own actions as well. She can even reflect Devil Fruit abilities."}, {"type": "paragraph", "text": "She is referred to as \"The Only Key to the Mirro-World\" (の唯一の鍵, Miro Wārudo no Yuiitsu no Kagi). Due to her ability to allow people to freely travel into the Mirro-World. It is extremely convenient for transportation as she could deliver weapons such as special bullets to her crew fighting the Germa 66 and also allow allies such as Oven to swiftly travel to one of the ships besieging the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c3/Mira_Mira_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20170709205701", "caption": "Brûlée creates a mirror."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When she chased Chopper and Carrot inside the Mirro-World, Brûlée wielded a scythe."}], "images": []}, {"title": "Medical Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Brûlée seems to have some medical knowledge as she tended to Katakuri's wounds after his defeat at the hands of Luffy."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Brûlée was a child, some bullies that Katakuri beat up cut her face as revenge, giving her a massive scar that she would have the rest of her life. This caused Katakuri to get his revenge on them in return and he covered his mouth to protect his family ever since."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Luffy, Nami, Chopper, and Carrot ventured into the Seducing Woods in search of Sanji, Brûlée disguised herself as a mirrored version of Luffy and engaged in battle with the real Luffy. When Nami, Chopper, and Carrot turned around and tried to escape, Brûlée went with them while Luffy was forced to run in the opposite direction. The Sanji Retrieval Team kept circling back to where they were before, before Brûlée revealed herself and grabbed Nami."}, {"type": "paragraph", "text": "Nami quickly retrieved her Clima-Tact and escaped Brûlée's grasp. Carrot then attempted to attack Brûlée, only for the latter to use the power of the Mira Mira no Mi to reflect Carrot's attack back at her. When Carrot tried to attack again, Brûlée trapped her in the Mirro-World, explained to Nami and Chopper that Big Mom was well aware of their movements and had given orders to prevent them from meeting up with Sanji, and ordered the living trees in the Seducing Woods to subdue the two Straw Hats. When Chopper ate a Rumble Ball and transformed, Brûlée was fascinated with his ability, and promised to collect him for her mother. While Chopper fended off the living trees, Nami ran away to find reinforcements. In the meantime, Brûlée had also used her ability to transform multiple animals into fake versions of Nami, Chopper, Carrot, Sanji, and Charlotte Pudding, keeping Luffy distracted with a chase through the woods."}, {"type": "paragraph", "text": "Alongside the homies, Brûlée successfully managed to capture Chopper inside her Mirro-World. While riding Kingbaum, she arrived at the scene where her brother, Charlotte Cracker, was confronting Luffy and Nami. She then reverted the animals that she had transformed into people back to normal and threw her mirror (that Chopper and Carrot were trapped behind) to the ground and shattered it into pieces. When Nami and Pound were fleeing the scene, Brûlée and the homies pursued them. However, when Nami took out a Vivre Card, the homies refused to attack her because they could feel Big Mom's soul from the Vivre Card."}, {"type": "paragraph", "text": "While Cracker was fighting Luffy, Brûlée was riding Kingbaum and chasing after Nami. Brûlée revealed that the Straw Hats were not the first pirates from the Worst Generation that attempted to take down Big Mom, as Kid, Apoo, Bege, and Urouge had tried as well. They all failed but only Urouge was able to defeat one of the Sweet Commanders but he was later defeated by Cracker. Brûlée then created and tossed a mirror to the ground and emerged from it, trying to capture Nami inside it, but Pound saved Nami by trying to throw a punch at Brûlée, who declared Pound as an enemy of the Charlotte Family but got struck by Nami's Thunderbolt Tempo, causing her to fall defeated into the mirror."}, {"type": "paragraph", "text": "Brûlée later pursued Chopper and Carrot with a scythe inside the Mirro-World. Brûlée eventually caught them and, after reporting the capture to her brother Mont-d'Or, took them to her house, where she made preparations to put Carrot into boiling soup, much to the mink's immense terror. However, Brûlée had actually captured a frog that she had accidentally made into Carrot's body double, and as she ordered Randolph to cut the rope holding Carrot's double over the soup, the real Carrot knocked Randolph over by throwing a rock at him. Not knowing he was attacked, Brûlée shouted at Randolph, but Diesel alerted her to the real Carrot hanging on the rope with the fake Carrot. Carrot then kicked the pot of soup at Brûlée, dousing her in boiling soup and defeating her."}, {"type": "paragraph", "text": "Afterwards, Chopper and Carrot took her prisoner as they raced through the Mirro-World to find their friends. They tried to revive Brûlée to get her to guide them to the Whole Cake Chateau, but she remained unconscious. Eventually, Brûlée was revived by Carrot tickling her, and Carrot and Chopper wanted to know where they could reach the castle. Brûlée revealed that she had forgotten and that they could ask the mirrors, and swore revenge on the duo. Chopper and Carrot went and brought Pedro, Nami, and Jinbe into the Mirro-World, and Brûlée was shocked to see Jinbe, saying that his presence with the Sanji Retrieval Team meant betrayal. She heard that he avoided the punishment roulette wheel by taking back his request to leave Big Mom's crew, and when Pedro stated that the roulette meant certain death, she laughed and stated that he was right, affirming that no one left Big Mom's crew alive. However, she was interrupted as the Sanji Retrieval Team resumed their journey through the Mirro-World. Chopper's group later located Brook and found him inside Big Mom's bedroom, being held in her hands as she slept. Brûlée tried to alert her mother, but Chopper and his group quickly gagged her. After the group successfully rescued Brook, Brûlée was shocked to see that Brook managed to acquire copies of the three poneglyphs. Later, Jinbe talked to Luffy through a mirror shard, and twice included Brûlée and Diesel in his headcount of their team, and the horrified duo quickly corrected him."}, {"type": "paragraph", "text": "Brûlée and Diesel were then taken to the Fire Tank Pirates' base, where they were left tied up. Due to Bege's sense of immaculacy, the two were cleaned up and given a set of clean clothes. Brûlée expressed outrage when she found out her sister Chiffon was taking part in a plan to assassinate Big Mom, but Chiffon reminded her of how poorly Big Mom had treated her and how she did not consider her mother family anymore."}, {"type": "paragraph", "text": "As Bege went over his plan to kill Big Mom with Jinbe and the Sanji Retrieval Team, Brûlée objected when they planned to use her power to escape. Before the meeting adjourned, Brûlée wondered to herself with a nervous expression on how she could report to Big Mom. After the meeting, Luffy asked Bege to place a mirror inside the wedding cake. Brûlée expressed utter shock that Luffy planned to destroy the wedding cake, knowing how much Big Mom was looking forward to that. Planning to take advantage of Brûlée's power, Luffy later gathered a large number of animals so she could turn them into fake Luffys."}, {"type": "paragraph", "text": "Brûlée and Diesel later slept alongside the Straw Hats inside Bege's body as he set his assassination plan into motion. The team later went inside the Mirro-World, preparing to charge into the wedding venue. Once they heard the signal, they unleashed the Luffy duplicates into the venue and Brûlée cried in regret at not being able to defy Luffy's team. After the team and all of the clones entered the venue, Brûlée was left alone with Caesar Clown."}, {"type": "paragraph", "text": "During the ensuing conflict at the wedding venue, Caesar raced through the Mirro-World while carrying Brûlée, who continued pleading to stop being used to betray her mother. After they exited the Mirro-World and Caesar set up the escape mirror, Brûlée begged him not to allow her family to know that she was being used. Caesar then reminded her that her Devil Fruit powers were being utilized to cause the chaos at the venue. When Big Mom began screaming, Caesar flew in with Brûlée and the escape mirror, but Big Mom's scream shattered the mirror, causing them to be trapped in the wedding venue."}, {"type": "paragraph", "text": "Bege then transformed into a fortress to save the alliance members. As Luffy's group and the Vinsmoke Family ran into the fortress, Katakuri used his ability and grabbed Brûlée from Caesar's back. Katakuri remarked to Brûlée on how her captors used her in their plan, but she replied that she was the victim and told him to make their enemies pay. When Caesar and Bege nearly escaped over the wall of the venue, Brûlée blocked their way by transforming into a double of Caesar, eager to pay the alliance back for using her. The Big Mom Pirates overwhelmed Luffy, Sanji, and the Vinsmoke Family. However, the Tamatebako dropped to the base of the Whole Cake Chateau and the bomb inside the chest exploded, causing the castle to topple over. Brûlée then watched in terror as Big Mom's castle collapsed and her family fell with it. After Streusen saved the Big Mom Pirates by using his ability to turn the castle to cake, Brûlée stood with some of her siblings as they organized groups to pursue the Straw Hats, the Fire Tank Pirates, and the Vinsmoke Family. Wanting revenge on the Straw Hats, she gladly joined Katakuri when he told her to follow him in his pursuit of Luffy. However, their plan was halted when Big Mom appeared in a craze. After Perospero diverted Big Mom's attention to the Straw Hats, Brûlée listened to Pudding as she explained her plan to satiate Big Mom's craving."}, {"type": "paragraph", "text": "Brûlée later joined with Perospero, Daifuku, Broyé, and 10,000 Chess Soldiers inside the Mirro-World. She reported to Mont-d'Or that her soldiers were ready to be deployed anywhere at a moment's notice. During a confrontation between Luffy and Katakuri on the Thousand Sunny, Luffy grabbed Brûlée by the neck while she was standing inside the mirror leading to the Straw Hats' ship. She was then rendered unconscious as Luffy dragged Katakuri into the Mirro-World."}, {"type": "paragraph", "text": "Brûlée later regained consciousness and Katakuri told her to set fire to the Thousand Sunny. Mascarpone and Joscarpone arrived and showed Brûlée another mirror leading to the Sunny. Brûlée laughed with glee as Mascarpone and Joscarpone shot flame arrows through the mirror. She then prepared to lead an invasion on the Sunny."}, {"type": "paragraph", "text": "Brûlée and her siblings then received word from Perospero that Big Mom sunk the ship. Brûlée was pleased that she did not have to lead an invasion after all. However, Mascarpone and Joscarpone noticed by looking through a mirror to the Sunny that the ship did not appear to be underwater. They were then puzzled when all the mirrors to the Sunny began breaking one by one. As Luffy continued to struggle against Katakuri, Brûlée started bragging about Katakuri's legendary strength. Luffy tried to punch her, but Katakuri grabbed his fist. When Katakuri pondered on how he should maim Luffy with his trident, Brûlée told him to start with Luffy's neck. Having heard Luffy's conversation with his group and learning about their meeting place, Brûlée informed Perospero. Brûlée then contacted Pudding and informed her about the Straw Hats' rendezvous point and that Oven would be at Cacao Island to ambush them. She also encouraged Pudding to complete the wedding cake, saying that she was their last hope."}, {"type": "paragraph", "text": "Brûlée was then found by Luffy, who was retreating from his fight with Katakuri. Luffy then grabbed her and used her to escape the Mirro-World. They arrived at Nuts Island and found Big Mom rampaging there. As she was held captive by Luffy, Brûlée cried out to Amande, who was nearby. While carrying Brûlée, Luffy ran from Big Mom. With Brûlée still captive, Luffy used her to escape from Big Mom and travel from island to island through the Mirro-World. While hiding inside a building, Brûlée was tied up as Luffy wondered how to defeat Katakuri."}, {"type": "paragraph", "text": "She was later found and captured by Pekoms, who intended to honor Pedro's sacrifice by helping Luffy escape. As they approached Luffy, Brûlée was shocked and furious over Katakuri's defeat. While traveling to the mirror leading to Cacao Island, Pekoms explained his plan to help Luffy escape. Brûlée then explained to him that they have an army waiting for them on the other side. When exiting the Mirro-World, Pekoms used Brûlée as a shield as she cried for her family to save her. After Pekoms transformed into his Sulong form, Oven attacked him, causing him to release Brûlée."}, {"type": "paragraph", "text": "As Luffy and Sanji were making their escape with Germa 66's assistance, Brûlée revealed to her family and crew that Luffy defeated Katakuri, shocking them all. Brûlée later brought her allies anti-Germa bullets, which they used to harm the Vinsmokes. She then went to attend Katakuri's wounds. When Katakuri regained consciousness, Brûlée told him that the Straw Hats had escaped from Totto Land."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Luffy_Meets_His_Reflection.png/revision/latest/scale-to-width-down/210?cb=20170604020848", "caption": "Brûlée poses as Luffy's reflection."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0c/Br%C3%BBl%C3%A9e_traps_Carrot.png/revision/latest/scale-to-width-down/210?cb=20171117162455", "caption": "Brûlée captures Carrot inside a mirror."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Nami_Electrocutes_Br%C3%BBl%C3%A9e.png/revision/latest/scale-to-width-down/210?cb=20170724131011", "caption": "Brûlée is struck by Nami's Thunderbolt Tempo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d0/Carrot_Defeats_Br%C3%BBl%C3%A9e.png/revision/latest/scale-to-width-down/210?cb=20171119162951", "caption": "Brûlée being defeated by Carrot."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/94/Br%C3%BBl%C3%A9e_and_Diesel_Captured.png/revision/latest/scale-to-width-down/210?cb=20180311224915", "caption": "Brûlée and Diesel tied up in the Fire Tank Pirates' base."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/20/Caesar%27s_Mirror_Breaks.png/revision/latest/scale-to-width-down/210?cb=20180527091437", "caption": "The planned mirror escape route is broken."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Br%C3%BBl%C3%A9e_and_Her_Siblings_Attack_the_Sunny.png/revision/latest/scale-to-width-down/210?cb=20190216225622", "caption": "Brûlée helping Mascarpone and Joscarpone attack the Thousand Sunny."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Br%C3%BBl%C3%A9e_is_Held_Hostage.png/revision/latest/scale-to-width-down/210?cb=20190210033806", "caption": "Brûlée being held hostage by Pekoms."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/99/Br%C3%BBl%C3%A9e_Tends_to_Katakuri%27s_Wounds.png/revision/latest/scale-to-width-down/210?cb=20190324031808", "caption": "Brûlée tends to Katakuri's wounds."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Charlotte Brûlée (disguised as Luffy) vs. Monkey D. Luffy", "elements": []}, {"text": "Brûlée vs. Nami and Carrot", "elements": []}, {"text": "Brûlée and Homies vs. Tony Tony Chopper", "elements": []}, {"text": "Brûlée vs. Nami and Pound", "elements": []}, {"text": "Brûlée, Randolph, Diesel, Noble Croc, and Brûlée's twelve other henchmen vs. Tony Tony Chopper and Carrot", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Brûlée and Randolph vs. Tony Tony Chopper and Carrot", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is based on Crème brûlée, a dessert made of custard topped with hard caramel, which follows the food themed names of the Charlotte Family and Big Mom Pirates.", "elements": [{"text": "Crème brûlée is also known as \"burnt cream\", possibly alluding to her defeat by being burned.", "elements": []}]}, {"text": "Brûlée is the second character that was able to imitate the usage of the Gomu Gomu no Mi using its Devil Fruit, with Brûlée using the Mira Mira no Mi. The first was Gecko Moria, who used Kage Kakumei to manipulate Oars' shadow to perform the attacks.", "elements": [{"text": "In the anime, Bentham tried to fool Magellan by using Gomu Gomu no Okama Pistol, Okama Gatling, and okama Giant Scythe, though he only copied the naming pattern and not the attacks themselves.", "elements": []}]}, {"text": "Brûlée shares a fairy tale theme with the Big Mom Pirates:", "elements": [{"text": "Brûlée's general design and personality appear to be based on the Evil Queen character from the fairy tale \"Snow White\". This follows the general fairy tale theme of the Big Mom Pirates and the Charlotte Family:", "elements": [{"text": "Both characters are shown to be envious of the beauty of a younger woman (in Brûlée's case, Nami).", "elements": []}, {"text": "In the original tale, the Evil Queen is known to disguise herself several times in order to trick the titular Snow White into killing herself. Brûlée follows a similar tactic, using her Devil Fruit ability to disguise herself in order to trick enemies. ", "elements": []}, {"text": "The Evil Queen also speaks to a magic mirror, which Brûlée's Devil Fruit power may be a reference to.", "elements": [{"text": "The mirrors inside her \"Mirro-World\" also answer when being questioned, similar to the mirror from the fairy tale.", "elements": []}]}]}, {"text": "Brûlée's Devil Fruit may be a reference to Lewis Carroll's novel, Through the Looking-Glass, and What Alice Found There, where a mirror acts as a portal to an alternate, mirrored universe.", "elements": []}, {"text": "Brûlée's attempt to eat Carrot, while inside a house made of cookies, resembles the witch from the famous fairy tale \"Hänsel and Gretel\".", "elements": [{"text": "Her defeat by being doused in the soup she was going to boil Carrot in mirrors the witch's demise, who was stuffed in the oven that the witch intended to force Gretel into.", "elements": []}, {"text": "Brûlée's defeat by boiling water may also be an allusion to the Wicked Witch of the West, a witch character from the famous children's novel The Wonderful Wizard of Oz.", "elements": []}]}]}, {"text": "Brûlée's appearance in a torn wedding dress may also be in reference to Miss Havisham, a twisted female character from the Charles Dickens' novel Great Expectations.", "elements": []}, {"text": "Brûlée was ranked by her younger siblings as their third-favorite older sister, behind Smoothie and Amande.", "elements": []}, {"text": "Brûlée's favorite foods are crème brûlée and doughnuts.", "elements": []}]}], "images": []}]}