{"sections": [{"title": "Vinsmoke Judge", "level": 1, "content": [{"type": "paragraph", "text": "Vinsmoke Judge, also known as Garuda, is the king of the Germa Kingdom, the supreme commander of the Germa 66, and the patriarch of the Vinsmoke Family, being Sanji's biological father. He is also a skilled scientist, and a former research partner to the leading World Government scientist Vegapunk."}, {"type": "paragraph", "text": "Due to his actions, he is the secondary antagonist during the first half of the Whole Cake Island Arc. However, he and his children became allies of the Straw Hat Pirates and the Fire Tank Pirates after realizing Big Mom deceived and intended to assassinate them."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Judge is a large man with long golden hair which reaches his waist. He has a long and thin black mustache which spikes upwards, a thin and small beard, and a prominent cleft chin. He is yet to be seen without his golden warrior's helmet. However, his golden helmet was destroyed during his clash with Big Mom."}, {"type": "paragraph", "text": "He usually wears his Raid Suit, which is composed of a gray robe with the number \"66\" on the bottom front, a large orange cape, a belt with the number \"66\" on the buckle, dark gloves, and boots with jet propellers that allow him to levitate in the air once activated."}, {"type": "paragraph", "text": "At the Tea Party, Judge changed into a dark grey suit, comprised of a grey shirt, white tie, trousers, and a double-breasted jacket. On top of the suit, he wore an orange, single-shoulder royal cloak clasped in front of his neck."}, {"type": "paragraph", "text": "After receiving an injury from Big Mom, Judge had bandages wrapped around the top of his head and covering his right eye."}, {"type": "paragraph", "text": "Thirteen years ago, Judge wore an outfit similar to the one he wears in the present, but with different coloring."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Judge exhibits a typical royal hauteur, holding the firm belief that royalty is meant to be served, not to serve others. He disowns his third son, Sanji, after learning about Sanji's \"disgusting\" habit of cooking for others (which he equates with serving others). It has been shown that he passed these attitudes down to his children, as his other sons use the same rationale to justify bullying Sanji during their childhood, and his daughter is seemingly proud of the status and privileges of being born into royalty, but in truth actually despises her father and his beliefs. As part of this pride, Judge is preoccupied with recapturing the past glories of the Vinsmoke Family; for this reason, his lifelong ambition is to retake the entire North Blue, as his ancestors once did. Ironically, it was his desire for power and tremendous arrogance that nearly led to the deaths of himself and his family when Big Mom deceived him in forming an alliance only to betray him and nearly kill him."}, {"type": "paragraph", "text": "He has proven that he will not hesitate to use any means to accomplish his goals, including genetically modifying his children into superhumans, and going as far as to tell his wife that he was content with turning their sons into monsters, as long as they win wars. When his wife maintained her opposition, he forced her to undergo the surgery which would instill the modifications, and he was furious at his third son when he failed to exhibit any enhancements from the surgery. As Sanji prepared to leave the family, Judge gave him only one condition: that Sanji never associate himself with Judge or the Vinsmoke name again, since he considered Sanji his greatest failure and shame."}, {"type": "paragraph", "text": "Judge also loathes compassion and kindness, as he believes it makes people weak and useless; presumably for similar reasons, Judge does not seem too fond of chivalry (as seen when he called Sanji's chivalry a \"bad influence\" from Zeff). As such, he modified his sons to remove their emotions and ensure they would become strong while believing they were perfect. He expressed rage and despised Sanji heavily for showing such emotions, believing that Sora's kindness in helping the weak is worthless and greatly scorned Sanji due to his kindness. Ironically, Judge was in disbelief when he saw Ichiji, Niji, and Yonji expressing a lack of care at their imminent demise after they fell into the Big Mom Pirates' trap. Even after witnessing the flaw in their design and seeing that the very emotions that Sanji possesses had saved him and his family, Judge still considers such emotions useless and cruelly mocked Sanji in front of the Sanji Retrieval Team. When he aided the Straw Hats against Smoothie's fleet, he angrily yelled at Luffy, demanding to know why he had traveled to Totto Land to save Sanji while listing off all the things he despises about Sanji (e.g compassion and having emotions). When Luffy simply thanked Judge for aiding them, Judge was furious and continuously questioned the Straw Hat captain as the Straw Hats sailed away."}, {"type": "paragraph", "text": "As a king, Judge has exhibited significant political astuteness. He understood the full implications of Doflamingo's fall from power, including its impact on the war on Broc Coli Island. He also weighed up Germa's current privileges within the World Government against the benefits of an alliance with Big Mom, before deciding that losing the right to attend Levely was far exceeded by gaining the manpower to retake North Blue. He is naturally cautious when making major political moves, and is conscious not to make commitments without taking measures to avert potential difficulties; when dealing with Big Mom, he sought out his estranged third son specifically because any threat or danger to Sanji would not affect him, and he planned to hold Pudding hostage in the Germa Kingdom to prevent Big Mom from backstabbing him after the wedding. However, Judge still underestimated Big Mom's capacity for betrayal, as he was unaware of her plans to double-cross him before the wedding is even concluded. Even though he put up a cautious defense when dealing with pirates, he nevertheless believed that even criminals such as them would have some honor in keeping with their deals, and became horrified when this view was betrayed."}, {"type": "paragraph", "text": "Judge has also exhibited great respect for strength, and the privileges that come with its exercise. He believes that men should speak with physical force alone, and flaunts his own power and accomplishments by hanging an image of himself victorious in the Conquest of Four Nations as interior decoration inside his castle. This view also colors his attitude towards his children, as he only values them when they prove such strength; for this reason, he refused to intervene as his other sons constantly and viciously bullied Sanji when they were all children. By contrast, he doted on all his other children, whose superhuman physical strength became obvious even as children. Even after 13 years of estrangement, after which Sanji returned to the Germa Kingdom with significantly improved physical strength that surprised even him, Judge still refused to acknowledge Sanji as his son."}, {"type": "paragraph", "text": "Judge is also extremely hypocritical. While he has emotions himself, he despises Sanji for his kindness and because he did not receive the same modifications as his brothers. While he refuses to privately acknowledge Sanji as a son, he openly acknowledges him in front of guests and allies in order to make himself look like a benevolent father and expresses rage that Sanji would dare to attack his father or sacrifice his family for his crew. When he was in a situation where his life was at stake, he was quick to act extremely cowardly, begging someone to save him while crying. Judge also believes that everyone should have some form of honor, but he has no qualms in using underhanded tactics such as blackmailing Sanji into an arranged marriage or lying to others to satisfy his own selfish agenda. While he claims he isn't inhuman enough to kill his own son, he has no problem in allowing others or Sanji himself to do it for him."}, {"type": "paragraph", "text": "In addition, Judge has proven that he is capable of immense cruelty. He was not simply content with demoralizing Sanji in front of his siblings, but further punished him by putting a metal mask over his face and locking him up in a dark cell within the family's castle. He also did nothing when his brothers were brutally bullying him and coldly told the latter he was not a son worth helping. After 13 years apart, his only reason for seeking Sanji out was to use him as a political pawn to further his goals and outright stated he views him as a means to an end. He even threatened the life of Zeff (the man who took Sanji in after Sanji left the family) and placed exploding wrist-cuffs on Sanji's hands (the things Sanji values the most), to ensure Sanji cooperated with the wedding. The only time he has shown an interest in Sanji's safety was in preventing Niji from attacking him, because he still needed Sanji to seal the political alliance. His cruelty is further shown in the anime. During the Conquest of the Four Nation, Judge completely disregarded the four defeated kings' pleas for mercy by kicking them before executing them ruthlessly. Despite his cruelty, however, Judge claims that he is not inhumane enough to kill his children, regardless of his feelings toward them. Despite considering Sanji as an utterly worthless son and a disgrace to the Vinsmoke Family, Judge chose to condemn his third son to life imprisonment instead of putting him to death. When Sanji decided to leave, Judge allowed Sanji to flee the Germa Kingdom, believing that Sanji would never survive on his own on the high seas."}, {"type": "paragraph", "text": "While Judge believes that the strong has the right to oppress the weak, he hypocritically shows great fear and despair when he is subjected to the short end of such treatment. When the Charlotte Family revealed Big Mom's plan to massacre his entire family and rendered them powerless with Charlotte Perospero's binding candy, Judge became horrified and sank into despair, weeping in the face of imminent doom and lamenting that his lifelong ambition of taking back North Blue would be beyond his reach. While crying, Judge was mocked by Ichiji, a child that he ensured would be strong and have no emotion, while also seeing Niji and Yonji simply accepting death without any resistance and even laughing about it. Seeing this flaw in their engineered apathy, Judge accusingly stated something is wrong with them, being unable to see that it was his own selfish actions that removed their capacity to feel emotions."}, {"type": "paragraph", "text": "Afterwards, he would be surprised when Sanji (the son he scorned for years) goes out of his way to save him from death, despite all the pain Judge put him through. When freed by Sanji, Judge was forced to comply with his third son's order to retreat, though he expressed annoyance at having to follow the latter's commands. Judge later questioned Sanji over his rescue of them despite his hatred for them. After explaining that he did not want to disappoint his father figure, Sanji then angrily disowned Judge as the latter looked at him in silence and finally recognized the depths of the pain that he put Sanji through. Somewhat humbled by Big Mom's betrayal and acknowledging the debt he owed Sanji, Judge solemnly promised to never interfere with Sanji's life nor threaten his mentor as he offered to fight off the Big Mom Pirates to give Sanji and his friends an opening to escape."}, {"type": "paragraph", "text": "When Judge confronted Big Mom, he showed some honor as he acknowledged his dream of retaking the North Blue was overreaching as he cursed Big Mom for deceiving him. To repay his debt with Sanji, Judge chose to aid the Straw Hat Pirates at Cacao Island rather than fleeing Totto Land."}, {"type": "paragraph", "text": "In the anime, Judge appears to be somewhat arrogant, believing he would be able to defeat Luffy and his crewmates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a4/Judge_Cries.png/revision/latest/scale-to-width-down/180?cb=20180429034544", "caption": "Judge cries in despair."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Sora", "level": 4, "content": [{"type": "paragraph", "text": "Judge and his wife had conflicting ideals. Sora did not want their sons to lose their humanity, but Judge only cared about giving them the power to win wars and forced her to undergo surgery which would alter their sons' Lineage Factor. Sora did everything she could to stop Judge's wild ambitions, even if it meant risking her own life."}, {"type": "paragraph", "text": "After she passed away, Judge wished to move on from her way of doing things, as he saw no merit and nothing to be gained by continuing on the legacy of a deceased person. He forbade Sanji from emulating her example, even scorning him for following her legacy of caring for the weak. Judge effectively trampled on Sora's wishes, genetically modifying their quadruplet sons against her will and later neglecting, imprisoning, and banishing Sanji, their only son to live up to Sora's efforts."}], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Unlike his siblings, whose genetic modifications were successful in giving them superhuman strength, Sanji's strength remained that of a normal human throughout his childhood, due to Sora's intake of a counter-drug that negated the surgery effects on Sanji alone. Judge did try to encourage Sanji by sternly scolding him that he must train a thousand times harder than his siblings if he wished to become strong, but he still showed no improvement. After Sora's death, Judge blamed Sanji and saw him as a constant reminder of his late wife's personality. For this reason, Judge allowed his other sons to bully Sanji, even stating that he was not obligated to help the pleading Sanji and deeming him as a disgrace."}, {"type": "paragraph", "text": "Judge viewed Sanji to be an \"utter waste of space and air\" and the single blemish in his life. This even led the pitiless father to have Sanji locked in a dungeon for over six months. Despite his extreme scorn for Sanji, Judge allowed Sanji to be fed and admitted that he could never bring himself to dispose of Sanji himself. When Sanji escaped from his cell and announced his intentions to leave the Germa Kingdom, Judge was pleased and even allowed Sanji to go as he thought Sanji would die on his own. He allowed Sanji to leave on the condition that he never tell anyone about their relationship as he was the only thing he was most ashamed of, which left his son in tears."}, {"type": "paragraph", "text": "Judge, however, soon decided to bring him back and pursued him constantly, going so far as to both use the World Government and the Marines to locate him, and manipulating the Marines' bounty system to ensure his safe return. This was all done merely in furtherance of his ambition to re-conquer the North Blue. In order to seal an alliance with Big Mom, which would give him the forces necessary to realize this ambition, he forced Sanji to marry one of Big Mom's daughters in order to meet her terms for an alliance. During their reunion, they expressed their mutual dislike for each another, with Sanji refusing to acknowledge him as his father, and Judge telling Sanji that he never considered Sanji a true son, even after Sanji proved himself to have grown tremendously during his decade of absence. Judge finds Sanji's unroyal behavior disgraceful, claiming Sanji needed to reign in his \"twisted thinking\". Because he viewed Sanji as a means to an end, he required him to be alive in order for his plan to be a success as shown when he prevented Niji from attacking him, which marked the first time he ever defended Sanji from his brothers. As Sanji reiterated his disgust for his family, Judge quelled Sanji's rebellious behavior by threatening the life of the man whom he saw as his real father. He is also observant of Sanji's behavior since their reunion, as he noticed his third son gone pale when he revealed his knowledge of Zeff's existence, and when Luffy came towards the Vinsmoke carriage, his only reaction was looking back at his son. On the night before the wedding, Judge and his sons then shared a toast to Sanji, albeit in a patronizing way, for actually being useful to them."}, {"type": "paragraph", "text": "In keeping with his utmost respect for strength, Judge claimed that Sanji, even as a child, was worthless for not being able to defend himself from his brothers and punished him for persisting with cooking. However, he (like Reiju and Yonji) did show surprise at Sanji's drastically improved physical strength as an adult, voicing his disbelief that Sanji was able to use Haki in their fight. He also expressed surprise and anger that Sanji would dare to kick him or that he'd sacrifice his own family just to protect his crew."}, {"type": "paragraph", "text": "Despite their mutual dislike, Sanji confessed to Luffy that he did not have in him to leave his father to die at Big Mom's hand and wanted to save him. This was later showed to be an ironic comparison between Sanji's brothers, who Judge had always favored, while looking down on Sanji for retaining his sense of compassion. It was Sanji's possession of emotions that drove him to save his father and siblings compared to how Sanji's brothers, because of their lack of emotions, simply accepted the incoming demise of both their father and their own while not bothering to show any resistance. After being held at gunpoint by the Big Mom Pirates, Judge was utterly shocked when Sanji freed him and his other children. "}, {"type": "paragraph", "text": "After being freed by Sanji, Judge begrudgingly listened to his son when the latter pointed him to retreat into Bege's giant castle. After entering Bege's castle, Judge overheard Nami saying that it was Sanji's wish to save them. He then questioned Sanji on why he saved them in spite of his hatred of them, even stating that it was the perfect opportunity to be rid of them. Sanji answered by saying he did not want to disappoint his \"father\" by stooping so low as to allow his biological family to die. Sanji then angrily grabbed Judge, stating that he is not his father anymore and demanded him to never show his face around him or his crew ever again. Recognizing the pain he put Sanji through and the debt he owed him, Judge solemnly agreed to never interfere with Sanji's life nor go near the East Blue again. He then offered to distract Big Mom to give the alliance an opening to escape as he did not want to be in debt to a \"failure\" as Sanji understood Judge's resolve. However, Sanji still aided his family in fighting off the Big Mom Pirates."}, {"type": "paragraph", "text": "Judge and his forces once again came to Sanji's aid at Cacao Island. Judge shared a glare with Sanji while asking Luffy why he risked his life for Sanji's sake. Judge also still referred to Sanji as Germa's failure and stated all his \"faults\" to the retrieval team."}], "images": []}, {"title": "Reiju", "level": 4, "content": [{"type": "paragraph", "text": "Judge's daughter outwardly shows great respect and admiration for him; while Sanji denounces Judge's decision to put up glorified pictures of himself throughout the royal castle, Reiju responds that it simply shows that their father is a man of great fame and power. Judge, in turn, trusts Reiju enough to delegate important tasks to her, such as cuffing Sanji with exploding wristlets."}, {"type": "paragraph", "text": "Unbeknownst to Judge, however, Reiju secretly holds him in contempt for contributing to her mother's death, and for his cruel ways (including his treatment of Sanji). Even though Judge has modified her so that she cannot directly disobey his orders, she still circumvents him when she can, such as deciding to put fake exploding bracelets onto Sanji when trusted with the task. Her hatred of her father's cruelty extends to the point that she wishes death on him as well as herself for the things he had forced her to do, reasoning that there's no place in the world for murderers."}, {"type": "paragraph", "text": "As the Vinsmoke Family was facing imminent doom from Big Mom's treachery, Judge panicked while Ichiji, Niji, and Yonji were nonchalant as Reiju silently acknowledged that her father was the one at fault for removing their capacity to feel emotions."}, {"type": "paragraph", "text": "Despite her resentment towards him, she expressed worry for her father when he charged at Big Mom and was easily taken down."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Vinsmoke_Judge%27s_Fatherly_Side.png/revision/latest/scale-to-width-down/210?cb=20170903020309", "caption": "Judge embraces his four beloved children."}]}, {"title": "Ichiji", "level": 4, "content": [{"type": "paragraph", "text": "Judge highly values his \"beloved\" eldest son, and is happy to entrust the command of Germa 66 forces to him as the organization carries out its commissions. He approved of Ichiji (along with Niji and Yonji) bullying Sanji as a child, and refused to consider marrying him off to one of Big Mom's daughters even to seal a powerful political alliance."}, {"type": "paragraph", "text": "When Ichiji informed Sanji that he was disgracing the family with his unroyal behaviour, Judge approved of his eldest son's words, stating Ichiji's logic was \"flawless\". "}, {"type": "paragraph", "text": "Ironically, when the Big Mom Pirates were holding the Vinsmokes at gunpoint, Ichiji and his two brothers remained calm while Judge panicked. Right after Ichiji called his father's pleas to Big Mom pathetic, Judge accusingly retorted that something is wrong with the three brothers. In his desperate panic, Judge was unable to see that he was responsible for removing Ichiji's capacity to feel emotion."}], "images": []}, {"title": "Niji", "level": 4, "content": [{"type": "paragraph", "text": "As with Ichiji, Judge also values his second son and is happy to entrust Germa 66 forces to him in combat situations. He approved of Niji (along with Ichiji and Yonji) bullying Sanji as a child, and refused to consider marrying him off to one of Big Mom's daughters even to seal a powerful political alliance."}, {"type": "paragraph", "text": "Though he has great respect for his second son, Judge still stopped Niji from kicking Sanji, not willing to let Sanji get damaged before the wedding. Niji is also obedient to his father, as he halted his attack on Sanji at his father's orders despite his extreme fury towards his younger brother. However, when Niji simply laughed off the situation where the Charlotte Family had them at gunpoint, Judge accusingly retorted that something is wrong with the three brothers. Ironically, Judge was responsible for Niji's incapacity to feel emotion."}, {"type": "paragraph", "text": "In spite of this, Niji did show some concern for his father. He didn't hesitate to rush to his aid after he was struck down by Big Mom. When the Chateau collapsed, Niji and Yonji quickly rescued their unconscious father and took him far from the destruction."}], "images": []}, {"title": "Yonji", "level": 4, "content": [{"type": "paragraph", "text": "Judge seems to respect his youngest son, questioning Sanji over what he did to his younger brother and stating that Yonji's strength is formidable. He considers Yonji, along with Ichiji and Niji, as \"valuable\"; therefore, despite his desire for an alliance with Big Mom, he refused to consider marrying Yonji into her family in order to meet her terms for an alliance. However, when Yonji looked apathetically at the situation where the Charlotte Family had them at gunpoint, Judge accusingly retorted that something is wrong with the three brothers. In this panicking moment, Judge was unable to see that he was responsible for Yonji's incapacity to feel emotion."}, {"type": "paragraph", "text": "In spite of this, Yonji did show some concern for his father. He didn't hesitate to rush to his father's aid after he was struck down by Big Mom. When the Chateau collapsed, Yonji and Niji quickly rescued their unconscious father and took him far from the destruction."}], "images": []}, {"title": "Germa Kingdom", "level": 3, "content": [{"type": "paragraph", "text": "As king of his country, Judge demands the utmost respect from his people. The citizens, which are mainly made up of his soldiers and maids, are fiercely loyal and obedient to him and all highly respect Judge as their king. They follow his rule and demand in waging wars or leading the Germa 66 obediently, as Judge considers his men the backbone of the Germa Kingdom. Judge highly values his science unit, as he uses them to ensure his army is strong and fruitful in his conquest."}, {"type": "paragraph", "text": "Despite their loyalty, Judge cares very little to none for his people, as he was more concerned in reconquering the North Blue over retaining his kingdom's connection to the World Government and the privileges that came with it. Indeed, as the Big Mom Pirates held him and his family at gunpoint, Judge only lamented that his lifelong dream of conquering the North Blue would never come true rather than care that his family and his entire kingdom would be destroyed by Big Mom just to get their technology. Because of Judge's actions, his entire kingdom has lost all political connections to the World Government."}], "images": []}, {"title": "Subordinates", "level": 4, "content": [{"type": "paragraph", "text": "Judge describes the soldiers of Germa 66 as the \"true backbone of Germa's might\", and he expects their absolute loyalty. However, Judge cares nothing for his soldiers, as he ordered several of them to block Sanji's attack, and even stabbed one of them through with a spear simply to land a surprise attack on Sanji without hesitation or remorse. This also extends towards his servants, as when Niji attacked Cosette over a trivial matter, he did nothing nor showed any remorse after Niji brutally injured her. He firmly stated that his servants are meant to serve and not the other way around."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Judge originally was very apathetic towards the Straw Hat Pirates, most likely due to his arrogant royal values, but was angered when Sanji claimed he would sacrifice his own family to be with his crew. Judge later recognized the infamous Monkey D. Luffy as he rushed towards their carriage but was nonplussed when Luffy tried to get Sanji to return to the crew. During their encounter, Judge watched Sanji carefully and taking note of Sanji's reaction. When Sanji was forced to beat down his captain and Nami slapped Sanji in farewell, Judge believed with satisfaction that Sanji had severed his \"useless bonds\"."}, {"type": "paragraph", "text": "At the wedding, he was surprised to see them causing chaos and deduced that they were there to rescue Sanji, leaving him both shocked and furious at the depths they would go to save him, and in the anime stated he would attack them for their actions. After the Big Mom Pirates revealed their treachery to the Vinsmokes and prepared to assassinate them, it was thanks to Luffy's efforts that Sanji was able to free Judge and his other children from their restraints. As Big Mom screamed, Chopper placed earplugs into his ears and Nami returned the Vinsmokes' raid suit to him and his children before they join forces with the Straw Hat Pirates and the Fire Tank Pirates. When Judge assisted the Straw Hats in escaping Smoothie's fleet, he asked Luffy why he risked his life just to save Sanji. Instead of answering him, Luffy simply thanked him for his help and fled with his crew, which infuriated Judge."}], "images": []}, {"title": "Fire Tank Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After the Vinsmoke Family were deceived by Big Mom, Judge and his children briefly allied with the Fire Tank Pirates. To help Bege and his allies escape the wedding venue, Judge volunteered to confront the Big Mom Pirates in order to give them the opening they need."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "North Blue", "level": 4, "content": [{"type": "paragraph", "text": "Judge claims that the countries of North Blue are his enemies. He has spent his entire life dedicated to taking revenge against those countries in order to restore his Germa Empire. The reason he allied with the Big Mom Pirates is to gain the military forces to achieve this goal, and when they betrayed him, he tearfully lamented that he would be unable to fulfill his ambition of taking back the quadrant of the sea his ancestors once held."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Judge desired an alliance with Big Mom, as her forces, combined with his, would enable him to easily conquer North Blue. However, he does not like her as a person, calling her a \"madwoman\" and not wanting his favored children to be married into her family. In front of her, Judge would put up a front of friendly and respectful relationship, though full-heartedly agreeing with her on the marriage's primary reason is to cement the alliance. Judge planned to take Pudding hostage after the wedding in order to ensure that Big Mom won't double-cross him."}, {"type": "paragraph", "text": "However, in truth, Big Mom also dislikes Judge and his children and refers to them as the \"annoying leadership\". In fact, she never intended to form an alliance between herself and Judge in the first place, nor to marry her favorite daughter, Pudding, into the Vinsmoke Family. Rather, she planned the wedding as a set-up to kill Judge and his children in order to take their army and technology for herself without having to negotiate with Judge for their future use."}, {"type": "paragraph", "text": "Despite their dislike of each other, Judge still trusted Linlin to a certain extent, enough to believe she wanted to fulfill this pact as much as he does. Hence, he did not anticipate foul play and deposited his family's Raid Suits at the security checkpoint. Upon being restrained and held at gunpoint, Judge cried out at Big Mom over her betrayal, stating that their promise was meant to be of some importance. He pleaded to her for answers and even cried as he was mocked by Charlotte Perospero, the Tea Party guests, and by Ichiji, his own son."}, {"type": "paragraph", "text": "He later attacked Big Mom directly, cursing her in extreme anger for crushing his dreams and betraying him. However, Big Mom simply smiled at his anguish, told him to die for her own dreams, and proceeded to calmly shatter his spear before smiting him with a bolt of Zeus' lightning. She then prepared to execute him along with his family before being interrupted by the castle toppling over."}, {"type": "paragraph", "text": "Although he could have fled Totto Land, he chose to remain in Big Mom's territory to aid the Straw Hats in their escape as some sort of payback against Big Mom."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Zeff", "level": 4, "content": [{"type": "paragraph", "text": "Judge is aware of Zeff's role in raising his third son when he ran away. Judge appears to hold Zeff in disdain as he stated it was probably because of the chef's teachings that Sanji developed his \"twisted\" way of thinking. After Sanji continued to remain defiant, Judge silenced the latter by showing him a picture of Zeff, Judge warned Sanji that (through his alliance with Big Mom) he knows of Zeff's current location and if he were to continue refusing to obey his wishes, he will ensure the death of the man whom Sanji viewed as his real father. He also said to Sanji that no danger will come upon anyone he knows or cares about as long as he follows his orders accordingly. However, in his conversation with Sanji after Big Mom's betrayal, Judge promised his son that he will never interfere with his life nor threaten Zeff ever again."}], "images": []}, {"title": "Vegapunk", "level": 4, "content": [{"type": "paragraph", "text": "Judge was Vegapunk's former colleague in an attempt to develop hi-tech weaponry as part of a foreign, lawless research team. The two discovered the \"Lineage Factor\", which caused the World Government to go after them out of fear of the discovery, and the two went their separate ways, with Vegapunk being caught and is now working for the government, and Judge managing to escape and continue the research for his own goals. Their current relationship status is unknown."}], "images": []}, {"title": "Caesar Clown", "level": 4, "content": [{"type": "paragraph", "text": "Judge had a past affiliation with fellow scientist Caesar Clown. Caesar seems to dislike Judge for his overbearing attitude."}], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Despite his kingdom being affiliated with the government, Judge abused his status in the government frequently as he used his pull in the government to issue the bounty system to find Sanji and bring him back alive for his arranged wedding. Though his kingdom's controversial actions had always threatened its relationship with the government, Judge cared more about his desire to reconquer the North Blue than his political privileges and was more than willing to relinquish his rights with the government."}, {"type": "paragraph", "text": "Due to Judge's attempt to ally with the Big Mom Pirates only for them to betray him and his family, the World Government has severed all ties with Judge and the Germa Kingdom."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Judge has knowledge of Haki, as he recognized it when his son used it against him. In spite of his cowardly behavior at the thought of death, he seems to possess a strong enough will as he was able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her screams."}], "images": []}, {"title": "Political Powers", "level": 3, "content": [{"type": "paragraph", "text": "As king of the Germa Kingdom, Judge has authority over his subjects, and is a former attendee at Levely. Additionally, however, Judge seems to possess an unusual degree of power either within or over the World Government itself, as he can both influence the Marines' bounty process, and issue certain orders directly to them. However, during the events at Totto Land, he lost all the privileges from the Government itself due to his failed attempt at an alliance with Big Mom."}, {"type": "paragraph", "text": "Judge also has authority over Germa 66 as its supreme commander, giving him command of a very powerful military force. Judge once led his army in a conquest that vanquished four North Blue kings, further demonstrating his might. These positions and past actions have made Judge infamous throughout the Underworld."}], "images": []}, {"title": "Scientific Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Once renowned as a brilliant scientist, Judge worked alongside Vegapunk in an illegal weapon research and development team over 21 years ago. Together with Vegapunk, Judge was able to discover the blueprints for the creation of life itself, attributed as the \"Lineage Factor\". A highly skilled geneticist, Judge has advanced knowledge of cloning and gene manipulation techniques, being able to conduct his research of the Lineage Factor by himself even after the World Government's capture of Vegapunk."}, {"type": "paragraph", "text": "His children and the soldiers of Germa 66 are among Judge's genetic experimentation achievements. His daughter and sons were genetically modified as children to have limitless physical potential (although due to Sora's interference, Sanji's modifications were neutralized), while his soldiers are artificially manufactured and programmed to be loyal and fearless. Aside from cell biology, Judge also has exceptional knowledge of military technology developed by the Germa Kingdom. He is able to expertly use his scientifically modified weaponry such as a spear for extreme offense and boots for enhanced agility and mobility. This allows him to fight evenly with Sanji."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As the supreme commander of the infamous Germa 66, Judge has tremendous physical strength and extraordinary fighting skills, fighting evenly with his son Sanji, a powerful martial artist who has defeated powerful opponents such as Bentham, Jabra, Wadatsumi, and even Yonji, a genetically enhanced Germa commander. Despite his large physique, Judge has extremely sharp reflexes, able to keep up with Sanji's agility and defend against his fast kicks without much effort. He is capable of jumping extremely high, a feat he further enhances with jets affixed to the back of his boots, and his men in Germa 66 were awed to see his power on display. He has tremendous durability, as he was able to easily withstand Sanji's extremely powerful kicks that can shatter large boulders, steel, and even the incredibly hard body of a Pacifista, and could even grab hold one of Sanji's legs, which was enhanced by the intense heat of his improved Diable Jambe technique, without showing any signs of pain. Despite his physical prowess, Judge still reverted to using underhanded tactics to overpower his son. However, he has yet to demonstrate any of these capabilities without his raid suit. After the Big Mom Pirates revealed their treachery, Judge claimed that they would not be able to have their way with him if he had his raid suit. In spite of his skills, he was no match for Big Mom, who defeated him easily."}], "images": []}, {"title": "Equipment", "level": 3, "content": [{"type": "paragraph", "text": "Like the rest of the Vinsmoke Family, Judge has technologically advanced weapons at his disposal, such as a shape-memory and fireproofraid suit, equipped with boots able to produce a propulsive thrust making him jump upwards and emit electricity, a bulletproof cape, reinforced gloves and a spear, that he uses as his main weapon, which is capable of concentrating electricity inside it. The latter resisted Sanji's numerous kicks, but was later broken by a single punch from Big Mom."}], "images": []}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Denji Crack (電磁クラック, Denji Kurakku, literally meaning \"Electromagnetic Crack\"): Judge electrifies his left foot and kicks his opponent with it.", "elements": []}, {"text": "Blaster (ブラスター, Burasutā): Judge kicks his opponent and uses the jet at the back of his boot to accelerate his foot, increasing the power of the kick.", "elements": []}, {"text": "Denji Shaft (電磁シャフト, Denji Shafuto, literally meaning \"Electromagnetic Shaft\"): Judge concentrates electrical energy at the tip of his spear, blasting away his opponent.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Judge worked alongside Vegapunk, as part of the rogue research group that discovered the Lineage Factor. When the World Government caught wind of this research, they deemed it a threat and Vegapunk was arrested. Judge managed to escape the Government's grasp and continued the research in the Germa Kingdom."}, {"type": "paragraph", "text": "At another point in the past, Judge led Germa 66 in an event known as the Conquest of Four Nations, in which he vanquished four kings in the North Blue."}, {"type": "paragraph", "text": "Before the birth of his children, Judge married Sora, thereby crowning her queen consort of the Germa Kingdom. She later gave birth to their first child and only daughter, Reiju, before conceiving fraternal quadruplet sons. Before their sons were born, Judge argued with his wife about giving them modifications. Judge was only concerned about giving his sons power, even if it meant making them emotionless, and forced his wife to undergo surgery against her wishes. After his sons' birth, Judge was pleased when Ichiji, Niji, and Yonji displayed their enhancements but was puzzled by Sanji's \"peculiar\" behavior."}, {"type": "paragraph", "text": "When his five children were very young, Judge revealed his ambition for them to lead Germa 66 into battle and began training them. While Sanji's siblings excelled at their exercises and their bodies evolved, Sanji continually lagged behind due to his body remaining human, which greatly disappointed Judge. One day, Judge caught Sanji cooking and warned Sanji that he would need to cease his habits and train even harder if he wanted to catch up with his siblings. He then threw the food out of the palace window as he told Sanji to never make another meal again, causing Sanji to cry."}, {"type": "paragraph", "text": "Eventually, Judge determined that Sanji would never develop the enhanced abilities of his siblings, and decided to erase his existence by putting an iron mask on him and locking him in a dungeon. He then staged a state wake to \"mourn\" Sanji's passing, informing the kingdom that Sanji had died in an accident."}, {"type": "paragraph", "text": "Despite his scorn for Sanji, Judge allowed him to be fed. As his four other children made great progress with their training, Judge expressed how proud he was and gave them a hug. Eventually, he decided to wage some wars in the East Blue. After the Germa Kingdom crossed the Red Line into the East Blue, Judge ran into Sanji after he escaped his cell. Sanji declared that he wanted to leave the kingdom, something that Judge was actually pleased to hear. He allowed Sanji to go on the condition that he never tell anyone about their relationship."}, {"type": "paragraph", "text": "When he wanted to form an alliance with the Yonko, Big Mom, Judge did not want to marry off any of his precious children into her family. He then remembered about Sanji and decided to bring him back. After Sanji gained his first bounty, Judge sent Marines and bounty hunters after his son. However, due to the poor depiction of Sanji in his wanted poster, the hunters ended up going after Duval instead."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6a/Conquest_of_Four_Nations_Infobox.png/revision/latest/scale-to-width-down/160?cb=20170618021041", "caption": "Judge vanquishes four kings in the Conquest of Four Nations."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Judge_Confronts_Sanji.png/revision/latest/scale-to-width-down/210?cb=20170903020746", "caption": "Judge confronts Sanji over his son's behavior."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Judge_Lets_Sanji_Go.png/revision/latest/scale-to-width-down/210?cb=20170903023551", "caption": "Judge allows Sanji to leave their family."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Sanji's wanted poster was updated to show his true face, Judge increased his bounty by 100,000,000 and changed the condition of the bounty for Sanji from \"Dead or Alive\" to \"Only Alive\"."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Germa Kingdom began to converge at Whole Cake Island, Judge reunited with Sanji. He attempted to speak peacefully with him as Sanji refused to recognize him as his father. Judge then asked Sanji what he did to Yonji, as Yonji has formidable strength but Sanji stated he just happened to be stronger. Judge then ordered Sanji to step outside, so that they could settle matters through physical force."}, {"type": "paragraph", "text": "Judge and Sanji began fighting, with Sanji continually refusing to recognize his former family even stating he did not care what Big Mom would do to them when she hears of his refusal. Judge was very surprised at Sanji's strength and his ability to use Busoshoku Haki before offering to give him a sword only for Sanji to stick with his vow of never using his hands. Judge then used his advanced technology and spear to gradually overpower Sanji, who activated Diable Jambe and moved to attack. However, Judge had his men form a wall between the two of them, and he stabbed through his men with his spear, blowing away Sanji with electrical energy. Judge later spoke with Sanji again as he was being treated by Reiju, and he told Sanji that the Vinsmokes' alliance with Big Mom would make conquering the North Blue a guarantee. He then revealed to Sanji that he never saw him as a son and only as means to end. As Sanji was distracted by those words, Judge had Reiju put exploding wristlets on him to keep him from escaping the wedding."}, {"type": "paragraph", "text": "The next day, Judge was present to witness the arrival of his two oldest sons in the Germa Kingdom, expressing joy at their return. As the reunited family ate breakfast, Judge warned his children to be prepared, as it was likely the World Government would soon discover their alliance with Big Mom and revoke their right to attend Levely. However, Judge was indifferent to this problem as the alliance would bring Germa 66 to the brink of achieving its ambitions. During the meal, Judge watched as Sanji defended the head chef, Cosette, from Niji's attack and declared that his family stood for everything he despised. Judge responded by showing Sanji a photograph of Zeff, threatening to have him killed if Sanji did not cooperate with the wedding."}, {"type": "paragraph", "text": "He later departed the Germa Kingdom with his children and head for Big Mom's castle in his family's carriage. On the way, they encountered Luffy and Nami. Judge watched as Sanji kicked Luffy and coldly turned down his request to return with him. He then witnessed Sanji further insulting Luffy before kicking him repeatedly. After Luffy collapsed, Sanji returned to the carriage. Judge stated that Sanji severed his bonds with the Straw Hats and the Vinsmoke Family continued on to the Whole Cake Chateau."}, {"type": "paragraph", "text": "After arriving at Big Mom's castle, Judge and his family had a meal with Big Mom and Pudding. Judge concurred with Big Mom's excitement about their soon to be formed alliance. Sometime later, Big Mom showed the Vinsmoke Family (except Sanji) her collection of rare creatures, which were stored in books. Judge noted that no giants have been seen in Totto Land, even though it is supposed to be a utopia where all races can live together in harmony."}, {"type": "paragraph", "text": "Sometime after the tour, Judge, Ichiji, Niji, and Yonji had a private discussion in the Vinsmoke guest room. Judge told his sons that Pudding would be living with them on Germa Kingdom after the wedding so they could use her as leverage against Big Mom. Big Mom then sent barmaids to serve alcohol to the Vinsmokes and get them drunk, and as the night went on, the euphoric Judge decided to save the real drinking for the next night, when they would have the Big Mom Pirates on their side. Judge and his sons then had a toast to Sanji, their \"dud\", actually being useful to them."}, {"type": "paragraph", "text": "On the day of the wedding, Judge was shown getting dressed for the Tea Party. After he was finished, he was accompanied by Reiju, Ichiji, Niji, and Yonji as they made their way to the wedding venue on the rooftop."}, {"type": "paragraph", "text": "After the wedding began, the Vinsmoke Family partook in the festivities. Judge was seated at the main table, conversing with the Underworld emperor Morgans. When Sanji and Pudding arrived at the venue, Judge was seen smiling."}, {"type": "paragraph", "text": "Judge and his children soon took their seats and watched the vow exchange commenced. However, he was surprised to witness the priest getting shot down after preparing to assassinate Sanji. Judge then questioned what was causing this turn of events."}, {"type": "paragraph", "text": "After seeing the arrival of the Sanji Retrieval Team, Judge immediately assumed that the chaos was being caused by them in an attempt to retrieve Sanji and was shocked by the lengths they went to. However, Charlotte Perospero then tied the Vinsmokes down to their table and chairs with candy and members of the Charlotte Family held them at gunpoint. Judge responded with shock at the betrayal and screamed at Big Mom to explain herself and berated his sons for their indifference at their current predicament. He soon broke down in tears after explaining his plans were all dedicated to revenge on all the countries of the North Blue and rebuilding the \"Germa Empire\". After his outburst, Perospero mocked his pleas and told him to be ready for his impending death."}, {"type": "paragraph", "text": "After Katakuri told Perospero to shoot the Vinsmoke Family to death, Judge angrily remarked that if they had their raid suits, the Big Mom Pirates would not have their way with them as Perospero taunted him. Moments later, as Big Mom began to scream, Judge managed to stay conscious as his family's captors began falling all around them. To his surprise, Sanji then arrived and freed him by shattering the hardened candy around his body. Judge was then given back his raid suit and earplugs by the Straw Hats."}, {"type": "paragraph", "text": "While glaring at Sanji, Judge was pointed to retreat into Bege's fortress. After putting on their raid suits, Judge and his family then took shelter inside Bege's fortress."}, {"type": "paragraph", "text": "As Bege's fortress was suffering damage from Big Mom's attacks, Judge overheard the Straw Hats state it was Sanji's desire to save them. He then questioned Sanji on why he rescued them after the way they treated him, voicing how he could have let them die. Sanji responded by saying that his real \"father\" would be disappointed in him if he left his own blood relatives to die and refused to live a life where he could not look him in the eye. Sanji then grabbed Judge, angrily stating that the Vinsmoke Sanji that fled the Germa Kingdom died. He officially disowned Judge as his father once again, telling him to never show his face again. After this rant, Judge solemnly promised not to interfere with Sanji's life nor go near the East Blue again. The Vinsmoke Family decided to fight Big Mom in order to give the alliance an opening to escape. They then exited Bege's body and faced the Big Mom Pirates."}, {"type": "paragraph", "text": "After Luffy tried attacking Big Mom with a Gear Fourth punch, Judge charged at Big Mom while voicing his failure at obtaining the dreams of his forefathers and condemning Big Mom for lying to him about making it possible. As they clashed, Big Mom shattered Judge's spear and struck him down with Zeus's lightning, breaking off his helmet. Before Big Mom could execute Judge and his family, the Tamatebako dropped to the base of the chateau and exploded, causing the castle to collapse."}, {"type": "paragraph", "text": "As the castle fell, an unconscious Judge was carried to safety by Niji and Yonji."}, {"type": "paragraph", "text": "Hours later, a bandaged Judge and his forces arrived at Cacao Island to aid the Straw Hats. After Luffy and Sanji made it back to the Thousand Sunny, Judge helped the Sunny by engaging with Smoothie's fleet. As the Sunny passed him by, Judge asked Luffy why he risked his life for Sanji's sake. Luffy did not answer his question and instead thanked him, much to Judge's annoyance."}, {"type": "paragraph", "text": "As the battle against the Big Mom Pirates raged on, Judge was confronted by Charlotte Snack and another individual. When the Straw Hats escaped Totto Land, Germa 66 prepared to withdraw. However, before they could retreat, Big Mom arrived at Cacao Island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Sanji_Fights_Judge.png/revision/latest/scale-to-width-down/210?cb=20170625081323", "caption": "Judge battles Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3c/Big_Mom_and_Vinsmoke_Family_Meeting.png/revision/latest/scale-to-width-down/210?cb=20171015132650", "caption": "The Vinsmoke Family meets with Big Mom and Pudding."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Vinsmoke_Family_Heads_to_the_Wedding_Venue.png/revision/latest/scale-to-width-down/210?cb=20180325073417", "caption": "The Vinsmoke Family heads to the wedding venue."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3c/The_Charlotte_Family_Surrounds_the_Vinsmokes.png/revision/latest/scale-to-width-down/210?cb=20180422153158", "caption": "The Vinsmokes are held at gunpoint by the Charlotte Family."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Sanji_Saves_his_Family.png/revision/latest/scale-to-width-down/210?cb=20180506042755", "caption": "Judge and his family are freed by Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9f/Big_Mom_Defeats_Judge.png/revision/latest/scale-to-width-down/180?cb=20180617031239", "caption": "Big Mom strikes down Judge."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Germa Kingdom vs. four unnamed nations", "elements": [{"text": "Judge vs. four unnamed kings (unseen)", "elements": []}]}, {"text": "Judge vs. Sanji", "elements": []}, {"text": "Judge vs. Charlotte Linlin and Zeus", "elements": []}, {"text": "Germa 66 vs. Big Mom Pirates (Cacao Island)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Judge vs. Charlotte Tablet, Charlotte Joscarpone, and Charlotte Mascarpone (Whole Cake Chateau)", "elements": []}, {"text": "Judge vs. Charlotte Katakuri", "elements": []}, {"text": "Judge vs. Charlotte Saint-Marc, Charlotte Cornstarch, and Charlotte Basans", "elements": []}, {"text": "Judge vs. Charlotte Snack (Germa Kingdom)", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "One Piece Magazine Vol.3 revealed several early design sketches for Judge. In one of these, it was shown that his original name was Saint-Germain (サンジェルマン, Sanjeruman) and he had the epithet \"Count Karakuri\" (からくり伯爵, Karakuri Hakushaku)."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the Marine comic strip, Sora, Warrior of the Sea, there is a brief scene of Sora facing Germa 66. On Germa's side is a large man wearing a helmet (although it is a Roman-style Centurion helmet) and holding his cape out like wings. This figure may be a fictional representation of Judge, with the wing-like cape being an allusion to his epithet, Garuda.", "elements": []}, {"text": "The names of the members of the Vinsmoke Family, based off those that are currently known, appear to follow the pattern \"(number) + j + vowel\". Vinsmoke Judge's name in romaji contains the -ji (ジ, -ji) suffix used for the known male members of the family.", "elements": []}, {"text": "\"Garuda\" is a mythical bird in Hinduism and Buddhism, known as the king of birds and the first bird. The kanji used for Judge's epithet, \"Garuda\" (怪鳥, \"Garuda\") literally means \"Mysterious Bird\", and is a term with the literal kanji reading either \"Kechou\" or \"Kaichou\".", "elements": []}, {"text": "Despite disowning Sanji as his son and Sanji disowning Judge as his father, Sanji is ironically the only child with Judge's hair color and facial hair, which is because of Sanji not receiving the genetic modifications like his siblings.", "elements": []}, {"text": "In the Simulcast subs, Judge is referred to as 'Generalissimo' by his subordinates, which is the highest ranking military position possible, with command over all land, sea and air units.", "elements": []}, {"text": "Judge's favorite food is tomato pasta with lobster.", "elements": []}]}], "images": []}]}