{"sections": [{"title": "Stella", "level": 1, "content": [{"type": "paragraph", "text": "Stella was a slave and Gild Tesoro's love interest, but died after being enslaved by the World Nobles. She appears in One Piece Film: Gold."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Stella was a young woman, with long orange hair, and blue eyes. She wore a blue sleeveless dress, and was barefoot. When she was bought by a Celestial Dragon she had a bomb collar placed on her neck. Like all slaves of the Celestial Dragons, Stella had the \"Hoof of the Soaring Dragon\" burned into her skin, signifying her as sub-human."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Despite being trafficked for many years, Stella attempted to remain happy. She took notice of people who tried to help her, and was very grateful to them. She hated criminal activity."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Gild Tesoro", "level": 3, "content": [{"type": "paragraph", "text": "Stella had a romantic relationship with Gild Tesoro, and treasured him for loving her and attempting to free her despite his lack of success."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Stella was a slave because her father was defeated in gambling, and was kept in a human shop since she was 18 years old. She met and fell in love with Gild Tesoro, who worked to buy her freedom."}, {"type": "paragraph", "text": "However, Stella was bought by a World Noble three years later and was taken to Mary Geoise. She died after being abused by her master for two years, but was still happy due to remembering her time with Tesoro."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Tesoro_and_Stella.png/revision/latest/scale-to-width-down/210?cb=20170121220915", "caption": "Stella talks with Gild Tesoro."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The show at the bay area of the Gran Tesoro, which Gild Tesoro personally takes part in, is called the \"Gold Stella Show\", most likely in tribute to her.", "elements": [{"text": "His overall star motif may be a tribute to her, as her name means \"star\".", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Volume 777", "elements": []}, {"text": "↑  One Piece Movie 13, Stella appears", "elements": []}]}], "images": []}]}