{"sections": [{"title": "Charlotte Chiffon", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Chiffon is the 22nd daughter and the 52nd child of the Charlotte Family and Totto Land's former Minister of Puff (ふんわり大臣, Funwari Daijin, Viz: \"Minister of Fluff\"). She is Capone Bege's wife and the mother of Capone Pez, as well as a member of Bege's Fire Tank Pirates."}, {"type": "paragraph", "text": "Her father is Big Mom's 25th ex-husband, Pound, and her younger twin sister is Lola. Due to her resemblance to Lola, Chiffon was abused by Big Mom in her rage for Lola abandoning an arranged marriage. This led to Chiffon abandoning her ties to her blood family and helping Bege in his attempt to assassinate Big Mom, which caused Big Mom and most of Chiffon's siblings to identify her as an enemy."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chiffon heavily resembles her younger twin sister, Lola. She is a large woman with pink hair gathered in pigtails and with thick lips and blush spots on her cheeks. However, unlike Lola, she has two short pigtails rather than long, braided hair and she is also not missing a tooth. She wears a white dress with a floral design and a light blue shirt worn over it along with a pair of high-heeled boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a wife and mother, she cares deeply about her son and husband. Therefore, she prevented Gotti from harming Sanji to protect Bege from Big Mom's wrath. She has shown a very intimidating side where even members of an infamous pirate crew such as her husband's are terrified of her. She is also kind as even though she no longer feels any affection towards her mother for her cruelty, she still considers herself a horrible person for not feeling any emotion towards her mother's planned assassination. Chiffon has shown to be extremely selfless and courageous, despite potential dangers, as she willingly stayed behind in Totto Land to save the Straw Hat Pirates by going with Pudding in order to repay them for saving Lola."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Chiffon%27s_Honor.png/revision/latest/scale-to-width-down/210?cb=20170825101431", "caption": "Chiffon puts her life on the line to repay the Straw Hats, despite Bege's protests."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Charlotte Linlin is Chiffon's mother. After Lola ran away from the political marriage with Loki, Linlin tried to make use of Chiffon by having her marry the Elbaf prince in Lola's place. After that ploy failed and Big Mom developed an intense hatred towards Lola, Chiffon was cruelly abused simply because of her resemblance to Lola. Big Mom even went as far as forbidding her from showing her face and abused her to the brink of death with scars that never healed. Therefore, Chiffon no longer considers her mother as a parent but a \"monster\" and had no objections to Bege's plot to assassinate her."}, {"type": "paragraph", "text": "When Linlin was attacking Capone Bege in his Big Father form, Chiffon pleaded for her mother to spare Bege, but Big Mom was only further enraged from looking at Chiffon's face. This drove Chiffon to be tearfully heartbroken and Linlin also swore to kill Chiffon for her part in Bege's failed assassination plot. Horrendous brutal abuse coupled with this final cruel rejection of reconciliation cemented Chiffon's resolve to sever ties with Linlin and Totto Land, as she stated to Pudding that she no longer cared for either of them as she plans to leave the archipelago as Lola did."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Big_Mom_Abuses_Chiffon.png/revision/latest/scale-to-width-down/180?cb=20181111045032", "caption": "Chiffon being abused by her mother, Big Mom."}]}, {"title": "Pound", "level": 4, "content": [{"type": "paragraph", "text": "Pound is Chiffon's father. He does love Chiffon as when Charlotte Cracker threatened him, Pound begged to be allowed to see his daughter so he can congratulate her on her marriage. Chiffon, on the other hand, does not know who her father is since he was cast out shortly after her birth. Regardless, Pound quickly came to Chiffon's defense when she was threatened by Oven. After helping Chiffon escape Cacao Island, Pound was happy that he got the chance to see his daughter."}], "images": []}, {"title": "Lola", "level": 4, "content": [{"type": "paragraph", "text": "Lola is Chiffon's only full sister, and one of the few people that Chiffon considers to be true family. Both Chiffon and Lola were very close since childhood. When Chiffon heard from Nami of Lola's plight in Thriller Bark and how she was saved by the Straw Hat Pirates, Chiffon was happy to the point she shed tears. Chiffon fully supports her twin sister's decision to find her own husband. Although Lola's desertion from her arranged marriage with Loki caused their mother to abuse Chiffon cruelly, Chiffon never blamed Lola for her suffering. One of the reasons that Chiffon participated in the plot against Big Mom was because she knows Lola is in danger from their mother. She is also aware of Lola's personality and correctly guessed that her twin sister is completely ignorant of their mother's murderous rage towards her."}, {"type": "paragraph", "text": "After escaping from Big Mom, the first thing she wants to do is reunite with her sister."}], "images": []}, {"title": "Capone Bege", "level": 4, "content": [{"type": "paragraph", "text": "Chiffon married Bege to seal his alliance between the Fire Tank Pirates and the Big Mom Pirates. The two are happily married, and Chiffon cares about Bege's safety, as she prevented Gotti from harming Sanji in order to protect Bege from her mother's wrath. When Brûlée scorned Chiffon for siding with Bege against Big Mom, Chiffon stated that Lola, Bege, and Pez are her only family. Though she loves her husband dearly where she can turn a blind eye to his ruthlessness, such as feeding Pekoms to the sharks, she is not above having objections towards Bege's strategies that could endanger people she is indebted to, such as the Straw Hats for saving Lola. Chiffon thinks highly of her husband as shown when Caesar Clown threatened to kill Pez if Bege were to break his promise of setting him free, Chiffon angrily scolded him, furiously stating that Bege always keeps his promises. However, Chiffon would not always readily agree with Bege as when he suggested Monkey D. Luffy to be the decoy in his assassination plans, Chiffon angrily voiced her objections until Luffy happily agreed to the task. When Bege (while in his Big Father form) came under attack by a furious Big Mom, Chiffon worried greatly for her husband's well-being and quickly came to his defense by pleading for her mother to spare Bege, though this proved to be a useless gesture. She was very touched when Bege called her his beloved wife whom he refused to allow to die as Big Mom was attacking him. When Chiffon agreed to go with Pudding in order to save the Straw Hats from the rampaging Big Mom, Bege showed objection to Chiffon's decision, worried for her safety. After Bege and his crew escaped Whole Cake Island, Bege ordered them to head for Cacao Island so he could pick up his wife. When Oven was holding Chiffon as a hostage, Bege went to rescue her despite her protests even if his ship was being surrounded by Big Mom's fleet. Chiffon smiled at Bege's actions after he shot Oven in the face, which freed her. Upon their reunion, Chiffon and Bege happily embraced each other. Bege has shown to be a doting husband, as he is willing to comply with her wish to divert Big Mom's attention with the wedding cake to Funwari Island despite losing his ship Nostra Castello in the process. After escaping from Totto Land, Bege readily agreed with her wish to search for her twin sister Lola, even willing to travel an enormous distance from the New World to Thriller Bark."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Bege_Saves_Chiffon.png/revision/latest/scale-to-width-down/180?cb=20181104033020", "caption": "Chiffon tearfully touched by her husband's resolve to rescue her despite the danger of being cornered by the Big Mom Pirates."}]}, {"title": "Capone Pez", "level": 4, "content": [{"type": "paragraph", "text": "Pez is Chiffon's son, for whom she cares very deeply. She spoke happily about his laugh when his father made funny faces to him. She even stated to Brûlée that Bege, Pez, and Lola are the only family she needed after her half-sister questioned her betrayal to their mother. Chiffon is also highly protective of her son as shown when Caesar Clown threatened to kill Pez if Bege were to break his promise of setting him free, Chiffon angrily scolded him, furiously stating that Bege always keep his promises."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/32/Chiffon_and_Pez.png/revision/latest/scale-to-width-down/180?cb=20181111044305", "caption": "Chiffon comforting and consoling her crying son."}]}, {"title": "Charlotte Pudding", "level": 4, "content": [{"type": "paragraph", "text": "Not much is known about their relationship but it appears that Pudding holds her sister's cooking skills in respect. While on the quest to satiate Big Mom's craving for wedding cake, Chiffon mentioned on how long it was since they made a cake together, hinting that they were close in the past. Chiffon also does not discriminate Pudding for her third eye. However, Chiffon was put off by Pudding's fixation on Sanji after they managed to locate him in the Seducing Woods. Chiffon also acted as the voice of reason for Pudding whenever the latter's \"evil\" self appeared and explained Pudding's true intentions though she was exasperated by her sister's personality shifts. She also scolded Pudding when she mocked Sanji after they completed the substitute wedding cake. When Oven threatened Chiffon before they left Cacao Island, Pudding tried to defend her by attempting to dissuade Oven from harming her."}], "images": []}, {"title": "Charlotte Brûlée", "level": 4, "content": [{"type": "paragraph", "text": "Brûlée was very angered that Chiffon would participate in a plan designed to assassinate their own mother. Chiffon retorted by reminding her half-sister of the pain Big Mom put her through while stating Bege and Pez are the only family she needed."}], "images": []}, {"title": "Charlotte Oven", "level": 4, "content": [{"type": "paragraph", "text": "Because of Chiffon's involvement with Bege's plot against Big Mom, Oven is extremely hostile towards Chiffon. At first, he tried to kill his sister as punishment for her betrayal but later decided to use her as a hostage to force Bege to surrender. Oven ruthlessly slapped his sister when she tried to get Bege and his crew to retreat."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Chiffon is on friendly terms with Nami and is grateful to her and the other Straw Hats for saving her twin sister, Lola. Because of her gratitude towards the crew, she initially objected to Bege assigning Luffy to be the decoy in his assassination plan. When Bege ended his alliance with Luffy's group after escaping the Whole Cake Chateau, Chiffon was saddened to part ways with Nami, having gotten close to her. After Pudding informed Chiffon that their mother was pursuing the Straw Hats during a craving episode, Chiffon agreed to help Pudding in stopping their mother's craving, feeling obligated to help the Straw Hats in their time of need. While Oven was threatening Chiffon at Cacao Island, Sanji came to her defense, albeit in a subtle way."}, {"type": "paragraph", "text": "As the Fire Tank Pirates lured Big Mom away from the Thousand Sunny with the substitute wedding cake, Chiffon insisted that they sail to an island far away from the Straw Hats' rendezvous point in order to give them more time to escape from Big Mom."}, {"type": "paragraph", "text": "Chiffon deeply admires Sanji's skills as a chef, stating that they surpassed even the head chef of the Big Mom Pirates. Therefore, she always believed that the cake Sanji helped to make would stop Big Mom's craving rampage. After the news of their exploits in Totto Land became public, Chiffon was amused that the Straw Hats were glorified over her husband."}], "images": []}, {"title": "Fire Tank Pirates", "level": 4, "content": [{"type": "paragraph", "text": "As Bege's wife, Chiffon is deeply respected by all the members of the Fire Tank Pirates. They have a very close relationship, as Chiffon considered them to be her true family and pleaded for them to abandon her when she was captured by Oven, showing that she does not want them to be executed by the Big Mom Pirates. The Fire Tank Pirates, including Vito and Gotti, were tearfully worried for Chiffon's safety and they cheered when Bege freed Chiffon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d4/Chiffon_and_Fire_Tank_Pirates.png/revision/latest/scale-to-width-down/180?cb=20190126024550", "caption": "Scorned by her mother and most of her siblings, Chiffon considers the Fire Tank Pirates to be her true family."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Chiffon's marriage to Capone Bege has given her some authority over the Fire Tank Pirates, with she being capable of striking fear into the Fire Tank Pirates' killer Gotti."}, {"type": "paragraph", "text": "As the Minister of Puff, she had authority over Funwari Island, but she relinquished that position when she fled Totto Land after being labeled a traitor."}], "images": []}, {"title": "Culinary Expertise", "level": 3, "content": [{"type": "paragraph", "text": "According to Pudding, Chiffon is an expert in baking chiffon cakes. Pudding was confident that with Chiffon's help, she can make a replacement cake for the wedding cake that only Streusen could bake. Chiffon has a secret recipe for an extremely soft and fluffy chiffon cake. With the help of the WCI 31 chefs, she succeeded in baking a gigantic chiffon cake that was so fluffy and light, it would fly away if not held down."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "26 years ago, Chiffon was born to Pound and Charlotte Linlin alongside Lola as a set of twins, being the older sister. After Lola ran away from her arranged marriage with Loki that would have forged an alliance between Big Mom and the kingdom of Elbaf, Big Mom tried to use Chiffon as a substitute, but that plan failed. Because of her resemblance to Lola, Big Mom would cruelly beat up Chiffon time and time again."}, {"type": "paragraph", "text": "When the Fire Tank Pirates allied themselves with the Big Mom Pirates, Chiffon married Capone Bege in order to officially seal the alliance. She later gave birth to a son, Capone Pez. Bege told Chiffon about his plan to assassinate Big Mom, and she had no objections since she has no affection for her mother."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "As the Fire Tank Pirates escorted Sanji and Caesar Clown to Totto Land, Gotti ended up getting into an argument with Sanji and threatening him with force. Before tensions escalated, Chiffon arrived and berated Gotti for threatening someone so valuable to her mother's plans, informing him that if any member of Bege's crew touched Sanji, Bege would be killed."}, {"type": "paragraph", "text": "A few days later, on the northeastern coast of Whole Cake Island, Chiffon, her infant son, and the other Fire Tank Pirates watched as Bege shot the captured Pekoms into the ocean."}, {"type": "paragraph", "text": "As the Straw Hat Pirates prepared to meet with the Fire Tank Pirates at Bege's hideout on the day of Sanji and Pudding's wedding, Chiffon was in the women's bath with Nami and Carrot. After hearing about Nami's encounter with Lola and how the Straw Hats helped her at Thriller Bark, Chiffon expressed gratitude to learn that her sister was alright. Chiffon then told Nami and Carrot about how Lola ruined Big Mom's one opportunity to form an alliance with Elbaf and how cruelly Big Mom treated Chiffon afterwards. An hour later, the imprisoned Charlotte Brûlée and Diesel reacted in shock to Chiffon's participation in Bege's plot to assassinate Big Mom, but she told them that Bege and Pez were her only family. Chiffon was then in the meeting room as Bege and Luffy began their negotiations. When Bege began explaining his assassination plot, Caesar threatened to harm Pez if Bege broke his word of returning his heart and setting him free. Chiffon furiously assured Caesar that Bege would keep his promise. While Bege went over his plan, Chiffon helped explain an incident where Big Mom scraped her knee and bled after throwing a tantrum over a portrait of Mother Carmel. When Bege informed Luffy that he would be the bait to distract Big Mom's forces, Chiffon objected but was surprised when Luffy excitedly agreed. Once Bege finished explaining his plan, the meeting adjourned."}, {"type": "paragraph", "text": "After Bege's attempt to assassinate Big Mom failed, Chiffon and Pez were inside Bege's Big Father fortress. As Bege bled due to his fortress sustaining damage from Big Mom's attacks, Chiffon was greatly concerned for her husband. As Big Mom continued her onslaught, Chiffon tried begging her mother to cease her attack, but showing her face only enraged Big Mom further. When Bege swore that he would not allow his subordinates and family to die, Chiffon was touched by his words. When the Tamatebako dropped to the base of the Whole Cake Chateau, the bomb inside the chest exploded, causing the castle to topple over. As the castle collapsed, Caesar, Bege's crew, Luffy's group, and the Vinsmokes got away. Bege later met up with the Sanji Retrieval Team at the northwest part of Whole Cake Island, where he decided to part ways with them. As Bege was leaving Luffy's group behind, Chiffon commented that she had gotten close to Nami."}, {"type": "paragraph", "text": "While Bege was being pursued by Tart Tanks, Pudding (while riding on Rabiyan) caught up to him and requested to speak with Chiffon. While speaking to Pudding, Chiffon correctly assumed that Big Mom was having a craving sickness but refused to help, declaring her intention of leaving Whole Cake Island just like Lola and that she does not care about their mother nor the island. However, Pudding continued pleading with Chiffon, saying that she wanted to stop Big Mom in order to save Sanji and his friends. Feeling obligated to help the Straw Hats, Chiffon agreed to go with Pudding despite Bege's objections. Before leaving Bege, Chiffon reminded her husband of the debt she owed to the Straw Hats and asked him to take care of Pez. Chiffon and Pudding then rode on Rabiyan and flew to the Seducing Woods, where they located Sanji. As the Straw Hats continued fleeing from Big Mom, Pudding and Chiffon approached them. Pudding tried to tell Sanji about their mission to make a cake, but quickly impeded herself with mood swings as she went from being in love with Sanji to wanting to kill him and back. Chiffon took the lead as she petitioned for Sanji to help them make a cake to satiate Big Mom's eating disorder, and Sanji readily agreed to assist them. Big Mom wondered angrily why her daughters were consorting with the Straw Hats as she unleashed a devastating air slash that barely missed them. After Sanji hopped on Rabiyan, the trio then flew away from Whole Cake Island, passing over the Thousand Sunny."}, {"type": "paragraph", "text": "While traveling above the seas, Chiffon revealed to Sanji that Lola once held the position of Minister of Chocolate before she left and Pudding constantly refused the offer to take her place. The trio later approached Cacao Island."}, {"type": "paragraph", "text": "Chiffon, Pudding, and Sanji later arrived at Chocolat Town on Cacao Island, where Sanji was hidden away inside Rabiyan's folds and Chiffon acted as though she was Pudding's prisoner. Pudding enlisted the help of Whole Cake Island's 31 most renowned head chefs, and after she altered their memories at the Sweets Factory, Sanji revealed that he designed the cake while hiding. When he showed it to Chiffon, she was amazed at how he perfectly recalled the ingredients through his sense of smell. After Sanji explained his plan to prepare the cake for delivery in three hours and complete it by the time they take it to Big Mom, some of the chefs were skeptical about the plan, but Chiffon intimidated them into working. With Chiffon making the base layers, Pudding making the chocolate, and Sanji preparing a secret ingredient, the cake baking officially got underway. As Chiffon and the chefs worked on making the cake, they heard a commotion outside the factory but remained focused on their task. While Sanji was making his special ingredient, Chiffon noticed that he was grinning to himself. Chiffon then scolded him and told him to be more serious, reminding him what was at stake. Sanji replied that he was thinking of Big Mom's delighted face, much to Chiffon's annoyance. Eventually, the baking of the cake was completed and the chefs prepared to set sail."}, {"type": "paragraph", "text": "After leaving the factory, they were met by Oven, who allowed Pudding to pass but attacked Chiffon for her role in Bege's assassination attempt. Pound then charged at Oven to save his daughter, and Sanji (while in disguise) rapidly moved to kick Oven in the head just when it seemed like Pound's punch would land. After Oven was knocked back, Sanji instantly grabbed Chiffon. While hiding among Pudding's entourage, Chiffon wondered about the man with the large head. Oven caught up to them and confronted Chiffon again, right before he received a report that Bege's ship was heading for Cacao Island. While holding Chiffon hostage, Oven contacted Bege and told him to disembark and surrender. Chiffon begged Bege to escape without her, but he said that he would comply with Oven's demands. However, as Bege's ship approached, Bege shot Oven in the face with an explosive round and freed Chiffon from Oven's clutches. As the Nostra Castello moved on land, Sanji used a kick to lift the carriage carrying the chefs (including Chiffon and Pudding) and the cake onto the deck of the ship. After Chiffon reunited with her husband and child, the ship went back to the sea. As they departed Cacao Island, Chiffon wondered what Pez was so happy about. Oven tried to prevent their escape by boiling the sea, but he was thwarted by Pound. Chiffon then tried to calm Pez when he suddenly started crying as the ship sailed away from Cacao Island."}, {"type": "paragraph", "text": "On the way to the Thousand Sunny, Chiffon urged Bege to believe in the sweetness of the cake after he had an argument with Sanji where he insisted on using poison or explosives. Eventually, Chiffon and the chefs completed the cake. As the chefs celebrated their accomplishment, Pudding relapsed into her \"evil\" persona and mocked Sanji by saying that he might be too late, but Chiffon snapped her out of it by scolding her."}, {"type": "paragraph", "text": "They later approached the Thousand Sunny and gained Big Mom's attention. After Pudding and Sanji left the Nostra Castello, Big Mom began following Bege's ship. As they head for Liquor Island, Chiffon encouraged the Fire Tank Pirates to believe in the cake. As they were getting close to Liqueur Island, they planned on dropping the cake there. However, Chiffon insisted that they change course to Funwari Island to give Nami and her friends more time to escape. They managed to reach Funwari Island though their ship was destroyed in the process. After dropping the cake off, Bege carried Chiffon while fleeing. Chiffon then witnessed her mother eat the cake and was overjoyed that the cake worked."}, {"type": "paragraph", "text": "Bege's crew then stole a tarteship and they sailed away from Funwari Island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ca/Pudding_Clear_a_Path_Using_Flashback.png/revision/latest/scale-to-width-down/210?cb=20180807184241", "caption": "Chiffon, Pudding, and Sanji head for Cacao Island."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/01/The_Cake_Baking_Commences.png/revision/latest/scale-to-width-down/210?cb=20191120025240", "caption": "Sanji, Pudding, and Chiffon start to make Big Mom's new wedding cake."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Oven_Attacks_Chiffon.png/revision/latest/scale-to-width-down/210?cb=20181028025020", "caption": "Chiffon is attacked by her brother Oven."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Sanji%27s_Wedding_Cake_Completed.png/revision/latest/scale-to-width-down/210?cb=20181223034005", "caption": "Chiffon and the chefs complete the wedding cake."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "After escaping Totto Land, Chiffon received the news of Luffy's exploits and was happy for his increase in fame."}], "images": []}, {"title": "\"Gang\" Bege's Oh My Family", "level": 3, "content": [{"type": "paragraph", "text": "Chiffon declared to her family that she wanted to locate and reunite with Lola. Bege agreed to help Chiffon, saying that his wife's wish was his wish. After taking over a pirate ship, the crew planned to go to Thriller Bark. They later reached the Red Line, but they could not pass over it because of the Levely. They later went to Dressrosa to gather supplies. After disembarking, Chiffon and Bege encountered a man who was familiar with Lola. They then learned that Lola was in Dressrosa a few days before. Chiffon then went into Dressrosa with Bege."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is based on chiffon cake, which follows the food themed names of the Charlotte Family and Big Mom Pirates. It is also revealed that she specializes in making such cakes.", "elements": []}, {"text": "She shares the same voice actress as her twin sister Lola and her son Pez.", "elements": []}]}], "images": []}]}