{"sections": [{"title": "Charlotte Perospero", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Perospero is the eldest child of the Charlotte Family and an officer of the Big Mom Pirates. He also serves as Totto Land's Minister of Candy (キャンディ大臣, Kyandi Daijin), governing over Candy Island."}, {"type": "paragraph", "text": "Due to his actions and role, he is a major antagonist in the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Perospero is a very tall and slim man with brown eyes, a pointed nose, pink lips and a very long thick tongue. He is often seen smiling but on rare times such as when his mother threatened him, his smile was changed into that of a horrified expression."}, {"type": "paragraph", "text": "He wears a long, yellow coat with a tall lighter colored collar and the top buttons resembling large, purple and pink striped pieces of wrapped candy. The bottom of his coat has a checkered design and large beads along the hem."}, {"type": "paragraph", "text": "There is a dark-colored beaded bracelet on each wrist and his long sharp fingernails are painted dark. His large, orange and red striped hat has rainbow colored lollipops along its rim and a large, pale pink plume. Something large and navy blue with baby blue polka-dots comes out from under his hat and curves upward on either side. His shoes have a long tip spiraling inward. He carries large magenta and pink candy cane with a curled top which he often licks."}, {"type": "paragraph", "text": "After he was engulfed in a massive explosion caused by Pedro, Perospero lost his right arm which he replaces with a candy prosthesis via his Devil Fruit ability."}, {"type": "paragraph", "text": "Five years ago, as he was escorting Pedro out of Totto Land, Perospero wore a coat similar to his current one but of a darker color."}, {"type": "paragraph", "text": "As a child, Perospero wore a pair of orange and white striped pants, brown and white dress shoes, a much smaller hat lacking the lollipops, and a coat similar to his current one, but with a less elaborate bottom."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Perospero is extremely sadistic, taking great joy in tormenting others, such as when he threatened Caesar Clown with the prospect of being turned into candy and licked to death while also squeezing his heart for fun, as well as when he mocked a sobbing Vinsmoke Judge once the latter realized Big Mom's treachery. Perospero is not without fear, as he became terrified when his own mother threatened to kill him if she discovered that he was lying about the Straw Hats stealing a spare cake that was made for the wedding ceremony. He also became greatly shocked when Pedro was about to blow both of them up with explosions. He can also be vindictive, as after his right arm was severed by an explosion caused by Pedro, Perospero swore to make the Sanji Retrieval Team suffer for Pedro's actions. However, he also possesses quite a strong will and tenacity, as he was not dissuaded from pursuing the Straw Hats even after losing said arm."}, {"type": "paragraph", "text": "Like his mother, he has a strong fondness for sweets, demonstrated when he gluttonously licked a giant candy cane while introducing Caesar to his new laboratory. When he lost his arm, his main complaint about it was that his candy arm replacement would melt whenever he drank tea. He refers to people he is fond of as candy, calling them \"sweet\" as he referred to Nami as a sweet \"candy girl\"."}, {"type": "paragraph", "text": "Despite his cruel tendencies, Perospero has also demonstrated a strong care for the well being of Totto Land and its citizens, as he was willing to risk his own life and lie to his crazed mother to keep her from rampaging within Sweet City. He is shown to have some leniency, as he offered Brook and Chopper a chance to escape after assuming that Big Mom dealt a fatal blow to their friends. He appears to be very affectionate and kind towards children as shown when he told a group of little children to be nice with each other as he offered them lollipops and allowed them to eat the candy escalator he made with his power. He seems to care for his siblings since he angrily demanded Luffy to unhand his sister Brûlée after she pleaded with Perospero to save her."}, {"type": "paragraph", "text": "Similar to most of his siblings, he is very arrogant and prone to underestimating foes as seen when he considered it impossible for the Straw Hats to escape from Big Mom alive as he taunted Brook and Chopper about their friends presumed demise while watching them fight his soldiers. This was shown again when the rest of team arrived. He was surprised at their survival before regaining his composure and boasted that Luffy could not destroy his candy iron maiden but was surprised when he did. He was like this when the Straw Hats were presumed to have been washed away by Big Mom's tidal wave only be to be shocked and baffled when he learned of their continued survival."}, {"type": "paragraph", "text": "He is also very proud of his bounty, as he was shown boasting about it to Pedro after he subdued him. He also believes that the birth order in the family matters as he claimed that he should be captain of the Big Mom Pirates if anything happens to Big Mom."}, {"type": "paragraph", "text": "He has a tendency to use the verbal tic, \"Perorin♪\" (ペロリン♪, \"Perorin♪\"), at the beginning or end of his sentences. Like many other characters, he has a unique laugh: \"Kukukuku\" (くくくく, \"Kukukuku\")."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/02/Perospero_Taunts_Judge.png/revision/latest/scale-to-width-down/200?cb=20180430103413", "caption": "Perospero shows his sadistic side while mocking a helpless Judge."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "As her eldest son, Perospero is extremely loyal to his mother, Big Mom. In return, Big Mom trusts Perospero enough to assign him to look after Caesar Clown and even take part in her plan to assassinate the Vinsmoke Family. When Bege tried to kill Big Mom in his giant fortress, Perospero was quick to protect his mother with a wall of candy. In spite of his immense loyalty towards his mother, he is not above manipulating her during her furious tantrums, tricking her into going after the Straw Hats while she was having a craving for wedding cake. Perospero is also utterly terrified of his mother and expressed extreme fear when Big Mom threatened to punish him for lying by taking away his lifespan. When Jinbe told Big Mom that there was no cake on the Thousand Sunny, Big Mom refused to listen while telling Jinbe not to call her son a liar as she would kill him otherwise. Perospero was very frightened to hear that she still remembered her promise and wondered how conscious she was in her craving state. Despite his fear of her, he was concerned when she was losing weight and got attacked by her enemies. He was also hesitant in letting her eat a cake that was on the ship of the Fire Tank Pirates as it might have been poisoned. Therefore, he followed Big Mom as she went after them. He was relieved that the cake was not poisonous and that his mother's cravings were satisfied after she expressed joy in eating it. Perospero was also glad that he avoided death at his mother's hands."}], "images": []}, {"title": "Siblings", "level": 4, "content": [{"type": "paragraph", "text": "As the oldest sibling, Perospero appears to be on good terms with a majority of his siblings. All his siblings seems to affectionately address him as \"Brother Peros\" (ペロス兄, Perosu-nii), instead of using his full name."}, {"type": "paragraph", "text": "He appears to get along with his younger brother Katakuri, and Perospero is one of the few people who does not scorn Katakuri for his eel-like mouth during their childhood. However, due to being the first born, Perospero believes himself to be the next leader of the Big Mom Pirates should Big Mom meet her demise, while Daifuku believes that Katakuri should be since he is more capable."}, {"type": "paragraph", "text": "Being the eldest child and possessing high authority within the crew, they work well together and are respectful to one another, as shown when they engaged Brook and Chopper on the Thousand Sunny. Katakuri did not share his brother's arrogance or belief that the Straw Hats were killed as shown when he bluntly informed him it was their side that suffered casualties when the Straw Hats returned. Katakuri was concerned when Perospero was caught in Pedro's suicidal explosion. Katakuri was later relieved to hear that Perospero survived after the latter contacted him."}, {"type": "paragraph", "text": "While fearing for his life after manipulating Big Mom into going after the Straw Hats, Perospero's worries were alleviated when Pudding arrived and came up with a plan to make another cake. He expressed gratitude to his younger sister for her actions, which would save him from Big Mom's threat. When Luffy took his sister Brûlée hostage, he attempted to save her after she cried out for help. He seems to worry about her after her face was scarred during their childhood. When he heard of Pudding's delivery of the cake, he was happy to hear as he praised her actions. However, Perospero can be frustrated with his siblings when they fail to do their duties, as when Daifuku's fleet was incapacitated by Carrot, he was infuriated by his brother's failure and called him useless."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Caesar Clown", "level": 4, "content": [{"type": "paragraph", "text": "Charlotte Perospero was tasked with watching Caesar Clown during his research. Perospero had Caesar's heart and threatened to turn him into candy if he did not finish his work in two weeks. Perospero later lost Caesar when the scientist's heart was passed to Capone Bege."}], "images": []}, {"title": "Vinsmoke Family", "level": 4, "content": [{"type": "paragraph", "text": "During the wedding, Perospero personally trapped the Vinsmoke Family in place with his Devil Fruit power and gleefully prepared to massacre each of them with the other members of the Charlotte Family. He listened to Judge's tearful pleas for help but was utterly unsympathetic to the Germa King's plight, comparing his state to a cow about to be slaughtered. However, because of Luffy causing Big Mom to scream, Perospero was incapacitated and unable to kill Judge nor his children, eventually leading to Sanji freeing his family from his grasp. When they were given their suits, he tried to kill them again, only for Ichiji to attack him for his actions. He later laughed at their hopeless situation after they retreated into Bege's Big Father fortress, which was surrounded by him and his family."}], "images": []}, {"title": "Sanji Retrieval Team", "level": 4, "content": [{"type": "paragraph", "text": "Like the rest of his family, Perospero views the Sanji Retrieval Team as enemies due to their stance against Big Mom. He first encountered them in the Prisoner Library where he taunted the captive Luffy and Nami, especially when Luffy challenged Big Mom again."}, {"type": "paragraph", "text": "At the wedding ceremony, the Straw Hats caused a rampage and Perospero attempted to kill the Vinsmokes only for Luffy to prevent his actions by causing Big Mom to scream, incapacitating Perospero. This allowed Sanji to free his family from Perospero's grasp and his crew to give them back their weapons."}, {"type": "paragraph", "text": "After he regained his composure, he joined his family in forcing them to retreat into Bege's fortress. Perospero managed to prevent the Straw Hats and their allies from escaping by trapping Bege's fortress with candy before laughing at a lose-lose situation."}, {"type": "paragraph", "text": "When his mother was suffering a craving illness for wedding cake, Perospero diverted her attention to the Straw Hats by claiming that they stole an extra cake. He did this in an effort to eliminate them while buying some time for the Big Mom Pirates."}, {"type": "paragraph", "text": "He later appeared on their ship, where he mocked Chopper and Brook after he assumed that Big Mom dealt a major blow to the Straw Hats at the Seducing Woods (unaware it was Nami who attacked his mother). Perospero sarcastically offered them a chance to leave alive as their situation seemed hopeless, but the two Straw Hats refused and prepared to fight to reclaim their ship. Perospero then stood back and taunted the two Straw Hats over the possible demise of their friends as they fought off his forces before stepping in and subduing them with his candy, taking pleasure in their suffering as he prepared to turn them into candy before the other Straw Hats appear. He was very shocked to see that they survived and even more so after Luffy destroyed his candy iron maiden to get the ship. After trapping the Sunny in candy, he clashed against Pedro, who he recalled from his previous invasion. Perospero easily knocked aside and subdued the jaguar mink while taunting him that his bounty was higher. In order to take down Perospero, Pedro surprised him by attempting to sacrifice himself with a suicidal explosion to free his captive friends. Perospero survived the explosion, cursing Pedro for causing him to lose an arm and allowing the others to escape. He later aided his mother in pursuing the Straw Hats on the sea while voicing his intentions of settling the score with them and looking forward to torturing them as compensation for the loss of his arm. He was very pleased when he thought that they were destroyed by the tidal wave homie his mother created. However, he was infuriated to learn that they survived but was relieved to find out that they were heading to the same location he intended to bring Big Mom."}, {"type": "paragraph", "text": "Perospero later watched as Nami and Brook dealt a blow to his mother and was surprised at their feat. He was even more surprised to see Chopper's monster form and wondered what bizarre monsters the crew had. His hatred for the Straw Hats lead him to accompany his mother to Wano Country for revenge."}], "images": []}, {"title": "Capone Bege", "level": 4, "content": [{"type": "paragraph", "text": "Originally, he trusted Bege due to the latter being seemingly loyal to Big Mom. Perospero entrusted Caesar Clown's heart into the rook's possession only for Bege to liberate the scientist for his own goals. At the wedding ceremony, he was confused by Bege's actions as the latter revealed his true colors which foiled Perospero's attempts to kill the Vinsmoke Family."}, {"type": "paragraph", "text": "After he regained his composure, Perospero prevented Bege from attacking his mother by creating a candy wall to block Bege's cannon fire. To ensure Bege would not escape, Perospero trapped Bege's giant castle in candy and laughed at the latter's situation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer in the Big Mom Pirates, Perospero holds a high position in the crew and has authority over lower-ranking members, and as the Minister of Candy, he has authority over Candy Island in Totto Land. Vito noted Perospero as one of the \"monsters\" among the Big Mom Pirates, comparing him to his younger Sweet Commander siblings Katakuri and Smoothie. Caesar Clown, an infamous criminal with a bounty of ​​300,000,000, was terrified of Perospero when the latter threatened him. Perospero easily subdued both Brook and Chopper, who are highly skilled fighters, without any effort. His bounty of 700,000,000 is a testament of his strength."}, {"type": "paragraph", "text": "Befitting his status as the eldest son and child, he was seen to be in charge of several of his other siblings in carrying out the massacre of the Vinsmoke Family at the tea party and directing them as they chase their enemies down. Despite not being a Sweet Commander, he has high authority within the crew, as many of his siblings look to him for orders and direction, even those that technically outrank him like Smoothie."}, {"type": "paragraph", "text": "Perospero has proven to be extremely crafty. When his mother's original plan to assassinate the Vinsmoke Family went wrong due to Pudding's mistake and Luffy's interference, Perospero came up with an improvised and effective strategy on the spot by binding the Vinsmoke Family with his candy, leaving them at the mercy of his siblings as they prepared to shoot them to death, a plan that would have succeeded had it not been for Big Mom's unexpected scream that incapacitated all those at the Tea Party. When Big Mom began rampaging in Sweet City due to her craving for wedding cake, Perospero came up with a effective though dangerous lie that tricked his mother into going after the Straw Hats, temporarily sparing Sweet City from further destruction."}, {"type": "paragraph", "text": "Perospero possesses a strong will, as he was able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud screams."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Perospero possesses fast reflexes, as he managed to spot and block Pedro's attack on him despite Pedro's speed, and had enough strength to pin the mink to the ground while counterattacking."}, {"type": "paragraph", "text": "In spite of his skinny frame, he possesses extraordinary endurance, as he took a punch from Vinsmoke Ichiji, a genetically-enhanced fighter with superhuman strength who had equipped his Raid Suit, and shrugged it off nonchalantly with a simple bruise on his face. When he was engulfed in a massive point-blank explosion caused by Pedro, he survived and managed to get back on his feet, although he still suffered grievous injuries and lost his right arm. Even without any treatment, he quickly recovered enough from his injuries to aid his mother in pursuing the Thousand Sunny for several hours without tiring. However, he did become weakened after leaving his wounds untreated for hours."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Perospero ate the Pero Pero no Mi, a Paramecia-type Devil Fruit that allows him to create and manipulate candy. He is a highly talented candy craftsman, being able to, at his mother's request, construct an exact replica of Caesar's laboratory in Punk Hazard out of candy, as well as an intricate candy escalator. He can also use hardened candy to bind and immobilize his opponents, being strong enough to hold down even the genetically-enhanced children of the Vinsmoke Family and Capone Bege's giant castle form. Perospero can even go as far as turning people into candy by covering them in it and causing it to seep into their bodies, killing them minutes after he immobilizes them with no chance for them to escape in the meantime. However, his candy is weak to fire and heat."}, {"type": "paragraph", "text": "Perospero can even use his power to travel across water without it dissolving as shown when he aided his mother in following the Sunny on the seas."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/77/Pero_Pero_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20190412202445", "caption": "Perospero creating candy."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Perospero seems to be capable of using his candy cane staff in combat, as shown when he used it to block Pedro's sword strike without it taking damage."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Perospero possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Perospero was born as the first child of the Charlotte Family. During their childhood, Perospero told Katakuri that he would be able to make friends if he hid his eel-like mouth, though his younger brother shrugged off his suggestion. When Brûlée's face was cut by some bullies, Perospero was worried for his younger sister and informed Katakuri how the bullies he beat up before targeted their sister in revenge."}, {"type": "paragraph", "text": "Five years ago, Perospero escorted Pedro out of Totto Land after Big Mom had taken 50 years of his lifespan. Perospero wondered how many years Pedro had left and discussed the meaning of the name \"Nox Pirates\"."}, {"type": "paragraph", "text": "At some point, Perospero was ordered by his mother to construct a lab identical to Caesar Clown's lab on Punk Hazard. After creating the lab with candy and including all the details displayed in the blueprints his mother obtained, Perospero reinforced the building with iron to ensure no hazards or safety risks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b9/Perospero_Escorts_Pedro_out_of_Totto_Land.png/revision/latest/scale-to-width-down/210?cb=20180812030058", "caption": "Perospero escorts Pedro out of Totto Land."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Big Mom gave Caesar another chance to complete his gigantification research and revealed that they already had a lab for him to work in, Perospero came to the lab with Caesar, whose heart he had recently obtained after Sanji gave it to Vito. Squeezing Caesar's heart to make him flinch in pain, Perospero threatened to turn him into candy and lick him if he did not complete his research in two weeks."}, {"type": "paragraph", "text": "After Monkey D. Luffy and Nami were captured by Big Mom's army, Perospero went to the Prisoner Library to watch the captive Straw Hat Pirates on display inside a book before Big Mom talked to them from a Den Den Mushi. After Big Mom finished her conversation with the prisoners, Perospero laughed at how Luffy had challenged her. Anglais then arrived to inform Perospero and his siblings that an intruder had broken into the Room of Treasure."}, {"type": "paragraph", "text": "On the day of the wedding, Perospero welcomed the Underworld Emperors as they arrived. He conjured a candy escalator to carry them to the wedding venue quickly, and also handed out lollipops to nearby children. Perospero partook in the festivities and celebrated when Sanji and Charlotte Pudding made their entrance. After Luffy began causing chaos at the wedding venue, Perospero witnessed Jinbe officially resigning from the Big Mom Pirates."}, {"type": "paragraph", "text": "Moments later, despite Brook destroying the picture of Mother Carmel, Perospero proceeded with the plan and restrained the Vinsmokes to their seats with candy. He then began mocking Judge as the latter cried in anguish at Big Mom's betrayal, but soon became distracted by a call from Capone Bege. As he went after Luffy, Charlotte Katakuri told Perospero to shoot the Vinsmoke Family to death. Perospero agreed and wondered what Judge meant when he mentioned the Vinsmokes' Raid Suits. Moments later, Luffy caused Big Mom to start screaming, which incapacitated Perospero and his siblings before they could kill the Vinsmokes. Sanji took this chance to free his family from the candy, and the Straw Hats gave them earplugs and their Raid Suits."}, {"type": "paragraph", "text": "Perospero and his siblings were later given mochi earplugs by their brother Katakuri to block the sound of Big Mom's scream, and got back on their feet. They tried once more to kill the Vinsmokes, but they put on their Raid Suits. Perospero marveled at their suits and recalled their famed technology. He then attempted to subdue them with his candy, but was punched in the face by Ichiji. He did not stay down for long, however, as when Bege tried to fire his cannons at Big Mom, Perospero protected his mother with a wall of candy, remarking on the sting of Bege's betrayal, telling him to prepare for death. He then prevented Bege from moving the castle by trapping his legs in candy. Perospero was then shown with his siblings, awaiting the alliance's next move, noting that it would be certain death if they stepped out due to being surrounded."}, {"type": "paragraph", "text": "As Big Mom assaulted the fortress, the Big Mom Pirates stood by and prepared to attack anyone who leaved the fortress. Right after Bege transformed back into human form and the Vinsmoke Family jumped out, the Big Mom Pirates fired a volley of bullets at them, but Ichiji and Niji blocked them. As Caesar tried to fly away with Bege, Perospero created a wall of candy to block their way, but it was destroyed by a combined attack from Ichiji, Niji, and Yonji. Despite this setback, the Big Mom Pirates overwhelmed Luffy, Sanji, and the Vinsmoke Family. However, the Tamatebako dropped to the base of the Whole Cake Chateau and the bomb inside the chest exploded, causing the castle to topple over."}, {"type": "paragraph", "text": "As the castle collapsed, the Big Mom Pirates fell with it. However, they were saved when Streusen used his ability to turn the falling castle into soft cake. Perospero was later alerted by Smoothie that Big Mom was suffering a craving illness for cake and was further alarmed when he heard that Streusen was severely injured from the fall. Perospero managed to buy time for the Big Mom Pirates by telling his mother that the Straw Hats had a spare wedding cake. However, before leaving to go after the Straw Hats, Big Mom threatened to kill Perospero if he lied, leaving him terrified. After Big Mom left, Perospero lamented on how another cake could not be made within a short amount of time but was relieved when Pudding came up with a plan. Perospero joined Brûlée, Daifuku, Broyé, and 10,000 Chess Soldiers inside the Mirro-World, awaiting further instructions."}, {"type": "paragraph", "text": "Perospero later joined his brother Katakuri on the Thousand Sunny. When he saw a huge explosion at the Seducing Woods, he assumed that Big Mom dealt a fatal blow to the fleeing Straw Hats. Afterwards, he spotted Brook and Tony Tony Chopper as they returned to the Sunny with the Shark Submerge III, Perospero taunted the duo about the possible death of their friends. He did offer them a chance to escape, but the two Straw Hats refused, intent on reclaiming their ship. After Brook and Chopper defeated numerous Chess Soldiers on the Sunny's deck, Perospero simply reminded them of his belief that none of their friends were coming back."}, {"type": "paragraph", "text": "Perospero eventually took direct action against the two Straw Hats, covering them with candy and intending to kill them by turning them into candy. Katakuri then told Perospero that they would soon have company, and Perospero thought it would just be Big Mom, but was shocked as he saw the Straw Hats emerge while still being chased by her. He sent a candy iron maiden that was covered in spikes at the Straw Hats, but Luffy destroyed it with a fiery punch. While Katakuri fought Luffy, Perospero escaped to the coast and ordered Charlotte Mont-d'Or through a Den Den Mushi to surround the coast with battleships. He trapped the Sunny in candy before the Straw Hats could fly away on the ship with Coup de Burst. Perospero was then attacked by Pedro, but he was able to block the mink's strike and pin him to the ground. However, he was surprised as Pedro lit some bombs in his jacket, engulfing Perospero in a suicidal blast."}, {"type": "paragraph", "text": "Perospero survived the explosion, but was grievously injured and lost his right arm. He got back on his feet but could not stop the Thousand Sunny from escaping the coast with Coup De Burst. After the group escaped, Perospero used his powers to create an arm made out of candy and sat atop of Napoleon, aiding his mother in pursuing the Straw Hats on the seas by creating a candy slug to allow her to walk on the sea. As they pursued the Thousand Sunny, Perospero was gleeful in seeking revenge on the Straw Hats for the loss of his arm. During the pursuit, Perospero contacted Katakuri through a Den Den Mushi and informed him that he was pursuing the Thousand Sunny alongside their mother. When Big Mom created a massive wave homie to attack the Sunny, Perospero tried to warn her that she would also sink the wedding cake that he claimed they had. However, he was pleased when he thought that the ship was destroyed and reported it to Katakuri."}, {"type": "paragraph", "text": "Later on, he was informed by Brûlée of the Straw Hats' survival, making Perospero both shocked and baffled. After Brûlée also told him of the Straw Hats' meeting place, Perospero told Big Mom to go to Cacao Island. When she turned her attention to Nuts Island, Perospero urged her not to go to that island. However, Big Mom did not listen and started tearing apart the island, with Perospero continuing to dissuade her. In the midst of the chaos, Perospero spotted Luffy, who had just exited the Mirro-World with Brûlée. He then directed Big Mom's attention towards the Straw Hat captain and they chased after him until he escaped back into the Mirro-World. Sometime after leaving Nuts Island, Perospero and his mother found the Thousand Sunny and resumed pursuing the ship."}, {"type": "paragraph", "text": "As they were about to surround the Thousand Sunny with the assistance of Daifuku and Smoothie's fleets, Perospero contacted Daifuku and gave him permission to sink the Straw Hats' ship. Perospero also noticed that Big Mom lost some weight. While Carrot attacked Daifuku's fleet in her Sulong form, Perospero grew concerned as Big Mom's body seemed to become thinner and thinner. Bavarois then informed Perospero that Pudding was heading to them with the cake, but she was on Bege's ship, which caused Perospero to worry about the cake being sabotaged. He remained on the candy sea slug when Big Mom summoned Zeus and Prometheus back to her and flew to the Thousand Sunny to attack the Straw Hats herself. After Big Mom landed on the Sunny, Perospero stated that he had not seen her so skinny in years. When Jinbe told Big Mom that there was no wedding cake on the ship, she pointed out that she would have to kill Perospero for lying, and Perospero was shocked that Big Mom remembered. He was also astonished to see Jinbe briefly defending against a strike from Big Mom's sword and later sending the Yonko off the Sunny with Fish-Man Karate. He was further surprised when Zeus discharged and struck Big Mom with lightning. While continuing to follow the Thousand Sunny, Perospero was amazed to see Chopper defend the Sunny against Big Mom's onslaught."}, {"type": "paragraph", "text": "As the Nostra Castello approached the Thousand Sunny, Perospero saw the cake on Bege's ship, but he feared the possibility of the cake being poisoned. With Big Mom's attention turned to the Fire Tank Pirates, Bege contacted Perospero via Den Den Mushi and informed him that he would feed the cake to Big Mom. Still suspicious of Bege, Perospero decided to follow him and Big Mom alongside Bavarois and assigned Smoothie's group to continue pursuing the Straw Hats. As he followed Big Mom to Funwari Island, Perospero grew weaker due to leaving his wounds untreated for hours. While a doctor tended to his injuries, Perospero contacted Mont-d'Or and informed him that Big Mom was preparing to eat the cake, which would decide the fate of Totto Land. He then watched his mother eat the cake and was surprised that she actually enjoyed it. He announced to all islands in Totto Land that Big Mom's craving has ceased."}, {"type": "paragraph", "text": "As Big Mom laid on the ground in bliss, Perospero approached her to inform her of the current situation with the Straw Hats. He later accompanied her as she rushed to Cacao Island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9a/Perospero_restrains_Vinsmokes.png/revision/latest/scale-to-width-down/210?cb=20180506042521", "caption": "Perospero restrains the Vinsmoke Family."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Linlin_Scares_Perospero.png/revision/latest/scale-to-width-down/210?cb=20180708021154", "caption": "Perospero receiving a death threat by Big Mom."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Perospero_Subdues_Pedro.png/revision/latest/scale-to-width-down/210?cb=20180820043501", "caption": "Perospero subdues Pedro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Perospero_Survives_Explosion.png/revision/latest/scale-to-width-down/210?cb=20180819070129", "caption": "Perospero survives Pedro's explosion."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4b/Perospero%27s_Wounds_are_Treated.png/revision/latest/scale-to-width-down/210?cb=20190224025708", "caption": "Perospero weakens from his wounds as he anticipates Big Mom's fate."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Big Mom tried to infiltrate Wano Country, Perospero accompanied his mother and crew as they attempted to climb the waterfall into the country on the Queen Mama Chanter. When Kaido's forces attacked their ship to prevent them from reaching Wano, Perospero used his Devil Fruit powers to create a candy barrier to deflect the enemy's cannonfire. As the carp climbed the waterfall to enter the country, Perospero commented on how it was a fascinating sight to see them swimming upwards. However, just before they reached the top of the waterfall, King attacked the ship, causing it to fall off the waterfall and Big Mom to fall into the sea."}, {"type": "paragraph", "text": "On the seas near Wano, Perospero noted that Big Mom's Vivre Card was still intact, meaning that she was still alive. When Mont-d'Or and Galette brought up the possibility that Big Mom might be captured and killed by Kaido, Perospero argued with Daifuku over who would have the right to take control of the Big Mom Pirates in that event, claiming that his seniority as the eldest child meant that he should become the next captain."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Perospero's appearance is altered, mostly due to the fact that his manga color scheme was revealed after his first anime appearance."}, {"type": "paragraph", "text": "In his initial appearance in the anime, his lips are dark blue, his coat's collar is the same shade of yellow as the rest of it, and the striped buttons are indigo and white. The coat's bottom checkered design is also indigo and white, and the beads are pale yellow. His bracelets are magenta, and his fingernails are dark purple. His striped hat is also indigo and white and the lollipops are magenta. The thing under his hat is purple with magenta polka-dots."}, {"type": "paragraph", "text": "Afterward, starting with Episode 812 and during the opening \"Hope\", his appearance more closely resembles his manga color scheme, except he still has dark blue lips. His coat collar is still the same shade as the rest of his coat, his button candy are red and white, his shoes are brown, and all the lollipops on his hat are green."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Charlotte Perospero vs. Vinsmoke Ichiji", "elements": []}, {"text": "Perospero, Charlotte Linlin, and Charlotte Katakuri vs. Capone Bege", "elements": []}, {"text": "Perospero vs. Brook and Tony Tony Chopper (Thousand Sunny)", "elements": []}, {"text": "Perospero vs. Pedro", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Perospero shares his mother's crew's fairy tale and fantasy fiction theme:", "elements": [{"text": "His name is possibly a pun on \"pero pero\", the Japanese sound effect for licking, and Prospero, a powerful sorcerer from William Shakespeare's play The Tempest.", "elements": []}, {"text": "He is similar to candymaker Willy Wonka from the Roald Dahl novel Charlie and the Chocolate Factory, with his large top hat, coat, and cane. Additionally, they can both make unique candies, and are involved with giant production facilities associated with sweets.", "elements": []}]}, {"text": "Perospero's favorite foods are beef tongue and candy with the exception of peppermint candy, which is his least favorite food.", "elements": []}, {"text": "Perospero was ranked by his younger siblings as their third-favorite older brother, behind Katakuri and Oven.", "elements": []}]}], "images": []}]}