{"sections": [{"title": "Capone Pez", "level": 1, "content": [{"type": "paragraph", "text": "Capone \"Gang\" Pez is the infant son of Capone Bege and Charlotte Chiffon, as well as the grandson of Charlotte Linlin and Pound."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pez is a small, chubby baby with long pink hair. Despite being a baby, he has 5 o'clock stubble much like his father and has a cigar-shaped pacifier in his mouth. He wears a blue onesie, with a white collar, and a black fedora hat resembling his father's."}, {"type": "paragraph", "text": "In his anime debut, he had black hair, wore a black onesie with a green collar, and lacked stubble. However, his color scheme was changed to match the manga's starting with the opening Hope."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like many babies, Pez laughs at his father's silly faces. Pez is easily frightened by violence and loud noises. Pez is somehow able to identify his family members even if he has never met them before, showing happiness when reunited with them and crying when they are threatened."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Capone Bege", "level": 4, "content": [{"type": "paragraph", "text": "Bege is Pez's father and he loves his son very much, being willing to make silly faces to make him laugh. He hopes for Pez to grow into a great leader like himself and hold up their family name. Bege is also very open in showing his love for his son as when Pez woke up crying during Bege's explanation of his assassination plans for Big Mom, Bege apologized to his son in a very silly and affectionate manner in front of the Straw Hats, to the point of even playfully mispronouncing his speech. Due to his fatherly love for Pez, Bege was silently angered and irritated when Caesar Clown threatened to kill Pez if Bege goes back on his promise in setting the scientist free after assassinating Big Mom. While facing the threat of the Big Mom Pirates after his assassination attempt on Big Mom failed, Bege showed his resolve to protect his family, including his son."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Bege_Saves_Chiffon.png/revision/latest/scale-to-width-down/180?cb=20181104033020", "caption": "Pez happily cheered as his father heroically saved Chiffon from Oven."}]}, {"title": "Charlotte Chiffon", "level": 4, "content": [{"type": "paragraph", "text": "Chiffon is Pez's mother and she cares very deeply for him. She spoke happily about his laugh when his father made funny faces to him. She even stated to Brûlée that Bege, Pez, and Lola are the only family she needed after her half-sister questioned her betrayal to their mother. Chiffon is also highly protective of her son as shown when Caesar Clown threatened to kill Pez if Bege were to break his promise of setting him free, Chiffon angrily scolded him, furiously stating that Bege always keep his promises."}], "images": []}, {"title": "Pound", "level": 4, "content": [{"type": "paragraph", "text": "Pound is Pez's maternal grandfather. Although the first time Pez met Pound was a mere glimpse at a distance when the Fire Tank Pirates were escaping from Oven's pursuit, the two quickly formed a bond, as Pez smiled and cheerfully waved back at his grandfather. Pound was happy to see his grandson being cared for lovingly by both of his parents, which Pound himself never got a chance to do for his daughters, and only regretted that he did not know his grandson's name. Pound saved Pez's parents from being captured by Oven and waved at his grandson. When Pez's uncle Oven assaulted Pound with a flaming blade, Pez cried."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Pez was born to Capone Bege and Charlotte Chiffon some time after they married."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Pez accompanied his parents and his father's crew to the northeastern coast of Whole Cake Island, where Bege prepared to execute Pekoms. When Pez started crying, Bege entertained his son with a silly face and made him giggle, and Chiffon found it to be cute. As Bege shot Pekoms, Pez started crying again."}, {"type": "paragraph", "text": "Three days later, Pez was asleep and held by Chiffon as the Fire Tank Pirates prepared to meet with the Straw Hat Pirates. As Bege went over his assassination plot with the Straw Hats, Pez woke up and cried, but was lulled back to sleep by his father."}, {"type": "paragraph", "text": "After Bege's assassination attempt on Big Mom failed, Pez was carried by Chiffon inside Bege's Big Father fortress. He cried as Bege's fortress came under attack by Big Mom. However, Bege and the alliance managed to escape, and the Fire Tank Pirates parted ways with Luffy and his group. Pez's maternal aunt, Charlotte Pudding, caught up with them and asked Chiffon to help stop their mother's craving-induced rampage and save the Straw Hats by making a replacement for the ruined wedding cake. Chiffon agreed and left Pez in the care of his father and the crew, telling Bege to take care of Pez if anything should happen to her."}, {"type": "paragraph", "text": "The Fire Tank Pirates later escaped Whole Cake Island and arrived at Cacao Island. When Bege rescued Chiffon from the clutches of Oven, Pez cheered. As Bege piloted the Nostra Castello onto Cacao Island, revealing it could travel across land with tank treads, Sanji kicked the carriage holding Chiffon's group and the wedding cake and launched it to the deck of Bege's ship. Pez reunited with his mother and was happy to see his grandfather as the ship departed Cacao Island. Pez later started crying when Pound was attacked from behind by Oven."}, {"type": "paragraph", "text": "After night fell, the chefs finally completed the substitute wedding cake and Pez cheered for their success. After the Fire Tank Pirates lured Big Mom to Funwari Island and dropped the cake off there, Pez and his parents escaped on a tarteship."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Pez was shown to be happy."}], "images": []}, {"title": "\"Gang\" Bege's Oh My Family", "level": 4, "content": [{"type": "paragraph", "text": "Bege held Pez in his arms as Chiffon declared to her family that she wanted to locate and reunite with Lola. Pez's family then began the quest to find Lola. They later went to Dressrosa. The family then learned that Lola was in Dressrosa a few days before. The family then went into Dressrosa."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Like his father, his surname comes from the famous mobster Al Capone.", "elements": []}, {"text": "His given name is a Spanish word for \"fish\". It may also be a reference to the Pez candy brand. Both follow the Charlotte Family tradition of food based names.", "elements": []}]}], "images": []}]}