{"sections": [{"title": "Charlotte Cracker", "level": 1, "content": [{"type": "paragraph", "text": "\"Thousand Arms\" Charlotte Cracker is the tenth son and 15th child of the Charlotte Family and the oldest triplet brother of Custard and Angel. He is also one of the Three Sweet Commanders of the Big Mom Pirates and serves as Totto Land's Minister of Biscuit (ビスケット大臣, Bisuketto Daijin), governing Biscuits Island."}, {"type": "paragraph", "text": "Due to his actions and role, he is a major antagonist in the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cracker is a very tall and muscular man, standing slightly taller than Doflamingo. He has light and mostly short purple hair, with a long, baguette-like bun tied at the back of his head and a pair of thin, pointed strands on either side that appear to spark like firecrackers. A very large scar covers his right eye and he has small wrinkles around both eyes. Cracker is shirtless and wears a kilt with decorative biscuits adorning it as well as shin length brown boots on his lower half. On his right shoulder, he wears a large brightly colored pauldron that has a pink polka dot cape attached to it."}, {"type": "paragraph", "text": "Cracker usually operates within a suit of biscuit armor, created by his Devil Fruit, and will only show himself if the armor is damaged or destroyed. This is to such an extent that his wanted poster mistakenly features the face of his armor, rather than his true appearance. This armor takes the form of a large, brutish-looking warrior (standing about four times bigger than Luffy) with a prominent nose, a large pointed beard, disproportionately thin limbs, and a prominent scar on the right side of its face (which it shares with the real Cracker). It is also fitted with a vest made of crackers, a Spartan-style warrior's helmet, and horns worn on the side of its head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Cracker is very loyal to his family and crew, demonstrated by his anger upon discovering that his former stepfather was revealing their secrets to Monkey D. Luffy and Nami. He firmly believes that one's heritage defines their character, incorrectly assuming that Sanji would happily consent to his arranged wedding out of loyalty to his family and that he would detest the Straw Hat Pirates for coming to Whole Cake Island to rescue him, oblivious to the fact that Sanji opposed the wedding and would never willingly speak ill of his friends. Like Big Mom and most of his siblings like his older brother Oven, he considers his own father and stepfathers to not be part of his family because they are not related by blood."}, {"type": "paragraph", "text": "Cracker is very confident in his power and prefers to deal with enemies alone, hating outside interference from his fellow crew members. He takes joy in using his Devil Fruit powers and overwhelming his enemies with their versatility; on the other hand, he hates it when people eat his biscuit creations as he does not like giving away biscuits for free. Cracker also absolutely despises feeling any amount of pain, even the prick of a needle, and prefers to fight others with his biscuit creations. He is also very proud of his anonymity, referring to the World Government's incorrect photo of him in his wanted poster."}, {"type": "paragraph", "text": "Like the rest of his family, Cracker is very arrogant and views himself superior to his opponents, mocking Luffy throughout most of the fight. He also tends to brag during his fights due to how powerful his Biscuit Soldiers can be. He decided to tell Luffy how his powers worked after the latter was able to discover his true appearance as a mocking gesture. This later proved to be a costly mistake on his part, as Luffy and Nami were able to take advantage of the knowledge Cracker gave them in order to defeat him."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "As her tenth son and Sweet Commander, Cracker is very loyal to his captain and mother Big Mom. Big Mom has confidence in his ability as she sent Cracker to assist his sister Charlotte Brûlée in dealing with Luffy, attempting to prevent him from seeing Sanji."}], "images": []}, {"title": "Charlotte Brûlée", "level": 4, "content": [{"type": "paragraph", "text": "As brother and sister, they get along very well. Even though Brûlée believed that she could handle the Straw Hats herself, Cracker still followed Big Mom's orders to assist her."}], "images": []}, {"title": "Father and Stepfathers", "level": 4, "content": [{"type": "paragraph", "text": "Like his mother and many of his siblings, Cracker has no concern for his father and step-fathers and believed they are no longer part of the Charlotte family anymore."}], "images": []}, {"title": "Crew and Associates", "level": 3, "content": [{"type": "paragraph", "text": "As one of the Sweet Commanders, Cracker is very loyal to the Big Mom Pirates. Like all the members of the crew, he addresses his mother Big Mom as Mama. When Cracker was defeated, he was found by his siblings who gathered up an army to avenge his defeat by attacking and defeating Luffy and Nami."}], "images": []}, {"title": "Randolph", "level": 4, "content": [{"type": "paragraph", "text": "Randolph respects Cracker very well. When Randolph attempted to assist him against Luffy, Cracker ordered him not to interfere which made Randolph apologize to him. Randolph is shown to fear Cracker as he would blame his crane to avoid the latter's wrath."}], "images": []}, {"title": "Kingbaum", "level": 4, "content": [{"type": "paragraph", "text": "Kingbaum and all the Homies are loyal to the Big Mom Pirates and respect Cracker's authority. However, when Nami held a Vivre Card containing Big Mom's soul fragment and forced him to act against Cracker, the Sweet Commander threatened to tell his mother of Baum's lack of allegiance, refusing to take his excuses."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Cracker became an enemy of Luffy after the latter arrived at Whole Cake Island. On his mother's orders, Cracker served as an obstacle in preventing Luffy from seeing Sanji. Cracker constantly made false assumptions of Sanji's opinion on the wedding and the Straw Hat Pirates, which Luffy found highly offensive, who in turn, irked the Sweet Commander by eating all of his biscuit soldiers. Luffy managed to overcome Cracker and send him flying through the sky into Sweet City."}], "images": []}, {"title": "Nami", "level": 4, "content": [{"type": "paragraph", "text": "Since Nami is part of Luffy's group, this makes her Cracker's enemy as well. Cracker was particularly furious at Nami for her ordering the Homies around with the Vivre Card and producing rain to soften his biscuit soldiers for Luffy to devour."}], "images": []}, {"title": "Pound", "level": 4, "content": [{"type": "paragraph", "text": "Like other Big Mom's ex-husbands, Cracker said to Pound that his ex-wife does not care about all of her former husbands and has no qualms trying to kill his former step-father."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of the Three Sweet Commanders of the Big Mom Pirates, Cracker's authority in the crew is second only to his mother's. As the Minister of Biscuit, Cracker rules over Biscuits Island and is responsible for procuring and distributing biscuits to whoever needs them. He is also capable of commanding large fleets into battle."}, {"type": "paragraph", "text": "Cracker's voice and presence alone are enough to cause nearby homies to shrink away and wither in fear, indicating that his power commands tremendous fear and respect among his fellow crewmates. His bounty of 860,000,000 indicates that the World Government considers him highly dangerous and threatening to their operations. His power and influence is so great that when he was defeated, Sweet City was put into a state of lockdown. Big Mom was also confident that Cracker could defeat Monkey D. Luffy, who managed to bring down Donquixote Doflamingo, further testifying to his combat strength. Though Urouge of the Worst Generation managed to defeat one of his fellow Sweet Commanders, Cracker defeated him afterward, though he did not manage to kill the Supernova."}, {"type": "paragraph", "text": "In battle, Cracker has displayed exceptional skill in deception and trickery; when fighting Luffy, he made it appear as though he had Devil Fruit powers related to multiplying limbs and weapons and when Luffy landed a powerful Gomu Gomu no Kong Gun on his armor, Cracker had it cough up blood-like jam in order to appear badly wounded by the blow. He was able to effectively deceive the entire World Government and the Marines despite being an infamously powerful pirate, being able to conceal his true identity and make his Biscuit Soldier pose as himself to the point his bounty poster depicts the Soldier and not him."}, {"type": "paragraph", "text": "Cracker has some degree of culinary skill, as he has created a jam concoction that resembles blood."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Cracker has also shown immense amounts of stamina, being able to fight and chase after Luffy for eleven hours. He has extraordinary strength, able to wield Pretzel, a very large sword, while maintaining sufficient speed to keep up with Luffy. In the anime, he is shown being able to clash evenly with Luffy, who was in Gear Fourth, and pushing him back with Pretzel."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Cracker wields a huge double-edged sword named Pretzel, a blade larger than himself with a crossguard shaped like a biscuit. He claims that it is a unique sword which has no peers. Cracker's Biscuit Soldiers each wield one or more much larger replicas of Pretzel made out of biscuit. He can also create biscuit shields with his Devil Fruit."}, {"type": "paragraph", "text": "Cracker is extremely skilled in wielding Pretzel, as he can attack very quickly despite the sword's size. Combined with Busoshoku Haki, he was able to cut through Luffy’s Gear Fourth-enhanced Haki defenses with his sword."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Pretzel_Infobox.png/revision/latest/scale-to-width-down/210?cb=20170924202659", "caption": "Cracker's sword, Pretzel."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Cracker ate the Bisu Bisu no Mi, a Paramecia-type Devil Fruit that allows him to generate and manipulate biscuits at will. Cracker is an expert craftsman, shaping his biscuits into identical, hulking, and lifelike entities complete with weapons. He usually inhabits one of his puppets as a suit of armor, which he uses to mislead his enemies about his real appearance. Cracker can manipulate his puppets' bodies at will, including granting them extra limbs and weapons, and can even imbue the puppet he inhabits with Busoshoku Haki, further increasing its defensive capabilities."}, {"type": "paragraph", "text": "The puppets possess immense strength; while using one as armor, Cracker easily pulled Pound, a very large man, out of the ground by his hair with one hand and repeatedly blasted Luffy away with great force. The armor also withstood a powerful kick from Luffy to its forearm and defended against Luffy's Haki-enhanced Gear Second and Third attacks with little effort, indicating immense durability. It took the immense raw power of Gear Fourth, Luffy's strongest state, to inflict significant damage on the armor. By creating even more suits of biscuit armor, Cracker can create a large, defensive wall that will absorb powerful blows while he prepares to attack."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Cracker%27s_Power.png/revision/latest/scale-to-width-down/210?cb=20170730095600", "caption": "Cracker creates biscuit puppets."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Cracker has incredible mastery of Busoshoku Haki, which he uses to harden his sword and biscuit armor. Luffy, a highly proficient expert of Busoshoku Haki himself, described Cracker's Busoshoku Haki as extremely tough, which can easily withstand Luffy's Haki enhanced strikes. After imbuing his sword with Haki, Cracker was able to cut Luffy's arm while he was fighting in Gear Fourth, further demonstrating the power of his Haki."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Cracker possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "During an attempted invasion of Big Mom's territory, Urouge defeated one of the Sweet Commanders, Snack. Cracker was sent out to sea with Prometheus and Zeus and a massive fleet and defeated Urouge very quickly."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/40/Cracker%27s_Troops.png/revision/latest/scale-to-width-down/210?cb=20170723052558", "caption": "Cracker leads a fleet against Urouge."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Big Mom sent Cracker to assist his sister Charlotte Brûlée in dealing with Monkey D. Luffy, attempting to prevent him from seeing Sanji."}, {"type": "paragraph", "text": "While Pound, one of Big Mom's husbands, was informing Luffy and Nami about the homies and Big Mom's power in the Seducing Woods, Cracker appeared within a biscuit puppet and scolded him for giving away information while pulling Pound out of the ground."}, {"type": "paragraph", "text": "As Cracker held Pound up, Randolph attempted to ambush Nami and Luffy, but Cracker ordered him to stop and intimidated the nearby homies into withering away. After berating Randolph for interfering, Cracker revealed that his mother had sent him to aid his sister because Luffy had defeated Donquixote Doflamingo and would have given her too much trouble otherwise. Brûlée, the homies, and the master of the Seducing Woods Kingbaum claimed that they would have succeeded, but Cracker wanted to leave no room for error right before the Tea Party. Cracker prepared to execute Pound with his mother's permission, only for Luffy to counter his sword swing and kick him in the arm, forcing Cracker to release Pound. Cracker and Luffy engaged in battle, but Cracker quickly blew Luffy away as he multiplied his limbs and declared that Luffy had no chance of defeating him."}, {"type": "paragraph", "text": "Luffy attacked Cracker with his Gomu Gomu no Elephant Gun, but Cracker blocked it with his shield before striking Luffy with his multiple Haki-imbued swords, which blasted him away. Luffy tried attacking Cracker with his Hawk Gatling, but Cracker once again overpowered him with his shield. After slamming Luffy onto the ground with his shield, Cracker attempted to convince him that Sanji would be happier leaving the Straw Hat Pirates. However, an angered Luffy retaliated by activating Gear Fourth and successfully landing a Gomu Gomu no Kong Gun on Cracker."}, {"type": "paragraph", "text": "After Luffy managed to shatter his biscuit puppet with another Kong Gun, Cracker emerged from it and cut Luffy's right arm with Pretzel. Revealing his true Devil Fruit abilities to Luffy, Cracker created multiple Biscuit Soldiers as he declared that Luffy could not beat him. As Luffy attacked the soldiers with Gomu Gomu no Kong Organ, Cracker leaped out from behind them to attack Luffy with Honey Pretzel, barely missing his head."}, {"type": "paragraph", "text": "The battle lasted for eleven more hours, with Luffy finding a way to eat Cracker's biscuit soldiers with the help of Nami's rain and adopting a strategy of fighting, eating, and running away. This causes Cracker to grow increasingly irate, but he gleefully anticipated Luffy exploding from the sheer amount of biscuits he ate. As Cracker produced more biscuit soldiers, he reprimanded Kingbaum for standing against him, but Kingbaum explained that the homies could not oppose Nami due to the Vivre Card in her possession. Cracker then complained to Nami for creating rain that softened his biscuit soldiers, enabling Luffy to eat them. Feeling that the battle had dragged on long enough, Cracker sent his biscuit soldiers charging at Luffy. Nami used Rain Spark and softened the soldiers, which Luffy then devoured. As Luffy was reaching his limit, Cracker prepared to strike Luffy, who then used another form of Gear Fourth called Tankman: Full Version. When Cracker tried to pierce Luffy with his sword, he got sucked into Luffy's body and was sent flying while destroying the remainder of the biscuit soldiers."}, {"type": "paragraph", "text": "Cracker was propelled with extreme force, flying well past the Seducing Woods and destroying some tree homies on the way. He flew into Sweet City and crashed into the Whole Cake Chateau, where he was found unconscious by his siblings Mont-d'Or, Galette, and Opera."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/96/Luffy_Fights_Cracker.png/revision/latest/scale-to-width-down/210?cb=20170716022126", "caption": "Cracker's attack on Pound is intercepted by Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Luffy_attacks_Cracker.png/revision/latest/scale-to-width-down/210?cb=20170806045921", "caption": "Cracker wearing down Luffy's stamina with his Biscuit Soldiers."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d9/Luffy_Defeats_Cracker.png/revision/latest/scale-to-width-down/210?cb=20181110180905", "caption": "Cracker is defeated by Gomu Gomu no Cannonball."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cracker vs. Urouge (unseen in the manga, seen in the anime)", "elements": []}, {"text": "Cracker vs. Monkey D. Luffy, Nami, and the Seducing Woods homies", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cracker and his Biscuit Soldiers vs. Nami", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Confrontation with Urouge", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, a flashback of Cracker's battle with Urouge is added. Following Snack's defeat, Cracker quickly appears and overwhelms the heavily wounded Urouge. "}], "images": []}, {"title": "Battle at the Seducing Woods", "level": 3, "content": [{"type": "paragraph", "text": "Cracker's fight with Luffy is extended heavily in the anime, showing additional scenes of their 11-hour struggle. After Luffy activated Gear Fourth, more scenes are shown of Luffy engaging with and destroying a large number of Cracker's Biscuit Soldiers. Cracker also clashed with Luffy in close combat, showing his expert swordsmanship. Luffy nearly lands a devastating hit on Cracker with Gomu Gomu no King Kong Gun, but his Gear Fourth wears out at the last second. He is then blown away as a result of deflating in the air. Cracker and his Biscuit Soldiers then set off to find the weakened Luffy, who attempts to hide but is found by one of the soldiers. Afterwards, Nami (with Kingbaum and the Seducing Woods homies under her command) rescued Luffy and fought against Cracker and his Biscuit Soldiers to buy Luffy time to recover. Nami was overpowered and about to be killed, but Luffy recovered just in time to save Nami and resume his fight against Cracker. There are additional scenes of the two exploiting the Biscuit Soldiers' weakness to being wet, with Nami controlling the weather to rain on them while Luffy knocks a Biscuit Soldier into a nearby river to splash other nearby dry ones. There are also additional scenes of Luffy devouring the dampened Biscuit Soldiers."}, {"type": "paragraph", "text": "After Luffy activated Gear Fourth Tankman in the manga, Cracker only used Honey Pretzel against him. In the anime, Cracker first tried slashing at Luffy only to find the strike ineffective. When he used Honey Pretzel, that attack also failed, having been deflected by Luffy's hardened body. Cracker then used an anime-only attack called Crash Pretzel before he got absorbed into Luffy's stomach."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A cracker is a thin, crisp wafer often eaten with cheese or other saver toppings. This follows the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}, {"text": "Cracker's sparking hair may be a reference to firecrackers, playing on his name.", "elements": []}, {"text": "Cracker is very similar to Wanze, as both are antagonists who use food-related abilities that included armor to stop the Straw Hats from going after one of their crewmates. Their food abilities were both handled in unorthodox ways (Sanji using cooking utensils against Wanze's ramen, and Luffy eating Cracker's biscuits). In their defeats, they were both sent flying and landed right in front of their comrades, who went on to overpower the people who had defeated them.", "elements": []}, {"text": "Cracker's favorite food is biscuits and his least favorite foods are kimchi and carbonated drinks.", "elements": []}]}], "images": []}]}