{"sections": [{"title": "Pound", "level": 1, "content": [{"type": "paragraph", "text": "Pound is Big Mom's 25th ex-husband and the father of Charlotte Chiffon and Lola. He is also the grandfather of Capone Pez and father-in-law of Capone Bege."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pound is a very big man, with his head alone being twice the height of Carrot and significantly wider. He is shown to be much bigger and taller than even Oven who is 492 cm tall. However, his head is the same size as the rest of his body, making him appear to be a giant when only his head is in view, and his legs are extremely disproportionately short. He has long, wavy light pink hair tied into a ponytail on top, a long and thin mustache, and a stubbly beard. His face is shaped like a pear, and he has rather small eyes which contrast with his very large nose and mouth. He wears a frilly light blue suit and dark pants that are tattered due to him being buried, and only has a shoe on his right foot."}, {"type": "paragraph", "text": "26 years ago, Pound wore a crown, although any significance it might have is unknown."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pound has various quirks that can seem very weird to those who meet him, as he buried himself in the ground because he likes it and frequently talks about his craving for apple juice. He maintains a neutral attitude around those he meets and will often speak to them normally despite whatever is happening to them, not seeming to pay any mind to outside conflicts due to not wanting to get involved in them, though he can sometimes place his conviction in people he takes a liking to. He has a habit of speaking his mind, which can annoy those around him."}, {"type": "paragraph", "text": "He can be caring and brave. At the Seducing Woods, he attacked Brûlée when rescuing Nami. Unlike Linlin, he truly loves his daughters and did not hesitate to charge at Oven when he was threatening Chiffon."}, {"type": "paragraph", "text": "Content with having the chance to see Chiffon, Pound faced the prospect of death with a smile on his face. He cried with happiness at the sight of his grandson waving at him and seeing his daughter happy and safe."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Pound was abducted and forced by Charlotte Linlin to be her 25th husband and he was coldly discarded after she birthed a set of twins with him. At the time of his dismissal, Pound was shocked at its suddenness and begged Linlin to at least hold their daughters at least once, a request that Linlin did not grant. Despite such callous treatment and cruelty, Pound did not held any resentment towards his former wife and accepted his abandoned status among the Charlotte Family, though it surprised him to know that Big Mom was fine with him being killed."}], "images": []}, {"title": "Daughters", "level": 4, "content": [{"type": "paragraph", "text": "Pound was forced by Linlin to help her conceive Chiffon and Lola. Despite this, Pound dearly loves his daughters and wanted to see them, saying he held them near and dear to his heart. However, his daughters do not know who he is since he was cast away shortly after their birth. His love for his daughters was so strong, he instantly recognized an adult Chiffon outside of Whole Cake Island despite not having seen her since she was a baby. He followed her to Cacao Island, wanting to see her. After arriving at the Sweets Factory where Chiffon was working, Pound continuously begged to be allowed in. When he saw Oven threatening Chiffon, Pound quickly came to her defense despite his cowardice and even attempted to attack Oven. After helping Chiffon escape Cacao Island, Pound was happy and content that he got the chance to see his daughter again."}], "images": []}, {"title": "Capone Pez", "level": 4, "content": [{"type": "paragraph", "text": "Capone Pez is Pound's grandson through Chiffon's marriage with Capone Bege. Although the first time he met with his grandson was a mere glimpse at a distance when the Fire Tank Pirates were escaping from Oven's pursuit, the two quickly formed a bond, as Pez cheerfully waved back at his grandfather. Pound was happy to see his grandson being cared for lovingly by both his parents, which Pound himself never got a chance to for his daughters, and only regretted that he did not know his grandson's name. When Oven assaulted Pound with a flaming blade, Pez cried."}], "images": []}, {"title": "Stepchildren", "level": 4, "content": [{"type": "paragraph", "text": "During his time as Linlin's husband, Pound had tried to show familial affection to his stepchildren such as Cracker and Oven whom he affectionately addressed with the suffix-Kun, still doing so even after he was cast aside by Big Mom. However, they are shown to be hostile towards him as they do not see him as part of their family. After Pound gave secret information about Big Mom to Luffy and Nami, Charlotte Cracker prepared to kill him without any hesitation. After seeing Pound causing a commotion outside the Sweets Factory at Cacao Island, Oven quickly assaulted him and drove him away. However, Pound was willing to fight some of his stepchildren to help others. At the Seducing Woods, he attempt to strike Brûlée to save Nami, making him an official enemy of Big Mom and the entire Charlotte Family. Pound even attacked Oven to protect Chiffon."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "He first encountered some of the Straw Hat Pirates when they ran into him in the Seducing Woods. The Straw Hats were appalled by his strange behaviors, and mostly ignored him due to being constantly pursued by enemies. However, they somehow kept running back to Pound no matter where they ran, and he later revealed information on Big Mom to Monkey D. Luffy and Nami. Upon realizing that Pound is Lola's father, Nami's opinion of him changed, and Luffy swiftly defended him from Cracker's attempted execution, saying that he had taken to Pound due to spending a lot of time with him. Pound later attacked Brûlée when she was attacking Nami, cementing himself as an ally of the Straw Hats and an enemy of the Big Mom Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Pound was able to withstand being pierced in the head by Randolph's spear while only feeling slight pain, most likely due to the large size of his head."}, {"type": "paragraph", "text": "He has no fighting skills, since he closed his eyes in fear and Brûlée was able to easily dodge his punch. However, he is big enough to cause Brûlée to panic when he attacked her."}, {"type": "paragraph", "text": "He has great eyesight, as he could identify and recognize his daughter Chiffon from a very far distance. Similarly, he could clearly see his grandson Pez from miles away."}, {"type": "paragraph", "text": "Despite not being a fighter, Pound has shown a certain degree of durability, as he took a beating from someone as powerful as Oven and remained conscious. He was briefly unable to move due to his injuries, but recovered quickly enough to thwart Oven's attempt to prevent the Nostra Castello's escape from Cacao Island. Due to his large size, Pound has sufficient strength to use a large club to send two members of the Big Mom Pirates flying and enough leg strength to jump a far distance towards Oven in a single leap in the anime."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in the past, Pound was abducted by Charlotte Linlin to be her 25th husband. 26 years ago they had two daughters, Chiffon and Lola. After the girls were born, Linlin cast Pound aside."}, {"type": "paragraph", "text": "Sometime afterwards, he buried himself up to his neck in the Seducing Woods, and was not attacked due to no one caring about him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Big_Mom_Casts_Pound_Away.png/revision/latest/scale-to-width-down/210?cb=20181111044857", "caption": "Big Mom casts Pound aside after the birth of his daughters."}]}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Pound met Nami, Tony Tony Chopper, and Carrot when they ran into him. They asked him who buried him, and he replied that he did, and asked for apple juice. The Sanji Retrieval Team, disturbed by him, quickly sped away. Later, they were running from Randolph of the Big Mom Pirates, who threw his spear into the back of Pound's head. They ran past Pound and back to the coast, but they somehow ended up back in front of him, and he asked them to pull the spear out of his head. They ran away from him again but once again ended up back in front of him, confusing and frightening both parties. Pound watched as the Straw Hats were ambushed and scattered by Charlotte Brûlée and the homies constituting the forest."}, {"type": "paragraph", "text": "As night fell, Monkey D. Luffy came to Pound to add more of his captured crewmates to a pile, although the crewmates were actually animals mirrored into humans. Luffy reunited with Nami, and they asked Pound what he knew about all the homies ambushing them. Nami wondered why he was not being attacked as well, and Pound offered to tell her what he knew if she gave him apple juice; Nami agreed to do so afterwards. Pound revealed that he saw Chopper being overwhelmed by the tree homies, and Luffy asked how the homies existed. Pound explained Big Mom's ability. Luffy asked who his fake crewmates were, and Pound revealed that they were Brûlée's illusions. Luffy got angry at Pound for not telling him that earlier, and Pound claimed that he did not want to be involved. After Luffy and Nami asked who he really was, Pound revealed his past as one of Big Mom's husbands. Suddenly, he was pulled out of the ground by Charlotte Cracker, who was angry that he gave away information to their enemies. Pound begged Cracker to let him speak to Linlin before he died, so he could congratulate Chiffon on her marriage and possibly also see Lola."}, {"type": "paragraph", "text": "While Cracker talked with Brûlée and Randolph about taking out the Straw Hats, he prepared to kill Pound, saying that Big Mom did not care if he died and only thought of her husbands as outsiders. Pound begged Cracker not to kill him, and Luffy suddenly blocked Cracker's sword strike. Cracker dropped Pound, and he ran away with Nami as the homies pursued them, noticing that she had recognized Lola's name earlier. Nami then pulled out Lola's Vivre Card of Big Mom, which caused the homies chasing them to freeze in fear at the power of Big Mom's soul. Pound and Nami then saw Cracker blow Luffy a large distance back as the two pirates fought."}, {"type": "paragraph", "text": "Brûlée resumed her pursuit of Pound and Nami. She tried to capture Nami in her mirror, but Pound threw a punch at Brûlée and rescued Nami. Once Nami attacked Brûlée with her Thunderbolt Tempo, Pound revealed that Brûlée can appear and emerge from any mirror inside the forest. He then asked Nami if she is a friend of his daughter, Lola, which Nami affirmed. Pound rode with Nami on Kingbaum as she threatened the homies."}, {"type": "paragraph", "text": "Pound ran and hid as Luffy and Cracker continued fighting for the next 11 hours. After Luffy defeated Cracker, Nami was overjoyed and cheered at Luffy's accomplishment. However, Pound was worried about the wrath that may fall upon them and warned Nami about the homies Zeus and Prometheus and their ability to control the weather. Pound stayed behind in the Seducing Woods while Luffy and Nami departed with Kingbaum."}, {"type": "paragraph", "text": "Pound later fled from Whole Cake Island on a boat. Within the borders of Totto Land, Pound spotted his daughter Chiffon riding on a flying carpet homie. He tried to call out to her, but she could not hear him. He then went to Cacao Island and when he arrived at the Sweets Factory where Chiffon was working, he was forbidden to enter due to Pudding's instructions. Pound continuously begged to be let in but was later attacked by Oven, who forced Pound away."}, {"type": "paragraph", "text": "As Pudding and her group of chefs left the factory with the cake, Pound tearfully saw Chiffon from a distance. When Oven threatened Chiffon, Pound charged at him to save his daughter, and Sanji (who was in disguise) rapidly moved to kick Oven in the head just when it seemed like Pound's punch would land, knocking him into a nearby building. While Pound was confused, Oven quickly got back up and punched his stepfather. When Capone Bege's ship, the Nostra Castello, came to rescue Chiffon's group, Pound saw his grandson Capone Pez for the first time and happily waved to him. After Bege's ship returned to the sea, Oven attacked it by heating up the ocean, and Pound responded by attacking him with a wooden club. The attack did no damage to Oven, but stopped his attack on Chiffon's group, and Pound was happy to see his daughter having a happy marriage as his stepson struck him from behind with a flaming blade. The full extent of the damage Pound received from Oven's flaming blade is still unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/28/Pound_Meets_the_Straw_Hats.png/revision/latest/scale-to-width-down/210?cb=20170611020234", "caption": "Pound meets Nami, Chopper, and Carrot."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/96/Luffy_Fights_Cracker.png/revision/latest/scale-to-width-down/210?cb=20170716022126", "caption": "Luffy frees Pound from Charlotte Cracker's grasp."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e9/Pound_Attacks_Br%C3%BBl%C3%A9e.png/revision/latest/scale-to-width-down/210?cb=20170723021336", "caption": "Pound attacks Brûlée."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/da/Oven_Beats_Up_Pound.png/revision/latest/scale-to-width-down/210?cb=20181014032713", "caption": "Pound assaulted by his stepson Oven."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Pound_Attacks_Oven.png/revision/latest/scale-to-width-down/210?cb=20181111044516", "caption": "Pound attacks Oven to save Chiffon's group."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Pound and Nami vs. Charlotte Brûlée", "elements": []}, {"text": "Pound and Sanji vs. Charlotte Oven", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Luffy and Nami imagined him as a typical giant before his full appearance was revealed.", "elements": []}, {"text": "Pound's name may come from pound cake, fitting the Charlotte Family's food naming theme, although he is not a blood member.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Pound_Imagined_as_a_Giant.png/revision/latest/scale-to-width-down/100?cb=20170716021229", "caption": "Pound as a giant."}]}]}