{"sections": [{"title": "Cosette", "level": 1, "content": [{"type": "paragraph", "text": "Cosette is the head chef employed in the Germa Kingdom's royal household."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cosette is a young woman with long light brown hair tied in a braid, dark brown eyes and freckles on her face. She wears a dark red bordeaux chef's uniform top and a white knee-length skirt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Cosette_Anime_Concept_Art.png/revision/latest/scale-to-width-down/100?cb=20181105193117", "caption": "Cossette's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Cosette is very submissive to the Vinsmoke Family, doing anything they order even if it will cause harm to her. Dutiful to the dignity of the family, she attempted to dissuade Sanji from picking the food off the floor, insisting that she would clean it up herself. She will get very flustered and joyful if someone compliments her and her cooking."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Vinsmoke Family", "level": 3, "content": [{"type": "paragraph", "text": "As a servant of the Vinsmoke Family, Cosette is very obedient towards them, if in a submissive and fearful manner. They are not above injuring her to quench their frustration.Vinsmoke Yonji was among the ones who disregarded her as a mere commoner compared to their royal statuses and derided Sanji for defending her."}], "images": []}, {"title": "Niji", "level": 4, "content": [{"type": "paragraph", "text": "Cosette has indirectly earned the wrath of Vinsmoke Niji when he had an argument with Sanji over food, taking it out on the head chef as he considered the food she made was unappealing, disrespectfully throwing the plate at her face. During this, Cosette simply apologized fervently for her inability to cook something to appease the second prince, while standing still as ordered so Niji could smash her face with the plate of food."}, {"type": "paragraph", "text": "Later on when Sanji attacked him, Niji confirmed with absolutely no remorse that he was indeed the one responsible for the vicious beating the head chef experienced, even going on to mock Sanji by claiming he would have beat her everywhere but her face if he knew she meant so much to Sanji."}], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Atypical for the princes of the Vinsmoke Family, Sanji immediately stood up for Cosette when Niji attempted to take out his frustrations on her over a squabble about the food she made. Being a fellow chef, he complimented the food she made, even picking it off the floor when Niji threw it at Cosette's face (which Sanji caught before it hit). Cosette was surprised when Sanji defended her and blushed when Sanji stated she was \"beautiful\" and became overjoyed that he would actually pick up food off the ground despite her pleas and eat it calling it perfection. When she was brutally beaten later that day, Sanji was further infuriated and desperately called for a doctor to help her."}, {"type": "paragraph", "text": "When he saw Niji once more, Sanji immediately attacked him after remembering the pain he put Cosette through."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/02/Sanji_Confronts_Niji.png/revision/latest/scale-to-width-down/210?cb=20170806194009", "caption": "Sanji protecting Cosette from Niji."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As head chef, Cosette is in charge of the chefs under her within the Germa Kingdom. Her culinary skills were complimented by fellow chef Sanji."}, {"type": "paragraph", "text": "Cosette is not physically strong, as she was easily overpowered by the force of Vinsmoke Niji's stopped kick."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "As Sanji was harassing Niji over finishing his meal, Niji called Cosette to the table, complaining that the food she made was now ruined by Sanji's attitude. She vehemently apologized as Niji threw his plate at her face, but Sanji caught the plate. Sanji then picked up the food that had fallen onto the floor, despite her pleas to allow her to do it, and she was shocked as he ate it off the floor. Sanji complimented the dish immensely, causing her to cry tears of joy. Niji then aimed a kick at the two of them but stopped after Judge ordered him to, and the force of the stopped kick caused Cosette to fall to the ground. Later, while Judge talked to Sanji, Cosette was severely beaten by Niji and left unconscious. She was then found by Sanji, who told someone to call a doctor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/11/Cosette_Beaten_Up.png/revision/latest/scale-to-width-down/210?cb=20160917132608", "caption": "Cosette is severely beaten."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, an extra scene is added of her in the hallway looking at her reflection. Cosette fixes her hair and she suddenly sees Sanji’s face in her reflection. She thinks back to his chivalry and is surprised by her thoughts. Niji comes along and insulting her by calling her “cooking wench” then cracks his knuckles and grins menacingly as he approaches her. Cosette is terrified and it cuts away to Sanji who soon finds her in her beaten state."}, {"type": "paragraph", "text": "Cosette’s facial injures she received from Niji are heavily toned down in the anime, removing her swollen eye and lips and broken teeth."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cosette shares her name with the character Cosette from the French novel Les Misérables. Cosette, or chosette, is French for \"little thing\". She shares this connection with a fellow Germa Kingdom servant, Époni.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 84 Chapter 839 (p. 5-9), Cosette makes her debut.", "elements": []}, {"text": "↑  https://one-piece.com/news/detail/20171102_6345/", "elements": []}, {"text": "↑  One Piece Manga — Vol. 84 Chapter 839 (p. 8).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 84 Chapter 839 (p. 15).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 84 Chapter 840 (p. 7-9).", "elements": []}, {"text": "↑  One Piece Anime — Episode 802.", "elements": []}]}], "images": []}]}