{"sections": [{"title": "Époni", "level": 1, "content": [{"type": "paragraph", "text": "Époni is a nurse in service to the royal household of the Germa Kingdom. She was primarily charged with caring for the late queen, Vinsmoke Sora."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Époni is a large woman with shoulder-length black hair. She wears a French maid's uniform."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/%C3%89poni_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20181026175658", "caption": "Époni's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a servant of the Vinsmoke Family, Époni is very dutiful and subservient towards them, especially Sora. She was also kind and amiable towards Sanji, although she was honest about his lack of cooking skills."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Époni has some medical and culinary expertise, being able to care for and prepare nutritious meals for the bedridden Sora."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Over 13 years ago, Époni was responsible for caring for the Germa Kingdom's gravely ill queen, after Sora self-administered a drug to counteract the effects of the Lineage Factor surgery she was forced to undergo. While Sora remained bedridden during her final years, Époni continued dutifully as her nurse."}, {"type": "paragraph", "text": "Prior to her death, the queen occasionally received visits from her daughter, Reiju, as well as her third son, Sanji. Époni would usually be close at hand during these visits. On one such visit by Sanji, he showed Époni the food he had prepared for Sora. Although Époni stated that his mother had difficulty keeping anything down, Époni tried the food just in case, but the food tasted terrible. Époni replaced Sanji's food with another meal, but Sora told Époni that she would eat the food Sanji prepared. Époni explained that she already discarded it, but the queen nonetheless demanded it back and ate it. Sora described the food as delicious, shocking Époni but delighting Sanji. Sometime later during one of Reiju's visits in which Sora told her daughter about Sanji's meal, Époni was present and awkwardly witnessed Sora's emotional reaction to Sanji's kindness."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is possibly derived from the character Éponine from the French novel Les Misérables. She shares this connection with a fellow servant of the Vinsmoke Family, Cosette.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 841 (p. 5-7) and Episode 804, Époni debuts.", "elements": []}, {"text": "↑  https://one-piece.com/news/detail/20171102_6345/", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 85 Chapter 852 (p. 10-13) and Episode 819, Reiju tells Sanji about their mother.", "elements": []}]}], "images": []}]}