{"sections": [{"title": "Charlotte Opera", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Opera is the fifth son and the tenth child of the Charlotte Family and is the eldest quintuplet brother of Counter, Cadenza, Cabaletta, and Gala. He also is an officer of the Big Mom Pirates and served as Totto Land's Minister of Whipped Cream (生クリーム大臣, Nama Kurīmu Daijin, Viz: \"Minister of Cream\"), governing over Noko Island. His current status is unknown after having his lifespan removed by a rampaging Big Mom."}, {"type": "paragraph", "text": "Due to his actions and role, he is a supporting antagonist during the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Opera is an enormous man with an extremely thick body. His head and arms are covered in a semi-liquid substance, which compose a very large beard. He wears a bow tie on his beard, as well as a cape with a high collar. He also wears dotted wristlets and a dotted belt which has the same substance dripping from it. His legs are extremely small in comparison to the rest of his body."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Opera_Anime_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20171020124039", "caption": "Opera concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Opera seems to be analytical, as he deduced that Luffy must be nearby upon finding the defeated Cracker. He cares for his family as well as the well-being of Sweet City, as he attempted to stop Big Mom from attacking Moscato during her rampage and was shocked to see the defeated Cracker."}, {"type": "paragraph", "text": "He also has a tendency to treat serious matters with a nonchalant attitude, so long as they do not affect him, as shown when he prepared to torture Nami with only a plain expression on his face. Opera is cowardly and cared for his self-preservation, as he made up stories about Luffy's and Nami's death in order to avoid severe punishment for failing to guard them."}, {"type": "paragraph", "text": "He has a habit of adding the suffix \"-fa\" (ファ, \"-fa\") to the end of his sentences. He possesses a distinct way of laughing: \"Fafafa\" (ファファファ, Fafafa), which is based on the suffix he adds at the end of his sentences."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Like most of her children, Opera is loyal to his mother but he also fears her. Big Mom seems to trust him, as she assigned him to force the information of Lola's whereabouts out of Nami. He believed that his mother would use her powers to drain the life out of him as punishment for letting her prisoners escape, causing him to lie about the subject. He clearly put his own safety above Linlin's orders. Opera's fear was well put as his mother had another craving illness and stole his lifespan in a blind rampage."}], "images": []}, {"title": "Mont-d'Or", "level": 4, "content": [{"type": "paragraph", "text": "Opera and Mont-d'Or generally seem to get along. However, Mont-d'Or is not completely trusting of him and rightfully deduced that Opera was most likely lying when he claimed to have killed their mother's prisoners and had guards on watch. When Monkey D. Luffy appeared and caused chaos at the wedding, Mont-d'Or was angered once he realized that Opera indeed lied in order to save himself. In spite of this, Mont-d'Or was horrified to see that Opera had become a victim in Big Mom's food craving rampage."}], "images": []}, {"title": "Moscato", "level": 4, "content": [{"type": "paragraph", "text": "Opera cares about his younger brother Moscato, as he tried to stop him from interfering with their mother's rampage. When Moscato had his lifespan removed, Opera was saddened by his supposed death."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Whipped Cream, Opera has authority over Noko Island, and as an officer of the Big Mom Pirates , he has authority over lower-ranking members of his crew."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Because of his large size, he has considerable physical strength, as he was able to easily pick up a young boy with one hand."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Opera ate the Kuri Kuri no Mi, a Paramecia-type Devil Fruit that allows him to generate and manipulate seemingly limitless amounts of cream. The cream's sugar is able to inflict painful chemical burns to anyone it comes in contact with."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Kuri_Kuri_no_Mi.png/revision/latest/scale-to-width-down/210?cb=20180912213640", "caption": "Opera's Devil Fruit ability."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When he prepared to torture Nami, Opera wielded a crossbow."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Opera was born to Charlotte Linlin along with Counter, Cadenza, Cabaletta, and Gala as a set of quintuplets, being the oldest of the set."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Big Mom developed a craving for croquembouche and went on a rampage in Sweet City, Opera's brother Moscato tried to calm her, but she was hostile towards him. Opera, Galette, and Mont d'Or pleaded for her not to attack Moscato, but she pulled away Moscato's lifespan, shocking the three siblings and the other citizens of Sweet City. Big Mom was satiated by Jinbe. Later, Opera removed a young boy from Moscato as he was being taken away."}, {"type": "paragraph", "text": "Two days later, Opera, Galette, and Mont-d'Or witnessed a defeated Cracker flying into Sweet City. They were appalled to see one of the Sweet Commanders defeated, and Opera deduced that Monkey D. Luffy was near, causing him to put Sweet City into a state of emergency. Soon afterwards, Opera and an army marched towards Luffy's location and began battling him."}, {"type": "paragraph", "text": "Opera attacked Luffy with massive amounts of cream, increasing its sweetness in order to burn the pirate. Luffy tried to attack Opera, but was put into an illusion by Mont-d'Or. After Luffy and Nami were overwhelmed, the army learned that the Vivre Card in Nami's possession came from Lola. They then headed back to Sweet City to report to Big Mom with the captive Straw Hats. In the Prisoner Library, Opera sat on a couch with his siblings and watched Big Mom talk to Luffy and Nami through a Den Den Mushi."}, {"type": "paragraph", "text": "After Big Mom finished her conversation with the prisoners, Opera laughed at how Luffy had challenged her. Anglais arrived to inform Opera and his siblings that an intruder broke into the Room of Treasure. Sometime later, Pudding came and asked to speak to Luffy and Nami. As Pudding talked to the two Straw Hats, Opera wondered what Pudding was saying to them. After Pudding left, Luffy attempted to free himself from his binding, and Opera told him that struggling was useless."}, {"type": "paragraph", "text": "Opera then received orders from Big Mom to make Nami reveal Lola's location by the end of the day, and when Nami refused, Opera brought out a crossbow, with which he threatened to shoot Nami every five seconds until she revealed Lola's location. However, Nami continued to refuse, and they were interrupted by the arrival of Jinbe. Opera told Jinbe he was not allowed on the castle grounds, but Jinbe only apologized as he hit Opera in the stomach with a powerful Gosenmaigawara Seiken, sending him crashing to the ground in shock. He lost consciousness soon afterwards."}, {"type": "paragraph", "text": "Opera later attended a meeting of the Charlotte Family. As they were discussing the current statuses of the Vinsmoke Family and the Sanji Retrieval Team, Opera claimed to have burned Luffy and Nami to death, lying in order to avoid losing face and facing punishment from Big Mom."}, {"type": "paragraph", "text": "The next day, Opera was not present at Pudding and Sanji's wedding ceremony. After the Whole Cake Chateau collapsed, Big Mom entered a rampage fueled by a craving for wedding cake. During her rampage, Big Mom attacked Opera and pulled out an unspecific amount of his lifespan. Afterwards, she dragged him along with her and tossed him over to her other children."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6f/Cream_Monster.png/revision/latest/scale-to-width-down/210?cb=20171022063017", "caption": "Opera facing Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Jinbe_Attacks_Opera.png/revision/latest/scale-to-width-down/210?cb=20171217051246", "caption": "Opera is attacked by Jinbe."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4c/Big_Mom_Kills_Opera.png/revision/latest/scale-to-width-down/210?cb=20170724150348", "caption": "Opera taken out by Big Mom."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Big Mom's army vs. Monkey D. Luffy, Nami, and Kingbaum", "elements": [{"text": "Opera vs. Luffy", "elements": []}]}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name may be based off opera cake, a French almond sponge cake, which follows the eating/food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": [{"text": "He is also likely named after the theatrical opera, as his fellow quintuplets are named after musical terms.", "elements": []}]}, {"text": "The number of hair groups he has matches his position as part of quintuplets, with him having zero, Counter having one, Cadenza having two, Cabaletta having three, and Gala having four.", "elements": []}]}], "images": []}]}