{"sections": [{"title": "Charlotte Snack", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Snack is the 25th son and 44th child of the Charlotte Family and an officer of the Big Mom Pirates. He also serves as Totto Land's Minister of Fries (フライ大臣, Furai Daijin), governing over Potato Island."}, {"type": "paragraph", "text": "He was one of the crew's Four Sweet Commanders until he lost his position when he was defeated by Urouge sometime in the last two years. He was also a member of Charlotte Oven's army to intercept the Straw Hat Pirates on Cacao Island. He is the older twin brother of Bavarois."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Snack is a very wide man with a long nose, dark brown hair tied in a bun with a hairpin through it, and a dark blue tattoo above his right eyes. He wears a yellow woolen jacket resembling sheep's wool with his name printed on it, a dark red scarf with thin white stripes on it, and has armor plates on his arms. His head is rather small in comparison to his body."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Snack's personality, but he is loyal to his family and crew even after he was demoted from his Sweet Commander position, as he came to Cacao Island to help fight against the Straw Hat Pirates. He has a strong hatred for the Worst Generation due to his loss against Urouge costing him his position as a Sweet Commander."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Big Mom Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Snack was one of the Sweet Commanders and a high-ranking member of the Big Mom Pirates, and Charlotte Cracker and Big Mom retaliated with rage after Snack's defeat by Urouge, respectively sending a large fleet and storm after him. He was nevertheless demoted for his defeat."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Fries, Snack has authority over Potato Island, and as an officer of the Big Mom Pirates, he has authority lower-ranking members of his crew."}, {"type": "paragraph", "text": "As formerly one of the Sweet Commanders, Snack had great authority and power over the crew, second only to Big Mom herself. His power is reflected by his large bounty of 600,000,000. However, he was defeated in combat by Urouge of the Worst Generation. Consequently, he was demoted from his position as a Sweet Commander and lost the authority that came with the title."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Snack is shown to be strong enough to clash with a Raid Suit empowered Vinsmoke Judge."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is seen wielding a large katana. In the anime, he has been shown to be skilled enough to clash against Vinsmoke Judge."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "30 years ago, Snack was born to Charlotte Linlin and her 21st husband along side his younger twin brother, Bavarois."}, {"type": "paragraph", "text": "At some point in the past, Snack was given the position of Sweet Commander."}, {"type": "paragraph", "text": "Sometime in the last two years, Snack confronted Urouge of the Worst Generation after the latter had entered Totto Land, but was subsequently defeated in battle. Following the incident, Snack was demoted from his position, but remained in the crew."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Snack came to Cacao Island with many of his siblings to join Charlotte Oven in preparation to battle Monkey D. Luffy and the Straw Hat Pirates, and he noted that Luffy is part of the Worst Generation. As the Straw Hats' promised rendezvous time drew near, the Big Mom Pirates prepared to ambush Luffy once he exited the Mirro-World."}, {"type": "paragraph", "text": "After Luffy exited the Mirro-Word, Snack was surprised when Germa 66 attacked the Big Mom Pirates' fleet around the island. He was then preoccupied with fighting Germa's forces that he did not notice Oven's command to stop Luffy and Sanji from escaping."}, {"type": "paragraph", "text": "After the Big Mom Pirates' fleet used their cannons to blow off a part of Germa's main castle, Snack appeared to confront Vinsmoke Judge."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Judge_vs._Snack.png/revision/latest/scale-to-width-down/210?cb=20190303194813", "caption": "Snack confronts Judge."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Snack vs. Urouge (unseen)", "elements": []}, {"text": "Big Mom Pirates vs. Germa 66 (Cacao Island)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Charlotte Snack vs. Vinsmoke Judge (Germa Kingdom)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "A flashback of Urouge's attempted invasion of Totto Land is added in the anime. The flashback begins showing Snack (who appears as a silhouette) collapsing from his fight with Urouge."}, {"type": "paragraph", "text": "According to the silhouette shown in the anime, Snack appears as a muscular figure that is very large, towering even over Urouge, who stands at nearly four meters. Snack wore a horned helmet and had shoulder plates with spikes on it, as well as long wild hair resembling a mane."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3d/Snack_Anime_Infobox.png/revision/latest/scale-to-width-down/150?cb=20170723111116", "caption": "A silhouette of Snack in the anime."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A snack is a portion of food eaten between meals. This fits the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 89 Chapter 894 (p. 14-15) and Episode 869, Snack makes his debut and is revealed to be a member of the Charlotte Family.", "elements": []}, {"text": "↑  One Piece Anime — Episode 798, Snack is alluded to in a flashback.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 83 Chapter 837 (p. 9) and Episode 798, Snack is first mentioned.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 843 (p. 8) and Episode 806, Snack's name is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 875.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 896 (p. 2-3, 16-17), The Big Mom Pirates prepare for Luffy's arrival.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 897 (p. 14-17), Germa 66 attacks the Big Mom Pirates at Cacao Island.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 898 (p. 15), Oven fails to communicate with his siblings.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 900 (p. 16-17), Snack confronts Judge", "elements": []}]}], "images": []}]}