{"sections": [{"title": "Charlotte Galette", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Galette is the 18th daughter and the 42nd child of the Charlotte Family, an officer of the Big Mom Pirates and the older twin sister of Poire. She also serves as Totto Land's Minister of Butter (バター大臣, Batā Daijin), governing over Margarine Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Galette is a woman of average size, with pale skin and shoulder-length fuchsia hair, which curls at the ends. She has yellow eyes and notably thick eyelashes. She wears a red-violet dress, a dark purple feather coat, magenta gloves, and two horns on the top of her head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Galette cares about her family, as she begged her mother not to kill her brother Moscato, and she was shocked when she saw the defeated body of her brother Cracker. She is prone to underestimating and condescending others, as she expressed surprise when Nami summoned a large lightning bolt. Like Oven, she takes betrayals seriously as she was furious when Praline sided with the Sun Pirates and mocked her failure to kill the Straw Hat Pirates."}, {"type": "paragraph", "text": "When Whole Cake Island was collapsing and she was falling, Galette was terrified for her life to the point where she cried tears of gratitude when her older brother Katakuri saved her."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As Minister of Butter, Galette has authority over Margarine Island in Totto Land, and as an officer in the Big Mom Pirates, she holds a high position in the crew and has authority over lower-ranking members."}, {"type": "paragraph", "text": "Galette possesses considerable strength since she was a part of the army sent to deal with Nami and Luffy. Together with Smoothie and Daifuku, she managed to subdue Sanji, Reiju and Luffy, although the latter was heavily weakened."}, {"type": "paragraph", "text": "Galette possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Galette ate the Bata Bata no Mi, a Paramecia-type Devil Fruit that allows her to create and control butter, which she can use to bind and immobilize her opponents."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/Nami_Butter.png/revision/latest/scale-to-width-down/210?cb=20181203112541", "caption": "Galette using her Devil Fruit ability to bind Nami."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Big Mom developed a craving for croquembouche and went on a rampage through Sweet City, Galette's brother Moscato tried to calm her, but she was hostile towards him. Galette, Opera, and Mont-d'Or pleaded for her not to attack Moscato, but she pulled away Moscato's lifespan, shocking the three siblings and the other citizens of Sweet City. Big Mom was later satiated by Jinbe. Later, Galette ordered some soldiers to hurry and remove Moscato's body."}, {"type": "paragraph", "text": "Two days later, Galette, Opera, and Mont-d'Or witnessed a defeated Cracker flying into Sweet City. They were appalled to see one of the Sweet Commanders defeated, and Galette noted that Cracker was last seen heading for the Seducing Woods to handle Monkey D. Luffy, which meant that Luffy was responsible for Cracker's defeat. After Sweet City was put in high alert, Galette and an army marched towards Luffy's location and began battling him."}, {"type": "paragraph", "text": "Nami brought down a large lightning bolt before Galette immobilized her with her ability, expressing surprise at Nami's powerful attack. As Amande removed a Vivre Card from Nami, Galette realized that it was how the Straw Hat Pirates made the homies powerless. They then learned that the Vivre Card came from Lola, surprising them. The army headed back to Sweet City to report to Big Mom with the captive Straw Hats in tow. In the Prisoner Library, Galette sat on a couch with her siblings and watched Big Mom talk to Luffy and Nami through a Den Den Mushi."}, {"type": "paragraph", "text": "After Big Mom finished her conversation with the prisoners, Anglais arrived to inform Galette and her siblings that an intruder broke into the Room of Treasure. Later, Galette attended a meeting to go over the statuses of the Sanji Retrieval Team and the Vinsmoke Family."}, {"type": "paragraph", "text": "Galette attended the Tea Party and listened to Vinsmoke Niji. During the chaos initiated by Luffy and his group, Luffy caused Big Mom to start screaming. While shielding her ears, Galette noticed that Big Mom scraped her knees."}, {"type": "paragraph", "text": "She continued to cover her ears as Bege, Vito, and Gotti launched their weapons at Big Mom. However, Big Mom's scream destroyed the weapons before they could hit her. Galette was then given earplugs by Katakuri and the Big Mom Pirates proceeded to surround Luffy and Bege's groups, forcing Bege to transform into a fortress to save his allies."}, {"type": "paragraph", "text": "After Bege returned to human form, Caesar attempted to flee the venue with him in tow while Luffy, Sanji, and the Vinsmoke Family face off against the Big Mom Pirates. In the ensuing conflict, Galette, Smoothie, and Daifuku subdued Luffy, Sanji, and Reiju with Galette's power as they were falling back. However, at that moment, the Tamatebako dropped to the base of the Whole Cake Chateau and exploded, causing the castle to collapse."}, {"type": "paragraph", "text": "As she was falling off the castle, Galette started screaming for Katakuri to save her, which he soon did. The castle was then turned into cake by Streusen, saving the crew from death."}, {"type": "paragraph", "text": "Galette was later seen on the Queen Mama Chanter. As the Straw Hats were making their getaway on the Thousand Sunny, the Big Mom Pirates were held back by the Sun Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Gathering_Around_Defeated_Cracker.png/revision/latest/scale-to-width-down/210?cb=20170924052633", "caption": "Galette, Mont-d'Or, and Opera gather around their defeated brother Cracker."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/86/Siblings_Subdue_Strawhats.png/revision/latest/scale-to-width-down/210?cb=20180624112134", "caption": "Galette and her siblings subdue Reiju and the Straw Hats."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Big Mom tried to infiltrate Wano Country, Galette accompanied her mother and crew as they attempted to climb the waterfall into the country on the Queen Mama Chanter. However, just before they reached the top of the waterfall, King attacked the ship, causing it to fall off the waterfall and Big Mom to fall into the sea."}, {"type": "paragraph", "text": "On the seas near Wano, Galette reflected on their current situation with the rest of her family. When Perospero brought up the fact that Big Mom's Vivre Card was intact, meaning that she was still alive, Galette noted that, being in enemy territory, she probably had been captured."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Big Mom's army vs. Monkey D. Luffy, Nami, and Kingbaum", "elements": [{"text": "Galette vs. Nami", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Galette, Daifuku, Smoothie, and Oven vs. Luffy, Sanji, and Reiju", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The anime added a scene of Mont-d'Or and Galette discovering Bobbin in an alley after the latter was shot by Vito. The two then went to Sanji's room in the Whole Cake Chateau to check on him."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is possibly based off a galette, a round and flat French cake, which follows the eating/food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}]}