{"sections": [{"title": "Charlotte Katakuri", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Katakuri is the second son and third child of the Charlotte Family and one of the Three Sweet Commanders of the Big Mom Pirates. He is also Totto Land's Minister of Flour (粉大臣, Kona Daijin), governing over Komugi Island, and is the elder triplet brother of Daifuku and Oven."}, {"type": "paragraph", "text": "Due to his actions and role, he is the secondary antagonist in the second half of the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Katakuri is an extremely tall, large, and muscular man with short spiky crimson hair and two symmetric scars on both sides of his face. He stands at nearly three times Luffy's height, and is slightly taller than his younger triplet brothers, Daifuku and Oven, who are incredibly tall themselves. He has long legs, with his thighs being equally as long as his lower limbs. His mouth, which is usually covered up, contains extremely pelican eel-like sharp teeth and is capable of expanding to an enormous size."}, {"type": "paragraph", "text": "He has sharp, intense, crimson eyes, highly arched eyebrows, and prominent lower eyelashes under each eye. He wears a massive light ragged scarf that covers his mouth and reaches his shoulders. He also wears a torn leather vest with CHARLOTTE on the back that exposes most of his torso, dark gloves and pants, a belt with a skull-shaped buckle, and spiked boots with spurs. His torso is very defined, having prominent abdominal muscles covered in pink tattoos, and he wears spiked bracelets on his arms as well as knee pads with a single spike on them."}, {"type": "paragraph", "text": "In the anime, he wore a dark cloak when arriving at the Whole Cake Chateau."}, {"type": "paragraph", "text": "As a child, Katakuri wore a dark torn jacket and dark pants without a scarf. It was only after Brûlée was attacked that he decided to cover his mouth."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Katakuri has a very serious, no-nonsense demeanor, caring greatly about his crew and family's objectives. With his heightened Kenbunshoku Haki allowing him to see a little bit into the future and make smart judgement calls, he is dedicated to efficiently dealing with all possible threats within his vicinity, and is thus among the few Charlotte children that can be seen taking action without instructions from Big Mom herself. This is shown when he quickly dispatched Jigra after foreseeing his assassination attempt on his mother, or when he promptly decided to take out Sanji by himself when he foresaw the original assassination plan failing, not waiting for Big Mom to decide upon what to do. However, this impetuousness can sometimes get the best of Katakuri, as he unwittingly sabotaged Big Mom's plan after acting too fast and Sanji surviving his attempt on his life. Katakuri is able to recognize his shortcomings and will act pragmatically should he realize he is at a disadvantage. He has a tendency to foresee what other people say and respond to them before they actually talk. However, his usual calmness can be shaken when he foresees a horrifying future as seen when he went pale in pure fear of the events lying ahead. He was also extremely worried at the thought of Luffy achieving his level of Haki and therefore tried his best to finish the fight quickly."}, {"type": "paragraph", "text": "He is a very cold individual who puts efficiency above almost everything else, and is considered to be a perfectionist. Unlike some of his siblings such as Charlotte Cracker, he does not brag about his abilities and strength but is rather focused on functioning and achieving his goals as fast as possible. This was seen when he casually intercepted Caesar Clown as well as when he defeated Vinsmoke Ichiji in a quick and effective manner. This attitude was seen again as he prioritized the elimination of Luffy before he could become a serious threat to his mother in the future. Unlike his siblings, Katakuri does not underestimate his enemies as he insisted on remaining aboard the enemy ship for the perfect chance to ambush them, just in case they slipped past his mother. When it comes to fighting, Katakuri seems to be confident in his subordinates' skills and to only interfere when he deems it absolutely necessary. This attitude was first implied when he told his mother that not \"even\" he could prevent the upcoming turmoil caused by the Straw Hats during the wedding ceremony. It was later confirmed when he did not join the fight against Chopper and Brook on the Thousand Sunny. He is also not above giving his enemies compliments as shown when he praised Brook for fighting off several chess soldiers. This was seen again when he complimented Luffy after he managed to drag him into the Mirro-World so he can fight him one-on-one away from his friends. Katakuri does show some degree of pride in his abilities as shown when he believed his power was superior to Luffy in their fight, which also led to him attempting to convince Luffy to give up the duel between them. This was seen again when he angrily cast Luffy's successful attack on him as a fluke and boasted about his powers and Busoshoku Haki being superior to Luffy's. In his arrogance, he lost his composure which allowed Luffy to catch him off-guard and attack him. Also, his bragging of his foresight alerted Luffy of his impending deactivation of Fourth Gear and unintentionally led to Luffy escaping his grasp and leaving Katakuri trapped in the Mirro-World."}, {"type": "paragraph", "text": "He is also capable of extreme brutality as shown when he pondered on how he should maim Luffy with his trident."}, {"type": "paragraph", "text": "Though ruthless to opponents, he is extremely caring towards his family and subordinates, which was revealed when he used his Devil Fruit powers to create ear plugs not only for himself but also for his fellow siblings. This side is shown again when he was quick to rescue his sisters Charlotte Galette from falling off the collapsed Chateau and Brûlée from her captors, though the latter case may have been done to prevent their enemies from using her any further in their plans as he did grab her neck in a threatening way and express his annoyance at how much use they put her to. Regardless, he understood that Brûlée was forced to support the Straw Hats against her will and did not see her actions as treason. This was shown as he later asked her in accompanying him to take out the Straw Hats following their escape. He also showed concern for his brother Charlotte Perospero after he was caught in an explosion. He prevented Luffy from attacking Charlotte Mascarpone and Charlotte Joscarpone, stating that they were his precious siblings. Katakuri also prevented Luffy from attacking Brûlée after she taunted Luffy behind a mirror. Katakuri seems to care for his subordinates as well, which was hinted when he ordered his underlings to retreat back into the Mirro-World after foreseeing that they would be defeated by Luffy."}, {"type": "paragraph", "text": "Like his mother, he is incredibly fond of sweets as he claimed sugar is the source of power. He schedules snack times at the same time each day, which the chefs under him recognize as very important. He expressed visible irritation when Luffy made him 40 minutes late for his snack, though he was willing to tolerate a necessary change in the meal prepared as a result. In fact, his love for sweets is so great that he failed to properly finish off Luffy before indulging himself with his snacks, and did not foresee Luffy barging into his private area until after it happened. Beyond this, Katakuri is extremely private about his eating habits, as he is extremely gluttonous and slovenly, talking to himself in ecstasy about the quality of the food. He loves donuts and enjoys gorging on them since childhood. For this reason, he eats his snacks in solitude, and this is the only time he uncovers his mouth, which he is also very sensitive about and would ruthlessly attack anyone who sees it. When Luffy witnessed him eating and exposed his face, Katakuri became enraged and brutally executed his chefs, who were also nearby. His anger grew when he misinterpreted a chef's comment as being related to the state of his mouth."}, {"type": "paragraph", "text": "Due to how Brûlee got hurt for his pelican eel mouth, Katakuri is very insecure about his appearance and constantly has it hidden from others to make himself look normal. Katakuri is unable to accept anybody seeing what his mouth looks like to the point he refuses to let anyone live after seeing it out of fear of the something similar happening to his family again. However, after his sister Flampe interfered in his fight with Luffy, he willingly showed his full face to her while berating her. This however made her lose all respect for him and she and her subordinates cruelly mocked and ridiculed him for his pelican eel mouth. Though saddened, Katakuri seems to no longer care about his image and instead resolved to not hide his mouth anymore and face Luffy on even grounds, who he acknowledges as a worthy adversary."}, {"type": "paragraph", "text": "Because of his status as the strongest of the Big Mom Pirates and his family worshiping him for his perfect image, Katakuri puts a lot of effort to ensure that image is protected. However, it is shown that Katakuri harbors a lot of stress over the image his family puts on him which is why he tries to have his regular snack time in privacy. Despite suffering his first defeat at the hands of Luffy and having his perfect image destroyed, Katakuri seems to no longer care about his image and choose to embrace his true self."}, {"type": "paragraph", "text": "Katakuri is also a honorable man who dislikes other people interfering with his fights. Though he considers Luffy his enemy and desires to eliminate him personally before he can become a threat, he wishes to defeat him fairly. After discovering that Flampe was the one attacking Luffy and lowering his performance in the fight, Katakuri injured himself in the same spot he injured Luffy to compensate and angrily shouted at Flampe for interfering in his fight and revealed his full face to her to stop her meddling in the duel between men even if it caused Flampe to lose respect for him."}, {"type": "paragraph", "text": "After Luffy gave him his first loss, Katakuri showed no ill will towards him and only stood to simply question him over whether he will return to defeat his mother. When Luffy affirmed this and stated his dream, Katakuri wished his adversary luck in his endeavor."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e2/Katakuri%27s_Gluttony.png/revision/latest/scale-to-width-down/210?cb=20181021130027", "caption": "Katakuri's private snack time, where he gorges on donuts and tea in gluttonous bliss."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/Katakuri_Matchs_Luffy%27s_Wound.png/revision/latest/scale-to-width-down/210?cb=20190113102441", "caption": "Katakuri wounds himself to be on par with Luffy."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Katakuri is shown to be fiercely loyal to his mother as he would not hesitate to eliminate anyone who would threaten her. He supported Linlin's ambitions as shown when he attempted to kill Sanji to begin her plan to assassinate the Vinsmoke Family. When the wedding ceremony was about to get hectic, Katakuri immediately leaped in front of his mother to protect her from harm. He is aware of Linlin's attachment to Carmel's portrait and did everything he could to prevent its destruction. Despite his loyalty and devotion to her, Linlin sees Katakuri as a lowly child of hers and will not tolerate him interfering with her business. Katakuri merely accepts being patronized by his mother but will also explain himself to her as shown when he provided his reason for attacking Luffy."}, {"type": "paragraph", "text": "When Bege attempted to attack his mother with Big Father's cannons, Katakuri clogged up the cannon barrels with mochi, effectively protecting Big Mom while she was vulnerable."}, {"type": "paragraph", "text": "Despite his loyalty towards his mother, when Katakuri questioned Luffy about him becoming strong enough to defeat her, Katakuri wished Luffy the best of luck in his quest."}], "images": []}, {"title": "Siblings", "level": 4, "content": [{"type": "paragraph", "text": "Due to his caring nature, Katakuri is very close with a majority to almost all of his siblings as he provided them with earplugs after they were incapacitated by Big Mom's screams. Katakuri is always prompt to save his siblings if they are in danger. He saved his sister Galette from falling after the Chateau collapsed as she called desperately for him. He also showed concern for his older brother Perospero after he was caught in an explosion. He also prevented Luffy from attacking Mascarpone and Joscarpone, calling them his precious siblings. He also seemed relieved to learn that Perospero survived the explosion caused by Pedro. Katakuri's strength was held with such immense respect and admiration among his siblings that they never fathomed the possibility that he could lose in battle and they were in utter disbelief and complete rage when Brûlée revealed that Luffy defeated him. Oven was enraged that his brother's unbeatable record was broken and tried to kill Luffy only to fail several times."}, {"type": "paragraph", "text": "During their childhood, after Katakuri beat up some bullies who ridiculed his mouth, they took their revenge on Brûlée, scarring her face. Brûlée did not hold any grudge against Katakuri, saying that he was fine the way he is. After unleashing his own revenge, Katakuri started hiding his face to protect his family. After the Sanji Retrieval Team crashed the tea party, he saved Brûlée from her captors but he did hold her in a threatening way after pointing out how her captors used her powers but listened to her pleas of being a hostage. He acted similarly when Luffy attacked Brûlée, protecting her without hesitation. He even warned Luffy to not dare lay a hand on his sister, showing a strong determination to protect her. Brûlée holds Katakuri's strength in high regard, as she proudly bragged about it to Luffy while the Straw Hat captain was struggling in his fight against the Sweet Commander. After Katakuri was defeated, Brûlée was deeply upset and furious of Luffy and she later tended to her brother's wounds. During their talk, it was shown that they have an understanding of each other as Brúlée speculated that Katakuri had fallen willingly on his back, which led to Katakuri confessing that his perfect image was nothing but a lie. When Katakuri asked about Luffy, Brúlée guessed that he would be pleased to know that Luffy escaped Totto Land. Katakuri smirked, confirming her assumption."}, {"type": "paragraph", "text": "Flampe once deeply admired Katakuri and she stated that all of his little sisters have selected him as their favorite brother and that he is also beloved by his fellow brothers. She meddled in his fight with Luffy, wanting to preserve her brother's perfect status and become his favorite little sister. However, when Katakuri caught Flampe's interruption, he went to her and angrily berated her for her meddling actions after stabbing himself with his trident and revealing his full face to her. Flampe's opinion of him immediately turned negative and she even threatened to expose his secret, after which Katakuri willingly knocked her out with Haoshoku Haki so he could have a fair fight with Luffy. Some of Katakuri's siblings such as Perospero, Oven, Daifuku, and Brûlée are already aware of his eel-like mouth, but they never scorned him for it."}, {"type": "paragraph", "text": "When discussing about who should succeed Big Mom in case she was killed, Daifuku believed that Katakuri should be her successor."}], "images": []}, {"title": "Subordinates", "level": 3, "content": [{"type": "paragraph", "text": "Outside of his family members, Katakuri also seems to care for the safety of his subordinates, as he ordered the Chess Soldiers to return to the Mirro-World since he foresaw that they would have suffered a swift and complete beating from Luffy had they remained. As the strongest of the Three Sweet Commanders who exemplifies the image of a dignified and level-headed warrior, he commands great respect and admiration from his subordinates. He acts forgiving to their discrepancies to his perfectionist attitude, as he accommodated to his black tea cooling down due to his battle with Luffy."}, {"type": "paragraph", "text": "While seemingly a strong leader who respects his subordinates in turn, Katakuri goes to great lengths to keep this image, and he keeps his true face out of their sight, eating in solitude. Believing he was eating in a dignified manner to recuperate his nutrition, the patisseries who delivered Katakuri his Merienda became utterly shocked when they inadvertently witnessed his gluttonous and slothful eating manners, shattering their vision of his perfect warrior image. Once exposed, Katakuri brutally executed the chefs, and even misinterpreted one of their pleas as a comment to his mouth, which resulted in him acting even more violent towards them. However, despite this previous demeanor, Katakuri did not mind showing his full face to Flampe and his fan club and he was content at just knocking them out, knowing full well that they were going to expose his secret."}, {"type": "paragraph", "text": "Upon hearing of Katakuri's defeat at the hands of Luffy, the crew stationed outside of the Mirro-World were furious and tried to kill Luffy in revenge, incorrectly accusing him of using underhanded methods to win."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Capone Bege", "level": 4, "content": [{"type": "paragraph", "text": "Initially, Katakuri seemed very respectful towards Bege as he prevented two of the latter's crew mates from being killed by Jigra before the ceremony. However, their encounter quickly becomes standoffish when Bege questioned the reasoning behind Katakuri's actions. As Katakuri explained his reason for killing Jigra, he also reminded Bege of his rank as a Rook. When the Straw Hats caused trouble for the wedding, Bege pinned Luffy down before noticing that Katakuri had foreseen a terrible future. When the Sweet Commander ordered him to kill Luffy, Bege refused and instead ordered his allies to put in their earplugs to avoid Big Mom's screams. Katakuri realized Bege's betrayal when he attempted to shoot him but he was unharmed. He tried but failed to prevent Luffy from showing Carmel's broken picture to Big Mom. After Bege's assassination attempt on Big Mom failed, Katakuri created earplugs for his siblings, enabling them to regain their composure, which forced Bege to transform into a giant fortress to save himself and his allies. As Caesar was helping Bege and his allies escape, Katakuri tried to stop them. After Bege and his allies successfully escaped the castle, Katakuri immediately formed a team to pursue them."}], "images": []}, {"title": "Sanji Retrieval Team", "level": 4, "content": [{"type": "paragraph", "text": "Katakuri made an enemy out of the Straw Hats when he attempted to kill Sanji himself after he foresaw Pudding's failure in her task and Sanji dodging the priest's shot. However, his own attempt on Sanji's life failed, earning him a glare from the Straw Hat Cook and the only thing he could do next was to prepare for the chaos caused by the duplicates of Luffy. After Bege's assassination attempt on Big Mom failed, Katakuri assisted his siblings in cornering the Straw Hats and their allies. As Caesar was helping the Straw Hats escape the venue, Katakuri wasted no time in hindering their escape. After the Straw Hats and their allies successfully escaped the castle, Katakuri immediately assembled groups and planned to pursue them. Along with his brother Perospero, he was confronted by Brook and Chopper when they returned to the Thousand Sunny. As Chopper and Brook fought to retake the Sunny, Katakuri simply complimented Brook for his strength. When the rest of the crew returned, Katakuri was not surprised. After Pedro severely injured Perospero in a suicide explosion, Katakuri tried to prevent the Straw Hats' escape until Luffy pulled him into the Mirro-World."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "During the Tea Party, Katakuri was a huge hindrance to Luffy's efforts to facilitate Bege's assassination plan as he tried to stop Luffy from exploiting Big Mom's weakness."}, {"type": "paragraph", "text": "After Luffy and his group escaped the chateau, Katakuri led a pursuit team after them, swearing to personally eliminate Luffy before he can become a threat to his mother and later insisted on staying on the Straw Hat's ship to ambush them just in case they escaped his mother."}, {"type": "paragraph", "text": "After Luffy dragged him into the Mirro-World to keep him from preventing his friends' escape, the two fought each other in a fearsome clash. Initially, Katakuri was patronizing and informative towards Luffy's many efforts to defeat him. Despite believing that Luffy had no chance of defeating him, he developed some respect for Luffy as he remarked on Luffy's skill in his dodging that resorted to Katakuri using his awakened powers. Though he claimed that he was not underestimating Luffy, he failed to properly finish off Luffy before indulging himself with sweets. However, after Luffy interrupted his snack time and exposed his face as well as his sloppy eating manners, Katakuri regretted not making sure Luffy was dead. Enraged, Katakuri resumed his attempt to kill Luffy for good. However, in his anger, Luffy was able to hit him and Katakuri challenged Luffy's claim of finding out his weakness. When Luffy briefly gained the upper hand, Katakuri's respect for him seems to have grown as he commended Luffy for being able to injure him and commented that he understood how he was able to overcome his younger brother Cracker. However, after he disrupted Luffy's attacks, he promised to not allow him to gain the advantage again. When Luffy retreated from the battle due to the time limit of his Gear Fourth, Katakuri pursued him, not willing to let him get away, but Luffy managed to escape the Mirro-World before Katakuri could catch him. While he was resting, Luffy declared his intention to surpass Katakuri and later returned to confront him again as the latter was impressed by his bravery. He also seems to be worried of Luffy's potential as he was shaken by the thought of the latter achieving his level of Haki and tried his best to finish the fight quickly."}, {"type": "paragraph", "text": "Even though he wanted to end Luffy before he could become a threat, Katakuri wanted to defeat him honorably as shown when he disapproved of Flampe's meddling and even injured himself to make the fight more fair. He even apologized to his enemy for his sister's actions as they use Haoshoku Haki to knock out Flampe and her subordinates as punishment. As they resumed their battle, Katakuri told Luffy that he no longer saw him as below his level. At the end of their clash, Katakuri failed in his promise to kill Luffy as the latter defeated him. Afterwards Katakuri briefly stood up to talk with Luffy who told him that he'd return to beat Big Mom and become Pirate King and Katakuri, believing Luffy, wished him good luck in his dream before losing consciousness. As he laid beaten, Luffy showed some respect to his downed adversary by covering his mouth with his extra hat before leaving. After Brûlée informed him that Luffy escaped Totto Land, Katakuri smiled at the news."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Katakuri_and_Luffy.png/revision/latest/scale-to-width-down/210?cb=20180925230400", "caption": "Katakuri towering over Luffy"}]}, {"title": "Vinsmoke Family", "level": 4, "content": [{"type": "paragraph", "text": "Since Katakuri took part in Big Mom's plan to assassinate the Vinsmoke Family, he is an enemy of the family. His failed attempt to kill Sanji alerted the family of Big Mom's treachery though they were restrained before they could do anything. As the Straw Hats were causing chaos at the wedding, Katakuri told his elder brother to kill the Vinsmokes immediately, which ended up in failure. When the Vinsmokes fought against the Big Mom Pirates to help the Straw Hats and Fire Tank Pirates escape from the wedding venue, Katakuri easily defeated Ichiji in combat. However, he was prevented from killing him due to the destruction of the Whole Cake Chateau. After the Vinsmoke Family and their allies escaped from Big Mom's castle, Katakuri formed three pursuit teams to chase them."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Sweet Commander, Katakuri's authority in the Big Mom Pirates is second only to his mother's. As the Minister of Flour, Katakuri has authority over Komugi Island in Totto Land. His bounty of 1,057,000,000 proves that the World Government views him as an extremely dangerous threat, and even Capone Bege of the infamous Worst Generation considers him a monstrous threat. According to his crewmates, he is the strongest of the Three Sweet Commanders, and the most capable member of the entire crew aside from Big Mom herself. Even as a child, his strength was compared to that of a \"monster\". Until his first loss against Luffy, he had never lost a single battle throughout his life and his long perfect record of victory was described by Oven as \"legendary\". Daifuku holds Katakuri in high regard, as he states that Katakuri's skill makes him worthy of succeeding Big Mom as captain of the Big Mom Pirates if she died."}, {"type": "paragraph", "text": "Katakuri possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream though he was immobilized until he covered his ears with mochi earplugs."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Noted to be the strongest of the Three Sweet Commanders, Katakuri possesses tremendous physical strength, being able to flick jelly beans with such extreme force and velocity that they act like bullets. Even from a very far distance, Katakuri can kill a man standing atop a gigantic wedding cake with a flicked jellybean. He was also able to defeat Vinsmoke Ichiji, a genetically enhanced commander of the Germa 66 who was wearing his Raid Suit, with minimal effort and without incurring any injuries himself. Katakuri is an extremely skilled and powerful hand-to-hand fighter. Supplemented with his Devil Fruit powers, he uses a fighting style similar to Luffy's Gomu Gomu no Mi techniques, and he can counter Luffy's Red Hawk without any effort. With his own version of Luffy's Elephant Gun, he overpowered and badly injured Luffy in a clash of strength. When he performed his Zan Giri Mochi attack, he was able to create a large crater in the ground when he sent Luffy crashing through the Mirro-World."}, {"type": "paragraph", "text": "Katakuri is extremely fast and possesses extraordinary reflexes. Due to his speed in launching his attacks, an expert Kenbunshoku Haki user such as Luffy barely had time to react to them. He is able to keep up with the speedy mink Carrot, as well as the blinding speed of Luffy's Gear Second attacks, catching both Carrot and Luffy off-guard with swift and powerful kicks. He was even able to keep up with Luffy's Gear Fourth Snakeman form, and even outpace him on a few occasions."}, {"type": "paragraph", "text": "Katakuri possesses a tremendous amount of durability and endurance, being able to withstand multiple immensely powerful attacks from Gear Fourth Luffy and quickly recover to counterattack. He was also able to impale himself with his own spear and showed only minor signs of discomfort."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c7/Katakuri_Gatling.png/revision/latest/scale-to-width-down/210?cb=20180826232941", "caption": "Katakuri's similar fighting style to Luffy."}]}, {"title": "Spearmanship", "level": 3, "content": [{"type": "paragraph", "text": "Katakuri wields a trident named Mogura in battle. He was first seen wielding it during Sanji and Charlotte Pudding's wedding ceremony. When not in use, he keeps the trident inside his mochi body.  Katakuri is extremely skilled in wielding his trident Mogura, which he uses in conjunction with his Devil Fruit powers and physical prowess to perform devastating thrusts."}, {"type": "paragraph", "text": "When he was younger, he used a trident with a much simpler design."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Mogura_Infobox.png/revision/latest/scale-to-width-down/150?cb=20180624025358", "caption": "Katakuri wielding Mogura."}]}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Katakuri's tremendous physical strength and accuracy allows him to act as a sniper and marksman. Katakuri is highly skilled in flicking jelly beans as improvised bullets with great accuracy. He could hit Jigra in the head from so far away that Bege did not even notice him, and later would have hit Sanji as well had the latter not dodged at the last moment. He can even shoot several jelly beans at once to hit multiple targets simultaneously."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Katakuri ate the Mochi Mochi no Mi, a special Paramecia-type Devil Fruit that lets him create, control, and transform into mochi at will. His mochi is extremely thick and adhesive, allowing him to trap even extremely strong enemies with it, although it loses its effectiveness when exposed to moisture. The fruit allows Katakuri to transform his body to avoid attacks like a Logia user, as shown when he transformed himself into mochi when being struck by Capone Bege's bullets, and with the help of his Kenbunshoku Haki, he is even capable of manipulating his body structure to dodge Haki-imbued attacks and remain unharmed. He is very creative when using his fruit, as he used mochi to create earplugs to protect himself and his siblings from the sound of Big Mom's scream, and also used it to plug up and disable the cannons of Bege's Big Father fortress."}, {"type": "paragraph", "text": "He frequently uses these abilities in hand-to-hand combat, sprouting several tendrils of mochi on his body to act as extra fists or legs; he can imbue these tendrils with Haki to deliver hard punches and kicks. By concentrating mochi into a single fist, Katakuri is capable of delivering punches of devastating power."}, {"type": "paragraph", "text": "Katakuri has also awakened his Devil Fruit powers, enabling him to transform inorganic material into mochi, enhancing the range of his attacks and capture field."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2c/Mochi_Mochi_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20180506061805", "caption": "The Mochi Mochi no Mi in use."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Katakuri is one of the very small number of people in the world who can use all three types of Haki."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Katakuri has extraordinary mastery of Kenbunshoku Haki, able to use an advanced form of Kenbunshoku which allows him to see slightly ahead into the future. He was able to detect and instantly thwart an assassination attempt on Big Mom and her affiliates that would have been carried out moments later by a vengeful guest invitee. His predictions were shown to be accurate when he justified his killing of the guest to Bege and knew word for word how the latter would respond to him. He would later repeat this capacity during his one-on-one battle against Luffy, accurately predicting the latter's intent to keep on fighting and eventually resorting to the use of Gear Fourth. He even correctly foresaw that Pudding breaking down crying during the wedding ceremony at the wedding altar and also Luffy's intentions to break Carmel's portrait. Bege recognized him as the greatest obstacle to his own assassination plan. Katakuri can use his precognition to increase the accuracy of his attacks to such a degree that Luffy, who is a highly skilled Kenbunshoku Haki user himself, could barely dodge his assaults."}, {"type": "paragraph", "text": "The future events Katakuri sees can be changed, which he often attempts to do so himself, as shown when he prevented Jigra from carrying out the assassination plot he foresaw. However, changing the future may not solve anything, or may even make things worse, as shown when he tried to shoot Sanji. Other people are also capable of changing the foreseen future. Also, he is unable to see the cause of his foresight, as he was confused as to why Pudding was crying at the altar."}, {"type": "paragraph", "text": "Katakuri can use his Haki in conjunction with his Devil Fruit power to great effect. Since he can see slightly into the future, he can predict precisely where an attack will land, allowing him time to dissolve his mochi body out of harm's way, making attacks simply pass through him. Since he is physically dodging the attack and preventing it from coming into contact with him in the first place, even attacks imbued with Busoshoku Haki will pass through him without harming him. With this ability, Katakuri is nearly untouchable, and he has stated that it had been years since someone laid a hand on him before Luffy managed to do so. Katakuri's Haki can only be nullified if he stops being calm and collected, or if he faces an opponent whose level of Kenbunshoku Haki rivals or surpasses his own."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Katakuri%27s_Future_Sight.png/revision/latest/scale-to-width-down/210?cb=20180701143920", "caption": "Katakuri sees into the future."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/60/Katakuri%27s_Logia-Like_Effect.png/revision/latest/scale-to-width-down/210?cb=20181014025944", "caption": "Katakuri's Haki allows him to change his body shape and replace the attacked areas with mochi."}]}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Katakuri is an extremely powerful Busoshoku Haki user, as shown when he hardened his mochi leg in order to bludgeon and injure Luffy. His Haki enhanced strikes are powerful enough to counter and overpower Luffy's own Haki enhanced attacks, and he has boasted that his Busoshoku Haki is superior to Luffy's. When performing his Zan Giri Mochi attack, Katakuri's Haki becomes flame-shaped, like Big Mom's Haki and Luffy's Haki when he uses Gear Fourth, and the luster of it is blue."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f7/Katakuri%27s_Flame_Haki.png/revision/latest/scale-to-width-down/210?cb=20190205080959", "caption": "Katakuri's Busoshoku Haki taking the shape of flames."}]}, {"title": "Haoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Katakuri is able to use Haoshoku Haki, as shown when he released a large burst along with Luffy's own Haoshoku Haki in order to knock out Charlotte Flampe and her subordinates as punishment for their interruption."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Katakuri%27s_and_Luffy%27s_Haoshoku_Haki_Clash.png/revision/latest/scale-to-width-down/210?cb=20190113033328", "caption": "Katakuri's blast of Haoshoku Haki clashes with Luffy's."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Katakuri was born as the second son of Charlotte Linlin and the third child of the Charlotte Family. Along with Daifuku and Oven, they make up a set of triplets, with Katakuri being the oldest of the three. At the age of two, Katakuri tasted donuts for the first time and it became his favorite food."}, {"type": "paragraph", "text": "At the age of three, Katakuri's fast eating habits caused the size of his mouth to greatly expand and tore his cheeks apart, leaving deep scars on the sides of his mouth. As a result, he was shunned and ostracized by others due to his appearance, but he was strong enough to fend off his bullies, making them run away in fear. Some of his siblings such as Perospero, Oven, Daifuku, and Brûlée do not scorn him, though Perospero once told Katakuri that he would be able to make friends if he hid his eel-like mouth. When Katakuri was five, he obtained and ate the Mochi Mochi no Mi Devil Fruit."}, {"type": "paragraph", "text": "When he was ten-years-old, some bullies that Katakuri beat up took revenge by cutting Brûlée's face. Angered, Katakuri retaliated and attacked the bullies. Having blamed his naivete for the attack on Brûlée, Katakuri decided to become a ruthless and cold man to make everyone fear him so he could protect his siblings and family, which included hiding his mouth with a scarf since then."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/30/Katakuri%27s_Past.png/revision/latest/scale-to-width-down/210?cb=20190113032955", "caption": "Katakuri being shunned as a child."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the day before the wedding of Charlotte Pudding and Sanji, Katakuri and Charlotte Smoothie reported to the Whole Cake Chateau."}, {"type": "paragraph", "text": "On the wedding day, Katakuri was on the roof of the Whole Cake Chateau as a man named Jigra attempted to get into the wedding without going through a body check. Katakuri, seeing that Jigra actually intended to take revenge on Big Mom and attack the venue, shot the man down as he was talking to Capone Bege. Katakuri asked Bege if he thought it was wrong of him to do that and told him to tell Big Mom that it was his judgement to kill Jigra."}, {"type": "paragraph", "text": "After the wedding began, Katakuri was eating and getting acquainted with some guests. While Pudding and Sanji stood on the altar, Katakuri foresaw Pudding breaking down in tears, much to his confusion. When that event happened, Big Mom signaled the priest to assassinate Sanji. Knowing that Sanji would dodge the shot, Katakuri tried to kill Sanji himself by launching a jellybean at him. However, to his surprise, Sanji managed to evade the attack and it hit the priest instead with Sanji glaring at Katakuri for his action. Having failed to kill Sanji, Katakuri then stood close to Big Mom, preparing for the chaos that was going to happen."}, {"type": "paragraph", "text": "As duplicates of Monkey D. Luffy were unleashed into the venue, the real Luffy attempted to break the photo of Carmel. Katakuri stopped him with his Devil Fruit powers and immobilized him. When Big Mom was accusing him of interfering with her business, Katakuri informed her of Luffy's intentions before demanding to know how Luffy knew about the photo. Jinbe then freed Luffy using black tea before claiming that he was the one who told Luffy about the photo."}, {"type": "paragraph", "text": "In the ensuing conflict, Katakuri foresaw a horrific future and approached Luffy and Bege. He ordered Bege to kill Luffy, but the latter outright refused before initiating his plot to assassinate Big Mom. As Katakuri went after Luffy, he told his older brother Perospero to kill the captive Vinsmoke Family. Bege tried to hold Katakuri back by shooting him, but the bullets had no effect on him due to his Devil Fruit powers and Katakuri realized his treachery. He bypassed Bege as Jinbe and Pedro tried to attack him, but he managed to get past them and used his ability to pin Luffy down. However, despite his efforts, Luffy managed to show Carmel's broken portrait to Big Mom, causing her to start screaming, which incapacitated Katakuri in the process."}, {"type": "paragraph", "text": "After Bege's assassination attempt failed, Katakuri created earplugs with his powers and distributed them to his siblings. They then surrounded Luffy, Bege, and their allies before Bege transformed into a giant fortress. As Luffy's group and the Vinsmoke Family ran into the fortress, Katakuri used his ability and grabbed Brûlée from Caesar's back. He then used his jellybean bullets to attack several members of the Fire Tank Pirates. Katakuri later used his ability to plug the cannons in Bege's fortress, preventing them from firing at Big Mom. Waiting with his siblings for their enemies' next move, Katakuri remarked to Brûlée on how her captors used her in their plan, but she replied that she was the victim and told him to make their enemies pay. While the Straw Hats, Fire Tank Pirates, and Vinsmoke Family were hiding inside Bege's fortress, Katakuri commented on how they made a mess of the wedding as Big Mom assaulted the fortress. Right after Bege deactivated his Big Father form and the Vinsmoke Family appeared, the Big Mom Pirates attacked them with a volley of bullets, but Vinsmoke Ichiji and Niji blocked them with their capes."}, {"type": "paragraph", "text": "As Caesar Clown flew Bege away from the venue, Katakuri stood in their way. Ichiji leaped in and attacked Katakuri, but Katakuri used his Devil Fruit power to split in two. He quickly defeated Ichiji, but as this happened, the Tamatebako exploded at the foot of the Whole Cake Chateau and caused it to topple. The Big Mom Pirates were saved when Streusen used his Devil Fruit power to turn the whole castle into a cake. However, the Straw Hats, Bege's crew, and the Vinsmokes escaped during the chateau's destruction. Katakuri then told his younger brother Daifuku to form two pursuit teams to go after the Straw Hats and Fire Tank Pirates."}, {"type": "paragraph", "text": "Katakuri then stood with his siblings and crew, reflecting on the recent events to find answers. After solving a few of them, Katakuri was then told by Daifuku that the pursuit groups had assembled to go after the Straw Hats, Fire Tank Pirates, and Germa. Katakuri was pleased to hear this and told Brûlée to accompany him in pursuing the Straw Hats. He planned to kill Luffy before he could become a serious threat in the future. Before he could act, Katakuri was alerted by Smoothie to run and was shocked to see Big Mom rampaging through the city while holding Opera. Katakuri watched as Perospero managed to get her attention and succeeded in luring her away to pursue the Straw Hats by promising another wedding cake. Katakuri began worrying about the island being destroyed after Big Mom realized Perospero's deception as Pudding arrived, promising to solve the problem by making another cake."}, {"type": "paragraph", "text": "Using Brûlée's ability to travel through mirrors, Katakuri and several subordinates infiltrated the Thousand Sunny. Despite believing that being chased by Linlin herself meant that the Straw Hat Pirates would have absolutely no chance of escaping alive, Katakuri nevertheless decided to wait for the Straw Hats onboard their ship so he could ambush them should they return. He was later joined by Perospero when Chopper and Brook returned to the ship with the Shark Submerge III. While Brook and Chopper fought the Chess Soldiers on the Sunny's deck, Katakuri simply stood back and commented on Brook's strength. Perospero then immobilized the two Straw Hats and prepared to turn them into candy, but Katakuri noticed that Big Mom was coming and still chasing after the Straw Hats. Katakuri then ordered the Big Mom Pirates on the ship to retreat, having foreseen that Luffy would defeat them. After Perospero failed to block the Straw Hats' path, Luffy came in and attacked, and Katakuri parried his punch. The two began fighting for the ship, and Katakuri eventually managed to catch Luffy's arm and then hit him with a Haki-clad punch."}, {"type": "paragraph", "text": "After Pedro engulfed Perospero in his suicidal explosion, Katakuri worried for his brother and was in disbelief at the event. When the Sanji Retrieval Team made final preparations for their getaway, Katakuri charged at them. Carrot attempted to attack Katakuri, but he easily subdued her. Luffy then grabbed the Sweet Commander and dragged him into the Mirro-World. Once there, he complimented Luffy's strategy as Luffy smashed the mirror to the Sunny and the two stared each other down as they prepared to continue their fight."}, {"type": "paragraph", "text": "As the Sunny fled from Big Mom and her fleet, Luffy and Katakuri commenced their fight, with Katakuri claiming that he had Luffy outmatched in both speed and power. After Luffy attacked with Hawk Gatling, Katakuri countered with several mochi tendrils hardened into fists, before proceeding to warn Luffy that anything Luffy could do, he could do it better. Luffy then asserted that rubber would never lose to mochi, but his subsequent Hawk Stamp was dodged and Katakuri kicked him into a wall. Luffy then tried using Elephant Gun, but Katakuri created an even larger fist and pushed Luffy into the wall with tremendous power, overwhelming Luffy."}, {"type": "paragraph", "text": "With Luffy lying on the floor, Katakuri made contact with Perospero (who survived the explosion) and confirmed the situation with Big Mom and the other Straw Hats. Katakuri then ordered Brûlée to find another mirror on the Sunny and use the portal to set the Sunny on fire. After Joscarpone and Mascarpone arrived with a mirror, Luffy rushed towards them, but Katakuri stopped him and reminded him of his promise to fight one-on-one. Katakuri then resumed attacking Luffy, warning him not to lay a hand on his younger brothers and sisters. After overpowering Luffy, Katakuri was told by Perospero that Big Mom sunk the Thousand Sunny. As his siblings were puzzled by the mirrors to the Sunny breaking one after another, Katakuri noticed Luffy running away. Katakuri then further assaulted Luffy and prepared to kill him. As Katakuri continued to have the upper hand, Brûlée taunted Luffy by boasting of her brother's reputation of the perfect being. Luffy then tried to punch her, but Katakuri grabbed his fist and slammed him into a wall. After pondering on how he should maim Luffy, Katakuri then began to attack with his trident Mogura. In the midst of this, Katakuri noted on how Luffy dodged his strikes more so than anyone and revealed his awakened powers to trap the Straw Hat captain."}, {"type": "paragraph", "text": "As Luffy was restrained, he prepared to resort to using Gear Fourth, but Katakuri had no desire to watch him power up and prevented Luffy from activating it by engulfing him with mochi. Growing tired of their battle making his snack time late, Katakuri turned much of the surrounding Mirro-World into mochi and piled it onto Luffy in order to suffocate him. Believing that their battle was finished, Katakuri called his three chefs, who arrived to bring Katakuri's snack to him. Katakuri then created a mochi house to consume his sweet treats and iced tea in private. As he gorged on giant donuts, Luffy broke into his house after eating his way out of the mochi and saw him in the state of eating. This made Katakuri furious, and he quickly dispatched his chefs before attacking Luffy, overwhelming him with strong Busoshoku Haki. However, Luffy managed to land a kick on Katakuri's jaw, and Katakuri was incredulous when Luffy stated he had figured out his weakness. Luffy then activated Gear Fourth and struck Katakuri with Kong Gun, which Katakuri blocked."}, {"type": "paragraph", "text": "Luffy gained the upper hand against Katakuri, landing several Gear Fourth attacks on him. However, once Katakuri regained his composure, he resumed dodging Luffy's attacks and landed a powerful strike on Luffy, knocking him back. Having the advantage again, Katakuri went on the offensive, but when he mentioned that Luffy would deflate, Luffy realized that his Gear Fourth would wear out soon and retreated. Katakuri chased after Luffy as he was fleeing after his Gear Fourth wore out. Unfortunately for Katakuri, Luffy came across Brûlée, grabbed her, and escaped the Mirro-World, leaving Katakuri behind before he could catch him. He later wandered the Mirro-World, searching for any signs of Luffy. Eventually, Luffy returned to confront Katakuri and they clashed once again."}, {"type": "paragraph", "text": "Though Katakuri pummeled Luffy many times, the latter kept getting back up. When Luffy attempted to counter against his giant mochi fist, Katakuri noticed that Luffy was beginning to see into the future just like him. He then tried to deter Luffy from continuing the fight, but Luffy refused to give up. Knowing that Luffy's Kenbunshoku Haki was improving, Katakuri tried to end the battle quickly and used his Mochi Tsuki to deal a devastating blow to Luffy. Unbeknownst to Katakuri, Luffy's focus was broken after he was shot in the leg by Charlotte Flampe, and the Sweet Commander took advantage of this as he pummeled Luffy. Suspicious of Luffy's sudden loss of focus, Katakuri heard Flampe's laughing and realized what had happened. He approached her and while Flampe was flying towards him in joy, Katakuri stabbed himself with Mogura in the same place he stabbed Luffy. He then removed his scarf and loudly berated her for interfering in his fight. Distraught, Flampe began mocking his mouth and told her subordinates to photograph him, but Katakuri paid little mind to them as he returned to face Luffy."}, {"type": "paragraph", "text": "The two unleashed a wave of Haoshoku Haki, knocking out Flampe and her subordinates. Katakuri prepared to resume fighting Luffy, now thinking of him as an equal. They continued to trade blows with each other and as they were getting worn out from the battle, Katakuri watched as Luffy activated another variation of Gear Fourth: Snakeman. With his increased speed and ability to home in on his target, Luffy was able to land more hits on Katakuri. However, Katakuri countered with his spiked mochi attacks. After trading more blows with each other, both fighters claimed that they would end the battle before engaging in a massive clash."}, {"type": "paragraph", "text": "After the clash, Luffy's Gear Fourth wore off and he fell down as the floor collapsed under him from the impact of Katakuri's attack, right before Katakuri collapsed. As Luffy later climbed out of the hole, Katakuri briefly stood up and asked Luffy if he would return to defeat Big Mom. Luffy replied that he would in order to become the Pirate King. Amused by this answer, Katakuri commented on this by saying that Luffy was looking pretty far into the future and once again collapsed and fell unconscious. Defeated, his mouth was covered by Luffy before the Straw Hat captain departed."}, {"type": "paragraph", "text": "He later woke up with Brûlée beside him tending to his wounds. She took notice that he intentionally fell on his back, and Katakuri confessed that the rumor of him never lying on his back was false. She then admitted that she always knew the truth as she had seen him through the mirrors. Katakuri asked her what became of the Straw Hats and he smirked after she explained that they escaped their territory."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/79/Jigra%27s_Death.png/revision/latest/scale-to-width-down/210?cb=20180401031937", "caption": "Katakuri shoots Jigra down after foreseeing his assassination attempt."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Katakuri_Busoshoku_Haki_Logia_Form.png/revision/latest/scale-to-width-down/210?cb=20180422032301", "caption": "Katakuri restrains Luffy with his Devil Fruit powers and Busoshoku Haki."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/The_Big_Mom_Pirates_confronts_the_Straw_Hat_and_Fire_Tank_Alliance.png/revision/latest/scale-to-width-down/210?cb=20170612034527", "caption": "The Big Mom Pirates confront the Straw Hat and Fire Tank Alliance."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Katakuri_Defeats_Ichiji.png/revision/latest/scale-to-width-down/210?cb=20180624025523", "caption": "Katakuri defeats Ichiji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/28/Luffy_vs._Katakuri.png/revision/latest/scale-to-width-down/210?cb=20180812020426", "caption": "Katakuri clashes with Luffy as the Straw Hats try taking back the Sunny."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Katakuri_vs._Luffy_Elephant_Gun.png/revision/latest/scale-to-width-down/210?cb=20180902023710", "caption": "Katakuri and Luffy clash inside the Mirro-World."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b9/Luffy_Sees_Katakuri_Eating.png/revision/latest/scale-to-width-down/210?cb=20181007180541", "caption": "Luffy intrudes on Katakuri's snack time."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bd/Katakuri_Wounds_Luffy.png/revision/latest/scale-to-width-down/210?cb=20190106034504", "caption": "Katakuri strikes Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Luffy_and_Katakuri%27s_Final_Clash.png/revision/latest/scale-to-width-down/210?cb=20190127034213", "caption": "Katakuri and Luffy meet in a final clash."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Luffy_Defeats_Katakuri.png/revision/latest/scale-to-width-down/224?cb=20190203031504", "caption": "Katakuri defeated."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/99/Br%C3%BBl%C3%A9e_Tends_to_Katakuri%27s_Wounds.png/revision/latest/scale-to-width-down/210?cb=20190324031808", "caption": "Brûlée tends to Katakuri's wounds."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Katakuri vs. Capone Bege, Jinbe, and Pedro", "elements": []}, {"text": "Katakuri, Charlotte Linlin, and Charlotte Perospero vs. Bege", "elements": []}, {"text": "Katakuri vs. Vinsmoke Ichiji (unseen in the manga)", "elements": []}, {"text": "Katakuri vs. Monkey D. Luffy (Thousand Sunny)", "elements": []}, {"text": "Katakuri vs. Carrot", "elements": []}, {"text": "Katakuri vs. Monkey D. Luffy (Mirro-World)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Katakuri vs. Vinsmoke Judge", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Katakuri is given an earlier introduction in the anime, where he was shown arriving at the Whole Cake Chateau. In the manga, he was first shown at the opening of the Tea Party. "}, {"type": "paragraph", "text": "Katakuri's Haki while performing Zan Giri Mochi does not have the light blue luster in the anime as it does in the manga. In the anime it is a regular dark blue luster like most characters."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}, {"text": "One Piece Pirate Warriors 4", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: World Seeker", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Katakuri is the Japanese name for the Erythronium japonicum. The word \"katakuriko\" originally referred to the starch of this plant. This follows the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}, {"text": "The name \"Katakuri\" may also taken from the word \"katakuriko (片栗粉)\" which means \"potato starch\".", "elements": []}, {"text": "Katakuri's extreme gluttonous side, hair color, and scarred mouth is similar to Zebra from the Toriko series.", "elements": []}, {"text": "Katakuri shares his voice actor, Tomokazu Sugita, with Joseph Joestar from the anime JoJo's Bizarre Adventure, who also possesses the ability to predict what his opponents will say; and with Sakata Gintoki from anime Gintama, who is also a glutton for sweet food.", "elements": []}, {"text": "Katakuri's style of clothing may be inspired by American biker gang fashion, which is often distinguished by its usage of cropped leather vests, tattoos, belts, and decorative motorcyclist spurs.", "elements": []}, {"text": "Katakuri's defeat is similar to Senor Pink's as both of their opponents showed a sign of respect before walking away the victor. Franky wiped off Senor Pink's tears and Luffy covered Katakuri's mouth (which Katakuri is sensitive about).", "elements": []}, {"text": "Katakuri's favorite food is doughnuts.", "elements": []}]}], "images": []}]}