{"sections": [{"title": "Charlotte Dolce and Dragée", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Dolce and Charlotte Dragée are the 45th and 46th sons and the 83rd and 84th children of the Charlotte Family, being the two youngest sons of Charlotte Linlin."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dolce and Dragée are young identical-looking boys who have a round body shape and wear formal pink shirts with striped pants. They are usually seen hanging on to balloons."}, {"type": "paragraph", "text": "Dolce wears lavender pants with purple stripes, while Dragée wears light green pants with dark green stripes."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Dolce and Dragée are very fond of balloons and often hang from them for fun. He and his brother detest to see them pop, which is one of the reasons they hate their sister Anana, who they view as a psychopath due to her sinister love of knives and mutilation."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "While Charlotte Linlin was heading to meet the Vinsmoke Family, Anana came up to her, saying that the head chef would not give her knives to mutilate her stuffed animal. Linlin told her sons, Dolce and Dragée, to get the knives for her. The two boys objected, saying that Anana would pop their balloons."}, {"type": "paragraph", "text": "The next day, Dolce and Dragée were on the third floor of the Whole Cake Chateau during Pudding and Sanji's wedding. When the Tamatebako exploded and caused the Chateau to topple, Dolce and Dragée were seen floating around while everyone else was panicking."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dolce is the Italian world for \"sweet\" and Dragée is the name of a sugarcoated nut or candy in the shape of a bead. This follows the eating/food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}, {"text": "They seem to be based on Tweedle Dee and Tweedle Dum from Alice in Wonderland.", "elements": []}, {"text": "Dolce was ranked by his older siblings as their third-favorite younger brother, behind Anglais and Newgo.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 845 (p. 7) and Episode 809, Dolce and Dragée debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90 (p. 156), Charlotte family information revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga — Vol. 87 Chapter 872.", "elements": []}]}], "images": []}]}