{"sections": [{"title": "Clione", "level": 1, "content": [{"type": "paragraph", "text": "Clione is a member of the Heart Pirates. His name was revealed in SBS Volume 83."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Clione is a man of average size with brown hair, although only the bangs can be seen as his head is covered by a long dark blue blue hood that has a tip at the end. Like most members of the Heart Pirates, he wears a white boiler suit with the crew's Jolly Roger on the left breast."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Along with Ikkaku and Uni, Clione was against the idea of allying with the Straw Hat Pirates, thinking of their assistance as worthless."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Clione wields a sword, though has not been seen using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "A month before Trafalgar Law formed an alliance with the Straw Hat Pirates, Clione and the other Heart Pirates went to Zou and were left under the watch of Nekomamushi. Clione, Ikkaku, and Uni were against forming the alliance, but they were outvoted."}, {"type": "paragraph", "text": "When the Beasts Pirates, led by Jack, invaded Zou in search for Raizo, the Heart Pirates fought alongside the Mink Tribe."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Law arrived at Zou around a week later, the Heart Pirates happily reunited with their captain when he came into the Whale Forest."}, {"type": "paragraph", "text": "That night, the Heart Pirates briefly met and greet Monkey D. Luffy before Law went to have a private conversation with the Straw Hats. The Guardians later threw a party for the Straw Hats that lasted throughout the night, which the Heart Pirates joined in."}, {"type": "paragraph", "text": "The next day, the Heart Pirates, some of the Straw Hats, Kin'emon, Kanjuro, and Raizo prepared to depart Zou for Wano Country on the Polar Tang."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Heart Pirates later infiltrated Wano Country. After Law was captured to free Bepo, Shachi, and Penguin, the Heart Pirates gathered in Ebisu Town and discussed about their captain's situation."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Clione is a genus of sea slugs.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 81 Chapter 810 (p. 12) and Episode 757, Clione appears for the first time.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 83 (p. 42), Clione's name is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 70 Chapter 700 (p. 10) and Episode 629, Law confirm the Heart Pirates whereabouts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 81 Chapter 810 (p. 14) and Episode 759, The Heart Pirates status while on Zou is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 81 Chapter 807 (p. 15) and Episode 757, Law and the Heart Pirates reunite.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 82 Chapter 822 (p. 5) and Episode 776, The Ninja-Pirate-Mink-Samurai Alliance divided.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 951 (p. 5-7).", "elements": []}]}], "images": []}]}