{"sections": [{"title": "Diesel", "level": 1, "content": [{"type": "paragraph", "text": "Diesel is a Longarm and member of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Diesel is a tall man with rather thin legs and a tiny mustache. His most prominent feature is his giant hat resembling a chimney which blows smoke, as well as wheels on both sides of his body which appear to have no real functionality other than him spinning them with his arms when he runs. As a Longarm, he has unusually long arms, with an extra elbow joint on each."}, {"type": "paragraph", "text": "He wears a dark suit with a giant pink bowtie, dark pants, and a dark mask over his eyes. When he was taken to the Fire Tank Pirates' hideout, he was forced to change his clothes into a lighter suit."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3d/Diesel_Second_Outfit.png/revision/latest/scale-to-width-down/210?cb=20180311225438", "caption": "Diesel's outfit since the meeting in the Fire Tank hideout."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Diesel is very loyal to Big Mom, as he massacred several people to get mythical flour for her, and immediately went to report Brûlée's defeat to her. He is very confident in his running ability to the point of bragging about it."}, {"type": "paragraph", "text": "Like many other characters, Diesel has a unique laughing style, following the sound of a steam train: \"Shuppoppoppo\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Diesel claims to be an extremely fast runner, which is proven when he could instantly sprint a very far distance from Brûlée's house in an attempt to escape before Carrot easily caught up to him. He is also extremely strong. He could transport up to six people, including Chopper in his Heavy Point form and Jinbe, a large fish-man, at once while running at high speed."}, {"type": "paragraph", "text": "Diesel is a highly capable fighter as he was easily able to massacre numerous factory workers who were armed with firearms to steal the mythical flour."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Three days before the wedding between Sanji and Charlotte Pudding, Big Mom sent Diesel to an unknown island to acquire mythical flour for the wedding. Diesel attacked a flour factory and massacred the factory workers as he completed his mission."}, {"type": "paragraph", "text": "Two days later, Diesel was with Charlotte Brûlée and some of the other of her henchmen in the Mirro-World as they prepared to cook Carrot into stew. Diesel advocated closing the lid as soon as she was dropped into the pot in order to prevent a struggle. However, the real Carrot was actually up in the attic, and as she threw a rock at Randolph, Diesel spotted her. Carrot and Tony Tony Chopper managed to ambush the party and knock everyone out except Diesel, causing him to race out of the house to report the incident to Big Mom. However, Carrot caught up to Diesel and put her hands over his eyes, causing him to crash."}, {"type": "paragraph", "text": "Afterwards, he was forced by Chopper and Carrot to assist them in traveling through the Mirro-World. Chopper and Carrot brought Pedro, Nami, and Jinbe into the Mirro-World, and after a brief discussion, they forced Diesel to carry the five of them plus Brûlée, a load which Diesel struggled to pull."}, {"type": "paragraph", "text": "Chopper's group later located Brook inside Big Mom's bedroom, being held inside the Yonko's hands as she slept. After Brûlée tried to alert Big Mom, both Diesel and Brûlée were gagged. After Chopper's group successfully rescued Brook, Diesel was surprised that Brook managed to acquire copies of the three poneglyphs. Later, Jinbe talked to Monkey D. Luffy through a mirror shard, and twice included Brûlée and Diesel in his headcount of their team, and the horrified duo quickly corrected him."}, {"type": "paragraph", "text": "Diesel and Brûlée were later taken to the Fire Tank Pirates' base, where they were left tied up. The two were cleaned up and given a set of clean clothes. Diesel was shocked when he found out that Charlotte Chiffon was taking part in a plan to assassinate Big Mom. He urged Chiffon to reconsider but to no avail."}, {"type": "paragraph", "text": "After the meeting, Diesel fell asleep in Bege's body as the Fire Tank Pirates set their assassination plan into motion. As the Sanji Retrieval Team prepared to charge into the venue from the Mirro-World, Diesel was once again forced to be used as transport."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/67/Diesel_Acquires_Flour.png/revision/latest/scale-to-width-down/250?cb=20170430022902", "caption": "Diesel massacres factory workers to acquire the mythical flour."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/Chopper_and_Carrot_Traverse_the_Mirro-World.png/revision/latest/scale-to-width-down/210?cb=20171203033254", "caption": "Diesel is forced to transport Chopper and Carrot through the Mirro-World."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Diesel vs. Mythical Flour factory workers (unseen)", "elements": []}, {"text": "Diesel, Charlotte Brûlée, Randolph, Noble Croc, and Brûlée's twelve other henchmen vs. Carrot and Tony Tony Chopper", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Diesel vs. Carrot", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Diesel is named after the diesel locomotive. Ironically, his chimney hat makes him resemble a steam locomotive.", "elements": [{"text": "Following the food-themed names of the Big Mom Pirates, his name may also be a reference to a variant of the Snakebite and Shandy cocktails.", "elements": []}]}, {"text": "Diesel's quirk of acting like a train is similar to the filler character Aveyron, with whom he shares his voice actor.", "elements": []}]}], "images": []}]}