{"sections": [{"title": "Zepo", "level": 1, "content": [{"type": "paragraph", "text": "Zepo was a polar bear mink who was Bepo's older brother and a member of the Nox Pirates. He was killed by Big Mom in Totto Land five years ago after he spun the roulette wheel."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Zepo was a large bear mink with light-colored fur and a piece of dark hair on his head. He wore a pair of sunglasses, a button-down shirt, polka-dotted pants, and a large cape."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a mink, Zepo was a natural-born warrior and could use Electro."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Zepo wielded a cutlass, which he carried on his back. He has not been seen using it."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Thirteen years before the start of the series, Zepo sailed with Pedro and Pekoms as part of the Nox Pirates and they went out in search of a Poneglyph. However, the crew grew injured and discouraged, and everyone except Zepo and Pedro withdrew from it."}, {"type": "paragraph", "text": "Ten years after beginning their journey, Zepo and Pedro sailed into Totto Land and later reunited with Pekoms, who had joined the Big Mom Pirates. During their mission to steal Big Mom's Road Poneglyph, Zepo and Pedro were defeated and captured. While facing judgement from Big Mom, Zepo spun a roulette wheel to determine how he and Pedro would be punished, and landed on 100 years of their lifespan being removed. Big Mom removed Zepo's lifespan, but since he only had 30 years left to live, she took it all and he died."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/54/Big_Mom_use_Soul_Pocus_on_Zepo.png/revision/latest/scale-to-width-down/210?cb=20171203073359", "caption": "Big Mom takes Zepo's lifespan."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He shares the same voice actor with his younger brother, Bepo.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 85 Chapter 850 (p. 8-9) and Episode 816, Zepo makes his debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 86 (p. 170).", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 81 Chapter 808 (p. 9) and Episode 757, Monjii states that all minks are natural-born warriors.", "elements": []}]}], "images": []}]}