{"sections": [{"title": "Boodle", "level": 1, "content": [{"type": "paragraph", "text": "Boodle is the mayor of Orange Town. He is an ally of the Straw Hat Pirates during the Orange Town Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Boodle is a somewhat elderly looking man with gray hair that has been arranged in three lumps: two on the sides, and the front. He wore a yellow lined shirt with dark green pants, and added a brown armor chest-plate with gauntlets during his battle against Buggy. He also wears standard-shaped glasses."}, {"type": "paragraph", "text": "After the timeskip, he seems to be wearing the same shirt, but with a bow tie and shorts. He also does not wear his armor anymore."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Boodle is a mayor who loves his town and the people in it, being willing to die for the town that he and his people worked so hard to build, a feeling that intensified when motivated by Chouchou's protective over the pet shop within the town. Boodle also came back to feed Chouchou, despite knowing the potential danger of returning to the pirate-infested town."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Boodle was seen with a polearm, and seemed to know what he was doing with it. He was, however, easily knocked unconscious by Luffy and had already been close to defeat under the hands of Buggy."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Boodle was one of several people who was forced to leave their previous home elsewhere by pirates. Having been driving out of their last home, the townsfolk decided to set up the town of Orange Town. Over time others came to the town to live there and it became big. For 40 years the town grew and grew."}, {"type": "paragraph", "text": "Boodle had an odd relationship with one pet store owner who had set up shop in the town. He was an old friend of his and even went so far as to buy dog food from him when times were harsh."}, {"type": "paragraph", "text": "Then one day from out of nowhere Buggy the pirate appeared with his crew. They forced the townsfolk out of their homes and took over the abandoned town. Boodle continued to return every day to feed Chouchou, even though he knew it carried a high risk factor with the pirates there."}], "images": []}, {"title": "Orange Town Arc", "level": 3, "content": [{"type": "paragraph", "text": "Boodle first appeared when Chouchou was being attacked by Luffy for stealing the key to the cage he was in. He explained to Luffy and Nami why the dog was defending the pet store. He also tried to stop Nami from attacking Luffy later after the store was destroyed."}, {"type": "paragraph", "text": "Boodle later challenged Buggy himself, leading the pirate to use his abilities to strangle Boodle. Before Buggy could killed Boodle, the mayor was saved by Luffy. Boodle, despite being grateful, demanded to defeat the pirate himself. He was then knocked out by Luffy, who did so to keep him out of the way. Luffy, Zoro and Nami were able to defeat Buggy's crew and drive them out of the town."}, {"type": "paragraph", "text": "After the townspeople drove Luffy and his friends out of town, Boodle and Chouchou went out to the dock and thanked the three for what they had done."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Boodle_Knockout.png/revision/latest/scale-to-width-down/210?cb=20130216093509", "caption": "Boodle knocked out by Luffy."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After two years, Boodle and Chouchou were seen together at the grand opening of the new pet food shop, which he co-owns."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Boodle vs. Buggy (interrupted by Monkey D. Luffy)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Boodle's favorite food is salmon.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 2 Chapter 12 and Episode 6, The mayor appears.", "elements": []}, {"text": "↑  https://one-piece.com/news/detail/20171102_6345/", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Boodle's information is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Boodle's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 2 Chapter 14 and Episode 6, The history of the town, as told by Boodle.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 2 Chapter 13 and Episode 6, The mayor prevents Nami from taking out her anger of pirates on Luffy.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 2 Chapter 15 and Episode 7.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 20 and Episode 8.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 21 and Episode 8.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 619, cover story: From the Decks of the World Vol. 6.", "elements": []}]}], "images": []}]}