{"sections": [{"title": "Crocus", "level": 1, "content": [{"type": "paragraph", "text": "Crocus is a doctor and the caretaker of the whale Laboon as well as the overseer of the Twin Capes Lighthouse that guides ships coming down from Reverse Mountain into the Grand Line. Though he was a lighthouse keeper for most of his life, he spent three years as a doctor serving as a part of Gol D. Roger's crew."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Crocus has an appearance based off the flower with the same name, as seen with the petals around his head. He has a rather stocky and muscular body, is bald on the top of his head, but with white hair with yellow flower petal-like things, that have purple near the bottom of them, and a white beard that splits in two parts. His lower lip is noticeably larger than his upper."}, {"type": "paragraph", "text": "He wears a pink shirt with a yellow and green stripe with purple circles in the yellow along with blueish-grey shorts with sandals. He also wears glasses, a seaweed necklace, three gold bracelets, and a green-gem bracelet on his left wrist. He also has a scar on his left arm."}, {"type": "paragraph", "text": "24 years ago, he had black hair, with yellow parts sticking out resembling a flower. His face was less wrinkled, and he wore a pink hat with black spots on it. He did not have a beard, but instead just had stubble."}, {"type": "paragraph", "text": "As a member of the Roger Pirates, he wore a pink sleeveless shirt, dark pink hat, and carried harpoons on his back. His beard and hair were still black, and he seemed to be more muscular."}, {"type": "paragraph", "text": "After the time skip, he has basically the same clothes, but with a new dark colored shirt with pictures on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Crocus is a wise and caring man. He has a strange habit of taking his time when it comes to answering questions. He once took a direct hit from a cannon attack by Mr. 9 in order to protect Laboon, showing that he deeply cares about the whale."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Medical Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Crocus is an extraordinary doctor. According to Rayleigh, Crocus was the only doctor who could halt the deterioration of Gol D. Roger's incurable disease to the point of prolonging his life long enough to reach Laugh Tale and conquer the Grand Line. He is an outstanding surgeon as he was able to surgically modify Laboon, a gigantic whale, to install routes in his body."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Crocus is also a capable fighter, as seen when he participated during the battle between Roger and Shiki's respective crews. He tends to use harpoons as his choice of weapons, and his strength alone is enough to defeat large sea creatures. He has also been shown to have either a high pain tolerance or defensive abilities as he has taken direct hits from Mr. 9 and Miss Wednesday's bazookas while defending Laboon even in his old age, showing no signs of damage just moments afterward."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Crocus possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Meeting the Rumbar Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Fifty years before the current storyline, Crocus met the Rumbar Pirates as they entered the Grand Line through Reverse Mountain from the West Blue. As he welcomed them, he noticed that a whale, Laboon, had followed them into the Grand Line. Seeing also that their ship was banged up from their journey, Crocus agreed to allow them to stay in the Twin Capes Lighthouse while repairs were made to their ship. As their ship was being repaired, Crocus got to know the pirates personally, especially their captain, Yorki, and musician, Brook."}, {"type": "paragraph", "text": "After three months of repairs and partying while they were being done, the Rumbar Pirates' ship was ready to set sail again. Since Laboon was too young at the time, they feared that the young whale would not be able to face the dangers of the Grand Line and so they entrusted Laboon to Crocus. Crocus agreed to watch over Laboon until the pirates came back from sailing around the world and came back down Reverse Mountain again. However despite the Rumbar Pirates' promise to come back after two to three years, Crocus did not meet them again at the promised time and waited much longer."}], "images": []}, {"title": "Voyage with Gol D. Roger", "level": 4, "content": [{"type": "paragraph", "text": "Twenty-six years before the start of the story, Crocus met another group of pirates that came into the Grand Line through Reverse Mountain. These were the Roger Pirates and they hailed from the East Blue. Learning that their captain, Gol D. Roger, was suffering from a terminal disease, Crocus was asked by the pirates to join them as their doctor in order to help stabilize Roger's health, as he was believed to be the only doctor with the ability to do so. Wanting to find out what had happened to the Rumbar Pirates, Crocus accepted their offer and joined them along with their voyage."}, {"type": "paragraph", "text": "For the next three years, Crocus journeyed as a member of the Roger Pirates from the heights of Skypiea to the depths of Fish-Man Island. All the while, Crocus searched for an answer to what had happened to the Rumbar Pirates as he kept Roger's health stable. As he searched, he found out from a report that stated that some of the Rumbar Pirates had tried to escape the Grand Line through the Calm Belt. Crocus believed that the entire crew had fled the Grand Line in cowardice and broken their promise to return to Laboon, unaware of their tragedies and Brook's condition."}, {"type": "paragraph", "text": "After sailing around the world with Roger, Crocus left the crew as it disbanded. Upon returning to the cape twenty-three years before the current storyline, Crocus then returned to his home in the entrance to the Grand Line and told Laboon what he learned in his travels. However, despite Crocus telling Laboon of what he believed had happened to the Rumbar Pirates, the whale would not believe him and started bashing against Reverse Mountain in an attempt to rejoin his pirate comrades. Crocus, unable to stop Laboon from such a futile effort, decided to heal the scars Laboon was creating in any way he could as a doctor. Over the years as Crocus tried to convince Laboon to stop, he built an elaborate system of tunnels inside Laboon as the whale had grown too big for conventional medicines to work from the outside."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/57/Crocus_as_a_Roger_Pirate.png/revision/latest/scale-to-width-down/230?cb=20130624084556", "caption": "Crocus as a member of the Roger Pirates."}]}, {"title": "Reverse Mountain Arc", "level": 3, "content": [{"type": "paragraph", "text": "Some twenty-three years later, Crocus met the Straw Hat Pirates after Laboon swallowed them, while Luffy came in through the main entrance on top. Laboon tried once again to break through the Red Line, but Crocus injected the whale with a sedative. After Luffy defeated Miss Wednesday and Mr. 9, who tried to kill Laboon for meat, Crocus showed the way out to them, and explained Laboon's history. Saddened by this and intrigued at the same time, Luffy eased his loss the only way he knew how: by picking a fight with Laboon. Luffy declared it as a draw, and said while he may have lost his former crew mates, he now has a rival in Luffy, and will return to finish their fight after they reach end of the Grand Line. As Laboon cried tears of joy, Crocus was glad for him, and noted Luffy's similarities to that of Gol D. Roger. Before the Straw Hats departed, Crocus gave Nami a present, which was his personal Log Pose after the Log Pose that she snatched from Mr. 9 earlier was destroyed because of Sanji and Luffy. He gave it as thanks for the Straw Hats in stopping Laboon from rampaging further."}], "images": []}, {"title": "Thriller Bark Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Brook, the last survivor of the Rumbar Pirates, announced that he would join the Straw Hats, Laboon gave out a triumphant wail as if to say he knew Brook was returning to him. Crocus noticed Laboon was feeling much happier."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the time skip, Crocus was seen drinking with an unknown person on Twin Capes."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "While reading a newspaper of Brook's new bounty, Crocus was pleased to see Laboon happy."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Crocus was removed from the 4Kids version of the anime, along with the Laboon portion of the Reverse Mountain Arc. To fill up the plot hole about who would explain to the Straw Hats how Log Poses and the Grand Line work out, they showed a flashback of Usopp receiving the Log Pose from his pirate father, Yasopp, and Sanji receiving details of the Grand Line from Zeff right before he joined Luffy."}, {"type": "paragraph", "text": "While 4Kids filled in the plot hole created at the time, they unfortunately created another plot hole by involving the removal of Crocus. Though it was not revealed at the time, by removing him, 4Kids removed an important piece in the story as Crocus was an important part of Gol D. Roger's crew. The removal of the Laboon arc would also cause problems by the time Brook was introduced."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle!", "elements": []}, {"text": "Legend of the Rainbow Island", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "Grand Battle! 2", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The crocus is a genus of flowering plants which looks much like the plume on Crocus' head.", "elements": [{"text": "The 'autumn crocus' resembles but is unrelated to the 'true crocus'. It is a poisonous but medicinal plant, possibly referring to Crocus' status as a doctor, much like Belladonna and her namesake flower.", "elements": []}, {"text": "In the language of flowers, the crocus can mean \"abuse not\", a reference to his caring for Laboon.", "elements": []}]}, {"text": "Upon meeting the Straw Hats, Crocus states that he is a Gemini and his blood type is AB. However, his birthday is later revealed to be on January 4, which would make him a Capricorn. In the Vivre Card - One Piece Visual Dictionary, his birthday is given as June 4, which would fit his initial statement about his zodiac sign.", "elements": []}, {"text": "He has a running gag where he glares fixedly, apparently activating a series of dramatic jump-cuts, before making a completely anti-climatic statement, much to the irritation of anyone subject to the glare.", "elements": []}, {"text": "An alternate romanization is Krokas, as shown in Episode 62.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Crocus – Wikipedia article about the flower that Crocus' name and appearance is based on.", "elements": []}]}], "images": []}]}