{"sections": [{"title": "Vinsmoke Sora", "level": 1, "content": [{"type": "paragraph", "text": "Vinsmoke Sora was the queen of the Germa Kingdom. She was the wife of Vinsmoke Judge, and the mother of Reiju, Ichiji, Niji, Sanji, and Yonji. She died sometime during Sanji's childhood."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sora was a young woman with pale skin, dark blue eyes, and wavy shoulder-length blonde hair with a tuft that covered her right eye. Her hairstyle and her overall facial features bear great resemblance to those of her daughter, Reiju."}, {"type": "paragraph", "text": "When she was pregnant with her quadruplet sons, Sora had longer hair, pink lipstick, and she wore a white short-sleeved dress with frills and pink shoes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sora was a very kind and caring woman, with great strength of character. She loved her children and was fiercely protective of them, believing that they should grow up with normal human emotions and not as cold killing machines. As a result, she did everything in her power to resist her husband's experiments on their sons, to the point of sacrificing her own life."}, {"type": "paragraph", "text": "Sora deeply cherished compassion and doted in particular on Reiju and Sanji, the only two of her children to exhibit empathy and compassion, in order to encourage these traits. She could also be very emotional, as she readily burst into tears when recounting Sanji's well wishes to Reiju and Époni."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Vinsmoke Judge", "level": 4, "content": [{"type": "paragraph", "text": "Sora and her husband had conflicting ideals, which were complicated by their positions as the monarchic rulers of the warmongering Germa Kingdom. While Judge wanted to endow their sons with surgical enhancements that would give them superhuman power to wage and win wars, Sora did not want it to cost them their humanity. Ultimately, Judge forced her to undergo the surgery, and Sora, maintaining her opposition, took a drug to counteract the surgery and eventually succumbed to its after-effects."}, {"type": "paragraph", "text": "After Sora passed away, Judge wished to move on from her way of doing things, as he saw no merit and nothing to be gained by continuing the legacy of a deceased person, and did not want his children to emulate her kind actions. In modifying the Lineage Factor of their quadruplet sons against her will, and then neglecting and discarding Sanji (their only son to live up to Sora's efforts), Judge effectively trampled on Sora's wishes."}], "images": []}, {"title": "Children", "level": 4, "content": [{"type": "paragraph", "text": "Sora loved all of her children, and it was this love which motivated her to risk her own life. While she was pregnant with their four sons, she took a drug that was intended to counteract the effects of the genetic modification surgery Judge would ultimately force her to undergo. However, the drug failed to work on Ichiji, Niji, and Yonji, leaving Sanji as the only one capable of experiencing empathy."}, {"type": "paragraph", "text": "While not much is known about her relationship with Ichiji, Niji and Yonji, Sora's love was reciprocated by Reiju and Sanji, both of whom would occasionally visit her in the medical ward. Sora doted in particular on Sanji, due to the latter's kindness and compassion. She ate his poorly-made food (which tasted disgusting) with a smile, and praised him as the \"sweetest boy in the world\" when he told her his hopes for her quick recovery. During Reiju's visits, Sora would proudly share with her daughter stories about Sanji's emotional growth."}, {"type": "paragraph", "text": "After Sora's passing, Sanji continued to develop his cooking skills and decided to become a cook in her memory. An adult Reiju also continues to recall memories of her mother with great fondness, while harboring great anger and resentment towards Judge for contributing directly to Sora's death. However, this resentment does not seem to extend to her brothers. When Sanji finally learned from Reiju the reason for their mother's early death, Sanji was horrified and began to blame himself, but Reiju stopped him by telling him that Sora had no regrets about her choice."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As queen consort of the Germa Kingdom, Sora had authority over its citizens before her death, although her command appeared to be second to that of her husband's. She also had enough scientific knowledge to procure and consume a drug to counteract genetic enhancement surgery on her unborn children, although the drug had lethal side effects which caused irreversible damage to her health."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in the past, Sora married Judge, thereby becoming queen of the Germa Kingdom. She later gave birth to their first and only daughter, Reiju, and three years later, she became pregnant with quadruplet sons, Ichiji, Niji, Sanji, and Yonji."}, {"type": "paragraph", "text": "Before their sons were born, Sora argued with her husband about giving them genetic modifications. She was against him turning their sons into emotionless beings, but Judge was only concerned with giving them the physical power and emotional coldness to fight and win wars. Sora was eventually forced to undergo surgery, but she took a drug that was intended to counteract the effects of the surgery. However, the drug she took only affected Sanji, while weakening her health to the point of death. Despite this, Sora had no regrets and was immensely overjoyed and proud whenever Sanji showed signs of kindness."}, {"type": "paragraph", "text": "In her final years, Sora was bedridden in the Germa Kingdom's medical ward, where she was attended to by Époni. On one occasion, Sanji visited his mother and gave her a meal that he had prepared for her. Even though it looked and tasted terrible, she ate the meal and said it was delicious. On another occasion, Sanji told her that he hoped she would recover soon, leaving her in tears. Sora was also regularly visited by Reiju, to whom Sora would often speak happily about Sanji and his continued emotional growth."}, {"type": "paragraph", "text": "Sora died over 13 years ago, prior to the Germa Kingdom's invasion of Cozia in the East Blue."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Sora_Sabotages_Judge%27s_Plans.png/revision/latest/scale-to-width-down/165?cb=20171224031849", "caption": "Sora takes a drug to try to humanize her sons."}]}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "Despite Judge considering Sora's values to be worthless, to the point that he scorned their third son for upholding her legacy, Sanji's kindness and compassion would ironically prove crucial in saving the Vinsmoke Family from being assassinated by the Big Mom Pirates in the future. Despite all the suffering his father and brothers caused him, Sanji still chose to save his family due to having the kindness Sora cherished and valued so much. Reiju was also extremely moved by the lengths Sanji would go to save their family, despite the cruelty they had shown him."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "During Sanji and Reiju's flashbacks, Sora's grave is shown. The grave has a different design and inscription in the anime."}, {"type": "paragraph", "text": "During a visit from Reiju in the manga, she was also clad in a dark royal cape, similar to the ones her children wear on formal occasions. In the anime, she only wore her hospital gown."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sora shares her name and merit with the fictional protagonist of the comic Sora, Warrior of the Sea, who stood against Germa 66 for good in his comic strip.", "elements": []}, {"text": "When Sora ate Sanji's food that was ruined, she complemented that it was delicious out of gratitude and kindness for Sanji's compassion. When Sanji met Luffy outside of the castle at the place he promised him to meet, Luffy ate the ruined bento box Sanji brought, though, he ate it like Sora, with Luffy stating it was genuinely delicious.", "elements": []}]}], "images": []}]}