{"sections": [{"title": "Avalo Pizarro", "level": 1, "content": [{"type": "paragraph", "text": "Avalo Pizarro, also known as the \"Corrupt King\", was one of the criminals who was given a life sentence in Level 6 of Impel Down, as his crimes were so atrocious he had to effectively be erased from history. Prior to his life of crime, he was once a king of a North Blue kingdom that overthrew him for his despotic ways. He has since been freed by Marshall D. Teach and has become a member of the Blackbeard Pirates. He is currently one of the Ten Titanic Captains, and the captain of the Fourth Ship of the Blackbeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Unlike the other Impel Down escapees (barring Shiryu), he was not dressed in a prisoner's uniform even when incarcerated. Instead, he dresses in a regal attire, consisting of a long, white and dark brown patterned fur coat and light-purple necklaces."}, {"type": "paragraph", "text": "He has many cat-like characteristics: his eyes are slitted like a cat's and his cyan hair is a wild mane, with white horns attached to his head via black metal plates underneath. His mustache is a lighter blue than the rest of his hair, very large and droopy, sticking out about the same length as his shoulders; they resemble a cat's whiskers, fitting in with his feline-like appearance. He also has no eyebrows. Since his debut, his arms so far have always been somewhat obscured, but it can be seen at one point that he has black vambraces with a spiral design; in the anime, it was revealed that he was wearing black and dark bronze metallic gloves. He is also revealed that some of his upper teeth are missing from his jaw. He is also about the same size and width as others amongst his new crew like Blackbeard."}, {"type": "paragraph", "text": "After the timeskip, he has the beard finished in three points. Also, he wears an elaborate crown, possibly signifying his former status as a royal from North Blue."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3f/Avalo_Pizarro_Anime_Concept_Art.png/revision/latest/scale-to-width-down/180?cb=20180909234146", "caption": "Avalo Pizarro concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "So far in all of his appearances, he is always seen smiling, even when attacking Whitebeard. He also seems somewhat nostalgic about things, and has a tendency to say \"Nya\" at the end of his sentences, the Japanese equivalent of \"Meow\". He also has quite a desire to become leader, as he was daring enough to ask (albeit in a joking manner) Teach to let him be the captain instead."}, {"type": "paragraph", "text": "During his time as a king, he was corrupt and selfish, using royal privileges for his self-serving purposes that led to his people impeaching him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Pizarro's abilities have not yet been fully defined, but he was powerful enough to be contained in Level 6 of Impel Down when caught by the World Government. Another testament to his power is the fact that, when Blackbeard recruited the Level 6 prisoners, he only chose the ones that could survive when pitted against everyone else in a free-for-all battle. Thus, Pizarro is one of the strongest Level 6 prisoners."}, {"type": "paragraph", "text": "As a king of a North Blue country, he had authority over his people, though his abuse of it led to them overthrowing him, stripping him of such privileges. After becoming captain of the Fourth Ship of the Blackbeard Pirates, he gained the authority associated with the status."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Pizarro has superhuman durability, as seen when he took a direct hit from a Gura Gura no Mi strike from the former Yonko Edward Newgate, having taken a direct hit from Sengoku's shock wave bursts in Daibutsu form and remaining mostly untroubled by the attack."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In the manga he used unknown weapons, due to his arms being always obscured by something. In the anime, he was seen wielding flintlocks against Whitebeard."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Avalo Pizarro once ruled over his own kingdom in the North Blue, but he used his power to fulfill his own goals and was consequently overthrown by his people. He became one of the most feared criminals in the world, but was eventually caught by the World Government and sentenced to life in Impel Down Level 6, where he was effectively erased from history."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the Blackbeard Pirates invaded Impel Down, Pizarro fought to the death with the inmates of his cell under Marshall D. Teach's orders, and being victorious, was given freedom and recruited into the Blackbeard Pirates."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Ace died, and Whitebeard separates himself from his crew, Blackbeard's crew is revealed to be observing the fight. Pizarro is introduced along with his fellow inmates, Vasco Shot, Catarina Devon, Sanjuan Wolf and Shiryu. When Blackbeard is struck down by Whitebeard's Bisento, Pizarro attacks Whitebeard with an unidentified device on his arm, with all the members of his crew (with the exception of Wolf). After Whitebeard's death, he helps put the mysterious black cloth over Whitebeard's dead body, as Blackbeard goes under the cloth. He is then shown looking on laughing as Blackbeard demonstrates his new power. Afterwards, he and the other Blackbeard Pirates are attacked by Sengoku in his Buddha form and are sent flying away. He later leaves with the crew when Shanks comes to Marineford."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Whitebeard_vs_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/200?cb=20151018201408", "caption": "The Blackbeard Pirates dealing the death blow to Whitebeard."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He is seen with the rest of the Blackbeard Pirates on a flaming island, waiting for the Marines to bring a battleship to exchange for Jewelry Bonney. He says that he could figure out the problem of acquiring a ship and jokingly asks Blackbeard to make him captain. Laffitte casually asks him if he had a death wish, saying that they are the Blackbeard Pirates. Later, when Akainu arrives, Pizarro leaves with the rest of the Blackbeard Pirates, leaving Jewelry Bonney to be captured by the Marines."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war had ended at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "The Blackbeard Pirates used their captain's knowledge of Whitebeard's former territory to conquer it. Now that Blackbeard has become a Yonko, the Blackbeard Pirates are hunting down powerful Devil Fruit users in order to absorb their abilities."}, {"type": "paragraph", "text": "When Teach became Admiral of the now expansive crew, Pizzaro was promoted to becoming the captain of the Fourth Ship of the Blackbeard Pirates, ironically granting him his request to be made captain."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates later attacked Baltigo, the Revolutionary Army's headquarters. Baltigo was destroyed by the time the Marines and Cipher Pol arrived, but the Revolutionary Army was able to escape. However, the Blackbeard Pirates fled after briefly clashing with Cipher Pol."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events at Totto Land, he was seen listening to his captain's comments about Luffy being too soon to be called a Yonko."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "As Moria and his zombie army rampaged on Blackbeard's island, Pizarro was notified of Moria's presence."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Blackbeard Pirates vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Fleet Admiral Sengoku", "elements": []}, {"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco, unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol (unseen)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He was the only Level Six prisoner amongst the Blackbeard Pirates not to be mentioned by Emporio Ivankov. He is also the only new recruit to not be wearing a striped prisoner's uniform at the time of his debut. Whether this is a coincidence or not has not been made clear.", "elements": []}, {"text": "\"Avalo\" is similar to the Spanish surname Ávalos, such as the d'Avalos family of condottieri. Avalo also shares his name with the Pizarro brothers, four Spanish conquistadors.", "elements": []}, {"text": "Avalo could also be a reference to the Spanish word \"avaro\", which means miser, being also related to his nickname Corrupt king.", "elements": []}, {"text": "Avalo's favorite food is shark fin soup.", "elements": []}]}], "images": []}]}