{"sections": [{"title": "Chabo", "level": 1, "content": [{"type": "paragraph", "text": "Chabo is a young boy from Gosa Village. He works for Nojiko on her tangerine farm."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a small boy, with brown hair, and round eyes. He wears a green beanie, and an orange jacket."}, {"type": "paragraph", "text": "After the timeskip he has grown much taller, and has grown his hair longer. He has a new hat with the kanji \"今\" (Ima) meaning \"now\", and a plaid shirt. He wears an apron that says \"Bell Mère's\" on it and has the symbol from Nami's tattoo and the Japanese word for tangerine \"mikan\" (みかん) underneath it. He wears light colored gloves and has a bandage on his left arm. He also wears cargo pants."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "After Arlong killed his father, Chabo wanted to kill the fish-man himself in order to avenge his father's death. After Chabo mistook Usopp for Arlong, Nojiko made Chabo realize that throwing his life away for revenge was not worth it as there were still people who cared for him in this world. While he seemed aggressive for wanting to take revenge, in reality, he was very upset by his father's sudden death and was unable to process it in a healthy way until Nojiko spoke to him."}, {"type": "paragraph", "text": "After the timeskip, Chabo seems happier, now working for Nojiko."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Chabo's father was murdered by Arlong. Chabo sought revenge for his death, but no longer felt the need to do so after Arlong was defeated by Monkey D. Luffy."}, {"type": "paragraph", "text": "Chabo also cares for his mother, as seen when he left Nojiko's home to be with her."}], "images": []}, {"title": "Nojiko", "level": 3, "content": [{"type": "paragraph", "text": "Nojiko stopped Chabo from stabbing Usopp and took him back to her home, saving his life. Though she had just met him, she had no reservations about being honest with him; she told him he was unable to beat Arlong, that Nami had saved him, and that he would be a coward to throw his life away. She supported Chabo after the Marines were defeated by Arlong's subordinates and Arlong's defeat, and he began working for her during the timeskip."}], "images": []}, {"title": "Nami", "level": 3, "content": [{"type": "paragraph", "text": "Chabo hated Nami for stopping him from confronting Arlong. However, Nami saved Chabo by stopping him, as Nojiko told Chabo."}], "images": []}, {"title": "Arlong", "level": 3, "content": [{"type": "paragraph", "text": "Chabo hates Arlong for murdering his father and wanted to avenge his death. However, he no longer felt the need to so after Luffy defeated Arlong."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a child, Chabo is not strong. To get a combat advantage over Usopp, he tripped the pirate."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wielded a knife when he went to challenge Arlong and when he confronted Usopp."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Chabo's home, Gosa Village, was destroyed by the Arlong and Momoo. During the attack, Arlong murdered Chabo's father."}], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "Chabo went to Arlong Park to kill Arlong to avenge his father's death. Nami stopped him outside the gate and told him to leave. When he did not listen, she struck him down and left him a large sum of money to make him leave. He later encountered Usopp in the ruins of Gosa Village and tripped him, thinking that Usopp was a fish-man (due to Usopp's long nose). Before he could stab Usopp, Nojiko hit him on the head and stopped him. After returning to Nojiko's home, she asked him about the attack on Gosa Village told him not to throw his life away. She then asks if he has a mother to which he answers \"yes.\" He was then sent on his way to her because she was most likely worried about him."}, {"type": "paragraph", "text": "Later, the surviving Gosa Village residents called the Marines to help, the Marines arrived and Chabo announced to Nojiko and the Cocoyasi villagers what happened. The Marines fought Arlong, but it was all in vain. After the fall of Arlong Park, he decides to forget about avenging his father and celebrates with the rest of Cocoyasi Village."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Chabo later enters the tangerine business with Nojiko. After the Straw Hats returned, he is seen with Genzo, Nojiko, and Nako at Bell-mère's grave."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In Episode 34, Chabo's scene on the coast when Marines from the 77th Branch arrive is extended. Instead of meeting Nojiko and the other villagers at the coast as he did in the manga, he leads Nojiko through the forest to the coast. His reaction to the Branch's defeat is also extended, where he falls to his knees in disappointment and defeat."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 8 Chapter 69 and Episode 31, Nami gets Chabo to leave.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 64 Chapter 629, cover story: From the Decks of the World Vol. 14, Chabo is seen working for Nojiko after the timeskip.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Chabo's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 8 Chapter 70 and Episode 32, Chabo, Usopp and Nojiko meet.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 95 (p. 7) and Episode 44, With Arlong's defeat, Chabo no longer feels the need to avenge his father.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 75 (p. 8-17) and Episode 34, The Marines arrive to fight the Arlong Pirates and are defeated.", "elements": []}, {"text": "↑  One Piece Anime — Episode 34, Chabo's scenes when the 77th Branch challenge Arlong is altered in the anime.", "elements": []}]}], "images": []}]}