{"sections": [{"title": "Mont Blanc Noland", "level": 1, "content": [{"type": "paragraph", "text": "Mont Blanc Noland was an admiral (提督, Teitoku) in the Lvneel Kingdom who made multiple trips into the Grand Line. He discovered a city of gold on Jaya, but found upon returning there with Lvneel's king that it had disappeared, causing him to be executed. He was then memorialized in a fairy tale as a liar and trickster."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Noland was a brown haired man whose most distinct feature is a large chestnut on his head. This feature was passed down to his descendants. He was a well built man who often wore a high-collared black coat, closed by a belt, and an orange scarf. Cricket was right to suggest that he is so far removed from the main family that he bares no resemblance to him at all. While Noland had tanned skin, Cricket is very pale; while he had brown hair, Cricket is blonde; and while Noland had a roundish nose and pleasant face, Cricket has a small pointed nose and a longish face."}, {"type": "paragraph", "text": "His legs were covered by striped blue and white pants, and his feet by standard shoes. Hidden under his coat, he had an orange sash adorned with medal-like pendants. He carried around his sword, a katana with a chestnut-shaped handguard and orange and white hilt-bandaging, on his left hip, in an orange scabbard with a green band on it. On the left side of his chest is a large cross-shaped scar."}, {"type": "paragraph", "text": "After his execution, Noland's image was distorted over the years due to the shame that was brought to his name. Since then, whenever someone refers to Noland, the image of an ever smiling idiot is the one that commonly comes into mind. This defacing image is the one often drawn by artists in children's books. His nose is shaped like a spork."}], "images": []}, {"title": "Personality", "level": 2, "content": [], "images": []}, {"title": "Storybook", "level": 3, "content": [{"type": "paragraph", "text": "The Noland who is depicted in the stories is a grinning fool who often went away on long expeditions only to return with stories that seemed unbelievable. In the end as far as the story was concerned, Noland pushed his luck with the bragging of a whole city of gold and it was a tale that cost him dearly, his life."}], "images": []}, {"title": "Reality", "level": 3, "content": [{"type": "paragraph", "text": "The real Noland was an honest and good man who was brave and cared about people, despite what history remembers him as. He was happy-go-lucky, had a strong determination and was friendly. His only flaw seemed to have been acting without consulting people on things (such as cutting down the Shandia sacred trees), however he only did what he thought was (and usually was) best for people. He did not hesitate for a moment in risking his life to save Mousse and also took it as his duty as an explorer and researcher to eradicate the curse which plagued the inhabitants of old Jaya island. He was also deeply remorseful after learning that the trees which he cut down to save the people of Jaya island were considered to be sacred and asked his crew to leave all the gold behind as a sign of grievance for the crime they committed."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Though some of his crew might have actually believed Noland attempted to jump ship when problems occurred, they looked up to him and described him as an honest, great and beloved man, who was the best of his kind. They depended upon him and fought to the end to save him after he was put to death. Having great trust in him and having been with him there, they are the only people who truly believed him at the time of his execution, and pleaded with the king to release him. While he cares deeply for his crew he sometimes, when studying plants, fails to notice when they are in trouble."}, {"type": "paragraph", "text": "The doctor who accompanied Noland on the trip wears a white cap and has a little visible beard. He tends to drink a little when he is depressed. He talked to Mousse about what happened to the trees during the \"Relative Trees Affair\". He first appeared in Chapter 287 and Episode 187."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/15/Noland%27s_Doctor_Portrait.png/revision/latest?cb=20190327222525", "caption": "The doctor that accompanied Noland on his journey."}]}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Kalgara", "level": 4, "content": [{"type": "paragraph", "text": "Noland and Kalgara shared a special bond and had great respect for each other. It was noted that Kalgara appeared to be much more happy and lost his stern, bitter demeanor when with Noland. After making good friends with Kalgara he hoped to see him again and dreamed for a long time of revisiting his island. Unfortunately, Noland was a victim of circumstances beyond his control and this was something he would never live to see. He nevertheless bravely went to his death swearing the truth was as he said it and hoping his friend was okay."}], "images": []}, {"title": "Nola", "level": 4, "content": [{"type": "paragraph", "text": "During his short stay at Jaya, Nola also became fond of him and Kalgara."}], "images": []}, {"title": "Tontatta Tribe", "level": 4, "content": [{"type": "paragraph", "text": "Unlike most of the world, Mont Blanc Noland is considered to be a hero among the Tontatta Tribe of the Tontatta Kingdom for coming to the dwarves' aid 400 years ago. Noland helped the dwarves by fighting off the \"bad humans\" who were ravaging their lands. For his actions, Noland was considered a hero by the dwarves, who built a statue in his honor."}, {"type": "paragraph", "text": "400 years later, Usopp the sniper of the Straw Hat Pirates pretended to be a descendant of Noland named Usoland to protect himself and Robin. Due to their gullible nature, the dwarves believed Usopp's lie and viewed him as a hero because of it, showing that Noland is seen as a hero to the dwarves even 400 years later."}], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "According to his reason for why he could not marry Kalgara's daughter, he had a wife and child himself. However, after his death, his family was ostracized by society, which led to them, and all his descendants, to forever be locked into battle with his legacy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Mont Blanc Noland was an exceptional seaman and captain who maintained the utmost respect of his crew and together they made multiple expeditions into the Grand Line, even exploring the New World. While lesser sailors would not return or be completely traumatized by even a single trip, Noland and his crew were able to return safely each time."}, {"type": "paragraph", "text": "He was also a skilled botanist and doctor, almost single-handedly curing the Shandia village of the tree plague. All of this is in addition to his intelligence, resourcefulness, and his nature to see through to the heart of things and take action when necessary in order to do what is right."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Noland_Writes_in_his_Captain%27s_Log.png/revision/latest/scale-to-width-down/210?cb=20130309035302", "caption": "Mont Blanc Noland writing in his log book in his cabin while traveling into the Grand Line."}]}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Noland was shown to be extremely strong in combat, both bare handed and with a sword. He was able to single-handedly kill a Sea King underwater in order to feed his crew, while noting that this wasn't his full potential. He was on even terms with his friend Kalgara, who was believed to be the strongest warrior in the history of the Shandia village. He was capable of defeating the huge God Serpent Kashigami in a single sword strike, in the process saving Kalgara's daughter who was about to be sacrificed. This is something that even Zoro and Wyper, fighting together, were unable to do to Nola (who was at the time a similar size to Kashigami) during their battle in Upper Yard. This not only speaks about his monstrous physical strength, but also his sword mastery."}, {"type": "paragraph", "text": "Noland was also shown to have superhuman endurance. After being caught in a fissure for several hours (before and after Kalgara found him) he was still able to remain conscious, which led a shocked Kalgara to note his surprise at the fact that he was still alive. Despite the gargantuan weight of the landmass crushing him, he was still able to slightly move it, not enough to free himself, but enough to shock Kalgara by his impressive feat of strength."}, {"type": "paragraph", "text": "Noland was also a very skilled diver, diving to such depths and for such long durations that his own crew could not tell if he was still alive or not. Noland had exceptional combat power in the water as he did on the ground, and would frequently dive into the sea to hunt giant fish for provisions. This diving skill was apparently inherited by his descendant, Mont Blanc Cricket."}, {"type": "paragraph", "text": "He also possessed exceptional hearing, being able to pick up the extremely faint sound of Shandora's golden bell even in the midst of a storm."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "The Journey in the Grand Line", "level": 3, "content": [{"type": "paragraph", "text": "Noland was a famous explorer, who often spoke of tales of his journeys. He visited Vira where he met a merchant who sold him a waver. Sometime in his journeys, he entered the New World and encountered the island of Green Bit, protecting the Tontatta Kingdom and its people from the humans who were ravaging their homes. However, Noland's tales would forever be labeled lies after one unlucky event around a friend he made."}], "images": []}, {"title": "The True Story of Noland", "level": 3, "content": [{"type": "paragraph", "text": "Four hundred years ago, he was an explorer who was caught out in a storm. His crew found their way to safety following the ringing of a golden bell. On the 12th of May, 1122, Noland set foot on Jaya island for the first time."}, {"type": "paragraph", "text": "When Noland arrived, he found a child suffering from an illness. Investigating further he found the people were suffering from Tree Fever, brought on by diseased trees that killed the villagers crops and made them ill. After killing their \"God\" (a giant snake) and saving Mousse, he was captured by the tribe in order to take the place of the chief's daughter for angering God. Noland was given until sunset to find the cure for the tribes sickness and Noland began to look for the tree with the treatment inside."}, {"type": "paragraph", "text": "On the way back with the cure a sudden shudder of the earth below him left him trapped. The next day, an earthquake hit the island; thinking that this was God's wrath, Kalgara rushed out to find and kill Noland. Kalgara mocked Noland after finding him trapped in a crack in the ground, then mocked him further as the \"child of God\" appeared to devour him, for punishment for killing God. Noland pleaded for mercy with Kalgara stating that he had the cure, but was trapped and unable to escape."}, {"type": "paragraph", "text": "Noland explained the illness was not a curse from God as his people had believed, and that for centuries people suffered in the absence of a cure for the same disease the tribe were suffering from elsewhere in the world. He explained that they should not reject a cure that today prevents people dying when hundreds had died waiting when there was no cure. After finally reaching out to Kalgara, Kalgara killed the \"child of God\" and helped Noland get free from his entrapment."}, {"type": "paragraph", "text": "After stopping the sacrifices, the crew and the tribe celebrated being rid of the disease. With their help he discovered a city of gold on the island. Kalgara also pointed out a snake that would be named \"Nola\" in Noland's honor and in a change of light of the giant snakes referred to it as \"the giant snake's grandson\" instead of \"God's grandchild\". However, Noland and his men had discovered a set of trees that were the ones that caused the tribe to fall ill in the first place and knew they had to be cut down in order to protect the Shandia from future outbreaks."}, {"type": "paragraph", "text": "At the time he did not know that the trees were sacred to the tribe and when Kalgara found out, Noland was told to leave, and Noland ordered his men to leave the treasure behind. After Kalgara's daughter told the tribe the truth, Kalgara ran to the shore and shouted out to Noland to one day return. The sacred bell was rung to welcome him (Noland had told Kalgara that it had led him to the island in the first place) and Noland promised he would return to the island someday."}, {"type": "paragraph", "text": "After he returned to his home island Lvneel, he told the king about his expedition. The king then ordered Noland to take him to the city of gold, but insisted on bringing his own soldiers instead of Noland's crew. Despite this setback, which led to many soldiers dying due to lack of sailing experience, Noland was determined to get the king safely to Jaya. Once they arrived on the island, however, the city and its people had disappeared. The king, furious, thought Noland was playing a trick on him and shot him in the back, then sentenced him to death without even hearing him out. Furthermore, the king even framed Noland by having one of his subjects act as a member of Noland's crew, falsely testifying against Noland. As one of the king's men claimed Noland would be killed via beheading, the crowd shouted \"LIAR, LIAR\" during the execution."}, {"type": "paragraph", "text": "In the end, with his crew watching helplessly, Noland was left tearfully wondering what happened to his native friends and the golden city as he is killed. It is revealed that Noland was not sad due to the fact he was going to be killed. Instead, he wept due to the fact he was worried for the Shandia's safety. As a final insult, the North Blue fairy tale depicts him as a grinning fool and the king as a brave warrior."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/de/Noland_Before_Execution.png/revision/latest/scale-to-width-down/210?cb=20130303083903", "caption": "Noland about to be executed."}]}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "Many centuries later, Mont Blanc Cricket arrived on Jaya by chance. His crew abandoned him and he was left to struggle with the legacy of Noland alone. Finally, Masira and Shoujou, who were fans of the book, arrived to help Cricket. Though Cricket was reluctant to allow this, he grew to accept their help. Eventually, the journey of the Straw Hats on Skypiea confirm where the City of Gold mentioned in the book really exists. Though the book continues to be unaffected by this discovery, Cricket has found peace with his ancestor's legacy to continue onto new dreams, knowing that he knew at last the book about his ancestor was fraudulent."}, {"type": "paragraph", "text": "The Dwarves of the Tontatta Kingdom also honor Noland as a great hero for his actions 400 years ago. Usopp pretends to be Noland's descendant to protect himself and Robin in Tontatta Kingdom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Noland_Statue.png/revision/latest/scale-to-width-down/210?cb=20140527121906", "caption": "A statue made honoring Noland as a hero in the Tontatta Kingdom."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Noland and Cricket's family name is \"Monbran\" in the edited FUNimation dub and \"Mombran\" in the video game One Piece: Pirates Carnival (dubbed by 4Kids). While this romanization of the family name is taken directly from how it is pronounced, this is not necessarily the correct romanization of it as the Japanese characters used for the family name (モンブラン) are the same characters used for the word Mont Blanc in Japanese. It is written as \"Mont Blanc\" in the Viz Manga and \"Montblanc\" in the uncut FUNimation dub."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He was featured in the One Piece Full Color R Gashapon series."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Noland introduced pumpkins to the Shandia, who came to regard them as sacred vegetables.", "elements": []}, {"text": "A running gag upon Noland's introduction was how Noland was portrayed as much of a liar as Usopp is.", "elements": []}, {"text": "The scene where Noland is about to be killed resembles the execution of Gol D. Roger, indicating that this style of execution is common place in the One Piece world.", "elements": []}, {"text": "The name \"Mont Blanc\" means 'white mountain' in French and in Catalan, and is the highest mountain in the Alps. It may also refer to a dessert made with chestnuts, which both Cricket and his ancestor have on their heads.", "elements": []}, {"text": "The name \"Noland\", ironically, fits with the second expedition finding no land of gold.", "elements": []}, {"text": "Noland's character is similar to that of Francisco de Orellana, a Spanish explorer who claimed to have found El Dorado and other civilizations while sailing along the Amazon river.", "elements": []}, {"text": "His story is also similar to that of Louis de Rougemont, a British \"adventurer\" who told a wildly improbable tale and made a fortune, then lost everything defending it when he was accused of being a fraud.", "elements": []}]}], "images": []}]}