{"sections": [{"title": "Jabra", "level": 1, "content": [{"type": "paragraph", "text": "Jabra is a former member of CP9 and one of the last to be introduced. He was the third strongest in the organization."}, {"type": "paragraph", "text": "He was one of the major antagonists during the Enies Lobby Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jabra is a dark-skinned man, with a Fu Manchu mustache, a pointed goatee, and long hair braided in a thick queue, that somewhat resembles a scorpion's tail. He also has a scar running diagonally down his left eye. When in his half-wolf state, Jabra has an unusually large tail and snout. He has the kanji for \"wolf\" (狼, ōkami) tattooed on the front of his shoulder."}, {"type": "paragraph", "text": "During the events at Enies Lobby, he wore small, pointed sunglasses on his forehead, small hoop earrings, and a black tie over his bare chest. He wore a black tangzhuang, that was white down the middle and always open, but somehow always covered his tattoo when in human form. He also wore a red sash around his waist over black pants and shoes. He basically resembles a typical Chinese Kung Fu martial artist, commonly found in various pop culture and media."}, {"type": "paragraph", "text": "When he was a child, Jabra already had his scar and resembled a martial arts student."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jabra is extremely competitive, and was outraged that both Rob Lucci and Kaku have more Doriki than him, especially because Kaku had been weaker when they had last parted ways. His competitiveness and rivalry with the others often overshadows his rationality, and could be part of his wolf nature to establish himself as the alpha male or leader. As a wolf (or dog) he would find it especially aggravating that Lucci the leopard (or cat) would be stronger than him, given the natural rivalry between cats and dogs."}, {"type": "paragraph", "text": "Jabra is very short-tempered, and combined with his superstitions, such as his belief that Devil Fruits are inhabited by devils and feeble attempts at preventing Kaku from getting stronger by eating a Devil Fruit, he often comes across as a comedic character. It is therefore surprising that he's possibly the most rational member of CP9. Lucci, who's always calm and in control, is also sadistic and lusts for battle, whereas Jabra insists that he's a nice guy, and proposes a quick, painless death for his victims. However, in battle, a more predatory side of Jabra apparently takes over, and he howls, licks his lips, and mocks and laughs at his prey. Jabra also seems very interested in eating and tasting his opponents rather than just biting them in his wolf form."}, {"type": "paragraph", "text": "Jabra is also commonly known to deceive his opponents, as shown when he tried to lie to Sanji, telling him that Nico Robin was his sister who had been kidnapped by a pirate crew when they were young and given a bounty due to being mistaken for one of the crew, and that he wanted Sanji to rescue her. However, Sanji easily saw through this lie, and took his key while kicking him into the ceiling. He is also proud of his lying, shown when Sanji attempted to escape, Jabra angrily complained that he was the one who was supposed to trick people before moving in to intercept him."}, {"type": "paragraph", "text": "Many characters in One Piece have distinct laughs. Jabra follows in this tradition with a long gya at the beginning of his laugh (i.e. Gyaaaa ha ha ha ha!)"}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "CP9", "level": 3, "content": [{"type": "paragraph", "text": "Jabra has a fierce rivalry with Lucci. This rivalry is most evidently expressed by their opposing Zoan fruit forms. Since his form is of the dog family, Jabra is against Lucci whose form is of the cat family. Despite their rivalry, Jabra still seems to care about Lucci's well being, raising money to help pay for an operation that Lucci needed to save his life."}, {"type": "paragraph", "text": "Jabra has a dislike for the two CP9 members that work with him on missions, Fukurou and Kumadori. Both of them have outrageous personalities that not only hinder the progress of the missions they take but also annoy him. Fukurou often talks about things that Jabra would want kept secret. This includes everything from classified information about missions to Jabra's personal life. Kumadori, on the other hand, is so over-dramatic and emotional that his outbursts often test Jabra's patience, particularly his habit of attempting to commit Seppuku (Japanese ritual suicide) at the slightest provocation."}, {"type": "paragraph", "text": "He has a rivalry with Kaku similar to the one that Zoro and Sanji have. He was also envious that Kaku has a slightly higher number of Doriki than him. When Kaku first turned into his giraffe and \"square giraffe\" forms, Jabra laughed and mocked him, much to Kaku's chagrin."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Jabra_and_Lucci_Rivalry.png/revision/latest/scale-to-width-down/230?cb=20130724102642", "caption": "The shadowy silhouettes of Jabra and Lucci expressing their rivalry in their most feral form."}]}, {"title": "Gatherine", "level": 3, "content": [{"type": "paragraph", "text": "Jabra once had a girlfriend named Gatherine, who worked in the Enies Lobby's cafeteria as a waitress. Unfortunately, he was dumped by her because she fell in love with Lucci. This humiliation was further intensified by the fact that the information was spread across among all of Enies Lobby by Fukurou, from the various soldiers to the dogs of the Watchdog Unit of the Law."}], "images": []}, {"title": "Other", "level": 3, "content": [{"type": "paragraph", "text": "Jabra has a pet rooster, which can be seen as a contrast to Lucci's pet pigeon, Hattori."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As the third strongest of CP9, Jabra has immense physical power from his training as a Rokushiki master. Even without his Devil Fruit powers, he could perform extremely powerful punches, able to send Usopp crashing to a wall across a far distance."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Jabra's fighting style is based around Tekkai Kenpo, a technique which allows him to move while using Tekkai, and throw powerful punches at his enemies while maintaining his defense. He claims to be the only Rokushiki user capable of doing so. He is also able to use a range of other Rokushiki techniques, including Rankyaku, Geppo, and Shigan. With a Doriki of 2180, Jabra's strength is in a different league compared to the CP9 agents below him. He is the third strongest CP9 member, behind Rob Lucci and Kaku, and he is only 20 points weaker than the latter."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Jabra ate the Inu Inu no Mi, Model: Wolf, a Zoan-class Devil Fruit which gives him the power to change into a full wolf and a human-wolf hybrid that resembles a werewolf."}, {"type": "paragraph", "text": "This greatly increases his physical strength, allowing him to deal more damage with his Rokushiki techniques, which is further complimented by the sharp nails granted by his transformation. Being a carnivorous Zoan user, Jabra is more battle-adept than a regular Zoan. His carnivorous side was shown when he was licking his lips before attacking Usopp."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Inu_Inu_no_Mi%2C_Model_Wolf_Infobox.png/revision/latest/scale-to-width-down/220?cb=20130913104834", "caption": "Jabra's wolf form"}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Jabra possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Early Years", "level": 4, "content": [{"type": "paragraph", "text": "Twenty-two years before the start of the series, a fifteen-year-old Jabra (alongside a ten-year-old Blueno and an eight-year-old Rob Lucci) was seen training to master the Rokushiki style and in assassination with the other CP9 trainees on Guanhao after Gol D. Roger was executed. They trained hard in order to be \"stronger than justice\"."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Prior to the events in Enies Lobby concerning the Straw Hat Pirates, Jabra was sent on a mission beforehand along with Kumadori and Fukurou. Their mission was to go undercover and assassinate some rebellion leaders. However, the plan was accidentally leaked out and they were forced to kill twenty-three more people instead of the three they were assigned to. The whole incident was reported in the newspapers and Jabra had to explain everything to Spandam back in Enies Lobby as to why the mission was compromised. While arriving back to Enies Lobby, Jabra also got dumped by his girlfriend, Gatherine. Unfortunately, Fukurou spread the news around the island, from the random Marine grunts to even the island's dogs, much to Jabra's chagrin."}, {"type": "paragraph", "text": "Despite the results of the previous mission and other things, Jabra and his team were once again reunited with the rest of CP9 after five long years in the Tower of Justice. The reunion put Jabra on edge as he learned from a Doriki test that not only did Lucci become much stronger than him, but Kaku also surpassed him in strength. Despite the rude formalities between him and his rivals, Jabra quieted down and saw the fruits of victory attained by the other CP9 members: the captured Cutty Flam and Nico Robin. With these two presented to the entire CP9 team, Jabra attended a meeting concerning the future of the world's peace."}, {"type": "paragraph", "text": "After the meeting where Spandam sadistically beat both the cuffed up Franky and Robin, Jabra was met with a surprise. The director, having been pleased with the results of the mission, gave both Kaku and Kalifa each a Devil Fruit. The sight not only scared Jabra intensely due to his superstitions, but also made him fear that the two would become stronger than him if they ate the fruits. More fearful of the latter, Jabra desperately tried to convince them not eat them by saying that the fruits tasted horrible, among other things. Despite his best efforts, the two ate the fruits. The whole situation worried Jabra a bit."}, {"type": "paragraph", "text": "Although things initially seemed to be all right in Enies Lobby from Jabra and most of CP9's perspective at the time, they soon learned that an urgent emergency had befallen on the judicial island of Enies Lobby. Right after Franky and Nico Robin had been secured, their friends decided to go after them. Though this news was already known to Jabra and the rest of CP9 via an initial report, it was only when Spandam was recontacted that they learned that these people were a sizable army leading an invasion onto the judicial island. The damage that the army had done by the time Spandam was recontacted was so large that it was completely unprecedented in all of the judicial island's history. For this, the entire CP9, including Jabra, were summoned and ordered to annihilate the Straw Hats. With that, Jabra headed up to the balcony of the Tower of Justice. There, gathered together with the rest of CP9 except for Blueno, Jabra stared across the vast chasm at Monkey D. Luffy."}, {"type": "paragraph", "text": "Seeing Luffy all alone on the courthouse roof at the other side, Jabra suggested that the remaining CP9 team up and take him down quickly in order to instantly crush the uprising. However, Spandam told him to back down as it appeared that all of Luffy's efforts would be crushed because of Robin's request to be left to die. This course of action proved to be a mistake as not only did Luffy simply reply that her friends would rescue her anyway, but more Straw Hats also gathered on the courthouse roof one after another before Jabra and the rest. As the standoff between CP9 and the Straw Hat Pirates across the chasm continued, Jabra and the rest witnessed Sogeking shooting and burning the World Government's flag, thus proclaiming a declaration of war between the Straw Hats and the entire World Government. As the scene continued, Jabra also witnessed the goal of Spandam's desire, the blueprints of Pluton, go up in flames and the perpetrator of the crime, Franky, pushed off the edge of the balcony. Just at the same time, Jabra and the rest witnessed a sea train, the Rocket Man, jumping across the chasm with the Straw Hats and Franky hitching a ride on it in mid flight. The train successfully crossed the wide chasm and crashed into the Tower of Justice, much to Jabra and the rest of CP9's astonishment."}, {"type": "paragraph", "text": "With the events that had just happened, Jabra and the rest of CP9 were ordered by Spandam to annihilate the Straw Hats in the Tower of Justice before they could rescue Nico Robin. To carry out this mission successfully, they were given specific instructions. Except for Lucci, who would escort Spandam and Robin, the rest of CP9 were each given a key to protect. Each of these keys would unlock a specific pair of Seastone cuffs but only one of them would open the cuffs shackling Robin. The strategy was to make the Straw Hats fight for these keys on the threat that they could never completely free Robin without the right key. By doing so, the Straw Hats would be slowed down long enough for Spandam to escape to safety. With this strategy, Jabra took his key and decided to take a little nap in his room while waiting for his prey to come to him. With his key laid out in front of him while he slept, he hoped to attack anyone who dared to come close enough to him to steal the key."}, {"type": "paragraph", "text": "Later, Usopp came to his room and tried to take his key. While doing so, he accidentally woke up Jabra. With the sniper in front of him, Jabra turned into his hybrid form and prepared to slaughter the pirate in an instant. However, before he could do anything, the room above begun to rumble and came crashing down. The room above, which was Kaku's room, had collapsed due to the weight of the form Kaku accidentally turned into using his new-found Devil Fruit powers while facing off against Roronoa Zoro. This form was a full giraffe and its revelation made Jabra laugh out loud."}, {"type": "paragraph", "text": "Distracted by how more silly looking the scene became when Kaku turned into his hybrid form, Jabra and both the Straw Hats in the room could only laugh at the sight instead of taking the situation seriously. However, their mockery angered Kaku to the point that Jabra and the two Straw Hats had to dodge a large attack sent by the giraffe man that sliced through the entire tower. As Jabra and the rest in the room recovered their ground from the attack, they learned that a shocking development had happened during the chaos. While dodging Kaku's attack, Zoro and Usopp accidentally got handcuffed together with the Seastone handcuffs that Usopp found earlier. Not wanting to give up his prey or even team up together with Kaku to fight the two pirates, Jabra asked the two handcuffed Straw Hats what number was on the pair of handcuffs that bound them. If the number matched any of the keys that Kaku and Jabra had on them, they could free the Straw Hats with the corresponding key and properly fight them once again. Unfortunately, neither of the keys that Jabra and Kaku had on them had the matching number on the handcuffs on Zoro and Usopp. Faced with this, both Jabra and Kaku decided to chase after the two Straw Hats in order to see who could defeat them both before the other."}, {"type": "paragraph", "text": "After chasing the two Straw Hats for some time, Jabra momentarily got into a small argument with Kaku. As they were chasing after the two pirates, Jabra mistook one of Kaku's attacks as being directed towards him. As a result, Jabra attacked Kaku in retaliation and the two began to argue with one another. Though the two had just stopped chasing for a moment, their prey came up with a way to fight despite their circumstances. Jabra and Kaku saw that the two (mostly Zoro) decided to use a ridiculous strategy where Zoro held Usopp, with a sword in his hands, like a weapon (something Jabra found deeply amusing). With this weird situation on hand, both Jabra and Kaku began to fight with their prey instead of chasing them."}, {"type": "paragraph", "text": "In the midst of his fight with the two Straw Hats and his competition with Kaku over them, Jabra suddenly heard some shocking news over the Den Den Mushi intercom. From the news that was being broadcast all over Enies Lobby, Jabra learned that Spandam had accidentally pressed the Golden Den Den Mushi and summoned a Buster Call fleet to bombard the entire island. This startling turn of events worried Jabra a bit. With the imminent arrival of the Buster Call in mind, both Jabra and Kaku decided that they should stop wasting time and finish off their prey before the danger arrived. However, just as the two decided to finish their prey right away, they were suddenly interrupted by Tony Tony Chopper, who had became a huge monster during his fight with Kumadori and had then intruded into Jabra's room. Seeing as he was interrupting the fight, both Jabra and Kaku decided to get rid of the hindrance. However, before they could attack Chopper, they were forced to dodge one of Zoro's attacks and the beast was also shot out of the room by Franky, who had arrived at the scene. As Jabra and Kaku recovered themselves from this turn of events, they suddenly found out that at the same time their prey had finally freed themselves from their handcuffed situation thanks to Nami giving them the right key."}, {"type": "paragraph", "text": "With the two Straw Hats freed from their handcuffs, Jabra decided to go after Usopp while Kaku fought against Zoro. He decided to trick Usopp into a false sense of security by saying he would give the sniper his key. As Jabra watched and was impressed by how Kaku handled his Devil Fruit powers while executing his plan, Jabra's little scheme worked and thus he inflicted some severe wounds onto the unsuspecting sniper. However, just as Jabra gained the upper hand and was prepared to kill Usopp, Sanji entered the room and kicked the CP9 agent away. With this new opponent, Jabra was forced to let his original prey escape and fight against Sanji in the stairwell outside his room. After a few exchange of hits between them, Jabra decided to trick Sanji into letting his guard down like he had tricked Sogeking earlier. By saying that Robin is his long lost sister and pretending to let Sanji have his key, Jabra hoped to get a clean shot at him. Unfortunately, Sanji did not fall his trick and kicked Jabra in the face for such an outrageous lie."}, {"type": "paragraph", "text": "Unable to trick Sanji, Jabra lost his key to the chef. However, instead of simply running away with the key, Jabra's opponent decided to continue fighting and thus caught him by surprise with a kick straight in the nose. As Jabra and Sanji continued to fight one another around and across the stairwell area despite the gap in the middle of the room, Jabra unfortunately angered Sanji enough to make the chef use Diable Jambe against him. The attack not only sent Jabra flying across the stairwell over to the other side, but it also burnt through his Tekkai defenses. As he tried to recover from the wound, Jabra saw Sanji jumped across the gap in the room and, seeing how such a rushed and foolish action would be fatal against a Rokushiki master, decided to attack Sanji in midair. Jabra initially was able to gain the upper hand in the air and wound Sanji, but unfortunately for him, the chef was able to move himself around enough to send an ignited kick into Jabra's face. With this kick, Jabra was sent crashing down to the bottom floor of the stairwell."}, {"type": "paragraph", "text": "Jabra was knocked completely unconscious by Sanji's kick. With nothing else to gain from the CP9 agent, Sanji left Jabra there defeated. Jabra remained at that spot up to the moment the Buster Call came and started bombarding the island. Unable to move and escape the island by himself, Jabra would have been an unfortunate victim of the attack. Fortunately for him, Blueno arrived in the nick of time to save him and the rest of the defeated CP9 from the attack. Within the inner space accessible through the air doors created by Blueno's Devil Fruit powers, Jabra and the rest waited it out until the devastation brought upon Enies Lobby by the Buster Call subsided."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/CP9_Stands_on_the_Tower_of_Justice.png/revision/latest/scale-to-width-down/230?cb=20140722071136", "caption": "Jabra and the rest of CP9 assembled."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b8/Jabra_Sleeping.png/revision/latest/scale-to-width-down/230?cb=20121228083157", "caption": "Jabra taking a nap with his key out while waiting for his prey."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Jabra_vs_Sanji.png/revision/latest/scale-to-width-down/210?cb=20130206025722", "caption": "Jabra in battle against Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Jabra_Defeated.png/revision/latest/scale-to-width-down/240?cb=20140915112711", "caption": "Jabra upon defeat."}]}, {"title": "CP9's Independent Report", "level": 3, "content": [{"type": "paragraph", "text": "After the flames brought by the Buster Call onto Enies Lobby subsided, Jabra and the rest of the battle worn CP9 climbed out of the inner space accessed by Blueno's Air Doors and back onto the devastated island. They survived their fights against the Straw Hats despite their injuries, but Lucci had sustained so much damage from his battle with Luffy that he was in need of some serious medical attention. However, before they could tend to Lucci's wounds, Jabra and Blueno noticed from behind some debris that there were other people on the island. Spandam had sent some pursuers to find them so he could blame them for the failed mission. Fearing for their lives, Jabra and the rest of CP9 decided that they should leave the island before they could be discovered. Traveling on the Sea Train tracks, they left Enies Lobby for another island. As he lead his comrades, Jabra carried a wounded Kaku and lent his shirt to Kalifa as she was stripped when Nami was looking for her key."}, {"type": "paragraph", "text": "Jabra and his comrades eventually arrived at St. Poplar. Unfortunately, they did not have any money on them for Lucci's medical expenses. In order to earn some money, they decided to become street performers and work for the money with various acts of wonderment. To help out in this endeavor, Jabra used his full wolf form to thrill audiences by jumping through hoops of fire."}, {"type": "paragraph", "text": "After gathering enough money for Lucci's medical treatment, Jabra and the rest decided to relax until Lucci's wounds were healed. Eventually, their fellow agent recovered and he was discharged. Happy that Lucci recovered, they decided to celebrate the occasion at a bowling alley. However, as they were playing, a commotion happened in St. Poplar when a group of pirates called the Candy Pirates had taken some hostages at the harbor. They decided to deal with the matter at hand and while they were initially applauded by the locales for their fight against the pirates, the townspeople's view of the agents completely changed when they witnessed Lucci dealing excessive justice on the pirates' captain."}, {"type": "paragraph", "text": "Having given the residents of St. Poplar such a fearful image of themselves, the agents decided to leave the place. Just before leaving, they were given a flower as a sign of thanks by a little girl that was taken hostage by the pirates. Taking this gift and commandeering the Candy Pirates' ship, they sailed back to their homeland, Guanhao. Upon arrival, they spied upon the next generation of CP9 agents being trained. As they were watching, they found out the pursuers that Spandam sent had caught up with them. In order to protect Guanhao from their enemies, the agents dealt with them. They were then seen standing on Very Good's ship after defeating the pursuers. After Lucci gave their former leader a message that they would come back for him someday, the agents commandeered their pursuer's ship and sailed off from Guanhao."}, {"type": "paragraph", "text": "Like most of his colleagues (with the exception of Spandam, Lucci, Hattori, and Kaku being part of CP-0), Jabra's location and allegiance are currently unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b1/Jabra_Jumping_Through_a_Hoop.png/revision/latest/scale-to-width-down/230?cb=20101215051958", "caption": "Jabra uses his Devil Fruit powers to earn money."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Originally in the manga when Jabra was sleeping while awaiting for his prey in his room, he awoke when Usopp cried out how ridiculous it was for the rooster in the room to chirp instead of crowing like a normal rooster. This scene was extended in the anime with Jabra sleeping through Usopp's whelps when he was stung by a bee and almost dying of a heart attack, both in comedic ways."}, {"type": "paragraph", "text": "In the anime, the scene with him laughing as Kaku displays his Devil Fruit powers is expanded as well; after Kaku changes to his hybrid form, he chastises Jabra for failing to focus on the task at hand. Jabra apologizes, and his expression becomes serious. But when Kaku's ears twitch, he bursts out laughing once again at his ridiculous form. Moments later, after Sogeking accidentally cuffs Zoro when he was aiming at Kaku, the sniper makes a square-related comment in regards to the giraffe, and Jabra laughs, voicing his agreement with Sogeking's joke."}, {"type": "paragraph", "text": "In the anime, he was able to use a projectile variant of Shigan, similar to \"Shigan Bachi\"."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jabra and Kaku vs. Usopp (as Sogeking) and Roronoa Zoro", "elements": []}, {"text": "Jabra vs. Usopp (as Sogeking) and Nami", "elements": []}, {"text": "Jabra vs. Sanji", "elements": []}, {"text": "CP9 vs. Candy Pirates", "elements": []}, {"text": "CP9 vs. Very Good's crew", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In One Piece Green: Secret Pieces, it is revealed that Jabra's name was supposed to be Shakiin (シャキイン; sound effect for something sharp in Japanese). His appearance somewhat resembles his current look, but he was supposed to be much thinner and taller, his hair style was spikey hair with two thin braids instead of one, and it appears that he was initially supposed to use some sort of long and thin sword weapon. It is revealed that he was supposed to fight with Zoro instead of Sanji."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/CP9_Early.png/revision/latest/scale-to-width-down/153?cb=20110509011139", "caption": "On the top, Shakiin (Jabra) is second to the left. Below, he is third to the left."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Jabra's name has many spelling variations. Some English-speaking fans spell it \"Jabura\" or \"Jyabura\". Shonen Jump spelled it \"Jabra\" in a poll. In some languages, the name \"Djabra\" is also used."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He has a wolf theme due to his Devil Fruit, and he tends to trick people like wolves do in folklore.", "elements": []}, {"text": "In the fifth Japanese popularity contest, Jabra ranked at 109th place.", "elements": []}, {"text": "In the version of Chapter 413 published in Shonen Jump, Jabra's mustache was missing in more than half the panels he appeared in. However, this was fixed in the tankoubon, and only three panels remained with the mustache missing.", "elements": []}, {"text": "Due to a misunderstanding of how Devil Fruits work, Jabra initially believed the myth that the \"Devil\" within him, that provides his Devil Fruit powers, would come out and battle the \"Devil\" of another Devil Fruit when in close proximity. He, like many others, believed that they would duke it out until the Devil Fruit user's body would be destroyed. His fears however were put to rest by his fellow CP9 agent, Blueno, who explained that what he was fearing was what happens when a Devil Fruit user eats more than one Devil Fruit.", "elements": []}, {"text": "Despite the fact that at least Lucci, Kaku, and Kalifa have rooms that are listed as their own, Jabra instead has a Japanese-style garden that is simply listed as the \"wolf's den\" (狼の間, ookami no ma).", "elements": []}, {"text": "When Jabra attempts to lie to Sanji about Nico Robin being his long lost sister, he is shown in his half-wolf form, and Robin is shown wearing a red-hooded cloak. Before that, Sanji had just introduced himself as \"The Hunter\". This is a reference to Little Red Riding Hood.", "elements": []}]}], "images": []}]}