{"sections": [{"title": "Streusen", "level": 1, "content": [{"type": "paragraph", "text": "\"Gourmet Knight\" Streusen is the executive chef of the Big Mom Pirates, and is also the co-founder of the crew alongside Big Mom herself. Prior to his current position, he was the chef of a certain pirate crew that has since fallen apart."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Streusen is a short and rotund, elderly man. He has a beak-like nose, big lips, and a large mustache shaped like a clover on each end. He wears a pink button-down shirt with a light apron under it, as well as dark pink pants, a yellow scarf, and a very large hat with a big feather attached to it. He also keeps a stopwatch on his left hip."}, {"type": "paragraph", "text": "At age 29, he lacked a mustache, and his hair was black. He wore a dark blue buttoned shirt, a grayish green cape, a yellow bandanna around his neck, and a large dark blue brimmed hat with a white feathered plume sticking out of it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Streusen has a great penchant for operatic singing, as he frequently sings in a deep and flowy manner be it when preparing food while doing his job as a chef or celebrating important occasions such as weddings, and can get emotional while doing so. The lyrics of his songs suggest that he views life as cruel, and full of hardships, so people should eat sweet cakes to relieve their suffering. He also displayed modesty when Big Mom praised his culinary skills."}, {"type": "paragraph", "text": "As a younger man, Streusen appeared to be power-hungry and intuitive, as he quickly deduced that a young Charlotte Linlin could help him rise back to power and so worked with her to ensure he got what he wanted, giving Linlin anything she wanted in return. This was born out of a sense of sadism, as Streusen became interested in her when she committed a horrific action that he found amusing. He was also cautious, as he maintained a distance from Linlin when first approaching her, after witnessing her actions that he found amusing."}, {"type": "paragraph", "text": "Streusen also cares for the safety of both the citizens of Totto Land and members of his crew, as he instinctively turned the Whole Cake Chateau into a cake to soften its impact as it collapsed and at the same time cushion the people affected. He is against encouraging violent behavior in children as he refused to give knives to Anana. In the anime, Streusen was enthusiastic when a juvenile Linlin uses her ferocious powers for crime in the past."}, {"type": "paragraph", "text": "Like many characters in One Piece he has a distinct laugh: \"Kukukuku\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 3, "content": [{"type": "paragraph", "text": "Streusen first met Linlin when she was six years old. After witnessing Linlin's action that caused the disappearance of Carmel and the other orphans, Streusen was amused by it and even jokingly called her a \"monster\". He believed it would be a waste to let her die and approached her in a friendly and helpful fashion, though he maintained his distance and withheld his knowledge of the fates of Carmel and the orphans. The two then formed the Big Mom Pirates together and built Big Mom's dream country."}, {"type": "paragraph", "text": "In the present time, Streusen respects Linlin's authority and acts humbly towards her. In turn, she admires his culinary skills. He was worried for her safety when Capone Bege and the Fire Tank Pirates were about to assassinate her, and begged her to come to her senses. Like all of Linlin's subordinates, Streusen addresses her as \"Mama\"; however, he has also used her given name."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Streusen shows a tremendous amount of leadership and guidance skills, being able to guide a team of chefs to craft an immensely intricate wedding cake, and influence Linlin into the infamous pirate she is today."}, {"type": "paragraph", "text": "Streusen possesses a strong will, enough to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud screams."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "According to Capone Bege, Streusen may be a powerful fighter."}, {"type": "paragraph", "text": "Despite his elderly age, Streusen has exceptional endurance, as he survived a hard fall to the ground from the top of the Whole Cake Chateau, though he was rendered badly injured and incapacitated in the process. Streusen is also fast, as he ran across on the outer walls of the castle."}], "images": []}, {"title": "Culinary Expertise", "level": 3, "content": [{"type": "paragraph", "text": "As their executive chef, Streusen is in charge of all of the Big Mom Pirates' cooks. He is renowned as an outstanding master chef with more than 60 years of culinary experience. He could give commands to his subordinate chefs to prepare and bake a gigantic wedding cake of very refined culinary craftsmanship with intricate designs of skulls, crosses, roses, and even a large wedding altar. Even Big Mom holds his culinary skills in high regards. He has also been noted to be the only one who could remake the wedding cake that had been destroyed by Luffy. The WCI 31, who are the finest head chefs of Totto Land, held utmost respect for Streusen's skills and were shocked that Sanji actually succeeded in figuring out Streusen's newly designed secret recipe. Chiffon notes that despite Streusen's preeminent cooking prowess, Sanji's cooking skills are on a higher level. "}], "images": []}, {"title": "Musical Skills", "level": 3, "content": [{"type": "paragraph", "text": "He is also a very skilled opera singer. While he was preparing the wedding cake, he sang NON SUGAR LIFE in an elegant and moving tone that caused his subordinate chefs to respond emotionally, and during Sanji and Pudding's wedding ceremony, he led a makeshift choir consisting of some of his subordinate chefs to sing a melodious love song."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Streusen wields a cutlass, and was shown using it in conjunction with his Devil Fruit power. Streusen is a highly proficient and powerful swordsman. With a single slash, he could slice the massive top of the transformed Whole Cake Chateau to safely land the Big Mom Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/25/Streusen%27s_Swordsmanship.gif/revision/latest/scale-to-width-down/210?cb=20181016141437", "caption": "Streusen slicing the rooftop of the mountain-sized Whole Cake Chateau."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Streusen ate the Kuku Kuku no Mi, a Paramecia-type Devil Fruit that allows him to turn any object into food. By plunging his sword into objects, they become food, and he was even able to transform an entire castle into food in an instant. However, the food created with this ability, while nourishing, does not taste good."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/47/Kuku_Kuku_no_Mi_Infobox.png/revision/latest/scale-to-width-down/180?cb=20180527032147", "caption": "Streusen turning a log into meat pieces."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Streusen was once a chef and a pirate, but his career as the latter was ruined. He resided on an island, and 62 years before the start of the series, he witnessed a 6-year-old Charlotte Linlin unknowingly committing a horrifying act that caused the disappearance of Carmel and the children of Sheep's House. Finding the event funny, he decided to join up with her and not leave her alone. He approached Linlin, and the two eventually banded together, deciding to make the island into their dream country, which would become Whole Cake Island. The two operated together as Linlin began her pirating career, quickly becoming infamous until she finally became one of the Yonko. Streusen regained his career as a pirate, as the first and founding member of the Big Mom Pirates, alongside Linlin herself. It is unknown what Streusen did while Linlin joined the Rocks Pirates, but eventually when Rocks D. Xebec died and Linlin left to start/continue the Big Mom Pirates, Streusen remained with her ever since."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Streusen was first mentioned when he refused to give Charlotte Anana her knives."}, {"type": "paragraph", "text": "Streusen oversaw the making of the wedding cake for Sanji and Charlotte Pudding's upcoming wedding. He began to grow emotional as he listed each ingredient that was brought before him."}, {"type": "paragraph", "text": "When the Tea Party began, Streusen took part in its festivities. After Sanji and Pudding entered the venue, Streusen proudly presented the wedding cake and earned praise from Big Mom."}, {"type": "paragraph", "text": "When the wedding cake was ruined after duplicates of Monkey D. Luffy jumped out of it, Streusen tried to calm Big Mom while she was furious, but a fellow chef told him to run as Big Mom attacked them."}, {"type": "paragraph", "text": "Later, Big Mom's portrait of Mother Carmel was broken, and she let out a terrible scream which rendered Streusen and the rest of the attendees unable to move. The Fire Tank Pirates then came to assassinate Big Mom, and Streusen begged her to snap out of her despair."}, {"type": "paragraph", "text": "During the scuffle between the Big Mom Pirates and the enemy alliance, the Tamatebako dropped to the base of the Chateau and exploded, causing the castle to topple. As the Big Mom Pirates fell, Streusen plunged his sword into the venue, turning the falling castle into soft cake and saving the Big Mom Pirates in the process."}, {"type": "paragraph", "text": "However, Streusen was not cushioned by the cake and was thus severely injured by the hard landing, and a medic said it would take at least several days for him to recover as Streusen was given medical attention."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3f/Streusen_Presents_the_Wedding_Cake.png/revision/latest/scale-to-width-down/210?cb=20170417022503", "caption": "Streusen presents the wedding cake."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Veranderung_Gourmet.png/revision/latest/scale-to-width-down/210?cb=20180701032425", "caption": "Streusen turns the Whole Cake Chateau into soft cake."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a4/Streusen_Heavily_Injured.png/revision/latest/scale-to-width-down/210?cb=20180708020811", "caption": "Streusen heavily injured."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Streusen may be named after streusel, a crumbly dessert topping, which corresponds with the food-themed names of the Big Mom Pirates and Charlotte Family. ", "elements": []}, {"text": "Streusen's favorite food is apple crumble.", "elements": []}]}], "images": []}]}