{"sections": [{"title": "Carmel", "level": 1, "content": [{"type": "paragraph", "text": "Mother Carmel was a child trafficker dealing in orphans who operated in the Underworld several decades ago, under the code name \"Mountain Witch\". Running an orphanage known as the \"Sheep's House\", her seemingly benevolent nature caused her to be known as the \"Holy Mother\". In reality, she sold her orphan wards to the World Government every two years to be trained as Marines or Cipher Pol agents, until she met her end 62 years ago. Notably, she took care of a young Charlotte Linlin, who would later go on to become the Yonko Big Mom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Carmel was an elderly woman with a large, wrinkled face and a square-shaped jawline. She had long, wavy gray hair and wore lipstick. She wore dark blue nun's robes that have light blue frills on them, as well as a similarly-designed headdress. She was always seen either smoking a cigarette or holding one in her hand."}, {"type": "paragraph", "text": "At age 43, Carmel had blonde hair, no wrinkles on her face, and lacked lipstick. She was described at the time as \"beautiful\"."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Carmel was a shrewd businesswoman, raising large varieties of children in order to sell them. She was particularly interested in establishing relationships with powerful people in order to increase her influence, as shown when she put on an act with the Marines in order to gain connections to Elbaf and acquire children that she can sell at a higher value. Although she appeared to be a benevolent woman who cared for her children like a mother with a ceaseless smile, this was all an act in order to maintain her business, and she did not truly care about her children's well-being beyond ensuring they were fit to sell. She even admitted that she could not stand them. Carmel takes pride in the quality of her work, and is not above bringing up her own accomplishments while making deals."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Giants", "level": 3, "content": [{"type": "paragraph", "text": "Because she saved the Giant Warrior Pirates that were captured and about to be executed, Carmel was deeply respected by the giants. Because of this respect, the Elbaf giants accepted Carmel's terms in sparing Linlin's life. After the residents of the Sheep's House were forced to move to another country of giants, the giants there graciously built a new house on Carmel's behalf. However, Carmel only valued the giants because they allowed her to gain better quality children, and had no problems leaving Elbaf when she planned to retire. Her saving the Giant Warrior Pirates was no more than a scripted exchange with the Marines to sneak her into Elbaf. Her schemes allowed her to sell off one of Elbaf's citizens, John Giant, into the Marines without the giants' knowledge. After an Elbaf giant witnessed the incident where Linlin caused Carmel and the other orphans' disappearances, the giants' hatred for Linlin intensified to the point where they refuse to speak her name again."}], "images": []}, {"title": "Sheep's House Children", "level": 3, "content": [{"type": "paragraph", "text": "Because she took them in and gave them a home when they had nowhere else to go, Carmel was a beloved mother figure to the children. However, Carmel's true purpose for them was to sell them as spies, and she solely values them for the money they bring her. While away from them, she stated to Cipher Pol that she could not stand them and even called them all brats."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Because Carmel gave her a home, Linlin loved her and did whatever she said, even if she craved the opposite, unless she reached a physical breaking point. Carmel highly valued Linlin as well, but for her strength, as she was confident that Linlin's powerful strength would serve the Marines well and net her a particularly high payment in return. Carmel was so confident in Linlin's immense monetary worth that she was even willing to leave Elbaf to keep her around, forgoing the powerful relationships she had made with the Elbaf giants. Carmel seemed to have no inclination to discipline Linlin, as she only corrected her actions when a Sheep's House or Elbaf resident was threatened."}, {"type": "paragraph", "text": "Unfortunately for Carmel, before she could sell off Linlin, the latter unknowingly caused her to disappear on her sixth birthday. Linlin inherited Carmel's power and continues to hold her in high regard, oblivious to Carmel's true nature."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Carmel has shown herself to be an extremely charismatic orator and actress. Working with the government, she managed to fool the nation of Elbaf into thinking she wanted to help them by staging a rescue of the Giant Warrior Pirates. Her speech of benevolence and mercy even moved the condemned giant pirates to tears. The giants of Elbaf, including Jorul and Jarul, even held great respect for Carmel's claimed ideology in pacifism despite their dedication to militarism."}, {"type": "paragraph", "text": "She could also care for dozens of children of many varieties even in her old age, most notably Charlotte Linlin, as she was one of the few people whose words could quell Linlin's impulses. However, her capabilities were not absolute, as Linlin eventually snapped and went on a rampage after a week without food."}, {"type": "paragraph", "text": "A renowned seller in the Underworld, Carmel had connections to people as powerful as Cipher Pol and directly aided them by providing them with child spies. She was able to successfully negotiate an immensely high price for Linlin despite their initial hesitance. In return, the government gave her help in establishing good relations with Elbaf."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Carmel ate the Soru Soru no Mi, a Paramecia-type Devil Fruit that allows her to manifest and manipulate the souls of herself and other people. She was shown manifesting her own soul and putting a fragment of it in a rampaging fire to create a sun homie named Pandora, subduing the flames to save an Elbaf village. The powers of the fruit were later seen manifested in Charlotte Linlin after Carmel's disappearance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/13/Carmel_Creates_Pandora.png/revision/latest/scale-to-width-down/210?cb=20180513071514", "caption": "Carmel creates a sun homie."}]}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Carmel first began to sell children in the Underworld market around age 30, 111 years before the start of the series. About thirteen years later, after the Giant Warrior Pirates disbanded, some of their members were captured by the Marines. Carmel worked with the government, and they performed a pretend execution ceremony in which Carmel acted as though she was trying to stop it in order to prevent a war and work for coexistence between races. The giants bought her act, and Carmel opened an orphanage called the Sheep's House on Elbaf, becoming known as the Holy Mother. She took in children who had no place of their own regardless of their race, and sold an orphan to the World Government once every two years in order to serve as either Marines or Cipher Pol agents. With her connections to Elbaf, she was directly responsible for giving the Marines their first giant soldier, John Giant."}, {"type": "paragraph", "text": "After Charlotte Linlin was abandoned by her parents at the age of five, Carmel took her in as well. Carmel would always forgive Linlin, no matter how much damage she caused. She encouraged Linlin to persevere during Elbaf's twelve day fasting period, but Linlin eventually snapped and went on a rampage for semla. After arriving at the scene, Carmel watched in horror at the destruction Linlin caused. She then attempted to stop Jorul from attacking Linlin, but was unsuccessful as Linlin ended up fatally injuring the giant hero. Carmel then put a fragment of her soul into the fire Linlin had started, forming a sun homie named Pandora and quelling the blaze. The giants believed that Carmel had summoned the sun god and were in awe, but this was not enough to quell Jarul's anger towards Linlin. He prepared to kill her, but Carmel pleaded with him, agreeing that she would take Linlin out of Elbaf, and the giants agreed to these terms."}, {"type": "paragraph", "text": "Carmel took her children to another island, where they resumed a normal life in a new Sheep's House. However, soon afterwards she negotiated with a Cipher Pol agent for them to buy Linlin, claiming that she would make a strong Marine soldier. Growing tired of running her business, Carmel decided that this would be her last deal. On Linlin's sixth birthday, Carmel and the Sheep's House threw a big celebration, but as Linlin ate the croquembouche they had made, Carmel and all the other children disappeared and Carmel died, passing on her Devil Fruit powers to Linlin."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c7/Carmel_Saves_the_Giant_Warrior_Pirates.png/revision/latest/scale-to-width-down/210?cb=20180506204828", "caption": "Carmel saves the Giant Warrior Pirates from execution in order to gain good relations with Elbaf."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Carmel_Teaches_Linlin.png/revision/latest/scale-to-width-down/210?cb=20180513221448", "caption": "Carmel takes care of Linlin at the Sheep's House."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Carmel_Meets_With_Cipher_Pol.png/revision/latest/scale-to-width-down/210?cb=20180520040256", "caption": "Carmel prepares to sell Linlin to a Cipher Pol agent as her last Underworld deal."}]}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "Only two people ever witnessed the disappearances of Carmel and the orphans. One of them was an Elbaf giant who was worried about the Sheep's House, and he reported what he saw to the others back on his home island, leading the giants to further despise Linlin. The other person was Streusen, who found the incident amusing and befriended Linlin to make use of her immense potential, while hiding his knowledge of the truth of Carmel's disappearance."}, {"type": "paragraph", "text": "During all of her Tea Parties, Linlin places a picture of Carmel across from her at the table. If Carmel's picture is damaged, Big Mom will enter a psychological crisis, which will render her vulnerable enough to be physically injured. Reportedly, this information is privy only to the Charlotte Family. The portrait is eventually destroyed by Brook, causing Linlin to swear vengeance against the entire Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/37/Brook_smashes_portrait.png/revision/latest/scale-to-width-down/210?cb=20170424032639", "caption": "The destruction of Linlin's only memorial of Carmel."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Carmel's name may be a reference to the Carmelites, a religious order known for selling sweets in Japan, which corresponds with Carmel's nun-like outfit and title of \"Mother\". The sweets connection also matches the Big Mom Pirates and Charlotte Family food theme.", "elements": []}, {"text": "Carmel being a nun but also a children seller may be based in the lost children of Francoism, children who were abducted from Republican parents by Francoist troops, in which the Spanish Catholic Church played an important role.", "elements": []}, {"text": "Her alias is a reference to the yamanba of Japanese folklore. In some versions, they nursed young children before devouring them. Instead of eating them, Carmel sells off the children she took care of.", "elements": []}, {"text": "In reference with the fairy tale theme of the Big Mom Pirates, Carmel can be seen similarly to the witch in the Brothers Grimm story \"Hansel and Gretel\", in which they both do nice things for the kids but are actually planning a sinister purpose behind it, and in the end, they die by the hands of said kids.", "elements": []}, {"text": "Chronologically, she is the first person seen to have eaten a Devil Fruit.", "elements": []}, {"text": "Carmel's favorite foods were lamb and chocolate.", "elements": []}]}], "images": []}]}