{"sections": [{"title": "Stussy", "level": 1, "content": [{"type": "paragraph", "text": "Stussy is an agent of CP-0. In her cover as an emperor of the Underworld, she operates under the epithet of the \"Queen of the Pleasure District\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Stussy appears younger than her actual age, with short curly blonde hair, blue eyes, red lipstick, and red-painted fingernails. She wears a backfree salmon colored dress with a purple end, with pink diamond patterns on the bottom, a small white cape, a sunhat with a flower on it, and high heels shoes with ribbons on top. She carries a pink handbag with her."}, {"type": "paragraph", "text": "While working in her position as one of Saint Charlos' bodyguards, she wears a white dress with a pink necktie, white matching cape and gloves. She also dons fishnet stockings with fluffy rims and a garter belt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Unlike her occasionally more hostile fellow emperors, Stussy appears to be a polite woman and disapproves of insults being thrown around. However, she is sensitive about her age and can get violent if it is brought up."}, {"type": "paragraph", "text": "When her real self was revealed, she possesses a sadistic side which was shown when she shot down Du Feld, even stating she will have him take the blame for her actions. She also threatened an eavesdropping Morgans to create a fake story in order to cover up her and the World Government's actions."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3b/Stussy%27s_True_Nature.png/revision/latest/scale-to-width-down/150?cb=20190421174330", "caption": "Stussy shows her sadistic nature after shooting Du Feld."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 3, "content": [{"type": "paragraph", "text": "Stussy seems to be good terms with Big Mom, whom she addresses casually as \"Linlin\". However, since her status as a CP-0 agent has come to light, it appears Stussy was just using Big Mom to obtain the Tamatebako and even used Du Feld as a scapegoat to cover her tracks. While Stussy was partly responsible for the destruction of the Whole Cake Chateau, as shooting Du Feld caused his unconscious body to drop the Tamatebako to later explode at the base of Big Mom's castle, the CP-0 agent managed to pin all the blame on the Straw Hat Pirates by telling Linlin's subordinates that the Tamatebako held explosives."}], "images": []}, {"title": "Morgans", "level": 3, "content": [{"type": "paragraph", "text": "Morgans and Stussy have apparently helped each other several times in the past. As both hold priviliged positions for information gathering, the two have been exchanging precious intel for some time, so that Morgans can obtain exclusive scoops while Stussy gets access to all of the World Economic Journal's reports. Morgans accepted to cover up her involvement in Big Mom's Tea Party and allowed her to take a ride in his balloon in order to sneak away from Totto Land."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Stussy has incredible infiltration skills, being a secret agent of CP-0 who climbed the ranks of the Underworld until becoming one of its emperors. As such, Stussy has some degree of power over it, and she is important enough to be invited to the Yonko Big Mom's tea parties. She was also instinctive enough to notice Morgans eavesdropping on her."}, {"type": "paragraph", "text": "Stussy also possesses considerable willpower, as she was able to withstand a Haoshoku Haki blast from Big Mom."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Being a member of CP-0, the strongest of Cipher Pol, Stussy possesses superior superhuman strength. With a single finger thrust, she can produce a concentrated shockwave powerful enough to pierce Du Feld, a large man, from a considerable distance, knocking him unconscious."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "As a member of Cipher Pol, Stussy is highly skilled in the Rokushiki martial arts. She can use Tobu Shigan, a more powerful variation of Shigan, to pierce Du Feld from a distance, and was also shown using Geppo to escape the collapsing chateau."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Stussy possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in her life, Stussy joined the CP-0. She was later assigned an undercover role as one of the emperors of the Underworld."}, {"type": "paragraph", "text": "Due to her cover, Stussy was invited to Big Mom's Tea Party, where Charlotte Pudding would be married to Sanji."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Stussy and some of the other emperors arrived on Whole Cake Island, where she expressed disapproval when Du Feld and Drug Peclo started insulting each other. They were escorted to the banquet hall by Charlotte Perospero on a candy escalator, and in the banquet hall, Stussy drank juices wrung out of a giraffe by Charlotte Smoothie before the tea party began."}, {"type": "paragraph", "text": "Later on, Stussy and the other emperors of the Underworld offered their gifts to Big Mom, who was overjoyed by the amount. Big Mom then told them of the Tamatebako, which she would open after the ceremony alongside the other gifts. Stussy and the other guests then looked forward to the event with excitement. After Sanji and Pudding entered the venue, Stussy commented on how Pudding reminded her of her younger days. Du Feld then asked Stussy of her age and she responded by hitting him. Moments after Monkey D. Luffy and his group started causing chaos at the wedding venue, Luffy caused Big Mom to start her strange scream and Stussy was immobilized and forced to cover her ears."}, {"type": "paragraph", "text": "Right after Du Feld spotted the Tamatebako on the edge of a lower platform, Stussy confronted him and questioned him on his intentions. Du Feld then slipped and fell to the where the chest was. Before he could open it, Stussy shot him with a Tobu Shigan. She then made sure that an eavesdropping Morgans would blame Du Feld for the theft of the chest. Du Feld's unconscious body leaned on the chest, causing it to fall. Stussy and Morgans both watched in shock as the chest dropped to the base of the Whole Cake Chateau and exploded. As the castle collapsed, Stussy used Geppo to remain in the air and agreed with Morgans' statement that it would be huge news if this was the end of the Big Mom Pirates."}, {"type": "paragraph", "text": "Hours after the collapse of the Whole Cake Chateau, Stussy and Morgans met with Mont-d'Or and Count Niwatori, and she revealed that the explosion that caused the castle to collapse came from the Tamatebako. When Mont-d'Or promised Morgans that the Big Mom Pirates would execute the Straw Hats and put their heads on display, Stussy commented on how vulgar their intentions were. As the chaos in Totto Land further intensified, Stussy and Morgans snuck away from Whole Cake Island. While they were riding in a balloon, Morgans was cheering for the Straw Hats to escape, prompting Stussy to comment that he was taking their side."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c7/Tea_Party_Infobox.png/revision/latest/scale-to-width-down/210?cb=20180408095306", "caption": "Stussy takes part in the Tea Party festivities."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Stussy_Shoots_Du_Feld.png/revision/latest/scale-to-width-down/210?cb=20180129210229", "caption": "Stussy shoots Du Feld to take the Tamatebako for herself."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dd/Stussy_and_Morgans_Meet_the_Big_Mom_Pirates.png/revision/latest/scale-to-width-down/210?cb=20181216030251", "caption": "Stussy and Morgans meet with Mont-d'Or and Niwatori."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Following the events in Totto Land, the CP-0 agent made her way to Mary Geoise. As Charlos tried to enslave Shirahoshi prior to the Levely, Stussy was there alongside Lucci and Kaku, guarding the World Noble."}], "images": []}]}