{"sections": [{"title": "Morgans", "level": 1, "content": [{"type": "paragraph", "text": "\"Big News\" Morgans is the president of the World Economy News Paper and one of the emperors of the Underworld."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "With his Devil Fruit powers active, Morgans has the form of a very tall human albatross hybrid with small eyes and a large beak. His body is covered in white feathers, and he has a large tail and wings that resemble human arms. He wears a blue top hat with a large striped feather in it, a light blue button-down shirt with a yellow bow on the top, red and white checkered pants, a dark cape, and shoes that fit his bird-like feet."}, {"type": "paragraph", "text": "It is currently unknown what he looks like in his human form."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/79/Morgans_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180912233306", "caption": "Morgans's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Morgans gets excited by major events, looking forward to reporting them as news to the world. He tends to exclaim \"Big News!\" when witnessing a newsworthy event. In fact, whenever a big scoop would pop up, he would retain his calm and composure just to get it, despite the chaos and danger the opportunity presents. As the President of the World Economy News Paper, Morgans takes utmost pride in his occupation as a journalist and does not tolerate being called otherwise. He is even willing to risk his life on occasion just to take pictures of a newsworthy event. He is not even afraid of incurring a Yonko’s wrath upon himself, as seen when he intentionally wrote an article of Big Mom’s defeat, knowing full well what consequences that action could do to him."}, {"type": "paragraph", "text": "While claiming that he has deep connections with the Germa, he showed no caring concerns for their well-being, as when the Big Mom Pirates revealed their treacherous plot to obliterate Germa's ruling family, Morgans simply found the turn of events to be exciting."}, {"type": "paragraph", "text": "He has proven to be an unscrupulous individual, as when Big Mom was dealing with her enemies, Morgans tried to peek into the contents of the Tamatebako and was caught eavesdropping on the events with Du Feld and Stussy. He agreed to create a fake story to cover Stussy's tracks in exchange for seeing the famous sea treasure. He can also be prone to letting his personal biases influence his news stories, as his respect and admiration for Luffy caused him to exaggerate the pirate's accomplishments against Big Mom."}, {"type": "paragraph", "text": "Morgans has a soft spot for beautiful women, as he was completely captivated by Shirahoshi."}, {"type": "paragraph", "text": "He has a distinct laugh: \"Kuwahahaha\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Germa 66", "level": 3, "content": [{"type": "paragraph", "text": "Morgans had a deep connection to Germa 66 and made them the main antagonists of his comic Sora, Warrior of the Sea. However, when the Big Mom Pirates revealed their treachery toward the Vinsmoke Family, Morgans had no concern for them and was excited at this turn of events."}], "images": []}, {"title": "Monkey D. Luffy", "level": 3, "content": [{"type": "paragraph", "text": "Morgans has shown a strong respect for Luffy due to his reputation as a member of the Worst Generation and an infamous troublemaker. Morgans was excited to highlight of Luffy's troubles during the Tea Party. After the incident in Totto Land, Morgans declared Luffy as the \"Fifth Emperor\" through out the world."}], "images": []}, {"title": "Stussy", "level": 3, "content": [{"type": "paragraph", "text": "Morgans and Stussy have apparently helped each other several times in the past. As both hold privileged positions for information gathering, the two have been exchanging precious intel for some time, so that Morgans can obtain exclusive scoops while Stussy gets access to all of the World Economy paper's reports. Morgans begrudgingly agreed to cover up her involvement in Big Mom's Tea Party and allowed her to take a ride in his balloon in order to sneak away from Totto Land."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Morgans was one of the guests for Big Mom's Tea Party. However, after Morgans spread the news about Big Mom's \"defeat\" to Luffy, she swore revenge on him."}], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Morgans does not appear to be on good terms with the Government. He refused to accept a bribe from them on not exposing a certain event at the Levely. When threatened by a Cipher Pol agent (who masqueraded as Attach), he quickly beat up the agent and told his workers to move their headquarters to hide from the government's retaliation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Morgans is in charge of the World Economy News Paper, giving him control over the newspaper and the information it gives to people. He has access to information not available to most people, as demonstrated by his knowledge of Big Mom's recent acquisition of the Tamatebako and of her Soul Pocus technique."}, {"type": "paragraph", "text": "Furthermore, as a boss of the Underworld, Morgans has a high degree of power within it. His importance is recognized by the Yonko Big Mom, who invited him to a Tea Party. He also has deep bonds with the Germa, and his newspaper incidentally publishes a popular comic strip that features their army as its main antagonists."}, {"type": "paragraph", "text": "Morgans does not fight often, but he has considerable combat skills, as he was able to dodge bullets fired by a Cipher Pol agent and quickly beat up the agent within seconds. He also possesses considerable willpower, as he was able to withstand a blast of Haoshoku Haki from Big Mom."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Morgans ate the Tori Tori no Mi, Model: Albatross, a Zoan-type Devil Fruit which allows him to transform into an albatross. However, he cannot fly."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Morgans received an invitation from Big Mom to attend her Tea Party, where Charlotte Pudding and Sanji would be married, and he was happy to have been invited and excited to report the event in the newspaper. He and his fellow Underworld bosses were escorted by Charlotte Perospero into the Whole Cake Chateau, where they were taken to the wedding venue by a candy escalator. At the venue, Morgans came to Smoothie's drink stand before the tea party began. During the tea party, Morgans spoke with Vinsmoke Judge. Later, he presented Big Mom with his present, a rare gift from the south, before asking her about the Tamatebako in her possession. He then took part in the festivities as the wedding ceremony began."}, {"type": "paragraph", "text": "When Streusen presented the wedding cake, Morgans marveled at it. During the wedding ceremony, Monkey D. Luffy emerged from the wedding cake, and Morgans ran away from the explosion. When Du Feld commented on the chaos, Morgans was excited at Luffy's presence at the wedding. He soon noted that Big Mom's power allowed her to take the souls of those afraid of her. Morgans was also thrilled at the thought of reporting Jinbe's declaration to leave Big Mom's crew to join the Straw Hat Pirates. He was amazed to see that Big Mom was unable to take away Jinbe's lifespan due to him having no fear towards Big Mom."}, {"type": "paragraph", "text": "When the Big Mom Pirates revealed their treachery towards the Vinsmoke Family, Morgans was excited by this turn of events. Moments later, Luffy caused Big Mom to start her strange scream and Morgans was immobilized from having to cover his ears. After Big Mom stopped screaming, Morgans witnessed Stussy shoot Du Feld when the latter was about to open the Tamatebako. Stussy then made sure that Morgans would blame Du Feld for the theft of the chest. Morgans then requested to see the contents of the chest, which Stussy allowed. However, Du Feld's unconscious body was leaning on the chest, causing it to fall off the platform it was on. Both Morgans and Stussy watched in shock as the chest dropped to the base of the Whole Cake Chateau and exploded. The explosion caused the Chateau to collapse, and Morgans excitedly snapped pictures, forgetting that he was falling too until Stussy told him and then panicking because of his inability to fly."}, {"type": "paragraph", "text": "Despite the fall, Morgans survived and was shown unharmed. Hours after the collapse of the Whole Cake Chateau, Morgans and Stussy met with Niwatori and Mont-d'Or. As Stussy was about to reveal that the explosion that toppled the Chateau was caused by the Tamatebako, Morgans pointed out that this revelation would further decrease the Straw Hats' chances for survival, but she went ahead and told them anyway. As the Straw Hats' promised rendezvous time on Cacao Island drew near, Morgans commented that it would be unbelievable news if Luffy overcame the slim odds of escape, but Mont-d'Or promised him that the Big Mom Pirates' forces would crush the Straw Hats."}, {"type": "paragraph", "text": "As the chaos in Totto Land further intensified, Morgans and Stussy snuck away from Whole Cake Island. While he and Stussy were riding in a balloon, Morgans cheered for the Straw Hats to escape before sharing with Stussy his belief that the next Pirate King would come from the Worst Generation."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c7/Tea_Party_Infobox.png/revision/latest/scale-to-width-down/210?cb=20180408095306", "caption": "Morgans attending Big Mom's tea party."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dd/Stussy_and_Morgans_Meet_the_Big_Mom_Pirates.png/revision/latest/scale-to-width-down/210?cb=20181216030251", "caption": "Morgans and Stussy meet with Mont-d'Or and Niwatori."}]}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Straw Hats escaped Totto Land, Morgans wrote an article detailing Luffy's exploits, giving him credit for orchestrating the assassination attempt on Big Mom and declaring him to be the \"Fifth Emperor\" among the Yonko."}, {"type": "paragraph", "text": "He later went to the Red Port at the Red Line to see the royals who would be attending the Levely. Upon seeing Shirahoshi, Morgans was mesmerized by her beauty. When he saw Sterry, Morgans noted that Luffy, Ace, Sabo, and Dragon also came from the Goa Kingdom."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "At the World Economic News headquarters, Morgans was ordering his employees around on how to format the front page scoop. Attach alerted Morgans of a letter from the World Government, which turned out to be bribe money to keep a certain incident under wraps. Because the incident was such a huge scoop, Morgans ordered Attach to send the money back. At this moment, the man that had appeared to be Attach suddenly ripped off his face mask and pointed a gun at Morgans, revealing himself as a Cipher Pol agent. However, Morgans knocked out the agent, refusing to back down from any threats because of his pride as a reporter. Worried on how the Cipher Pol infiltrated his organization, he ordered his employees to move their headquarters somewhere safe. Morgans was then told that Wapol was in contact, claiming to have some information."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Morgans's bird-like appearance may be a reference to the news coo, birds that deliver newspapers in the One Piece world via flight. This is ironic considering how Morgans is unable to fly.", "elements": []}, {"text": "His design might be a reference to the Dodo from Lewis Carroll's Alice's Adventures in Wonderland. His attire resemble that of the character from the Disney film from 1951.", "elements": []}, {"text": "In the anime, he was shown to arrive at Whole Cake Island by boat bearing a figurehead in his image.", "elements": []}, {"text": "Morgan's name could be based of news reporter Piers Morgan.", "elements": []}, {"text": "Morgans' favorite food is popcorn.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/News_Coo.png/revision/latest/scale-to-width-down/210?cb=20190904184940", "caption": "News Coo"}]}]}