{"sections": [{"title": "Drug Peclo", "level": 1, "content": [{"type": "paragraph", "text": "Drug Peclo is the \"Major Undertaker\" (大手葬儀屋, Ōte Sōgi-ya) and an emperor of the Underworld."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Peclo is a large man with very puffy light hair resembling a lion's mane, who wears a metallic mask over the top of his face that has red star markings over the eye holes. He also wears a light brown jacket with four pockets and the numbers \"495\" (499 in the anime) above them, pants with the same pockets, an orange tie, and a belt. He also has a dark arm strap with some kanji for \"Death\" written on it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Drug_Peclo_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180918161433", "caption": "Peclo's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Peclo is not above insulting his fellow Underworld emperors, as shown when he retaliated against Du Feld insulting him. Like many people, he has a unique laugh: \"Gugigigugi\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an emperor of the Underworld, Drug Peclo has a strong degree of power within it. His importance is recognized by the Yonko Big Mom, who has invited him to her tea parties."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Peclo carries a scythe, and is shown to carry it over his shoulder."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Peclo was invited by Big Mom to a Tea Party in which Charlotte Pudding would marry Sanji. Du Feld began belittling Peclo, causing Peclo to retaliate. Charlotte Perospero welcomed the emperors to the Whole Cake Chateau and created a candy escalator in order to get them to the banquet hall. In the hall, Peclo watched with glee as Stussy drank liquids squeezed out of a giraffe by Charlotte Smoothie. Peclo is seen conversing with Ichiji at a table with some other guests."}, {"type": "paragraph", "text": "Peclo watched as the wedding ceremony began. During the ceremony, duplicates of Monkey D. Luffy emerged from the wedding cake, and Peclo ran away from the explosion. Peclo was later shocked to witness Big Mom taking the chefs' lifespans in a fit of rage after the wedding cake was ruined."}, {"type": "paragraph", "text": "Right after Brook destroyed the picture of Carmel, Peclo was disturbed when Brook removed his Luffy mask, thinking that he removed his actual skin. Peclo later witnessed Charlotte Daifuku trying to kill Sanji after Pudding failed in her task."}, {"type": "paragraph", "text": "When the Tamatebako dropped to the base of the Whole Cake Chateau, the bomb inside the chest exploded, causing the chateau to topple over. As the castle collapsed, Drug Peclo fell with it."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, he was shown to arrive at Whole Cake Island by boat bearing a figurehead in his image.", "elements": []}, {"text": "Despite how guests have their weapons temporarily confiscated during Big Mom's Tea Party, Drug Peclo seems to be an exception as he was allowed to keep his scythe.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 860 (p. 8-12, 15-17) and Episode 830, Drug Peclo makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 85 Chapter 857 (p. 9) and Episode 826, Jinbe mentions the Emperors of the Underworld.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 861 and Episode 831, Peclo and Ichiji are conversing with other guests at a table.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 862 and Episode 832.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 863 and Episode 833.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 864 and Episode 834.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 87 Chapter 872.", "elements": []}]}], "images": []}]}