{"sections": [{"title": "Giberson", "level": 1, "content": [{"type": "paragraph", "text": "Giberson, known as \"The Concealer\", is a veteran warehouseman and one of the emperors of the Underworld."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Giberson is an older man whose back is slightly hunched. He has a big white mustache and wears a tall striped hat on his head; no hair can be seen on the top of his head. He wears a striped suit and pants."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cb/Giberson_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180917174412", "caption": "Giberson's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Giberson appears to be a heavy drinker, as he has always been seen with a bottle in hand, and often acts jovially drunk."}, {"type": "paragraph", "text": "Despite the Charlotte Family revealing their treacherous plot to destroy the Vinsmoke Family, Giberson insensitively found Vinsmoke Judge's crying and pleas to be amusing, and was not bothered by this act of betrayal (albeit not directed to him)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an emperor of the Underworld, Giberson possesses some amount of power within it. He is important enough to be invited to the Yonko Big Mom's tea parties."}, {"type": "paragraph", "text": "He is shown to have a strong will, being able to resist Big Mom's Haoshoku Haki and remain conscious from her scream."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Giberson was invited to Big Mom's Tea Party, where Charlotte Pudding and Sanji would get married. He and several other emperors arrived on Whole Cake Island, and when Morgans expressed excitement at reporting the tea party in the news, Giberson replied that the news would be old once it reached the Underworld. Charlotte Perospero then escorted the emperors to the banquet hall on a candy escalator, and the tea party began."}, {"type": "paragraph", "text": "As the tea party began, Giberson and his fellow emperors presented Big Mom with their gifts. They were excited to see the Tamatebako nearby and hear that Big Mom would reveal its contents after the wedding ceremony. During the wedding ceremony, Monkey D. Luffy and several copies of him burst out of the cake, and in the midst of the chaos, Giberson was seen with one of the Luffy duplicates riding on his back."}, {"type": "paragraph", "text": "When the Big Mom Pirates revealed their treachery to the Vinsmoke Family, Giberson was amused by how Judge was crying in the face of death. Moments later, Luffy caused Big Mom to start her strange scream and Giberson was immobilized from having to cover his ears."}, {"type": "paragraph", "text": "When the Tamatebako dropped to the base of the Whole Cake Chateau, the bomb inside the chest exploded, causing the chateau to topple over. As the castle collapsed, Giberson fell with it."}], "images": []}]}