{"sections": [{"title": "Jigra", "level": 1, "content": [{"type": "paragraph", "text": "Jigra was an organ trader and a member of the Underworld who attempted to attack the Big Mom Pirates. In the anime, he is also part of the Organ Dealing Assassination Group"}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jigra was an average-sized man with turquoise hair, slightly balding at the forehead. He has a long mustache that resembles a breadstick, and wears goggles over his eyes and a light fedora on his head. He also wears a dark purple suit, dark purple pants, and dark shoes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jigra was naive, as he did not expect to receive the consequences of failing to attend one of Big Mom's tea parties. Instead, he believed that by writing a letter of explanation would excuse him. Upon receiving his father's head as failure to attend, Jigra showed his vengeful side, attempting to infiltrate the next party to assassinate her, and was willing to attack the security to force his way in."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Parents", "level": 3, "content": [{"type": "paragraph", "text": "Jigra loved his parents, as he dutifully attended his mother's funeral over Big Mom's Tea Party, despite knowing the latter was an actual absolute summon order. Upon receiving his father's head in a box as punishment for not attending, Jigra attempted to avenge him by attacking Big Mom."}], "images": []}, {"title": "Organ Dealing Assassination Group", "level": 3, "content": [{"type": "paragraph", "text": "The Organ Dealing Assassination Group is an anime only Underworld organization, that deal with organs trades. In the anime, it was shown the Jigra was part of the group, and he tried to use his previous invitation in order for them to get access to the Tea Party."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Charlotte Linlin found Jigra important enough to be invited to her tea parties, and sent him an invitation. Jigra was naive enough to believe that by writing a letter of excuse would be sufficient for Big Mom to understand and forgive him for being absent, but that turned out not to be the case. Linlin had Jigra's beloved father killed and the head sent as a \"present\", which incurred Jigra's wrath and incited him for revenge. Despite this cruel treatment, Big Mom nevertheless sent Jigra another invitation for the next party, oblivious to the animosity she created for him. When Jigra attempted to force his way in for vengeance, he was promptly executed by Charlotte Katakuri."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an organ trader of the Underworld, Jigra had some amount of power over it. He was important enough to have been invited to one of Big Mom's tea parties."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Jigra wielded a flintlock. He was presumably competent with it, as Katakuri foresaw him shooting and killing two of Capone Bege's men after glancing into the future."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Jigra was invited to a Tea Party by Big Mom, but did not attend because he went to his mother's funeral. He wrote a letter to Big Mom to try to explain his absence, but Big Mom sent him the head of his sick father in a box."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "At some point in the past, he joined the Organ Dealing Assassination Group, and they planed to infiltrate another one of Big Mom's parties."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Before the wedding between Charlotte Pudding and Sanji began, Jigra tried to enter the wedding venue in order to attack Big Mom in revenge for killing his ill father. However, he refused to go through a body check and his planned attack was thwarted when Charlotte Katakuri shot a jelly bean through his forehead, having foreseen Jigra shooting and killing two of Bege's men."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/79/Jigra%27s_Death.png/revision/latest/scale-to-width-down/210?cb=20180401031937", "caption": "Jigra shot through the head."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 860 (p. 12-13) and Episode 830, Jigra makes his debut.", "elements": []}, {"text": "↑  One Piece Anime — Episode 830, The Organ Dealing Assassination Group appear.", "elements": []}]}], "images": []}]}