{"sections": [{"title": "Du Feld", "level": 1, "content": [{"type": "paragraph", "text": "Du Feld, known as the \"God of Fortune\", is the \"Loan Shark King\" (闇金王, Yamikin-Ō). He is a member of the Du Feld Conglomerate and an emperor of the Underworld."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Du Feld is a rotund man with large ears, nose, and lips, and a scar between his eyes. His hair is arranged in cornrows, alternating between blonde and dark, and he wears a small pair of glasses and smokes a cigar. He wears a vivid purple suit with a rose attached to his left breast, as well as a dark purple fur coat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Du_Feld_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180918161425", "caption": "Du Feld's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Du Feld appears to be gracious when in a formal setting, as he complimented the abilities of his host Perospero. However, he appears to be quite rude in regular conversations, as he wondered why Drug Peclo was invited to Big Mom's Tea Party, intending the remark as an insult, which caused Stussy to call him small-minded."}, {"type": "paragraph", "text": "Du Feld is also greedy and unscrupulous, as he attempted to steal the treasure within the Tamatebako when given the opportunity despite it belonging to Big Mom. He found the Big Mom Pirates' treachery against the Vinsmoke Family amusing rather than disturbing, laughing as Judge cried as this meant the impending end of the Germa."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an emperor of the Underworld, Du Feld has strong degree of power within it. His importance is recognized by the Yonko Big Mom, who has invited him to her tea parties. He is shown to have a strong will as he was able withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud screams."}, {"type": "paragraph", "text": "He fell from a significant height without suffering any noticeable injuries in his attempts to open the Tamatebako, but was incapacitated when hit with a Tobu Shigan. "}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Du Feld and his family were invited by Big Mom to a Tea Party in which Charlotte Pudding would marry Sanji. Du Feld wondered why Drug Peclo was also invited, and Stussy told him to stop being small-minded. Charlotte Perospero welcomed the emperors to the Whole Cake Chateau and created a candy escalator in order to get them to the ceremony faster; Du Feld expressed his amazement at Perospero's craftsmanship. As the tea party began, Du Feld and his fellow emperors presented Big Mom with their gifts. They were excited to see the Tamatebako nearby and hear that Big Mom would reveal its contents after the wedding ceremony."}, {"type": "paragraph", "text": "After Sanji and Pudding entered the venue, Stussy commented on how Pudding reminded her of her younger days. Du Feld then asked Stussy of her age and she responded by hitting him. During the ceremony, several copies of Monkey D. Luffy emerged from the cake and started causing a ruckus. Du Feld originally thought this was a planned spectacle, but Morgans corrected him that it was actually an unexpected development. Du Feld later witnessed Jinbe officially resigning from the Big Mom Pirates and was amazed when Big Mom was unable to take away Jinbe's lifespan. Right after Brook destroyed the picture of Carmel, Du Feld was disturbed when Brook removed his Luffy mask, thinking that he removed his actual skin. When the Big Mom Pirates revealed their treachery towards the Vinsmoke Family, Du Feld casually commented that Germa was done for."}, {"type": "paragraph", "text": "While enduring Big Mom's scream, Du Feld picked up some mochi earplugs that were lying on the floor. He then prepared to open the Tamatebako and steal its contents, but Big Mom's scream caused the chest to be blown out of the Whole Cake Chateau and fall a great distance below. After spotting the Tamatebako, which fell to a safe place on the edge of a platform, Du Feld pondered on how to reach the chest. He was then confronted by Stussy, who questioned him on his intentions. He then slipped and fell to where the Tamatebako was. However, before he could open the chest, Stussy shot him with a Tobu Shigan. His unconscious body leaned on the chest, causing it to drop to the base of the Whole Cake Chateau."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c7/Tea_Party_Infobox.png/revision/latest/scale-to-width-down/210?cb=20180408095306", "caption": "Du Feld partakes in the tea party festivities."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Du_Feld_Loses_the_Tamatebako.png/revision/latest/scale-to-width-down/210?cb=20170619040548", "caption": "Du Feld watches as his stolen Tamatebako flies into oblivion."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, he was shown to arrive at Whole Cake Island by boat bearing a figurehead in his image.", "elements": []}]}], "images": []}]}