{"sections": [{"title": "Charlotte Daifuku", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Daifuku is the third son and fourth child of the Charlotte Family and the middle triplet brother of Katakuri and Oven. He is also an officer of the Big Mom Pirates and serves as Totto Land's Minister of Beans (豆大臣, Mame Daijin), governing over Poripori Island."}, {"type": "paragraph", "text": "Due to his actions and role, he is a major antagonist in the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Daifuku is an extremely tall and broad man with a shaved head with short blonde hair, and some wrinkles on his face, as well as a small mustache. His eyes are yellow, and he often wears a hard-faced expression. "}, {"type": "paragraph", "text": "He wears a dark blue-colored coat with very large, blue and white striped shoulder-pads that is lined with fur on the inside and around the base, and a yellow cape hangs from his shoulders. He also wears hooped earrings and a thick belt around his waist; a genie's lamp is depicted on the belt."}, {"type": "paragraph", "text": "As a child, Daifuku has shaved head with short grey hair. He wore a tank top and navy blue pants."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Daifuku is very abrasive and violent, intent on taking down his enemies as quickly as possible and becoming extremely angry if they elude him. He also seems to have little regard for his crew while he is focused on a target, as he allowed his genie to destroy many of his own fleet's ships while pursuing Carrot."}, {"type": "paragraph", "text": "He is not above striking and verbally abusing people whom he thinks are failing or getting in the way, even if they are his own family, as Daifuku did to his sister Pudding, cruelly calling her useless."}, {"type": "paragraph", "text": "Daifuku seems to believe that strength matters in the crew as he stated that Katakuri should be leader if Big Mom meets her unforeseen demise."}, {"type": "paragraph", "text": "Daifuki is confident in his Devil Fruit. When Pudding failed to kill Sanji, he took it upon himself to eliminate him with his genie. This was shown again when he decided to take it upon himself to sink the Thousand Sunny. However, he happens to underestimate his opponents, as he did not count on Carrot's Sulong form."}, {"type": "paragraph", "text": "In spite of his abrasiveness and cruelty, Daifuku does care for his family and, by extension, Totto Land, as he become shocked when Big Mom had another craving illness and expressed concern about stopping her rampage after Streusen got injured during the collapse of the Whole Cake Chateau. He also got along with his brothers, Oven and Katakuri, and he never scorned Katakuri for his eel-like mouth."}, {"type": "paragraph", "text": "He also got enraged at Carrot for destroying many of his crew's ships and went his way to defeat her only to destroy his own ships in the process."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Daifuku_Hits_Pudding.png/revision/latest/scale-to-width-down/210?cb=20180429192051", "caption": "Daifuku hits his sister Pudding after she fails her task."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Daifuku is very loyal to his mother, and participated in her plot to assassinate the Vinsmoke Family and also confronted the Sanji Retrieval Team after they crashed the wedding. He even accompanied his mother to Kaido's territory at Wano Country for revenge against the Straw Hats."}], "images": []}, {"title": "Charlotte Pudding", "level": 4, "content": [{"type": "paragraph", "text": "Daifuku is disappointed in his younger sister Pudding as he called her a \"useless good for nothing\" due to her failure to kill Sanji and even slapped her away to confront Sanji himself. Despite that, Daifuku did not object when Pudding volunteered to make a new wedding cake for Big Mom."}], "images": []}, {"title": "Charlotte Katakuri", "level": 4, "content": [{"type": "paragraph", "text": "Daifuku gets along well with his older brother and fellow triplet Katakuri. After the Straw Hat Pirates, Fire Tank Pirates and the Vinsmoke Family got away, Daifuku and Katakuri collaborated to pursue them. Both were shown to get along during their childhood, eating donuts together and Daifuku was amused by Katakuri's donut gorging habits. Daifuku was also aware of Katakuri’s split mouth and never scorned him for it. Daifuku even said that Katakuri should be captain of the Big Mom Pirates if anything happens to Big Mom, showing respect for Katakuri's capabilities."}], "images": []}, {"title": "Charlotte Perospero", "level": 4, "content": [{"type": "paragraph", "text": "Daifuku gets along well with his eldest sibling and older brother. However, Perospero is not above insulting Daifuku for letting an enemy get the better of him and letting them escape while calling him useless. They also argued over who should lead the crew if anything happens to Big Mom with Perospero claiming that the eldest sibling should be the leader."}], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "As one of the high-ranking members of the Big Mom Pirates and a son of the Charlotte Family, Daifuku is well respected in the crew. However, he cares little to none of the well-being of his crew, as he did not hesitate to destroy his own fleet in his reckless pursuit of Carrot while killing several of his own surbordinates without hesitation."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Fire Tank Pirates", "level": 4, "content": [{"type": "paragraph", "text": "They once served under Big Mom's crew and were seemingly loyal. However, when Bege revealed his treachery by attempting to kill Big Mom, the Fire Tank Pirates became enemies of Daifuku and his family."}], "images": []}, {"title": "Sanji Retrieval Team", "level": 4, "content": [{"type": "paragraph", "text": "Daifuku is an enemy of the Sanji Retrieval Team as he attempted to kill Sanji in Pudding's place. When Sanji was attempting to save his family, Daifuku pinned him down before he could reach them but failed to keep him down when Big Mom screamed, allowing Sanji to free his family. When Carrot attempted to retreat to \"Big Father\", Daifuku detained her only for Yonji to free her. After the Straw Hat Pirates and their allies escaped, Daifuku formed three pursuit teams to chase them down. When pursuing them on the sea, Daifuku was ready to ambush them but was not prepared for Carrot entering her Sulong form and attacking his fleet. While enraged at Carrot's actions, he tried attacking her with his genie, but it instead destroyed several of the ships in his fleet."}, {"type": "paragraph", "text": "Upon encountering the Retrieval Team again, Daifuku continued his vendetta against Carrot, summoning the now larger Genie to attack her on the Sunny's mast, but Sanji blocked the genie's strike with a kick. Daifuku was angered when the crew managed to elude him and escape Totto Land."}], "images": []}, {"title": "Vinsmoke Family", "level": 4, "content": [{"type": "paragraph", "text": "As part of his mother's plot to assassinate the Vinsmoke Family, Daifuku became their enemy. After Pudding failed to kill Sanji, Daifuku decided to kill Sanji himself. As Daifuku was about to kill Carrot, Yonji slammed his genie to the ground to free her. As the Vinsmokes fought the Charlotte Family, Daifuku overpowered Sanji but failed to kill him as the Tamatebako exploded, causing the Whole Cake Chateau to collapse."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As Minister of Beans, Daifuku has authority over Poripori Island in Totto Land, and as an officer in the Big Mom Pirates, he holds a high position in the crew and has authority over lower-ranking members, being able to lead a fleet of ships into battle. Vito noted Daifuku as one of the \"monsters\" among the Big Mom Pirates, comparing him to his Sweet Commander siblings Katakuri and Smoothie. With a bounty of 300,000,000, the World Government considers him a threat."}, {"type": "paragraph", "text": "Jinbe, an extremely powerful pirate and a former Shichibukai, considered Daifuku a formidable opponent. In the anime, alongside Oven, he completely overpowered the Organ Dealing Assassin Group which consist of 100 highly skilled and powerful assassins who easily subdued the Fire Tank Pirates, one of the Worst Generation pirate crews."}, {"type": "paragraph", "text": "Daifuku possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Befitting his size, Daifuku has enormous physical strength as shown when he sent Pudding flying a very far distance by a slap from one hand."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Daifuku ate the Hoya Hoya no Mi, a Paramecia-type Devil Fruit that allows him to summon a halberd-wielding genie from his body by rubbing himself. The genie has immense strength, able to easily overpower Sanji with raw force alone. Although in the anime, a direct hit from Sanji's 'Diable Jambe: Flambage Shot' briefly subdued it and caused it to explode from the flames. It can also destroy fleets of Tarteships with great ease."}, {"type": "paragraph", "text": "The genie is quite powerful, able to overpower even Sanji, a powerful martial arts master. It is capable of cutting through many Tarte ships in half with a single strike. The genie can also grow to a gigantic size rivaling that of the Thousand Sunny. "}, {"type": "paragraph", "text": "In the anime, the genie has been shown to be made of smoke, demonstrating the ability to transform back into smoke to dodge attacks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Hoya_Hoya_no_Mi_Infobox.png/revision/latest/scale-to-width-down/200?cb=20180429033501", "caption": "Daifuku summons a genie."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Daifuku possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Daifuku was born to Charlotte Linlin along with Katakuri and Oven as a set of triplets, being the second of the set. During their childhood, Daifuku and his triplet brothers enjoyed eating donuts together."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/26/Charlotte_Triplets_Boyhood.png/revision/latest/scale-to-width-down/180?cb=20190324031114", "caption": "Daifuku and Oven eating donuts together with Katakuri during their childhood."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Daifuku attended Big Mom's Tea Party and wedding ceremony for Charlotte Pudding and Sanji. He and some of his siblings sat a table directly behind the Vinsmoke Family ready to assassinate them when the time was right. After Monkey D. Luffy started causing chaos at the wedding venue, Daifuku witnessed Jinbe officially resigning from the Big Mom Pirates."}, {"type": "paragraph", "text": "After the wedding cake collapsed and Brook destroyed the picture of Mother Carmel, Pudding tried to shoot Sanji, but he successfully dodged all her attempts. When Pudding began to waver, Daifuku stepped in and summoned a genie. He slapped Pudding aside for failing in her task, before proceeding to attack Sanji with the genie."}, {"type": "paragraph", "text": "When Sanji desperately ran towards his family, Daifuku quickly pinned Sanji down with the genie. However, when Luffy caused Big Mom to start her strange scream, Daifuku was immobilized and was unable to stop Sanji from freeing his family."}, {"type": "paragraph", "text": "Much later, Daifuku was given earplugs by his brother Katakuri and rose to confront the Straw Hat and Fire Tank Alliance once more. Daifuku's genie grabbed Carrot as Bege's allies were retreating into his fortress, but it was then repelled by Vinsmoke Yonji after he put on his raid suit."}, {"type": "paragraph", "text": "While the Straw Hats, Fire Tank Pirates, and Vinsmoke Family were hiding inside Bege's fortress, Daifuku told his comrades not to allow a single enemy to escape as Big Mom assaulted the fortress. Right after Bege deactivated his Big Father fortress and the Vinsmoke Family appeared, the Big Mom Pirates attacked them with a volley of bullets, but Ichiji and Niji blocked them with their capes.Caesar Clown attempted to flee the venue with Bege in tow while Luffy, Sanji, and the Vinsmoke Family faced off against the Big Mom Pirates. In the ensuing conflict, Daifuku, Galette, and Smoothie subdued Luffy, Sanji, and Reiju as they were falling back. However, at that moment, the Tamatebako dropped to the base of the Whole Cake Chateau and exploded, causing the castle to collapse."}, {"type": "paragraph", "text": "The Big Mom Pirates were saved when Streusen used his ability to turn the castle into cake. However, Luffy's group, Bege's crew, and the Vinsmokes got away during the chateau's destruction. Daifuku organized two pursuit teams for the Straw Hats and Fire Tank Pirates."}, {"type": "paragraph", "text": "After informing Katakuri that the pursuit teams had assembled, he was shocked to see Big Mom having a craving illness for wedding cake and was further alarmed to hear that Streusen was severely injured from the fall. After Perospero diverted Big Mom's attention to the Straw Hats, Daifuku listened to Pudding as she explained her plan to satiate Big Mom's craving. He later joined Brûlée, Perospero, Broyé, and 10,000 Chess Soldiers inside the Mirro-World, awaiting further instructions."}, {"type": "paragraph", "text": "Later, Daifuku, Smoothie, Compote, and other forces of the Big Mom Pirates assembled a fleet to hunt down the Straw Hats, the Fire Tank Pirates, and the Sun Pirates before any of them could escape Totto Land."}, {"type": "paragraph", "text": "Daifuku and Smoothie's fleets reached the Straw Hats along with Big Mom and Bavarois's fleet, surrounding the enemy crew. Daifuku sought to immediately sink the Straw Hats and prepared to fire non-living cannonballs at the Thousand Sunny. However, Carrot activated her Sulong form and glided toward his ship, where she rapidly attacked his crewmates. Daifuku said that the Sunny would be sunk before Carrot defeated all of his crew, but stopped talking as Carrot destroyed his ship's helm. Enraged at Carrot's actions, Daifuku summoned his genie to attack Carrot. However, as Carrot dodged the genie's strikes, it instead destroyed several of the ships in Daifuku's fleet. As Carrot continued her assault and broke the helms of the other ships, Daifuku and his fleet fell into disarray."}, {"type": "paragraph", "text": "While his ship was immobilized, he witnessed from afar as Big Mom attacked the Thousand Sunny and was astonished when Jinbe sent Big Mom flying off the ship."}, {"type": "paragraph", "text": "After the Fire Tank Pirates lured Big Mom away, Daifuku went on Smoothie's ship to continue pursuing the Straw Hats. When Germa 66 was attacking their forces on Cacao Island, Daifuku commented that Mont-d'Or was outsmarted. His younger sister reminded that he was also outsmarted but he implied that he caught back up. As the Thousand Sunny sailed away from Cacao Island after Luffy and Sanji made it back, Daifuku used his now much larger genie to attack Carrot on the Sunny's mast but the genie was blocked by Sanji. After the Sun Pirates arrived, they stopped Smoothie's ship from moving, keeping Daifuku from attacking the Sunny any further."}, {"type": "paragraph", "text": "After the Queen Mama Chanter attacked the Sunny, Daifuku expressed confusion when he saw that it was the Sun Pirates' ship that was destroyed. After the Straw Hats escaped, the Big Mom Pirates were later joined by Linlin when she arrived at the island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Daifuku_Attacks_Sanji.png/revision/latest/scale-to-width-down/210?cb=20180429034010", "caption": "Daifuku brings out his genie to attack Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/86/Siblings_Subdue_Strawhats.png/revision/latest/scale-to-width-down/210?cb=20180624112134", "caption": "Daifuku and his siblings subdue Reiju and the Straw Hats."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Daifuku_Attacks_Carrot.png/revision/latest/scale-to-width-down/210?cb=20181118034215", "caption": "Daifuku's genie attacks Carrot as she decimates his fleet."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Big Mom tried to infiltrate Wano, Daifuku accompanied his mother and crew as they attempted to climb the waterfall into the country on the Queen Mama Chanter. When Kaido's forces attacked their ship to prevent them from reaching Wano, Daifuku used his genie to deflect the enemy's cannonfire. However, just before they reached the top of the waterfall, King attacked the ship, causing it to fall off the waterfall and Big Mom to fall into the sea."}, {"type": "paragraph", "text": "On the seas near Wano, Daifuku noted that, as long as King was guarding the skies, the Big Mom Pirates would not be able to enter Wano. When Perospero claimed that, as the eldest son, he should become the new captain of the Big Mom Pirates in the event Big Mom died, Daifuku angrily argued with him, telling him that the position should go to Katakuri, since he was the strongest of them."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Daifuku vs. Sanji", "elements": []}, {"text": "Daifuku vs. Vinsmoke Yonji", "elements": []}, {"text": "Daifuku vs. Carrot", "elements": []}, {"text": "Daifuku vs. Sanji (Thousand Sunny)", "elements": []}, {"text": "Daifuku vs. Sun Pirates", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Daifuku and Oven vs. Organ Dealing Assassination Group", "elements": []}, {"text": "Daifuku vs. Vinsmoke Niji", "elements": []}, {"text": "Daifuku and Oven vs. Sanji", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Daifuku is given an earlier introduction in the anime, where he was shown arriving at the Whole Cake Chateau. In the manga, he was first shown during the Tea Party. He also displayed his Devil Fruit powers when he entered the Whole Cake Chateau. In the manga, his ability was first shown when he attacked Sanji."}, {"type": "paragraph", "text": "Before the Tea Party began, Oven and Daifuku fought and defeated Jigra's allies when they attacked the wedding venue."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Daifuku is a Japanese rice confection with a sweet filling, fitting with the food-themed names of Charlotte Family members. Daifuku often contains a red bean filling, fitting for the minister of beans of Totto Land.", "elements": []}, {"text": "Daifuku's favorite food is mame daifuku.", "elements": []}]}], "images": []}]}