{"sections": [{"title": "Charlotte Cabaletta", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Cabaletta is the eighth son and the 13th child of the Charlotte Family and the fourth quintuplet brother of Opera, Counter, Cadenza, and Gala. He is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cabaletta is an enormous man with a round and thick body supported by small legs. His physique is identical to that of his quintuplet brothers. He has small eyes, a wide nose, full lips, and a thin mustache. He has dark faded brown hair arranged in three messy groups on his, revealing a bumpy scalp in between the tufts, and a very large beard. He wears a yellow overall. Cabaletta wears dotted wristlets and a dotted belt the same as his brothers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Charlotte_Cabaletta_Anime_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20181001171156", "caption": "Cabaletta concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Charlotte Family and the Big Mom Pirates, Cabaletta is loyal to his affiliation to the point that he joined the enraged army in order to avenge his younger brother's defeat."}, {"type": "paragraph", "text": "In the anime, he was shown to be somewhat hot tempered and proud, as he attacked Luffy when the latter refused to give away the whereabouts of his allies and showed his defiance to the enraged army when asked repeatedly. He also seems to get along well with his brothers, as they coordinated an attack against Luffy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Cabaletta has authority over lower-ranking members of his crew. As he is identical to his brothers Opera, Counter and Cadenza, Cabaletta must have a similar level of overall strength."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Cabaletta is shown to have incredible speed and strength, being able to keep up with Luffy in Gear Second during their clash at the Whole Cake Chateau and catch him off guard to painfully choke him."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Cabaletta was shown to be able to use Busoshoku Haki when he attacked Monkey D. Luffy."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Cabaletta was born shortly after his brothers Charlotte Opera, Counter, Cadenza, and before Gala as part of Big Mom's quintuplets, making him the eighth son of the Charlotte Family."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Cabaletta joined Big Mom's army to avenge his younger brother after he was defeated by Monkey D. Luffy. He was present when the Big Mom Pirates found Lola's Vivre Card in Nami's possession."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "While Luffy was racing through the Whole Cake Chateau searching for Sanji, Cabaletta confronted him after Cadenza's defeat. Cabaletta used his speed to keep up with Luffy in Gear Second. After defending against Luffy's Hawk Gatling, Cabaletta noticed that he was hungry and took the opportunity to grab Luffy while his guard was down. As he attempted to strangle Luffy, he also spoke ill of Sanji. This enraged Luffy and he broke free from Cabaletta's grasp. Luffy grabbed Cabaletta by the hair to keep him from getting away and struck him with a Hawk Rifle to the face, sending him crashing into a wall and knocking him out."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Big Mom's army vs. Monkey D. Luffy and Nami", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cabaletta vs. Monkey D. Luffy (Whole Cake Chateau)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Unlike in the manga, Cabaletta is given a more prominent appearance in the anime, where he is also given a formal introduction. During the battle against Luffy and Nami outside Sweet City, the anime adds scenes of Cabaletta attacking Luffy. Another addition in the anime is Cabaletta later battling against Luffy at the Whole Cake Chateau."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A Cabaletta is a simple aria with a repetitive rhythm, corresponding with the music-themed naming of his fellow quintuplets and a few other siblings.", "elements": []}, {"text": "The number of hair groups he has matches his position as part of quintuplets, with Opera having zero, Counter having one, Cadenza having two, him having three, and Gala having four.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 845 (p. 5) and Episode 809, Cabaletta is seen as part of Big Mom's Enraged Army.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 85 (p. 150), The Charlotte quintuplets is mentioned.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑", "elements": []}, {"text": "↑  One Piece Anime — Episode 810, Cabaletta attacks Luffy.", "elements": []}, {"text": "↑  One Piece Anime — Episode 821, Luffy fights Cabaletta while searching for Sanji.", "elements": []}, {"text": "↑", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 846 (p. 9) and Episode 811, Lola's vivre card is discovered.", "elements": []}]}], "images": []}]}