{"sections": [{"title": "Charlotte Cadenza", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Cadenza is the seventh son and the twelfth child of the Charlotte Family and the third quintuplet brother of Opera, Counter, Cabaletta, and Gala. He is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cadenza is an enormous man with a round and thick body supported by small legs. His physique is identical to that of his quintuplet brothers. He has light brown hair that stands in both sides of his head, leaving most of his head bare and revealing several studded bumps on his scalp. He also has a very large beard. He wears a matching black and pink striped short sleeved shirt, bowler hat and pants, and is barefoot, which gives the impression of a prisoner's uniform. Cadenza wears dotted wristlets and a dotted belt the same as his brothers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Charlotte_Cadenza_Anime_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20181001171113", "caption": "Cadenza concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Charlotte Family and the Big Mom Pirates, Cadenza is loyal to his affiliation to the point that he joined the enraged army in order to avenge his younger brother's defeat. In the anime, he was shown to have a strong will, refusing to give away Sanji's location to Luffy despite being strangled."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Cadenza has authority over lower-ranking members of his crew."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Cadenza possesses sufficient physical strength to knock out Luffy in a tandem attack with his identical brother Counter."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Cadenza was shown to be able to use Busoshoku Haki when he attacked Monkey D. Luffy. In the anime, his Haki was shown to be tough enough to resist Luffy's Hawk Gatling, and Cadenza took the attack without being forced back."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cream Punch (クリームパンチ, Kurīmu panchi): An attack performed together with his brother Counter, the two of them attack their opponent from opposite sides with Busoshoku Haki-imbued punches. This was first used against Luffy, and was strong enough to bring him down (however, Luffy was already significantly fatigued and damaged from his fights with Cracker, Sanji, and the Chess Army).", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Cream_Punch.png/revision/latest/scale-to-width-down/210?cb=20171029051936", "caption": "Counter and Cadenza attack Luffy."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Cadenza was born 46 years ago to Big Mom and her unknown fifth husband, as the middle of a set of identical quintuplets, following Opera and Counter and preceding Cabaletta and Gala. Cadenza is overall the seventh son of the Charlotte Family."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Cadenza joined Big Mom's army to avenge his younger brother after he was defeated by Monkey D. Luffy. He and Counter personally attacked Luffy with Cream Punch while he was distracted by Charlotte Mont-d'Or, defeating him."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "After Luffy broke out of the Prisoner Library, Cadenza went to confront him as he was racing through the chateau. After a brief clash, Cadenza was strangled by Luffy, who wanted to know Sanji's location. However, Cadenza refused to tell him and passed out."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Big_Mom%27s_Army_Defeats_Luffy.png/revision/latest/scale-to-width-down/210?cb=20171029184224", "caption": "Cadenza and Counter defeat Luffy."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Big Mom's army vs. Monkey D. Luffy and Nami", "elements": [{"text": "Cadenza, Charlotte Mont-d'Or, and Charlotte Counter vs. Luffy", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cadenza vs. Luffy (Whole Cake Chateau)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "While racing through the Whole Cake Chateau searching for Sanji, Luffy choked Counter in the manga. In the anime, Luffy choked Cadenza instead."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A Cadenza is a virtuoso solo passage inserted into a movement in a concerto or other work, typically near the end. He shares his music-themed name with his fellow quintuplets and a few other siblings.", "elements": []}, {"text": "The number of hair groups Cadenza has matches his position as part of quintuplets, with Opera having zero, Counter having one, him having two, Cabaletta having three, and Gala having four.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 845 (p. 5) and Episode 809, Cadenza is seen as part of Big Mom's Enraged Army.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 85 (p. 150), The Charlotte quintuplets is mentioned.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 846 (p. 7) and Episode 811, Cadenza and Counter attacks Luffy.", "elements": []}, {"text": "↑  One Piece Anime — Episode 820, Cadenza battles against Luffy.", "elements": []}]}], "images": []}]}