{"sections": [{"title": "Charlotte Gala", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Gala is the ninth son and the 14th child of the Charlotte Family and the youngest quintuplet brother of Opera, Counter, Cadenza, and Cabaletta."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gala is an enormous man with a round and thick body supported by small legs. His physique is identical to that of his quintuplet brothers. He has a dark beard and dark hair that is styled into four thin partitions sticking upward, with a bumpy scalp beneath. He wears a dark vest and pants, as well as a matching studded belt and bracelets on his arms, the same as his brothers."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nothing is known about Gala's personality, as he has yet to make an appearance."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Gala was born to Big Mom as a set of quintuplets along with Opera, Counter, Cadenza, and Cabaletta, being the last of them to be born."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In Volume 90's online SBS birthday page, Gala was initially identified as one of the fighters present in the enraged army. However, his image was later removed, as the person portrayed was not Gala.", "elements": []}, {"text": "A \"gala\" is a social occasion with special entertainments or performances. This corresponds with the music-themed names of his fellow quintuplets and a few other siblings.", "elements": []}, {"text": "\"Gala\" can also refer to a type of apple, potato, or pork pie. It is also the Greek word for milk (γάλα). All of these correspond to the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}, {"text": "The number of hair groups he has matches his position as part of quintuplets, with Opera having zero, Counter having one, Cadenza having two, Cabaletta having three, and him having four.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  SBS One Piece Manga — Vol. 85 (p. 150), The Charlotte quintuplets are mentioned.", "elements": []}, {"text": "↑  https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 845 (p. 5) and Episode 809.", "elements": []}, {"text": "↑  https://one-piece.com/special/sbs/detail/9.html", "elements": []}]}], "images": []}]}