{"sections": [{"title": "Charlotte Counter", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Counter is the sixth son and the 11th child of the Charlotte Family and the second quintuplet brother of Opera, Cadenza, Cabaletta, and Gala. He is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Being part of quintuplets, Counter resembles Opera, and is an enormous man with an extremely thick body. He has dark brown hair arranged in a mohawk, and a very large beard. He wears a dark blue vest with thick pink edges and dark colored pants. Like his brothers, he also wears dotted wristlets and a dotted belt. His legs are extremely small in comparison to the rest of his body. He is usually seen accompanied by a young girl who constantly hangs on his shoulder with bronze hair with a single ponytail, brown eyes and red dress with flowers on it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Charlotte_Counter_Anime_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20181001171046", "caption": "Counter concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Charlotte Family and the Big Mom Pirates, Counter is loyal to his affiliation to the point that he joined the enraged army in order to avenge his younger brother's defeat."}, {"type": "paragraph", "text": "Counter shows no mercy or patience for his enemies, as he stomped on Luffy to knock him out after he was defeated and injured and refused to let go of the ground."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Counter has authority over lower-ranking members of his crew."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Counter possesses sufficient physical strength to knock out Luffy in a tandem attack with his identical brother Cadenza."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Counter was shown to be able to use Busoshoku Haki during his attack on Monkey D. Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Cream_Punch.png/revision/latest/scale-to-width-down/210?cb=20171029051936", "caption": "Counter and Cadenza attack Luffy."}]}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cream Punch (クリームパンチ, Kurīmu Panchi): An attack performed together with his brother Cadenza, the two of them attack their opponent from opposite sides with Busoshoku Haki-imbued punches. This was first used against Luffy and was strong enough to bring him down (however, Luffy was already significantly fatigued and damaged from his fights with Cracker, Sanji, and the Chess Army).", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Counter was born shortly after his brother Opera, and before Cadenza, Cabaletta, and Gala as part of Big Mom quintuplets, making him the sixth son of the Charlotte Family."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Counter joined Big Mom's army to avenge his younger brother after he was defeated by Monkey D. Luffy. He and Cadenza personally attacked Luffy with Cream Punch while he was distracted by Charlotte Mont-d'Or, defeating him. When Luffy refused to move, Counter knocked him out before taking him captive."}, {"type": "paragraph", "text": "Later, Luffy escaped from his prison cell and while rampaging throughout the chateau, he strangled Counter while demanding Sanji's whereabouts."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "As a fatigued and starving Luffy approached the place on the outskirts of Sweet City where he promised to wait for Sanji, Counter surprised him with a sneak attack. Luffy fought back, but his attacks were ineffective. After knocking Luffy to the ground, Counter stomped on him. When Luffy got back on his feet, Counter continuously pummeled him mercilessly and smashed him into the ground. Upon seeing Luffy on his feet, Counter prepared to finish him off. As he charged towards Luffy and punched him in the face, Luffy mustered enough strength to stand his ground and deliver a punch to Counter's face as well. Counter retaliated and after exchanging a few more blows with Luffy, Counter fell unconscious."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Luffy_Races_Through_Whole_Cake_Chateau.png/revision/latest/scale-to-width-down/210?cb=20170116073840", "caption": "Luffy chokes Counter while racing throughout the Whole Cake Chateau."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Big Mom's army vs. Monkey D. Luffy and Nami", "elements": [{"text": "Counter, Charlotte Mont-d'Or, and Charlotte Cadenza vs. Luffy", "elements": []}]}, {"text": "Whole Cake Chateau guards vs. Luffy", "elements": [{"text": "Counter vs. Luffy (manga only)", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Counter vs. Luffy (outside Sweet City)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "While racing through the Whole Cake Chateau searching for Sanji, Luffy choked Counter in the manga. In the anime, a confrontation between Luffy and Counter in the Whole Cake Chateau did not occur and Luffy choked Cadenza instead. However, Counter has another confrontation with Luffy after the latter left Sweet City to return to the place where he promised to wait for Sanji. Despite being hungry and weakened, Luffy managed to defeat Counter after a harsh struggle."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His relationship with the woman on his shoulder is currently unknown.", "elements": []}, {"text": "His name likely refers to a counter-melody, a subordinate melody accompanying a principle one. He shares this music-themed naming with his fellow quintuplets and a few other siblings.", "elements": [{"text": "His name may also refer to a countertop, a flat surface for working on, especially in a kitchen. This fits with the food-themed naming almost all of the Charlotte Family and Big Mom Pirates have.", "elements": []}]}, {"text": "The number of hair groups he has matches his position as part of quintuplets, with Opera having zero, him having one, Cadenza having two, Cabaletta having three, and Gala having four.", "elements": []}]}], "images": []}]}