{"sections": [{"title": "Jorul", "level": 1, "content": [{"type": "paragraph", "text": "\"Waterfall Beard\" Jorul was a giant and former co-captain of the Giant Warrior Pirates, along with Jarul. He was known as a hero of the giants and one of the world's oldest warriors."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jorul was a giant with an extremely large mustache and a beard which went all the way down to the ground, its shape reminiscence of a waterfall."}, {"type": "paragraph", "text": "He wore a plaid shirt, and surrounding it in the middle was a circle of teeth-shaped triangles. Around that circle was a dark belt with a skull design (the Jolly Roger of the Giant Warrior Pirates) on the buckle. He also wore a fur cape with spiral designs on the shoulders. His legs were proportionally small for someone of his height, and he wore dark pants."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/78/Jorul_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180911062621", "caption": "Jorul's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jorul appeared to value warriors, as shown when he complimented Hajrudin for training and aspiring to lead the Giant Warrior Pirates. He was also kind and valued children, as shown when he gave thanks for them during a feast. However, he took the traditions of Elbaf very seriously and was willing to kill Charlotte Linlin, a young child, for breaking them and causing destruction on Elbaf."}, {"type": "paragraph", "text": "Like many other characters, he has a unique laugh: \"Zabababa.\""}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a former captain of the Giant Warrior Pirates, Jorul was an exceptionally powerful warrior even among the giants of Elbaf. He was deeply respected as a hero with Hajrudin showing utmost admiration for him."}, {"type": "paragraph", "text": "However, in his old age, his body became frail and ended up dying after being thrown to the ground by a rampaging Linlin."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was shown using a longsword to attack Charlotte Linlin, although it broke against her naturally powerful body."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Jorul and Jarul were once the captains of the Giant Warrior Pirates, and the two fought alongside each other for three centuries. However, they eventually relinquished this status, and became venerated as heroes of the giants."}, {"type": "paragraph", "text": "Sixty-one years before the start of the series, Jorul and Jarul went to Warland Village together to eat semla with the children of Sheep's House. The 12-day period of fasting for the Winter Solstice then began, but on the seventh day, a member of Sheep's House known as Charlotte Linlin went on a food craving rampage through the village. Despite her being a child and Carmel's pleas, Jorul raised his sword against Linlin, calling her an evil spirit in the form of a child."}, {"type": "paragraph", "text": "Jorul then attempted to strike Linlin down, but she was able to break his sword with her bare hands. Linlin then grabbed Jorul by the beard and slammed him into the ground, fatally injuring him. With his last breath, Jorul told the other giants to bring judgment upon Linlin. The giants rushed to give him medical treatment, but he died from his injuries due to his old age."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/96/Linlin_Kills_Jorul.png/revision/latest/scale-to-width-down/210?cb=20180520032154", "caption": "Linlin fatally injures Jorul."}]}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "The destruction of the village and death of Jorul earned Linlin the scorn of giants across the world, especially when she innocently questioned his death as she had no memory of the event. Hajrudin, in particular, rushed in pleading Jarul to kill Linlin for revenge. Jarul, while mourning the death of his lifelong comrade and was furious at Linlin for causing it in a manner most disgraceful for an Elbaf warrior, nevertheless spared the child out of respect for Carmel."}, {"type": "paragraph", "text": "Jorul was laid to rest on top of a hill just on the outskirts of the village Linlin devastated, alongside several deceased giants. His broken sword and helmet were mended with tape, and became his grave marker. Jarul, Raideen, Hajrudin, and at least two other giants visited his grave sometime later."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/55/Jorul%27s_Grave.png/revision/latest/scale-to-width-down/120?cb=20180520055158", "caption": "Jorul's grave."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jorul vs. Charlotte Linlin", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jorul's unique laugh is possibly a reference to zabazaba—an onomatopoeia meaning \"large amount of falling waters\" and \"waterfalls\" in Japanese. Interestingly, his laughter somewhat resembling that of Brogy (Gabababa which could be a reference to the onomatopoeia Gabagaba meaning \"something is too large\", \"something bigger opens\", \"something big opens\", and so on).", "elements": []}, {"text": "Jorul's favorite foods are Sea King meat and rum.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 and Episode 836, Jorul is introduced.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #1113), Information about Jorul is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 867 (p. 2-4, 7-9) and Episode 837, Linlin fatally injures Jorul.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 867 (p. 2) and Episode 837.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 868 (p. 3) and Episode 838, Jorul's grave visited by several giants.", "elements": []}]}], "images": []}]}