{"sections": [{"title": "Jarul", "level": 1, "content": [{"type": "paragraph", "text": "\"Mountain Beard\" Jarul is a giant and former co-captain of the Giant Warrior Pirates, alongside Jorul. Along with Jorul, he is known as a hero of the giants and one of the world's oldest warriors."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jarul is a giant, thus being much larger than a normal human."}, {"type": "paragraph", "text": "He wears a Viking helmet with curved horns, and his facial beard is so large that it covers most of his body, with its shape reminiscence of a mountain. He wears a dark feather coat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/94/Jarul_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180911062627", "caption": "Jarul's anime concept art."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jarul deeply values militarism, as shown when he reminded the young giants on Elbaf that they were warriors above all else. While dedicated to militarism, Jarul is very open-minded as he readily accepted Carmel's claimed ideology in pacifism to engage in commerce instead of plundering. He strongly cherished camaraderie and beliefs, as he mourned the death of his lifelong comrade, Jorul, and noted that had he died a warrior's death, it would have been acceptable, hence could not forgive Charlotte Linlin for killing Jorul in a disgraceful manner. His strong respect for Carmel, however, led him to reluctantly spare the child's life and allowed them to leave. Like many other people, he has a unique laugh: \"Bojajaja.\""}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a former captain of the Giant Warrior Pirates, Jarul is an exceptionally powerful warrior even among the giants of Elbaf, alongside Jorul, he is deeply respected as a hero with Hajrudin showing utmost admiration for him."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was shown using a longsword in an attempt to stab a sleeping Charlotte Linlin."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Some time ago, Jarul and Jorul were the captains of the Giant Warrior Pirates, and the two fought alongside each other for three centuries. However, they eventually left the crew and the title was passed on to Dorry and Brogy."}, {"type": "paragraph", "text": "Sixty-three years before the present day, Jarul and Jorul went to Warland Village on Elbaf together in order to partake in a feast with the residents of Sheep's House before the Winter Solstice Festival. They commended Raideen on training Hajrudin to be a strong warrior. The feast then began, and the villagers partook in eating semla."}, {"type": "paragraph", "text": "On the seventh day of the 12-day fast, an incident occurred where Linlin devastated an Elbaf village due to her craving sickness and fatally injured Jorul. The giants were able to calm Linlin by giving her semla. After Linlin fell asleep, Jarul prepared to kill her but Carmel stood in his way, pleading the elder giant to spare her on the condition that she would leave Elbaf with Linlin. Jarul accepted Carmel's terms and angrily told her to leave."}, {"type": "paragraph", "text": "He was later seen visiting the graves of Jorul and a few other giants."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jarul's name may be based off of \"Jarul,\" which is the name for Earl in Scandinavian languages, as well as a traditional male given name in the Scandinavian countries.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 and Episode 836, Jarul is introduced.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #1114), Information about Jarul is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 867 (p. 7-11) and Episode 837, Jarul attempted to kill Linlin.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 868 and Episode 838.", "elements": []}]}], "images": []}]}