{"sections": [{"title": "Gerd", "level": 1, "content": [{"type": "paragraph", "text": "Gerd is a giant from Elbaf and the doctor of the New Giant Warrior Pirates. She was formerly an S-Class ranked mercenary for Buggy's Delivery."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gerd is a slender giantess with long blonde hair, part of which is kept in two braids on the sides of her head. She has light blue eyes. She wears a revealing one-piece purple fur garment with a neckline that goes down to her stomach and which leaves the sides of her legs completely exposed. She also wears a very long striped stocking on her left leg that nearly goes up to her waist, as well as an eggshell cape with tatters on the bottom and fur boots."}, {"type": "paragraph", "text": "As a child, she had shoulder-length hair and she wore a light blue long-sleeved dress, and has her hair arranged in two braids under a yellow checkered kerchief."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6b/Gerd_as_a_Child.png/revision/latest/scale-to-width-down/120?cb=20180513222504", "caption": "Gerd at age 12."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "During her childhood, Gerd seemed to be an amicable little girl, as she readily talked to Charlotte Linlin despite sometimes being afraid of her. Like Linlin, she loves sweets, particularly semla, which she explained to Linlin with great enthusiasm. She cares about her village, as she immediately reported to Mother Carmel when Linlin was going on a rampage through it."}, {"type": "paragraph", "text": "Gerd is incredibly kindhearted, as she tried to help the relationships between the Sheep's house children and the giants."}, {"type": "paragraph", "text": "Though Gerd was deeply traumatized by Linlin's rampage at Elbaf, she overcame it to become a strong warrior."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Hajrudin", "level": 3, "content": [{"type": "paragraph", "text": "Gerd knew Hajrudin since both their childhoods, as she watched him train to be a warrior. Upon growing up, she joined him in order to spiritually revive the Giant Warrior Pirates, and left the Buggy's Delivery to integrate their crew into the Straw Hat Grand Fleet instead."}], "images": []}, {"title": "Charlotte Linlin", "level": 3, "content": [{"type": "paragraph", "text": "Gerd came to know Charlotte Linlin since their childhood, and the two seemingly got along amiably. However, at times, Gerd was somewhat afraid of Linlin's uncontrollable strength. Gerd explained the traditions of the Winter Solstice Festival to Linlin, particularly the semla that they would be eating before the twelve days fasting."}, {"type": "paragraph", "text": "However, upon the seventh day of the fasting, their relationship would breakdown when Linlin's eating disorder for semla caused her to rampage throughout the Elbaf village, engulfing the area in a sea of flames while injuring many giants, including delivering a dishonorable and fatal injury to the elder hero, Jorul, scenes that Gerd watched in utter horror. As with the rest of the giant tribe, Gerd would come to hold a deep hatred for Linlin that would only increase when word got out that she was responsible for the deaths of Carmel and the Sheep's House orphans, and later when Linlin attempted to undermine an arranged marriage with her 23rd daughter and giant prince Loki."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a giant, Gerd likely possesses a large amount of physical power. She was an S-Class member of Buggy's Pirate Dispatch Society, being recognized as one of the organization's top money earners. As the doctor of the New Giant Warrior Pirates, she likely has some degree of medical expertise."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Gerd wields a single-bladed axe, but has not been seen using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sixty-three years ago, Gerd witnessed the arrival of Charlotte Linlin to the Sheep's House, and the two little girls became friends. She often played with Linlin and taught her about Elbaf's traditions. When Linlin went on a rampage due to her craving sickness, Gerd called Mother Carmel to the scene and watched in horror at the destruction Linlin caused. After Linlin fatally injured Jorul, Gerd witnessed Carmel creating Pandora out of the flames started by Linlin."}, {"type": "paragraph", "text": "After becoming an adult, Gerd joined Hajrudin in his goal to revive the Giant Warrior Pirates alongside three other giants and became the crew's doctor. The crew became mercenaries for the pirate dispatch organization, Buggy's Delivery. During the duration of their service, the crew became the five top earners of the organization, as well as earning the rank of S-Class soldiers."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "Hajrudin pledged his crew's allegiance to the Straw Hat Pirates, and when he returned to Karai Bari Island, the New Giant Warrior Pirates informed Mohji of their resignation from the Pirate Dispatch Organization, before setting out to sea in the Naglfar as members of the Straw Hat Grand Fleet. Furious at their sudden departure, Buggy added every member of the crew to his organization's deserter list."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is possibly taken from Gerðr (modernly anglicized as Gerd), a goddess in Norse mythology.", "elements": [{"text": "Aside from being a goddess, Gerðr was also a Jötunn, which are a race of giants.", "elements": []}]}, {"text": "Gerd is the first named canon female giant to appear in the series.", "elements": []}, {"text": "Gerd's adult design could be based on Nami's unused design with a battle axe.", "elements": []}, {"text": "Gerd's favorite foods are hamburgers and macarons.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 (p. 7) and Episode 836, Gerd is introduced.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 901, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 32, Gerd is reintroduced in the present day.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, Gerd's age revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #1111), Information about Gerd is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 (p. 10-13) and Episode 836, Gerd and Linlin play and talk.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 867 (p. 5-7) and Episode 837, Carmel uses Geburtstag.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 (p. 15) and Episode 836, Gerd scream for Mother Carmel.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 803 (p. 11) and Episode 752, The New Giant Warrior Pirates' rank in Buggy's Delivery is revealed.", "elements": []}]}], "images": []}]}