{"sections": [{"title": "Goldberg", "level": 1, "content": [{"type": "paragraph", "text": "Goldberg is a giant from Elbaf who is the cook of the New Giant Warrior Pirates and was formerly an S-Class ranked mercenary for Buggy's Delivery."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Goldberg is a very rotund giant with dark orange hair and a wide mouth. He wears plaid suspenders with dark stripes, a grey cape with a flower buckle, and a viking helmet, and lacks a shirt. He also wears a belt across his chest."}, {"type": "paragraph", "text": "As a newborn, he had shorter light brown hair and was wrapped in a yellow cloth in the anime."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/96/Goldberg_as_an_Infant.png/revision/latest/scale-to-width-down/180?cb=20180513064700", "caption": "Goldberg as a newborn in the anime."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a giant, Goldberg likely possesses a large amount of physical power. Along with the rest of his crewmates, he was an S-Class mercenary for Buggy's Pirate Dispatch Society, being recognized for his skilled mercenary work. As the cook for his crew, he likely has some degree of culinary expertise."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Goldberg carries a mace whose length rivals his height; it has a very long handle that balloons closer to the end. He also carries a relatively small shield with vertical stripes and a face on it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Goldberg was born in a village in Elbaf around 63 years before the present day. His birth was celebrated at the start of the 12-day fast leading up to the Winter Solstice."}, {"type": "paragraph", "text": "Many years later, Goldberg and three other giants joined Hajrudin in his goal to revive the Giant Warrior Pirates. The crew became mercenaries for the pirate dispatch organization, Buggy's Delivery. During the duration of their service, the crew became the five top earners of the organization, as well as earning the rank of S-Class soldiers."}], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "Hajrudin pledged his crew's allegiance to the Straw Hat Pirates, and when he returned to Karai Bari Island, the New Giant Warrior Pirates informed Mohji of their resignation from Buggy's Delivery before setting out to sea in the Naglfar as members of the Straw Hat Grand Fleet."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 89 Chapter 899, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 31, Goldberg makes his debut.", "elements": []}, {"text": "↑  One Piece Anime — Episode 836, Goldberg makes his debut in the anime.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 (p. 14) and Episode 836, Goldberg is first mentioned.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 803 (p. 11) and Episode 752, The New Giant Warrior Pirates' rank in Buggy's Delivery is revealed.", "elements": []}]}], "images": []}]}