{"sections": [{"title": "Raideen", "level": 1, "content": [{"type": "paragraph", "text": "Raideen is a giant who resided on Elbaf 63 years ago. He was shown training Hajrudin."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Raideen was a giant with light hair which stuck out from the sides of his helmet, which was a warrior's helmet with eyepieces which obscured his eyes."}, {"type": "paragraph", "text": "He wore a striped button-down shirt with much of the top unbuttoned, as well as a dark coat lined with light fur."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Raideen_Anime_Concept_Art.png/revision/latest/scale-to-width-down/120?cb=20190624075916", "caption": "Raideen's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Raideen cares greatly about maintaining Elbaf's warrior roots, aspiring to train his students for greatness. His passion for Hajrudin's training earned him praise from the heroes of the giants, Jorul and Jarul."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a giant, Raideen likely possessed a tremendous amount of physical strength. He possesses at least decent skill in combat, as he trained Hajrudin in it and was shown overpowering him in a duel, although Hajrudin was a young child at the time."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "While training Hajrudin, Raideen was shown wielding a longsword."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Sixty-three years before the present day, Raideen trained Hajrudin in combat, intending to make his pupil stronger so he could join the Giant Warrior Pirates once either Dorry or Brogy returned from their duel. The two dueled, with Raideen overpowering his student. Jorul and Jarul then came to the village and Raideen greeted them."}, {"type": "paragraph", "text": "Seven days later, during the Winter Solstice fast, Charlotte Linlin went on a rampage to find semla. After she fatally injured Jorul, Raideen held Hajrudin back as his student yelled at Jarul to kill her."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He is possibly named after the professional wrestler James Raideen.", "elements": []}, {"text": "His name could also be a reference to Brave Raideen, a Japanese super robot anime series featuring a hero of the same name.", "elements": []}, {"text": "Among the Giant Warrior Pirates, there is a giant who looks similar to Raideen in terms of design, but it is unknown if this is him or another giant.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 and Episode 836, Raideen makes his debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 867 and Episode 837.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 15 Chapter 129 (p. 13) and Episode 78.", "elements": []}]}], "images": []}]}