{"sections": [{"title": "Road", "level": 1, "content": [{"type": "paragraph", "text": "Road is a giant from Elbaf who is the navigator of the New Giant Warrior Pirates and was formerly an S-Class ranked mercenary for Buggy's Delivery."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Road is a slender skinned giant with long dark blue hair which covers the entire right side of his face. He wears a dark gray buttoned coat lined with fur, dark pants lined with fur at the bottom, a wide belt with a big skull buckle, light grey-blue shoulder plates covered with bumps, and a large yellow cape with lighter yellow vertical stripes. He also wears a very long yellow striped scarf around his neck which covers it and his mouth, and has gloves on his hands."}, {"type": "paragraph", "text": "As a newborn, he had an olive skin, shorter and dark brown hair, and was wrapped in a pink cloth in the anime."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3e/Road_as_an_Infant.png/revision/latest/scale-to-width-down/180?cb=20180513064636", "caption": "Road as a newborn in the anime."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a giant, Road likely possesses a large amount of physical power. Alongside Hajrudin and Stansen, he was an S Class member of the Buggy Pirate Dispatch Society. As the New Giant Warrior Pirates' navigator, he has at least enough knowledge of navigation and cartography to navigate the New World, and was seen holding a map in his hand when they sailed away from Karai Bari Island."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Road wields an extremely long katana, but has not been seen using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Road was born in a village in Elbaf around 63 years before the present day. His birth was celebrated at the start of the 12-day fast leading up to the Winter Solstice."}, {"type": "paragraph", "text": "Many years later, Road and three other giants joined Hajrudin in his goal to revive the Giant Warrior Pirates. The crew became mercenaries for the pirate dispatch organization, Buggy's Delivery. During the duration of their service, the crew became the five top earners of the organization, as well as earning the rank of S-Class soldiers."}], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 3, "content": [{"type": "paragraph", "text": "Hajrudin pledged his crew's allegiance to the Straw Hat Pirates, and when he returned to Karai Bari Island, the New Giant Warrior Pirates informed Mohji of their resignation from the Buggy's Delivery before setting out to sea in the Naglfar as members of the Straw Hat Grand Fleet."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 89 Chapter 898, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 30, Road makes his debut.", "elements": []}, {"text": "↑  One Piece Anime — Episode 836, Road makes his debut in the anime.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 (p. 14) and Episode 836, Road's birth is mentioned during Big Mom's flashback.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html Road's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 803 (p. 11) and Episode 752, The New Giant Warrior Pirates' rank in Buggy's Delivery is revealed.", "elements": []}]}], "images": []}]}