{"sections": [{"title": "Chaka", "level": 1, "content": [{"type": "paragraph", "text": "Chaka the Jackal is one of two head guards in the Alabasta kingdom who serves under Igaram, alongside Pell. Chaka was the acting captain of the royal guard in Igaram's absence."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chaka is a tall, imposing dark skinned man with medium length black hair and a long broad nose resembling that of a jackal."}, {"type": "paragraph", "text": "He wears a long, light-green tunic, revealing his muscular chest, and has two belts around his waist: a striped, pale-red and crimson large one, and over it a purple, thinner one. Around his neck he has a necklace consisting of big golden beads, and he wears a dark-green coat draped on his shoulders like a cape. He carries a massive sword, with a blue hilt and sheath, on his right hip."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Chaka is always stern and rigorous. He is very loyal to the royal family, and he is willing to give up his life in order to protect them, as seen when he attacked Crocodile in order to give Vivi a chance to escape. He shows great concern for his best friend Pell."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Chaka is apparently a strong and experienced fighter, and specialized in swordsmanship. He attacked Crocodile in his hybrid form, but was completely defeated by the Shichibukai's sand body."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Chaka ate the Inu Inu no Mi, Model: Jackal, a Zoan-class Devil Fruit that allows him to transform into a jackal and a human-jackal hybrid. This grants him an increase in speed and physical prowess, and has earned him the nickname \"Chaka the Jackal\". He has been shown combining his form with swordsmanship to increase the power of his attacks, usually by holding the sword in his mouth while charging at the opponent."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Inu_Inu_no_Mi%2C_Model_Jackal_Infobox.png/revision/latest/scale-to-width-down/200?cb=20130919152838", "caption": "Chaka in his Jackal hybrid form."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Chaka wields an exotic looking sword, which he wields in conjuncture with his Devil Fruit transformation."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Koza was a boy and leader of the Suna Suna Clan, he asked Chaka if he could train him, going so far as to demand it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/42/Chaka_Training_Koza.png/revision/latest/scale-to-width-down/180?cb=20130219153225", "caption": "Chaka training Koza as a child."}]}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Chaka, together with Pell, came to the town where pirates were attacking civilians. However, Crocodile defeated the pirates before they arrived. As they reached their destination, Crocodile had already beaten the pirates. When the rebellion began to move, Pell and Chaka wanted to fight back but were stopped by King Cobra. Later, they found Karoo bringing Vivi's letter. From the information, they learned their enemy's identity. As the rebels approached the city, Chaka was commanded to ready the royal army."}, {"type": "paragraph", "text": "A guard reported that the king was missing, causing Chaka to panic. Chaka ordered the Royal Army to search for the king, noting that searching for people was Pell's forte, but that he was scouting the enemies at Rainbase. Later, a royal guard reported that they had spotted the king admitting to stealing the rain and giving orders to destroy Nanohana. Chaka rejected this as the work of the real king, but the guard replied that the king disappeared from his room around the time of the incident."}, {"type": "paragraph", "text": "As the rebellion started to move, Chaka commanded the royal guard to fight until death for the sake of the king and the princess."}, {"type": "paragraph", "text": "During Crocodile's attack on the kingdom, Chaka attacked the Shichibukai alone. Because of Crocodile's actions which forced his men to die without getting the chance to die honorably in battle, Chaka was angered to the point that he attacked Crocodile. However, this was also an attempt to protect Vivi and Koza, as well as buy them time to put an end to the battle - but despite his efforts, he was easily defeated. He survived, however, and showed up later commanding the royal guard to stop fighting."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/02/Chaka_Defending_Vivi_and_Koza.png/revision/latest/scale-to-width-down/180?cb=20130518182201", "caption": "Chaka protecting Vivi and Koza."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the Straw Hats received their bounties shortly after the Enies Lobby incident, Chaka was shocked to see Nico Robin in the Straw Hat crew."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Whitebeard War, he and Pell were seen reporting to King Cobra about a recently foiled pirate attack."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Chaka and Pell were seen being fitted for new clothes to wear for the upcoming Levely."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/RoyalPalace2YL.png/revision/latest/scale-to-width-down/200?cb=20130806233429", "caption": "Chaka being fitted by Terracotta for new clothes for the Levely."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Chaka accompanied the Nefertari Family to Mary Geoise alongside Pell, Karoo, and Igaram. Chaka expressed concern for Cobra's health as the latter revealed his intention on asking the World Government about the poneglyphs."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the way to the Levely, Chaka received the news of Luffy's exploits at Totto Land."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Chaka vs. Crocodile", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Gear Spirit", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}, {"text": "One Piece Grand Battle 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Chaka represents the jackal, one of the two guardian spirits of Alabasta, along with Pell the Falcon. Both of them are based on the Egyptian deities Anubis and Horus, respectively, with their hybrid forms displaying this even more so.", "elements": []}, {"text": "Chaka means \"red hot sun\" in Swahili.", "elements": []}, {"text": "Chaka's name may come from singer Chaka Khan.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 155 and Episode 91.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 167 (p. 12) and Episode 105, Chaka is introduced.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Chaka's information is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 82, Chaka's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 22 Chapter 196 (p. 10) and Episode 120, Chaka is revealed to have eaten the Inu Inu no Mi, Model: Jackal.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Chaka's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 22 Chapter 196 (p. 10-11) and Episode 120, Chaka attacks Crocodile in his Jackal form.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 439 and Episode 324.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 593 and Episode 512.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 65 Chapter 639, cover story: From the Decks of the World Vol. 23.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 822.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 823.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 903 (p. 7) and Episode 878.", "elements": []}]}], "images": []}]}