{"sections": [{"title": "Kappa", "level": 1, "content": [{"type": "paragraph", "text": "Kappa is a young shoeshine-boy in Nanohana."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kappa is a young boy who wears a white turban with orange beads around it. He has a blue cloth around his neck, and wears a blue robe with green sleeves. He wears brown belts around his torso where he carries stones. He has a bag that he carries on his back with various weapons, including a hammer, bat, and club."}, {"type": "paragraph", "text": "After the timeskip, Kappa has grown much taller, and his hair has grown out. He wears a hat with a small brim, and beads around it. He has a light colored shirt, that says \"KAPPA\" on the right arm, and a dark colored cloth around his neck area. He also sports dark colored pants."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kappa loves his country very much, as shown when he tries to become a rebel, believing that Cobra was responsible for the drought affecting the nation."}, {"type": "paragraph", "text": "He wanted to hit the king's impostor when he came to destroy Nanohana which shows a form of courage."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He's quite resilient having survived a beating from Mr. 1 and Miss Doublefinger."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "He wanted to join the rebellion against the king. However, Koza refused to let him join, because he was too young, and told him that the war is not for little children like him."}, {"type": "paragraph", "text": "At Nanohana, when Mr. 2 (disguised as Nefertari Cobra) and his men set fire to the town, Kappa fell upon the secret of Baroque Works, as he witnessed Mr. 2 changing back to his original appearance, and learned that the king was, in fact, framed. He then ran into Mr. 1 and Miss Doublefinger who proceed to attack him, in order to keep him quiet. Though he survived, he was too injured to tell the people anything and thus unable to prevent Koza from launching an attack on the capital."}, {"type": "paragraph", "text": "Later, he was found by Igaram and got the chance to explain to all of Alabasta what really went on. It was his eyewitness account that officially ended the war."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "He stood smiling next to Koza, who had become the Environmental Minister of the kingdom of Alabasta."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 167 and Episode 105.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 172 and Episode 107.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 211 and Episode 127.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 172 and Episode 107.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 211 and Episode 127.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 65 Chapter 638, cover story: From the Decks of the World Vol. 22.", "elements": []}]}], "images": []}]}