{"sections": [{"title": "Masked Deuce", "level": 1, "content": [{"type": "paragraph", "text": "Masked Deuce is an alias used by the first member of Ace's pirate crew, the Spade Pirates. He abandoned his real name, which remains unknown."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Masked Deuce's defining feature is the mask he wears over his eyes to conceal his identity. He is a muscular man with spiky long light blue hair, and wears a very long opened coat which stretches down to his knees and leaves his chest exposed. He also wears a belt diagonally across his chest, trousers with a rose design on the bottom left that is held up by a belt, and a pair of dark boots that go up to his knees."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Deuce's primary goal is to seek adventure, though he initially did not wish to incriminate himself as a pirate. He appears to act seriously, and was initially off-put by, though eventually gained respect for Ace's cheerful nature. He enjoys writing and took the opportunity to write a story of his experiences on Ace's crew. If someone mocks his writing, he will respond by portraying them in a bad light and leaving their names out of the story. He also seems to be an avid thinker and planner, as shown when he developed and executed a plan to lead a Marine warship battalion into dangerous waters, and later calmly assessed his situation when he was stuck on the Sabaody Ferris wheel with Marine Ensign Isuka."}, {"type": "paragraph", "text": "Like many people, he was negatively prejudiced against the idea of Gol D. Roger having a son, though this changed once he got to know Ace. When he started starving on a desert island, he became willing to kill Ace to steal his food, although later came to regret this."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Portgas D. Ace", "level": 3, "content": [{"type": "paragraph", "text": "Deuce first encountered Ace when both of them became stranded on the island of Sixis, and Ace was the one to give him his pseudonym. He was initially put off by Ace's cheerful behavior, and reacted negatively when he discovered Ace was Gol D. Roger's son. With a negative attitude toward Ace, the starving Deuce was willing to kill him to steal his food, but later came to regret this when Ace noticed him and offered to share his food. The two then formed an official partnership, and Deuce was very loyal to Ace throughout. When Ace fought against Marine Vice Admiral Draw, Deuce had full faith that his captain would defeat his opponent."}], "images": []}, {"title": "Isuka", "level": 3, "content": [{"type": "paragraph", "text": "Although they are enemies, Deuce respects Isuka like Ace does. When they were left alone on the Ferris wheel, he talked to her about her duties as a Marine and her relationship with the Spade Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Along with Mihar and Skull, Deuce serves as the brains of the Spade Pirates, being capable of forming and executing strategies for the crew. He seems to possess decent strength, as he was able to grab ahold of Vice Admiral Draw and keep him occupied while Ace was busy without taking injuries, and has also dealt with numerous bounty hunters during the Spade Pirates' voyage."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Meeting Ace", "level": 3, "content": [{"type": "paragraph", "text": "In his formative years, Deuce was a medical student with bad grades, and his parents were indifferent to him. Because of the literature he read, he fell in love with the idea of simply adventuring on the sea. The day he set out to sea, he abandoned his birth name, but his voyage resulted in him getting stranded on the island of Sixis. After spending three days there, he encountered the pirate Portgas D. Ace, who was also shipwrecked there. The two initially got along well, and when Deuce revealed his lack of a name, Ace gave him the pseudonym of Masked Deuce. Ace wanted the two of them to build a raft to escape together, but when the two started talking about each other's families, Deuce came to realize that Ace was Gol D. Roger's son and departed from Ace with very mixed feelings. Several days later, Deuce had not been able to find food or water on the island, and when he saw Ace with a fruit, he decided to kill Ace for it. However, Ace noticed Deuce when his stomach growled, and offered him the fruit. Ashamed of his earlier intentions, Deuce refused, but the two ended up sharing the fruit, which was the Mera Mera no Mi. However, since Ace consumed it first, Deuce did not receive the fruit's powers when he ate it. The two worked together to build a raft that ran on Ace's flames, which they called the Striker, and they set off to sea as official partners, forming the Spade Pirates. Deuce decided to write a novel about his experiences on the crew."}], "images": []}, {"title": "Voyage of the Spade Pirates", "level": 3, "content": [{"type": "paragraph", "text": "As time passed, the Spade Pirates grew in number and fame, and they were forced to deal with numerous bounty hunters. A bounty hunter tried to join Ace's crew to take his head, but Deuce promptly kicked him out. Another time, a bounty hunter tried to sneak up on Deuce, but was shot by Mihar. One day, the Spade Pirates were confronted by an entire battalion of Marine battleships, and Deuce prepared to lead them into a rocky reef. An Ensign named Isuka came onboard to keep the Spade Pirates occupied while the battalion converged, but Deuce's plan was in full motion and he was successful as one of the Marine ships hit the reef and started sinking. Isuka went to save her sinking comrades and nearly drowned in the process, but Ace threw a life preserver to her, much to Deuce's shock and general displeasure."}, {"type": "paragraph", "text": "Isuka continued chasing the Spade Pirates, but they did not take her very seriously. They eventually reached Sabaody Archipelago, and while they waited for their ship to be coated, they were confronted by Isuka again. Deuce noticed that Ace had escaped, and he found his captain by the Ferris wheel. Deuce was captivated by the Ferris wheel, so Ace took him on, but after the ride they were confronted by Isuka, and got accidentally locked in the gondola with her for another ride. During the ride, Isuka told the two how she became a Marine, and gave Ace the chance to become a Marine, but he refused and escaped from the gondola. Deuce wondered if Isuka would take him hostage, but she said it was against her code. Three days later, Deuce and Ace were in the slums when they were approached by Isuka and Vice Admiral Draw, who came with an invitation for Ace to join the Shichibukai. Ace refused, and he and Draw started fighting as a result. Draw revealed his flamethrowers, which he used to set the slums ablaze, and Deuce grabbed ahold of Draw while Ace went to rescue the endangered citizens. During their struggle, Deuce managed to remove Draw's fuel tank before Ace returned to take over the fighting. Deuce had faith in Ace, who indeed managed to defeat Draw. The two of them then headed back to their ship as it prepared to sail to Fish-Man Island, bidding their farewells to Isuka."}, {"type": "paragraph", "text": "At one point, the Spade Pirates were shipwrecked in Wano Country. The people from Amigasa Village were starving to death, so they tied the entire crew and stole all their food. The crew watched the villagers finish their meal and then broke out. Instead of attacking, Ace asked the villagers where he could get them dessert. They stayed in Amigasa Village for a few weeks and became good friends with Tama.​​"}], "images": []}, {"title": "Encountering Whitebeard", "level": 3, "content": [{"type": "paragraph", "text": "The Spade Pirates went through Fish-Man Island and into the New World, where they sought to take Whitebeard's head; this ended up leading to a battle between Ace and Jinbe. After Ace and Jinbe tied, Deuce and the other Spade Pirates defended their captain against Whitebeard and were easily defeated. They were then taken into the Whitebeard Pirates like their captain."}, {"type": "paragraph", "text": "Deuce quickly became integrated into the Whitebeard Pirates, joining the medical team caring after Whitebeard. After learning about Whitebeard's ailments, Deuce became less supportive of Ace's intention to kill him, knowing that a lot of places in the New World were protected by the Yonko."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/The_Spade_Pirates_Prepare_to_Fight_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20170830092251", "caption": "The Spade Pirates prepare to fight Whitebeard."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The name Deuce might be from a playing card with a rank of two, also a slang word for number two.", "elements": []}, {"text": "Masked Deuce is the first, and so far only character known to eat a Devil Fruit, the Mera Mera no Mi, without gaining its powers.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece novel A, Masked Deuce was introduced along with Portgas D. Ace's backstory.", "elements": []}]}], "images": []}]}