{"sections": [{"title": "Mr. 11", "level": 1, "content": [{"type": "paragraph", "text": "Mr. 11 was a Frontier Agent for Baroque Works and the partner of Miss Thursday."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a short man, with long wavy gray hair. He has tattoos of his number on each side of his face, and a large black top hat. He wears a dark blue coat with a gray collar and yellow buttons. Underneath, he sports a purple puffy shirt and black pants."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/56/Mr.11.png/revision/latest/scale-to-width-down/180?cb=20170426145618", "caption": "Mr.11's face close-up"}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He unwittingly gave out information about Baroque Works, so it seems he cannot keep a secret very well. Mr. 11 also seems to be quite easy to trick, as shown as how Smoker tricked him into revealing Baroque Work's secret (such as making him believe they found a particular letter in his pocket, which they never found). He also mistook a group of Billions agents for Millions agents, showing he does not know much about the lower members of his organization, or the members on his level for that matter."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He was not seen fighting, but, as a Frontier Agent he must be somewhat proficient in fighting and bounty hunting."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Since he had a sword, it's likely he was decent swordfighter, though not on par with Tashigi."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "At some point, somehow came into the possesion of Kashu, which was one of the Meito, but lost it in his duel with Tashigi."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was captured by Captain Smoker in Renaisse and tied to a mast. On Smoker's ship, he unwittingly revealed some information about the Baroque Works."}, {"type": "paragraph", "text": "When an unforeseen event happened that caused the crew, including Smoker, to leave their ship, Mr. 11 attempted to free himself. Surprisingly, Billions agents (henchmen for Officer Agents) boarded the ship. Mr. 11, mistaking them for Millions (henchmen for Frontier Agents), yelled at them to untie him. The Billions then revealed their rank and were hence the same level as him (agents below rank 10 are not much stronger than the Billions)."}, {"type": "paragraph", "text": "Mr. 11 then apologized, but it was a little too late, as they had no intention of freeing him. Mr. Mellow came toward Mr. 11 and shot him. Though his death is not shown, Mr. Mellow's comment and Tashigi telling Smoker he was murdered confirms it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fd/Mellow_Aims_Gun_At_11.png/revision/latest/scale-to-width-down/210?cb=20130404094330", "caption": "Mr. Mellow prepares to shoot Mr. 11"}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Vivre Card - One Piece Visual Dictionary, Mr. 11's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 18 Chapter 159 and Episode 95, Mr. 11 is confronted by the Billions", "elements": []}]}], "images": []}]}