{"sections": [{"title": "Faust", "level": 1, "content": [{"type": "paragraph", "text": "Faust is a cat mink from North Blue and a member of the Hawkins Pirates, serving as the crew's magician."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Faust is a cat mink with light-colored (black in the anime and in the colored manga) fur, a large thin mouth, and yellow eyes. He wears a long, dark blue cloak, a white and red striped shirt, a green sash around his waist, and purple pants. He also wears brown shoes, a white ruff, and a necklace with a cross on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Faust seems quite inexpressive, maintaining a calm facial expression most of the time."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Faust's abilities are unknown, but he is likely quite strong, as he is a member of the Hawkins Pirates. He is also stated to be a \"magician\"."}, {"type": "paragraph", "text": "As a mink, he is a natural-born fighter and can use Electro."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Faust was born somewhere in North Blue and at an unknown point prior to the storyline he met Basil Hawkins and joined the Hawkins Pirates."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Faust and his fellow crewmates watched as their captain fought Admiral Kizaru. Faust himself seemed unscathed when Urouge and a Pacifista appeared and joined the fray."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Faust stood on the deck of their crew's ship after the war, listening to Hawkins as he described Monkey D. Luffy's consistent survival rate."}, {"type": "paragraph", "text": "When the crew arrived at Foodvalten, Faust stood beside his captain as he prepared to fight the Brownbeard Pirates."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Faust may be named after the legendary German scholar who sold his soul to the Devil for unlimited knowledge and worldly pleasures. This follows the black magic theme the Hawkins Pirates seem to have.", "elements": []}, {"text": "In SBS Volume 86, Oda humorously implied that Faust uses \"meowgic\".", "elements": []}, {"text": "Faust is the only known mink to originate from a place other than Zou.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 52 Chapter 508 (p. 7-14), Faust makes his first appearance.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 581 (p. 4) and Episode 490, Faust stands near Hawkins as he describes Luffy's survival rate.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 86, Faust's name, race, and position are revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Faust's birthday and birthplace is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 52 Chapter 508 (p. 12).", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 18) and Episode 511, Faust stands beside Hawkins as they prepare to fight the Brownbeard Pirates.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 81 Chapter 808 (p. 8) and Episode 757.", "elements": []}]}], "images": []}]}