{"sections": [{"title": "Dogya", "level": 1, "content": [{"type": "paragraph", "text": "Dogya is a member of the Spade Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dogya appear to be an bulky average size man. He has short hair and wore some sort of striped armor held with suspenders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Dogya_in_the_Anime.png/revision/latest?cb=20170831080459", "caption": "Dogya prepares to fight the Whitebeard Pirates."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Dogya cares greatly about his captain, Portgas D. Ace, since he was willing to defend him from Edward Newgate. Dogya can also be somewhat disrespectful, laughing at Deuce's adventure diary despite the fact that it is his main aspiration of their travels."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Portgas D. Ace", "level": 3, "content": [{"type": "paragraph", "text": "Like the rest of the Spade Pirates, Dogya cares greatly for his captain, warning Ace about Jinbe and defending him from a Yonko. However, Dogya was not seen during the Battle of Marineford."}], "images": []}, {"title": "Masked Deuce", "level": 3, "content": [{"type": "paragraph", "text": "Most of the Spade Pirates' crew members (excluding Skull, Mihar, and Kotatsu) read and laughed at Deuce's poor writing in his adventure diary. Because of this, their names were excluded from the diary."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Dogya's abilities are unknown, but he and his crew were easily defeated by Newgate."}], "images": []}, {"title": "Martial Arts", "level": 3, "content": [{"type": "paragraph", "text": "Dogya uses his boxing gloves to fight, but his proficiency is unknown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Making their Mark", "level": 3, "content": [{"type": "paragraph", "text": "Dogya joined the Spade Pirates and traveled with Ace as he made a name for himself. He helped fight off a group of bounty hunters, and, when Isuka infiltrated the crew's ship, he surrounded the Marine Ensign alongside his crewmates. However, she easily fended them off. After the confrontation, the crew reached Sabaody Archipelago. While they waited for their ship to be coated, Dogya and his crewmates explored the island and secretly read Deuce's adventure diary. They laughed at his poor writing skills, leading Deuce to exclude their names from the diary."}, {"type": "paragraph", "text": "At one point, the Spade Pirates were shipwrecked in Wano Country. The people from Amigasa Village were starving to death, so they tied the entire crew and stole all their food. The crew watched the villagers finish their meal and then broke out. Instead of attacking, Ace asked the villagers where he could get them dessert. They stayed in Amigasa Village for a few weeks and became good friends with Tama.​​"}], "images": []}, {"title": "Encountering Whitebeard", "level": 3, "content": [{"type": "paragraph", "text": "When his captain was fighting Jinbe, Dogya warned him about the fish-man's strength. After Ace and Jinbe tied, Dogya and the other Spade Pirates defended their captain against Edward Newgate and were easily defeated. They were then taken into the Whitebeard Pirates like their captain. Dogya has not been seen since his joining."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/The_Spade_Pirates_Prepare_to_Fight_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20170830092251", "caption": "The Spade Pirates Prepare to Fight Whitebeard."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Spade Pirates vs. Bounty hunters", "elements": []}, {"text": "Spade Pirates vs. Isuka", "elements": []}, {"text": "Spade Pirates vs. Edward Newgate", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 552 and Episode 461, Dogya makes his first appearance.", "elements": []}, {"text": "↑  ONE PIECE Magazine — Volume 2, Dogya and the rest of the Spade Pirates are named.", "elements": []}, {"text": "↑  Novel A - Chapter 2, Dogya and his crew mates fight Isuka and reach Sabaody Archipelago.", "elements": []}]}], "images": []}]}