{"sections": [{"title": "Ducky Bree", "level": 1, "content": [{"type": "paragraph", "text": "Ducky Bree is a member of the Spade Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ducky Bree is an average height, muscular man with skinny libs, a sharp chin, a pointed nose and shaggy, dark-colored hair. He has only been seen with a down-turned mouth. He wears an open, dark-colored shirt with a pattern on the shoulders, dark-colored pants that leave his ankles exposed, dark-colored shoes, and a patterend headband."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bree cares greatly about his captain, Portgas D. Ace, since he was willing to defend him from Edward Newgate. Bree can also be somewhat disrespectful, laughing at Deuce's adventure diary despite the fact that it his main aspiration of their travels."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Portgas D. Ace", "level": 3, "content": [{"type": "paragraph", "text": "Like the rest of the Spade Pirates, Bree cares greatly for his captain, warning Ace about Jinbe and defending him from a Yonko. However, Bree was not seen during the Battle of Marineford."}], "images": []}, {"title": "Masked Deuce", "level": 3, "content": [{"type": "paragraph", "text": "Most of the Spade Pirates' crew members (excluding Skull, Mihar, and Kotatsu) read and laughed at Deuce's poor writing in his adventure diary. Because of this, their names were excluded from the diary."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Bree's abilities are unknown, but he and his crew were easily defeated by Newgate."}], "images": []}, {"title": "Martial Arts", "level": 3, "content": [{"type": "paragraph", "text": "Bree fights using martial arts, though his exact style of combat is unknown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Making Their Mark", "level": 3, "content": [{"type": "paragraph", "text": "Ducky Bree joined the Spade Pirates and traveled with Ace as he made a name for himself. He helped fight off a group of bounty hunters, and, when Isuka infiltrated the crew's ship, he surrounded the Marine Ensign alongside his crewmates. However, she easily fended them off. After the confrontation, the crew reached Sabaody Archipelago. While they waited for their ship to be coated, Bree and his crewmates explored the island and secretly read Deuce's adventure diary. They laughed at his poor writing skills, leading Deuce to exclude their names from the diary."}, {"type": "paragraph", "text": "At one point, the Spade Pirates were shipwrecked in Wano Country. The people from Amigasa Village were starving to death, so they tied the entire crew and stole all their food. The crew watched the villagers finish their meal and then broke out. Instead of attacking, Ace asked the villagers where he could get them dessert. They stayed in Amigasa Village for a few weeks and became good friends with Tama."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0c/Spade_Pirates_Tied_In_Wano.png/revision/latest/scale-to-width-down/200?cb=20190721133517", "caption": "Ace, Ducky Bree, and Aggie 68 captured by the Amigasa Village."}]}, {"title": "Encountering Whitebeard", "level": 3, "content": [{"type": "paragraph", "text": "When his captain was fighting Jinbe, Bree warned him about the fish-man's strength. After Ace and Jinbe tied, Bree and the other Spade Pirates defended their captain against Edward Newgate and were easily defeated. They were then taken into the Whitebeard Pirates like their captain. Bree has not been seen since his joining."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/The_Spade_Pirates_Prepare_to_Fight_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20170830092251", "caption": "The Spade Pirates prepare to fight Whitebeard."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Spade Pirates vs. Bounty hunters", "elements": []}, {"text": "Spade Pirates vs. Isuka", "elements": []}, {"text": "Spade Pirates vs. Edward Newgate", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 552 and Episode 461, Bree makes his first appearance.", "elements": []}, {"text": "↑  ONE PIECE Magazine — Volume 2, Bree and the rest of the Spade Pirates are named.", "elements": []}, {"text": "↑  Novel A - Chapter 2, Bree and his crew mates fight Isuka and reach Sabaody Archipelago.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 912 (p. 7), The Spade Pirates shipwreck in Wano Country and become friends with Tama.", "elements": []}]}], "images": []}]}