{"sections": [{"title": "Isuka", "level": 1, "content": [{"type": "paragraph", "text": "\"Nailing\" Isuka is a Marine Ensign that confronted the Spade Pirates during their time of activity."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Isuka is a young woman with short vermilion hair, brown eyes, and a burn scar on the back of her hand."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Isuka_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20170904000221", "caption": "Isuka concept art."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She is against taking hostages. Deuce considers her to be nice and honest, but a bit careless as well. She believes that children should not have to go through the pain she went through as a child from pirates."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Draw", "level": 3, "content": [{"type": "paragraph", "text": "When Isuka was a young girl, Draw saved her from a fire that he started, which burned her village down and killed her parents. Unaware that he started the fire, Isuka looked up to him and joined the Marines so she could rescue people from pirates. However, when Draw revealed his willingness to start fires, she realized that he burned down her village and broke down in tears. As the two have rarely interacted, Draw does not seem to put any thought into what his rescue of Isuka meant to her while it is unknown how Isuka views Draw after his defeat."}], "images": []}, {"title": "Portgas D. Ace", "level": 3, "content": [{"type": "paragraph", "text": "Ace and Isuka's relationship was similar to Luffy and Smoker's relationship, except on more amicable terms. She attacked Ace and his crew, viewing it as her duty to enforce justice. When she almost drowned, Ace threw her a life preserver, causing her to change her view about him. She attacked his crew several times since then, but Ace easily dealt with her with no grudges. Isuka then decided to try to get Ace to give up piracy, seeing him as a good person. After Ace stopped Draw's assault, Ace offered her a spot in his crew but she declined and parted ways with him on good terms."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Isuka is a skilled swordswoman who fights by piercing her opponent full of holes with a rapier, earning her the epithet \"Nailing\"."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Isuka wields a rapier in combat."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "When Isuka was a little girl, her village was burned down by a fire caused by Draw, who was a Lieutenant Commander at the time, during a pirate attack. Her parents were killed, but she was saved by Draw. She received a burn scar during the attack."}, {"type": "paragraph", "text": "At one point, Isuka infiltrated the ship of the Spade Pirates and fended off the crew easily. However, Deuce's plan forced Isuka to retreat and save her colleagues. After saving many Marines, she nearly drowned, but was saved by a life preserver thrown by Ace. From that day forth, she swore to chase down Ace."}, {"type": "paragraph", "text": "She encountered Ace and the Spade Pirates again at Sabaody Archipelago during a holiday. She went with Draw, who was promoted to Vice Admiral, to deliver Ace an invitation to join the Shichibukai. After Ace declined the invitation, she learned of the harsh truth about Draw and her past during the battle between Ace and Draw."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Isuka (イスカ) is the Japanese name of the red crossbill. According to a medieval legend, the crossbill gained its crossed bill by trying to free Jesus Christ from the cross by pulling out the nails, which caused blood to spurt out and stain the bird forever as a token of its efforts. This fits with Isuka being a righteous Marine and her epithet \"Nailing\". Oda's design notes for Isuka in One Piece Magazine Vol.3 include a sketch of the bird and a note mentioning the legend.", "elements": []}, {"text": "Isuka shares some similarities to Smoker in terms of role, as a marine chasing after the pirate protagonist.", "elements": [{"text": "Like Smoker and Luffy, Isuka and Ace clash several times on Grand Line as Isuka attempts to capture Ace.", "elements": []}, {"text": "Ace saves Isuka from drowning despite the two being enemies, similar to Luffy ordering Zoro to save Smoker during the Alabasta Arc.", "elements": []}, {"text": "However, while Luffy was unable to defeat Smoker due to the latter's Logia intangibility, the power dynamic is reversed with Ace and Isuka as Ace possesses the Logia-type Mera Mera no Mi.", "elements": []}]}, {"text": "Isuka's history with Draw is similar to that of Flare and Cyrano from Oda's one-shot story Monsters.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c7/Isuka_Bird.png/revision/latest/scale-to-width-down/180?cb=20170903235744", "caption": "Oda's note on the bird inspiration."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Magazine Vol.2", "elements": []}]}], "images": []}]}