{"sections": [{"title": "Mihar", "level": 1, "content": [{"type": "paragraph", "text": "\"Indoor\" Mihar is a member of the Spade Pirates and, subsequently, the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mihar is a tall man with thin limbs and slight shoulders. He has a thin nose, a small smile, a mustache, and a tattoo on his left cheek. He wears a dark-colored silk hat, glasses, dark shorts, and dark boots. He also wears a v-neck shirt with a dark jacket over it."}, {"type": "paragraph", "text": "In the anime, he is depicted with a beard."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mihar is a private person, as he'd rather be indoors reading than engaging in his crew's antics. He dislikes outdoor activities, earning the epithet \"Indoor.\" Instead, he read books."}, {"type": "paragraph", "text": "Mihar is also very selfless, as he became a teacher to help children who cannot get an education."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Portgas D. Ace", "level": 3, "content": [{"type": "paragraph", "text": "Ace took Mihar out to sea and supports his dreams of providing children with education. Mihar deeply respects Ace."}], "images": []}, {"title": "Masked Deuce", "level": 3, "content": [{"type": "paragraph", "text": "Unlike the majority of his crew, Mihar respects Masked Deuce, as he did not laugh at his poor writing. He also protected Deuce from a sneak attack and warned him to be careful."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Mihar is a skilled sniper and he uses a rifle. He is regarded as one of the best fighters in the crew, despite his appearance."}, {"type": "paragraph", "text": "Along with Deuce and Skull, Mihar serves as the brains of the Spade Pirates, being capable of forming and executing strategies for the crew."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Making Their Mark", "level": 3, "content": [{"type": "paragraph", "text": "Mihar used to be a teacher, and he joined the Spade Pirates and traveled with Ace as he made a name for himself. He helped fight off a group of bounty hunters, and he saved Deuce from a bounty hunter who tried to sneak up on him. When Isuka infiltrated the crew's ship, he surrounded the Marine Ensign alongside his crewmates. However, she easily fended them off. After the confrontation, the crew reached Sabaody Archipelago. While they waited for their ship to be coated, Mihar and his crewmates explored the island and secretly read Deuce's adventure diary. Unlike the rest of his crewmates, he did not laughed at his poor writing skills."}, {"type": "paragraph", "text": "After spending time in Sabaody, Mihar and the Spade Pirates descended to Fish-Man Island to begin their journey in the New World."}, {"type": "paragraph", "text": "At one point, the Spade Pirates were shipwrecked in Wano Country. The people from Amigasa Village were starving to death, so they tied the entire crew and stole all their food. The crew watched the villagers finish their meal and then broke out. Instead of attacking, Ace asked the villagers where he could get them dessert. They stayed in Amigasa Village for a few weeks and became good friends with Tama.​​"}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Spade_Pirates_and_O-Tama.png/revision/latest/scale-to-width-down/180?cb=20180903031944", "caption": "Aggie 68, Mihar, Ace, and Tama."}]}, {"title": "Encountering Whitebeard", "level": 3, "content": [{"type": "paragraph", "text": "After Ace and Jinbe tied, Mihar and the other Spade Pirates defended their captain against Edward Newgate and were easily defeated. They were then taken into the Whitebeard Pirates like their captain. Mihar has not been seen since his joining."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/The_Spade_Pirates_Prepare_to_Fight_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20170830092251", "caption": "The Spade Pirates Prepare to Fight Whitebeard."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Spade Pirates vs. Bounty hunters", "elements": []}, {"text": "Spade Pirates vs. Isuka", "elements": []}, {"text": "Spade Pirates vs. Edward Newgate", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Coincidentally, before Mihar was introduced, a non canon member of the Spade Pirates had a very similar appearance was shown in the anime.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/%22Mihar%22.png/revision/latest/scale-to-width-down/120?cb=20170907165258", "caption": "The non canon member."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 552 and Episode 461, Mihar makes his first appearance.", "elements": []}, {"text": "↑  ONE PIECE Magazine — Volume 2, Mihar and the rest of the Spade Pirates are named.", "elements": []}, {"text": "↑  One Piece Anime — Episode 897, Mihar is seen in Tama's flashback.", "elements": []}, {"text": "↑  Novel A - Chapter 2, Mihar and his crewmates fight Isuka and reach Sabaody Archipelago.", "elements": []}, {"text": "↑  Novel A - Chapter 3, The Spade Pirates set off for the New World.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 912 (p. 7) and Episode 894, The Spade Pirates' visit to Amigasa Village is seen.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 912 (p. 11-12) and Episode 897, The Spade Pirates' relationship with Tama is seen.", "elements": []}]}], "images": []}]}