{"sections": [{"title": "Skull", "level": 1, "content": [{"type": "paragraph", "text": "Skull was a member of the Spade Pirates and, subsequently, the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Skull is a man with an average build, a hairy chest, and long dark hair. He has an angular chin and a tattoo on his right arm, and he stands with a slight slouch. He wears a cracked skull mask, a dark-colored shirt with a skull pattern, bracelets on his wrists and left forearm, and a sash with a skull on it. He also wears light-colored pants with a dark skull on the left leg, skull-shaped necklaces, and dark-colored boots. On his right hip, Skull sports a sword with a striped hilt and a dark sheath."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Skull is a self-described pirate enthusiast, collecting pirate goods and stowing away on ships simply due to his love of the occupation. Skull's pirating knowledge extends to other related topics as well, as seen when he identified Marine Ensign Isuka during their first encounter and warned Ace not to disturb the World Noble's during their visit to Sabaody Archipelago. He does not consider himself to be a pirate, and he chooses to hide his face behind a skull mask. He is also considered one of the smartest on the crew, alongside Mihar and Masked Deuce. Unlike most of his crewmates, Skull is very respectful, as he did not laugh at Deuce's poor writing like the others."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Portgas D. Ace", "level": 3, "content": [{"type": "paragraph", "text": "Like the rest of the Spade Pirates, Skull cares greatly for his captain, defending him from a Yonko. Unlike other pirates who Skull met, Ace recognizes his exceptional pirate knowledge and experience as valuable assets. Skull appreciates this."}], "images": []}, {"title": "Masked Deuce", "level": 3, "content": [{"type": "paragraph", "text": "Unlike the majority of his crew, Skull respects Deuce, as he did not laugh at his poor writing."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Skull has expert knowledge on pirates and their weapons. Because of this, he is easily able to recognize his enemies' weapons and quickly disarm them."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Skull wears a sword on his right hip. It is unknown how proficient he is with using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Making their Mark", "level": 3, "content": [{"type": "paragraph", "text": "Prior to joining the Spade Pirates, Skull developed a fascination for pirates, stowing away on numerous ships and amassing a collection of pirate goods and skull-shaped accessories. When he met Ace, the pirate captain recognized Skull's superb knowledge, inviting him to join the Spade Pirates and travel with Ace as he made a name for himself."}, {"type": "paragraph", "text": "Skull helped fight off a group of bounty hunters, jamming one's skull-designed gun and stealing it. When Isuka infiltrated the crew's ship, he identified her and surrounded the Ensign alongside his crewmates. However, she easily fended them off. After the confrontation, the crew reached Sabaody Archipelago. While they waited for their ship to be coated, Skull and his crewmates explored the island and secretly read Deuce's adventure diary. Unlike the rest of his crewmates, he didn't laugh at his poor writing skills. When Ace went off to explore, Skull warned him not to cause trouble with the World Nobles, Marines, or bounty hunters."}, {"type": "paragraph", "text": "After spending time in Sabaody, Skull and the Spade Pirates descended to Fish-Man Island to begin their journey in the New World."}, {"type": "paragraph", "text": "At one point, the Spade Pirates were shipwrecked in Wano Country. The people from Amigasa Village were starving to death, so they tied the entire crew and stole all their food. The crew watched the villagers finish their meal and then broke out. Instead of attacking, Ace asked the villagers where he could get them dessert. They stayed in Amigasa Village for a few weeks and became good friends with Tama.​​"}], "images": []}, {"title": "Encountering Whitebeard", "level": 3, "content": [{"type": "paragraph", "text": "After Ace and Jinbe tied, Skull and the other Spade Pirates defended their captain against Edward Newgate and were easily defeated. They were then taken into the Whitebeard Pirates like their captain. "}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/The_Spade_Pirates_Prepare_to_Fight_Whitebeard.png/revision/latest/scale-to-width-down/210?cb=20170830092251", "caption": "The Spade Pirates Prepare to Fight Whitebeard."}]}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "He appeared along with several Division Commanders of the Whitebeard Pirates in their attempt to rescue Ace."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Spade Pirates vs. Bounty hunters", "elements": []}, {"text": "Spade Pirates vs. Isuka", "elements": []}, {"text": "Spade Pirates vs. Edward Newgate", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 552 and Episode 461, Skull makes his first appearance.", "elements": []}, {"text": "↑  ONE PIECE Magazine — Volume 2, Skull and the rest of the Spade Pirates are named.", "elements": []}, {"text": "↑  Novel A - Chapter 2, Skull and his crew mates fight Isuka and reach Sabaody Archipelago.", "elements": []}, {"text": "↑  Novel A - Chapter 3, Skull warns Ace not to cause trouble with the World Nobles, Marines, or bounty hunters while on Sabaody.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 552.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 553 (p. 7).", "elements": []}]}], "images": []}]}