{"sections": [{"title": "Draw", "level": 1, "content": [{"type": "paragraph", "text": "Draw is a Marine Vice Admiral and the main antagonist of One Piece novel A Volume 1."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Draw is stated to be a robust-looking man."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Although Draw appears to be cheerful most of the time, he possesses a strong hatred for pirates, and will take any opportunity he has to kill them. He is more than willing to engage in wanton violence that will harm innocent citizens, putting the blame on the pirates for forcing him to use these methods. Due to his hatred for pirates, he does not like the Shichibukai system."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Isuka", "level": 3, "content": [{"type": "paragraph", "text": "When Isuka was a young girl, Draw saved her from a fire that he started, which burned her village down and killed her parents. Unaware that he started the fire, Isuka looked up to him and joined the Marines so she could rescue people from pirates. However, when Draw revealed his willingness to start fires, she realized that he burned down her village and broke down in tears. As the two have rarely interacted, Draw does not seem to put any thought into what his rescue of Isuka meant to her while it is unknown how Isuka views Draw after his defeat."}], "images": []}, {"title": "Portgas D. Ace", "level": 3, "content": [{"type": "paragraph", "text": "Although he approved of Ace's disdain for the Shichibukai system, Draw was quick to take the chance to attack the infamous pirate. Ace grew angry at Draw because of the collateral damage he caused, and they had a brutal fight."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine Vice Admiral, Draw has authority over Marines of lower rank than him."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Draw's signature weapons are two flamethrowers that are attached to the bottom of his arms. They produce extremely strong flames that will easily light the surroundings ablaze, and even Ace, the user of the Mera Mera no Mi, struggled to withstand them. The flamethrowers are powered by a fuel tank, which can explode from fire and injure Draw, although Draw is strong enough to keep fighting afterwards."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "As a Vice Admiral, Draw is capable of using Haki. He used Busoshoku Haki in his battle against Ace, greatly amplifying his punches and allowing him to hit and grab Ace despite the pirate's Logia ability. He was able to easily gouge the ground with his fist and overpower Ace in a fistfight before Ace gained Busoshoku Haki of his own."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "One Piece novel A", "level": 3, "content": [{"type": "paragraph", "text": "When he was a Lieutenant Commander, Draw ended up lighting Isuka's village on fire while he was fighting pirates, burning it down and killing Isuka's parents. Draw saved Isuka from the fire, and Isuka ended up believing that the pirates started the fire."}, {"type": "paragraph", "text": "Several years passed, and Draw rose to the position of Vice Admiral. Isuka, now a Marine Ensign, reunited with him so the two could work to give the infamous pirate Portgas D. Ace the opportunity to join the Shichibukai. They got an invitation for him from the Five Elders, and went to Sabaody Archipelago to give it to him. Ace refused, saying he did not like the Shichibukai, and Draw approved his answer since he shared the same sentiment. However, he then took the opportunity to try to kill Ace instead, and revealed his flamethrowers to see which fire user would emerge victorious."}, {"type": "paragraph", "text": "He unleashed the flamethrowers' power, setting the slums around them ablaze, and Ace's crewmate Masked Deuce grabbed ahold of Draw while Ace went to rescue the endangered citizens. Deuce removed Draw's fuel tank, and Draw fought Ace, managing to counter the pirate's abilities with his Busoshoku Haki. However, Ace's fire caused Draw's fuel tank to explode, injuring both of them, and Ace attacked Draw with a newfound ferocity. At this point, Ace gained Busoshoku Haki of his own, allowing him to overpower Draw, and after the two punched each other in the face, Draw was finally defeated."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Draw vs. Portgas D. Ace and Masked Deuce", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece novel A, Draw makes his debut.", "elements": []}]}], "images": []}]}