{"sections": [{"title": "Chichilisia", "level": 1, "content": [{"type": "paragraph", "text": "Chichilisia is the leader of the Niho Navy and the father of Uholisia."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chichilisia is a large man, although Chinjao towers over him. He wears a robe bearing his romanized name on the left side and the name of the Niho Navy on the right. He also wears a dark cape with a very high collar."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Chichilisia took the arranged union between his navy and the Happo Navy seriously, as shown when he berated the Chinjao Family and let his daughter beat up Sai for breaking off their arranged marriage."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As leader of the Niho Navy, Chichilisia has full control over it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Chichilisia arranged with Chinjao, the leader of the Happo Navy, for their navies to join forces with the marriage of his daughter Uholisia and Chinjao's grandson Sai."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "The Stories of the Self-Proclaimed Straw Hat Grand Fleet", "level": 4, "content": [{"type": "paragraph", "text": "Chichilisia and Uholisia were in Kano Country when the Chinjao Family returned from their journey to Dressrosa. There, Sai revealed that he had called off his engagement to Uholisia in order to marry Baby 5, and Chichilisia angrily berated Chinjao as his daughter beat Sai up."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The first part of his name, \"chichi\" (父, \"chichi\"), means \"father\" in Japanese.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 87 Chapter 879, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 13, Chichilisia makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 77 Chapter 771 (p. 7) and Episode 710.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 87 Chapter 877, cover story: The Stories of the Self-Proclaimed Straw Hat Grand Fleet Vol. 12.", "elements": []}]}], "images": []}]}