{"sections": [{"title": "Buche", "level": 1, "content": [{"type": "paragraph", "text": "Buche is a member of the WCI 31, serving as the head chef of the first kitchen."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Buche is a short and rotund man with short dark hair and a long handlebar mustache. His sideburns on both sides are connected by a mustache-like set of facial hair under his actual mustache. He wears a dark buttoned shirt with a sash at the top, an apron around his waist, and a large beret."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Buche is a very loyal chef to his masters in the Charlotte Family and Big Mom Pirates. When commissioned to help Pudding make a cake, he voiced his skepticism of the time constraints they had, but was put back in line by Chiffon."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a head chef and a member of the WCI 31, who are the finest chefs of Totto Land, Buche is an extremely skilled and experienced chef, having been summoned alongside other members of WCI 31 by Pudding to create a new wedding cake to satisfy Big Mom's craving."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Big Mom developed a craving for wedding cake and went on a rampage for it, Buche and 30 other renowned head chefs were brought to Cacao Island to make preparations for Charlotte Pudding to make a wedding cake. When Pudding, Chiffon, and Sanji arrived, the WCI 31 reported for duty, and Pudding had each of them go into the Sweets Factory one at a time. When Buche came inside, Pudding altered his memories, making him believe that the wedding between her and Sanji happened smoothly but the cake was destroyed due to bad weather. Pudding, Chiffon, and Sanji outlined the plan to make the wedding cake within 2 hours and 40 minutes, and Buche was skeptical of the relatively short amount of time they had, but Chiffon intimidated them into following the plan. The baking then began."}, {"type": "paragraph", "text": "Buche and the other chefs eventually completed making the cake and then unloaded it onto a cart. On the cart, the chefs began to add the finishing touches to the cake. However, they were soon told to unload the cake onto the Nostra Castello, the ship of the Fire Tank Pirates. As such, Buche and the other chefs boarded the pirate ship to finish decorating the cake. By the time they finished, the chefs all fainted from exhaustion. Afterwards, Bege brought the cake to Funwari Island with Buche and the tired chefs on board. However, the Nostra Castello was destroyed by the damage dealt to it by Prometheus as soon as it landed on the island. The current status of the WCI 31 remains unknown."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Buche is named after bûche de Noël, which is French for \"Yule log cake\". His name fits with the general food naming theme of Totto Land residents.", "elements": [{"text": "Bouche, his name in the Viz translation, is French for \"mouth\".", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 88 Chapter 880 (p. 4) and Episode 852, Buche makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 891, The chefs faint from exhaustion.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 899, The Nostra Castello sinks from its damage.", "elements": []}]}], "images": []}]}