{"sections": [{"title": "Charlotte Custard", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Custard is the sixth daughter and 16th child of the Charlotte Family and the middle triplet sister of Cracker and Angel. She is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Custard is a slim, young-looking woman who has fair skin, brown eyes, short violet hair adorned with a flower. She wears a purple-pink bodysuit with matching elbow-length gloves and belt around her waist. She also wears a large, fluffy light pink cape with pink polka dots around her shoulders."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nothing is known about Custard's personality. However, since she took part in Big Mom's plan to assassinate the Vinsmoke Family and led a squad after the Fire Tank Pirates, she can be considered very loyal to her family and crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Custard has authority over lower-ranking members of her crew, being chosen to lead a squad that pursued the Fire Tank Pirates. Her combat powers and abilities are unknown, but she is presumably strong as she is an officer of a Yonko-led crew."}, {"type": "paragraph", "text": "Custard possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Custard is shown to wield a long sword."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Custard was present at the wedding of Charlotte Pudding and Sanji. During the wedding, Capone Bege attempted to assassinate Big Mom, but the Big Mom Pirates unleashed a successful counterattack. When Bege's accomplice Monkey D. Luffy attempted to attack Big Mom, Custard was seen being blown away by their clash."}, {"type": "paragraph", "text": "However, the battle was interrupted when the Tamatebako exploded at the base of the Whole Cake Chateau, tipping it over. The Big Mom Pirates causing the Chateau and everyone on it to fall to the ground fell toward far below, but their fall was broken when Streusen turned part of the Chateau into cake."}, {"type": "paragraph", "text": "Following the collapse of Whole Cake Chateau, Custard was chosen to lead a squad to pursue Bege and the Fire Tank Pirates. However, Custard's squad lost track of their ship once they made it to the sea due to the failure of the territory sea slugs."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Charlotte Custard and her pursuit squad vs. Fire Tank Pirates", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Custard is a dessert or sweet sauce made with eggs, milk, and sugar. This follows the Big Mom Pirates and Charlotte Family's food themed names.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 862 (p. 9) and Episode 832, Custard makes her debut.", "elements": []}, {"text": "↑  One Piece Anime — Episode 855, Custard is identified.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 88 Chapter 882 (p. 14) and Episode 855.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  One Piece Anime — Episode 838.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 87 Chapter 871 (p. 9) and Episode 841.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 87 Chapter 872 and Episode 843.", "elements": []}]}], "images": []}]}