{"sections": [{"title": "Charlotte Nusstorte", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Nusstorte is the 12th son and 21st child of the Charlotte Family and the eldest triplet brother of Basskarte and Dosmarche. He is also an officer of the Big Mom Pirates and serves as Totto Land's Minister of Transport (運輸大臣, Un'yu Daijin), governing over Package Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nusstorte is a large man with a massive head compared to the rest of his body. He has a very thick mustache and wears a pair of sunglasses. He also wears a purple commodore jacket with gold and green epaulettes and a large indigo bicorne with a face that has an identical mustache. In comparison, his head and bicorne together are nearly the same height as the rest of his body. He is also seen with a brown tobacco pipe and carries his sword behind his back."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Since Nusstorte was willing to take part in Big Mom's plan to assassinate the Vinsmoke Family, he can be considered very loyal to his family and crew. Furthermore, this would display his brutal nature in that he had no qualms about killing others for the benefit of his family. Likewise, his invasion of the Germa Kingdom with his 10,000 men army shows that he is ruthless and willing to destroy all those that stand in the way of the Big Mom Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Transport, Nusstorte has direct authority over Package Island. Furthermore, as an officer of the Big Mom Pirates, he has authority over lower-ranking members of his crew."}, {"type": "paragraph", "text": "Nusstorte is considerably powerful as an officer of a Yonko-led crew as he was entrusted to lead a 10,000 strong army to invade the Germa Kingdom and destroy its scientifically advanced military. Both Charlotte Mont-d'Or and Charlotte Oven were certain that Nusstorte would be successful in stealing their cloning technology, but, in reality, he was not strong enough to defeat the Vinsmoke Family."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Nusstorte generally wields a large cutlass."}, {"type": "paragraph", "text": "During the siege on the Big Father Castle, he also carried a Walker, in which he used it to fire at his enemies."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "In the anime, he was shown fighting with his cutlass with enough skill to temporarily clash with Sanji and Niji. He also relied on his hat homie to attack his enemies using hidden needles and surprise wind attacks."}], "images": []}, {"title": "Techniques", "level": 3, "content": [{"type": "list", "elements": [{"text": "Nusstorte Tokusei Tatsumaki Decoration (ヌストルテ特製竜巻デコレーション, Nusutorute Tokusei Tatsumaki Dekorēshon, literally meaning \"Nusstorte Special Tornado Decoration\"): Nusstorte's hat blows out a powerful gust of wind with enough power to generate a tornado to entrap his opponent. Nusstorte considers this his trump card in battle.", "elements": []}]}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/25/Nusstorte_Special_Tornado_Decoration.png/revision/latest/scale-to-width-down/180?cb=20190713093156", "caption": "Nusstorte summons a tornado."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the reports broke out that Straw Hat Luffy had supposedly escaped and was running amok, Nusstorte was summoned to Mont-d'Or's meeting regarding the current status of the Sanji Retrieval Team on Whole Cake Island."}, {"type": "paragraph", "text": "Nusstorte later attended the Tea Party where he was seated next to Dosmarche. As the announcer announced the commencement of the wedding ceremony, Nusstorte watched as Sanji and Pudding made their entrance. However, the assassination failed to go as planned and, to Nusstorte's horror, several Luffys suddenly emerged from the wedding cake."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "While some of his siblings prepared to kill the Germa 66 during the ruckus caused by Luffy, Nusstorte attempted to prevent Sanji from rescuing his family. He tried to attack him using his cutlass, but the latter was able to fend it off with his kick. Nusstorte, Laurin, and Dosmarche then prepared to trap Sanji from the front while Oven moved in from behind."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "Afterwards, Nusstorte took part in the siege on the Big Father Castle activated by Bege, where the Straw Hats, the Germa 66, and the Fire Tank Pirates were hiding. He then looked on as Big Mom attacked the castle and when Bege deactivated his Big Father form, Nusstorte was among those who fired at the alliance before the Vinsmoke Family blocked their shots. Afterwards, he watched as Katakuri stopped Caesar in his path right before he was about to escape with Bege."}, {"type": "paragraph", "text": "Just as their enemies were about to be defeated, the Tamatebako dropped to the base of Whole Cake Chateau and the bomb detonated, causing the entire castle to collapse with everyone on it. The Big Mom Pirates, however, were saved when Streusen used his  ability to turn the whole castle into cake. The Big Mom Pirates then split up their forces to pursue their enemies, with Nusstorte, Dosmarche, and Basskarte leading a squad to chase after the Vinsmokes and invade the Germa Kingdom."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "After arriving at the Germa Kingdom, Nusstorte ordered his men to attack. As they fought, he watched on and complimented on the fearlessness of the Clone Soldiers, while laughing in joy at the idea that they would soon gain hold of this military power. Before long, his forces were attacked by Vinsmoke Niji, which caused Nusstorte to be taken aback in surprise. Nusstorte then recomposed himself and engaged Niji in battle. He tried to attack him, but Niji easily dodged and kicked him from behind as he watched in horror. Afterwards, Nusstorte shook off the static left by the attack and Niji prepared to charge at him again. In response, Nusstorte fired needles from his hat homie and commented on how this would be the first time in a while since he last displayed his full power. Niji then mocked him that those were words that weak people usually say and zoomed behind him and tried to kick him, but Nusstorte was able to turn around in time and fend off the attack."}, {"type": "paragraph", "text": "The fight continued, but Niji was able to easily fend off attacks from Nusstorte's cutlass. Niji then commented on how they would never be able to defeat the Germa with such little power, to which Nusstorte replied that he still had his trump card. He attacked Niji with his Nusstorte Tokusei Tatsumaki Decoration, summoning a tornado from his hat that entrapped Niji within. He then fired more needles at Niji while the latter was stuck inside. Assuming he had already won, Nusstorte laughed at his self-perceived victory before Niji then sent a wave of electricity through the tornado."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "Ultimately, Nusstorte and his squad were defeated by the Vinsmokes. An unconscious Nusstorte was then held by the neck by Niji to impersonate his voice while reporting to Mont-d'Or about the \"defeat\" of the Germa. With the Big Mom Pirates deceived into believing that their army had won, Nusstorte and his siblings were then tossed into the sea."}, {"type": "paragraph", "text": "When the Germa Fleet appeared off Cacao Island, Mont-d'Or tried contacting Nusstorte to find out what had happened. However, there was no response from Nusstorte, who laid unconscious in the sea."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/54/Nusstorte_Kicked_by_Niji.png/revision/latest/scale-to-width-down/180?cb=20190715045054", "caption": "Nusstorte is kicked by Niji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f7/Germa_Commanders_Defeat_Big_Mom_Pirates_Squad.png/revision/latest/scale-to-width-down/180?cb=20180930030041", "caption": "Nusstorte and his brothers are defeated by the Germa 66."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Big Mom Pirates vs. Sanji Retrieval Team-Fire Tank Pirates-Vinsmoke Family Alliance", "elements": []}, {"text": "Nusstorte, Basskarte, Dosmarche, and their 10,000 men army vs. Germa 66", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Nusstorte, Laurin, and Dosmarche vs. Sanji", "elements": []}, {"text": "Nusstorte vs. Vinsmoke Niji (Germa Kingdom)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Additional scenes involving Nusstorte were shown in the anime. Among those scenes were when the anime established that Nusstorte was engaging in battle with Sanji while some of his siblings prepared to kill the Germa 66. However, the manga never shows this and it remains unknown what Nusstorte was doing following the destruction of the wedding cake. Furthermore, Nusstorte's invasion of the Germa Kingdom is shown in the anime and he is seen fighting with Niji."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name comes from Bündner Nusstorte or Engadiner Nusstorte, a nut filled pastry. That follows the Big Mom Pirates and Charlotte Family food themed names.", "elements": []}, {"text": "His appearance may be modeled after the mascot of the Cap'n Crunch cereal brand.", "elements": []}]}], "images": []}]}