{"sections": [{"title": "Usagihebi", "level": 1, "content": [{"type": "paragraph", "text": "Usagihebi is an animal who lives on the Island of Rare Animals. Like all the animals on the island, he is protected by Gaimon."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Usagihebi is a mixture of a snake and a rabbit, with a white and pink snake body and rabbit ears."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much of its personality is known, but it appears to be friendly as it is able to form a close bond with Gaimon."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Syrup Village Arc", "level": 3, "content": [{"type": "paragraph", "text": "Usagihebi was the first animal Luffy and Nami encountered on the Island of Rare Animals. He was seen again with a group of animals when Gaimon waved goodbye to the departing Straw Hats."}], "images": []}, {"title": "Buggy's Crew Adventure Chronicles", "level": 3, "content": [{"type": "paragraph", "text": "Usagihebi, Cocox, and Lionbuta were there to witness Buggy's crash-landing on the Island of Rare Animals and the subsequent battle between him and Gaimon."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Usagihebi was seen watching as the new inhabitant of the island, the barrel-woman Sarfunkel, fed Gaimon some food."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Its name is a portmanteau between the words usagi (兎, Japanese for rabbit) and hebi (蛇, Japanese for snake). This reflects its appearance as a snake with rabbit ears.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 22 (p. 6) and Episode 18, Usagihebi debuts", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements (p. 245), His name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 22 (p. 28) and Episode 18, Gaimon talks about being the Forest Guardian.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 22 (p. 29) and Episode 18, Cocox witnesses the Straw Hats' departure.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 5 Chapter 43, cover story: Buggy's Crew Adventure Chronicles Vol. 7 and Episode 46, Cocox witnesses Buggy's crash-landing.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 620, cover story: From the Decks of the World Vol. 7, Cocox seen two years later.", "elements": []}]}], "images": []}]}