{"sections": [{"title": "Charlotte Bavarois", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Bavarois is the 26th son and 45th child of the Charlotte Family, as well as an officer of the Big Mom Pirates. He is the younger twin brother of Snack."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bavarois is an extremely tall man with a thick physique. He has blonde hair in strands that resemble dreadlocks, thick mustache, and a braided beard that goes to his upper chest. He wears a yellow and black horizontally-striped jumpsuit, dark shoes, and a blueish-purple cape that seems to be in tatters at the end. He also wears white bandages over his arms, dark red boxing gloves on his hands, a cap that has dark blue letters \"BM\" on the front, and a pair of shades made from the netting of the cap on his forehead."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bavarois is loyal to his family and crew, as he led a fleet to attack the Straw Hat Pirates, being intent on taking them down. He can raise his temper when problems arise, as shown when the cannonball homies were having difficulty aiming for the Straw Hats."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Bavarois has authority over lower-ranking members of his crew. His combat powers and abilities are unknown, but he is presumably strong as he is an officer of a Yonko-led crew."}, {"type": "paragraph", "text": "Bavarois appears to have considerable leadership skill, as he commands his own ship and led a fleet of Tarte ships in pursuit of the Straw Hats."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "30 years ago, Bavarois was born to Charlotte Linlin and her 21st husband along side his older twin brother, Snack."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "As the Straw Hat Pirates were heading for Cacao Island after escaping Whole Cake Island, Big Mom and a fleet led by Bavarois caught up to them and pursued them. Bavarois's fleet shot cannonballs at the Thousand Sunny, but because of Big Mom's cake craving insanity, the cannonball homies were easily influenced by the Straw Hats. This made Bavarois angry as the Straw Hats were ahead of them thanks to Jinbe's knowledge of the sea currents. However, Daifuku's and Smoothie's fleets arrived, catching the Straw Hats between the two forces. Bavarois later watched as the Straw Hats' ally Carrot took on a powerful form and single-handedly attacked Daifuku's ship."}, {"type": "paragraph", "text": "While watching the destruction, Bavarois noticed Big Mom's demeanor changing before reporting to Perospero that Pudding was bringing the cake to them on Bege's ship. He then watched as Big Mom summoned Zeus and Prometheus back to her side while wielding Napoleon in its sword form before proceeding to attack the Straw Hats herself. After Big Mom landed on the Thousand Sunny with her special homies, Bavarois commented on how Big Mom was hungry. He was later shocked to see Zeus discharging and striking Big Mom with lightning."}, {"type": "paragraph", "text": "As the Nostra Castello approached the Thousand Sunny, Big Mom's attention turned to the Fire Tank Pirates, seeing the cake on Bege's ship. With Big Mom pursuing Bege's crew, Bavarois was assigned to follow Big Mom and Bege alongside Perospero. They followed Big Mom to Funwari Island and prepared themselves for the outcome of Big Mom eating the cake. Bavarois then witnessed his mother eat the cake, which finally ended her rampage."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bavarois's name comes from crème bavaroise, or \"Bavarian cream\" in English. This corresponds with the food-themed names of his family and crew.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 88 Chapter 888 (p. 4-7, 10-11) and Episode 861, Charlotte Bavarois makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 88 Chapter 888 (p. 5), Bavarois is introduced and his name is romanized.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 88 Chapter 889 (p. 6-7, 14-15) and Episode 863.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 89 Chapter 890 (p. 3, 18) and Episodes 863–865.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 89 Chapter 892 (p. 4, 9-10) and Episodes 866–867.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 899 (p. 2-4).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 900 (p. 3-7).", "elements": []}]}], "images": []}]}