{"sections": [{"title": "Charlotte Flampe", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Flampe is the 36th daughter and 77th child of the Charlotte Family, and an officer of the Big Mom Pirates, serving as the Captain of the Special Attack Unit (Viz: \"Kamikaze Captain\") (特攻隊長, Tokkō-taichō)."}, {"type": "paragraph", "text": "She is also Totto Land's Minister of Honey (はちみつ大臣, Hachimitsu Daijin), governing over Rokumitsu Island, and the President of the Katakuri Fan Club (カタクリファンクラブ会長, Katakuri Fan Kurabu Kaichō)"}, {"type": "paragraph", "text": "Due to her actions and role, she is a minor antagonist during the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Flampe appears to be a lanky young girl with dark hair in a very long ponytail that curls up at the end. Her ponytail is held up with a flower-shaped hair tie. She wears a dark red shirt with a frilly high collar and frilly long sleeves. She also wears dark red tights and light-colored loafers. Over her clothes, she wears a polka-dotted outfit which balloons out like a jelly bean and allows her to bounce around."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Flampe is an obsessive girl who looks up to her older brother Katakuri because of his perfection status, to the point that she would interrupt the battle between him and Luffy in order to preserve that status. She also loves him to the point that she would compete with her siblings to get her brother’s favoritism and she would instantly denounce her subordinates' chances of even getting it. However, this obsession is entirely superficial, since Flampe displayed immense shock when Katakuri injured himself, and repeatedly mocked the appearance of her brother's hidden mouth. She is petty and immature, threatening to gossip about Katakuri's display of weakness to everyone."}, {"type": "paragraph", "text": "She is shown to be rather vain, taking pleasure of being the cutest sister. However, she is loyal to her mother and her family, as she accompanied Big Mom and her siblings to infiltrate Wano to get Zeus and get her revenge on Luffy."}, {"type": "paragraph", "text": "Flampe seems to be sadistic, since she would always laugh every time something bad happens to others. This even extends to her subordinates, as she will immediately demean them and even attack them if they do something that fails to meet her standards. She also takes enjoyment in toying and torturing her opponents along with her subordinates, as seen when she repeatedly mocked Luffy taking his utmost efforts to stand up and face Katakuri. This extends to anyone she dislikes, as she attempted to torment Katakuri with the prospect of humiliating him about his mouth to the public."}, {"type": "paragraph", "text": "She appears to be confident in her sharpshooting abilities and regards to being stealthy. Though she tends to underestimate opponents as seen when she was surprised that Luffy possessed Haoshoku Haki before she passed out."}, {"type": "paragraph", "text": "Despite her sadism, she is shown to be disgusted by blood, as she repeatedly derided Luffy for being bloodied during his fight with Katakuri and likewise became extremely angry and disgusted with Katakuri when some of his blood splashed on her face."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Flampe is loyal enough to her mother that she accompanied her to Wano Country for revenge against the Straw Hats."}], "images": []}, {"title": "Charlotte Katakuri", "level": 4, "content": [{"type": "paragraph", "text": "Flampe originally admired her brother Katakuri, and even became the president of a fan club dedicated to him. While watching her brother's fight against Luffy, she interrupted the battle because she wanted to preserve her brother's perfect status and to become Katakuri's favorite sister."}, {"type": "paragraph", "text": "When Katakuri caught wind of her intrusion, Flampe expected praise from him while he was approaching her. Instead, he stabbed himself with his trident and angrily berated her for her interference while telling her to never interrupt in his duel with Luffy. When she looked at Katakuri's teeth, she rolled away from him in terror and called him a \"monster\". Distraught at the appearance of Katakuri's mouth, Flampe began to detest and ridicule him. She even had her subordinates photograph him in an attempt to expose his eel-like teeth throughout the entire Totto Land. Not wanting her to meddle in his fight and being annoyed with her rants, Katakuri willingly knocked her and her subordinates out with Haoshoku Haki as punishment."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Due to his battle with Katakuri, Flampe sees Luffy as an enemy and even calls him a \"monkey\". Not wanting him to ruin Katakuri's perfect status, she blew a dart at Luffy during the fight, making an opening for her brother to wound him, which she found laughable. When Luffy got up again, Flampe attempts to shoot him again with her Silent Blowgun, but Luffy dodged it, leaving her shocked that he was able to dodge her silent needle. Luffy and Katakuri used Haoshoku Haki to render Flampe and her subordinates unconscious so they can resume their battle without anyone bothering them. Before completely passing out, Flampe was shocked to learn that Luffy possesses that kind of Haki."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Honey, Flampe has authority over Rokumitsu Island, and as the Special Attack Unit Captain, Flampe has direct control over an entire squad that specializes in special attacks. Furthermore, as an officer of the Big Mom Pirates, she is able to give orders to the lower-ranked members of the crew despite her young age. Flampe is able to perfectly hide her presence, so much that neither Katakuri nor Luffy noticed her until she revealed herself."}, {"type": "paragraph", "text": "She does not possess a particularly strong will, as she was knocked out by Luffy and Katakuri's Haoshoku Haki."}], "images": []}, {"title": "Fluffy Balloon System", "level": 3, "content": [{"type": "paragraph", "text": "The Fluffy Balloon System (ふわふわ風船システム, Fuwafuwa Fūsen Shisutemu) is a device contained in Flampe's outfit, which allows her to float in the air like an actual balloon. The device was obtained when Big Mom was destroying other countries."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Flampe's main weapon is a blowgun, which she uses to shoot \"Numbing Needles\" (シビレ針, Shibire-bari). Flampe is a skilled marksman, and her dress briefly deflates when she shoots, indicating that the air in it is used to shoot the blowgun and gives it great range. The needle shots are silent, allowing Flampe to take enemies by surprise, although they do not seem to be exceptionally powerful. The needles are so silent that not even Luffy nor even Katakuri, two fighters with Kenbunshoku Haki, notice her interference."}, {"type": "paragraph", "text": "She used a fork to punish the sniper who failed to hit Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Flampe%27s_Blowgun.png/revision/latest/scale-to-width-down/210?cb=20190113175025", "caption": "Flampe shoots from her blowgun."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the second battle between Katakuri and Monkey D. Luffy in the Mirro-World, Flampe went in with some subordinates and had them try to shoot Luffy so she could become Katakuri's favorite sister. She stabbed one of them with a fork to punish him for his failure when Luffy kept dodging his shots and remarked on Luffy's tenacity as he refused to quit. Flampe managed to shoot Luffy in the leg with her Silent Blowgun, and she laughed as Katakuri managed to deal a critical blow to him as a result of her interference."}, {"type": "paragraph", "text": "Flampe was ecstatic as Katakuri pummeled Luffy, but when Luffy continued getting up, she tried shooting at him again. Luffy dodged the shot but fell down in the process, causing Flampe and her subordinates to laugh at him and attract Katakuri's attention. Thinking Katakuri was coming to praise her, Flampe received a rude awakening as Katakuri stabbed himself and revealed his mouth as he shouted at her for interfering in his battle. Flampe instantly became disillusioned with her brother after his display of weakness and mocked his mouth, having her subordinates take pictures of it, stating she would show them to everyone else. However, she and her subordinates were quickly knocked out by a blast of Luffy and Katakuri's Haoshoku Haki."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Big Mom tried to infiltrate Wano, Flampe accompanied her mother and crew as they attempted to cross the waterfall into the country. However, just before they reached the top of the waterfall, King attacked the ship, causing the ship to fall off the waterfall and Big Mom to fall into the sea."}, {"type": "paragraph", "text": "Later, although Big Mom had gone missing, the ship luckily did not capsize, and so Flampe reflected on their situation with the rest of her family, asking if they had no choice but to wait."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name is based on flambé, a cooking procedure in which food is covered in liquor and set alight briefly. This follows the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}, {"text": "In the initial printing of her debut chapter, Flampe was introduced as the 33rd daughter of the Charlotte Family, making her older than Charlotte Pudding at 15 years old. This was corrected on the day of the chapter's release by Oda's staff on Twitter, on a later chapter, and on the volume release.", "elements": [{"text": "The mistake has been made again in her debut episode, despite the volume being released 6 months before the episode.", "elements": []}]}, {"text": "Flampe was ranked by her older siblings as their favorite younger sister.", "elements": []}, {"text": "Flampe's favorite food is chewing gum.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 89 Chapter 891 (p. 3-5) and Episode 865, Flampe is introduced.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.4", "elements": []}, {"text": "↑  https://one-piece.com/special/sbs/detail/7.html", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #1147), Information about Flampe is revealed.", "elements": []}, {"text": "↑  https://twitter.com/Eiichiro_Staff/status/952769448112357376", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 893 (p. 1), Flampe is identified as the 36th daughter of the Charlotte Family.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 893 (p. 2-16), Flampe's and Katakuri's relationship is explored.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 892 (p. 16-17), Flampe shoot Luffy, and laugh at his wound.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 7-9), The Big Mom Pirates begin their assault into Wano Country.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 934.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 89.", "elements": []}]}], "images": []}]}