{"sections": [{"title": "Charlotte Raisin", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Raisin is the 33rd son and 60th child of the Charlotte Family and an officer of the Big Mom Pirates. He was a member of Big Mom's enraged army sent to fight Monkey D. Luffy, and later joined Charlotte Oven's army to ambush Luffy on Cacao Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Raisin is a very tall man, standing about as tall as his brother Yuen and towering over most of the soldiers on Cacao Island. He has long spiky white hair as well as a pink line that vertically ran down his face across each eye."}, {"type": "paragraph", "text": "He wears a double-breasted white jacket, white pants, and a long purple that had pink epaulettes with a yellow border and tassels. He also wears grey gloves, a black belt with which he carries his sword, and brown boots."}, {"type": "paragraph", "text": "When Raisin first appeared in the anime, his color scheme and design were slightly different. His hair was pale blond and the marks on his face were thinner. His jacket was lilac, he had a teal sash instead of a belt, and his cape was pink, shorter, and lacked the epaulettes. His appearance was changed to its current look in episode 869, except the epaulettes which were added later in episode 871."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Charlotte Family and the Big Mom Pirates, Raisin is loyal to his affiliation to the point that he joined the enraged army in order to avenge his brother's defeat, and came to Cacao Island to stand guard against the Straw Hat Pirates."}, {"type": "paragraph", "text": "Raisin is an analytical man, taking into account of Brûlée's disappearance when considering Luffy's possible means of escaping the Mirro-World. While possessing a serious demeanor and usually sporting a stoic expression, he seems to enjoy fighting as he smiled when he prepared to attack Luffy with his sword."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Raisin has authority lower-ranking members of his crew. He seems to be also a skilled strategist, given the way he would explain how he would act if he were in the Straw Hat Pirates' position."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Raisin is capable of jumping extremely high and attacking while in midair."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Raisin carries a katana with him, and attempted to use it to attack Luffy. However, he was unable to perform an attack before being kicked by Sanji."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Raisin is capable of using Busoshoku Haki to harden his sword."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/Raisin_Haki.png/revision/latest/scale-to-width-down/120?cb=20180313100534", "caption": "Raisin using Haki on his sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Raisin joined Big Mom's enraged army to avenge Cracker after he was defeated by Monkey D. Luffy. After Luffy and Nami were defeated, Raisin watched as Amande found Lola's Vivre Card on Nami before the army headed back to Sweet City."}, {"type": "paragraph", "text": "The next night, Raisin joined his siblings and Oven on Cacao Island in their plan to ambush the Straw Hat Pirates. He commented on the trouble of not having the Territorial Sea Slugs at their disposal. While waiting for Luffy, Raisin pondered on the course of action that Luffy would take. As the Straw Hats' promised rendezvous time drew near, Raisin and his comrades prepared to ambush Luffy."}, {"type": "paragraph", "text": "Luffy came out of the mirror along with Pekoms and the captured Charlotte Brûlée. Pekoms assisted Luffy in escaping, but when Luffy tried to jump over the town's buildings, Raisin jumped up as well and prepared to attack him. However, he was kicked in the jaw by Sanji, sending him crashing into a building and causing him to lose his katana."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Sanji_Saves_Luffy_from_Raisin.png/revision/latest/scale-to-width-down/210?cb=20190210034521", "caption": "Raisin being taken down by Sanji."}]}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Big Mom tried to infiltrate Wano Country, Raisin accompanied his mother and crew as they attempted to climb the waterfall into the country on the Queen Mama Chanter. However, just before they reached the top of the waterfall, King attacked the ship, causing the ship to fall off the waterfall and Big Mom to fall into the sea."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Big Mom's army vs. Monkey D. Luffy, Nami, and Kingbaum", "elements": []}, {"text": "Oven's army vs. Luffy, Pekoms, and Sanji", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Raisin vs. Vinsmoke Niji", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "During the enraged army's attack in the anime, Raisin was shown striking Luffy after he was trapped in the world of books by Mont-d'Or. This was not shown in the manga."}, {"type": "paragraph", "text": "During the Straw Hats' escape from Cacao Island, Raisin was not seen again after Sanji kicked him in the manga. In the anime, Raisin appeared again to strike Pekoms, giving the Big Mom Pirates an opportunity to subdue him."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A raisin is a dried grape, often used in baked goods and desserts, which fits the food-themed names of the Charlotte Family and Big Mom Pirates. It is also the French word for grape.", "elements": []}]}], "images": []}]}