{"sections": [{"title": "Charlotte Joconde", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Joconde is the 27th daughter and 59th child of the Charlotte Family and an officer of the Big Mom Pirates. She was a member of Charlotte Oven's army to intercept the Straw Hat Pirates on Cacao Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Joconde is a short woman with very long, bushy blonde hair. She wears a frilly strapped light green dress over a green shirt, as well as a knight's helmet with a long spike on top. She also wears gauntlets and armor on her legs too. She rides a helmeted horse as a mount."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Joconde appears to take great pride in her crew, as she was ashamed of the fact that so much of Big Mom's forces were gathered to defeat the 10-member Straw Hat team, calling it an embarrassment to Big Mom's name."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Joconde has authority over lower-ranking members of her crew. Her combat powers and abilities are unknown, but she is presumably strong as she is an officer of a Yonko-led crew. She is strong enough to have been sent with many of her siblings to Cacao Island to fight Luffy."}, {"type": "paragraph", "text": "She fights while riding a horse."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "She is seen wielding a large lance, but her skill with it is unknown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Joconde came to Cacao Island along with many of her siblings and crewmates to stand guard in preparation for an attack on the Straw Hat Pirates. When she saw how much of their forces was gathered to take on the Straw Hats, Joconde stated that Big Mom's name was weeping. As the Straw Hats' promised rendezvous time drew near, the Big Mom Pirates prepared to ambush Luffy once he exited the Mirro-World."}, {"type": "paragraph", "text": "She was then preoccupied with fighting Germa's forces that she did not notice Oven's command to stop Luffy and Sanji from escaping. After the Straw Hats escaped, the Big Mom Pirates were later joined by Linlin when she arrived at the island."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Joconde sponge is the French name of an almond-flavored sponge cake, which fits with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 89 Chapter 894 (p. 14-15) and Episode 869, Joconde makes her debut.", "elements": []}, {"text": "↑", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8),", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 902.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 896.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 898.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 902.", "elements": []}]}], "images": []}]}