{"sections": [{"title": "Charlotte Decuplets", "level": 1, "content": [{"type": "paragraph", "text": "The Charlotte Decuplets are the 36-40th sons and 30-34th daughters of the Charlotte Family, making up the 65-74th children in the family, and are all officers of the Big Mom Pirates. They are the largest group of Big Mom's children born in a single birth."}, {"type": "paragraph", "text": "They were first mentioned in SBS Volume 85, but were not identified until they gathered on Cacao Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Four of the male decuplets are of average height and size while Newshi is noticeably taller and larger than the others. They all possess purple hair that goes down to their necks, although each of their hairstyles is marginally different. They have small beady eyes, and a button noses. They all wear pink suits over red shirts, and a colored bowler hats. These hats are red (Newichi), yellow (Newji), green (Newsan), lilac (Newshi), and blue (Newgo)(originally there was another yellow). Four of them also wear yellow ties. In the manga, when gathered at Cacao Island, they wore bow ties instead."}, {"type": "paragraph", "text": "Four of the female decuplets are of average height and size while Harumeg is noticeably taller and larger than the others. The female decuplets all have long brown hair that is styled in different ways (Nutmeg-Down, Akimeg-Top Knot, Allmeg-Afro, Harumeg-Bunches, and Fuyumeg-Braid) with pink bows on top. They wear pink dresses (with the exception of Nutmeg, who wears a crop top and hotpants) with colored bow ties (Nutmeg-red, Fuyumeg-blue, Harumeg-green, Akimeg-yellow, and Allmeg-cyan), white gloves, horizontally-striped pink and white leggings, and red-pink high heels."}], "images": []}, {"title": "Members", "level": 3, "content": [{"type": "paragraph", "text": "The sons' names - Newichi (ニューイチ, Nyūichi), Newji (ニュージ, Nyūji), Newsan (ニューサン, Nyūsan), Newshi (ニューシ, Nyūshi), and Newgo (ニューゴ, Nyūgo) - were revealed in One Piece Magazine Vol.5 as well as their order of birth."}, {"type": "paragraph", "text": "The daughters' names - Nutmeg (ナツメグ, Natsumegu), Akimeg (アキメグ, Akimegu), Allmeg (オールメグ, Ōrumegu), Harumeg (ハルメグ, Harumegu), Fuyumeg (フユメグ, Fuyumegu) - were revealed in One Piece Magazine Vol.4 as well as their order of birth."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "The decuplets are all loyal to their family and crew, as they have been seen joining Big Mom's army to avenge their fallen crewmate and brother Cracker, going to crew meetings, and joining Oven's force on Cacao Island to take down the Straw Hats."}, {"type": "paragraph", "text": "The male decuplets seem to be more business-minded, as Newshi showed his reservations about gathering excessive amounts of strength to take on the Straw Hat Pirates. In contrast, the females seem to be more jovial, as they delighted in the atmosphere during the occupation of Cacao Island and anticipated having fun while standing guard. They idolize Katakuri, but one of the males was also open to the possibility of Luffy defeating Katakuri, prompting one of the females to hit him on the head. They all became vengeful when they learned that Luffy defeated their brother and tried to attack the former."}, {"type": "paragraph", "text": "Some of the males seem to be very sadistic, as one of them joyfully cheered as he attacked Luffy, while another ruthlessly brutalized Pekoms."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As officers of the Big Mom Pirates, the Decuplets have authority over lower-ranking members of their crew. The females' capabilities are unknown, but they are presumably strong as they are officers of a Yonko-led crew."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "At least three of the male decuplets are capable of using Geppo, as shown when they took to the air to attack Sanji and Luffy on Cacao Island."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Each decuplet carries a scythe with two spikes at the end of the blade, and one of the males managed to shatter the ground when he slammed his scythe into it. One of the male decuplets was also seen using a gun when shooting at the Vinsmoke Family. In the anime, the male decuplets are shown using bazookas to try to shoot Sanji down."}], "images": []}, {"title": "Anime Only Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Ichi! Ji! San! Shi! Go! (一 二 三 四 五, literally meaning \"One! Two! Three! Four! Five!\"): Each of the male decuplets take a turn attacking an enemy with a weapon of some kind, striking in their birth order. This attack pattern has only been seen in the anime.", "elements": []}]}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Charlotte Newshi ate the Gocha Gocha no Mi, a Paramecia-type Devil Fruit which allows him to fuse with his nine decuplet siblings and transform into a giant lanky figure with an enlarged scythe."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/47/Gocha_Gocha_no_Mi_Infobox.png/revision/latest/scale-to-width-down/200?cb=20190324125515", "caption": "The merged figure."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Eighteen years ago, the decuplets were born to Big Mom, setting the record for her largest single birth."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Charlotte Cracker was defeated by Monkey D. Luffy, at least two of the male decuplets joined Big Mom's enraged army to take out Luffy and Nami. After the two were captured, one of the decuplets watched as Amande acquired Lola's Vivre Card from Nami."}, {"type": "paragraph", "text": "Later, four of the male decuplets attended a meeting of the Big Mom Pirates, where they discussed the statuses of the Straw Hats and their accomplices who tried to invade Whole Cake Island."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "The males decuplets attended the Tea Party before Sanji and Pudding's wedding. After the Vinsmokes put on their Raid Suits, Niji repelled some of the decuplets before saving Chopper from Oven."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "The next night, the decuplets reported to Cacao Island along with many of their siblings and crewmates to join Oven's battalion in preparation to ambush Luffy and the Straw Hats. While the males remarked on the ridiculous size of their forces, the females were looking forward to what was going to happen, and Nutmeg hugged Oven. As the arranged time for the Straw Hats to arrive drew near, the decuplets brought out their scythes, and one of the males wondered if Luffy would defeat Katakuri. This caused Allmeg to hit him with her scythe as Oven scoffed at the idea. The pirates discussed how Luffy would escape and noted that Charlotte Brûlée would likely get captured, with Allmeg calling her clumsy. With five minutes to go, the Big Mom Pirates prepared to ambush Luffy."}, {"type": "paragraph", "text": "Pekoms came out of the mirror with a captive Brûlée, but the Big Mom Pirates quickly discovered that he was hiding Luffy, and one of the males decuplets raced to attack Luffy with his crewmates. When Luffy took to the air and Sanji saved him from Raisin, Fuyumeg was surprised when her brother was defeated. Shortly after, three of the males accompanied their brother Yuen into the sky to confront Luffy and Sanji, while Newshi helped his crewmates attack Pekoms. However, the skirmish was interrupted when Germa 66 arrived at Cacao Island. As Sanji and Luffy made their escape with Germa's assistance, the decuplets were in utter shock once they heard about Katakuri's defeat at Luffy's hands."}, {"type": "paragraph", "text": "They later used the power of the Gocha Gocha no Mi to fight back against the Vinsmokes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2f/Four_of_the_Charlotte_Decuplets_Males_at_the_Big_Mom_Pirates_Meeting.png/revision/latest/scale-to-width-down/210?cb=20180208085814", "caption": "The decuplets attending the Big Mom Pirates meeting."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oven's army vs. Pekoms and Germa 66", "elements": [{"text": "Charlotte Decuplets vs. Vinsmoke siblings", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Decuplet's males vs. Vinsmoke Niji (Whole Cake Chateau)", "elements": []}, {"text": "Charlotte Decuplets vs. Pekoms", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, one of the male decuplets was seen attacking Pekoms while the latter was restrained. Meanwhile, some of the other males attacked Sanji and Luffy together with Yuen. In the anime, the males attack Sanji and Luffy without Yuen until Pekoms fends them off. The females then fight Pekoms but are beaten back as well."}, {"type": "paragraph", "text": "The decuplets merging together is shown onscreen in the anime and their clash with the Vinsmoke siblings is shown as well."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In keeping with the Charlotte Family's food-themed names, one daughter takes her name from the spice Nutmeg (ナツメグ, Natsumegu), whilst one son takes his from the Japanese word for Butterfat (乳脂肪, Nyūshibō). The remaining decuplets derive their names from puns on the name of these two siblings:", "elements": [{"text": "The daughters' names are puns based off Nutmeg. Nutmeg is read as natsumegu in Japanese romaji, and natsu is the Japanese word for summer. The prefixes of the other daughters' names come from the words for the three other seasons (aki is autumn, fuyu is winter and haru is spring), as well as \"all\" for all of the seasons.", "elements": []}, {"text": "The suffixes of the sons' names follow a numeric theme (ichi for one, ji for two, san for three, shi for four, and go for five) that matches their birth order.", "elements": []}]}, {"text": "Newgo was ranked by his older siblings as their second-favorite younger brother, behind only Anglais.", "elements": []}, {"text": "Taking into account the visuals of the Decuplets in One Piece Magazine Vol.5, the anime misidentifies Newsan and Newshi.", "elements": [{"text": "The anime mistakenly identifies Newshi, the fourth male decuplet, as Newsan, his third twin brother, and vice-versa.", "elements": []}]}]}], "images": []}]}