{"sections": [{"title": "Charlotte Brownie", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Brownie is the 32nd son and 58th child of the Charlotte Family and an officer of the Big Mom Pirates. He joined Charlotte Oven's army to intercept the Straw Hat Pirates on Cacao Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Brownie's a man with jaw area is very rotund and large in comparison to the top of his head. He has a pointy nose and light purple hair that sticks up on the sides. He also has a very hairy chest too. He wears a studded suit with a very high collar as well as a tall and thin top hat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Brownie_Full_Body.png/revision/latest/scale-to-width-down/150?cb=20190217032219", "caption": "A full-body view of Brownie."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Brownie appears to be rude, lazy, and easily bored, as he blew off standing guard on Cacao Island after seeing the excessive amounts of forces stationed there and decided to go to sleep instead, only wanting to be woken up if anything happened."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Brownie has authority over lower-ranking members of his crew. His combat powers and abilities are unknown, but he is presumably strong as he is an officer of a Yonko-led crew. His is strong enough to have been sent with many of his siblings to Cacao Island to fight Luffy."}, {"type": "paragraph", "text": "Brownie does appear to command subordinates, as he captains his own ship that bears his name on the sail."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Brownie is seen holding a bat while fighting against Germa 66."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Brownie took his ship to Cacao Island to help stand guard in preparation for an attack on the Straw Hat Pirates, but after seeing how many of his siblings and crewmates had gathered just for less than ten people, he decided to go to sleep instead, telling his subordinates to wake him up if something happened. He later woke up when the Big Mom Pirates' fleet was under attack by Germa 66. He was then preoccupied with fighting Germa's forces that he did not notice Oven's command to stop Luffy and Sanji from escaping overhead."}, {"type": "paragraph", "text": "After the Straw Hats escaped, the Big Mom Pirates were later joined by Linlin when she arrived at the island."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A brownie is a small square of rich chocolate cake, typically containing nuts. This fits with the Charlotte Family and Big Mom Pirates' food-themed names.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 89 Chapter 894 (p. 14-15) and Episode 869, Brownie makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 894 (p. 14-15), Brownie's name is seen romanized on his ship.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 898.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 897.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 902.", "elements": []}]}], "images": []}]}