{"sections": [{"title": "Charlotte Yuen", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Yuen is the 35th son and 64th child of the Charlotte Family and an officer of the Big Mom Pirates. He was a member of Charlotte Oven's army to ambush Monkey D. Luffy on Cacao Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yuen is a very tall young man, towering over those of average height. He wears a black round helmet with two horn-like spikes, which covers all of his head besides his broad face. He has small and simplified facial features, which appear mask-like even though they are real, as they are seen moving. He wears a brown biscuit-patterned shirt similar to that of Cracker's Biscuit Soldiers, a pink sash across his waist, and wide red vertically-striped pants. He also wears a very large light yellow cape that has an orange flower design on the top left."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Charlotte_Yuen_Anime_Concept_Art.png/revision/latest/scale-to-width-down/140?cb=20190129143454", "caption": "Yuen's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Yuen is loyal to his family and crew, as he came to Cacao Island to take on the Straw Hat Pirates. He appears to hate being ignored, as his normally jovial expression changed into anger when he noticed Sanji looking away from him, which he said was rude and caused him to attack."}, {"type": "paragraph", "text": "He has a tendency to add the suffix \"-yu\" at the end of his sentences."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Yuen has authority over lower-ranking members of his crew. He is capable enough to have been deployed with many of his siblings to Cacao Island to fight Luffy."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Yuen possesses a great amount of physical strength, as he capably wielded and kept control of his staff when its orb had grown massive in size."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Yuen is capable of using Geppo, which he views as a merely simple ability."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Yuen wields a staff with an orb on its tip. He is capable of expanding this orb to a massive size, allowing him to bludgeon his opponents with massive force. The power in its swing was strong enough to send Sanji crashing hard into the ground. However, it was destroyed by Vinsmoke Yonji."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Yuen_Attacks_Sanji_and_Luffy.png/revision/latest/scale-to-width-down/210?cb=20180312060255", "caption": "Yuen attacking Sanji and Luffy with his expanded staff."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Yuen came to Cacao Island along with many of his siblings and crewmates to stand guard in preparation for an attack on the Straw Hat Pirates. As Raisin discussed Luffy's next possible course of action, Yuen mentioned that Brûlée went missing. As the Straw Hats' promised rendezvous time drew near, the Big Mom Pirates prepared to ambush Luffy once he exited the Mirro-World."}, {"type": "paragraph", "text": "Luffy came out on time with Pekoms and a captured Brûlée, and made headway as Sanji came in to assist him and Pekoms took on the Big Mom Pirates. However, as Sanji was taking Luffy through the sky, Yuen and three of his decuplet brothers used Geppo to confront them. When Sanji got distracted by Pekoms' situation, Yuen got annoyed and used his staff to smash the two Straw Hats into the ground. However, the skirmish was interrupted by the sudden arrival of Germa 66."}, {"type": "paragraph", "text": "Germa's interference allowed Sanji and Luffy to escape, and as Yuen tried attacking them again, the orb of his staff was shattered by Vinsmoke Yonji. He was then grabbed and swung around by Yonji's extended hand, sending him crashing into buildings and his crewmates and defeating him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Winch_Green.png/revision/latest/scale-to-width-down/210?cb=20190217180441", "caption": "Yuen being defeated by Yonji."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oven's army vs. Monkey D. Luffy, Pekoms, and Sanji", "elements": []}, {"text": "Oven's army vs. Germa 66", "elements": [{"text": "Yuen vs. Vinsmoke Yonji", "elements": []}]}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yuen's name could refer to Tangyuan, a Chinese sweet dumpling, which fits with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 89 Chapter 894 (p. 14-15), Yuen makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 85, The Charlotte Decuplets are revealed to be 18 years old.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 897 (p. 13).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 897 (p. 12-13).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 898.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 896 (p. 2-3, 17).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 897 (p. 2-3, 6-17).", "elements": []}]}], "images": []}]}