{"sections": [{"title": "Charlotte Poire", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Poire is the 19th daughter and the 43rd child of the Charlotte Family and an officer of the Big Mom Pirates. She is the younger twin sister of Galette."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Poire is a woman with shoulder-length fuchsia wavy hair. She has round eyes and an extremely large mouth that displays a set of very sharp teeth. On her head she wears a hat that appears to be the skin of a panda's head; the hat is stitched on the sides, and the stitches start right where her mouth ends. She wears a low-cut dark dress with small frills on the top, and over it she wears an open coat which is lined with fur, especially around the neck."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Poire's personality, but she appears to be a civil woman, as she was shown chatting with someone at the tea party. She is loyal to her family and crew as she attacked the members of the Straw Hat-Fire Tank alliance after they crashed the wedding and attempted to assassinate her mother."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Poire has authority over lower-ranking members of her crew. Her combat powers and abilities are unknown, but she is presumably strong as she is an officer of a Yonko-led crew."}, {"type": "paragraph", "text": "Poire possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Poire wields a machine gun, which she used on Caesar Clown and Capone Bege when they attempted to escape from the wedding. In the anime, she wields a 6 barreled-gatling cannon. She later used a sword in an attempt to strike Vinsmoke Reiju."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "On the roof of Whole Cake Chateau, Poire attended the tea party and wedding between Sanji and her sister Charlotte Pudding. When the tea party began, she was talking to an anthropomorphic frog."}, {"type": "paragraph", "text": "When Monkey D. Luffy, Jinbe, and Pedro crashed the wedding and Jinbe declared that he was leaving the Big Mom Pirates, Poire joined several of her crewmates in attacking Jinbe."}, {"type": "paragraph", "text": "The Straw Hat Pirates broke Big Mom's portrait of Carmel and caused Big Mom to unleash a massive scream, which incapacitated the Big Mom Pirates. After Bege's assassination attempt on Big Mom failed, Katakuri created earplugs for himself and his crewmates. Poire watched as Katakuri rescued Brûlée from the clutches of the Straw Hats, who along with Jinbe and the Fire Tank Pirates were retreating inside Bege's Big Father fortress. The Big Mom Pirates besieged their enemies, and when they attempted to escape after Bege returned to his normal form, Poire helped shoot at them with her machine gun, but the shots were blocked by the Vinsmoke Family."}, {"type": "paragraph", "text": "The Big Mom Pirates defeated their enemies, but Big Mom's Tamatebako ended up falling off the Chateau and unleashed a massive explosion that toppled the Chateau. The Big Mom Pirates and their guests fell onto Sweet City, but their fall was cushioned after Streusen turned part of the Chateau into cake."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Big Mom tried to infiltrate Wano Country, Poire accompanied her mother and crew as they attempted to climb the waterfall into the country on the Queen Mama Chanter. However, just before they reached the top of the waterfall, King attacked the ship, causing the ship to fall off the waterfall and Big Mom to fall into the sea."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Poire, Charlotte Tablet, and Charlotte High-Fat vs. Jinbe", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Poire means \"pear\" in French and a Poire Williams is a colorless fruit brandy made from the Williams pear. This fits with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}, {"text": "Poire's panda hat resembles the hairstyle of a resident of the Sheep's House where Big Mom grew up.", "elements": []}, {"text": "She is the middle child of all Charlotte children, having both 42 older siblings and 42 younger siblings.", "elements": []}]}], "images": []}]}