{"sections": [{"title": "Charlotte Basskarte", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Basskarte is the 13th son and 22nd child of the Charlotte Family and the middle triplet brother of Nusstorte and Dosmarche. He is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Basskarte is a large and wide man, with his head also being wide. The bottom part of his face is obscured by the collar of his jacket, which covers his entire body. He keeps his hands inside his long sleeves. He also wears a mask over his mouth and nose and a headband that obscures his face further. He has a massive mane of puffy hair that resembles flames. While the manga has yet to show Basskarte's face, the anime shows that his mouth has fangs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/18/Basskarte%27s_Face_in_the_Anime.png/revision/latest/scale-to-width-down/150?cb=20180923072727", "caption": "Basskarte's face as shown in the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Basskarte is very loyal to his family and crew, as he readily took part in Big Mom's plan to assassinate the Vinsmoke Family and helped his crew chase after and attack the Straw Hats and Germa Kingdom. He even accompanied his mother to Kaido's territory at Wano Country for revenge against the Straw Hats."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Basskarte has authority over lower-ranking members of his crew. His combat powers and abilities are unknown, but he is presumably strong as he is an officer of a Yonko-led crew, but not strong enough to defeat the Vinsmoke Family."}, {"type": "paragraph", "text": "Through unknown means, Basskarte can launch flames from his hands strong enough to quickly set a small area ablaze, although these flames were ineffective against the Vinsmoke Family's Raid Suits. In the anime, he can breathe out fire as well. He was ultimately overpowered by the Vinsmokes in battle."}, {"type": "paragraph", "text": "Basskarte possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "As a member of the group assigned to assassinate the Vinsmoke Family, Basskarte wielded a Walker."}, {"type": "paragraph", "text": "During his clash with Yonji at the Germa Kingdom in the anime, Basskarte used a sword."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Basskarte was present at the tea party and wedding between Charlotte Pudding and Sanji on the roof of the Whole Cake Chateau. He was sitting with his brothers Zuccotto, Oven and Daifuku behind Reiju, awaiting the signal to start Big Mom's plot. After Monkey D. Luffy and his allies crashed the wedding, Basskarte and some of his crewmates trapped the Vinsmokes and held them at gunpoint, with Basskarte pointing his gun at Vinsmoke Reiju's head. However, the enemy pirates shattered Big Mom's portrait of Carmel, causing her to unleash a scream that incapacitated her crew. Basskarte watched in shock and fear as the Fire Tank Pirates betrayed Big Mom and prepared to assassinate her, but their attempt was unsuccessful."}, {"type": "paragraph", "text": "Katakuri gave his crewmates earplugs to resist Big Mom's scream and the enemy alliance retreated into Capone Bege's \"Big Father\" fortress. Basskarte's group tried to attack the freed Vinsmokes. Basskarte set the area around the Vinsmokes on fire, but the flames had no effect once they donned their Raid Suits. He stood and saw Big Mom's attack on the alliance. The Big Mom Pirates defeated the enemy alliance, but Big Mom's Tamatebako ended up falling off the Chateau and exploding, causing the Chateau to topple over. However, the Big Mom Pirates' fall was broken when Streusen turned part of the Chateau into soft cake."}, {"type": "paragraph", "text": "The Big Mom Pirates regrouped, and Basskarte and several of his crewmates prepared to pursue the escaping Straw Hats. However, they were met with a surprise when Big Mom, who had developed a craving for wedding cake, overtook them and chased after the Straw Hats herself. Later, Basskarte joined Nusstorte's army to attack the Germa Kingdom. The entire army was defeated by Germa 66, and Reiju sat on Basskarte's defeated body before he and the rest of the army were thrown into the sea."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Basskarte_Defeated_By_Reiju.png/revision/latest/scale-to-width-down/180?cb=20180930121314", "caption": "Basskarte defeated."}]}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Big Mom tried to infiltrate Wano Country, Basskarte accompanied his mother and crew as they attempted to climb the waterfall into the country on the Queen Mama Chanter. However, just before they reached the top of the waterfall, King attacked the ship, causing the ship to fall off the waterfall and Big Mom to fall into the sea. Later, after Big Mom went missing, Basskarte watched on as his siblings argued about who would succeed Big Mom if she were to be captured and killed by Kaido."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Nusstorte's pursuit squad vs. Germa 66", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Basskarte vs. Vinsmoke Yonji (Germa Kingdom)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Additional scenes of the Big Mom Pirates' invasion of the Germa Kingdom are added in the anime. During the invasion, Basskarte made his way to the Germa cloning facility, where he clashed with Yonji. After the fight moved out of the facility, Basskarte revealed his face before trying to take out Yonji with a fire breath attack."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Basskarte's name matches the Charlotte Family's music themed names, and can be a reference to several different connections:", "elements": [{"text": "His Japanese spelling resembles that of the musical instrument bass clarinet.", "elements": [{"text": "\"Basskarte\" is a name of a musical piece played on a bass clarinet.", "elements": []}]}, {"text": "His English spelling is comprised from the words \"Bass\", another musical instrument, and \"Quartet\", musical composition for four voices or instruments.", "elements": []}]}]}], "images": []}]}