{"sections": [{"title": "Charlotte Dosmarche", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Dosmarche is the 14th son and 23rd child of the Charlotte Family and the younger triplet brother of Nusstorte and Basskarte. He also is an officer of the Big Mom Pirates and serves as Totto Land's Minister of Tea (お茶大臣, Ocha Daijin), governing over Black Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dosmarche is a large portly man with olive skin and a round body with notably short limbs when compared to the rest of his body. His head is also quite pudgy and possesses a round nose, a long black handlebar mustache, and thick eyebrows. His hair has already become grey and styles it into a short messy mohawk. His attire is mostly purple in color, wearing a ruffled dark purple shirt, a light purple cape, and dark blue pants, along with a red ascot. He also carries a sword on the right side of his belt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Charlotte_Dosmarche_Portrait.png/revision/latest/scale-to-width-down/140?cb=20190806084336", "caption": "A close up of Dosmarche's face."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Dosmarche's personality, but since he took part in Big Mom's plan to assassinate the Vinsmoke Family and helped his crew chase after and attack the Germa Kingdom, he can be considered very loyal to his family and crew. He was frightened by the thought of Big Mom's reaction to the destruction of Mother Carmel's photo."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Tea, Dosmarche has authority over Black Island, and as an officer of the Big Mom Pirates, he has authority over lower-ranking members of his crew, being capable enough to be part of an important mission such as conquering the Germa Kingdom."}, {"type": "paragraph", "text": "His full abilities are unknown, but as a officer of a Yonko-led crew, he is likely quite strong. However, he was no match against the Vinsmoke Family and was easily defeated."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He also wields a sword although it is unknown how skilled he is at using it."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "The anime showed him with a second sword that he could combine with his first sword, allowing him to utilize it like a flying buzzsaw. He demonstrated the ability to control his swords at a distance, allowing him to utilize them as a ranged weapon. How he does this is unknown."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Dosmar Ogi (ドスマル奥義, Dosumaru Ōgi, literally meaning \"Dosmar Mystery\"): Dosmarche combines the ends of his two swords into a spinning circle and launches it at his enemies. He can then control his swords from a distance using hand motions to encircle his enemy and slice them apart. Furthermore, he can then motion the blades to return to him.", "elements": []}]}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/06/Dosmarche%27s_Attack.png/revision/latest/scale-to-width-down/180?cb=20190713101631", "caption": "Dosmarche prepares to fire his special move."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Dosmarche attended the tea party and wedding between Sanji and Charlotte Pudding, where he took part in Big Mom's plan to assassinate the Vinsmoke Family."}, {"type": "paragraph", "text": "After Brook broke Mother Carmel's portrait, Dosmarche worried about Big Mom's reaction. As the alliance's plan backed fire, he witnessed Bege using his Big Father form, and later witnessed Charlotte Brûlée blocking Caesar's escape."}, {"type": "paragraph", "text": "As the Whole Cake Chateau toppled as a result of the Tamatebako explosion, Dosmarche lost his balance and fell with it, but he was rescued swiftly by Streusen. Dosmarche joined the squad that pursued the escaping Vinsmoke Family. Dosmarche and his squad were defeated by the Vinsmokes and they were thrown into the sea afterwards."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b0/Ichiji_defeat_Dosmarche.png/revision/latest/scale-to-width-down/180?cb=20180930030145", "caption": "Dosmarche subdued by Ichiji."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Nusstorte's pursuit squad vs. Germa 66", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Dosmarche, Charlotte Nusstorte, and Laurin vs. Sanji", "elements": []}, {"text": "Dosmarche vs. Vinsmoke Ichiji (Germa Kingdom)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Additional scenes of the Big Mom Pirates' invasion of the Germa Kingdom are added in the anime. Dosmarche made his way to the throne room, where he clashed with Ichiji."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dosmarche's name may be a pun on tres leches cake, fitting with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}]}