{"sections": [{"title": "Eggplant Soldier", "level": 1, "content": [{"type": "paragraph", "text": "Eggplant Soldier is a soldier of the Big Mom Pirates, serving as a guard at the Whole Cake Chateau. He was Sanji's helper during his stay at the castle before his planned wedding to Charlotte Pudding."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Eggplant Soldier has an eggplant-shaped head, small beady eyes, a large mouth with thick lips, and a raindrop-shaped nose. He also has tan skin, eggplant stem-like black hair, and some chin stubble. He wears a purple armor over a yellow spandex, with brown boots and gloves, and a green sombrero. He also wears his spear strapped to his back with a pink belt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Eggplant%27s_Head.png/revision/latest/scale-to-width-down/130?cb=20190814080959", "caption": "Eggplant Soldier's full face with hair shown."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Eggplant Soldier is somewhat of a cheerful and kind person, as he expressed happiness at helping Sanji with his plans to impress Pudding. He is also very loyal to the Charlotte Family, as he followed their orders to keep tabs on Sanji. However, he is also very careless, to the point where he can fall asleep during guard duty, and even going back to sleep after he realized he had unknowingly fallen asleep. In the anime, he seems to enjoy eating eggplants."}, {"type": "paragraph", "text": "He often ends his sentences with Nasu (ナス, Nasu), which means \"eggplant\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He appears to hold little authority and standing in the Big Mom Pirates, as he was only assigned to being a helper and guard for Sanji before the latter's wedding to Charlotte Pudding."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is seen with a spear, though he has not been seen using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "While patrolling the hallways of Whole Cake Chateau, Eggplant Soldier and another guard came across Big Mom as she was laughing. They commented on Big Mom's happy mood and equated it to the upcoming wedding and tea party. Eggplant Soldier then imagined Pudding smiling and hoped that she would be happy for her wedding."}, {"type": "paragraph", "text": "After Sanji accepted his fate of marriage, he tried to impress Pudding with his chivalry and was assisted by Eggplant Soldier, whom he had asked where to find flowers. After pacing around the room for quite some time, Eggplant Soldier suggested that Sanji check the courtyard and offered to lead the way. However, Sanji said that it was fine and got up to go himself. As Sanji walked towards the door, Eggplant Soldier asked him why he needed flowers, but he never got an answer as Sanji was busy being infatuated by Pudding, much to his confusion."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "When Eggplant Soldier returned from getting groceries for Sanji, he reported to him that Monkey D. Luffy and Nami had already been captured and that Soul King and the male mink were currently running amok. However, as he was explaining that the guards were having trouble, Sanji abruptly cut him off and asked for the ingredients, instead. Hearing this, Eggplant Soldier offered to get Sanji a meal, but the latter explained that he was concerned for Pudding and wanted to cook for her, to which Eggplant Soldier agreed that Pudding was still feeling poorly. Later, when Sanji finally left for Pudding's room, Eggplant Soldier asked him what he was doing and wondered if he was going for a walk, seemingly oblivious to where Sanji's intended destination was."}, {"type": "paragraph", "text": "Hours later at night, while the Big Mom Pirates were having a meeting about the recent events, a Chess Soldier checked in on Sanji to confirm his status, but because Eggplant Soldier was sleeping in Sanji's bed, Sanji was mistakenly reported to be there. Eggplant Soldier then awoke in a panic and realized he had fallen asleep in Sanji's bed, but upon noticing that the latter had not returned, he decided to go back to sleep."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "The following morning, Eggplant Soldier was abruptly awaken by Mont-d'Or pounding on the door. Knowing that Mont-d'Or was looking for Sanji, he began to panic for he had lost track of him. Under the pressure of Mont-d'Or's pounding, Eggplant Soldier became more panicked and worried, especially since he realized that Big Mom would kill him for, not only having failed to keep an eye on Sanji, but for also having fallen asleep while on duty."}, {"type": "paragraph", "text": "However, immediately after, Sanji came back through the window and asked Eggplant Soldier to help him lie. Seeing as how he would be able to get out of potential trouble, he happily agreed. When Mont-d'Or finally opened the door, Eggplant Soldier was called to testify if Sanji had been in the room all night. In response, he affirmed that Sanji had been there the whole time. However, as Mont-d'Or continued to ask the same question, Eggplant Soldier began to sweat and panic, but he was saved by Sanji when the latter interrupted the interrogation. When Mont-d'Or left, Eggplant Soldier finally let out a deep sigh and told Sanji how he had surprised him. He then asked Sanji where he had been, and Sanji told him that he went to Pudding's room as he told him earlier and advised him not to ask what happened afterward as it wouldn't be cool."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Mont-d%27Or_Interrogates_Sanji_and_Eggplant_Soldier.png/revision/latest/scale-to-width-down/180?cb=20190816081554", "caption": "Eggplant Soldier and Sanji are interrogated by Mont-d'Or and Galette."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Eggplant Soldier's role is expanded. He first appears patrolling the hallways, rather than in the manga in which he was first seen helping Sanji. Later, his role is further expanded when he and Sanji lie about the latter's whereabouts during the night before to Mont-d'Or."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name was never stated, but Charlotte Mont-d'Or called him Eggplant Soldier during an anime-only scene. He was also named as such in the credits.", "elements": []}, {"text": "In the anime, Eggplant Soldier gains \"normal-looking\" eyes after Sanji broke into his room through the window.", "elements": []}, {"text": "Zeff used to call Sanji \"Little Eggplant\" (チビナス, Chibi Nasu). Coincidentally, the Eggplant Soldier is mistaken for Sanji when he accidentally falls asleep in his bed.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Eggplant%27s_Shocked.png/revision/latest/scale-to-width-down/120?cb=20180325153737", "caption": "Eggplant Soldier's eyes when in surprise."}]}]}