{"sections": [{"title": "Charlotte Tablet", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Tablet is the 21st son and 34th child of the Charlotte Family and the younger twin brother of High-Fat. He also is an officer of the Big Mom Pirates and serves as Totto Land's Minister of Toppings (トッピング大臣, Toppingu Daijin), governing over Topping Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tablet is a short man with long wavy blond hair. He wears a light beige military suit (or DCU), with dark gloves and belt, blue cape, and a pink and red armband on his left arm. He has two golden hoop earrings, one on each earlobe. He is frequently seen riding a large pink bighorn sheep, even in non-combat situations."}, {"type": "paragraph", "text": "In the manga, his pants are also dark colored and his gloves are white."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Tablet's personality. Having taken part in Big Mom's plan to assassinate the Vinsmoke Family and helped his crew chase after the Straw Hat Pirates, he can be considered very loyal to his family and crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Toppings, Tablet has authority over Topping Island, and as an officer of the Big Mom Pirates, he has authority over lower-ranking members of his crew."}, {"type": "paragraph", "text": "Not much is known about Tablet's abilities other than the fact the he is able to ride his sheep and maintain balance as it ran horizontally during the chase in the Seducing Woods."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Tablet was seen wielding a long Nodachi, several times bigger than himself. He was shown to be quite proficient with it when he attacked Carrot."}, {"type": "paragraph", "text": "For use in assassinating the Vinsmoke Family, he and other members of the Big Mom Pirates were given Walkers."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Tablet attended the tea party and wedding between Sanji and Charlotte Pudding, where he took part in Big Mom's plan to assassinate the Vinsmoke Family. As the plan began to fall apart due to Pudding's emotional breakdown, Tablet was shocked to see Monkey D. Luffy burst out of the wedding cake, and witnessed Charlotte Katakuri attacking him. Tablet then fought Jinbe, who had recently left the Big Mom Pirates."}, {"type": "paragraph", "text": "Tablet then joined the siege on Capone Bege and saw Big Mom attacking the traitor. After the Vinsmokes exited Bege's fortress to provide the alliance with cover, Tablet shot at them and attacked Vinsmoke Reiju as she fell down."}, {"type": "paragraph", "text": "As the alliance tried to escape, Tablet was blown away from Luffy and Big Mom's clash. When the Whole Cake Chateau toppled as a result of the Tamatebako explosion, the Big Mom Pirates were saved by Streusen turning part of the Chateau into cake."}, {"type": "paragraph", "text": "Later, Tablet joined the pursing squad that went after the Straw Hat Pirates, and was shocked to see Big Mom going after them personally. As the Straw Hats ran into the Seducing Woods, he road ahead on his sheep and attacked Carrot before she was pulled out of the fight by Luffy to save her. Afterwards, Tablet and his squad were defeated when Nami used Zeus to bring a thunderbolt down on them."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Big Mom tried to infiltrate Wano Country, Tablet and his sheep accompanied her and the crew as they attempted to climb the waterfall into the country. He stood in surprise at how the carp were able to climb the waterfall. However, just before they reached the top of the waterfall, King attacked the ship, causing the ship to fall off the waterfall and Big Mom to fall into the sea. Later, Tablet watched on as his siblings discussed what their next move should be with Big Mom missing."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tablet, Charlotte High-Fat, and Charlotte Poire vs. Jinbe", "elements": []}, {"text": "Tablet vs. Carrot", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Tablet, Charlotte Joscarpone, and Charlotte Mascarpone vs. Vinsmoke Judge (Whole Cake Chateau)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Tablet and his comrades were defeated by Nami using Zeus' thunderbolt during the chase in the Seducing Woods. In the anime, Carrot defeated him in battle instead."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tablet is a sugary confection from Scotland, fitting with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}]}