{"sections": [{"title": "Charlotte Noisette", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Noisette is the 15th son and 24th child of the Charlotte Family and an officer of the Big Mom Pirates. He also serves as Totto Land's Minister of Finance (大蔵大臣, Ōkura Daijin), governing over Kinko Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Noisette is a tall man with a fair skin and a vertical line over each eye. He has brown hair arranged in a pompadour hairstyle, and thick sideburns and a beard. He wears a black tunic, with green feathers over his chest, and a blue cape with a yellow feathered collar."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/02/Charlotte_Noisette_Anime_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20181001172305", "caption": "Noisette concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Noisette's personality, however, since he took part in Big Mom's plan to assassinate the Vinsmoke Family, he can be considered to be very loyal to his family and crew. He was very surprised by Jinbe's immunity to Soul Pocus."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As Minister of Finance, Noisette has authority over Kinko Island in Totto Land, and as an officer of the Big Mom Pirates, he has authority over lower-ranking members of his crew. His combat powers and abilities are unknown, but he is presumably strong as he is an officer of a Yonko-led crew."}, {"type": "paragraph", "text": "Noisette possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "For use in assassinating the Vinsmoke Family, he and other members of the Big Mom Pirates were given Walkers."}, {"type": "paragraph", "text": "In the anime, he is shown wielding a lance with two scythe blades attached together forming a number '3'."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Noisette attended the tea party and wedding between Sanji and Charlotte Pudding, where he took part in Big Mom's plan to assassinate the Vinsmoke Family. As the plan began to fell apart due to Pudding's emotional breakdown, he was shocked to see Monkey D. Luffy burst out of the wedding cake and witnessed Jinbe leaving the Big Mom Pirates, and was shocked by the fish-man's courage as Big Mom failed to take his lifespan using Soul Pocus."}, {"type": "paragraph", "text": "When Charlotte Perospero trapped the Vinsmoke Family with candy, Noisette and other members of the Big Mom Pirates held them at gunpoint. However, Big Mom's scream incapacitated them, allowing the Straw Hats to free the Vinsmokes."}, {"type": "paragraph", "text": "After the Big Mom Pirates stood up, he again tried to fire at the Vinsmokes. However, by that time, his targets were able to put on their raid suits, which protecting them from the bullets. As the Whole Cake Chateau toppled as a result of the Tamatebako explosion, Noisette lost his balance and fell with it, but was saved when Streusen turned the collapsing castle into soft cake."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3c/The_Charlotte_Family_Surrounds_the_Vinsmokes.png/revision/latest/scale-to-width-down/230?cb=20180422153158", "caption": "Noisette and his crew surround the Vinsmokes."}]}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Noisette and High-Fat vs. Vinsmoke Niji", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Noisette may be a reference to various things that fit the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": [{"text": "A small round piece of lean meat, especially lamb.", "elements": []}, {"text": "Black coffee, served topped with milk froth, in a short cup.", "elements": []}, {"text": "The French word for hazelnut.", "elements": [{"text": "Chocolate made with hazelnuts.", "elements": []}]}, {"text": "Contexts involving the browning of butter:", "elements": [{"text": "Beurre noisette (\"hazelnut butter\" in French), browned butter used in cooking.", "elements": []}, {"text": "Sauce noisette, a type of Hollandaise sauce made with browned butter.", "elements": []}]}]}]}], "images": []}]}