{"sections": [{"title": "Komane", "level": 1, "content": [{"type": "paragraph", "text": "Komane is the princess of the Lulusia Kingdom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Komane is a fit woman of average height, with dark hair in pigtails. She wears a dark colored strapped short dress, light skirt, and dark high heel shoes. She also has a dark coat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "After she was abducted by pirates, she was shown crying for her father to be contacted so he would pay for her release, showing some sort of trust in him as much of a scared sense of self-preservation. She also appears to be vindictive as after she was saved by Koby and Helmeppo, she attacked the pirates angrily while threatening to have them tortured."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the princess, Komane has great authority over her home country."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Komane was aboard the ship heading to the Levely with her father. At a certain point during their journey, the ship was attacked by pirates and Komane was abducted for ransom. When the pirates tried to attack the ships from the Prodence Kingdom and Dressrosa and kidnap Viola as well, they were stopped by Koby and Helmeppo. Komane was rescued and she then threatened her kidnappers."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 903 (p. 9) and Episode 879, Komane makes her debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 903 (p. 8) and Episode 879, Komane's status is mentioned.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 903 (p. 10-13) and Episode 879, Koby and Helmeppo save Komane.", "elements": []}]}], "images": []}]}