{"sections": [{"title": "Charlotte Laurin", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Laurin is the 18th son and 29th child of the Charlotte Family and the younger twin brother of Compo. He is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Laurin is a thin man with olive skin. He has several scars across his arms and forearms. He covers most of his face with a black top hat bearing a pink skull, with the skull's eye sockets holed out for his sight. He wears metal lederhosen with an orange pearl at the waist, held up by dark blue suspenders, short torn black pants, torn black boots, and an orange ascot. He also wears a single dark grey glove on his right hand."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Laurin's personality, however, since he took part in Big Mom's plan to assassinate the Vinsmoke Family and helped his crew chase after the Straw Hat Pirates, he can be considered very loyal to his family and crew. He was very surprised by Bege's betrayal."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Laurin has authority over lower-ranking members of his crew. His combat powers and abilities are unknown, but he is presumably strong as he is an officer of a Yonko-led crew."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Laurin is shown wielding a Dane axe."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Laurin attended the tea party and wedding between Sanji and Charlotte Pudding, where he took part in Big Mom's plan to assassinate the Vinsmoke Family. After Brook broke Mother Carmel's portrait, Laurin worried about Big Mom's reaction."}, {"type": "paragraph", "text": "When Capone Bege revealed his true intentions, Laurin was shocked and confused. He later joined his crew's siege on the alliance."}, {"type": "paragraph", "text": "As the alliance tried to escape, Laurin was blown away from Monkey D. Luffy and Big Mom's clash. As the Whole Cake Chateau toppled as a result of the Tamatebako explosion, Laurin lost his balance and fell with it, but he was rescued swiftly by Streusen."}, {"type": "paragraph", "text": "Laurin was recruited by Charlotte Daifuku to the pursuit unit that was assigned to go after the Straw Hat Pirates. During the pursuit, he was shocked to see Big Mom going after their enemies personally. After the Straw Hats ran into the Seducing Woods, Laurin and his squad were defeated when Nami used Zeus to bring a thunderbolt down on them."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Charlotte Laurin, Charlotte Mobile, and Charlotte Compo vs. Monkey D. Luffy (Whole Cake Chateau)", "elements": []}, {"text": "Laurin, Charlotte Dosmarche, and Charlotte Nusstorte vs. Vinsmoke Sanji", "elements": []}, {"text": "Laurin, Charlotte Mobile, and Charlotte Mash vs. Vinsmoke Yonji", "elements": []}, {"text": "Laurin and Compo vs. Monkey D. Luffy (Seducing Woods)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Laurin and his comrades were defeated by Nami using Zeus' thunderbolt during the chase in the Seducing Woods. In the anime, Luffy defeated him in battle instead."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name may be a reference to lauric acid (known as ラウリン酸 raurinsan in Japanese), which is a major component of coconut milk and coconut oil. \"Laurin\" is also the name of a specific brand of coconut oil. This fits with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}]}