{"sections": [{"title": "Belo Betty", "level": 1, "content": [{"type": "paragraph", "text": "Belo Betty is the commander of the East Army in the Revolutionary Army."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Betty is a tall, slim woman with short, purple hair in a bob cut. Her pale green eyes are usually covered by a pair of black-framed sunglasses with red lenses. She also wears red lipstick and usually smoking a cigarette."}, {"type": "paragraph", "text": "She wears a red top hat with red goggles, a pair of red curled horns on the front, and a long and puffy white plume on the back. She wears a red tie and her torso is barely covered, as she leaves her cropped red jacket with pink outlines open. She has red and white striped stockings under her red thigh-high boots. Her frilly red skirt is short on the front and long at the back. She also carries around a large flag with the Revolutionary Army's symbol on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Betty treats the people she helps very rudely, insulting them and only referring to them with degrading terms. Despite this attitude, her intention is still to recruit them into the Revolutionary Army by encouraging them to make their own choices. She believes that committing heroic actions is a decision one makes for themselves. When the people of Lulusia Kingdom took up arms and fought, she broke her normal attitude briefly to commend them on their actions​​​​​​. ​Despite her rude and disrespectful attitude, she does share with her fellow executives the same feelings of mercy and a desire to help those who are in trouble. Also, she does show respect and appreciation to those who stand to fight their own enemies and troubles, as she warmly smiled and proudly praised the people of Lulusia Kingdom for standing up and fighting the Pinkbeard Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Revolutionary Army executive, Betty is in a powerful position within the organization. As commander of the East Army, she has control over all the soldiers in it."}, {"type": "paragraph", "text": "Betty is an extremely charismatic orator. With her Devil Fruit powers, she inspires numerous people to fight. Morley called Betty the flag bearer of freedom for her skills."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Betty has eaten the Kobu Kobu no Mi, a Paramecia-type Devil Fruit that allows her to encourage and rally people into fighting, increasing their resolve and physical strength. In the Lulusia Kingdom, she enabled a group of helpless citizens to grow stronger and successfully beat back the Pinkbeard Pirates with only sticks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/Kobu_Kobu_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20190414130522", "caption": "Betty uses her power to encourage the citizens of the Lulusia Kingdom."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Betty and her fellow executives Morley, Lindbergh, and Karasu went to the Lulusia Kingdom to save the citizens from the pillaging Pinkbeard Pirates. Betty went to the citizens, giving them the choice to fight. The citizens that decided to fight had their latent powers awakened by Betty's Devil Fruit, and Betty told Lindbergh and Karasu to back up the citizens as they charged into battle. After the pirates were defeated, the executives left them for the citizens to turn in for the captain's bounty, and Betty gave the citizens the revolutionaries' contact information, encouraging them to rise up with the army. The executives then headed for Momoiro Island to meet with the rest of the army and prepare for their declaration of war on the World Nobles."}, {"type": "paragraph", "text": "After the meeting at Momoiro Island, Betty had a conversation with Koala, commenting on the latter's desire to fight the World Government for the sake of the fish-men race."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Levely, the revolutionaries read some distressing news concerning Sabo."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Revolutionary Army executives and Lulusia Kingdom citizens vs. Pinkbeard Pirates", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name might be a reference to the real life revolutionary Betty Zane.", "elements": []}, {"text": "Her appearance is reminiscent of Marianne as depicted in Eugène Delacroix's \"Liberty Leading the People\", as they are both women holding a flag that symbolizes a revolution.", "elements": []}, {"text": "Betty's name and flag may be a reference to Betsy Ross, a designer of the American flag used during the period of the American Revolutionary War.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 10-11) and Episode 880, Belo Betty makes her debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 12) and Episode 880, Betty's full appearance is shown.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 8-11, 15) and Episode 880, Betty talks to the citizens of Lulusia.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 12-13) and Episode 880, Betty uses her ability.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 5-15) and Episode 880, The Revolutionary Army executives help the citizens of Lulusia.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 and Episode 883.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956 (p. 9).", "elements": []}]}], "images": []}]}