{"sections": [{"title": "Pinkbeard", "level": 1, "content": [{"type": "paragraph", "text": "Pinkbeard is the epithet of the captain of the Pinkbeard Pirates, who are subordinates of the Yonko Blackbeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pinkbeard appears to be a slim man of roughly average height. His face is somewhat narrow, and his jaw is very long, ending in a pronounced chin. He has long flowing hair that reaches down to his chest in waves. As his given name implies, Pinkbeard also sports a long handlebar pink mustache which curls upwards at the ends and a long goatee with a slight downward curl. He has some wrinkles around his eyes and mouth and a stitched scar running from his left eye to his left cheekbone."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pinkbeard is a very sadistic and violent man who has no problem with attacking and pillaging innocent villages, and while attacking the Lulusia Kingdom, he told his crew to kill any citizen who resisted. He sometimes feigns an understanding attitude, as he recognized that it was the fault of the Lulusia Kingdom royalty and the Marines that Lulusia Kingdom was left unprotected, but his only real care is for treasure, as he hit a woman after finding out what treasure the Lulusia Kingdom held."}, {"type": "paragraph", "text": "Pinkbeard is also very expressive and quick to shock and anger, as he vocally expressed his bewilderment at the presence of four Revolutionary Army commanders on Lulusia Kingdom as well as their personalities and abilities. He is also prone to mockery, as he laughed profusely when the townspeople picked up sticks to fight his crew."}, {"type": "paragraph", "text": "Like many other people, he has a distinct laugh: \"Momohahaha\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Pinkbeard's crew holds little allegiance to Pinkbeard, as they abandoned him when they fled Lulusia Kingdom."}], "images": []}, {"title": "Blackbeard Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Pinkbeard was allegiant to the Blackbeard Pirates, as he touted their name to instill fear in the people he attacks. However, the Blackbeard Pirates do not appear to care about their subordinate crews, as one of the Revolutionary Army executives said that Pinkbeard will not likely be rescued."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As captain of the Pinkbeard Pirates, Pinkbeard holds full control over the crew. However, he lacks their loyalty, as they swiftly abandoned him upon his defeat and capture."}, {"type": "paragraph", "text": "He is not very strong, as although he was able to force Moda a fair distance back by slapping her, she quickly retaliated and knocked him out by hitting his head with a stick after being strengthened by the Kobu Kobu no Mi."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Pinkbeard wields a cutlass, and has a pistol stashed in his belt, although he has not been seen using either of them."}, {"type": "paragraph", "text": "In the anime, he shows enough skill with his sword to defeat a few Marine soldiers with a single strike."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past year, after Blackbeard became a Yonko, Pinkbeard and his crew started sailing under his flag and Pinkbeard was bestowed his name."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Lulusia Kingdom's strongest forces left with their royalty to the Levely, the Pinkbeard Pirates attacked the port town for treasure. After Moda revealed that there was Celestial's gold in the town, he told the crew to search the town for it. However, Pinkbeard was shocked as the Revolutionary Army executive Morley came in through the ground, and ordered his crew to shoot the giant. Morley then formed a clump out of the ground and pushed it into Pinkbeard and his men, and Pinkbeard said he must be a Devil Fruit user. He then saw the three other Revolutionary executives Lindbergh, Karasu, and Belo Betty, and wondered in shock why all of them were on the island together."}, {"type": "paragraph", "text": "Betty encouraged the townspeople to pick up sticks, and Pinkbeard laughed at the prospect of them fighting him. However, the townspeople overwhelmed his crew with the revolutionaries' help, and with her strength increased through Betty's Kobu Kobu no Mi, Moda subdued Pinkbeard with one blow. Pinkbeard was then tied up and the revolutionaries left him for the townspeople to turn in for his bounty. Pinkbeard threatened retribution from Blackbeard, but Betty replied that Blackbeard does not care about his subordinate crews."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/Moda_Batters_Pinkbeard.png/revision/latest/scale-to-width-down/210?cb=20190414113545", "caption": "Pinkbeard is defeated by Moda."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Pinkbeard Pirates vs. Revolutionary Army executives and Lulusia Kingdom citizens", "elements": [{"text": "Pinkbeard vs. Moda", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Pinkbeard vs. Marines", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His signature laugh Momohahaha comes from his name, which is pronounced Momohige. Momo can be translated as both pink and peach.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 4) and Episode 880, Pinkbeard makes his debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Anime — Episode 880.", "elements": []}]}], "images": []}]}