{"sections": [{"title": "Karasu", "level": 1, "content": [{"type": "paragraph", "text": "Karasu is the commander of the North Army in the Revolutionary Army."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Karasu is a tall, muscular, and bald man who wears half of a plague doctor mask on his face that acts as a loudspeaker. He wears an open dark feather coat similar to those worn by the Beast Pirates that leaves his chest exposed, dark pants, and a sash around his neck. His overall attire gives him a crow-like theme and appearance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Karasu_Portrait.png/revision/latest/scale-to-width-down/180?cb=20190516214609", "caption": "A close-up of Karasu's face."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Karasu is an honorable man who despises those who attack the weak. He's also very quiet and usually talks through inaudible mumbling, thus he needs his loudspeaker mask to be heard by others. He does not appear to take kindly to people who react negatively to his mumbling, as veins bulged on his forehead in anger when Pinkbeard pointed it out. However, he also tends to be forgetful at times as he forgot to turn on his speaker, resulting in his mumbling."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an executive of the Revolutionary Army, Karasu holds a powerful position within the organization. As the commander of the North Army, he has full control over all the soldiers in it."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Karasu has seemingly eaten a Devil Fruit of an unknown type that allows him to turn his body and clothes into a murder of crows. In this form, he is capable of performing actions over a wide area, as shown when he stole all of the Pinkbeard Pirates' swords at once. Each crow is capable of carrying an average-sized person on its back, and they are also used to deliver newspapers. Karasu is also capable of talking as a crow."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/49/Karasu%27s_Devil_Fruit_Power.png/revision/latest/scale-to-width-down/210?cb=20190414040641", "caption": "Karasu transforming into a number of crows."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Post-War Arc", "level": 3, "content": [{"type": "paragraph", "text": "One of Karasu's crows delivered the newspaper to Bunny Joe's group as they escorted Nico Robin to Baltigo."}], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Sabo, Koala, and Hack had completed their mission on Dressrosa, Karasu and some others came to take them back to Baltigo. Karasu flew to Sabo as a murder of crows and brought him to their ship, where they set sail."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ad/Sabo_leaves_Dressrosa.png/revision/latest/scale-to-width-down/210?cb=20160424083404", "caption": "Karasu takes Sabo to the Revolutionaries' ship leaving Dressrosa."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Karasu and his fellow executives Lindbergh, Belo Betty, and Morley went to Lulusia Kingdom to protect it from the pillaging Pinkbeard Pirates. When Pinkbeard wondered what Karasu was saying, the executive got mad, and Betty told him and Lindbergh to back up the citizens that she had encouraged into taking action. Karasu transformed into crows and stole the pirates' swords, and the pirates were quickly defeated. The executives then headed to Momoiro Island to meet with the rest of the army about their upcoming declaration of war on the World Nobles, and Karasu noted that he had forgotten to turn on his loudspeaker."}, {"type": "paragraph", "text": "After the meeting at Momoiro Island, Karasu accompanied Sabo, Lindbergh, and Morley to Red Port. There, they secretly advanced toward Mary Geoise along with several royals heading to the Levely. While hiding underground, the executives discussed about saving Kuma from his enslavement to the World Nobles."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "On the fourth day of the Levely, Karasu and his fellow executives battled Fujitora and Ryokugyu to rescue Kuma."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Revolutionary Army executives and Lulusia Kingdom citizens vs. Pinkbeard Pirates", "elements": []}, {"text": "Karasu, Sabo, Morley, and Lindbergh vs. Issho and Ryokugyu (unseen)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Karasu\" means \"crow\" in Japanese.", "elements": []}, {"text": "His name was first revealed in the credits of Episode 738.", "elements": []}, {"text": "His unnamed Devil Fruit is somewhat similar to Tamago's Tama Tama no Mi in that both possess traits from all three Devil Fruit categories, making it difficult to classify.", "elements": [{"text": "Both fruits have bird-related powers.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 593 (p. 5) and Episode 510, A crow delivers the news to a revolutionary.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 9-11) and Episode 880, Karasu first appears in his human form.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 15) and Episode 880, Karasu is reminded to activate his speaker.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 79 Chapter 794 (p. 15) and Episode 738, Karasu appears as a murder of crows.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 14) and Episode 880, Karasu transforms his body into a murder of crows.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 12) and Episode 880, Betty send Karasu and Lindbergh ahead.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 (p. 17) and Episode 883, The Revolutionary Army infiltrates the Levely.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 (p. 8-9) and Episode 888.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 925.", "elements": []}]}], "images": []}]}