{"sections": [{"title": "Morley", "level": 1, "content": [{"type": "paragraph", "text": "Morley is a giant and an okama, as well as the commander of the West Army in the Revolutionary Army."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Morley is a very hairy and portly giant. He has a Fu Manchu mustache and a shaggy chinstrap beard."}, {"type": "paragraph", "text": "He wears very little clothing, only wearing a short plaid skirt in addition to belts around his arms, a flower symbol on his left forearm, dark gloves, a dark bowler hat with frilly goggles on it, and a weapons pack. Belo Betty describes him as looking like a \"potato giant\"."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As an okama, Morley speaks in a very polite and feminine manner. He usually has a very jovial attitude and dislikes those who are unnecessarily violent. When he sees people paying attention to him, he constantly wonders if it is because they have a crush on him, not knowing why they would do so otherwise. However, he does not seem too fond of others being attracted to him, having been grossed out when Betty jokingly implied that the men of the Pinkbeard Pirates had a crush on him."}, {"type": "paragraph", "text": "Like many other people, he has his own unique laugh: \"Fuhahaha\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an executive of the Revolutionary Army, Morley holds a powerful position in the organization, and as the commander of the West Army, he has full control over the soldiers in it.Donquixote Doflamingo even pictured him as one of the key figures in the Revolutionary Army."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a giant, Morley possesses tremendous physical strength and a longer lifespan when compared to humans. Because of his size, he is able to move very large sections of the ground with his Devil Fruit power."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Morley wields a large harpoon-trident hybrid, which he uses in conjunction with his Devil Fruit power to move the ground."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Morley ate the Oshi Oshi no Mi, a Paramecia-type Devil Fruit that allows him to push away any substance. Using this power, he can easily move underground, as well as attack enemies by pushing clumps of ground onto them, as it seems to otherwise maintain its original weight and hardness."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Oshi_Oshi_no_Mi_Infobox.png/revision/latest/scale-to-width-down/210?cb=20190414040729", "caption": "Morley moves the ground."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Over 100 years before the start of the story, Morley was a wanted pirate who was imprisoned at Impel Down. Using his devil fruit, he managed to escape the prison, a fact that remained unknown for a long time allowing the prison to keep its status as being unbreakable until Shiki's escape many years later. The tunnels Morley carved with his Devil Fruit abilities would later be known as the Level 5.5, which housed the Newkama Land. At some point after this, he joined the Revolutionary Army."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Morley and his fellow executives Belo Betty, Lindbergh, and Karasu came to the Lulusia Kingdom to save it from the pillaging Pinkbeard Pirates. Morley emerged from the ground and confronted the pirates, pushing the ground toward them and forcing them back. With the help of the citizens who were empowered by Belo Betty's Devil Fruit power, the pirates were easily defeated, and the executives headed to Momoiro Island to discuss the Revolutionary Army's upcoming declaration of war against the World Nobles."}, {"type": "paragraph", "text": "After the meeting at Momoiro Island, Morley accompanied Sabo, Lindbergh, and Karasu to the Red Port. There, they secretly advanced toward Mary Geoise along with several royals heading to the Levely. While hiding underground, the executives discussed saving Kuma from his enslavement to the World Nobles."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "On the fourth day of the Levely, Morley and his fellow executives battled Fujitora and Ryokugyu to rescue Kuma."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Revolutionary Army executives and Lulusia Kingdom citizens vs. Pinkbeard Pirates", "elements": []}, {"text": "Morley, Sabo, Lindbergh, and Karasu vs. Issho and Ryokugyu (unseen)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Morley's silhouette was first shown during Doflamingo's speech after Dressrosa.", "elements": []}, {"text": "Morley's Japanese name Mōrī is similar to Mori, which means \"Harpoon\".", "elements": []}, {"text": "He is the second known canon giant who has eaten a Devil Fruit, after Sanjuan Wolf.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Morley_Silhouette.png/revision/latest?cb=20180511171001", "caption": "Morley's silhoutte before his debut."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 6-15) and Episode 880, Morley debuts.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904 (p. 10), Morley's position is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 91 (p. 176), Morley's Devil Fruit and past are explained.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 80 Chapter 801 (p. 8) and Episode 746, Doflamingo foresees the upcoming war.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904 (p. 6-8), Morley manipulates the ground.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904 (p. 13-15), The revolutionaries leave Lulusia after the Pinkbeard Pirates's defeat.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 905 (p. 17), The Revolutionary Army infiltrates the Levely.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 908 (p. 8-9).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 925 (p. 9-11).", "elements": []}]}], "images": []}]}