{"sections": [{"title": "Lindbergh", "level": 1, "content": [{"type": "paragraph", "text": "Lindbergh, or \"Lind\" for short, is a cat mink and the commander of the South Army in the Revolutionary Army."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lindbergh is a short cat mink, standing about half as tall as Belo Betty. He has somewhat dark-blue cyan colored hair, wears a light buttoned shirt, light pants, dark boots, and a dark buttoned coat. He also wears goggles over his eyes that have light-blue lenses, a top hat with another set of goggles that have orange lenses and a curved rim, jetpack on his back."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Lindbergh seems to greatly enjoy combat, as he was excited to hear about the Revolutionary Army's upcoming fight against the World Nobles. He likes to test his new weapons out in battle and was annoyed when Morley started attacking first."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an executive of the Revolutionary Army, Lindbergh holds a very powerful position in the organization, and as the commander of the South Army, he has control over all its soldiers."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a member of the Mink Tribe, Lindbergh is a natural-born warrior and is capable of using Electro. He is also able to transform into his Sulong form when he sees the full moon, though it is unknown if he can control it."}], "images": []}, {"title": "Inventions", "level": 3, "content": [{"type": "paragraph", "text": "Lindbergh is a highly skilled and talented inventor, having created weapons and gadgets of advanced technology that he uses for combat."}, {"type": "paragraph", "text": "Lindbergh has a jetpack that enables him to fly."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Lindbergh has expert marksmanship with his Cool Shooter, able to aim precisely only at the weapons of the Pinkbeard Pirates, leaving them unharmed for the Lulusia citizens to defeat themselves."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Lindbergh debuted a weapon called \"Cool Shooter\" (クールシューター, Kūru Shūtā) while fighting the Pinkbeard Pirates in the Lulusia Kingdom. The Cool Shooter can fire rapid bullets that freeze small sections of its targets' bodies."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f9/Lindbergh%27s_Cool_Shooter.png/revision/latest/scale-to-width-down/210?cb=20190414113534", "caption": "Lindbergh's Cool Shooter."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Lindbergh and his fellow executives Morley, Belo Betty, and Karasu went to the Lulusia Kingdom to save it from the pillaging Pinkbeard Pirates. Lindbergh contacted Sabo through a Den Den Mushi, informing him that he and his fellow executives would be arriving late for Dragon's meeting. He got annoyed at Morley for attacking first, and when Betty mobilized the citizens against the pirates, Lindbergh and Karasu went to back them up. Lindbergh shot his Cool Shooter at the pirates, freezing their hands to their guns. The pirates were swiftly defeated, and the executives headed toward Momoiro Island to meet with the revolutionaries about their upcoming declaration of war on the World Nobles. Lindbergh told Karasu to turn on the loudspeaker as they left, but Karasu had forgotten."}, {"type": "paragraph", "text": "After the meeting at Momoiro Island, Lindbergh infiltrated Mary Geoise alongside Sabo, Morley, and Karasu. While hiding underground, the executives discussed about Kuma's fate as Sabo planned to rescue him."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "On the fourth day of the Levely, Lindbergh and his fellow executives battled Fujitora and Ryokugyu to rescue Kuma."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Revolutionary Army executives and Lulusia Kingdom citizens vs. Pinkbeard Pirates", "elements": []}, {"text": "Lindbergh, Sabo, Morley, and Karasu vs. Issho and Ryokugyu (unseen)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name possibly comes from Charles Lindbergh, who was an aviator, military officer, and inventor much like Lindbergh.", "elements": []}, {"text": "Lindbergh is currently the only known named mink in the Revolutionary Army.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 904 (p. 9-11) and Episode 880, Lindbergh debuts.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904 (p. 12), Betty send Karasu and Lindbergh ahead.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 81 Chapter 808 (p. 9) and Episode 757, Monjii explains the minks physiology.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 88 Chapter 889 (p. 4), Jinbe explains the minks' Sulong form.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904 (p. 13), Lindbergh names and uses his weapon.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904 (p. 3), Lindbergh calls Sabo.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904 (p. 14-15), The revolutionaries leave after the Pinkbeard Pirates are defeated.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 908.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 925.", "elements": []}]}], "images": []}]}