{"sections": [{"title": "Beer VI", "level": 1, "content": [{"type": "paragraph", "text": "Beer VI is the king of the Roshwan Kingdom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Beer VI is a middle-aged man with small ears, prominent cheekbones, thick lips and thick jawline. He has a thin black mustache and a goatee that end in three points."}, {"type": "paragraph", "text": "He wears a dark red robe with brown fur trim on the cuffs and bottom, a jaguar-printed sash, and a blue cloak with a brown border and light blue fur trim. He also wears a black ushanka with white fur that has curved horns instead of ear flaps."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nothing is known about Beer's personality."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As king of the Roshwan Kingdom, Beer VI has control over its citizens and is able to attend the Levely."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Beer VI and his daughters arrived at the Red Port to attend the Levely at Mary Geoise. After reaching the top of the Red Line via a bondola, they made their way to the Mary Geoise castle."}, {"type": "paragraph", "text": "The kings and queens later gathered inside the conference room to begin the Levely."}, {"type": "paragraph", "text": "He commented on Luffy's infamy and called him daring before the Levely meeting started."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Levely ended, Beer VI departed Mary Geoise."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "As part of the Roshwan Kingdom's apparent Russian theme, Beer VI looks like a Russian man with Russian-style garb.", "elements": []}, {"text": "The king's name may be a reference to alcoholic drinks being particularly popular in Russia with beer being second only to vodka in popularity.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 82 Chapter 823 and Episode 777, Beer VI make his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 (p. 6) and Episode 882, Beer VI is introduced.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 906 and Episode 884.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 and Episode 889.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 and Episode 889, page 12", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956 (p. 5).", "elements": []}]}], "images": []}]}