{"sections": [{"title": "Tacos", "level": 1, "content": [{"type": "paragraph", "text": "Tacos is the king of the Shishano Kingdom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tacos is an older man with dark grey eyes, prominent cheekbones, a big nose and a thick jaw. He has black hair that's tied in a low ponytail behind his neck and a thick mustache that points down at the sides."}, {"type": "paragraph", "text": "He wears a serape with a multicolored pattern as well as a sombrero with protrusions shaped like black chess pawns along the border and a small cactus in the center."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Upon his introduction, Tacos declared he would rather die standing than live while kneeling."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As king of the Shishano Kingdom, Tacos has control over its citizens and is able to attend the Levely."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Tacos arrived at the Red Port to attend the Levely at Mary Geoise, declaring he would rather die standing than live while kneeling. After reaching the top of the Red Line via a bondola, Tacos made his way to the Mary Geoise castle."}, {"type": "paragraph", "text": "The kings and queens later gathered inside the conference room to begin the Levely."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tacos' name and appearance are heavily based on Mexican culture:", "elements": [{"text": "Tacos are a Mexican dish that are very popular in the rest of the world.", "elements": []}, {"text": "Tacos wears traditional Mexican garb and hat. This attire is reminiscent of Jean Ango's who also had a cactus on his head (although his cactus was actually a part of his head.)", "elements": []}, {"text": "The name of his kingdom is a reference to the Kingdom of the Dead, Day of the Dead, or Dia de los muertos holiday.", "elements": []}, {"text": "Tacos' persona seems to be inspired from Mexican Revolutionary Emiliano Zapata. The famous quote Taco used in his introduction values pride in the face of foreign and counterrevolutionary interference in Mexican affairs.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 and Episode 882, Tacos makes his debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 906 and Episode 884.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 and Episode 889.", "elements": []}]}], "images": []}]}