{"sections": [{"title": "Matryo Princesses", "level": 1, "content": [{"type": "paragraph", "text": "The Matryo Princesses are the princesses of the Roshwan Kingdom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The princesses heavily resemble matryoshka dolls, with each one being thickset and ranging in size. One spectator at Red Port called them \"cute.\""}, {"type": "paragraph", "text": "They have black eyes, blonde hair parts at the middle of their forehead, and pink blush marks on their cheeks. They all wear a red headscarf topped with a small gold tiara. They also wear white buttoned up shirts and red skirts with pink polka dots, dark blue and gold striped belts, and blue suspenders. They all carry straw baskets."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Nothing is known about the princesses' personalities."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As princesses of the Roshwan Kingdom, the Matryo Princesses have some level of authority over it and are able to attend the Levely."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Matryo Princesses and their father arrived at the Red Port to attend the Levely at Mary Geoise. After reaching the top of the Red Line via a bondola, they made their way to the Mary Geoise castle."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Matryo Princesses' resemblance to matryoshka dolls fits with the Russian theme of the Roshwan Kingdom, as matryoshka dolls originated in Russia.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 (p. 6) and Episode 882, The Matryo Princesses make their debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 906.", "elements": []}]}], "images": []}]}