{"sections": [{"title": "Mororon", "level": 1, "content": [{"type": "paragraph", "text": "Mororon is the queen of the Tajine Kingdom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mororon is a slender and regal-looking woman with teal eyes. Her pale blonde hair is gathered in an updo with sidelocks that curl at her cheeks and a thinner lock of hair on each side of her face that reach pass her shoulders."}, {"type": "paragraph", "text": "She wears a form-fitting blue kaftan dress with dotted pale blue borders as well as wears pink lipstick and nail polish. She also wears a gold tiara shaped like three rectangles, gold hoop earrings, a pink sash around her neck, a tiny red-beaded necklace, and two lilac bracelets on her left wrist. She held a filled red wine glass in each hand during her introduction."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mororon appears to be a jovial woman, as she made a toast to the people watching her. She appears to like drinking, as she was carrying a glass of wine while heading to the Levely."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As queen of the Tajine Kingdom, Mororon has control over its citizens and is able to attend Levely."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Mororon arrived at the Red Port to attend the Levely at Mary Geoise, and toasted her onlookers. After reaching the top of the Red Line via a bondola, Mororon made her way to the Mary Geoise castle."}, {"type": "paragraph", "text": "The kings and queens later gathered inside the conference room to begin the Levely."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mororon and the Tajine kingdom seem to be inspired by Morocco. Mororon contains the first two syllables of Morocco, and Tajine is a famous Moroccan and Maghrebi dish. The kaftan Mororon wears are traditional Moroccan and Maghrebi robes.", "elements": [{"text": "Morocco is famed globally for its red wine and the city Casablanca, the setting of the film of the same name. In her introduction, Mororon quotes a line from Casablanca while drinking red wine.", "elements": []}]}, {"text": "Mororon wears a traditional robe called the kaftan, which Moroccan women wear on special occasions, and her bodyguards wear the djellaba, traditional clothes of Moroccan men.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 (p. 6) and Episode 882, Mororon makes her debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 906.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 908.", "elements": []}]}], "images": []}]}