{"sections": [{"title": "Kurotsuru", "level": 1, "content": [{"type": "paragraph", "text": "Dr. Kurotsuru, also named \"Dr. Black Beard\" based on the same name on the lapel of his coat, is a doctor who appeared in Ace's cover story."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Like Marshall D. Teach, Dr. Kurotsuru is a round man with relatively thin limbs, has fluffy black hair with the top tucked in by a bandana. He also has a goatee. The doctor wears round glasses, a white a-shirt with a cross on the front, striped-patterned pants, white shoes, a doctor's coat with the name \"Dr. Black Beard\" on the left side, a medical cross on each side of the collar, and carries a pen in the right breast pocket of the coat. Because of their similar appearance, Ace accidentally mistook the doctor for the true Blackbeard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Kurotsuru_in_the_Digitally_Colored_Manga.png/revision/latest/scale-to-width-down/210?cb=20140903040253", "caption": "Kurotosuru as he appears in the Digitally Colored Manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kurotsuru dislikes Ace because the young pirate kicked him in the face. He was angry enough at the pirate to throw him into a river."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Ace mistook him for the real Blackbeard and kicked him to the ground, much to the fury of everyone else around them."}, {"type": "paragraph", "text": "When Ace realized his mistake, he was kicked into the river by the angry Dr. Kurotsuru, an angry cook (whom Ace did not pay for his meal from earlier), and other spectators who were furious at Ace's attack."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 213), Kurotsuru's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 30 Chapter 276, Black Beard's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 30 Chapter 276, cover page, Ace kicks Dr. Kurotsuru, mistaking him for Marshall D. Teach.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 30 Chapter 277, cover page, Dr. Kurotsuru and others kick Ace into a river.", "elements": []}]}], "images": []}]}