{"sections": [{"title": "Matsuge", "level": 1, "content": [{"type": "paragraph", "text": "Matsuge is a camel who accompanied the Straw Hat Pirates during the Alabasta Arc. He is classified as a Type-A creature, \"Big Friendly\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Matsuge is a light brown camel who wears a bridle and saddle. His saddle is square shaped, with a fur seat. Under the seat is a purple blanket, with a yellow stripe with an orange diamond pattern on it. There is also a silver seat with an orange cloth on it. Matsuge has noticeable eyelashes on the bottom of his eyes, which he is named after."}, {"type": "paragraph", "text": "After the timeskip, Matsuge appears to wear a sort of tufted metal helmet."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Matsuge seems to like women as he only allowed Nami and Vivi to ride him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "When found in the desert by the Straw Hats after they saved him from a Sandora Lizard, he would only let Nami and Vivi ride. Out of admiration, Nami named him \"Matsuge\" but he refused to let anyone else on, prompting the rest of the crew to beat him up and label him as a \"Pervy Camel\" (エロラクダ, Ero Rakuda), because he only let the two women ride). The crew only knew of that because of Chopper's translation."}, {"type": "paragraph", "text": "During the crew's escape from Rainbase, he introduced them to his friend, Hasami, who would help them escape across the desert. It was revealed by Chopper that Matsuge was born in Rainbase and so had a lot of friends in the area."}, {"type": "paragraph", "text": "He disguised himself as Vivi by riding a Super Spot-Billed Duck and wearing a white cape. He was paired up with Usopp and got chased by Mr. 2. He was as weak as Usopp since Mr. 2 only needed one second for each of them."}, {"type": "paragraph", "text": "After Crocodile's defeat, Matsuge was ordered to be given special treatment, as well as being allowed to join the Super Spot-Billed Duck Troops (even though he is a camel)."}], "images": []}, {"title": "Gedatsu's Accidental Blue-Sea Life", "level": 3, "content": [{"type": "paragraph", "text": "Matsuge and the Spot Billed Duck Troops were later seen enjoying the geothermal baths of Ukkari Hot Spring, owned and operated by Goro (Toto's brother and Koza's uncle)."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, he is seen walking around with Vivi and Karoo. He and Karoo are eating apples as everyone waves at them."}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, the Straw Hats first met Matsuge when they saved him from a Sandora Lizard. While he already had a saddle on his back, it is unknown who the original owner is or where he came from."}, {"type": "paragraph", "text": "In the anime, he was originally from Rainbase and was bringing weapons back and forth to the rebels from Nanohana to Katorea. During one of these trips he and Chopper became acquainted, since Chopper was brought to Katorea by accident and Matsuge smuggled him back to Nanohana. Luffy later saved him from a desert plant while he and his crew were on their way to the Yuba oasis, and with the help of the other Straw Hats, rescued Matsuge from the Sandora Lizard as they did in the manga. When Matsuge revealed he knew all along that the rebels were in Katorea, Luffy, Sanji and Usopp pummeled him for not telling them."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Matsuge\" means \"eyelash\" or \"eyelashes\" in Japanese.", "elements": []}]}], "images": []}]}