{"sections": [{"title": "Charlotte High-Fat", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte High-Fat is the 20th son and 33rd child of the Charlotte Family and the older twin brother of Tablet. He is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "High-Fat is a very large man with a disproportionate upper-body compared to his lower-body and sports a brown mustache."}, {"type": "paragraph", "text": "He wears a dark blue onesie with light blue polka dots, which covers his hands. His helmet and shoulderplates are yellow and spiked, and he wears dark boots and a pink belt with a yellow buckle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/High-Fat_full_view.png/revision/latest/scale-to-width-down/150?cb=20181025153543", "caption": "Full view of High-Fat."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about High-Fat's personality. Having taken part in Big Mom's plan to assassinate the Vinsmoke Family and helped his crew chase after the Straw Hat Pirates, he can be considered very loyal to his family and crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, High-Fat has authority over lower-ranking member of his crew."}, {"type": "paragraph", "text": "High-Fat possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, High-Fat possesses great physical strength, being able to block Jinbe's fist with his elbow."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "High-Fat wields a large sword. He was also given a Walker for the purpose of assassinating the Vinsmokes."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "High-Fat attended the tea party and wedding between Sanji and Charlotte Pudding, where he took part in Big Mom's plan to assassinate the Vinsmoke Family."}, {"type": "paragraph", "text": "As the plan began to fall apart due to Pudding's emotional breakdown, he was shocked to see Monkey D. Luffy burst out of the wedding cake and witnessed Charlotte Katakuri attacking him. High-Fat fought Jinbe, who had recently left the Big Mom Pirates, and tried to stop Luffy from showing Big Mom Mother Carmel's broken photo."}, {"type": "paragraph", "text": "High-Fat joined the siege on Capone Bege, and when the Vinsmokes joined the fight, he attacked them. Later, he saw Big Mom attacking the traitor. After the Vinsmokes exited Bege's fortress to provide the alliance with cover, he tried to shoot at them, and watched as his crew fought them."}, {"type": "paragraph", "text": "When the Whole Cake Chateau toppled as a result of the Tamatebako explosion, the Big Mom Pirates were saved by Streusen turning part of the Chateau into cake. Afterwards, High-Fat was recruited by Charlotte Daifuku to the pursuit unit that was assigned to go after the Straw Hat Pirates. After the Straw Hats ran into the Seducing Woods, High-Fat and his squad were defeated when Nami used Zeus to bring a thunderbolt down on them."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "High-Fat, Charlotte Tablet, and Charlotte Poire vs. Jinbe", "elements": []}, {"text": "Big Mom Pirates vs. Vinsmoke Family", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "High-Fat and Charlotte Dosmarche vs. Vinsmoke Yonji", "elements": []}, {"text": "High-Fat and Charlotte Noisette vs. Vinsmoke Niji", "elements": []}, {"text": "High-Fat vs. Jinbe (Seducing Woods)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, High-Fat and his comrades were defeated by Nami using Zeus' thunderbolt during the chase in the Seducing Woods. In the anime, Jinbe defeated him in battle instead."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "High fat is a food product with a high fat content, fitting with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}]}