{"sections": [{"title": "Charlotte Zuccotto", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Zuccotto is the 11th son and the 18th child of the Charlotte Family and an officer of the Big Mom Pirates. He also serves as Totto Land's Minister of Alcohol (酒大臣, Sake Daijin), governing over Liqueur Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Zuccotto is a short and stocky man with black hair gathered into a topknot and large sideburns; his mustache is very thin above his lip, but becomes thick near his sideburns, and has two long beard tendrils on either side of his mouth that go all the way down to his waist. He lacks a shirt, wearing only red and pink trousers with frills around the waist, a red cape, and large black sleeves on his arms. He also has a bushy, striped tail and black animal-like feet, making his lower half resemble that of a raccoon dog."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fe/Zuccotto_Manga_Concept_Art.png/revision/latest/scale-to-width-down/180?cb=20190427182015", "caption": "Zuccotto's original concept art."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Zuccotto's personality. Having taken part in Big Mom's plan to assassinate the Vinsmoke Family, he can be considered very loyal to his family and crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Alcohol, Zuccotto has authority over Liqueur Island, and as an officer of the Big Mom Pirates, he has authority over lower-ranking members of his crew. His combat powers and abilities are unknown, but he is presumably strong as he is an officer of a Yonko crew."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "For use in assassinating the Vinsmoke Family, he and other members of the Big Mom Pirates were given Walkers."}, {"type": "paragraph", "text": "In the anime, he was shown wielding two small axes for melee combat."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Zuccotto attended the tea party and wedding between Sanji and Charlotte Pudding, where he took part in Big Mom's plan to assassinate the Vinsmoke Family. He was sitting with Charlotte Basskarte, Oven, and Daifuku behind Reiju, awaiting the signal to start Big Mom's plot."}, {"type": "paragraph", "text": "After Monkey D. Luffy and his allies crashed the wedding, Zuccotto and some of his crewmates trapped the Vinsmokes and held them at gunpoint, with Zuccotto pointing his gun at Vinsmoke Judge's head. However, Big Mom's scream incapacitated them, allowing the Straw Hats to free the Vinsmokes."}, {"type": "paragraph", "text": "As the alliance's plan backfired, Zuccotto witnessed Bege using his Big Father form, and he again tried to shoot at the Vinsmokes. However, by that time, his targets were able to put on their raid suits, which protected them from the bullets. Zuccotto later saw Big Mom attack the enemy alliance herself, while Brûlée blocked Caesar Clown's escape attempt. When the Tamatebako ended up falling off the Chateau and exploding, causing the Chateau to topple over, and Zuccotto lost his balance. However, the Big Mom Pirates' fall was broken when Streusen turned part of the Chateau into soft cake."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Big Mom tried to infiltrate Wano Country, Zuccotto accompanied his mother and crew as they attempted to climb the waterfall into the country on the Queen Mama Chanter. However, just before they reached the top of the waterfall, King attacked the ship, causing the ship to fall off the waterfall and Big Mom to fall into the sea."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Charlotte Zuccotto, Charlotte Dacquoise, and Charlotte Kato vs. Vinsmoke Ichiji", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Zuccotto is an Italian dessert, fitting with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}]}