{"sections": [{"title": "Charlotte Kanten", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Kanten is the 27th son and 48th child of the Charlotte Family and an officer of the Big Mom Pirates. He also serves as Totto Land's Minister of Agar (寒天大臣, Kanten Daijin), governing over Jelly Island. He is the eldest triplet brother of Kato and Montb."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kanten is a very obese man with a wide head and no neck. The top of his head is longer and shaft-shaped, and is covered by bandages which also covers Kanten's right eye. His mouth contains only a few teeth that are spaced widely apart. He has extremely long and curly dark green hair that reaches to the small of his back and is wider than his body. He does not wear a shirt, only wearing black pants with an X-shaped belt that resembles caution tape, as well as bandages around his arms."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Kanten's personality. Having taken part in Big Mom's plan to assassinate the Vinsmoke Family, he can be considered to be very loyal to his family and crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Agar, Kanten has authority over Jelly Island, and as an officer of the Big Mom Pirates, Kanten has authority over lower-ranking members of his crew."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Kanten has at least decent physical strength, as he was briefly able to hold his own in a clash with Vinsmoke Ichiji, a powerful superhuman fighter who had his Raid Suit on."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He appeared to wield a rapier while confronting Ichiji."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Kanten attended the tea party and wedding between Sanji and Charlotte Pudding, where he took part in Big Mom's plan to assassinate the Vinsmoke Family. He was confused by Pudding's actions at the altar."}, {"type": "paragraph", "text": "As the alliance's plan backfired, Kanten witnessed Bege using his Big Father form, before Big Mom attacked the traitor."}, {"type": "paragraph", "text": "He confronted Ichiji while Caesar carried Bege away, before losing his balance as Whole Cake Chateau shook."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Charlotte Kanten vs. Vinsmoke Ichiji", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kanten is the Japanese word for Agar, a jelly-like substance used in desserts. This fits with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}]}