{"sections": [{"title": "Rocks D. Xebec", "level": 1, "content": [{"type": "paragraph", "text": "Rocks D. Xebec, commonly known simply as Rocks, was the captain of the Rocks Pirates. He was prominent 40 years ago, before the Pirate King Gol D. Roger came into power."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Forty years ago, Rocks appeared to have been a normally-proportioned humanoid, though he seemed to stand at around half the height of his immensely large (though not giant-sized) crewmates. He had long hair that was gathered into tendrils sticking in every direction. He appeared to have worn a sailor's jacket."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Based on stories of his exploits, Rocks appeared to be an incredibly vicious and ambitious man, having no care as to who he attacked as long as he could garner power for himself and leading his crew to destroy whoever interfered with his ambitions. He was also quite fearless and ruthlessly indiscriminate, as he had no issue with killing World Nobles or their slaves if it suited his wishes. Rocks' dream was to become the King of the World (世界の王, Sekai no Ō), and he attacked many locations and left mass destruction in his wake to assert his dominance. He was also very curious about subjects that the World Government had kept hidden, resulting in him dabbling in those subjects."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Although Rocks' individual strength and abilities are unknown, he was well-reputed for presiding over a crew of extremely powerful people. Many of these people would go on to make a name for themselves, and three of them would become Yonko. He was considered to be the most formidable rival of the Pirate King Gol D. Roger, even more so than his subordinate Whitebeard would come to be; it took both Roger and Monkey D. Garp to finally defeat Rocks."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Over 40 years ago, Rocks and several other pirates arrived at the island of Hachinosu to meet and seek a path to fame and fortune. As a result of the meeting, Rocks took charge of this group, who called themselves the Rocks Pirates, and led them on a path of destruction with the goal of taking over the world."}, {"type": "paragraph", "text": "38 years before the present, Rocks led his crew on a mission that endangered the World Nobles and their slaves. At God Valley, the Rocks Pirates were intercepted by Monkey D. Garp and Gol D. Roger, who had formed an alliance. A massive battle ensued, resulting in the dissolution of the crew. According to Sengoku, Rocks is no longer alive."}], "images": []}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "Many of Rocks' subordinates would go on to become extremely notable pirates, particularly Edward Newgate, Charlotte Linlin, and Kaido, who became three of the Yonko ruling over the New World. Other members like Shiki became an infamous pirate that clashed with the Roger Pirates multiple times and became the first inmate to escape Impel Down and Captain John gathered a fabled treasure."}, {"type": "paragraph", "text": "Rocks' place in history has been considerably diminished in the decades since his death, with many younger Marines being unaware of who he is. According to Sengoku, this lack of knowledge about him is mainly due to the World Government's intervention, as his path resulted in him dabbling in subjects they forbid. Additionally, due to the overall lack of camaraderie within the Rocks Pirates, most of Rocks' past subordinates are not inclined to talk about their time sailing with the crew."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The name of Rocks may have been taken from the real life pirate Roche Braziliano, which in English translates to 'Rock the Brazilian' from his long exile in Brazil.", "elements": []}, {"text": "He, Whitebeard, and Gol D. Roger are the only characters to have crew members who would later become members of the Yonko.", "elements": []}, {"text": "A xebec was a type of Mediterranean sailing ship used for trading.", "elements": []}, {"text": "Sterry believed that sitting on the Empty Throne would make one the \"King of the World\"; it is unknown if Rocks was aware of its existence.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Chapter 957, Rocks is first seen in a silhouetted image.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 907 (p. 6) and Episode 887, Hina and Garp talk about Rocks.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 907 (p. 8) and Episode 886, The Empty Throne is explained.", "elements": []}]}], "images": []}]}