{"sections": [{"title": "Im", "level": 1, "content": [{"type": "paragraph", "text": "Im is an extremely high-ranking individual in the World Government whom even the Five Elders bow down to, and the one who sits on the Empty Throne. However, Im's existence is a secret to the rest of the world."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Im has only been seen silhouetted so far. They possess a humanoid figure with a hand resembling a human's and sharp almond eyes with red irises that have thin circles surrounding the pupils. They wear a crown that has four sharp, incredibly tall spikes on the top and an extremely long robe that flows upon the ground a great distance behind them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7b/Im_Face_Silhouette.png/revision/latest/scale-to-width-down/210?cb=20190618102704", "caption": "Im's face in silhouette."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Im's personality, but they seem to have a calm and gentle side, as shown when handling butterflies in the Room of Flowers. It seems Im has developed a particular interest in Monkey D. Luffy, Marshall D. Teach, Shirahoshi, and Nefertari Vivi. Im keeps wanted posters or photos of all four on their person. Luffy and Blackbeard's posters are cut apart and Shirahoshi's picture has a dagger pinning it to the ground. Vivi's picture is the only one not shown to be damaged."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The full scope of Im's abilities are unknown, but the fact that they sit on the Empty Throne, a seat whose occupant would be associated with sole authority of the entire world, and the fact that the Five Elders, who are publicly considered to be the highest authorities of the World Government bow before them and address them with a great honorific, would indicate that Im has the greatest known authority within the World Government."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Im possesses a saber. It has not been seen being used in combat, but it has been used to cut apart bounty posters and photographs."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "As royals gathered at Mary Geoise for the Levely, Im went to a chamber deep within Pangaea Castle, and approached a large straw hat while carrying some bounty posters including Monkey D. Luffy's."}, {"type": "paragraph", "text": "Im later went to the Room of Flowers and cut apart Luffy and Blackbeard's bounty posters while also examining pictures of the princesses Shirahoshi and Nefertari Vivi. When the Levely began, Im met with the Five Elders while sitting on the Empty Throne. The elders requested that Im reveal the name of the \"light\" that needed to be extinguished from history."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/24/Im_Sits_on_the_Empty_Throne.png/revision/latest/scale-to-width-down/210?cb=20190618101548", "caption": "Im meets with the Five Elders while sitting on the Empty Throne."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Im is the name of a giant appearing in Norse mythology.", "elements": []}, {"text": "When written in katakana, Im's name is composed of the two radicals comprising the character 仏, which means \"Buddha\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 906 (p. 16-17) and Episode 885, Im is first seen before a Straw Hat.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 908 (p. 14-16), The Five Elders bow before Im as he takes the Empty Throne.", "elements": []}]}], "images": []}]}