{"sections": [{"title": "Raccoon", "level": 1, "content": [{"type": "paragraph", "text": "\"Pretended Sleep\" Raccoon is a West Blue pirate captain who was defeated by the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Raccoon's appearance is unknown."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Raccoon and his crew are greedy, as they tried to eat food in Whitebeard's territory without paying for it. Raccoon is also persistent, as he shot Marshall D. Teach after having been defeated and captured."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The extent of Raccoon's abilities are unknown, but he and his crew were easily defeated by the Whitebeard Pirates and Raccoon himself was thrown around like a ragdoll by Marshall D. Teach."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Raccoon wields a pistol, and he is skilled enough to shoot Teach with it after being defeated."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "One Piece novel A", "level": 3, "content": [{"type": "paragraph", "text": "Raccoon and his crew entered Whitebeard's territory and ate without paying for their meal before fleeing. They were defeated when the Whitebeard Pirates, led by Ace and Thatch, intercepted them and boarded their boat. Teach picked up a defeated Raccoon by his head and threw him aside, but when the Whitebeard Pirates were distracted, Raccoon shot Teach. In response, Teach stomped on him with no mercy."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Raccoon and his crew vs. the Whitebeard Pirates", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece novel A, Raccoon makes his first appearance.", "elements": []}]}], "images": []}]}