{"sections": [{"title": "Charlotte Broyé", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Broyé is the ninth daughter and 20th child of the Charlotte Family and the younger twin sister of Brûlée. She is also an officer of the Big Mom Pirates and serves as Totto Land's Minister of Meringue (メレンゲ大臣, Merenge Daijin), governing over Milenge Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Broyé is a young-looking woman with light brown eyes; a small, slender nose; a thin waist; and short, light pink hair divided into four locks. She wears a long dress with a tall, fluffy, white collar; a floor-length, pale green cape with a pink underside; a pair of white, elbow-length gloves, and a golden crown on her head. The upper part of Broyé's dress is yellow and has a low-cut opening, revealing part of her breasts. Around her hips is a white peplum that curves downwards. The lower part of her dress is a pale beige, and is lined with three rows of roses. At her side is a long-handled sword with a black sheath."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Charlotte_Broy%C3%A9_Anime_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20180930105032", "caption": "Broyé's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Broyé's personality. However, since she took part in Big Mom's plan to assassinate the Vinsmoke Family, she can be considered very loyal to her family and crew. She was frightened by the thought of Big Mom's reaction to the destruction of Mother Carmel's photo."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Meringue, Broyé has authority over Milenge Island, and as an officer of the Big Mom Pirates, she has authority lower-ranking members of her crew. Her combat powers and abilities are unknown, but she is presumably strong as she is an officer of a Yonko-led crew."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "She was seen wielding a sword on multiple occasions."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Broyé attended the tea party and wedding between Sanji and Charlotte Pudding, where she took part in Big Mom's plan to assassinate the Vinsmoke Family. After Brook broke Mother Carmel's portrait, Broyé worried about Big Mom's reaction."}, {"type": "paragraph", "text": "She later joined her crew's siege on the alliance, and then witnessed Katakuri blocking Caesar's escape."}, {"type": "paragraph", "text": "She later joined Brûlée, Perospero, Daifuku, and 10,000 Chess Soldiers inside the Mirro-World, awaiting further instructions."}, {"type": "paragraph", "text": "During the battle, she was last seen on the Queen Mama Chanter chasing after the Straw Hat Pirates as they escaped on the Thousand Sunny, and fought the Sun Pirates as they tried to help the Straw Hats escape Totto Land."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Broyé later accompanied Big Mom and her crew when they went to Wano Country to pursue the Straw Hats, but when they tried to climb the waterfall on the Queen Mama Chanter, King flew in and knocked the ship off the waterfall, causing Big Mom to fall into the sea. Later, Broyé watched on as her siblings discussed what their next move should be with Big Mom missing."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Broyé poitevin or broyé du Poitou is a French cake, fitting with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": [{"text": "Her name may also come from broyée, which means crushed or grinded in French, which would match with Brûlée also being a French verb (meaning burnt).", "elements": []}]}, {"text": "Broyé's birthday was initially given as December 26th in the SBS. However, since her twin sister Brûlée's birthday is on March 6th, these birthdates are conflicting, and one of them would be incorrect.", "elements": []}]}], "images": []}]}