{"sections": [{"title": "Kurozumi Orochi", "level": 1, "content": [{"type": "paragraph", "text": "Kurozumi Orochi is the current shogun of the Wano Country and an ally of Kaido, one of the Yonko. Due to his actions and role, he is the tertiary antagonist of the Wano Country Arc and one of the central antagonists of the Yonko Saga."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Orochi is a rather large man with a big head and stocky build. He appears to be balding, with his dark purple hair being mostly seen on the sides and back of his head, and he has a long topknot in the back, as well as a thin mustache that sticks upward. His two upper canine teeth are longer than his other teeth and are blunt. They remain blunt in his hybrid form. He wears a gold kimono with a fan-shaped pattern on it, a blue robe with flowers on it, as well as a crown on his head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As the last member of the Kurozumi Family, who was stripped of their power and authority as a Daimyo family, disgraced and reduced to poverty, Orochi has developed immense greed and thirst for power from an early age due to being forced to live in poverty since birth. When he worked as a servant for Yasuie, Orochi outwardly exhibited a timid and servile attitude. However, Orochi would lie and even steal from his own master even at a young age, as he stole money from Yasuie and blamed it on Kozuki Oden."}, {"type": "paragraph", "text": "As an adult and the shogun, Orochi is an extremely cruel and oppressive tyrant. Under his rule, the people of Wano suffered great famines. The officials under him also harshly enforce his regime, and he collaborated with Kaido to not only kill Kozuki Oden, but also allowed the Beasts Pirates to turn Wano into a nearly complete wasteland in exchange for borrowing Kaido's power and protection, disregarding his own country and people in favor of his own self-interest. Due to his power and connections, he is completely fearless and arrogant, as he proclaimed to CP-0 that he does not fear the Celestial Dragons nor the Marines. He even shot one of the CP-0 agents, confident that they could do nothing against him. Orochi takes absolute pride in his tyrannical dictatorship of Wano Country, proudly proclaiming to the CP-0 agents how Wano had remained a self sufficient prosperous country despite its isolation. He even states that all his citizens are happy, turning a blind eye to the fact that a majority of them constantly suffer from hunger. He even goes as far as to feed them defective SMILE fruits to stop them from expressing sadness and despair from his tyranny, in order to support his selfish delusion of Wano Country being a happy and blissful paradise."}, {"type": "paragraph", "text": "Orochi has proven himself to be quite hypocritical. While he was propagandized as a hero for defeating the Kozuki Family and maintained Wano's isolationism, Orochi has allied himself with Kaido, a pirate, who in turn has various connections to the outside world. Orochi himself has made contact with such outsiders, such as CP-0, accepting a warship from them in exchange for weapons, and then demanding Vegapunk to be delivered into the country in exchange for more. By allowing CP-0 agents into his castle for negotiations and demanding Vegapunk as payment, he effectively broke the isolation policy (and the law he was supposed to have defended from the Kozuki Family) for his own agenda."}, {"type": "paragraph", "text": "Orochi is also immensely extravagant and hedonistic, as he loves to hold banquets with luxurious food and drinks accompanied by refined music and dancing. He also has strict standards for his banquets, as he would throw away food that is not to his liking. Moreover, he employed only the finest geisha of Wano, such as Komurasaki, to perform at his banquets as Nico Robin was required to master Wano Style Dance as a geisha in order to get close to him. He is also very lustful, as seen when he tried very hard to find a reason to accept Komurasaki outright defying him simply because she was extremely beautiful and he could not see himself marrying anyone but her. His affections are very shallow, as Orochi only \"loved\" Komurasaki due to how beautiful she is and believing only he had the right to be with her. To vent his anger, he attacked other people in Komurasaki's stead. However, Orochi cannot maintain this delusional behavior forever."}, {"type": "paragraph", "text": "Orochi is extremely domineering and unreasonable with absolutely no tolerance of anyone defying him or speaking ill of him, even if it is out of his earshot and in casual discussion. He has made it a capital crime for any such rebellious talks, which the Gifters enforce. He is petty enough to mercilessly attack and kill anyone who offends him, whether they are a man, woman, or child (though may hesitate with a woman he has feelings for). He gets angry if his target ends up being spared from his wrath, as shown when Kyoshiro struck down Komurasaki to give her mercy. He also will not let a grudge go as after Toko escaped his grasp, he hired an assassin to hunt her down. He does not tolerate failure as he sent the assassin to Udon prison for failing to kill his target. When Zoro and Sanji protected Toko, Orochi was utterly enraged at their interference with his execution, and ordered his subordinates to kill Zoro and Sanji in cold blood. Before he left Rasetsu Town, he gave his men specific orders to kill the Straw Hats for defying him at all cost. He also refuses to admit his own faults, putting the blame on others for them such as blaming Toko and Kyoshiro for Komurasaki's \"death\", despite this being a result of his own cruel and selfish actions."}, {"type": "paragraph", "text": "Though arrogant, Orochi avoids being overconfident. As a highly cautious and attentive man, he takes any and all threats to his rule seriously. To this extent, he has prohibited the use of weapons and banned kendo, karate, and judo dojos to deprive any dissidents of the means to incite an rebellion. Orochi also acknowledges the fact that the Nine Red Scabbards and Momonosuke have survived, believing his information sources and the fact that their bodies were never found. His warnings about the return of the Kozuki retainers cause many of his complacent servants to view him as a coward, merely overreacting out of fear for the prophecy. Though his servants are often afraid to voice this skepticism out loud, Orochi is aware of the fact that he is thought of as paranoid. He overlooks this due to having the authority to have his commands carried out regardless. Orochi remained resolute in his refusal to release the prisoners in Rasetsu Town despite Yasuie convincing people that everything was a result of Orochi's mistake, going as far as imprisoning their families alongside them if they attempted to protest."}, {"type": "paragraph", "text": "Despite his usual precautiousness, Orochi can make rash decisions in the heat of the moment as he was willing to execute Yasuie in a public demonstration, without taking into account the latter's popularity with his citizens which may arouse dissatisfaction. According to Hyogoro, despite all the precautions Orochi had took to minimize the chances of his own downfall, Orochi had failed to notice the great flaw in his policy of condemning all his dissidents to life imprisonment in Udon, gathering tens and thousands of dissidents in a single place, which ironically created a massive army of dissidents that will potentially possess a tremendous threat to his own rule. Having lived in safety and protection for twenty years under the Beast Pirates and his countless subordinates such as the Kyoshiro Family and the Orochi Oniwabanshu, Orochi can also sometimes lose all sense of danger. When Zoro attacked him, Orochi was deeply shocked that someone had actually tried to kill him despite his authority and power as the shogun."}, {"type": "paragraph", "text": "He has a habit of using the phrase \"Don’t be reserved!\" (くるしゅうない, Kurushūnai), an expression used in historical context by people of high social status in response to their servants. Like other characters, Orochi possesses a unique laugh: \"Gufufufufu\". He has also used the variations \"Gufuhahaha\" and \"Guhoho\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5f/Orochi%27s_Delusional_Dance.png/revision/latest/scale-to-width-down/210?cb=20191127172123", "caption": "Orochi's twisted pride in his tyranny, dancing in delight admidst the false laughter of his citizens."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/89/Orochi%27s_Extravagance.png/revision/latest/scale-to-width-down/210?cb=20190208022002", "caption": "Orochi enjoys splurging on banquets."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/79/Orochi_panic.png/revision/latest/scale-to-width-down/210?cb=20190603135528", "caption": "Orochi paralyzed in the face of Zoro's attack."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Subordinates", "level": 4, "content": [{"type": "paragraph", "text": "Orochi has many subordinates in Wano, including the Kyoshiro Family, a yakuza gang. While all his men appear to be fiercely loyal to him, they do not have a lot of respect for him as a person. Whenever Orochi brings up the prophecy about the Kozuki Family, his underlings generally do not take him seriously though they try not to laugh about his paranoia. They also talk about him behind his back, such as when Kyoshiro called him a coward."}], "images": []}, {"title": "Kyoshiro", "level": 4, "content": [{"type": "paragraph", "text": "Kyoshiro is the head of the Kyoshiro Family, and Orochi thinks highly of him and his connections, as he praised him during his banquet about the use of force against enemies. However, Kyoshiro has no qualms in speaking badly about Orochi behind his back, calling him a coward. However, after Kyoshiro \"killed\" Komurasaki, Orochi was furious though Kyoshiro stated that someone who disrespects the shogun must be punished. Even long after her \"death\", Orochi is still enraged at his actions but did appreciate him holding the execution of Shimotsuki Yasuie on the same day."}], "images": []}, {"title": "Beasts Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Twenty years ago, Orochi allied with Kaido, allowing his crew the Beasts Pirates to take over Wano Country in order to monopolize its immense resources for their own gains in exchange for helping him overthrow the Kozuki Family to become the shogun. In exchange for Kaido's support to maintain his political authority and power, Orochi purposely sacrificed most of the territory of Wano to be used by Kaido for his war preparations, while also letting the Beasts Pirates enslave his own citizens and subjugate them to harsh labor in weapon factories, forcing them to provide the manpower required to mass produced weapons for Kaido's own goals. Kaido seems (with amusement) to regard Orochi as a sickened individual because of his action of robbing the people of Ebisu Town of their ability to express sadness or anger."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "When they first met, Kozuki Oden did found him strange and Orochi was willing to lay on a puddle on Oden's behalf. After Orochi quit being Yasuie's servant, Oden lent him money out of kindness. Also, he became Sukiyaki’s servant."}, {"type": "paragraph", "text": "Rather than repaying Oden's generousity, Orochi orchestrated the downfall of the Kozuki Family and the execution of Oden. Under Orochi's regime, people in Wano are taught that Oden and his retainers were evil samurai who tried to destroy the country by opening the borders. While most of his subordinates believe them all to be dead, Orochi is firmly confident they are alive and is obsessed with killing Momonosuke."}, {"type": "paragraph", "text": "Surprisingly, despite this slander, he appears to consider Oden's primary retainer Kin'emon to be cunning and warns his banquet guests to be wary of the samurai."}], "images": []}, {"title": "Komurasaki/Kozuki Hiyori", "level": 4, "content": [{"type": "paragraph", "text": "Orochi originally used to be in love with Komurasaki and desired to make the woman his. However, as Orochi attacked Toko, Komurasaki slapped him, which infuriated Orochi. Because of her beauty, Orochi gave her a chance to beg for mercy, but she refused, causing him to attack in a fit of rage. However, Orochi was furious when Kyoshiro struck her down on his behalf."}, {"type": "paragraph", "text": "After Komurasaki was presumably murdered, Orochi fell into immense sorrow and depression, crying nonstop in mourning to the extent of lashing out at Fukurokuju for interrupting him and harboring a grudge against Kyoshiro for killing her."}, {"type": "paragraph", "text": "Unknown to Orochi, Komurasaki is actually Kozuki Hiyori, the daughter of his most hated enemy, Oden. She is shown to be disgusted by Orochi's cruelty, tearfully saying that his most heinous crime is putting the poor into so much misery and taking away their ability to express sorrow. Also, she expressed her desire to kill Orochi with her own hands."}], "images": []}, {"title": "Toko", "level": 4, "content": [{"type": "paragraph", "text": "Despite not having done anything personally against him, Orochi despises Toko for laughing at him during his banquet. He mercilessly tried to kill her despite Komurasaki's pleas over her being a child. After Toko was able to escape, Orochi refused to let her live and hired Kamazo to hunt and kill her. When he saw Toko again at Rasetsu Town, he still cursed her for Komurasaki's supposed death and wasted no time trying to kill her. He was further angered to learn that she was Yasuie's daughter."}], "images": []}, {"title": "Shimotsuki Yasuie", "level": 4, "content": [{"type": "paragraph", "text": "41 years ago, Orochi was a servant for Yasuie and would act subservient to his master."}, {"type": "paragraph", "text": "Back when Orochi obtained the status of shogun, he gave Yasuie the chance to serve under him. He and the remaining daimyos refused and tried to fight back only to be defeated by Kaido. Upon learning that Yasuie was still alive, Orochi was furious and wanted to make an example out of him by executing him in front of the entire country. Yasuie on his part harbors scathing hatred for Orochi's cruel reign and ruining the country through his greed. As a final act of defiance, Yasuie took the blame for the crescent mark on the allies as a joke and to humiliate Orochi as a coward in front of his men and the citizens. Enraged, Orochi proceeded to shoot Yasuie dead. With the people of Ebisu Town unable to express anything other than laughter, Orochi made a mockery of Yasuie's death."}], "images": []}, {"title": "Dissidents", "level": 4, "content": [{"type": "paragraph", "text": "Orochi has countless dissidents who were against his despotic rule, mainly samurais who were former retainers and allies of the Kozuki Family. Those who openly defied Orochi were either sentenced to death or condemned to life imprisonment in the Prisoner Mine of Udon. Among them are Hyogoro and his fellow Yakuza bosses. According to Hyogoro, over ten thousand dissidents imprisoned in Udon were extremely enraged at Orochi and are fully prepared to revolt if given the right time. Dissidents who were in hiding chose to bid their time among the Wano residents and were also prepared to rebel, but they are currently being hunted down and imprisoned in Rasetsu Town."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Hyogoro_Explains_Udon_Dissidents.png/revision/latest/scale-to-width-down/210?cb=20190603212756", "caption": "Orochi has countless dissidents, most prominently Hyogoro and his fellow Yakuza bosses."}]}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "As an ally of the Kozuki Family, Zoro is an enemy of Orochi. After Orochi executed Yasuie whom he was friendly with, Zoro also learned from Hiyori about how Orochi fed the citizens of Ebisu Town faulty SMILE fruits to prevent them from expressing sadness over their suffering from his tyranny. Zoro developed an intense hatred towards the shogun and stood up against him when he tried to kill Toko. In a rash fit of rage, Zoro tried to attack Orochi. He then went after the shogun until Kyoshiro interfered."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Orochi has an arrogant and fearless attitude towards the World Government and its military forces. After the fall of Doflamingo, Orochi negotiated a weapons trade with CP-0 and took advantage of their weak position to make exorbitant requests."}, {"type": "paragraph", "text": "Orochi seems to have a great interest in Vegapunk's scientific capabilities, as he demanded the scientist be brought to Wano in exchange for the next shipment of weapons."}], "images": []}, {"title": "Wano Country Citizens", "level": 4, "content": [{"type": "paragraph", "text": "A tyrannical and greedy ruler, Orochi held absolutely no concern for the welfare of his citizens, favoring only the rich while oppressing the poor. According to the laws he had set, only wealthy citizens can be considered humans, as all poor citizens are forced to live in wastelands and are allowed to eat only leftovers which result in many of them dying from hunger. He had absolutely no tolerance towards citizens who dare to criticize or insult him, willing to kill Toko simply for laughing at his perceived cowardice. He also allowed most of his poor citizens to be enslaved by the Beast Pirates to hard labor in weapon factories for the sake of his own prosperity in the Flower Capital. In addition to tyrannically oppressing his citizens, Orochi was cruel to the point that he would not allow his citizens to mourn and cry no matter how much misery he caused them due to finding their sadness and depression disgusting, even feeding them faulty SMILE fruits to rob them of the ability to feel sadness. When the Ebisu Town residents express their devastation towards Yasuie's death in laughter, Orochi joyfully cheered and danced, claiming that Wano Country is a paradise and that his citizens are \"always happy\" under his rule."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Orochi%27s_Cruelty.png/revision/latest/scale-to-width-down/210?cb=20190603210848", "caption": "Orochi is cruel toward poor Wano citizens and apathetic to the misery he causes."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As shogun, Orochi has full control over Wano Country and its inhabitants. He has government officials working under him who enforce his rule, and has a group of elite ninja known as the Orochi Oniwabanshu as well as samurai known as the Mimawarigumi who serve and protect him without question. He also possesses the backing of Kaido of the Yonko, so if he and his subordinates are threatened, Kaido will hear about it and deal with the threat, which is proven in the past when Kaido brutally ended a massive rebellion staged by countless samurais banded together lead by the daimyos serving the Kozuki Family against Orochi's new rule. He believes that, with Kaido's support, not even the World Government nor World Nobles can overthrow him nor topple Wano."}], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Orochi has an extremely sharp intuition and access to sources of information that allowed him to correctly deduce that Oden's son and retainers are still alive and that certain incidents around Wano Country are connected to Kin'emon. He whole-heartedly believes that they are planning to overthrow him and his ally Kaido, even though there is no concrete evidence to support his suspicions. Through his sources, Orochi has received information regarding Kozuki Hiyori, the time travel of the Nine Red Scabbards as well as the assembly location and numbers of the enemy alliance. This allowed him to correctly figure out their plans and take effective actions to prevent them from mobilizing, by destroying the cave containing the Thousand Sunny and blowing up all the bridges connecting the country's regions ahead of time."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cf/Orochi_Strategizing.png/revision/latest?cb=20191021165927", "caption": "Orochi commands an operation to prevent the rebels from mobilizing."}]}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "As shogun of the Wano Country, Orochi is a supposedly powerful samurai. He is said to use a sword-style known as Orochi Nitoryu (オロチ二刀流, Orochi Nitōryū, literally meaning \"Orochi Two Swords Style\"). According to propaganda, he used it to defeat Kozuki Oden and his retainers. He was seen using a katana when trying to strike the young girl Toko. Though he cut through a thin wall with a swing of his sword, he has not displayed much skill, since his attack on Toko missed and appeared to be executed wildly."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Orochi has great marksmanship skills, having been seen wielding a flintlock pistol and rifle. He was able to quickly draw his pistol and shoot a CP-0 agent in the head with it, although the agent was unharmed by the bullet. With his rifle, he was able to shoot Shimotsuki Yasuie to death from a great distance away, and was shown aiming directly at Toko's head when trying to shoot her."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Orochi ate the Hebi Hebi no Mi, Model: Yamata no Orochi, a Mythical Zoan-type of Devil Fruit which allows him to transform into an eight-headed snake. Only one head bears his eyes, mustache, and crown, while the others have more generic looks by comparison. In this form, he is given the ability to attack in multiple directions with his considerably strong jaws."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dd/Orochi%27s_Yamata_no_Orochi_Form.png/revision/latest/scale-to-width-down/210?cb=20191213062429", "caption": "Orochi's Yamata no Orochi form."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Orochi lived in squalor in his youth after his family lost their power. Over 41 years ago, he was approached by a mysterious old woman. She revealed to him how his grandfather unsuccessfully tried to become shogun by poisoning his fellow daimyo, but ultimately caught and forced to commit seppuku. Orochi was stunned at the possibility that he could have been the shogun, and agreed to follow the old woman's instructions to obtain the title. She told him to hoard gold and produce weapons in order to gain powerful allies. 41 years ago, Orochi worked as a servant for Shimotsuki Yasuie. When the shogun's son Kozuki Oden departed Yasuie's residence after staying there, Orochi stole money and blamed it on Oden. He later left Yasuie's residence himself and took the daimyo's remaining gold. Orochi then went to Kuri, where Oden then ruled as daimyo. He got Oden to give him money many times, promising to pay him back."}, {"type": "paragraph", "text": "Around 30 years ago, Orochi went to the shogun's castle with the old woman, who disguised herself as Oden with her Devil Fruit powers. She asked the shogun Kozuki Sukiyaki to give Orochi a job at the castle, and Sukiyaki obliged. Sukiyaki began to fall ill, and around 26 years before the present, the old woman posed as him and decreed that Orochi would temporarily succeed him as shogun until Oden returned from his absence."}, {"type": "paragraph", "text": "Once Orochi successfully became shogun, the old woman gave him the Hebi Hebi no Mi, Model: Yamata no Orochi, which she had promised him during their first meeting. Within the next six years, Orochi joined forces with Kaido and the Beasts Pirates. When Oden and his family returned, Orochi did not relinquish his position, instead working with Kaido to execute Oden and his wife Kozuki Toki. Before she died, Toki cursed Orochi, which he interpreted as a prophecy that the Kozuki Family would get revenge on him in 20 years."}, {"type": "paragraph", "text": "After his takeover, Orochi approached the four other daimyo of Wano and gave them the choice to join him or die. All of them refused and staged a rebellion, but were defeated by Kaido. Orochi also demanded the loyalty of the top yakuza boss Hyogoro and ninja Fukurokuju; Fukurokuju submitted to him, while Hyogoro refused and was imprisoned."}, {"type": "paragraph", "text": "A few years before Momonosuke's return, Orochi mixed faulty SMILE fruits with the leftovers from the Flower Capital and fed them to the residents of leftover towns, robbing the poor of their ability to express anger or sadness."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Orochi planned to throw a banquet, and an aide reported that the courtesan Komurasaki was on her way, which made him excited as he planned to make her his wife. Orochi then held an audience for CP-0, who wished to use him as a new medium for their trade with Kaido. Delighted by the amount of power he held in this situation, Orochi demanded that they bring him Dr. Vegapunk next time. When one of the agents protested, Orochi shot him and reminded him that he had no fear of the World Government thanks to Kaido's protection. Orochi then went to his banquet, where he celebrated with Komurasaki and his guests."}, {"type": "paragraph", "text": "Orochi listened to Komurasaki playing her shimasen before seeing the new geisha O-Robi and telling her to come talk to him. When he overheard his money changer Kyoshiro talking about avenging his comrades, Orochi expressed his agreement and took the opportunity to warn his guests about Toki's prophecy and the impending Kozuki Family rebellion. However, he then heard Komurasaki's kamuro Toko laughing at him and immediately rushed to attack her despite Komurasaki's pleas. Orochi swung his sword at Toko, but was then slapped by Komurasaki, who refused to apologize. Orochi transformed into the Yamata no Orochi and tried everything he could to avoid killing Komurasaki, but eventually went and wrested her into his main mouth. However, the ceiling suddenly fell on his head and dislodged Komurasaki from his mouth, and to Orochi's shock, Kyoshiro struck her down. This made Orochi very angry, and he resumed rampaging after Toko, but was then suddenly struck by a thunderbolt from the intruder Nami."}, {"type": "paragraph", "text": "The next day, Orochi discovered that a secret message was being passed around loyalists to the Kozuki Family and ordered the mass arrests of anyone with the crescent moon symbol on their ankle. He also sent his assassin Kamazo after Toko. The next day, Orochi found out that Kamazo had failed, and he had him sent to the Prisoner Mines for the Beasts Pirates to do what they liked with him.Fukurokuju then reported to Orochi that they had captured Ushimitsu Kozo, but Orochi was in no mood to hear about it as he continued mourning the loss of Komurasaki. Fukurokuju revealed that Ushimitsu Kozo was Shimotsuki Yasuie, and Orochi ordered for his execution to be broadcast, to which Kyoshiro revealed that the equipment was already set up for Komurasaki's funeral. Orochi gleefully planned for both of them to be disposed of together."}, {"type": "paragraph", "text": "As Orochi was brought to Yasuie's execution platform in Rasetsu Town, he heard the former daimyo insult him and became enraged. Orochi and his guards then shot Yasuie and killed him, and as Orochi reached the execution platform, he relished in the false laughing of the crowd mourning Yasuie. Orochi then saw Toko at Yasuie's body and made his way to shoot her, but his shots were blocked by Roronoa Zoro and Sanji. Orochi ordered his samurai to kill the duo, but froze as Zoro sent a deadly air slash toward him, though it was intercepted by Kyoshiro. Orochi was taken back to his castle on Kyoshiro's orders, and he told his subordinates to kill everyone who stood against him."}, {"type": "paragraph", "text": "Later, Orochi was furious to hear that the Straw Hats escaped. However, Fukurokuju informed the shogun that the Flower Captial was on lockdown with the Orochi Oniwabanshu and the Mimawarigumi on guard. He reassured that he would not let anything harm Orochi until they captured their enemies."}, {"type": "paragraph", "text": "On the day before the Fire Festival, Orochi received some reports. He learned about the alliance's plans and that Kozuki Hiyori is still alive and hiding in Ringo. During the night, Orochi ordered the Beasts Pirates to destroy the bridges connecting Wano's regions, preventing the rebels from gathering at their meeting place."}, {"type": "paragraph", "text": "On the next day, he traveled to Port Habu with his entourage and boarded a ship for Onigashima. At the island, he enjoyed the celebration in the company of women from the Beasts Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Orochi_Meets_with_CP0.png/revision/latest/scale-to-width-down/210?cb=20190107193840", "caption": "Orochi dominates a trade deal with the World Government."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/Orochi_Grabs_Komurasaki.png/revision/latest/scale-to-width-down/210?cb=20190218163421", "caption": "Orochi attacks Komurasaki for standing up to him."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Orochi_Attacks_Yasuie.png/revision/latest/scale-to-width-down/210?cb=20190609201714", "caption": "Orochi prepares to execute Yasuie."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Orochi means Big Snake or Serpent in Japanese, matching his Devil Fruit, the Hebi Hebi no Mi, Model: Yamata no Orochi.", "elements": []}]}], "images": []}]}