{"sections": [{"title": "Banchina", "level": 1, "content": [{"type": "paragraph", "text": "Banchina was Usopp's mother and Yasopp's wife."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "When she was sick, she was very pale. She had a long nose, which Usopp inherited, and black straight hair in the manga, while in the anime, her hair was dark green. She wore a pale, light green collared shirt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She was very kind and she really cared about her family. She was in love with her husband, Yasopp, and waited for him to come back home."}, {"type": "paragraph", "text": "She never lived to see Yasopp come home, or her son, Usopp, follow in his footsteps. She died when Usopp was very young, due to an unnamed disease."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "She was left by her husband to follow his dreams and go to sea with the Red Hair Pirates. However, this caused Usopp to grow up with a sick mother who became bed-ridden due to her illness."}, {"type": "paragraph", "text": "Every day he would tell the same lie, that his father had returned to take them away, hoping it would keep her hopes high and help her to recover. However, she knew he would never return and before her death she told Usopp that she was glad he had gone out to sea. Even after she passed away, Usopp continued to tell the same lie, even though he no longer had any reason to do so."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8b/Banchina.png/revision/latest/scale-to-width-down/200?cb=20130127215654", "caption": "Young Usopp trying to comfort his dying mother."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In one of the Loguetown fillers, Yasopp admitted that he was useless and could do nothing for his wife and child. After one of Shanks' men asks whether it was for the better, Shanks' men hoot and cheer like it was a good thing he left his wife and child."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 5 Chapter 41 (p. 14-15) and Episode 17, Banchina dies.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Banchina's birthday is given.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 41), Banchina's name is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 50, Daddy Masterson and Yasopp duel.", "elements": []}]}], "images": []}]}