{"sections": [{"title": "Tama", "level": 1, "content": [{"type": "paragraph", "text": "O-Tama is a girl from the region of Kuri in Wano Country. She is a kasa weaver and a kunoichi in training."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tama is fairly short. She has violet hair arranged in a Shimada-style and black eyes (violet in the anime). She wears a light green kimono with many patch-works, a light orange obi, and orange sandals."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She is quick to make friends, trusting and helping Luffy moments after he assured her he means her no harm. Being a kunoichi in training, she has a habit of starving herself as a means of training her body, forcing it mentally to let go of her hunger. She is also very brave, as she stood up to the Beasts Pirates when they tried stealing her belongings and even attacked one of them after being freed from captivity. However, she can also be careless, as shown when she revealed her allegiance to the Kozuki Family to the Beasts Pirates, drank out of a contaminated river and falling ill in the process, and disregarded her master's warnings not to show her powers in front of others, which caught the attention of Holdem."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "Tama has great faith in the Kozuki Family, as she used their name as a threat to those who upset her. However, she has no problem being casual with the heir, Kozuki Momonosuke, calling him \"Momo\"."}], "images": []}, {"title": "Tenguyama Hitetsu", "level": 4, "content": [{"type": "paragraph", "text": "As Tama's master, he cares for her very much to the point that he attacked Luffy when he thought Luffy had stolen one of the only two rice meals she has every year. He was also angry at Luffy for revealing Ace's death, which made Tama sad."}], "images": []}, {"title": "Komachiyo", "level": 4, "content": [{"type": "paragraph", "text": "Komachiyo is very loyal to Tama, as he tried to fight the Beasts Pirates to protect her from them."}], "images": []}, {"title": "Hihimaru", "level": 4, "content": [{"type": "paragraph", "text": "While initially antagonistic, Hihimaru befriended Tama after she fed it some dango and joined her as the group headed toward Tama's home."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Luffy inadvertently rescued Tama when her kidnappers attacked him. Because of this, she has immense gratitude and refers to Luffy with a \"big brother\" honorific. She even went as far as to give him the rice she was meant to have, even though it is the most she eats all year. However, Tama became furious when Luffy reported Ace's death to her. After she was abducted by Gazelleman and brought to Holdem, Tama hoped for Luffy to save her, showing her faith in him. After Luffy freed her from Holdem, Luffy promised that he would make her life better before leaving Wano Country. She is unaware that Luffy is Ace's brother though she has noticed similarities between the two. After hearing that Kaido attacked her, Luffy regretted not taking her to her home safely himself and attacked Kaido in a fit of rage. When she heard about Luffy's capture, Tama was more concerned about him than her own injuries. She cares about Luffy so much that she went with the group heading for Udon to get him out. She was later happy to be reunited with him after his group's takeover of Udon. However, Luffy scolded her for putting herself in danger by coming to the prison. Tama has grown so attached to Luffy that she is seen mostly by his side. Also, she doesn't like to see Luffy get hurt, even from people he's associated with when he does something that irritates them."}], "images": []}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "When Ace visited Wano, Tama formed a bond with him and had wanted to join his crew, but Ace refused based on her current age. However, he did promise that once the two meet again and she becomes a kunoichi, he would bring her on board. When Luffy informed her of Ace's death, Tama was deeply upset and refused to believe him. Tama does not know Luffy and Ace are brothers but has commented to Luffy that after he struck Holdem with the Gomu Gomu no Red Hawk, he reminded her of Ace."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Beasts Pirates", "level": 4, "content": [{"type": "paragraph", "text": "As an ally of the Kozuki Family, Tama defies everything the Beasts Pirates stand for and was kidnapped as a result. While being tied up in a sack, the Beasts Pirates planned to either sell her in the Red Light District or turn her in until Luffy interfered. Also, Holdem had an interest in her ability to tame animals and tried to force her to use it until Luffy came to her rescue. Kaido almost killed her when he saw Speed’s betrayal."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "After Big Mom lost her memories, Tama developed a friendly relationship with her though she wanted to take advantage of her strength to break Luffy out of Udon prison. After breaking into the prison, Big Mom showed willingness to share oshiruko with Tama."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Tama was shown using a club against a member of the Beasts Pirates, and had enough strength to knock him out with it."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Tama has eaten an unnamed Paramecia-type Devil Fruit that allows her to create dango from her body. Any animal that eats these dangos will become tame and subservient to Tama, obeying all her orders and defending her. While the dangos usually don't work on humans, either in taming or quelling hunger, humans who have consumed a SMILE Devil Fruit are susceptible to being tamed due to being part animal; it is unknown if this also applies to normal Zoan users. The food cannot be forcefully taken from Tama's body."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Tama%27s_Devil_Fruit_Ability.png/revision/latest/scale-to-width-down/180?cb=20190819140148", "caption": "Tama makes a dango from her cheek."}]}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Kibi Dango (きびだんご, Kibi dango): By forming a circle with her thumb and index finger and pinching her cheek, Tama creates a small dumpling, which seems to have a pacifying effect on animals that eat it, making them tame and friendly. It was first used to tame Hihimaru. It also appears to be effective on SMILE users such as Speed. Kibi dango are a traditional Japanese confectionery made from millet grain.", "elements": []}]}], "images": []}, {"title": "Other Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Tama has some experience with cooking rice. She is also capable of weaving kasa from bamboo. Tama has also been shown to be quite shrewd, coming up with the idea of manipulating an amnesic Big Mom into invading Udon to break Luffy free of imprisonment."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point around three to four years ago, Portgas D. Ace and his crew visited Wano Country, and Tama formed a bond with him. Tama wanted to go out to sea with Ace, but he told her that she was too young at the time. He promised that he would take her with him if she became a kunoichi by the time he returned and Tama waited for him since."}, {"type": "paragraph", "text": "On her eighth birthday, Tama went to the marketplace to buy some rice. However, she was confronted by some Beasts Pirates scouts and their baboon Hihimaru. Komachiyo came to protect her from Hihimaru, but the scouts took her belongings and she mentioned the Kozuki Family to threaten them, causing them to capture her."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Tama was tied up in a sack and begging to be free. The scouts went to confront Monkey D. Luffy, who had arrived in the country illegally. However, Luffy easily overwhelmed them, allowing Tama to free herself out of the sack and knock out one of the scouts."}, {"type": "paragraph", "text": "Afterward, Tama formally introduced herself to Luffy and tamed Hihimaru by giving it some Kibi Dango. She offered to make food for Luffy out of gratitude and helped him put the Sunny in a safe alcove on the coast. They went to her house, where she made rice confections for him before going to drink from the river to quell her hunger. She came back to find her master angered at Luffy for eating the rice, but she told him what had happened. However, she then fell ill due to drinking the contaminated river water polluted by Kaido's factories."}, {"type": "paragraph", "text": "After Hitetsu revealed that Tama was waiting for Ace, Luffy informed them of Ace's death. Tama was distraught at the news and passed out. Luffy then decided to take her to a doctor and as Komachiyo gave them a ride through the bamboo forest, Tama accused Luffy of lying and explained about the promise Ace made to her. They later entered a wasteland and Tama explained about the terrible environment created by the Beasts Pirates before falling unconscious again."}, {"type": "paragraph", "text": "Tama remained unconscious as Luffy reunited with Zoro after the latter saved a woman from Kaido's thugs. After Komachiyo dragged Luffy and Zoro away from a battle with Basil Hawkins and his men, the woman that Zoro saved, Tsuru, told the two Straw Hats to bring Tama to her tea shop. They later arrived at Okobore Town."}, {"type": "paragraph", "text": "Tama felt better after receiving some medicine and she reluctantly ate some Oshiruko that Tsuru made for her. She then took a nap until Tsuru was attacked by the Gifter Batman. During the confusion, Tama was abducted by another Gifter, Gazelleman, and taken to Bakura Town. Tama was later taken to Holdem, who took an interest in her after hearing that she tamed Hihimaru, and planned to force her to use her ability."}, {"type": "paragraph", "text": "Holdem pulled on Tama's cheek, but was unable to get anything out of her. He continued torturing Tama until Urashima was sent flying into his house by Luffy. Holdem then confronted Luffy, putting Tama into his lion's mouth and threatening to crush her. In a blink of an eye, Luffy attacked the lion head and freed Tama. After finding out that Holdem had used pliers to pull on Tama's cheek, Luffy dropped Tama in midair and turned around to strike Holdem with a powerful Red Hawk punch."}, {"type": "paragraph", "text": "With Holdem defeated, Luffy then grabbed Tama again and ran away with her on the back of Speed, whom he mistook for a horse. Speed got angry, but quickly became subservient to Luffy and Tama after Tama offered some kibi dango at Luffy's request. They made their way to Okobore Town with the supply of food stolen from the Beasts Pirates. As she ate an apple, Luffy promised her that she would not go hungry again."}, {"type": "paragraph", "text": "Tama then parted ways with Luffy and went back to her home by riding on Speed's back. On the way, both Tama and Speed were attacked by Kaido when the Yonko discovered them, and Tama was left lying bloodied on the ground. She was found by Inuarashi, who took her into the forest to receive treatment. Tama was then returned to her home where she was treated by Chopper and some of the minks. When Tama was worried about Luffy, Chopper assured her that Luffy has incredible recovery speed and his will would not be broken and that Raizo was planning on rescuing him."}, {"type": "paragraph", "text": "While Momonosuke was practicing swordsmanship in Amigasa Village, Tama asked him about his sister, whom Momonosuke believed to still be alive. Tama commented that it would be nice if Momonosuke could meet her but he stated that he could not reunite with her until the shogun and Kaido's defeat."}, {"type": "paragraph", "text": "Tama, Chopper, Kiku, and Momonosuke then went to Kuri Beach, where they encountered an amnesiac Big Mom. On the following morning, Tama's group took Big Mom to Okobore Town. Though Chopper was worried about Big Mom regaining her memories, Tama insisted on taking her to Udon, which Chopper reluctantly agreed with. The group then traveled to Udon, with Big Mom having tamed a Wanizame to carry them there. On the way there, Tama spoke to Hitetsu through a Smart Tanishi. Hitetsu objected to their quest and urged Tama to return to Amigasa Village, but Tama continued on with her group's journey. During the journey, Tama and Big Mom happily talked about Oshiruko. After night fell, the group eventually arrived at Udon."}, {"type": "paragraph", "text": "On the next day, Tama's group arrived at the Prisoner Mines after Big Mom broke through the front gate. Kiku told Tama and Momonosuke to hide before proceeding with Chopper. When the emergency gates were closing, Tama and Momonosuke entered the Prisoner Mines."}, {"type": "paragraph", "text": "While hiding, Tama and Momonosuke witnessed Luffy persuading the prisoners to rebel against the Beasts Pirates, prompting Tama to remember Luffy's promise to her. After the prison takeover, Tama reunited with Luffy though the latter was in a serious condition from being infected with the Mummy virus."}, {"type": "paragraph", "text": "Tama tamed Babanuki and had him give a false report to Queen. After Luffy finished with his training in Udon, Tama returned to Amigasa Village with him and Chopper two days before the raid on Onigashima."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e7/Tama_Takes_Luffy_to_Her_House.png/revision/latest/scale-to-width-down/210?cb=20180716114012", "caption": "Tama takes Luffy to her master's house."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/33/Tama_Eats_Tsuru%27s_Food.png/revision/latest/scale-to-width-down/210?cb=20190901033731", "caption": "Tama eats some real food as she recovers from her illness."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/52/Holdem_Manga_Infobox.png/revision/latest/scale-to-width-down/210?cb=20190415155229", "caption": "Holdem holds Tama hostage."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6a/Big_Mom_Goes_to_Udon.png/revision/latest/scale-to-width-down/210?cb=20190225133016", "caption": "Tama's group takes Big Mom to Udon."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tama speaks with an Edo and a Tōhoku dialect.", "elements": []}, {"text": "Tama tends to end her sentences in \"yansu\". Yansu is an auxiliary verb used in the Kansai Dialect, most specifically in the Shiga Prefecture, meaning \"to be\".", "elements": []}, {"text": "Her unnamed Devil Fruit power seems to be based on Momotarō of Japanese folklore, who also used kibi dango to recruit his three beastly retainers: a dog, a monkey, and a pheasant. So far, Tama is known to have befriended two of the same three types of animals that Momotarō has; only the pheasant is missing.", "elements": []}, {"text": "The way Tama uses her Devil Fruit is reminiscent of the old Japanese tale Lump-removing Old Man, a tale in which an old man befriends ogres who then removes a lump on his right cheek.", "elements": []}, {"text": "Her Devil Fruit bears similarity to two other Devil Fruits:", "elements": [{"text": "Streusen's Kuku Kuku no Mi, as they both are capable of creating food. However, while Tama's food is delicious, it doesn't alleviate hunger and the food is created from herself while Streusen's food is created from the environment and while not good tasting, it does have nutritional value.", "elements": []}, {"text": "Charlotte Katakuri's Mochi Mochi no Mi, as both fruits allow the user to manifest mochi from their body. However, Katakuri's mochi appears to have normal properties.", "elements": []}]}, {"text": "The hats Tama made for the Nine Red Scabbards are identical to the one worn by the individual from the cover of Chapter 631.", "elements": []}]}], "images": []}]}