{"sections": [{"title": "Charlotte Compo", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Compo is the 17th son and 28th child of the Charlotte Family and the older twin brother of Laurin. He also is an officer of the Big Mom Pirates and serves as Totto Land's Minister of Pie (パイ大臣, Pai Daijin), governing over Piepie Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Compo is a short man, and due to his clothing, his features are hidden. He wears a blue jumpsuit with his name written on it in yellow, a yellow belt, a pair of white gloves, white platform shoes, a large yellow cap, a navy ascot over his lower face, orange headphones, a dark purple cape, and sunglasses."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Since Compo took part in Big Mom's plan to assassinate the Vinsmoke Family and helped his crew chase after the Straw Hat Pirates, he can be considered very loyal to his family and crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Pie, Compo has authority over Piepie Island, and as an officer of the Big Mom Pirates, he has authority over lower-ranking members of his crew."}, {"type": "paragraph", "text": "Compo is very agile and possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Compo was shown using a boomerang with a blade at its center."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Compo attended the Tea Party and wedding between Sanji and Charlotte Pudding, where he took part in Big Mom's plan to assassinate the Vinsmoke Family. After Brook broke Mother Carmel's portrait, Compo worried about Big Mom's reaction."}, {"type": "paragraph", "text": "As the alliance tried to escape, Compo was blown away from Monkey D. Luffy and Big Mom's clash. As the Whole Cake Chateau toppled as a result of the Tamatebako explosion, Compo lost his balance and fell with it, but he was rescued swiftly by Streusen."}, {"type": "paragraph", "text": "Compo was recruited by Charlotte Daifuku to the pursuit unit that was assigned to go after the Straw Hat Pirates. During the pursuit, he was shocked to see Big Mom going after their enemies personally. After the Straw Hats ran into the Seducing Woods, Compo and his squad were defeated when Nami used Zeus to bring a thunderbolt down on them."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Charlotte Compo, Mobile, and Laurin vs. Monkey D. Luffy (Whole Cake Chateau)", "elements": []}, {"text": "Compo and Laurin vs. Monkey D. Luffy (Seducing Woods)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Compo and his comrades were defeated by Nami using Zeus' thunderbolt during the chase in the Seducing Woods. In the anime, Luffy defeated him in battle instead."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Compo\" is a slang therm for British army field rations, which fits the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": [{"text": "\"Compo\" can also be short for \"composition\". This can refer to food composition data, information on nutritionally important components of food, which also follows the theme. A musical composition is an original piece of music and its creation, which follows the music-themed names of some members of the Charlotte family.", "elements": []}]}]}], "images": []}]}