{"sections": [{"title": "Kikunojo", "level": 1, "content": [{"type": "paragraph", "text": "Kikunojo of the Lingering Snow is a samurai from Wano Country and a retainer for the Kozuki Family, serving as one of Kozuki Oden's Nine Red Scabbards. She is also the younger sibling of Izo, and a child of the dancing school head of the Hanayanagi School in Ringo."}, {"type": "paragraph", "text": "After traveling 20 years forward in time, she donned the alias O-Kiku and worked as a tea house poster girl in Okobore Town."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Although born biologically male, Kikunojo has a feminine appearance and presents herself as a woman. She is very tall, easily towering over Luffy and Zoro. She has long dark violet (dark blue in the anime) hair that falls onto her back and indigo eyes. She also wears sandals and a yellow kimono with chrysanthemum floral patterns and a pink and cream and lavender obi."}, {"type": "paragraph", "text": "When Kikunojo prepares for combat, she ties her hair into a ponytail with a red ribbon."}, {"type": "paragraph", "text": "When heading toward Onigashima for the battle against the Beasts Pirates, she wore a full set of Japanese armor."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kikunojo identifies herself as a \"woman at heart\", and thus presents herself effeminately. To friends, she is helpful and nurturing, as seen when she treated Zoro's injuries and tended to Tama when she was being healed of her poisoning. Kikunojo is also very courageous, as she quickly went to rescue Tama after the latter was captured by the Beasts Pirates."}, {"type": "paragraph", "text": "While living covertly in Wano, Kikunojo laid low and did not take up arms against the Beasts Pirates. In doing so, this shows that Kikunojo is a cautious person, in that she would rather remain calm and prepare wisely, rather than act rashly. However, she does not put up with people who degrade others and is not afraid to make that known, even if the other person is one of higher social standing. However, when she inevitably attracted attention as a result of standing up to others, she had difficulty deciding what to do next and became indecisive."}, {"type": "paragraph", "text": "Kikunojo refers to herself with sessha (拙者 or せっしゃ, sessha), an archaic form of \"I\" used by male samurai."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Izo", "level": 4, "content": [{"type": "paragraph", "text": "Izo is Kikunojo's only brother. After their father was arrested and convicted, they stayed together to survive in the streets of Ringo and they both joined Kozuki Oden. When Oden, Inurashi, Nekomamushi and Izo went missing, Kiku expressed worries as she couldn't find her brother and the others while crying."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Tsuru", "level": 4, "content": [{"type": "paragraph", "text": "As an employee under Tsuru, Kikunojo listens to her orders. Kikunojo already knew Tsuru twenty years ago as Kin'emon's wife, and while Tsuru recognized Kikunojo after she came forward through time, she kept this secret."}], "images": []}, {"title": "Tama", "level": 4, "content": [{"type": "paragraph", "text": "Kiku knew Tama and was worried for the girl when she drank out of the contaminated river water. When Tama was kidnapped, Kiku swiftly pursued the kidnappers, showing that she cared greatly for her."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Kikunojo befriended Monkey D. Luffy and Roronoa Zoro when they came to the tea shop with Tsuru and Tama. Kikunojo tended to Zoro's wounds, while Zoro in return scared Urashima away for harassing her. The three of them later infiltrated Bakura Town to rescue Tama, where Kiku was impressed by Luffy's usage of Haoshoku Haki, and in turn impressed them with her swordsmanship. However, she did find Luffy's casual greeting with Kozuki Momonosuke (referring to him as \"Momo\") as offensive. Upon meeting Kiku, Sanji was smitten by her and started flirting, unaware of her gender."}], "images": []}, {"title": "Kin'emon", "level": 4, "content": [{"type": "paragraph", "text": "They seem to have a good relationship, as Kikunojo respectfully refers to Kin'emon as Kin-sama. She was so overjoyed at seeing him again after a long separation that she tightly hugged him on sight and blushed in his presence."}], "images": []}, {"title": "Ashura Doji", "level": 4, "content": [{"type": "paragraph", "text": "As fellow retainers of Kozuki Oden and as fellow members of the Nine Red Scabbards, Kikunojo and Ashura fought alongside each other. However, they seem to have some level of animosity toward each other as Ashura stated that their relationship has been like this since the beginning when meeting Kikunojo again after 20 years, though he spared her from his banditry. Kikunojo also expressed her disappointment at Ashura because he said that he only respected and was only loyal to Oden, not the rest of his family. However, after Ashura decided to rejoin the Kozuki Family, they became comrades again."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Urashima", "level": 4, "content": [{"type": "paragraph", "text": "Urashima is a nationally famous and arrogant sumo wrestler who is smitten by Kikunojo, unaware of her gender. While remaining polite with him, Kiku declined his constant proposals firmly and clearly, which Urashima could not comprehend nor accept. When the wrestler later snarled at the spectators for their lowly status in front of Kiku, the samurai expressed her disgust with Urashima and avoided his attempt to embrace, instead cutting off his chonmage. Filled with rage, Urashima then tried to kill Kiku, but he was stopped by Luffy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "As a samurai and a member of the Nine Red Scabbards, Kikunojo is an extremely skilled swordswoman. Her strength was acknowledged by Orochi himself. Kikunojo wields a katana with expert precision, as she was capable of swiftly cutting off Urashima's topknot and fought against several Gifters and samurai effortlessly."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Kikunojo and Izo were born in Wano Country. During their childhood, they were raised in a dancing school but their family was torn apart after their father was arrested. Afterwards, they had to survive on the streets in Ringo. When Kozuki Oden arrived about 39 years ago and gave them food, they joined him. After Oden became daimyo of Kuri, Kikunojo became one of his retainers. For the next few years, Kikunojo and the other retainers educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "After meeting the Whitebeard Pirates, Oden and his retainers were having a feast with them. After the Whitebeard Pirates left Wano two weeks later, the retainers discovered Oden, Izo, Inuarashi, and Nekomamushi to be missing."}, {"type": "paragraph", "text": "Twenty years ago, after Kozuki Oden was executed in the Flower Capital by the shogun, Kikunojo, Kin'emon, Kanjuro, and Raizo escaped the execution site and successfully fled to Oden Castle, whereas Inuarashi and Nekomamushi had been captured by the shogun's forces as they escaped and were left behind. By the time Kikunojo's group reached Oden Castle, it was set ablaze by Kaido. The retainers went inside the castle and found Momonosuke as well as his sister and mother. Toki then sent her son and the retainers, save for Kawamatsu, twenty years into the future."}, {"type": "paragraph", "text": "After arriving at the future, they went around Wano and discovered how much it changed over the years. However, they discovered allies they could still count on and began forming a plan to take back Wano. While Momonosuke, Kin'emon, Kanjuro, and Raizo traveled to Zou, Kikunojo remained in Wano to gather intel."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Kikunojo was working in the tea house when Urashima, a sumo wrestler from the capital, tried courting her to become his wife. Kiku brushed him off and told him to place an order or leave, but Urashima simply continued to brag about his status. The situation was interrupted when Tsuru arrived with Monkey D. Luffy, Roronoa Zoro, and an ill Tama. Tsuru told Kiku to boil medicinal herbs for Tama, which she rushed to do. Before leaving, Urashima told Kiku about an upcoming sumo wrestling tournament at Bakura Town and expected her to visit him."}, {"type": "paragraph", "text": "As Tsuru healed Tama, Kiku bandaged Zoro's wounds. Kiku then sat next to Tama while she was sleeping, and was alarmed when the Gifter Batman attacked Tsuru. Another Gifter, Gazelleman, then abducted Tama during the confusion. After grabbing a sword and jumping on Komachiyo, Kiku then pursued Gazelleman along with Luffy and Zoro and headed for Bakura Town."}, {"type": "paragraph", "text": "At the town's gates, Kiku tried to stop Luffy from causing a scene when he was yelling for Tama. The group was then confronted by some swordsmen, but Luffy knocked them out with Haoshoku Haki. While traveling through the town, Kiku told Luffy and Zoro about the town's history. A defeated sumo wrestler was then suddenly hurled at them, but Luffy caught him with one hand. They then came across the tournament that Urashima mentioned and when Urashima spotted Kiku, he ordered his men to bring Kiku to him. After hearing about how Urashima looked down on commoners, Kiku sliced off his top-knot with a sword."}, {"type": "paragraph", "text": "As Urashima was filled with rage, Kiku was even surprised by her own actions. Urashima tried to attack Kiku, but was intercepted by Luffy. Kiku then watched Luffy's sumo match with Urashima and was amazed when Luffy sent his opponent flying. As the group was confronted by more enemies, Kiku was unsure of what to do until Zoro told her to fight back. Holdem later arrived at the scene while holding Tama hostage."}, {"type": "paragraph", "text": "As Holdem accused the group of being part of a group of thieves, Kiku warned Luffy not to anger Holdem carelessly. She also informed Luffy and Zoro that Jack was the ruler of the Kuri region and that attacking Holdem would have serious repercussions. When the Headliner Speed arrived with a wagon of food, Holdem ordered his subordinates to capture Kiku so he could execute her. However, Luffy quickly attacked Holdem and grabbed Tama while Zoro struck down the Beasts Pirates escorting the wagon. Komachiyo then grabbed Kiku and began running away with the food wagon. With Holdem defeated and Tama rescued, they fled Bakura Town and grabbed Law along the way. They then brought the food cart to Okobore Town."}, {"type": "paragraph", "text": "After giving the food to the citizens and parting ways with Tama, Kikunojo rode on Komachiyo along with Luffy, Law, and Zoro as they traveled to the ruins of Oden Castle. Before reaching the castle, Kikunojo cried and ran off. When Luffy was reunited with Kin'emon, Kikunojo arrived and hugged the latter. Once Momonosuke and the group that sailed to Wano Country with Luffy arrived as well, they went into the castle to talk. There, Kikunojo listened as Kin'emon explained to Luffy's group about the story of Oden, the rumor about Toki, what Kin'emon's group did after traveling 20 years from the past, and a plan to attack Onigashima, the island where Kaido resided."}, {"type": "paragraph", "text": "Kikunojo then helped Kin'emon explain about the Fire Festival and how the decisive battle would play out. When Kin'emon pointed out to Sanji that he was already married, Kiku mentioned that Tsuru was doing fine and Kin'emon was shocked to hear that she met her. After Kin'emon gave Luffy's group new clothes and tasks to do and summoned Shinobu to guide them, Law alerted the group to Kaido's sudden arrival at Kuri. The group was surprised to see Kaido, and Kikunojo was shocked to see Momonosuke in his dragon form. Kikunojo then followed Kin'emon to Okobore Town as he rushed to rescue Tsuru. After Kaido destroyed Oden Castle, Kikunojo rushed back there and was relieved to find the group safe before telling them what happened to Luffy."}, {"type": "paragraph", "text": "At Mt. Atama, Kikunojo witnessed Ashura Doji's clash with Inuarashi. After Kin'emon broke up the fight, Kikunojo expressed her disappointment in Ashura."}, {"type": "paragraph", "text": "Kikunojo, Tama, Chopper, and Momonosuke later went to Kuri Beach, where they encountered an amnesiac Big Mom. On the following morning, Kikunojo's group took Big Mom to Okobore Town. After Tsuru fed her, the group planned to take her to Udon. The group then traveled to Udon, with Big Mom having tamed a wanizame to carry them there. Tenguyama Hitetsu spoke to the group through a Smart Den Den Mushi, telling them to return to Amigasa Village. Kikunojo then told him to inform everyone else about the situation before hanging up. On the way to Udon, Kikunojo informed Linlin that Udon was far away and showed her a map of Wano Country. While practicing swordsmanship, Momonosuke used a certain shout that he learned from Zoro. Kikunojo was alarmed and advised him not to use it as it was a battle cry that was part of the old dialect used by commoners within the Kuri region, thus improper for someone of Momonosuke's social class. After night fell, the group eventually arrived at Udon."}, {"type": "paragraph", "text": "On the next day, Kiku's group entered the Prisoner Mines after Big Mom broke through the front gate. Kikunojo told Momonosuke and Tama to hide and informed Chopper that Queen was in charge of the prison before telling him to proceed with caution. As Kikunojo and Chopper were sneaking in, they witnessed Big Mom attacking Queen. Kikunojo and Chopper were amazed to see Big Mom overpowering Queen. They then became worried for Luffy when he invoked Big Mom's wrath by admitting he ate the oshiruko that Big Mom was looking for. Chopper and Kikunojo were shocked when Big Mom sent Luffy and Hyogoro flying into a wall."}, {"type": "paragraph", "text": "After Big Mom was captured and taken away by Queen, Kikunojo wanted to save the captured Yonko but Chopper said that they were better off without her. Later, Kikunojo saw that Kawamatsu was in a nearby cell, and watched as he was freed. Kikunojo then forced Luffy's assailants away from him, and reunited with Hyogoro, who said they could only rally the prisoners if they revealed their identities. Kikunojo revealed hers by putting on her mask and said that the group would have to silence all the Beasts Pirates in the prison. This very act surprised the prisoners after they realized who she really was, as well as Chopper and Luffy, who indirectly discovered that she was a man. Kikunojo's group then fought against the Beasts Pirates, but they were soon cornered by prisoners who were infected with the Mummy virus. However, she was then worried when Luffy made contact with the infected prisoners."}, {"type": "paragraph", "text": "After the prison takeover, Tama tamed Babanuki and had him give a false report to Queen. Kikunojo then told Raizo that Tama's ability works on animals and the SMILE users. She later joined a meeting with several key alliance members at Amigasa Village."}, {"type": "paragraph", "text": "The group then learned from Zoro and Kawamatsu that Hiyori is alive. Afterward, Kikunojo returned Nidai Kitetsu, which she retrieved from Udon, to Hitetsu. After Enma was given to Zoro, Kikunojo witnessed the sword's destructive power when Zoro gave it a test run. On the day for the raid on Onigashima, Kikunojo marched to the rebel meeting place with Momonosuke, Kin'emon, Kanjuro, Raizo, Shinobu, Inuarashi, Kawamatsu, and Ashura. The group eventually arrived at the meeting place, but found none of their ships and allies. In spite of this major setback, the Scabbards were still determined to go through with the raid, knowing that they would not get another chance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Kiku_Cuts_Urashima%27s_Topknot.png/revision/latest/scale-to-width-down/210?cb=20190915031003", "caption": "Kiku cuts off Urashima's topknot."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3e/Luffy%27s_Group_Fights_in_Udon.png/revision/latest/scale-to-width-down/210?cb=20190709072609", "caption": "Kikunojo and her allies prepare to take over Udon."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kikunojo, Monkey D. Luffy, and Roronoa Zoro vs. Beasts Pirates and enemy samurai", "elements": []}, {"text": "Kikunojo, Monkey D. Luffy, Tony Tony Chopper, Hyogoro, Raizo, and Kawamatsu vs. Beasts Pirates (Udon Prisoner Mines)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Kikunojo and Roronoa Zoro vs. Speed", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The kiku (菊, kiku) in her name is the Japanese word for \"chrysanthemum\".", "elements": []}, {"text": "Her name may be from Segawa Kikunojo, a yagō used by at least three onnagata (male actors who played women's roles in Japanese Kabuki theatre).", "elements": []}]}], "images": []}]}