{"sections": [{"title": "Urashima", "level": 1, "content": [{"type": "paragraph", "text": "Urashima is a yokozuna-ranked sumo wrestler of Wano Country's Flower Capital. He is also of samurai class, thus giving him an elevated social status."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Urashima is a very large man with round rosey cheeks, a downward-pointed nose, thin eyes, a wrinkled forehead, small ears, and a double chin. He has long, pink-colored hair that he wore in a topknot with a braid on each side of his face, and he has a slight widow's peak. The topknot has been cut off by Kiku during his attempt to capture her. His two forearms are covered with indigo tattoos, and the left tattoo goes down to his hip."}, {"type": "paragraph", "text": "When not in a sumo match, Urashima wears a large, light green-colored samurai gi that has a flower emblem on the sleeves and a square pattern on the rest. He also wears geta sandals on his disproportionately small feet, and he has two katanas which he wears on his left hip."}, {"type": "paragraph", "text": "During his meeting with Mouseman, he wears a kimono with white and blue squares."}, {"type": "paragraph", "text": "He wears a dark purple mawashi when he's sumo wrestling."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Urashima is very full of himself due to his high social status, and perceives that he has the authority to do whatever he wants to lower-class people, whom he views with great disdain. Unless he takes an interest in them, such as with Kiku, he will very vocally degrade them should they annoy him. If someone stands up to him and threatens his honor, Urashima has no problem with attacking them brutally to ensure his honor is not tainted, even against a woman. He is easily susceptible to the influence of people who encourage and enable him to use his status for his own benefit, such as Mouseman."}, {"type": "paragraph", "text": "Because of his conceit, Urashima often does whatever he wants regardless of how it affects other people. He once ordered some restaurant owners to cook their beloved pet raccoon dog for him to eat simply because he liked its meat. He also dislikes leftovers. While sumo wrestling, he sometimes intentionally uses illegal moves, as seen when he tried to jab at Luffy's eyes in their fight."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Mouseman", "level": 4, "content": [{"type": "paragraph", "text": "Urashima seems to be well affiliated with the Gifter Mouseman, who respected the Wano Country's social hierarchy system. He advised Urashima to take full advantage of his own social status to take Kiku for himself, a suggestion Urashima heartily agreed with. Despite the friendliness, Mouseman was not above passively insulting Urashima for taking too much into consideration for courting Kiku."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Kiku", "level": 4, "content": [{"type": "paragraph", "text": "Urashima was smitten with Kiku, and using his own vaunted positions as a national athlete and nobility to constantly court her for marriage, believing she would have no reason to reject his wealth and social status he could give her. Despite Kiku's clear disinterest and firm refusal to his proposals, Urashima was too stubborn to comprehend her answer. In his obsession to have her marry him, Urashima became prone to Mouseman's suggestion of abusing his own social status to coerce her into submission, even if it meant destroying all those dear around her. He even reveled in his high social status in her presence, which disgusted her."}, {"type": "paragraph", "text": "However, once Kiku sliced off his topknot, Urashima's \"love\" for her was shown to be superficial. He became enraged as he finally saw that she completely rejected and dishonored him, and attempted to kill her while violently deriding her for her alleged lower-class status. He even planned to mutilate her to serve as an example to the country."}, {"type": "paragraph", "text": "Unbeknownst to Urashima, Kiku is Kikunojo and is a man."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "When Monkey D. Luffy challenged Urashima in Kiku's defense, the sumo wrestler looked down on Luffy, believing him to be of inferior status and strength. However, he accepted Luffy's challenge for his own honor, though he was ultimately no match for the pirate."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being of samurai class, along with his national athlete status, Urashima is of high social status within Wano, and is wealthy. He could order around and kill lower-class citizens without legal repercussion, simply because of his standing."}], "images": []}, {"title": "Sumo Wrestling", "level": 3, "content": [{"type": "paragraph", "text": "As a yokozuna, the highest ranking sumo wrestler, Urashima is an extremely skilled and formidable sumo wrestler. Supplemented with his massive strength which is stated to be \"almost inhuman,\" he is capable of sending heavy sumo wrestlers flying great distances away, and most of his opponents end up having many of their bones broken. He can also take on multiple people at once with ease, having once beaten 19 people in the ring, all of whom he has inflicted extensive injuries, and even when distracted, Urashima instantly took down three sumo wrestlers simultaneously with little effort."}, {"type": "paragraph", "text": "Urashima's main style of fighting is harite, where he strikes opponents on and around their face with his open palms, and usually overpowers them with his brute strength. He is capable of matching the base strength of Monkey D. Luffy in a harite clash, although Luffy was not using Busoshoku Haki at the time and easily overpowered Urashima with the massive strength of Gear Third."}, {"type": "paragraph", "text": "Despite his large size, Urashima is very fast and is capable of performing attacks in rapid succession."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Higan Harite (彼岸張手, Higan Harite, literally meaning \"Nirvana Open Hand Strike\"): Urashima's most traditional harite technique. He performs a single open-palm strike on his opponent, and due to his brute strength, this is usually enough to send most of his opponents flying out of the ring. It was first shown used against Kiku, but was countered by Monkey D. Luffy. This is called Far Bank Slap in the VIZ Manga. Higan is a Buddhist term for both Nirvana and Buddhist holiday exclusively celebrated by Japanese sects during both the Spring and Autumnal Equinox.", "elements": []}, {"text": "Bosatsu Harite (菩薩張手, Bosatsu Harite, literally meaning \"Bodhisattva Open Hand Strike\"): Urashima launches rapid-fire open-palm strikes at his opponent that come from every direction. It was first shown used against Luffy. This is called Bodhisattva Slap in the VIZ Manga. Bodhisattva is a Buddhist term for a Buddhist who has attained enlightenment, but who as a selfless act delays his or her entry to Nirvana for the sake of others.", "elements": []}, {"text": "Mimi Tsubushi (耳潰し, Mimi Tsubushi, literally meaning \"Ear Splitter\"): Urashima slams his palms together in front of him, intending to catch his opponent's head in between them. It was first shown used against Luffy. This is called Ear Splitter in the VIZ Manga.", "elements": []}, {"text": "Me Tsubushi (目潰し, Me Tsubushi, literally meaning \"Eye Crusher\"): In an illegal move, Urashima attempts to jab at his opponent's eyes with his index and middle finger. It was first shown used against Luffy. This is called Eye Splitter in the VIZ Manga.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Urashima carries two katanas on his left hip, but it is unknown if he is skilled at using them."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "At Okobore Town in the Kuri region, Urashima tried courting Kiku to become his wife. She brushed him off and told him to place an order or leave, but Urashima simply continued bragging about his status. The situation was interrupted when Tsuru arrived with Monkey D. Luffy, Roronoa Zoro, and the ill Tama."}, {"type": "paragraph", "text": "Urashima decided to leave due to having an uneasy feeling towards Zoro and told Kiku about an upcoming tournament at Bakura Town that day. At a restaurant in Bakura Town, Urashima and the Gifter Mouseman were sitting and eating at the same table. Urashima told Mouseman about his desire to marry Kiku, and the pirate stated that he could do whatever he wanted to make her his wife since resorting to anything less would set up a shameful example for the athlete before the masses, which pleased Urashima."}, {"type": "paragraph", "text": "The sumo tournament then started, and Urashima was dominating when Kiku arrived along with Luffy and Zoro. Thinking Kiku had come to watch him, Urashima had his men bring her to him, and silenced the citizens who jeered at Kiku's low status, telling them that their very lives were his to take or tolerate. However, Kiku was disgusted by Urashima and cut off his topknot with her katana."}, {"type": "paragraph", "text": "Enraged at Kiku's actions, Urashima tried to attack her, but Luffy intercepted him and the two engaged in a sumo match. Luffy dodged Urashima's attacks and eventually sent Urashima flying out of the ring and crashing into Holdem's house."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Kiku_Cuts_Urashima%27s_Topknot.png/revision/latest/scale-to-width-down/210?cb=20190915031003", "caption": "Kiku rejects Urashima's proposal and cuts off his topknot."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Luffy_Defeats_Urashima.png/revision/latest/scale-to-width-down/200?cb=20190929033030", "caption": "Urashima is defeated by Luffy."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Urashima vs. another sumo wrestler", "elements": []}, {"text": "Urashima vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 913 (p. 15-17) and Episode 899, Urashima makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 915 (p. 2-3) and Episode 901, Urashima status is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 915 (p. 12).", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 915 and Episode 902.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 916 (p. 4-6) and Episode 902, Luffy stops Urashima's attack.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 915 (p. 11-17) and Episode 902, Urashima competes at a sumo tournament in Bakura Town.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 916 (p. 9) and Episode 903, Urashima fights Luffy.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 916 (p. 3-10, 12-14, 18), Urashima faces Luffy at the sumo ring.", "elements": []}]}], "images": []}]}