{"sections": [{"title": "Tsuru (Wano)", "level": 1, "content": [{"type": "paragraph", "text": "O-Tsuru is a tea house owner who lives in the Kuri region in Wano Country. She is also the wife of Kin'emon."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tsuru has light brown eyes and black hair in a shimada style with a gold crane-shaped hairpin. She has a prominent nose and wears lipstick. She wears a blue kimono with light blue clouds and white crane patterns. She also has large pale blue obi with teal polka dots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Tsuru is a very kind and compassionate woman. Upon seeing Tama being badly poisoned, Tsuru offered to help her. She can be very forceful when helping people as shown when she angrily scolded Tama for refusing to eat the dish she prepared for her. Kiku also stated Tsuru would never accept people refusing her help. Tsuru has an extremely refined and sophisticated personality as she always speaks to people in a courteous manner and is always ready to repay other people for helping her. After Zoro rescued her from some of Kaido's thugs, she quickly offered to repay him, and that she sneaked aboard Komachiyo's tail when Zoro and Luffy retreated in order to not lose sight of them as she wished to express her gratitude."}, {"type": "paragraph", "text": "She is quite perceptive, as she saw through Kikunojo’s disguise and realized her husband was still alive. She is also brave, preparing to risk her own life to protect her husband."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Kin'emon", "level": 4, "content": [{"type": "paragraph", "text": "Tsuru is the wife of Kin'emon. They have known each other since childhood. During their younger years, Tsuru would threaten Kin'emon if he tried taking her money. She was deeply concerned with Kin'emon's well-being, begging him to leave the yakuza and find a normal job and was upset when Kinemon disregarded her advice by claiming no one would care even if he were to die. When he thought that Tsuru was devoured by the Mountain God, Kin'emon furiously attacked the beast, stating that if Tsuru were to die because of his actions he had no right to live. She is extremely faithful to Kin'emon since she did not remarry after 20 years. Kin'emon was glad to hear that she was alright and he is concerned for her well-being as he went to rescue her after seeing Kaido in Kuri. Tsuru already knew about Kin’emon's survival after seeing Kikunojo and she kept it a secret to protect him."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "Like her husband, Tsuru is a loyalist of the Kozuki Family, being nostalgic of the days when the Kozuki Family ruled over Wano Country. Tsuru also did her best to support the Nine Red Scabbards to overthrow Orochi and restore the Kozuki back to power."}], "images": []}, {"title": "Kikunojo", "level": 4, "content": [{"type": "paragraph", "text": "As an employee under Tsuru, Kiku listens to her orders. Kiku is aware she is the wife of Kin'emon and Tsuru knew of her true identity beforehand and kept it to herself."}], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Tsuru was very grateful to Roronoa Zoro for saving her and wanted to repay her debt. She offered to treat his wounds, and she calls him \"Sir Green\". She was also impressed of how Zoro and Monkey D. Luffy managed to ward off Basil Hawkins."}], "images": []}, {"title": "Tama", "level": 4, "content": [{"type": "paragraph", "text": "Tsuru knows Tama and knowing she drank from a contaminated river after seeing her in a seriously ill state, she wanted to treat her at her tea house instead of taking her to a doctor."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the owner of the tea house in Okobore Town, Tsuru has the highest authority within the establishment. She is knowledgeable of herbs, utilizing Jagan Grass (邪含草, Jagan-sō) to brew a medicinal tea to heal Tama from the poison she ingested. She is also an excellent chef, able to cook delicious food from leftover ingredients. She also has enough strength to manhandle Kinemon when they were younger and strike fear into him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Years ago during the Kozuki Family's reign, Tsuru worked as a poster girl for a mountain pass tea house. At one time 41 years ago, three customers were telling her about a moving mountain before showing her a white boar. Tsuru then caught Kin'emon taking her money and reprimanded him."}, {"type": "paragraph", "text": "After Kin'emon stole the white boar from these three men, they took Tsuru hostage. However, on the way down the mountain, they were attacked by the Mountain God. Tsuru and two of the men were swallowed by the beast. After Oden struck down the beast at the Flower Capital, Tsuru reunited with Kin'emon and embraced him."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "At a wasteland in the Kuri region, Tsuru was being chased by Kaido's thugs until Roronoa Zoro came to her rescue. She wanted to repay him, but Zoro was only interested in booze."}, {"type": "paragraph", "text": "She then hid in Komachiyo's tail as Zoro and Monkey D. Luffy were confronted by Basil Hawkins and his men. When the komainu dragged the two Straw Hats away from the battle, she introduced herself to them. Upon seeing Tama in critical condition, she asked them to bring Tama to her tea shop where she could make medicine for her. They later arrived at Okobore Town."}, {"type": "paragraph", "text": "After healing Tama, Tsuru gave her some delicious foods to eat. Tsuru then told Luffy and Zoro the story about Okobore Town before Zoro saved her from an arrow fired by the gifter Batman. During the confusion, Tama was abducted by Gazelleman. As Zoro and Luffy joined Kiku and Komachiyo in the pursuit, Tsuru was amazed by Luffy's ability to stretch."}, {"type": "paragraph", "text": "Sometime after Luffy, Zoro, and Kiku left, a villager visited Tsuru and asked her for some herbs for his ill child. Tsuru was later overjoyed when Luffy's group returned with a cart of food."}, {"type": "paragraph", "text": "When Kaido arrived at Kuri, a villager told Tsuru to flee. After Kaido left, Tsuru tended to an injured man."}, {"type": "paragraph", "text": "Sometime later when Chopper, Momonosuke, Kiku, and Tama brought an amnesiac Big Mom to Okobore Town, Tsuru gave her some food."}, {"type": "paragraph", "text": "Prior to the Fire Festival, Holdem confronted the Okobore Town citizens concerning the Paradise Farm thefts. Assuming that Kin'emon must be alive after meeting Kikunojo, Tsuru attempted to mislead Holdem, but the Okobore Town citizens took the blame for the thefts. Okobore Town was then burned to the ground, leaving Tsuru's fate unknown."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tsuru (鶴, Tsuru) is Japanese for \"crane.\"", "elements": []}, {"text": "Her name is possibly based on Tsuru no Ongaeshi (鶴の恩返し, Tsuru no Ongaeshi lit. \"Crane's Return of a Favor\"), a story from Japanese folklore about a crane who returns a favor to a man.", "elements": []}, {"text": "Tsuru's appearance is reminiscent of people in Ukiyo-e paintings.", "elements": []}]}], "images": []}]}