{"sections": [{"title": "Hasami", "level": 1, "content": [{"type": "paragraph", "text": "Hasami is a giant desert crab who aided Vivi and the Straw Hat Pirates in escaping from Rainbase and Crocodile. He is a friend of Matsuge, and according to Matsuge's and Chopper's translations, he is a pervert."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hasami is giant red crab who is usually seen with a leer on his face. His appearance resembles that of a fiddler crab's, with his right claw being bigger than his left. He has a green patch of grass growing on top of his head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hasami is kind enough to befriend the Straw Hat Pirates, because they were friends with Matsuge. He, like his friend Matsuge, is perverted and finds dancing women motivating."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being a giant crab, Hasami is capable of moving great distances across the vast deserts of Alabasta at high speeds. He travels at even higher speeds when he sees a beautiful woman. Like the rest of his species, however, he cannot swim in or tolerate water."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "Hasami carried the others off to safety while Luffy fought Crocodile, but only got as far as the Sandora River. Despite being unused to water, he was able to get them halfway across the river before sinking when they used \"ero power\" (pervert power) after Nami revealed to him her dancer's outfit when it was learned that Hasami apparently likes dancing girls."}], "images": []}, {"title": "Gedatsu's Blue Sea Adventure", "level": 3, "content": [{"type": "paragraph", "text": "During Gedatsu's mini-story, he is seen working for Goro, bringing clients to the hot springs island resort through Dirt Boss' tunnels."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "Grand Battle! 2", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 176 and Episode 110, Hasami is introduced.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 176 and Episode 110, Hasami is revealed to be Matsuge's friend and identified as a pervert.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 20 Chapter 180 and Episode 111, Hasami sinks as soon as he enters a river.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 36 Chapter 342, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 26, Hasami transfers Goro's clients to Termal Island.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Fiddler crab – Wikipedia article about the type of crab Hasami resembles", "elements": []}]}], "images": []}]}