{"sections": [{"title": "Speed", "level": 1, "content": [{"type": "paragraph", "text": "Speed is a Headliner of the Beasts Pirates who is stationed in Bakura Town. However, she is currently subordinate to Tama due to the latter's Devil Fruit powers."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Speed is a tall woman who due to her Devil Fruit resembles a centaur, with the upper body of a human and the lower body of a horse. The right half of her hair is white while the left half is dark-blue, purple eye irises, a furry tail that is white on the left-side, and dark-blue on the right-side. She also has a light-pink piercing on her left long horse ear, and light-pink goggles on her head. She wears a half-white, half-light-blue jacket that exposes her cleavage, with dark-blue shoulder pauldrons, a short black feather cape, a light-pink pearl-like necklace wrapped around her neck, three sets of light-blue bead bracelets on her left and right wrists, two sets of silver metal armbands on her left and right forearms, white gloves on each hand, and has a saddle on the back of her horse body that has a variety of accessories on it. Whenever she smiles, her mouth resembles that of a horse."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Speed is a serious woman who cares about her duties and can get annoyed if she sees others goofing around. She is also proud because she does not like being given orders. Despite this, she seems cheerful when she is praised and will smile like a horse in a humorous fashion when complimented or treated well. She seems to like explaining her powers to other people, as seen when she boasted about her great range of vision."}, {"type": "paragraph", "text": "After being tamed by Tama, Speed began to affectionately call her \"Master\". She is loyal as she even tried to defend Tama from Kaido."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Speed_Smiling.png/revision/latest/scale-to-width-down/180?cb=20190929033920", "caption": "Speed smiling like a horse."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Headliner in the Beasts Pirates, Speed holds a high position in the crew and has authority over the lower-ranking members, and she is one of the top authorities in Bakura Town along with Holdem and Basil Hawkins."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Speed is a horse SMILE user, giving her the lower body and ears of a horse. Her field of vision is greatly increased as well, with her claiming it to be 350 degrees. Her horse legs make her a very fast runner, and she is also capable of carrying people on her back."}, {"type": "paragraph", "text": "However, since she is part horse, she is susceptible to Tama's animal-taming Devil Fruit power."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Speed carries a bow on her back, although she has not been seen using it. She is shown using it in the anime, and was skilled enough to launch a barrage of arrows quickly."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, she is shown to be capable of Busoshoku Haki, imbuding her arrows with it to boost their power."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Speed went into the Paradise Farm to collect provisions for her and her crewmates stationed in Bakura Town. She heard the fire bell ringing, and ensured that the fire was put out as she arrived at the recently destroyed remains of Holdem's house. She then brought the Treasure Ship of Provisions to Holdem as she asked him what was going on, and watched as her fellow headliner and some of her subordinates were suddenly taken out by Monkey D. Luffy and Roronoa Zoro."}, {"type": "paragraph", "text": "Speed was shocked at Holdem's defeat when Luffy, thinking she was a horse, tried to ride on her back. Speed got angry, but when Tama offered some kibi dango made from her body, she ate it and became subservient to Tama, carrying her and Luffy out of Bakura Town as they made their way to Okobore Town. After Tama ate some food from the Treasure Ship of Provisions, Speed escorted her back to her home."}, {"type": "paragraph", "text": "On the way, both Speed and Tama were attacked by Kaido when the Yonko discovered them. Speed was unable to protect Tama and she was greatly injured. She then traveled back to Okobore Town and collapsed. When Luffy found her, Speed told him what happened. He then put her out of harm's way as he fought Kaido."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/47/Luffy_and_Tama_Ride_Speed.png/revision/latest/scale-to-width-down/210?cb=20191013032058", "caption": "Speed is tamed by Tama and Luffy."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Speed is possibly named after the card game of the same name, fitting with the Beasts Pirates' playing card naming theme.", "elements": []}, {"text": "Speed is the first named SMILE Devil Fruit user who possesses a fruit that has the ability of another already existing Devil Fruit, the Uma Uma no Mi.", "elements": []}, {"text": "Speed's subordinates describe her as \"horse-like\". The word they use is 馬並 (uma-nami, 馬並). It is colloquially used to describe a man who is \"hung like a horse\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 917 (p. 4-5, 10, 14) and Episode 904, Speed makes her debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 914 (p. 15) and Episode 901, Speed is mentioned.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 919 (p. 2-3) and Episode 908.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 917 (p. 5) and Episode 904.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 918 (p. 5) and Episode 906.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 923 (p. 5-6).", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 918 (p. 3-5) and Episode 906.", "elements": []}, {"text": "↑  One Piece Anime — Episode 905, Speed fires Haki-imbued arrows.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 923 (p. 5-6, 9).", "elements": []}]}], "images": []}]}