{"sections": [{"title": "Gazelleman", "level": 1, "content": [{"type": "paragraph", "text": "Gazelleman is a Gifter in the Beasts Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gazelleman is a tall, muscular man with wide shoulders, a large chest, a thick neck, and a square jaw. He wears a skin tight dark shirt with a light colored stylized \"G\" with the letter's leg resembling a \"z\", with light colored long sleeves with a dark line through them. He also wears light colored gloves, a Gifter's cape and cowl, and fishnet stockings over his gazelle like legs."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Gazelleman is somewhat cheerful, especially when he brags about his speed. He has no remorse when kidnapping a child."}, {"type": "paragraph", "text": "Like many other people, he has a distinct laugh: \"Hohohoho\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Gazelleman ate a gazelle SMILE, which grants him the ability to transform his legs into that of a gazelle, enabling him to run at a great speed. He claims that he can go 200 kilometers in an hour. He appears to be lacking in stamina as he was wheezing with exhaustion after delivering Tama to Holdem."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Gazelleman and Batman were tasked with hunting down thieves when they came across Monkey D. Luffy, Roronoa Zoro, Tsuru, Kikunojo, and Tama at Okobore Town. While Batman shot arrows at Tsuru and the others after hearing Tsuru speak ill of Shogun Orochi, Gazelleman kidnapped Tama. He then reported to Holdem that he had captured the girl who tamed their baboon, and Holdem ordered Gazelleman to bring Tama to him. Gazelleman later brought Tama to Holdem as instructed, but he was extremely exhausted after the run."}, {"type": "paragraph", "text": "Prior to the Fire Festival, Gazelleman joined Holdem in confronting the Okobore Town citizens concerning the Paradise Farm thefts."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Gazelleman referred to himself as \"Idaten\" (韋駄天, \"Idaten\"), the Japanese name for Skanda and a term used for fast runners.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 914 (p. 13) and Episode 900, Gazelleman debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 915 (p. 4) and Episode 901.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 914 (p. 13, 16) and Episodes 900–901.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 959 (p. 8).", "elements": []}]}], "images": []}]}