{"sections": [{"title": "Batman", "level": 1, "content": [{"type": "paragraph", "text": "Batman is a Gifter in the Beasts Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Batman is a hefty man. Due to him eating a bat SMILE, some of his features are bat-like, most notably his bat ears, curved fangs, and legs that can transform into bat wings, enabling him to fly while still using his arms (unlike Hildon) for his archery skills. Similar to his fellow Gifters, he wears a horned hood and a dark leather jacket. He has a dark mustache. He also has a quiver on his back."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Batman is very loyal to his crew and the shogun of Wano Country, and would attack anyone who talks badly about them. He is also dedicated to maintaining the social order of Wano, as he tried to prevent the residents of Okobore Town from eating clean food."}, {"type": "paragraph", "text": "Like many other people, he has a unique laughter style: \"Kikikiki\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Archery", "level": 3, "content": [{"type": "paragraph", "text": "Batman is a skilled archer, being able to shoot powerful arrows from the air mid-flight. He was surprised that Roronoa Zoro was able to block his shots, showing he holds his skills in high regard."}, {"type": "paragraph", "text": "In anime he is shown to be able to control the direction of his arrows with sonar."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Batman ate a bat SMILE, which enables him to gain some attributes of a bat. He possesses a pair of large bat wings on his waist which enables him to fly. He also has bat ears which amplify his hearing to six times that of a normal human's, allowing him to overhear people from a great distance."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Batman was shown to be able to use Busoshoku Haki when he blocked Monkey D. Luffy's attack."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Batman and Gazelleman were tasked with hunting down thieves. At Okobore Town, he overheard Tsuru speaking ill about Shogun Kurozumi Orochi and shot an arrow at her, but this attack was blocked by Roronoa Zoro. Batman then fired more arrows at Zoro, but he easily deflected them. During the confusion, Gazelleman kidnapped Tama, and Batman fired arrows at Kiku, Monkey D. Luffy, Zoro, and Komachiyo as they pursued his fellow Gifter."}, {"type": "paragraph", "text": "Later, after Luffy and his group had stolen a cart of food from Bakura Town, Batman, Snakeman, and Rabbitman chased after them into Okobore Town. When they tried to stop the town's citizens from eating the food, Luffy crushed them under a giant water container when he threw it down."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 914 (p. 11-12) and Episode 900, Batman debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 918 (p. 14) and Episode 908.", "elements": []}, {"text": "↑  One Piece Anime — Episode 901, Luffy attacks Batman while chasing Tama.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 914 (p. 11-12, 15) and Episodes 900–901.", "elements": []}]}], "images": []}]}