{"sections": [{"title": "Holdem", "level": 1, "content": [{"type": "paragraph", "text": "Holdem is a Headliner of the Beasts Pirates, who resides in Bakura Town."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Holdem is a large man with long brown hair, a square jaw, cat-like whiskers, and a pointed nose. He does not wear a shirt, exposing tattoos on his upper arms which resemble suns that have a wrench-shaped design inside of them. He wears dark pants, boots, gloves, and a tall dark hat with an insignia on it. His most defining features are the lion head, forelegs, and tail protruding from his waist due to his SMILE fruit. He wears a belt that encases the lion's head and forelegs. Like most SMILE fruit users, Holdem possesses two black horns, though they are difficult to make out amidst his hair."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Holdem_Anime_Concept_Art.png/revision/latest/scale-to-width-down/180?cb=20191007090256", "caption": "Anime Concept Art of Holdem."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Holdem is a brash and no-nonsense man who takes his job seriously and is quick to loudly rebuke his subordinates when they annoy him. He seems to have little empathy, as shown when he decided to try to use Tama's abilities by force, and he is very sadistic, as he became gleeful when threatening to tear Tama apart. Like other members of the Beasts Pirates, he looks down on the lower-class people of Wano. He is also prone to underestimating and condescending people even when he has heard about their feats of strength, as he believed that Luffy only defeated Urashima by luck."}, {"type": "paragraph", "text": "He seems to be quick to jump to conclusions, as he believed that Luffy, Zoro, and Kikunojo were accomplices of the thief Shutenmaru after simply seeing Luffy's display of strength. He also holds grudges, as one of his main reasons for attacking Luffy was that the pirate destroyed his house."}, {"type": "paragraph", "text": "Like many One Piece characters, he has a unique laugh: Gahahaha."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Kamijiro", "level": 4, "content": [{"type": "paragraph", "text": "Kamijiro is the lion head on Holdem's stomach. Due to their conflicting personalities, Kamijiro frequently fights with Holdem, overlooking the fact that the pain they deal to each other also hurts themselves."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6a/Kamijiro_Attacks_Holdem.png/revision/latest/scale-to-width-down/200?cb=20190908033855", "caption": "Holdem and Kamijiro quarreling with each other."}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "Due to Kaido forming an alliance with Kurozumi Orochi, Holdem and the rest of the Beasts Pirates are enemies of the Kozuki Family. He believes the Kozuki Family to be a \"family of evil\"."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "As they attempt to overthrow Kaido, Holdem and the rest of the Beasts Pirates are enemies of the Straw Hat Pirates. However, due to the isolated nature of Wano, he did not recognize their faces and assumed they were part of Shutenmaru's group of bandits. When Luffy and Zoro were causing trouble in Bakura Town, Holdem decided to use Tama as a hostage to force them to surrender. However, Holdem's plan backfired and when Luffy heard how Holdem harmed Tama, Luffy quickly attacked him."}], "images": []}, {"title": "Tama", "level": 4, "content": [{"type": "paragraph", "text": "Due to her ability to tame animals, Holdem decided to kidnap Tama. He even resorted to torture to force Tama to use her ability. He also threatened to kill Tama when confronting Luffy, Zoro, and Kiku."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Headliner in the Beasts Pirates, Holdem holds a high position within the crew and is capable of commanding lower-ranking subordinates."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Holdem showed some physical strength. After Urashima crashed through Holdem's house and fell on him, Holdem was able to lift the huge sumo wrestler off of himself."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Holdem ate a lion SMILE, giving him the ability to generate a lion's head and forelegs on his waist, as well as a tail on his back. Kamijiro possesses great strength in his paws and jaw, with Holdem stating that he could easily crush Tama with the latter. Kamijiro also possesses the ability to breath a large stream of fire, which Holdem calls Shishi no Hi (獅子の火, Shishi no Hi, literally meaning \"Lion Fire\"). However, Kamijiro has a mind of his own, putting Holdem at risk of being attacked by him. However, damage dealt by the lion will also hurt him, as he shares the same body as Holdem."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Holdem carries a long sword with a star-shaped guard, and is seemingly proficient in using it, as he was confident in its power when attacking Luffy. However, he was unable to use it before Luffy took him out. He calls his blade the \"Karakuri Sword\" (, Karakuri-tō). In the anime, it was shown to be able to split itself up to function as a whip blade, which can be set on fire by Kamijiro for extra damage."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Hellfire Edge (, Hellfire Edge): An anime only technique, Holdem coats his whip-like blade with Kamijiro's fire and attacks his opponent with it.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Gazelleman kidnapped Tama at Okobore Town, he reported to Holdem that he had captured the girl who tamed their baboon, and Holdem ordered Gazelleman to bring Tama to him. Gazelleman brought Tama to Holdem's quarters, and Holdem was annoyed at the Gifter's exhaustion after running. He then got mad at Kamijiro for staring at him, and the defiant lion responded by striking Holdem in the groin, hurting both of them. Holdem wanted to know how Tama managed to tame their baboon, and suspected that she had a Devil Fruit power despite her denial. He ordered a subordinate to get him some pliers so he could try pulling food out of her cheek."}, {"type": "paragraph", "text": "As Holdem was pulling on Tama's cheek, he received a report that the yokozuna Urashima had been attacked, but did not care. However, Urashima was then sent flying into Holdem's house by Monkey D. Luffy, and an annoyed Holdem confronted Luffy, putting Tama into Kamijiro's mouth and threatening to crush her."}, {"type": "paragraph", "text": "After Holdem accused Luffy's group of being accomplices with the thief Shutenmaru, Luffy managed to attack Kamijiro in the blink of an eye and free Tama. Soon afterwards, Luffy turned around to attack Holdem, and Holdem had Kamijiro breathe fire at the pirate as he prepared to strike Luffy with the Karakuri Sword. However, the flames were ineffective against Luffy, who struck Holdem in the face with a powerful Red Hawk punch, defeating him. Kamijiro remained conscious as Holdem laid unconscious on the ground."}, {"type": "paragraph", "text": "When he woke up later, he saw Kaido in Kuri and shook in fear, wondering if Kaido had come to execute him. He was then stunned to see his captain destroy the ruins of Kuri Castle."}, {"type": "paragraph", "text": "Several days later, Holdem ordered his men to set Mt. Atama on fire in order to kill Shutenmaru. Holdem heard about important events happening at the Flower Capital and ordered his men to turn on the Picture Tanishi to watch a broadcast. Holdem also commented that he wished he could show Shutenmaru dying in a fire to the whole country. Holdem later watched the broadcast of Yasuie's execution."}, {"type": "paragraph", "text": "Prior to the Fire Festival, Holdem confronted the Okobore Town citizens concerning the continued thefts from Paradise Farm. Tsuru approached Holdem, claiming that she would help him, but the Okobore Town citizens took the blame for the thefts. Holdem then burned Okobore Town to the ground."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6f/Luffy_Punches_Holdem.png/revision/latest/scale-to-width-down/210?cb=20191006031602", "caption": "Luffy strikes Holdem with Red Hawk."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Holdem and Kamijiro vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hold 'em is one the three main types of poker (the other two being draw and stud). Particularly, Texas hold 'em is sometimes simply called \"hold'em\". This follows the Beast Pirates' naming theme of card games.", "elements": []}]}], "images": []}]}