{"sections": [{"title": "Goro", "level": 1, "content": [{"type": "paragraph", "text": "Goro is Toto's younger brother and Koza's paternal uncle. He appeared in Gedatsu's cover story."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Goro is a man who is a bit overweight and looks similar to his older brother. He has short hair and a beard. He wears a light colored shirt with a hot springs symbol on it. He has dark colored pants and a cloth over his shoulders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Goro_Digitally_Colored_Manga.png/revision/latest/scale-to-width-down/150?cb=20140803092728", "caption": "Goro in the Digitally Colored Manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "His dream was to open a hot springs resort, which he was able to do with Gedatsu's help. He seems to be very tolerant with Gedatsu, who made a bad first impression when he started to work under Goro, due to Gedatsu's rather odd behavior. "}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Goro was shown to have great strength and stamina, as he was able to build a hot springs resort."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Gedatsu's Accidental Blue-Sea Life", "level": 3, "content": [{"type": "paragraph", "text": "While digging around and looking for a hot spring under the ground, Goro suddenly encountered Gedatsu after the latter fell down from Skypiea. Together, the two went about digging for the hot spring. After countless attempts, Goro and Gedatsu come across the Dirt Boss, and with his help, they finally succeed in locating the hot spring. Afterwards, they came across the Forest Boss, who also began to help build the hot spring resort."}, {"type": "paragraph", "text": "However, while digging, the Dirt Boss accidentally brought Goro and Gedatsu back to an oasis in Alabasta. By coincidence, the oasis happened to be Yuba, where his brother Toto and nephew Koza lived."}, {"type": "paragraph", "text": "Afterwards, he went back to his island alongside Toto, Koza, and Karoo to inspect the progress of the hot spring resort. To their surprise, the Forest Boss and his fellow baboons had already completed building the entire resort."}, {"type": "paragraph", "text": "As such, he then set about opening the tunnel that would connect Alabasta to his resort island. He would then employ Hasami to act as the transportation through the tunnels."}, {"type": "paragraph", "text": "After returning to the island, he and the others enjoyed the hot springs alongside Pell, Igaram, Chaka, and the rest of the Super Spot-Billed Duck Troops."}, {"type": "paragraph", "text": "As such, with Gedatsu's help, Goro was finally able to open the hot springs resort of his lifelong dream."}], "images": []}]}