{"sections": [{"title": "Mouseman", "level": 1, "content": [{"type": "paragraph", "text": "Mouseman is a Gifter in the Beasts Pirates. He resides in Bakura Town."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mouseman is an average-sized man with a long face. He has bushy light hair and a thin beard and mustache. He wears a dark vest and a pair of aviator goggles on his forehead, and due to his Devil Fruit, he has two large mouse ears."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mouseman is a staunch supporter of Wano Country's social hierarchy, and so convinced the yokozuna Urashima to use his high status to ensure that the commoner woman Kiku would marry him no matter what, even suggesting that he kill and destroy everything close to her so he would be the only one who could support her."}, {"type": "paragraph", "text": "While he does support Urashima's high standing and suggesting him to take full advantage of it, Mouseman is not above insulting such people, as he made a passive remark of how Urashima was an idiot for taking too much into consideration of taking Kiku."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Mouseman ate a mouse SMILE Devil Fruit, which has given him the ears of a mouse. It is unknown what abilities the fruit gives him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Mouseman was eating with the yokozuna Urashima in a restaurant in Bakura Town. Urashima talked about how he wanted to marry a girl named Kiku from Okobore Town, and Mouseman said that he could use his high status to do anything he wanted with her and leave her no choice but to become his wife."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 915 (p. 2-3) and Episode 901, Mouseman makes his debut.", "elements": []}]}], "images": []}]}