{"sections": [{"title": "Toto", "level": 1, "content": [{"type": "paragraph", "text": "Toto is Koza's father, Goro's older brother, and by the start of the series, the only man left living in the deserted city of Yuba."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Originally, Toto was a relatively fat but healthy looking old man. However due to the three year drought brought about by Crocodile's scheme, Toto's body had completely shriveled up from thirst and starvation to a point that he no longer resembled his former self. He has an elderly looking face, and a thick fuzzy mustache. He wears a white wrap around his head, and another grey wrap around his forehead. He wears black robes, that are torn in some places, and a green robe underneath with a dark red lining. Under that, he wears a vertically striped black and white shirt. He also has a turquoise sash, with blue dots."}, {"type": "paragraph", "text": "After the timeskip, Toto is seen wearing a light colored wrap around his head, and a dark colored robe, with a light colored striped robe with buttons underneath. He seems to recovered from his shriveled self and looks normal, though not quite to the level of fat he had in his youth. He has also grown a small goatee, and is wearing a light colored sash."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Toto is a rather kindhearted man and generous man, willing to help travelers to Yuba without a second thought, in spite of the city's massive shortage of water. He also possess a remarkable stubbornness and willingness to stand by his beliefs, staying in Yuba as all its other resident's left, refusing to accept that the city was doomed."}, {"type": "paragraph", "text": "He is a staunch monarchist, and stood by his king throughout the years leading up to the rebellion, referring to the rebels(led by his own son) as a bunch of \"Fools\" and \"Degenerates\". Even before he got to know cobra personally, he was willing to offer up his own life as punishment for his son when the boy got into a fist fight with the crown princess. "}, {"type": "paragraph", "text": "He also is willing to lay down his life for things he believes in or cares about, staying in Yuba even as the city became a ghost town (risking dying from starvation or dehydration), as well as offering his own life instead of his son, when he (falsely) believed that Cobra would wreak retribution on the boy."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Toto has shown to greatly love his son, Koza, being more than willing to lay down his life for the boy after he got into a fight with crown princess, Vivi. Despite this, he refused to join his son in the rebellion against the royal family, steadfastly refusing to join the rebels no matter what accusations were raised against King Cobra."}, {"type": "paragraph", "text": "He had a wife named Aswa and a brother, Goro."}], "images": []}, {"title": "Nefertari Cobra", "level": 3, "content": [{"type": "paragraph", "text": "Originally, though a man very loyal to the royal family, Toto was deeply afraid of Cobra due to the great distance between his and the king's social statuses. He was usually afraid that Cobra would enact some great punishment of sorts if ever he or his son, Koza, would step out of place. However, after getting to know Cobra and his daughter, Vivi, personally, Toto came to greatly admire the king. By the time he left for Yuba, the two had become good friends and ever since then, Toto had great faith in Cobra. Even when all of the misfortunes of Alabasta and evidence falsely planted made Cobra seem like he had become a tyrant, Toto continued to believe in Cobra and the royal army of Alabasta despite protests from his son and others."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Meeting the King and the Birth of Yuba", "level": 4, "content": [{"type": "paragraph", "text": "Eleven years ago before the current time line, Toto was once a humble villager whose village had dried up. His son, Koza, angry with the situation went to Cobra's palace in Alubarna and complained to the king why he did not do anything. Hearing what a rude thing his son did, Toto hurriedly rushed to the palace. There, he asked forgiveness for Koza's rudeness, took all responsibility, and prepared himself for any punishment. Instead of punishment however, Cobra told Toto that the country will temporarily guarantee the lives of the villagers that were hurt by the drought. Cobra then told Toto that he and other villagers would come temporarily live in Alubarna until a solution was found. Grateful, Toto asked his son to bow down for Cobra's generosity. However, despite Koza's continued rudeness towards Cobra, Toto was told by the king that Koza was just a good boy at heart who cared for the sake of his fellow villagers."}, {"type": "paragraph", "text": "As plans for the use of the budget on how to support the villagers were laid out, Toto was suddenly shocked to hear that his son, Koza, had gotten into a fight with the daughter of Cobra, princess Nefertari Vivi. Taking responsibility, Toto offered to commit suicide in order to apologize for Koza's outrageous behavior. Toto however was instead beat up along with Igaram by Cobra for their outbursts towards this news. Cobra told them that this was merely a kid's fight and they shouldn't take it too seriously."}, {"type": "paragraph", "text": "Toto, his family, and the rest of the villagers were provided support and lodging in Alubarna as promised until a solution to their problem could be found. While living there, Toto experienced how easily the royalty of Alabasta mingled with the common folk as he saw how Koza and Vivi become very good friends, and how even the king acted merely like a concerned father rather than some high and exalted official. Toto then witnessed more of this and how good the royalty was after an incident where Vivi was almost kidnapped and his son was injured in the process. Toto saw how Vivi was more afraid of losing her friend, Koza, than being kidnapped herself."}, {"type": "paragraph", "text": "After much planning with the king, Toto and Cobra had found a solution to his and his villagers problem. They decided that Toto and other villagers settle in an oasis found in western Alabasta. There, they planned to create a town called Yuba, which would be an intersection of great commerce as all sorts of merchants would come and go through it. With such a dream, Toto himself volunteered to spearhead the creation of the town. As Toto and the other villagers prepared to leave Alubarna to create the village, Toto shook hands with Cobra with a wish of good luck from his majesty. In response, Toto promised Cobra that he would create a superb town that would help the kingdom of Alabasta prosper."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/55/Toto_Invited_to_Live_in_Alubarna.png/revision/latest/scale-to-width-down/240?cb=20130918202802", "caption": "Cobra invites Toto and his fellow villagers to take refuge in Alubarna."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Cobra_Wishes_Toto_Luck.png/revision/latest/scale-to-width-down/250?cb=20130918203053", "caption": "Toto is wished good luck by Cobra."}]}, {"title": "The Drought and The Rebellion", "level": 4, "content": [{"type": "paragraph", "text": "When Nefertari Cobra was implicated of stealing Alabasta's rain through false evidence, Toto refused to believe it. Instead, he and some others tried to convince his son, Koza, who had become leader of the rebellion, and the other rebels to stop. However, the town of Yuba suddenly became plagued by several sandstorms caused by Crocodile's scheme. These caused the oasis to dry up and trade with the town thus stopped. Unable to live there, the rebellion and the rest of the villagers eventually left Yuba. Only Toto stayed behind in hopes of reviving the town by digging for water to restore the oasis. However, because he constantly dug alone in the sandstorm plagued town, his body had completely shriveled to a form unrecognizable of his former self."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three years later as Toto continued to dig for water, the Straw Hats and the rest of their party came to Yuba, after the latest sandstorm attack, and asked if this was where they could find the rebellion. Thinking they were people wanting to join the rebellion, Toto angrily threw stuff at them and told them that the rebels had left Yuba because of its current state. He told them that they had moved to Katorea, an oasis located near Nonohana. As Toto stated this, he overheard Vivi's name being muttered and realized that she was in the group. Teary eyed, he told the princess, who no longer recognized him, that he still believed in Cobra and that the rebellion was absurd. He then asked her to stop them as they were now ready to attack Alubarna and sacrifice their very lives."}, {"type": "paragraph", "text": "Vivi accepted Toto's request and his prayers were answered. Later that night, as most of the Straw Hats' party were resting in an inn somewhere in Yuba and Toto continued digging, Toto was visited by Luffy. Luffy told Toto that he noticed that there was no water around and that Yuba must be very hard to live in. Toto however reassured Luffy that water will come as he believed that Yuba would not be destroyed by mere sandstorms. He told Luffy he will just dig up the water again as Yuba was the land given by Cobra to him. Moved by Toto's words, Luffy decided to help dig for water. Despite Luffy unintentionally throwing sand into Toto's hole while digging and not exactly understanding the concept of digging a hole itself, the two toiled through the night. Though Luffy fell asleep while digging due to fatigue, Toto noticed that they had made some progress and had made it the water level. Seeing water, Toto squeezed out what little water he could get out of the sand, distilled it, and placed it in a small barrel."}, {"type": "paragraph", "text": "The next day, as the Straw Hats' party was about to leave, Toto apologized to Vivi for the way he initially acted last night. Vivi however told him to not to worry about it. Toto then gave the Straw Hats' party the barrel with the water and explained to them of the progress he and Luffy made last night. The sight of the barrel delighted the Straw Hats and Toto was thanked for the little gift. After that, the Straw Hats' party left Yuba and Toto continued on digging up the oasis."}, {"type": "paragraph", "text": "Eventually Toto was able to dig up more water from the oasis that it formed a small puddle. This delighted Toto very much. However at the very exact same time Toto found some water, Crocodile sent a massive sandstorm in the direction of Yuba as he was fighting Luffy. The massive sandstorm reached Yuba and threatened to destroy it all. However instead running away, Toto merely stood before the sandstorm and shouted at it that no matter how many of them come Yuba would not be destroyed by mere sand. As he shouted this, Yuba and everything in it was engulfed by the sandstorm."}, {"type": "paragraph", "text": "Despite the destruction the sandstorm left behind, Toto was able to survive the disaster. As he sat in the ruins of Yuba, Toto saw a miraculous sight. Rain started falling again all over in Alabasta. Overjoyed by the long awaited sight, he now wondered where his son, who was separated from him by the three long years of drought, was at that moment."}, {"type": "paragraph", "text": "After the whole incident with Crocodile was over, Yuba once again became populated and Toto was reunited with his son, Koza. As Toto and Koza started slowly rebuilding their life, they were told that Vivi would make a speech to the entire kingdom of Alabasta. On the day that the speech was to be commenced, Toto told his son to hurry up and come listen on. Koza however replied to his father that since the speakers, that were being used to broadcast Vivi's speech, were so loud that he could still hear the speech from where he was recuperating. Toto, along with the rest of Alabasta, then listened on to Vivi's speech and were all delighted by it. Although some parts of the speech were not understandable to most, Toto and his son however knew what was being talked about. Hearing such things about the Straw Hats, Toto laughed out loud with joy. Not understanding why Toto was laughing, his fellow villagers asked him why. In response however, Toto stated it was a secret and Koza responded lyingly as well that his father had went mad from the sandstorms. While looking at the wonderful sky and into the distance, Toto from afar wished Luffy to take care and invited him to come drink some water from Yuba if he ever had time to. Happy to have peace once again in Alabasta, Toto and his son continued on to restore Yuba to the glory it once was."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2c/Toto_Gives_Luffy_Water.png/revision/latest/scale-to-width-down/250?cb=20130922075251", "caption": "Toto gives Luffy the water they dig up."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Gedatsu's Accidental Blue-Sea Life", "level": 4, "content": [{"type": "paragraph", "text": "While continuing to live peacefully, Toto and the rest of Yuba were surprised one day when a giant mole came out of the oasis they had restored. To Toto's surprise, the mole was ridden by his younger brother, Goro, who had happened to come back home with the help from the mole, the Dirt Boss, and his associate, Gedatsu. Hearing that his brother had finally found the hot spring he wanted to make on the island he went to, Toto, along with Koza and Karoo, Vivi's pet duck, decided to accompany his brother and his associates back to the island through the tunnel the Dirt Boss dug to inspect the hot spring. Upon arriving there, they found out that the Forest Boss, a mandrill associate of Goro, and his followers had turn the hot spring into a magnificently built establishment. Happy with what they found, a tunnel connecting to the island, Ukkari, was opened so that the citizens of Alabasta could enjoy the luxurious hot spring resort with the giant sand crab Hasami as the main mode of transportation. Eventually, news of this hot spring reached the Alabasta royalty and Vivi and her entourage came for a visit. Together with his brother, his son, and Vivi's entourage, Toto enjoyed the benefits and luxuries of the hot spring resort."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Toto_And_Goro_Reunited.png/revision/latest/scale-to-width-down/250?cb=20110220022758", "caption": "Toto is reunited with his brother, Goro."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Toto stood next to his son Koza, who had become the Environmental Minister of Alabasta."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Nefertari Family departed Alabasta for the upcoming Levely, Toto commented that Vivi was enthusiastic about going out to sea."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Starvation – Wikipedia article about the causes and effects of starvation; such as Toto's appearance.", "elements": []}, {"text": "Malnutrition – Wikipedia article about the causes and effects of malnutrition; such as Toto's appearance.", "elements": []}, {"text": "Dehydration – Wikipedia article about dehydration that affected Toto's appearance in particular.", "elements": []}]}], "images": []}]}