{"sections": [{"title": "Nola", "level": 1, "content": [{"type": "paragraph", "text": "Nola is a giant snake native to Jaya who - along with the Shandia - became a denizen of Skypiea after half of Jaya was launched into the sky by the Knock Up Stream."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Four hundred years ago, it was the size of a normal adult python."}, {"type": "paragraph", "text": "Now Nola is bigger than most buildings and is long enough to reach out to the sky well above the trees of Skypiea (which alone are massive themselves). Nola is supposedly much bigger than its ancestors."}, {"type": "paragraph", "text": "Its head alone is large enough that people may dance on top of it, and its insides are so large they form a tunnel big enough for people to walk side by side down with no room restrictions."}, {"type": "paragraph", "text": "It is blue in color with a single row of white hair on both sides, along the body. It has small, yellow eyes, and two long barbels hanging from the spot above her mouth, like a mustache. It also has dark blue wavy lines across the top of its body."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nola is noted to be hot tempered and easily aggressive towards everything, attacking what crosses its path. Its foreboding and fearsome stance has earned it the title of \"Master of the Sky\"."}, {"type": "paragraph", "text": "Though fierce and violent, deep beneath Nola's intimidating appearance lies a much gentler creature. When it was young it used to call out to the Shandorian Golden Belfry Bell as the sound made it happy. Upon hearing the bell for the first time in four hundred years, it proceeds to become much happier and once again returned to the gentle self it had been as a child, singing out to the sound of the bell."}, {"type": "paragraph", "text": "It is later seen after Enel's defeat dancing round a fire with the Shandia and Skypieans (some of which were on its head). This is noted as strange behaviour by other characters."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [{"type": "paragraph", "text": "Nola was fond of Noland and Kalgara. Later, it also befriended Seto. When it awoke from being knocked out by the ordeal, its memories of her childhood and seeing Kalgara and Seto walking away from it, and it being unable to catch up, made it charge at Giant Jack with tears in its eyes."}, {"type": "paragraph", "text": "It appears to have befriended Conis, Aisa, and Raki and was seen taking a stroll with them in the Where They Are Now mini-series."}], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Nola is the grandchild of Kashigami, the previous \"God\" of the Shandia."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Nola is a powerful beast able to best even strong warriors like Wyper and Zoro easily. On top of her incredible strength to match its size, it also emits a powerful corrosive venom from its mouth. Its scales are also stronger than steel itself, as Zoro could not inflict any damage with his swords, and Wyper could not damage them with his Burn Bazooka. Though it is strong, this strength is not superior to the destructive force of a Reject Dial, as evidence of its failure to knock over Giant Jack. It is no match to Enel's lightning powers. As demonstrated by Luffy, Nola is rather vulnerable on the inside of its body, as it writhed in total agony as Luffy tried punching his way out while inside of Nola."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Nola%27s_Venom.PNG/revision/latest/scale-to-width-down/190?cb=20160218152437", "caption": "The effect of Nola's venom on a tree"}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Nola was originally discovered by Noland's men, and identified by Kalgara as the snake-god's grandchild. Nola lived in the remains of the city of Shandora and would constantly follow Kalgara and Noland around. Every time the bell of Shandora was rung, it would call out to the sky in happiness. Some time after Noland left, the Shandia named it \"Nola\" after Noland."}, {"type": "paragraph", "text": "This carefree life ended, however, when the half of Jaya island containing Shandora was launched into the sky by the Knock Up Stream. Never again would Nola or the Shandia lay eyes on Noland, who was executed by his own kingdom as a liar; meanwhile, the displaced Shandora was overrun by land-hungry Skypieans, against whom Kalgara eventually fell."}, {"type": "paragraph", "text": "Having outlived both its human friends, Nola spent the next four hundred years in the forests of what came to be known as Upper Yard; reverting to primal instincts, it came to surpass its ancestors in size and savagery. For this, it was dubbed \"Master of the Sky\" by both the Skypieans and the surviving Shandia."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Young_Nola.png/revision/latest/scale-to-width-down/190?cb=20100612133146", "caption": "Nola with Noland and Kalgara."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Skypiea Arc", "level": 4, "content": [{"type": "paragraph", "text": "Nola unknowingly took part in the survival game set up by Enel and is one of the few who manages to reach the Upper Ruins, and during its trip up there, accidentally eats Luffy (who at first thinks its stomach is a cave), Nami, Aisa, and Gan Fall, but they eventually escape."}, {"type": "paragraph", "text": "During the climax where Luffy needed to reach Enel's ship by knocking down the Giant Jack (a giant beanstalk), spurred on by the visions of its youth, Nola helps the heroes by ramming into it, knocking itself out in the process. Its efforts, however, weakened the beanstalk enough for Wyper to give the final blow with a Reject Dial."}, {"type": "paragraph", "text": "After Luffy rang the bell, Nola cried out in happiness. It was later seen celebrating with the Skypieans and Shandia around a fire. After the party, Nola slept heavily; while it was sleeping the Straw Hat Pirates went inside its mouth and retrieved the gold from inside before it awoke."}, {"type": "paragraph", "text": "She later traveled on the Vearth with Raki, Conis, and Aisa."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Celebrating_After_Enel%27s_Defeat.png/revision/latest/scale-to-width-down/210?cb=20130308040709", "caption": "Shandia and Skypieans celebrate the end of their long lasting war."}]}, {"title": "Two Years Later", "level": 3, "content": [{"type": "paragraph", "text": "Nola has been accepted by the Shandia, and it has become a living attraction for Rubber Band Land. Its height has made it the perfect candidate to be a part of the popular bungee jumping attraction. The attraction is called Nola-Bungee, which Shandia children enjoy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Nola_Working_as_a_Slide.png/revision/latest/scale-to-width-down/125?cb=20130304222043", "caption": "Nola-Bungee"}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Nola is the second oldest living creature in One Piece, being more than 400 years old. The longest living creature is Zunesha, the elephant carrying the island of Zou.", "elements": []}, {"text": "Despite the fact that Nola has very strong and corrosive poison, real life pythons are actually not venomous.", "elements": []}, {"text": "Although it grew to an enormous size over her life, it started out the size of a normal snake.", "elements": []}, {"text": "Nola was named by Seto after \"Noland\".", "elements": []}]}], "images": []}]}