{"sections": [{"title": "Choco Police", "level": 1, "content": [{"type": "paragraph", "text": "Choco Police is the policeman in charge of watching over Chocolat Town on Cacao Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Choco Police is a relatively large and plump man, being taller than Pudding in height. He has a disconnected mustache that is relatively pointy and sticks up, as well as a similarly pointy black goatee. He wears a giant hat with brown edges and a cream-like top. He also wears a brown suit, yellow button-up shirt with an orange tie, and beige pants with brown boots. Also, he wears a large pink floral decoration on the left side of his suit."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Choco Police is a very caring person as he told Pudding to take it easy and not to overwork herself with the wedding preparations. This caring nature is further shown later on when he tried to comfort Pudding upon her post-wedding return to Chocolat Town, thinking that she would be sad that the wedding had been ruined. He also felt happy for her before her wedding, as seen when he congratulated her in person and then congratulated her in spirit, showing that, like the rest of the town, he cared deeply for her happiness."}, {"type": "paragraph", "text": "In the anime, Choco Police was seen crying while thinking about Pudding's ruined wedding, further emphasizing his caring nature."}, {"type": "paragraph", "text": "Furthermore, Choco Police has a strong sense of duty as he was furious when he discovered Luffy and Chopper committing snackalism. However, he still allowed them to explain their reasoning, which shows that he can, at times, be lenient. Afterwards, when he learned of the supposed truth behind them eating the café, he apologized to them, showing that he is not an unreasonable person."}, {"type": "paragraph", "text": "Like most of Totto Land, he is oblivious to Pudding's true nature and believes that she is an innocent girl."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/82/Choco_Police_Cries.png/revision/latest/scale-to-width-down/180?cb=20180904031342", "caption": "Choco Police cries for Pudding."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a police officer in charge of security in Chocolat Town, it can be assumed that Choco Police has some authority. Although he is not seen using a weapon, it can be assumed that he can, as he may need one to enforce the law."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Luffy and Chopper entered Chocolat Town and started eating the chocolate surroundings, Choco Police confronted them after they ate an entire café. He angrily complained that if they had only eaten the walls of the café, then it could have been replaced later, but instead they ended up eating the entire café. He trembled from anger while yelling at them for not only eating all the chocolate, but also eating everything from candy and marshmallows to almonds and jellybeans. Afterwards, he yelled to them that they had committed the crime of snackalism and that they had to go with him for questioning, to which Luffy interrupted by saying that they had a very good reason. Seeing as they were willing to explain, Choco Police allowed Luffy to state his reason, but after the two criminals said that it was just too good to stop eating, he erupted into a fury of anger and told them that they were under arrest. However, as he prepared to handcuff the two, he was suddenly asked to stop by a girl flying in on a carpet. He then paused and looked into the sky and, to his surprise, saw that it was the owner of the café and daughter of Big Mom, Pudding. After Pudding landed, he tried to explain the situation to her, but to his confusion, she complained to the two supposed criminals about how they had not kept their promise to her and had left too much of the café behind. Hearing this, Choco Police came to the realization that Luffy and Chopper were hired by Pudding to dismantle the expiring café, and as such, he apologized for the trouble. He then happily turned to the two \"hired dismantlers\" and told them that they should have put up a sign to inform the public as there were still customers inside. As he prepared to leave, he congratulated Pudding on her nearing marriage and told her to not tire herself out making preparations for the wedding."}, {"type": "paragraph", "text": "A few days later, as the whole country began to celebrate two and a half hours before the wedding, Choco Police danced around and happily wished congratulations to Pudding, to which another partying civilian told him that it was not even time yet."}, {"type": "paragraph", "text": "Later, after the Straw Hats ruined the supposed wedding ceremony, Pudding arrived back at Chocolat Town along with a handcuffed Chiffon and a hidden Sanji. Upon their arrival, they were greeted by Choco Police, who expressed his sympathy for her as he had heard of the ruined wedding. He then began to worry what would happen with Big Mom's hunger rage occurring before informing her that the WCI 31 had arrived on the island and were waiting for her instructions."}, {"type": "paragraph", "text": "After news arrived that Big Mom's hunger tantrum had ended and that Totto Land had been saved by the efforts of Pudding, Choco Police was seen wiping away tears and thanking Pudding for saving the country."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7c/Choco_Police_Confronts_the_Criminals.png/revision/latest/scale-to-width-down/300?cb=20180904034112", "caption": "Choco Police prepares to arrest Luffy and Chopper."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Pudding explains to him that Luffy and Chopper were the demolition crew hired to take down the café because it was expiring, whereas in the manga, Choco Police comes to this revelation by himself and then confirms it with Pudding."}, {"type": "paragraph", "text": "Later, when Pudding returned to Chocolat Town with Chiffon in tow, Choco Police's role is expanded. One such scene is when he is surprised that the traitor Chiffon is there and, as such, Pudding explained that Chiffon was not a culprit, to which he hesitantly believed. Another scene that is added is when some dogs started barking because they smelled Sanji hidden inside Rabiyan and so Pudding grabbed Choco Police's hand to distract him and then asked him to take her to the Sweet Factory. Later, outside the Sweets Factory, a scene is added in which he and the other citizens swore not to let anyone look inside the factory as the chefs prepared to bake."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/31/Pudding_Holds_Choco_Police%27s_Hands.png/revision/latest/scale-to-width-down/180?cb=20180904031427", "caption": "Choco Police blushes after Pudding grabs his hands."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In line with the theme of Cacao Island, Choco Police's title is related to chocolate and he dresses in the color of chocolate.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 82 Chapter 827 (p. 7-10) and Episode 786, Choco Police debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 88 Chapter 880 (p. 2-3) and Episode 852, Choco Police escorts Pudding to the Sweets Factory.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 859 (p. 14) and Episode 829, Choco Police gives his congratulations before the wedding starts.", "elements": []}, {"text": "↑  One Piece Anime — Episode 852, Choco Police talks to Pudding on their way to the Sweets Factory.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 89 Chapter 900 (p. 8) and Episode 875, Choco Police cries out of joy at the news of Totto Land being saved.", "elements": []}]}], "images": []}]}