{"sections": [{"title": "Kamijiro", "level": 1, "content": [{"type": "paragraph", "text": "Kamijiro is a lion's head, legs and tail that are attached to Holdem's body due to his consumption of a lion SMILE."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kamijiro's entire body consists only of a lion's head, two legs and a tail growing from Holdem's stomach. His mane is striped and circular. The tuft of his tail is also striped and is about the size of his head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kamijiro has a mind of his own, allowing him to act independently of Holdem. Much like Holdem, though, he is very violent and quick to anger. However, his rage can sometimes make him act rashly, as shown when he attacked Holdem even though the attack would also harm himself. It is implied by Holdem's subordinates that Kamijiro is not very intelligent, given that he does not seem to realize that he and Holdem share the same body, and share each other's pain."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Holdem", "level": 3, "content": [{"type": "paragraph", "text": "Kamijiro shares a body with Holdem after the latter consumed a SMILE Devil Fruit, and so the two normally act in tandem. Kamijiro usually obeys Holdem's commands during battle and when dealing with enemies. However, the two's similar personalities can cause them to sometimes get annoyed with and attack each other, even though they share the same body."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Though he is limited by only going where Holdem goes, Kamijiro possesses tremendous strength that assists Holdem greatly in battle. His legs appear to be quite powerful, as shown when he swiped Holdem in the groin and caused both of them great pain. He can retract his legs into Holdem's body."}, {"type": "paragraph", "text": "His jaw is also extremely strong, as Holdem stated that he could crush and tear apart Tama easily with it."}, {"type": "paragraph", "text": "Kamijiro also possesses the ability to breathe a large stream of fire, which Holdem calls Shishi no Hi (獅子の火, Shishi no Hi, literally meaning \"Lion Fire\")."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Holdem had a young girl named Tama brought to his headquarters, and hit Kamijiro after getting annoyed at the lion staring at him. Kamijiro got angry and retaliated by hitting Holdem in the groin, but this hurt the lion as well since he shared the same body with Holdem."}, {"type": "paragraph", "text": "Later, Holdem's house was destroyed when Monkey D. Luffy sent the yokozuna Urashima flying into it, and Kamijiro held Tama in his mouth as Holdem confronted Luffy. Holdem threatened to have Kamijiro crush Tama in his jaws if Luffy moved, but Luffy moved and hit Kamijiro in the blink of an eye as he freed Tama from his grasp. Luffy then turned around to attack Holdem, who had Kamijiro breathe fire at him. However, Luffy emerged from the flames unharmed and punched Holdem in the face, defeating him. Kamijiro remained conscious as Holdem laid unconscious on the ground."}, {"type": "paragraph", "text": "When Holdem woke up later, both Kamijiro and Holdem saw Kaido in Kuri and shook in fear before witnessing the complete destruction of Oden Castle."}, {"type": "paragraph", "text": "On the day of Komurasaki's funeral, Kamijiro growled as Holdem ordered his men to turn on the Visual Tanishi to watch a broadcast. Both were later was seen watching the broadcast as Yasuie was executed."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Kami\" means \"bite\", while \"jiro\" is a male name suffix used for the second son of a family.", "elements": []}, {"text": "Kamijiro's ability to breathe fire may be a reference to the Chimera, a fire-breathing creature that typically has the head of a lion.", "elements": []}, {"text": "His striped mane resembles a poker chip, such as the one used in Texas Holdem poker.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 914 (p. 16) and Episode 901.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 915 (p. 4-7), Kamijiro and Holdem are seen together.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 917 (p. 6-16) and Episode 905.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 916 (p. 11, 18-19).", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 917 (p. 16) and Episode 905, Kamijiro breathes fire.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 918 (p. 3, 15) and Episodes 906–908.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 922 (p. 6, 15).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 941 (p. 9).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 942 (p. 10).", "elements": []}]}], "images": []}]}