{"sections": [{"title": "Kyoshiro", "level": 1, "content": [{"type": "paragraph", "text": "\"Dozing\" Kyoshiro is a samurai and a money changer in Wano Country's Flower Capital, working for the Kurozumi Family. He is also the boss of a yakuza group called the Kyoshiro Family."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kyoshiro is a large man whose light blue hair is pulled back in a topknot that forms a massive faux-pompadour. He wears a dark blue kimono with circles and target patterns on it, as well as a blue, high-collared cape."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kyoshiro is a cheerful man who loves to drink. While intoxicated, he was unafraid of speaking bluntly about the shogun Kurozumi Orochi despite the potential danger, and he mocked the shogun for believing a prophecy from the Kozuki Family about his downfall. In this state, he is prone to experiencing rapid mood swings, ranging from laughter to intensity to falling asleep."}, {"type": "paragraph", "text": "Due to his self-indulgence, Kyoshiro does not appear to bother with his obligations as the boss of his family. This was seen when he ordered his subordinate to contact Queen himself for an assassin to eliminate an individual who refused to comply with their extortion. However, he still cares about his family and will do what he needs to have them defended or avenged, regardless of how low-ranking they are. Ultimately, he is quite diligent when he feels like it, as he was able to raise Komurasaki to become Wano's top-ranking oiran. He even protected Orochi as the loyal guard dog from Zoro's attack against the shogun."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Kyoshiro Family", "level": 3, "content": [{"type": "paragraph", "text": "Kyoshiro is the boss of a yakuza group called the Kyoshiro Family, and appears to care greatly about his subordinates. Thus, if any of them are wronged, he will take the necessary steps to target those who wronged them. He will not interfere with his own plans to help his subordinates in this regard, but still ensures they are helped by telling them to contact the Beasts Pirates."}], "images": []}, {"title": "Kurozumi Orochi", "level": 3, "content": [{"type": "paragraph", "text": "While in Orochi's presence, Kyoshiro acts with extreme reverence, being inclined to spout phrases and ideas that the shogun will agree with, and Orochi compliments Kyoshiro when he voices these ideas. He has referred to himself as the shogun's \"lap dog\". However, like most of Orochi's associates, Kyoshiro is derisive of the shogun's paranoia over the return of the Kozuki Family, and he has openly mocked Orochi as a coward after becoming intoxicated on alcohol."}], "images": []}, {"title": "Komurasaki", "level": 3, "content": [{"type": "paragraph", "text": "Kyoshiro and the Komurasaki appear to be heavily associated, with Kyoshiro being credited for raising her into Wano's top oiran. However, Kyoshiro did not hesitate to punish Komurasaki for defying Orochi. By his own admittance, he was granting her a samurai's mercy. On the other hand, Komurasaki was able to survive for unknown reasons."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the boss of the Kyoshiro Family and one of the highest ranking subordinates of the Kurozumi Family, Kyoshiro is one of the wealthiest and most influential citzens of the Flower Capital, able to hire high-ranking geisha dancers performing for him. He had enough wealth to sponsor and groom Hiyori into the highest ranking geisha in Wano. As a Yakuza Boss, Kyoshiro commands strong henchmen who can extort businesses for money. Thanks to his connections within Wano's government, Kyoshiro is able to strengthen his group further by requesting assistance from his allies, particularly the Yonko-led Beasts Pirates, who appear to treat him quite respectfully, as Page One referred to him as \"Boss Kyoshiro\" (狂死郎親分, Kyōshirō Oyabun)."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Kyoshiro has immense strength, as he could clash with Zoro in terms of physical power."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Kyoshiro is an extremely skilled and powerful samurai. He could deflect Roronoa Zoro's 720 Pound Ho with great precision and also clash with Zoro's Nitoryu with only one sword."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "According to some of his associates, Kyoshiro raised Komurasaki, who became Wano's top oiran. Years later, Kyoshiro was seen with Komurasaki at her shop when Bingo realized that he had been swindled by the courtesan."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "As he was drinking alcohol, Kyoshiro began to mock Kurozumi Orochi for living in fear of the prophecy stated by Kozuki Oden's wife Toki, which was that the Kozuki Family would avenge themselves after 20 years. They were now at the 20th year, and Kyoshiro could not believe that this would happen since the entire family had supposedly died."}, {"type": "paragraph", "text": "After he was invited to Orochi's banquet, Kyoshiro heard from a subordinate that a soba shop owner beat up some of his henchmen. Since he would be attending the banquet, he ordered the subordinate to contact Queen to send assassins. He later went to the banquet hall at Orochi's palace."}, {"type": "paragraph", "text": "While at the banquet, Kyoshiro was praised for raising Komurasaki, whom Orochi was courting, as well as for his response to the attack on his subordinates. Orochi commended Kyoshiro's use of excessive force and took the opportunity to talk about Toki's prophecy. Komurasaki's kamuro Toko ended up laughing at Orochi, and chaos started breaking out as an altercation between the three of them started. Kyoshiro pulled out his sword, saying a bloodbath was about to occur."}, {"type": "paragraph", "text": "Orochi went berserk in his multi-headed dragon form and one of his heads grabbed Komurasaki. When she ended up being freed from his grasp, Kyoshiro gave her a samurai's mercy as he cut her down. Orochi was shocked and furious at his actions, but Kyoshiro explained his reasons. He then found a card containing Kin'emon's secret message in her hand, much to his surprise."}, {"type": "paragraph", "text": "Kyoshiro returned to the Red-Light District and was informed that Komurasaki's wake was cancelled. One of Kyoshiro's cohorts warned him about those who bear a grudge against him, but Kyoshiro bluntly replied that there was nothing else he could have done and he had already suffered the biggest loss from Komurasaki's \"death\". Kyoshiro also stated that Orochi was very enraged because of Kin'emon's secret message card."}, {"type": "paragraph", "text": "He later returned to the palace. After Orochi was informed of the capture of Yasuie, Kyoshiro explained that the Picture Tanishi was prepared."}, {"type": "paragraph", "text": "At Rasetsu Town, when Zoro attempted to attack Orochi with an air slash, Kyoshiro blocked the attack before engaging Zoro in battle. His clash with Zoro was interrupted when one of the Orochi Oniwabanshu intervened."}, {"type": "paragraph", "text": "On the day of the Fire Festival, Kyoshiro was left in charge of the Flower Captial while Orochi departed for Onigashima."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/57/Kyoshiro_Attacks_Komurasaki.png/revision/latest/scale-to-width-down/210?cb=20190218163411", "caption": "Kyoshiro strikes down Komurasaki."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/37/Kyoshiro_Protects_Orochi.png/revision/latest/scale-to-width-down/210?cb=20190603133711", "caption": "Kyoshiro protects Orochi."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kyoshiro vs. Roronoa Zoro", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}]}