{"sections": [{"title": "Kozuki Sukiyaki", "level": 1, "content": [{"type": "paragraph", "text": "Kozuki Sukiyaki was the former shogun of Wano Country, the father of the daimyo of Kuri, Kozuki Oden, and the grandfather of Kozuki Momonosuke and Kozuki Hiyori."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sukiyaki was a tall man with dark hair. The front of his hair split into three tufts which pointed upward, while the back was fashioned in a topknot. He had a small beard growing out of his chin which split into three prongs and a long, thin mustache which pointed upward on each side. He had thick eyebrows, prominent eyelashes, and a dark nose. He wore a light-colored kimono and a dark-colored robe which both had various flower patterns on them."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sukiyaki appeared to be a fair ruler, as he was willing to disown and exile his own son, Oden, for his violence.Shimotsuki Yasuie believed this was simply a sign of Sukiyaki's tough love for his son and a way to get him to mend his ways. He appeared to be exhausted by and ashamed of his son's violent actions, calling them demonic. Sukiyaki also seemed to appreciate order, as while he was not bold enough to attempt to establish order in Kuri himself due to how violent it was, he rewarded Oden with the title of daimyo when he brought peace to the lawless region."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Kozuki Oden", "level": 4, "content": [{"type": "paragraph", "text": "Due to Oden's tendency to pick violent fights, Sukiyaki was frustrated by his violent and out-of-control nature. He exiled Oden from the Flower Capital and even barred him from stepping into the castle. Yasuie believed that the banishment was simply tough love, though Oden did not actually resent his father for banishing him."}, {"type": "paragraph", "text": "When he got word of Oden bringing order to the lawless region of Kuri, Sukiyaki was deeply impressed and reversed his decision of exiling his son. He made him the damiyo of Kuri."}, {"type": "paragraph", "text": "In their last meeting, Sukiyaki was surprised and proud of his son for maturing when becoming a Daimyo."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As shogun of Wano, Sukiyaki had full control over the country until his rule ended. He was capable of bestowing positions of authority onto others, as shown when he made his son, Oden, the daimyo of Kuri."}, {"type": "paragraph", "text": "As a member of the Kozuki Family, Sukiyaki was a philologist who inherited his ancestors' skills and knowledge to read the Poneglyphs and write its language which he passed on to his son. He also had some knowledge foreign to Wano Country such as the Mink Tribe despite having never left the country."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Many years ago, Sukiyaki ruled over Wano Country as its shogun. 41 years ago after his son, Kozuki Oden, failed in his 38th attempt to leave the country, Sukiyaki listened to his aide listing all the things Oden had done in his life. He then ordered his aide to deliver a message to Oden, saying that he was disowning him. Sukiyaki exiled Oden from the Flower Capital after taking into consideration the various violent crimes Oden had committed throughout his life."}, {"type": "paragraph", "text": "Two years later, Oden established order in the lawless region of Kuri, and Sukiyaki reversed his decision of disowning him and bestowed him the title of daimyo out of gratitude for this achievement."}, {"type": "paragraph", "text": "30 years ago, Sukiyaki had fallen ill and Oden paid him a visit. During their conversation, Sukiyaki commented on how Oden had grown into a fine man. This was the last time they ever spoke to each other."}, {"type": "paragraph", "text": "Sukiyaki was later replaced as shogun by Kurozumi Orochi, who persecuted the Kozuki Family as criminals. What became of him after this is unknown."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sukiyaki is the name of a traditional Japanese dish.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Chapter 960 (p. 7-9), Sukiyaki makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 920 (p. 2-3), Sukiyaki is first mentioned.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 942 (p. 3), Sukiyaki is talked about by Yasuie.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 962.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 82 Chapter 818 (p. 14) and Episode 770, It is revealed that the Kozuki Family could read the Poneglyphs.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 959 (p. 16).", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963.", "elements": []}]}], "images": []}]}