{"sections": [{"title": "Jibuemon", "level": 1, "content": [{"type": "paragraph", "text": "Jibuemon is a former retainer from Kibi serving under the Kozuki Shogunate. As a hatamoto, he directly served under the former shogun, Kozuki Sukiyaki."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jibuemon is an old man, with several wrinkles on his face, a beard, and a two-part mustache. He has long hair with a ribbon tied over his head, and he wears a kimono with the sleeves collected and circular prints at the bottom."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jibuemon highly treasures loyalty, as he continued to remain faithful to the Kozuki Family, having waited 20 years for their return and readily offered his aid in opposing Kurozumi Orochi."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a samurai, Jibuemon had combat abilities that would have enabled him to protect the shogun. However, it is unknown if he is still capable of fighting after all these years."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, he was a retainer for Kozuki Sukiyaki."}, {"type": "paragraph", "text": "After the invasion of Kaido and the downfall of the Kozuki Family, Jibuemon was one of the witnesses who saw the burning of Oden Castle and Kozuki Toki's prophecies about the downfall of Kurozumi Orochi and the opening of Wano Country's borders. Believing Toki's words, he searched for the remains of the Nine Red Scabbards at the burned castle. Having found none, he waited patiently for 20 years."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After 20 years, he was one of the first to recognize Momonosuke and welcomed him and his retainers back to Wano and swore his loyalty to the Kozuki Family and told them that they still had allies in Wano after 20 years, all of whom have moon tattoos on their ankles."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 920 (p. 12-13) and Episode 911, Jibuemon makes his first appearance.", "elements": []}]}], "images": []}]}