{"sections": [{"title": "Ashura Doji", "level": 1, "content": [{"type": "paragraph", "text": "Ashura Doji is a retainer of the Kozuki Family as one of the Nine Red Scabbards once led by Kozuki Oden. After Oden's death he returned to being a criminal under the name Shutenmaru, assuming leadership of the Mt. Atama Thieves. He initially severed his ties with the Kozuki Family in the present but rejoined after witnessing Yasuie's death."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ashura Doji is a very large man with light pink puffy hair that is gathered into a topknot. He wears an open kimono with flowers on it that leaves his chest exposed. He has floral tattoos on his arms and upper chest."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ashura was once a dangerous outlaw who was extremely violent in the past. He claimed that he hated people with wealthy status. After being defeated by Kozuki Oden who chose to spare his life and offered him a chance to live a peaceful life by rebuilding Kuri, Ashura became one of his most loyal followers out of immense gratitude. He and the other Nine Red Scabbards attempted to steal money from Shimotsuki Yasuie in order to support Oden. Ashura is even willing to study hard to improve himself on Oden's behalf."}, {"type": "paragraph", "text": "Ashura is an extremely loyal person as he still refers to Oden as \"Oden-sama\" even after his death. His loyalty is also seen when he patiently tried to assemble an army of samurai to support the Kozuki Family."}, {"type": "paragraph", "text": "He is also very brave and almost fearless. When he encountered Jack in Okobore Town who is the ruler of Kuri and one of the Beasts Pirates All-Stars, the former was not afraid to attack the latter immediately and even did not fear Jack's reputation. However, he is also cautious of Kaido's strength, but he will fight Kaido if he needed to."}, {"type": "paragraph", "text": "He was also a very caring person. When the samurai he had gathered tried to attack Kaido at Onigashima, he cried and tried to stop them, but his words were in vain because they did not listen. After losing these comrades, Ashura finally lost hope and returned to being a criminal under the alias Shutenmaru and formed a group of thieves because he was disillusioned and nihilistic towards the country."}, {"type": "paragraph", "text": "After returning to being a criminal, he became an aggressive and prideful person. He had stolen both from Wano's Shogun, Kurozumi Orochi, and from the poorest citizens for the exact same self-sufficiency motives. He also did not care what would happen to this country due to the lack of strong and noble people like Oden. As such, Ashura was disgusted with Luffy's heroism to feed the citizens of Okobore Town. He also refused to rejoin the Kozuki Family after they returned for their campaign to overthrow Kaido and Orochi. Despite his callous and nihilism towards the citizens of Wano, Ashura still has some compassion as he secretly felt sympathy towards the citizens of Ebisu Town who had lost the ability to express sadness and anger from eating the SMILEs that Orochi manipulated them into eating. He was also distraught when Yasuie was executed, showing that he still cared greatly for those that were his comrades."}, {"type": "paragraph", "text": "After deciding to rejoin the Nine Red Scabbards, Ashura became friendly with his comrades again."}, {"type": "paragraph", "text": "Ashura is one of few samurai known to use the Sunacchi, which was once part of the old dialect of Kuri in Wano Country. Ashura and his men use it frequently amongst themselves and in battle."}, {"type": "paragraph", "text": "Ashura seems to enjoy drinking alcohol. In the past, he also drank blood from a decapitated snake."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/Ashura_Studying.png/revision/latest/scale-to-width-down/180?cb=20191126024858", "caption": "Ashura studying to improve himself despite great difficulties."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Kozuki Family and Nine Red Scabbards", "level": 3, "content": [{"type": "paragraph", "text": "In the past when Kuri was a lawless region, Ashura Doji was confronted by Kozuki Oden, the son of Shogun Kozuki Sukiyaki. After an entire night of intense battle, he was finally defeated. Despite wishing to die by Oden's hands as part of his own choice to live and die in violence, Oden chose to spare Ashura and reformed him by enlisting his help in bringing order to Kuri. Thus, Ashura is extremely grateful to Oden for showing him a possible future to live in peace, though was irritated when Oden kicked him in the face when he expressed his gratitude. He and the other retainers attempted to steal money from daimyo Shimotsuki Yasuie to support Oden. Even after his death, Ashura still refers to him as \"Oden-sama\", showing undying respect and loyalty to the daimyo of Kuri. Ashura and the other retainers seem to get along well, except Kikunojo. However, after Oden's death and Wano Country was taken over by Kaido and the new Shogun Orochi, Ashura tried to support the Kozuki Family by gathering allies and waiting for the missing Nine Red Scabbards and Momonosuke to return, even though it ended up in vain because all of his allies had died at the hands of Kaido. This led him to sever his ties with the Kozuki Family."}, {"type": "paragraph", "text": "Later, after the missing Nine Red Scabbards returned, their relationship became strained. Ashura became angered and frustrated at Kin'emon and the others for having vanished for so long. Ashura said that he only respects and is loyal to someone named Oden, not to his family. In truth, he was angered because some of his comrades died in vain ten years ago. His feeling of resentment for the family was so much that he even refers to Momonosuke, who is Oden's son without any honorifics, resulting in Kikunojo expressing his disappointment. The closest to any camaraderie Ashura expressed was that he spared them from his banditry. However, Kin'emon made it clear that he would make Ashura their ally and had no qualms framing him for theft. This only made Ashura angrier after he found out about it, but he was still lenient enough to listen to Kin'emon's apology and pleas. Ashura then showed Kin'emon and Inuarashi the graves of fallen comrades and explained what happened to their allies after they had lost the patience in waiting for their return. Ashura finally rejoined his team again and invited his bandit group to take part in the fight against Kaido and the Beasts Pirates."}], "images": []}, {"title": "Beasts Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Ten years ago, Ashura tried gathering forces to support the Kozuki Family in the fight against Kaido. However, after his comrades threw their lives away, Ashura lost hope and seemingly gave up. Kaido recognizes his strength and wanted him to join his crew, but Ashura had no intention of joining and pledging loyalty to the Beasts Pirates. However, he is well aware of Kaido's strength and would try to avoid him as possible."}, {"type": "paragraph", "text": "Despite his intimidation of Kaido, he is not afraid to pick fights with the Yonko's subordinates. When Ashura encountered Jack in Okobore Town, the former did not hesitate to attack the latter and did not even fear his reputation."}, {"type": "paragraph", "text": "With Ashura rejoining the Scabbards, he intends to help defeat Kaido."}, {"type": "paragraph", "text": "Kaido seems to be unaware of Ashura's connection with the Kozuki Family as he only knew him as a thief called Shutenmaru."}], "images": []}, {"title": "Mt. Atama Thieves", "level": 3, "content": [{"type": "paragraph", "text": "All the members of the Mt. Atama Thieves are extremely loyal and supportive of Shutenmaru, aiding him in stealing and robbing. When Shutenmaru decided to join the Kozuki Family's revolution, all his underlings happily agreed to join him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As leader of the Mt. Atama Thieves in the present, Ashura has complete authority over the group. Proving their combined skills at thievery, Ashura and his followers successfully raided Orochi's personal farm whilst not able to be stopped by anyone serving the shogun (be it samurai or the Beasts Pirates). Furthermore, he proved his ability to be able to have hidden from them all along."}, {"type": "paragraph", "text": "Combat-wise, Ashura Doji is extremely powerful, as he was once feared as the \"Strongest Monster of Kuri\" (九里最強の怪物, Kuri Saikyō no Kaibutsu) — the most dangerous villain frequenting said Wano province in its era of chaos — until he was defeated by Oden four decades ago (the latter taking a whole night to take down both Ashura and his then-cohorts). Even more, in the last 20 years, Ashura claims to have become still stronger."}, {"type": "paragraph", "text": "Kin'emon hails him as one of the strongest of the Scabbards (alongside Kawamatsu and Denjiro) and worth the strength of 100 men.Kaido himself, a Yonko, sought to recruit him, and Holdem, a Beasts Pirates headliner, surmised that Monkey D. Luffy may be Ashura's subordinate going by his power. Perhaps most impressively yet, Ashura was able to fight on par with Jack, one of Kaido's three strongest men worth a 1,000,000,000 bounty, even dealing him a serious wound, and additionally matched up to Inuarashi, one of the two strongest members of the Mink Tribe. Though as strong he may be, Ashura is well aware that he cannot defeat Kaido, preferring to retreat when faced with him a second time."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Being hailed as the strongest outlaw of Kuri during his youth, Ashura can apply tremendous physical strength to his swordsmanship, able to clash with Jack, one of the Three Disasters of the Beast Pirates, and even gave the latter a massive wound across his chest."}, {"type": "paragraph", "text": "Despite his large build, Ashura is extremely fast, being capable of charging towards Jack in an instant."}, {"type": "paragraph", "text": "Ashura also possesses a great amount of endurance, as he was seemingly unaffected when Jack cut him on the shoulder."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Ashura is a master swordsman and one of the most powerful samurai in Wano. With one slash, he was able to give Jack a large cut across his chest and break one of his shotel blades. He then proceeded to fight evenly with Kaido's right-hand man in what spectators considered to be a high-level duel."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Many years ago, Ashura Doji was the most dangerous criminal in the lawless region of Kuri. When he heard that Kozuki Oden was coming to Kuri, Ashura eagerly waited for him. After Oden eventually arrived at Kuri, they clashed and Ashura was defeated after a day of intense fighting. After Oden became daimyo of Kuri, Ashura became one of his retainers."}, {"type": "paragraph", "text": "After Inuarashi, Nekomamushi, and Kawamatsu joined Oden, they were running low on funds. Therefore, he and the other retainers attempted to steal money from Yasuie, but they were caught. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Oden and Wano Country. Following Yasuie's advice, they educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "After meeting the Whitebeard Pirates, Oden and his retainers were having a feast with them. After the Whitebeard Pirates left Wano two weeks later, the retainers discovered Oden, Izo, Inuarashi, and Nekomamushi to be missing."}, {"type": "paragraph", "text": "Ten years after Oden was executed by Kaido and the new shogun Kurozumi Orochi, Ashura had many friends who became too eager to fight Kaido and Orochi and did not fully believe Toki's prophecy about the return of the missing Red Scabbards. Thus, they impatiently went straight to Onigashima to fight Kaido. Ashura tried to stop them from throwing their lives away, but these words were in vain, and his comrades ultimately perished at the hands of Kaido."}, {"type": "paragraph", "text": "Distraught at his comrades' pointless demise, Ashura eventually lost hope, went back to being a criminal, and adopted the alias Shutenmaru. He also formed the Mt. Atama Thieves. At some point, he encountered Kaido, in which Kaido wanted him to be part of his crew. Ashura also managed to acquire the blueprints of Kaido's fortress."}, {"type": "paragraph", "text": "A few weeks before Monkey D. Luffy's arrival at Wano Country, Ashura and other thieves managed to steal food from the farm that Oden had established, which was now owned by Orochi."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Oden_Defeats_Ashura.png/revision/latest/scale-to-width-down/180?cb=20191118122937", "caption": "Ashura and his goons defeated by Oden."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Ashura%27s_Comrades_Suicide_Mission.png/revision/latest/scale-to-width-down/200?cb=20190729185440", "caption": "Ashura watches his comrades sail to their doom while he hopelessly tries to stop them."}]}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Ashura and his thieves came to Okobore Town, where they stole the fresh food that Luffy had given to the residents there. He was confronted by an old woman who believed that the samurai would return to protect them, and in response, Ashura prepared to attack her. However, before he could, he was confronted by Jack of the Beasts Pirates. Jack asked about the Straw Hat Pirates and mentioned that Ashura had only been left alive because Kaido wanted him as his subordinate. He reiterated that he would never join them and then attacked Jack with a massive cut, causing the two to begin fighting. Jack managed to wound Ashura, but he was unwavering. However, their duel was interrupted when Kaido came flying in to tell Jack to bring the Straw Hats to him."}, {"type": "paragraph", "text": "Ashura and his gang then began retreating to the forest. Kaido spotted him and asked him to become his subordinate. Ashura prepared for a fight, but Hawkins drew Kaido's attention to Oden Castle. The thief was then angry at Kaido for destroying the castle ruins, and after Luffy attacked Kaido, Ashura told his men to retreat to the mountain before watching Luffy's futile attempt to defeat Kaido. After Kaido defeated Luffy, Ashura saw the unconscious Luffy knocking out some of the Yonko's subordinates with Haoshoku Haki and realized he had the same power as Oden. He then departed from Okobore Town."}, {"type": "paragraph", "text": "At Mt. Atama, Ashura clashed with Inuarashi, but the fight was interrupted by Kin'emon. Ashura stated that while he admired Oden, he never swore loyalty to the whole entire family. However, Kin'emon ignored this claim and emphasized that he was determined to make Ashura their ally once again."}, {"type": "paragraph", "text": "Sometime later, Mt. Atama was set on fire by one of Holdem's subordinates. Enraged, Ashura decided to go to Bakura Town to retaliate. He and his gang later entered Bakura Town and witnessed Yasuie's execution on the broadcast. After the execution, he was the only one of the Nine Red Scabbards to hold his tears after Yasuie’s death, and thereafter asked Kin'emon and Inuarashi if they knew about the SMILE fruits."}, {"type": "paragraph", "text": "Outside Bakura Town, Ashura learned that Kin'emon framed him for theft. He got angry and knocked Kin'emon to the ground. Kin'emon and Inuarashi apologized and once again asked Ashura to join them. Ashura then told Kin'emon and Inuarashi to follow him, wanting to show them something. When they arrived, Ashura showed them the graves of their dead comrades and explained what had happened to their allies ten years ago. He recounted how they had all lost patience and had tried to fight Kaido, but were all killed in battle. Ashura then determined that it was time for him to rejoin his comrades to avenge those who had fallen and to also overthrow Kaido and Orochi to restore the position of the Kozuki Family. Inuarashi and him then rejoiced and bragged to Kin'emon about how they had twenty years more fighting experience than him now. Upon being called a duo of geezers by Kin'emon, the three began arguing, much to the worry of Ashura's henchmen."}, {"type": "paragraph", "text": "Ashura later took Kin'emon and Inuarashi to an abandoned port and showed them ships that could carry their troops to Onigashima. Ashura then gave Kin'emon the blueprints of Kaido's residence. While Kin'emon was speaking to Raizo via Smart Tanishi, Ashura was surprised to hear the number of allies Raizo's group gained at Udon. He later joined a meeting with several key alliance members at Amigasa Village."}, {"type": "paragraph", "text": "Ashura then heard from Zoro and Kawamatsu that Hiyori is alive. On the day for the raid on Onigashima, Ashura marched to the rebel meeting place with Momonosuke, Kin'emon, Kanjuro, Raizo, Kikunojo, Shinobu, Inuarashi, and Kawamatsu. However, the group was shocked to see that the place was destroyed and none of their allies were there. In spite of this major setback, the Scabbards were still determined to go through with the raid, knowing that they would not get another chance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Shutenmaru_Attacks_Jack.png/revision/latest/scale-to-width-down/200?cb=20181123210643", "caption": "Ashura Doji attacks Jack."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ec/Shutenmaru_vs._Inuarashi.png/revision/latest/scale-to-width-down/200?cb=20181201070136", "caption": "Ashura clashes with Inuarashi as he refuses to help the Kozuki Family again."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ashura Doji vs. Kozuki Oden", "elements": []}, {"text": "Ashura vs. Kaido", "elements": []}, {"text": "Ashura vs. Jack", "elements": []}, {"text": "Ashura vs. Inuarashi", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Like O-Tama, he speaks in a dialect that is unique to a specific region of Japan. This area is known as Kagoshima, one of the prefectures created during the Meiji Era as the country transitioned from the isolationism enforced by the Shogunate. ", "elements": []}, {"text": "The names Shutenmaru and Ashura Doji are likely a reference to Shuten-dōji, a mythical oni leader from Japanese legends.", "elements": []}, {"text": "The middle kanji of his alias, \"天\" (ten, \"天\"), is the Japanese kanji for \"Heaven\". This same kanji is seen on the sake bottle he carries.", "elements": []}]}], "images": []}]}