{"sections": [{"title": "Kalgara", "level": 1, "content": [{"type": "paragraph", "text": "Kalgara was a hero of the Shandia who lived while Upper Yard was still a part of Jaya (some 400 years ago), and who befriended the explorer Mont Blanc Noland (the ancestor of Mont Blanc Cricket). A statue of him was erected after his death as an eternal reminder to the Shandia of his strength and courage. He had a daughter named Mousse.Wyper is his descendant."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kalgara's most striking feature is his long mass of red hair that extends down to his knees. He has red tattoos on both shoulders and, like all Shandia, a pair of small white wings extending from his back. Unlike his descendant who almost always keeps a stoic face, Kalgara is noticeably savage looking, with his wide, crazy eyes and a wide, mad grin making him more of a \"demon\" than his own descendant."}, {"type": "paragraph", "text": "He wears purple laced-leg pants (similar in style to those worn by Native Americans) under a grass skirt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kalgara was quick to react and a strong believer in traditions of his people. He was hugely mistrusting of strangers. Kalgara's personality changed after he met Noland with many of his outlooks of the world changing alongside it. One particular note was that after seeing his God for what it truly was (a giant snake), he dismisses all Gods including the Skypieans \"God\"."}, {"type": "paragraph", "text": "A noticeable difference between Wyper and himself is that while his descendant keeps a stoic expression, giving the impression that he takes matters seriously; Kalgara in his first appearance, enjoys being intimidating to intruders, giving a deranged expression of slit-like eyes and wide grin, licking at the prospect of his fearsome reputation. This trait mellows down as he becomes friends with Noland, to the point he is actually crying for his friend to return someday."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Kalgara, except that he was considered the Shandia tribe's greatest warrior and has been shown to fight on even terms with Noland, and killed a giant snake by himself, demonstrating he was incredibly strong. It should be stressed that both his descendant Wyper, and the pirate hunter Zoro, both notable in their own right for their exceptional strength, could not so much as harm the snake Nola, although she is supposed to be much bigger than her ancestors due to nutrition in the sky and the decrease in the atmosphere."}, {"type": "paragraph", "text": "He is also apparently very fast, as he has been known to swiftly dispatch intruders as soon as they appear on the island. Those that have heard of any legends about him often compare him to a demon."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Like many others from his tribe he wields a spear, something he seems quite adept with as he used it to kill a giant snake. He also uses a giant iron ball on a chain, in the same way Garp did, swinging it and utilizing it with ease despite its size."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Kalgara possessed the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "After their dying priest had a 'vision', he declared the only way to stop the \"curse\" that was plaguing their land was to sacrifice their most beautiful woman. Mousse, Kalgara's daughter, went willingly to the altar in order to save the rest of her people. She was about to be sacrificed to God, but she was saved by Mont Blanc Noland. Kalgara fought against Noland and, after Noland was distracted by Mousse trying to kill herself, finally struck the explorer in the chest."}, {"type": "paragraph", "text": "Noland declared that he could cure the village without needless human sacrifice and was given the deadline of sunset to prove this, or join Mousse and his crew on the altar. Kalgara then declared, at the first sign of trouble, he would kill Noland. Heading out to find the explorer he found Seto just outside, who had discovered that he carried the plague the day before. When Kalgara asks how he is feeling, Seto says \"much better\" to Kalgara's shock."}, {"type": "paragraph", "text": "The next day, an earthquake hit the island; thinking this is God's wrath, Kalgara rushed out to find and kill Noland. Kalgara mocked Noland after finding him trapped in a crack in the ground. After God's daughter came to devour Noland, Noland pleaded with Kalgara one last time. Hearing the speech, Kalgara finally listened and killed the snake. As Kalgara stood there for a moment, wondering whether he did wrong or not, and unsure of the fate of his people, Noland ensured him things were fine. Later, after Noland cured the entire village of the illness, Noland and Kalgara became friends and laughed and drank together."}, {"type": "paragraph", "text": "Noland stayed on the island a few days longer, exploring what other trees and plants grew on the island. During this time, his crew found a viper; Noland and Kalgara found themselves laughing over the viper being the great snake's grandchild."}, {"type": "paragraph", "text": "Having been convinced Noland and his crew were okay people, Kalgara showed them Shandora, the city of gold which his people protected. In the ruins of the great city, Noland was shown the bell of Shandora, which first brought him to the island, and the Poneglyph."}, {"type": "paragraph", "text": "However, it is revealed that Noland and his crew cut down an entire forest, whose trees the Shandia believed to guide the souls of their ancestors, causing the Shandia to act towards Noland with hostility. Noland did so because the trees were the source of the disease that plagued the Shandia in the first place, and decided to leave anyway, as he and his crew were once again seen as outsiders. However, Kalgara realized the truth too late, as Noland's crew was already on their ship leaving."}, {"type": "paragraph", "text": "This did not stop Kalgara though, and he rang the golden bell that first attracted Noland to Jaya, promising that he would wait for Noland's return. Sadly that was not to be, as one fateful day, the part of the island they were on was shot into the air by the Knock Up Stream and into Skypiea, where it attracted the attention of the \"God\" of the time, who then proceeded to attack it and the Shandia in order to claim it as his own. Kalgara found himself struggling to breathe suddenly."}, {"type": "paragraph", "text": "The last scene of him was shouting to his warriors that they must protect the land so that their friend Noland can return. He died honorably in battle never knowing the fate of his friend Noland. Kalgara's call to relight the light of Shandora would later inspire his descendant Wyper to attempt to complete Kalgara's final wish."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Kalgara_Fights_Noland.png/revision/latest/scale-to-width-down/180?cb=20160117211917", "caption": "Kalgara fights with Noland who stopped the sacrifice of Mousse."}]}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He was in the One Piece Full Color R Gashapon series and One Piece Unlimited Adventure as an optional boss. He is a level 5 character, which means that (in the game) his strength rivals that of extremely powerful One Piece characters like Luffy, Aokiji, Shanks and even Whitebeard."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Adventure", "elements": []}, {"text": "One Piece: Unlimited Cruise", "elements": []}]}], "images": []}]}