{"sections": [{"title": "Kozuki Toki", "level": 1, "content": [{"type": "paragraph", "text": "Kozuki Toki, née Amatsuki (天月, Amatsuki), was the wife of the daimyo of Kuri, Kozuki Oden, and the mother of Momonosuke and Hiyori."}, {"type": "paragraph", "text": "Born around 830 years before the present day, she spent her first 26 years jumping forward in time with her Devil Fruit ability. After jumping to 30 years before the present, she met Oden and stayed with him for 10 years, until he was executed and she was killed during the destruction of Oden Castle 20 years ago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "At age 26, Toki was an average-sized woman with long dark hair that was kept back with the exception of two strands in front. She wore a flower with a chain of pearls on the right side of her hair. She also wore a short kimono with crescent moons resembling the Kozuki Family's symbol on the bottom. She held a strong resemblance to her daughter."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Toki was a friendly and caring woman, as she took care of Oden when he washed ashore on the island she was on to repay him for scaring away human traffickers. Her friendliness could make her somewhat naive, as she went with some human traffickers under the impression that they would take her to Wano, although she did manage to quickly expose their ruse. When she came to 30 years before the present, she showed an excited attitude at going to Wano. When she married Oden, Oden's retainers came to possess tremendous respect for her."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Kozuki Oden", "level": 4, "content": [{"type": "paragraph", "text": "Toki first met Oden when she was confronted by a pirate crew led by Karma. She later took care of him when he passed out due to his injuries. Soon after, she joined Oden on his adventures with the Whitebeard Pirates. Despite being from the past, she married Oden and finally settled down with him in Wano Country. After Oden was executed, Toki used her Devil Fruit powers to send Momonosuke and four of the Nine Red Scabbards to the future for a chance to fufil Oden's dream of opening the borders of Wano Country while she remained behind to meet her end, choosing to join her husband in the afterlife."}], "images": []}, {"title": "Children", "level": 4, "content": [{"type": "paragraph", "text": "Toki loved her children, when the Beasts Pirates set fire to the Kuri Castle to kill the last Kozuki descendants, Toki held Momonosuke and Hiyori close to her to keep them safe. Momonosuke deeply mourned his mother's death being driven to tears when recalling both his parents' demise while Hiyori was so traumatized that she did not speak for a long time."}], "images": []}, {"title": "Whitebeard Pirates", "level": 3, "content": [{"type": "paragraph", "text": "She met Whitebeard the day after she met Oden. Soon, she asked his permission to stay on his ship, which Whitebeard allowed. However, it is unknown if she was ever engaged in piracy while she travelled with the crew. Some time later, she revealed her age and origin from the past only to be laughed at by the crew."}], "images": []}, {"title": "Nine Red Scabbards", "level": 3, "content": [{"type": "paragraph", "text": "Toki is deeply respected by the Nine Red Scabbards, after Oden's death, Kin'emon, Kanjuro, Raizo, Kikunojo and Kawamatsu braved through the burning Kuri Castle to rescue her and her children. When Kin'emon declared their resolve to realize Oden's will by overthrowing both Kaido and Orochi as well as opening Wano Country's borders to the world, Toki smiled in silent gratitude and as a final sign of trust, she entrusted Momonosuke to Kin'emon and Hiyori to Kawamatsu before being burned to death."}], "images": []}, {"title": "Wano Country Citizens", "level": 3, "content": [{"type": "paragraph", "text": "Toki is also well respected by the Wano Country citizens as well as Kozuki Family retainers. Many samurai such as Jibuemon wholeheartedly trust her prophecy about nine samurais overthrowing Kaido and Orochi in twenty years."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As wife to Kozuki Oden, the daimyo of Kuri, Toki possessed a considerable amount of status until Oden was executed."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Toki ate the Toki Toki no Mi, a Paramecia-type Devil Fruit that enabled her to send herself and others forward in time."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Toki carried a katana and pulled it out when confronting Karma and his gang, but seemed to have no intention of using it against them as she had planned to escape by traveling into the future; thus, it is unclear if she had any swordsmanship skill."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Toki was born around 830 years ago before the present time, which was during the Void Century. After consuming the Toki Toki no Mi, she traveled forward in time multiple times. She came to the time 30 years before the present day and met a gang led by Karma, who said they would help her get to Wano Country. However, she quickly realized that they were actually human traffickers and confronted them as she prepared to escape through time. However, Karma's gang ran away after seeing Kozuki Oden (with a massively swollen body), whom they mistook for a sea demon, walk ashore. Toki treated Oden's wounds and the next day, they were confronted by Karma. However, Karma was then defeated by Whitebeard, who took Toki and Oden aboard his ship, where they sailed the New World with the Whitebeard Pirates."}, {"type": "paragraph", "text": "Toki would later marry Oden and gave birth to a son, Momonosuke, followed by a daughter, Hiyori. Toki achieved her goal of reaching Wano as her family settled down there."}, {"type": "paragraph", "text": "20 years before the present day, Oden was brought to the Flower Capital and executed by the shogun Kurozumi Orochi after illegally leaving Wano Country and refusing to divulge information of Laugh Tale. Toki was in Kuri Castle with Momonosuke and Hiyori when Kaido, who was working with Orochi, set it ablaze. When the retainers returned to the castle, Toki used her Devil Fruit powers to send Momonosuke and her retainers 20 years forward in time, but chose to stay behind and meet her end."}], "images": []}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "Before her death, Toki gave a prophecy to Wano Country that inspired strong hope in the former followers and retainers of the Kozuki Family and an intense fear in Kurozumi Orochi, which they interpreted that in twenty years, nine samurai would exact vengeance on Orochi in Oden's name and open the borders of Wano Country."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Toki\" is another name for the Japanese crested ibis, which follows Oda's tradition of naming female characters after birds, as well as the Japanese word for \"time\", matching the name and ability of her Devil Fruit.", "elements": []}, {"text": "The name Amatsuki combines the kanji for \"heaven\" (天, \"heaven\") and \"moon\" (月, \"moon\").", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 919 (p. 8) and Episode 909, Kyoshiro reveals Toki's prophecy.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964, Toki is fully seen for the first time.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 920 (p. 9), Kin'emon reveals Toki's past.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 928 (p. 17), Momonosuke states that people witnessed Toki's death.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 920 (p. 9-11).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 920 (p. 6-11).", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 919 (p. 8-9) and Episode 909.", "elements": []}]}], "images": []}]}