{"sections": [{"title": "Charlotte Mash", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Mash is the tenth daughter and 26th child of the Charlotte Family and the middle triplet sister of Moscato and Cornstarch. She is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mash is a thickset woman with large shoulders and a barrel chest. She has a very large round nose and has a great amount of brown hair that falls down her back and over her shoulders. She wears a cream-colored dress with orange rings on it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f6/Charlotte_Mash_Manga_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20181020080529", "caption": "Mash's original concept art."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mash seems to be loyal to her family and crew, as she took part in the plot to assassinate the Vinsmoke Family."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Mash has authority over lower-ranking members of her crew. Her combat powers and abilities are unknown, but she is presumably strong as she is an officer of a Yonko-led crew."}, {"type": "paragraph", "text": "Mash possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During the attempt to assassinate the Vinsmoke Family, Mash wielded a Walker. In her concept sketches, she was shown carrying a long sword."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Mash attended the tea party and wedding between Charlotte Pudding and Sanji. After Pudding failed to execute Sanji as planned, Charlotte Perospero bound the Vinsmokes with candy and Mash and the other assassins prepared to kill them. However, they were immobilized after Capone Bege and Monkey D. Luffy caused Big Mom to unleash a devastating scream."}, {"type": "paragraph", "text": "Bege's crew attempted to assassinate Big Mom, but their attempt failed. When they attempted to escape, Mash was seen shooting at them with her crew. However, their shots were blocked by the Vinsmokes. Mash later watched as Charlotte Katakuri confronted the escaping Bege and Caesar Clown. However, when the Big Mom Pirates were on the cusp of victory, Big Mom's Tamatebako exploded after falling off the Whole Cake Chateau, causing the Chateau and everyone on it to fall to the ground far below. However, the Big Mom Pirates' falls were broken when Streusen turned part of the Chateau into cake."}, {"type": "paragraph", "text": "She was last seen on the Queen Mama Chanter chasing after the Straw Hat Pirates on the Thousand Sunny, and fought the Sun Pirates as they tried to help the Straw Hats escape Totto Land."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Mash, Mobile, and Laurin vs. Vinsmoke Yonji", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mash is a colloquial term for mashed potatoes. It can also refer to mash bill, which are ingredients used to produce a wort for the production of alcoholic beverages. Both fit the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 865 and Episode 834, Part of Mash's outfit can be seen as the Big Mom Pirates surround the Vinsmoke Family.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  One Piece Magazine Vol.4, Mash is named.", "elements": []}, {"text": "↑  One Piece Anime — Episode 838.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 87 Chapter 870 and Episode 841.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 87 Chapter 871 and Episode 841.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 87 Chapter 872 and Episode 843.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 901.", "elements": []}]}], "images": []}]}