{"sections": [{"title": "Charlotte Mozart", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Mozart is the 12th daughter and 31st child of the Charlotte Family and the elder twin sister of Marnier. She is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mozart is a thin woman with very long dark maroon hair, which is partitioned into two large horn-shaped braids to the left and right of her head which resemble a jester's hat; parts of these braids are pink. She has purple eyes. She wears a pink collared shirt with horizontal purple stripes, a maroon skirt, striped tights, and a light purple cape."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Charlotte_Mozart_Manga_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20181020080539", "caption": "Mozart's original concept art."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mozart is loyal to her family and crew, as she fought against the Fire Tank Pirates, Straw Hat Pirates, and Germa 66 after they attempted to take out Big Mom."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Mozart has authority over lower-ranking members of her crew. Her combat powers and abilities are unknown, but she is presumably strong as she is an officer of a Yonko-led crew."}, {"type": "paragraph", "text": "Mozart possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During the wedding, Mozart wielded a Walker."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Mozart attended the tea party and wedding between Charlotte Pudding and Sanji. When Pudding broke down at the moment she was supposed to shoot Sanji, Mozart looked concerned."}, {"type": "paragraph", "text": "During the wedding, the Fire Tank Pirates and Straw Hat Pirates attempted to assassinate Big Mom. After their attempt failed, they fled while Mozart and the Big Mom Pirates shot at them. However, their shots were blocked by the Vinsmoke Family. When the Whole Cake Chateau toppled as a result of the Tamatebako explosion, the Big Mom Pirates were saved by Streusen turning part of the Chateau into cake."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mozart is likely named after Mozartkugel (meaning \"Mozart ball\" in German), a small, round sugar confection made of pistachio marzipan and nougat that is covered with dark chocolate. This fits with the food-themed themes of the Charlotte Family.", "elements": [{"text": "She may also be named after the famous Austrian composer Wolfgang Amadeus Mozart, fitting with the music-themed names of some Charlotte Family members.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 862 (p. 13) and Episode 832, Mozart makes her debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.5, Mozart's age is revealed.", "elements": []}, {"text": "↑  One Piece Magazine Vol.4, Mozart is named.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 87 Chapter 870 (p. 14) and Episode 841.", "elements": []}, {"text": "↑  One Piece Anime — Episode 838.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 87 Chapter 872 (p. 7-15) and Episodes 842–843.", "elements": []}]}], "images": []}]}