{"sections": [{"title": "Charlotte Cornstarch", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Cornstarch is the 11th daughter and 27th child of the Charlotte Family and the younger triplet sister of Moscato and Mash. She also is an officer of the Big Mom Pirates and serves as Totto Land's Minister of Love (愛情大臣, Aijō Daijin), governing over Loving Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cornstarch is a large woman whose golden hair is slicked upward. She wears a fancy light blue dress with frills at the bottom, as well as a cream-colored cape with a very high collar that has vertical purple stripes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Charlotte_Cornstarch_Manga_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20181020080519", "caption": "Cornstarch's original concept art."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Cornstarch's personality. However, since she took part in Big Mom's plan to assassinate the Vinsmoke Family, she can be considered very loyal to her family and crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Minister of Love, Cornstarch has authority over Loving Island in Totto Land, and as an officer of the Big Mom Pirates, she has authority over lower-ranking members of her crew. Her combat powers and abilities are unknown, but she is presumably strong as she is an officer of a Yonko-led crew."}, {"type": "paragraph", "text": "Cornstarch possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Cornstarch attended the wedding between Charlotte Pudding and Sanji. When Capone Bege and Monkey D. Luffy made Big Mom unleash a devastating scream during their assassination attempt, Cornstarch was seen being immobilized by the scream. The assassination attempt failed and the Big Mom Pirates eventually got the upper hand, but Big Mom's Tamatebako exploded after falling off the Whole Cake Chateau, causing the Chateau and everyone on it to fall to the ground far below. However, the Big Mom Pirates' falls were broken when Streusen turned part of the Chateau into cake."}, {"type": "paragraph", "text": "She was last seen on the Queen Mama Chanter chasing after the Straw Hat Pirates on the Thousand Sunny, and fought the Sun Pirates as they tried to help the Straw Hats escape Totto Land."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cornstarch, Charlotte Saint-Marc, and Charlotte Basans vs. Vinsmoke Judge", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Corn starch is the starch derived from the corn grain and is a common food ingredient. This fits the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 865 and Episode 841, Cornstarch makes her debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.4, Cornstarch is named.", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 87 Chapter 872 and Episode 843.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 901.", "elements": []}]}], "images": []}]}