{"sections": [{"title": "Charlotte Melise", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Melise is the 17th daughter and 40th child of the Charlotte Family and an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Melise is a woman with a set of matching deer-like antlers on her head, accompanied by long, flowing hair that reaches below her waist. She wears a fancy dress with a very wide and puffy skirt. She also has relatively thin arms."}, {"type": "paragraph", "text": "In the Digitally Colored Manga, she has brown hair and a matching set of brown antlers. Furthermore, her dress is light pink."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Melise seems to be loyal to her family and crew, as she attended a meeting to discuss the Big Mom Pirates' enemies."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Melise has authority over lower-ranking members of her crew. Her combat powers and abilities are unknown, but she is presumably strong as she is an officer of a Yonko-led crew."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "The day before the wedding between Charlotte Pudding and Sanji was set to take place, Melise attended a meeting where the Big Mom Pirates talked about the statuses of their enemies."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name possibly comes from caramélisé, meaning \"caramelized\" in French. This follows the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 85 Chapter 854, Melise makes her debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family are confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.4, Melise is named.", "elements": []}]}], "images": []}]}