{"sections": [{"title": "Charlotte Angel", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Angel is the seventh daughter and 17th child of the Charlotte Family and the younger triplet sister of Cracker and Custard. She is also an officer of the Big Mom Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Angel is a thin woman with purple hair that sticks out to the right and left. She wears an open light green jacket as well as a darker green coat wrapped around her neck, and her chest is mostly exposed, with only a short pink tube top around her breasts. She wears a very short pink fur skirt and long pink boots that go up to her knees."}, {"type": "paragraph", "text": "In her anime debut, she has light brown hair and she wears a purple tube top, purple fur skirt, and a white jacket."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Charlotte_Angel_Manga_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20181020080438", "caption": "Angel's original concept art."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Angel's personality. However, since she took part in Big Mom's plan to assassinate the Vinsmoke Family, she can be considered very loyal to her family and crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Angel has authority over lower-ranking members of her crew. Her combat powers and abilities are unknown, but she is presumably strong as she is an officer of a Yonko-led crew."}, {"type": "paragraph", "text": "Angel possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "For use in assassinating the Vinsmoke Family, she and other members of the Big Mom Pirates were given Walkers. In concept sketches, Angel was shown carrying a large bow and a quiver of arrows."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Angel attended the wedding between Charlotte Pudding and Sanji. During the wedding, the Fire Tank Pirates and Straw Hat Pirates attempted to assassinate Big Mom, but failed, and Angel was among the Big Mom Pirates as they besieged Capone Bege. The Big Mom Pirates were on the verge of victory, but Big Mom's Tamatebako exploded after falling off the Whole Cake Chateau, causing the Chateau and everyone on it to fall to the ground far below. However, the Big Mom Pirates' falls were broken when Streusen turned part of the Chateau into cake."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Angel's name is possibly a reference to the American Angel food cake or the British Angel cake, fitting with the food-themed names of the Charlotte Family.", "elements": []}]}], "images": []}]}