{"sections": [{"title": "Denjiro", "level": 1, "content": [{"type": "paragraph", "text": "Denjiro is a samurai of Wano Country who once served Kozuki Oden as one of the Nine Red Scabbards until Oden's death 20 years ago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "According to a silhouette of him, his hair is gathered into a very long ponytail, and he appears to have large, pointy ears."}, {"type": "paragraph", "text": "At least up until thirty years ago, he always wore sunglasses and had a ponytail. When he was younger, his ponytail was much shorter."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Denjiro was a trickster and a swindler, taking pride in his abilities to manipulate people and get what he wants. In the past, he had extended knowledge regarding the politics of the Flower Capital Yakuza. He was a fan of Kozuki Oden even before becoming his retainer, and held him in high regard for his actions."}, {"type": "paragraph", "text": "After becoming Oden's retainer, he and the rest of the Scabbards worked to aid him in any way, until they were cought by Shimotsuki Yasuie during one of their attempt to steal his money. After being lectured by Yasuie, Denjiro and the rest of the Scabbards became noble and educated samurai. Denjiro, being the more knowledgeable one, was the one who would take some of the teaching onto himself."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Kin'emon", "level": 4, "content": [{"type": "paragraph", "text": "Denjiro is one of Kin'emon's two oldest and closest friends aside from Tsuru, having known him for years even since before they met Kozuki Oden."}], "images": []}, {"title": "Kozuki Oden", "level": 4, "content": [{"type": "paragraph", "text": "Even before becoming his retainer, Denjiro has immense respect for Oden, believing him to be different from other adults that he considers foolish and that respect increased after witnessing him defeat the Mountain God. Because of his admiration for Oden, Denjiro quickly decided to become his follower after his exile from the Flower Capital."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Along with Kawamatsu and Ashura Doji, Denjiro is considered by Kin'emon to have been one of Oden's most powerful followers, being worth 100 men in battle."}], "images": []}, {"title": "Intelligence", "level": 3, "content": [{"type": "paragraph", "text": "Denjiro has extraordinary intelligence from a young age being a master negotiator and swindler, able to acquire great products for a fraction of the price. His intelligence is also shown when he correctly deduced that the reason Kurokoma had sought the offspring of the Mountain God was to manipulate the powerful monstrous beast to oust Hyogoro. His intelligence is great enough that he learned faster than his fellow members of the Nine Red Scabbards during their self-education and being able to guide and teach them himself."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Denjiro was an orphan living in the Flower Capital. At one time 41 years ago, he swindled a pot merchant. He met up with Kin'emon, who showed him a white boar. Denjiro then informed Kin'emon that the boar was an offspring of the Mountain God, which began attacking the capital. The two were approached by Kozuki Oden, who asked them to give the boar to him."}, {"type": "paragraph", "text": "As Oden tried to take the boar from Kin'emon, Denjiro expressed his admiration for Oden. He then panicked when Kin'emon tried to attack the Mountain God but was awestruck to witness Oden striking down the beast. As Oden left the capital in exile, Denjiro decided to become his retainer. He and Kin'emon then followed Oden to Shimotsuki Yasuie's residence at Hakumai. They later followed Oden on his journey to Kuri. After Oden became daimyo of Kuri, Denjiro became one of his retainers."}, {"type": "paragraph", "text": "After Inuarashi, Nekomamushi, and Kawamatsu joined Oden, they were running low on funds. Therefore, he and the other retainers attempted to steal money from Yasuie, but they were caught. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Oden and Wano Country. Following Yasuie's advice, they educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "After meeting the Whitebeard Pirates, Oden and his retainers were having a feast with them. Oden said that he wanted to join the crew, but Denjiro, Kanjuro, Kin'emon, and Raizo voiced out against it. After the Whitebeard Pirates left Wano two weeks later, the retainers discovered Oden, Izo, Inuarashi, and Nekomamushi to be missing."}, {"type": "paragraph", "text": "Denjiro served under Oden until the latter was executed 20 years ago. However, Kin'emon believes that Denjiro is still alive."}, {"type": "paragraph", "text": "At some point, he and Ashura Doji faced Kaido together."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Kaido_Vs_Red_Scabbards.png/revision/latest/scale-to-width-down/180?cb=20191208071646", "caption": "Denjiro and Ashura facing Kaido."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Denjiro's silhouette resembles the initial silhouette of Kanjuro that was shown in the magazine release of Chapter 725.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Volume_Change_725a.png/revision/latest/scale-to-width-down/100?cb=20150613015020", "caption": "Kanjuro's former silhouette."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 921 (p. 9) and Episode 911, Denjiro is first seen in silhouette.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 960 (p. 11), Denjiro is seen for the first time.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 939 (p. 6), Hiyori and Zoro talk about the Scabbards.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 960 (p. 16-17), Denjiro explain the situation to Kin'emon.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 961 (p. 2, 16), Denjiro admiration to Oden is shown.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963 (p. 8-13), The Scabbards take their position seriously.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 962 (p. 4-12), Oden's exploits across Wano are shown.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964 (p. 2-3, 6), Oden leave with the Whitebeard Pirates.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 92 Chapter 922 (p. 8) and Episode 913, Kaido remembers his fight against Ashura Douji and Denjiro.", "elements": []}]}], "images": []}]}