{"sections": [{"title": "Shinobu", "level": 1, "content": [{"type": "paragraph", "text": "Shinobu is a veteran kunoichi from Wano Country loyal to the Kozuki Family, having been Kin'emon's protégé and having served in the Oniwabanshu of the Kozuki Shogunate."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Shinobu is a short and stout middle-aged woman. She has brown hair tied in pigtails and wears pink-colored kunoichi attire."}, {"type": "paragraph", "text": "She appears to have been very beautiful when she was younger, able to capture the hearts of many of her foes according to Hanzo."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shinobu takes great pride in her former beauty and she is offended when someone looks down on her beauty and compares her to her younger appearance."}, {"type": "paragraph", "text": "She also seems to panic easily and she said that she is afraid of sharp objects."}, {"type": "paragraph", "text": "She is extremely serious when it comes to overthrowing Orochi as she became frustrated when Kin'emon's plans began falling apart. When suspecting that the captured Heart Pirates were responsible for leaking the plans, she went as far as to say that the captured should be silenced."}, {"type": "paragraph", "text": "She is sympathetic towards the suffering of Wano citizens who were cruelly oppressed by Orochi, being driven to tears when she recalled how the impoverished people of Ebisu Town were driven by uncontrollable hunger to eat the faulty SMILE fruits given to them by Orochi."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Kozuki Family", "level": 3, "content": [{"type": "paragraph", "text": "Shinobu is very loyal to the Kozuki Family and she supports Kin'emon's efforts to overthrow Orochi. The main reason she ceased being Fukurokuju's subordinate was because he betrayed Oden."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Shinobu trusts the Straw Hats and she works well with them on multiple occassions."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "When Law's crewmates were captured by Orochi's forces, Shinobu became angry from the plan being ruined and suspected Law's crewmates leaking the information. When Shinobu suggested to silence and kill his comrades to prevent an information leak, Law became angry at her and decided to rescue his crewmates himself to prevent Shinobu from killing them and told her that he would not forgive her for doubting his comrades. When Law had not shown up prior to beginning the raid on Onigashima, Shinobu did not care whether he joined the fight or not. Their relationship between each other is strained due to Shinobu's extremist thinking for killing Orochi and would use any means necessary to make sure the plan to kill him succeeds, even if it means silencing allies to prevent an information leak."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Kurozumi Orochi", "level": 4, "content": [{"type": "paragraph", "text": "Shinobu resents and hates Orochi for what he has done to Wano Country and she supports the Kozuki Family in their efforts to overthrow him. Her disgust for him increased when seeing him execute Shimotsuki Yasuie and his delight in the citizens of Wano being under the effects of SMILE."}], "images": []}, {"title": "Fukurokuju", "level": 4, "content": [{"type": "paragraph", "text": "Shinobu once worked under Fukurokuju, but she ceased being his subordinate when he betrayed the Kuzoki Family in favor for Kurozumi Orochi and she hates him for that."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "According to herself, she excels in the \"Art of Bewitchment\" (妖艶の術, Yōen no Jutsu)."}], "images": []}, {"title": "Ninjutsu", "level": 3, "content": [{"type": "paragraph", "text": "As a veteran kunoichi, Shinobu is highly skilled in ninjutsu, stealth, and infiltration techniques. She easily defeated Hanzo of the Orochi Oniwanbanshu."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Shinobu has shown great skill in Shurikenjutsu, able to even richochet them off ground to strike Hanzo's weak point."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Shinobu has the ability to mature things. According to Kiku, anything she touches will rot. As other residents of Wano, she is unaware of the existence of Devil Fruit, and calls her abilities \"Jutsu\", and calls her techniques \"Sexy Ninpo\"."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Shinobu carries a katana."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Over 20 years ago, Shinobu was a protégé of Kin'emon, serving under the Kozuki Family. As a member of the Kozuki Family's Oniwabanshu, she was one of Fukurokuju's subordinates, but she defected after he swore loyalty to Orochi."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Shinobu was summoned by Kin'emon to guide the Straw Hat Pirates at Oden Castle. When Kaido arrived at Kuri, Trafalgar Law alerted everyone inside the castle."}, {"type": "paragraph", "text": "The group was surprised to see Kaido, and Shinobu was shocked to see Momonosuke in dragon form. After Monkey D. Luffy rushed off with Law following him and Kin'emon and Kiku left to rescue Tsuru, the rest tried to escape as Kaido approached the castle and destroyed it with a heat breath."}, {"type": "paragraph", "text": "She used her powers to save the remaining people in the castle from Kaido's attack by creating a hole underneath the castle. Kiku later returned to the ruined castle and informed the group about what happened to Luffy."}, {"type": "paragraph", "text": "Sometime after Luffy was taken by the Beasts Pirates, Shinobu and Nami infiltrated a house and spied on government officials in charge of weapon shipments from the ceiling. One of the officials spotted Nami's looking glass and jabbed a blade into the ceiling. Nami and Shinobu were forced to run away from his attacks, and Shinobu started screaming, tipping the officials off to the presence of humans. However, the duo managed to escape, and Shinobu used ninjutsu to glide through the air. Nami revealed that she found out when and where the weapons shipment was leaving, and Shinobu admitted that she is afraid of sharp objects, much to Nami's chagrin."}, {"type": "paragraph", "text": "Shinobu and Nami later infiltrated Orochi's castle. While they were hiding in the attic, Nico Robin contacted them through Den Den Mushi and informed them that she had been discovered by the Orochi Oniwabanshu. While peeking into the banquet hall from the space above the ceiling, Shinobu and Nami were confronted by Hanzo. He correctly identified Shinobu at first, but then doubted it was her, causing Shinobu to get mad and throw a projectile into his groin, which incapacitated him. Shinobu then collapsed the ceiling, causing it to fall on Kurozumi Orochi. Amidst the chaos in the banquet hall, Shinobu was shocked to witness Kyoshiro striking down Komurasaki. As the shogun pursued Robin and Toko, Shinobu ran past Nami as the latter unleashed Zeus' lightning on Orochi."}, {"type": "paragraph", "text": "After escaping Orochi's palace, Shinobu, Nami, Brook, and Robin dropped Toko off in the red light district before meeting up with Kanjuro at the Northern Graveyards in the Ringo region. Shinobu, Nami, and Robin later went to a bathhouse. While bathing, Shinobu explained to Nami and Robin about Hyogoro and her past as Fukurokuju's subordinate. A Beasts Pirates squad led by Basil Hawkins and X Drake arrived at the bathhouse to look for people with the Kozuki Family's crescent moon symbol on their ankles. Shinobu told Nami to hide behind her, but Hawkins noticed her acting suspiciously. Nami stepped out from hiding and accidentally disrobed, causing Sanji to reveal his presence. Drake then came into the bathhouse and fainted from seeing naked women. While Hawkins was distracted, Shinobu's group took the opportunity to escape. Sanji carried them and flew away from the bathhouse. While flying, Sanji informed them that Law's crew were captured."}, {"type": "paragraph", "text": "They then went to Ebisu Town, where Shinobu got into a heated argument with Law, suspecting that Law's captured crewmates revealed the meaning of Kin'emon's secret message. Law absolutely refused to consider that, intending to prove her wrong once he rescued them. Shinobu replied that they should be disposed of regardless, as they could not afford for things to go wrong in the plan they had waited 20 years to come to fruition. However, Kanjuro disagreed with her, saying that it was most important that they retain the allies they had made, as otherwise they would be unable to bring down Orochi and Kaido. Tonoyasu then entered the house and recognized Shinobu and Kanjuro, much to their surprise. He then showed them a copy of the message and talked about the rumors swirling around the Flower Capital, wondering if the final battle was at hand."}, {"type": "paragraph", "text": "After telling Kanjuro and Shinobu that he would join them, Tonoyasu left the house. Kanjuro and Shinobu then explained to Sanji, Franky, and Robin that they did not actually know who Tonoyasu was, making them questioned on how he knew them."}, {"type": "paragraph", "text": "When news of Tonoyasu's capture was revealed, Shinobu and her group gathered to see him being shown on a broadcast. She finally recognized him as Yasuie, the former daimyo who supported Oden, and explained his past before his fall from grace. Shinobu and her group rushed to Rasetsu Town but only arrived after Yasuie was shot to death. As she mourned for Yasuie, Shinobu explained to the Straw Hats about why the people of Ebisu Town could only laugh despite their pain and revealed more information on the SMILE fruits. After Sanji and Zoro started a commotion by protecting Toko from Orochi, Shinobu told the Straw Hats next to her to retrieve Yasuie's body."}, {"type": "paragraph", "text": "As the Flower Capital went into high alert, Shinobu and Sanji surveyed the situation from a rooftop. Shinobu pointed out that they still needed to free the Kozuki Family supporters that were still imprisoned. The two also noticed the citizens preparing for the Fire Festival. They later joined a meeting with several key alliance members at Amigasa Village."}, {"type": "paragraph", "text": "On the day for the raid on Onigashima, Shinobu marched to the rebel meeting place with Momonosuke, Kin'emon, Kanjuro, Raizo, Kikunojo, Inuarashi, Kawamatsu, and Ashura. The group eventually arrived at the meeting place in Port Tokage, but found none of their ships and allies."}, {"type": "paragraph", "text": "Shinobu tearfully held Momonosuke back as he tried to stop the rest of the group from going through with the raid."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Shinobu means \"to endure\" or \"to conceal oneself\" and is the verb form for \"shinobi\".", "elements": []}]}], "images": []}]}