{"sections": [{"title": "Kawamatsu", "level": 1, "content": [{"type": "paragraph", "text": "Kawamatsu the Kappa is a yokozuna-ranked sumo wrestler. He is a fish-man who was shipwrecked in Wano and orphaned soon afterwards. After Kozuki Oden rescued him from citizens ostracizing him, he went on to serve as one of Oden's Nine Red Scabbards until Oden's death 20 years ago."}, {"type": "paragraph", "text": "Kawamatsu would go on to be imprisoned by the Beasts Pirates for 13 years until he was ultimately freed by Monkey D. Luffy, and he reunited with the Nine Red Scabbards to fight Kurozumi Orochi and Kaido and avenge Oden."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kawamatsu is a large kappa-like fish-man being who is close to the same size as Raizo, and has webbed hands and green skin. He has a round body, two blush marks on his cheeks, a beak-like mouth and he has extremely long and wild orange hair. He wears a green kimono, a red cape, sandals, and a large kasa with a dark diamond shape at its top."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kawamatsu is an extremely kind and caring person, as shown by his care for Kozuki Hiyori and his efforts to make her laugh after the trauma she went through. When one of the Beasts Pirates attempted to attack Luffy, Kawamatsu silently aided him by attacking his attacker with a fishbone. His compassion is best shown when he encountered an impoverished Onimaru and fed the latter with his limited amount of food, despite there being barely enough for himself."}, {"type": "paragraph", "text": "Like other characters, Kawamatsu possesses a unique laugh: \"Kappappappa\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Mother", "level": 4, "content": [{"type": "paragraph", "text": "Kawamatsu appeared to be very close to his mother, as she protected him from discrimination until one event led to her demise. In her dying moments, she told her son to act as a kappa for better survival. Kawamatsu obediently heeded her last words for many years. Even after becoming one of Oden's retainers, Kawamatsu still referred to himself as a kappa, even naming his personal swordsmanship style after it."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "As a small child, Oden saved Kawamatsu from death by discriminatory humans and offered him freshly cooked food, which Kawamatsu was extremely grateful for. From then on, Kawamatsu became one of Oden's most loyal followers."}, {"type": "paragraph", "text": "As Oden's retainer, Kawamatsu is also extremely loyal to his lord's children. He was the one who helped young Hiyori escape from their enemies at Oden Castle and took care of her for 5 years during her childhood, even endured long term starvation to ensure Hiyori had enough food, making Hiyori chose to ran away out of concern for him. When she ran away, Kawamatsu desperately searched for her and was filled with regret when he could not find her. After reuniting with Raizo after twenty years, the first thing he did was asking about Momonosuke's safety, showing his concern for Oden's son. Unlike Ashura Doji (who refused at first), Kawamatsu had been eager to join the Kozuki Family in the war against Orochi and Kaido. When reuniting with Hiyori after many years, they were extremely overjoyed to see each other again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a5/Kawamatsu%27s_Kappa_Dance.png/revision/latest?cb=20190421012512", "caption": "Kawamatsu trying to cheer Hiyori up by dancing after the trauma of losing her family."}]}, {"title": "Shimotsuki Yasuie", "level": 4, "content": [{"type": "paragraph", "text": "In his youth, Kawamatsu tried to steal money from Yasuie along with the Nine Red Scabbards only to get caught. Yasuie held no grudge against him and his retainer comrades. Instead, he convinced them to behave as real retainers to support their lord Oden and Wano while freely giving them the money. When Orochi killed his benefactor, he grieved for his death as he watched his execution."}], "images": []}, {"title": "Onimaru", "level": 4, "content": [{"type": "paragraph", "text": "Kawamatsu first met Onimaru 13 years ago, who chased some members of the Beasts Pirates. Kawamatsu nursed the wounded komakitsune back to health. At first, Onimaru was hostile towards Kawamatsu, refusing to let the samurai collect the weapons of the buried in Ringo but he relented when Kawamatsu offered him his arm. He and Onimaru then worked together to protect the graves from robbers."}, {"type": "paragraph", "text": "However, less than a year later, Kawamatsu was captured and Onimaru inherited the name \"Gyukimaru\". In the present day, when Kawamatsu interfered in \"Gyukimaru\" and Zoro's battle, Onimaru expresses tears of joys upon learning that Kawamatsu is still alive."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Kawamatsu first saw Luffy when he was brought to Udon as a prisoner and protected the latter when a Beasts Pirate attempted to attack him for defiance. As Kawamatsu continued to observe Luffy, he was deeply impressed with Luffy not only in his courage to stand up against the Beasts Pirates but also in his compassion in helping Hyogoro. He even trusted Luffy to protect Hyogoro from being executed in Queen's execution games. After Luffy was freed and planned to start a rebellion, Kawamatsu encouraged Luffy to inspire fellow prisoners to rebel by announcing the Kozuki Family's revolution and happily joined Luffy in preparing to fight the Beasts Pirates."}], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Kawamatsu first encountered Zoro at Ohagi Bridge when the latter was fighting Gyukimaru to retrieve Shusui. When Hiyori offered her father's heirloom Enma to Zoro as a replacement for Shusui, Kawamatsu strongly protested and even considered Zoro delusional when he claimed to have fought Ryuma. Nevertheless, Kawamatsu relented when Hiyori decided to put her faith in Zoro. When Zoro confidently decided to accept Enma as his new sword despite how difficult it was to master, Kawamatsu expressed great praise for him."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Beasts Pirates", "level": 4, "content": [{"type": "paragraph", "text": "During his 13 years of imprisonment at the prisoner mines, Kawamatsu refuses to submit to his enemies and defiantly stays in his cell chained up. After being freed, he wasted no time in attacking them with his reunited allies."}], "images": []}, {"title": "Kurozumi Orochi", "level": 4, "content": [{"type": "paragraph", "text": "When meeting Raizo again after many years in Udon prison, Kawamatsu expressed eagerness in joining the cause to overthrow Orochi. Also, Orochi was the one who ordered the Beasts Pirates to feed him poisonous fish for the past thirteen years to kill him in a slow and painful way."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of the Nine Red Scabbards, Kin'emon considers Kawamatsu, alongside Denjiro and Ashura Doji, to have been one of Oden's most powerful followers, being worth 100 men in battle."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a fish-man, Kawamatsu is a fast digger and swimmer, which enabled him to sneak Hiyori out of Oden Castle."}, {"type": "paragraph", "text": "Kawamatsu also possesses tremendous physical power as he is stated to be the strongest sumo wrestler in Wano. Shortly after being released, Kawamatsu overpowered multiple members of the Beast Pirates with great ease."}, {"type": "paragraph", "text": "Kawamatsu possesses immense endurance as he has been fed poisoned fish every day for thirteen years by the Beasts Pirates without dying or even suffering any illness like Tama, a feat which has baffled his captors. He was also shown to go on while starving himself while providing for Hiyori. He could withstand Onimaru violently biting his arm and survive the freezing cold winter climate of Ringo as well as days of hunger."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "As one of the most powerful samurai in Wano, Kawamatsu is an extremely skilled swordsman and wields a shirasaya named Soto Muso. Raizo states that his skill has not waned at all even after thirteen years of imprisonment. He calls his personal style the Kappa-ryu (河童流, Kappa-ryū), which is a Strong Blade swordsmanship incorporating his powerful fish-man strength and sumo skills to create rushing attacks that overpower large numbers of opponents with sheer force akin to raging waves."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Kawamatsu is capable of spitting projectiles with great speed and precision, potentially turning them into deadly weapons if they are sharp enough. Thus, his guards are ordered to remove the bones of the fish they feed him. When they failed to do this, he was able to take out a guard by spitting the bone as a projectile that pierced his neck."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Kawamatsu possesses the ability to use Busoshoku Haki, which is called \"Ryuo\" in Wano. This is shown when he performed an attack named Yagura Ryuo (櫓流桜, Yagura Ryūō, literally meaning \"Tower Flowing Sakura\") which repelled several Beasts Pirates charging toward him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Kawamatsu was a child, he and his mother drifted to Wano Country after their ship sank. When they tried to find help, the humans threw stones at them. Before dying, his mother told him that fish-men suffered discrimination and since then, Kawamatsu posed as a kappa."}, {"type": "paragraph", "text": "33 years ago, Kawamatsu discovered Inuarashi and Nekomamushi at Kuri Beach after the two minks drifted to Wano. Afterwards, the three were caught and persecuted by some humans until Kozuki Oden came and rescued them. They then followed Oden back to Kuri and became his retainers."}, {"type": "paragraph", "text": "When they were running low on funds, the retainers attempted to steal money from Shimotsuki Yasuie, but they were caught. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Kozuki Oden and Wano Country. Following Yasuie's advice, they educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "Kawamatsu served under Oden until the latter was executed 20 years ago. Rushing to Oden Castle, the retainers discovered it set on fire by the Beasts Pirates. Finding Oden's wife and children inside, the group devised a plan. While Toki sent Kin'emon, Kanjuro and Raizo 20 years into the future with Momonosuke, the retainers had Kawamatsu stay with the 6 year old Hiyori as a precaution to ensure that the Kozuki Family blood survived in case their plan failed. Following the group vanishing and as the castle was surrounded by enemies by all sides, Kawamatsu dug into a water channel so the pair could escape unnoticed. As a result, Oden's family and retainers there were believed to be dead, leading to gravestones being erected at the castle for them. Taking care of Hiyori, he always tried to cheer her up and would let himself go hungry so she had enough to eat. While Hiyori was initially mute, over time he was able to make her laugh."}, {"type": "paragraph", "text": "After seven years of taking care of Hiyori, she wrote a letter for him and left. When Kawamatsu found and read it, he cried and unsuccessfully searched across Wano for her. To find another purpose in life, he ventured into Ringo's graveyard to collect the swords from the graves in order to arm the rebels for the day Momonosuke and his retainers return. Despite the initial resistance of the fox Onimaru who guarded the graveyard from grave robbers, he managed to convince the fox to help him with his cause while at the same time joining forces together to protect the cemetery. As the swords in the cemetery were not enough, Kawamatsu forced the grave robbers to surrender their weapons every time he chased them out. Kawamatsu also invented the name \"Gyukimaru\" to mask ​​​​​his identity.  "}, {"type": "paragraph", "text": "He was later caught when he was stealing abura-age in the Flower Capital. He was then imprisoned in Udon and kept chained in a cell, where he was fed only poisonous bone-less fish on Kurozumi Orochi's orders. From eating fish over the course of 13 years, his insides turned over and over each day, though the experience paled in comparison to his regret of being unable to help Oden."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5f/Humans_Attack_Young_Kawamatsu.png/revision/latest/scale-to-width-down/210?cb=20191125140537", "caption": "Kawamatsu and his mother being attacked by humans."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/Kawamatsu_Rescuing_Hiyori.png/revision/latest?cb=20191123094603", "caption": "Kawamatsu rescuing Hiyori."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/70/Kawamatsu_Grave_Robbing.png/revision/latest/scale-to-width-down/210?cb=20191123094521", "caption": "Kawamatsu collecting weapons."}]}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Monkey D. Luffy was brought to Udon, Kawamatsu spat a fishbone at one of the guards when the guard attempted to attack Luffy. He later witnessed Dobon's confrontation with Luffy and Eustass Kid."}, {"type": "paragraph", "text": "When Luffy and Hyogoro were brought before Queen, Kawamatsu called out to Raizo while the ninja was in front of his cell. After revealing himself, he asked if Momonosuke was okay. He then asked Raizo to help him escape so he could join the decisive battle against the Beasts Pirates during the Fire Festival. Raizo was spotted and forced to disappear in a smokescreen. Kawamatsu then noticed how Luffy had been causing a commotion and prayed that he would not let Hyogoro die."}, {"type": "paragraph", "text": "Sometime during the Sumo Inferno, Kawamatsu commented that he wanted to try a sumo match as well. On the next day, Kawamatsu watched the broadcast of Yasuie's execution with tears in his eyes."}, {"type": "paragraph", "text": "During a fight between Queen and Big Mom, Kawamatsu's cell was damaged. When Babanuki turned the prisoners against Luffy, Kawamatsu got everyone's attention by shouting out to Luffy. After Babanuki revealed Kawamatsu's identity, some guards attempted to kill him, but Kawamatsu kept them at bay by spitting fishbones until Raizo tossed him Soto Muso and the key to his handcuffs. After freeing himself, Kawamatsu repelled several more guards and went into the clearing, where he joined Raizo, Kikunojo, Hyogoro, Tony Tony Chopper, and Luffy against the Beasts Pirates."}, {"type": "paragraph", "text": "Kawamatsu and his allies fought against the Beasts Pirates, but they were soon cornered by prisoners who were infected with the Mummy virus. As Luffy swayed the prisoners, Kawamatsu noticed that Babanuki was preparing to fire something. He was then impressed when Luffy defeated Babanuki."}, {"type": "paragraph", "text": "After the prison takeover was completed, Kawamatsu decided to temporarily leave Luffy's group to take care of some business. He promised to rejoin them before the Fire Festival. Later, at the Oihagi Bridge, Kawamatsu interrupted the fight between Roronoa Zoro and Gyukimaru and Hiyori reunited with him. However, the reunion was interrupted when some Beasts Pirates arrived seeking revenge on Gyukimaru for stealing their weapons. Kawamatsu and Zoro fought the Beasts Pirates as Gyukimaru fled."}, {"type": "paragraph", "text": "After the Beasts Pirates were defeated, Kawamatsu got reacquainted with Hiyori and told her of his ordeals after they separated. He told her of the story of Shimotsuki Ushimaru and his fox companion Onimaru. They caught up with Zoro at a passageway leading to an underground chamber where Kawamatsu kept a stash of weapons. Kawamatsu entered the secret room alone and spoke to Kin'emon via Smart Tanishi and informed him of the weapon stash."}, {"type": "paragraph", "text": "He later went back outside and objected to Hiyori offering Enma to Zoro in exchange for Shusui's return. He was also skeptical of Zoro's claim of fighting Ryuma's corpse. Hiyori then told Kawamatsu and Zoro that she would not be joining them in meeting their allies as she did not want to distract them from their preparations for war. After leaving Hiyori in a safe place, Kawamatsu and Zoro joined a meeting with Kin'emon at Amigasa Village."}, {"type": "paragraph", "text": "They then told the group at Amigasa Village that Hiyori is alive. After Tenguyama Hitetsu gave Enma to Zoro, Kawamatsu was impressed to see Zoro taming Enma. On the day for the raid on Onigashima, Kawamatsu marched to the rebel meeting place with Momonosuke, Kin'emon, Kanjuro, Raizo, Ashura, Inuarashi, Shinobu, and Kikunojo. The group eventually arrived at the meeting place, but found none of their ships and allies. In spite of this major setback, the Scabbards were still determined to go through with the raid, knowing that they would not get another chance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3e/Luffy%27s_Group_Fights_in_Udon.png/revision/latest/scale-to-width-down/210?cb=20190709072609", "caption": "Kawamatsu joining his allies."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Kawamatsu_and_Onimaru%27s_Weapons_Collection.png/revision/latest/scale-to-width-down/210?cb=20190917190025", "caption": "Kawamatsu informing Kin'emon about the weapon stash in Ringo."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kawamatsu and Onimaru vs. grave robbers (multiple times)", "elements": [{"text": "Kawamatsu vs. Bingo, Bongo, and Bungo", "elements": []}]}, {"text": "Kawamatsu, Monkey D. Luffy, Tony Tony Chopper, Hyogoro, Kikunojo, and Raizo vs. Beasts Pirates (Udon Prisoner Mines)", "elements": []}, {"text": "Kawamatsu and Roronoa Zoro vs. Beasts Pirates (Oihagi Bridge)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kawamatsu possibly had a different initial design, featuring a rounded head. However, that could also have been a silhouette of his hat while at an angle, as he is seen sitting slightly upwards, which allows for the possibility of him tilting his head up and hat down, creating the illusion of a rounded head.", "elements": []}, {"text": "The name Kawamatsu (河松, Kawamatsu) literally translates to \"river pine\", while the term kappa (河童, kappa) means \"river-child\".", "elements": []}, {"text": "Kawamatsu's Haki technique Yagura Ryuo refers to yagura tower structures in Japanese castles. Sumo competitions have a tradition of taiko drumming from atop a yagura (yagura-daiko), which fits into Kawamatsu's profession as a sumo wrestler.", "elements": []}, {"text": "He is the second kappa-like character introduced in the story, the first being the non-canon character DJ Gappa.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4c/Kawamatsu_Initial_Design.png/revision/latest/scale-to-width-down/95?cb=20190705214924", "caption": "Kawamatsu's initial design."}]}]}