{"sections": [{"title": "Ririka", "level": 1, "content": [{"type": "paragraph", "text": "Ririka is a bartender who runs a local bar in Shells Town. She is also the mother of Rika."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ririka is a woman of average height and weight. She has brown hair that is usually tied back. She wears a light green dress over a dark green shirt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She is very protective of her daughter, as she made her stay away from Luffy after he punched Helmeppo, fearing for her safety if she was associated with him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Romance Dawn Arc", "level": 3, "content": [{"type": "paragraph", "text": "Ririka was first seen after Luffy punched Helmeppo, telling Rika to get inside and get away from Luffy. She then asked Rika if she had gone to the execution grounds again, to which her daughter replied no. After Morgan was defeated, she thanked Luffy and Zoro for saving the town by treating them to a meal at her home. She happily carried away empty dishes while the two and Koby ate. When Luffy punched Koby, she was seen looking on with a concerned look on her face and with her hands on Rika's shoulders."}], "images": []}, {"title": "Diary of Koby-Meppo", "level": 3, "content": [{"type": "paragraph", "text": "She was later seen calming down Rika when her daughter learned that Koby and Helmeppo had left for Marine Headquarters. She explained that they would come back one day as Marine officers."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 4 (p. 3) and Episode 2, Ririka debuts.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Ririka's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 34), Ririka's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 7 (p. 4-17) and Episode 3, Ririka has Luffy, Zoro and Koby as guests.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 14 Chapter 118, Ririka tries to calm down Rika.", "elements": []}]}], "images": []}]}