{"sections": [{"title": "Nefertari Cobra", "level": 1, "content": [{"type": "paragraph", "text": "Nefertari Cobra is the 12th king of Alabasta,Titi's husband, and Nefertari Vivi's father."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cobra is a man of average height. He has a wrinkled face, a tied-off beard, and long, curly, black hair. He wears a green robe with yellow edging, an orange and beige sash around his waist, and a purple coat. He also wears sandals and a necklace."}, {"type": "paragraph", "text": "After the timeskip he grew a mustache, his beard has turned completely gray, and only half of his hair is still dark. His sideburns are gray but the upper half of the back and top are black. He wears a lighter colored robe and coat and no longer wears his necklace."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Cobra is a fair man, who cares for his kingdom and people even after their rebellion, knowing their misled coup was still only rooted in a desire to preserve the welfare of the Alabastan people. He is loyal to the line of Alabastan kings and the Dynasty, and was willing to face death to prevent Crocodile from seizing the throne. Yet, as a testament to his character, this loyalty to the monarchy is superseded by the compassion toward his subjects and he places their survival and welfare ahead of his own, even willing to allow the occupation and possible destruction of his capital city if it meant preventing the bloodshed of his people, seeing the lives of his citizens as the true heart of his kingdom."}, {"type": "paragraph", "text": "Overall, he is objective, able to look ahead to the future and not make impulsive decisions. This is shown clearly when Koza demands that he use Dance Powder to assuage the difficulties of the current drought, and Cobra explains that other countries need rain and hoarding it themselves is not a true solution. He still remains humble, and he even bowed before the Straw Hats in the bathhouse for helping his daughter, justifying it by saying that without his clothes, he does not have his status as a king, and is doing it as a father. In addition, he is charitable, paying to support the citizens of Koza's village out of the royal family's living expenses without hesitation."}, {"type": "paragraph", "text": "He tried to raise his daughter humbly and somewhat as a normal child, as he wasn't overly upset when another child got into a physical fight with Vivi, as well as letting Vivi simply refer to him as \"dad\". He let Vivi have a lot of freedom as child and play with commoner children. However he still worried a lot about her and often sneaked after her to check if she is doing okay. Like most fathers, he also wants what he thinks is best for his daughter and tried to persuade Vivi into finding a husband before he passes away from his illness, but Cobra's words fall on deft ears as Vivi's tells him to send the suitors away, still wishing to remain a free spirit like the Straw Hats. Vivi also berated her father on using his illness as an excuse for her to marry."}, {"type": "paragraph", "text": "He also appears to have a mischievous side, telling the Straw Hats where the women's baths were so they could peep at Nami and his daughter."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "In addition to his royal authority over all of Alabasta's troops, Cobra was a reasonably athletic man in his youth, enough to help Igaram fight members of Agotogi's gang hand-to-hand. Though apparently lacking any formal combat training, he even exercised a \"technique\" known as the King Chop (キングチョップ, Kinguchoppu) on subjects who annoyed him, up to and including his own ministers."}, {"type": "paragraph", "text": "By the time of Operation Utopia, he had become infirm enough to be easily manhandled by Mr. 4 and Miss Merry Christmas (as well as Miss All-Sunday). At the same time, he still possessed enough stamina to survive being crucified through the elbows for several hours."}, {"type": "paragraph", "text": "Some time after the Straw Hat Pirates left Alabasta, he became severely ill, and permanently confined to a wheelchair. By the time of the first post-Battle of Marineford Levely, his mortality became a matter of open question."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Golden Age of Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After the infamous execution of Pirate King, Gol D. Roger at Loguetown, Cobra read over a newspaper of the events and gravely announced that a terrible age has begun. Igaram and Vivi's mother were with him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Cobra_During_Roger%27s_Execution.png/revision/latest/scale-to-width-down/210?cb=20130120234100", "caption": "Cobra with his wife and Igaram reading about the Golden Age of Pirates."}]}, {"title": "Abduction Attempt on Vivi", "level": 4, "content": [{"type": "paragraph", "text": "Several years later, Cobra was responding to a drought that struck Koza's village. He was unable to send rain, but was able to allow the citizens to reside in Alubarna. Around this time, Vivi befriended Koza, and during a kidnapping attempt made on Vivi, Cobra defeated the last remaining kidnapper before Chaka and Pell could arrive. He had Koza treated for the injury over his eye, and asked if he loved the country, to which Koza replied that he did. Igaram, hearing that Vivi was more concerned about the possibility of her new friends sacrificing themselves for her than what might happen to her, was concerned that Vivi was too kind-hearted for a ruler, but Cobra insisted the situation was fine."}, {"type": "paragraph", "text": "To thank Koza for defending Vivi, Cobra allowed Toto to set up a village in Yuba."}], "images": []}, {"title": "Levely", "level": 4, "content": [{"type": "paragraph", "text": "Six years before the start of the story, Cobra was at a Levely to discuss Monkey D. Dragon's threat to the stability of the world. When Wapol brushed it off, saying that it did not concern him, Cobra berated him for his irresponsible attitude. Wapol attempted to provoke a war by hitting Vivi, but the plan failed when Vivi, knowing the situation's implications, did not get upset as he had hoped."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Cobra_Yells_at_Wapol.png/revision/latest/scale-to-width-down/200?cb=20180615062732", "caption": "Cobra scolds Wapol for his selfish behavior at the meeting in Mary Geoise."}]}, {"title": "Baroque Works' False Accusation", "level": 4, "content": [{"type": "paragraph", "text": "Three years later, a drought spread throughout the kingdom, and due to Baroque Works' schemes, Alabasta's citizens began to believe that Cobra had hoarded Dance Powder in Alubarna. About a year after the start of the drought, Koza confronted the king and demanded that he use Dance Powder to save Yuba, but Cobra refused, stating that other towns needed their help. Koza then vowed to take back the rain by force. At some point around this time, Vivi left with Igaram to infiltrate Baroque Works, which, unbeknownst to Cobra and the rest of Alabasta, were manipulating the situation to start a rebellion."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Cobra expressed his gratitude for Crocodile defeating some pirates that tried to raid Nanohana, not knowing of Crocodile's true nature. Soon afterwards, Vivi sent a letter to him, revealing the truth about the rebellion. Cobra made the decision to send Pell to Erumalu and Chaka to set up the Royal Army in order to protect it from Baroque Works and Rebel Army."}, {"type": "paragraph", "text": "However, Cobra was soon kidnapped by Mr. 4 and Miss Merry Christmas, and Mr. 2 Bon Kurei went to Nanohana disguised as him, falsely confessing to using Dance Powder and ordering the town destroyed in order to incite the rebellion to attack. Mr. 4 and Miss Merry Christmas returned him to Alubarna and left him bound near the Eastern Gate."}, {"type": "paragraph", "text": "When Crocodile arrived at the palace, he pinned Cobra to a wall and demanded to know the location of Pluton. Cobra admitted to having no knowledge of it, so Crocodile asked about the location of the Poneglyph. Cobra agreed to lead him there. Crocodile had Cobra lead Miss All Sunday to the Alabasta Poneglyph to gather information about Pluton. He displayed visible surprise when she deciphered the Poneglyph's message as mere historical records of Alabasta. When Luffy arrived there and fought against Crocodile one last time, Cobra witnessed the battle, and was amazed by Luffy's finishing attack that punched Crocodile through bedrock."}, {"type": "paragraph", "text": "After the battle, Robin handed him the antidote to Crocodile's venom, which he gave to Luffy, telling her that he knew that contrary to what she had told Crocodile, the Poneglyph truly revealed the location of the weapon. He was surprised to hear about the \"True History\" that Robin had been searching for. Luffy then stood up and managed to carry him and Robin out of the tomb, but lost consciousness shortly after escaping, requiring Cobra to carry him the rest of the way. Cobra's innocence is proven when Kappa, having regained consciousness and the ability to speak, reveals that the King seen in Nanohana was an impostor. After Koza said that what he and the rebels had done was unforgivable, Cobra replied that the nation had lost much but gained nothing from the conflict, and now had to move forward and unite."}, {"type": "paragraph", "text": "Cobra allowed the Straw Hats to stay at the palace while they recovered from their injuries, and had a great feast to celebrate their victory. Cobra had intended for it to be a quiet feast, but knew that with the Straw Hats, it would turn into a party. They then went to the palace baths and Cobra showed Sanji where Vivi and Nami were bathing. While peaking, he and the others were overwhelmed by Nami's \"Happiness Punch\". Cobra then thanked the Straw Hats for helping Vivi, as her father rather than as a king."}, {"type": "paragraph", "text": "The next morning, Cobra tries to peek in on Vivi dressing, but Terracotta repels him, giving him a lump on the head in the process. After Vivi is dressed, Cobra notes that his daughter looks like her mother, and Vivi tells him and Igaram that she has something important to tell them (possibly related to her plan to bid the Straw Hats goodbye), calling him \"Father\" instead of \"Papa\". After Vivi's speech, in which Igaram serves as a stand-in, Cobra regretfully notes that it is hard for a father to no longer be called \"Papa\" by his daughter."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the events of the Enies Lobby arc, Cobra is surprised to see Nico Robin as part of the Straw Hat crew, noting that she is \"unpredictable,\" and to see Vivi not surprised by the revelation."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Weeks after the events of the Whitebeard War, Cobra has been informed by Chaka and Pell that a group of pirates have been driven out of the country without much damage. Cobra then wished that all the pirates in the world could be like the Straw Hats. He also read a newspaper article concerning Luffy."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Cobra is shown to be bed ridden and reading a newspaper. Vivi brought him some flowers and groceries and placed them in his room."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Cobra departed from Alabasta with his daughter, Chaka, Pell, and Karoo and journeyed to Mary Geoise for the upcoming Levely. Despite being in poor health, Cobra intended to ask the World Government about the Poneglyphs ever since meeting Nico Robin. While conversing with Vivi, he attempted to take advantage of his illness to convince his daughter to find herself a suitor, but Vivi saw through him and turned him down."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Alabasta Kingdom participants later arrived at Mary Geoise. Just prior to the Levely, Cobra received a letter from Fujitora and had a meeting with the admiral and Riku Doldo III. Cobra also requested an audience with the Five Elders as well. Cobra later went to the conference room with the other kings and queens to begin the Levely."}, {"type": "paragraph", "text": "Cobra and Doldo were able to convince the other royals to vote for abolishing the Shichibukai system."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "For unknown reasons, his name was changed to Nebra in the 4Kids dubbed anime (although the name \"Cobra\" still remained in some bits of closed captioning during broadcasts). Some fans have speculated that this occurred because contemporary 4Kids property G.I. Joe: Sigma 6 featured a villainous terrorist organization named Cobra."}, {"type": "paragraph", "text": "In the Viz manga and Funimation's dub of the eighth movie, his name remains Cobra, but like Vivi, his family name is spelled Nefeltari."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His given name, combined with his title, appear to be a reference to the King Cobra.", "elements": [{"text": "The stylized, upright form of an Egyptian cobra (asp, serpent, or snake), is used as a symbol called a \"Uraeus\" (literally meaning \"rearing cobra\") that represents sovereignty, royalty, deity, and divine authority in ancient Egypt.", "elements": []}, {"text": "His surname Nefertari may be based on Nefertari Meritmut, the wife of famed pharaoh Ramesses the Great.", "elements": []}]}]}], "images": []}]}