{"sections": [{"title": "Nefertari Vivi", "level": 1, "content": [{"type": "paragraph", "text": "Nefertari Vivi is the princess of Alabasta. She is the daughter of Nefertari Cobra and Titi. She was one of the main antagonists of the Reverse Mountain Arc under the Baroque Works codename Miss Wednesday. However, she ended up joining the Straw Hat Pirates for most of the Alabasta Saga after revealing herself to be a spy plotting against Baroque Works. She left the crew after defeating Baroque Works to stay in her home country, but has been shown to be keeping track of the Straw Hat's progress."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Vivi is a young woman with long wavy light blue hair, with two locks hanging down, one on either side of her head, which started out at about chin-length but were past her shoulders by her last appearance before the timeskip. She most often wears her hair pulled back into a ponytail, and brown eyes. She has a slender body but tends to wear less-revealing clothing than Nami and Robin do. Vivi has been seen wearing several different high heeled shoes, including white high heel boots, white high heel sandals, and blue wedges."}, {"type": "paragraph", "text": "Though she is a princess, she rarely wore clothing that would suggest her royal status while traveling with the Straw Hats, although she started to do so more regularly after her coming-of-age speech."}, {"type": "paragraph", "text": "On the cover of Chapter 640, Vivi was shown after the time-skip. She now wears her hair down but held back by a clip, and it seems a bit shorter than before. Like most female characters since the timeskip, her hourglass figure has become more pronounced."}, {"type": "paragraph", "text": "A notable facet of her appearance is that when she was a member of Baroque Works, she seemed to have been drawn in a slightly different way. While playing the role of Miss Wednesday, she looked older, and her facial features were much more angular. She wore her ponytail in a very high position until she was attacked by Miss Valentine, where a few strands of her hair were slashed off with her hair bead. It was only after she allied herself with the Straw Hats that she was drawn to look more like a teenage girl, with slightly bigger/rounder facial features and a less shapely body. This was more noticeable in the anime than the manga, as the animators drew her in such a different way that she could almost be mistaken for another character."}, {"type": "paragraph", "text": "As a child, she had shoulder-length hair tied in a ponytail."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Vivi does not fit the stereotype of a needy and authoritative princess, never demanding any special attention or prioritizing herself above others. In fact, she usually puts the needs of others far above her own and is hesitant to rely on others or ask for help with her problems. In particular, she places an enormous value on the citizens of her country and the lives of her friends. Vivi's selfless nature could be seen especially when she asked the Straw Hats to make a detour to get medical help for Nami instead of continuing straight to Alabasta, even though she knew her country was in a state of emergency."}, {"type": "paragraph", "text": "She is also extremely brave and determined, going up against powerful enemies for her friends' sake even when clearly outmatched. Her selflessness and sense of responsibility push her to carry her country's burden. She is slow to anger and quick to forgive but fiercely loyal to her friends, her family, and her country."}, {"type": "paragraph", "text": "As a member of Alabasta's royal family, she loves her country and is willing to do anything to protect it, even infiltrating a vast criminal organization. She doesn't mind doing tasks that seem unsuitable for a princess, such as washing dishes."}, {"type": "paragraph", "text": "Vivi grew up knowing that she was responsible for the well-being of her country. As such, she developed impressive skills as a diplomat. Even as a child, she understood what being a princess meant and acted with wisdom beyond her years: when slapped by Wapol, she apologized for being in his way and held back her tears until he was out of earshot, all for the sake of preventing an international incident. When they reached Drum Island, she was able to persuade Luffy to not attack the villagers and even put on a brave face after being shot in the arm. Her courage convinced the villagers to allow them into the village peacefully."}, {"type": "paragraph", "text": "During arguments, Vivi has a hard time coming up with insults and usually ends up saying something of little offense. She has a habit of giving people nicknames, calling Zoro \"Mr. Bushido,\" for example. She also has a habit of biting her bottom lip when she is worried. Despite her kind and earnest nature, she can be deceptive when necessary. At age fourteen, she was able to infiltrate Baroque Works and, over the course of two years, quickly rose to frontier agent status without anybody realizing her true identity."}, {"type": "paragraph", "text": "A running gag throughout much of the Alabasta Arc was that Vivi constantly forgot to warn the Straw Hats about various dangers of the desert, such as giant scorpions and lizards, until after they appeared. Luffy, Zoro, and Sanji quickly dispatched any threatening creatures but berated her for her inability to remember such things beforehand."}, {"type": "paragraph", "text": "Vivi is also self-conscious about her lack of physical strength. After being nearly eaten alive by one Bananawani, she witnessed Luffy and Zoro defeated a group of them easily, causing Vivi to wail to Usopp about not being able to handle even one."}, {"type": "paragraph", "text": "After the timeskip, it is shown that her time with the Straw Hats have changed her, as Vivi's adventurous side from her times as a pirate showed itself when she was about to head to Mary Geoise for Levely. She apparently misses her time on the sea, as she felt reminiscent from the breeze from the salty ocean. She even jumped down from the mast of the ship, worrying those around her who were not with her during her time as a pirate."}, {"type": "paragraph", "text": "Vivi will not hesitate to stand up for someone whom she just befriended as she spoke out against Charlos' attempt to enslave Shirahoshi. When Neptune expressed his digust at the World Noble's actions and went on to attack him, saying he would never bring his kind to the surface again, Vivi was brought to tears, saying that not all humans are like the World Nobles.  "}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Vivi_anger.png/revision/latest/scale-to-width-down/200?cb=20171002071211", "caption": "One of Vivi's anger moments."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Cobra", "level": 4, "content": [{"type": "paragraph", "text": "King Cobra has great faith in his daughter's strong determination and will. He shows the nearly same level of paranoia about Vivi's safety as Igaram and was relieved to learn of her safety after her time with Baroque Works."}], "images": []}, {"title": "Titi", "level": 4, "content": [{"type": "paragraph", "text": "Vivi's mother, Queen Titi, died many years before the current storyline. The duration and nature of their relationship is unknown."}], "images": []}, {"title": "Subjects", "level": 3, "content": [], "images": []}, {"title": "Chaka and Pell", "level": 4, "content": [{"type": "paragraph", "text": "The two great warriors of Alabasta, Chaka and Pell, have always watched over Vivi. Pell is especially fond of her, even taking her for a ride despite the king having forbidden it."}], "images": []}, {"title": "Super Spot-Billed Duck Troops", "level": 4, "content": [{"type": "paragraph", "text": "Like Karoo, Vivi has accepted the entire Super Spot-Billed Duck Troops as her pets as well as a means of transportation. The troops in turn are very loyal to Vivi and Karoo, so much so that they assisted them and the Straw Hats in traveling through the desert, and later in the fight against Baroque Works. The newest member, Matsuge, also helped in the fight against Baroque Works and has been very close with the princess ever since, even sometimes seen shopping with her and Karoo."}], "images": []}, {"title": "Igaram", "level": 4, "content": [{"type": "paragraph", "text": "Likewise, Igaram was fond of the Princess and often acted with such deep concern for her well being that it bordered on paranoia. He also willingly risked his life to protect her when their infiltration of Baroque Works was discovered."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Karoo", "level": 4, "content": [{"type": "paragraph", "text": "Vivi is also very close with her pet, Karoo the spot-billed duck. She cares deeply for him, as shown when she refused to leave with the Straw Hats without him. Whenever he is put in danger without good reason, she immediately and vehemently berates the person who did so. As they have been together since childhood, the two have an exceptionally strong bond, and he is willing to do most anything for her, though this bond does not stop Vivi from scolding him when he disobeys or misunderstands her simplest orders. Despite this, she knows she can count on him and entrusts him with very important tasks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Vivi_and_Karoo_as_Children.png/revision/latest/scale-to-width-down/210?cb=20171002071022", "caption": "Vivi and Karoo when they were very young."}]}, {"title": "Koza", "level": 4, "content": [{"type": "paragraph", "text": "Koza, the leader of the rebellion, has been a close personal friend of Vivi's for 11 years. Though they originally met on bad terms, there soon came to be a level of respect between them. The two became close childhood friends, even co-leading a large childhood group called the Suna Suna Clan. Vivi owes her life to him for saving her from some kidnappers as a child. Her friendship with him led Baroque Works to fear the repercussions of the pair meeting up again, and they did everything possible to prevent the two from seeing each other."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Vivi traveled with and assisted the pirates for almost the entire Alabasta Saga and strongly considered joining their crew after Crocodile's defeat. Though she ultimately declined their offer in favor of working to restore her country, she remains closer to the Straw Hats than anyone else outside of their crew. She and Karoo are now regarded as honorary members of the Straw Hat Pirates, at least by Luffy and the others. Her close relationship with the Straw Hats were further emphasized when she was one of the few people who realized Luffy had a message for the crew during his second appearance at Marineford, but she did not understand the message since she had no context. Upon learning of what the Straw Hats did at Dressrosa, she immediately knew what they were doing."}, {"type": "paragraph", "text": "When traveling with the Straw Hats, Vivi had a great amount of respect for Monkey D. Luffy, both as a captain and as her friend, openly showing both amazement and disbelief at his great strength and fighting abilities, which would sometimes make her doubt her own fighting skills and feel the need to show that she can handle herself despite the clear difference in fighting capabilities. Despite this, she also openly showed concern for his reckless behavior and fearlessness during their travels, feeling the need to watch over him from time to time. Whenever she saw Luffy doing something that might compromise the crew's safety, even when he meant to help, she reminded him of a leader's responsibilities. When they reached Drum Island, she was able to persuade Luffy not to attack the villagers, showing how much trust he had in her. At Alabasta, Luffy forced her to admit she needed help in taking down Crocodile and asked her to let him and the crew carry some of her burden. That confrontation cemented their relationship of strong mutual trust. Her high opinion of Luffy did not change when she learned that his father was the world's worst criminal. Instead, she was concerned for his safety. During the Levely Arc, she openly stated her friendship with Luffy to Rebecca and Shirahoshi."}, {"type": "paragraph", "text": "Vivi was originally antagonistic towards Zoro when she was still undercover as a bounty hunter and Baroque Works agent. At Whisky Peak, she boldly tried to kill him and greatly underestimated him in the process. This quickly changed after her failed attempts to attack him and after she witnessed him effortlessly defeating dozens of bounty hunters, including her fellow agents. After her identity was revealed and she began to travel with the crew, Zoro got along well with Vivi, who in turn nicknamed him \"Mr. Bushido.\" However, as the Straw Hats departed from Alabasta, he seemed unperturbed that they had to leave her behind. When the rest of the crew was depressed because of her absence, he commented that they should have taken her by force if they wanted her to stay that badly."}, {"type": "paragraph", "text": "She and Nami also became very good friends. Their personalities seem to be opposites. Nami has a hot-tempered disposition, while Vivi is more calm and collected. They switch personalities when something worrisome happens: Nami is the one to calm down while Vivi panics. The two formed a quick bond and worked together in most situations. During Nami's fight with Miss Double Finger, Nami said that being stabbed in the foot could not compare to the pain Vivi felt for her country. Initially, Nami wanted Vivi to pay 1,000,000,000 for the Straw Hats' assistance. However, because of the bond that they made throughout the journey, Nami decided to give up on the demands for the sake of her friendship with Vivi."}, {"type": "paragraph", "text": "Vivi and Usopp worked well together on more than one occasion and were concerned for each other's well-being. After seeing Luffy dragging Usopp by the nose, she developed a tendency to also grab his nose, using it as a means of getting his attention or a handle by which he could be dragged."}, {"type": "paragraph", "text": "Aside from Sanji's fighting skills and strength, Vivi was also greatly impressed by his cooking skills. In turn, Sanji immediately warmed up to her and greatly showed his attraction towards her on multiple occasions. However, Vivi showed mostly confusion from Sanji's actions towards her. She quickly became one of his three main affections, and he defended her to the same degree as he did Nami (and later Robin). Two years later, Sanji showed great delight in seeing Vivi's picture in the newspaper."}, {"type": "paragraph", "text": "She finds Chopper adorable and calls him Tony-kun, which always launches him into one of his happy dances."}, {"type": "paragraph", "text": "She was not upset when she learned that Luffy took Nico Robin, the former Miss All Sunday and their one-time enemy, into his crew. Rather than questioning his motives, she decided to trust Luffy's judgement on the matter."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Straw_Hat_Pirates%2C_Vivi_and_Karoo%27s_Friendship_Mark.png/revision/latest/scale-to-width-down/230?cb=20191102120102", "caption": "Straw Hat Pirates, Vivi, and Karoo show their friendship mark."}]}, {"title": "Dalton", "level": 4, "content": [{"type": "paragraph", "text": "Vivi originally met Dalton years ago as a little girl when they attended the Levely, with Dalton as Wapol's escort, and Vivi accompanying her father Cobra. Though Wapol intentionally tried to stir up trouble due to a disagreement with Cobra, Vivi ignored his rude act to avoid a conflict, something that would impress and eventually inspire Dalton to turn against Wapol."}, {"type": "paragraph", "text": "Later when she and the Straw Hats landed on Drum Island to find a doctor for Nami, Dalton saw Vivi working towards preventing a conflict between the crew and the townspeople and allowed them onto the island, feeling he could trust them. Though Vivi chose not to disclose her true identity to him during their time on Drum Island even after she reacted upon remembering Wapol, Dalton was capable of figuring out her identity on his own and was glad she was travelling with the Straw Hats when they were departing from Drum Island."}, {"type": "paragraph", "text": "They would later meet again and get reacquainted two years later when they both attended the current Levely to which she greets both him and Dr. Kureha. When Wapol approached Vivi and started insulting her, Dalton stood up for her by intimidating Wapol into backing off."}], "images": []}, {"title": "Friends of the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "At Mary Geoise, Vivi was quick to bond with Rebecca, Leo, and Shirahoshi due to having a mutual friend that they are indebted to. When Charlos tried to make Shirahoshi his slave, Vivi was outraged and protested against the World Noble's actions to which Shirahoshi's father Neptune thanked Vivi for her efforts just as he was preparing to take action."}], "images": []}, {"title": "Mr. 9 and Miss Monday", "level": 4, "content": [{"type": "paragraph", "text": "In Baroque Works, Mr. 9 and Miss Monday had become close friends with Vivi (as Miss Wednesday) and Igaram (as Mr. 8). Their friendship was so strong that both of them were prepared to give their lives to save her when she is attacked by Mr. 5 and Miss Valentine."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Crocodile", "level": 4, "content": [{"type": "paragraph", "text": "She truly hates Crocodile, the secret boss of Baroque Works, for the chaos and ruin he caused in her country. On multiple occasions, she has openly wished for his death or voiced her desire to kill him."}], "images": []}, {"title": "Baroque Works Agents", "level": 4, "content": [{"type": "paragraph", "text": "After being infiltrated in the organization, upon discovering her true identity she was attacked by Mr. 5 and Miss Valentine at Whiskey Peak, where she had a confrontation with them. Then they had a second meeting in Little Garden, where she also had to face Mr. 3 and Miss Goldenweek."}, {"type": "paragraph", "text": "Mr. 7 and Miss Father's Day were apparently friends with her at some point. However, by the time they were introduced in the series, the sniper pair already knew that she was a spy."}], "images": []}, {"title": "Wapol", "level": 4, "content": [{"type": "paragraph", "text": "At a young age, Vivi crossed paths with the then king of Drum Kingdom during a Levely, and due to the later's confrontation with Cobra, the meeting ended with Wapol shoving her, and wounding her. Thank to Vivi's nobility however, the event was calmed instead of becoming an incident between the kingdoms. Afterward, during Vivi's time with the Straw Hats, the two encounter each other again, and while Vivi recognized him, it was only after Dalton revealed the history of Drum, and the attack by the Blackbeard Pirates, that she fully remembered him, and became angry with his actions despite being the king. By the time of their third meeting in another Levely, they remained hostile toward each other."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a princess, Vivi has a great deal of authority in her country. She has a natural skill in diplomacy. This was clear even as a child, as Vivi understood what being a princess meant and acted with wisdom beyond her years during her childhood trip to the Levely. When she was slapped by Wapol, she quickly apologized for being in his way and held back her tears until he was out of earshot, all for the sake of preventing an international incident. When meeting the Straw Hats, she managed to persuade Zoro and Nami into protecting her from the Baroque Works agents after her cover was blown, and even persuaded Nami against charging her for their protection. When traveling with the Straw Hats, she even showed an impressive, and almost comedic amount of skill in keeping the more childish members of the crew (Luffy, Ussop, and Chopper) as well as Karoo, focused, calm, and motivated during their travels together. When they reached Drum Island, she was able to persuade Luffy not to attack the villagers back and even put on a brave face after being shot in the arm. Her courage convinced the villagers to allow them into the village peacefully. In the aftermath of the battle against Baroque Works, Vivi even managed to persuade the royal guards and rebels of her country to ultimately stop fighting and killing one another, effectively ending the needless civil war that was started by Crocodile."}, {"type": "paragraph", "text": "Vivi has proven herself to be a very capable spy, and has shown great skill in stealth and other clandestine skills as well. This was proven clearly as Vivi was extremely good at moving about undetected, having established herself as a single digit member of Baroque Works for two years before her identity was compromised and she returned to Alabasta completely unnoticed by the citizens. Her actions as a spy were completely unnoticed by the Marines, the World Government, and even the Shichibukai Crocodile for more than two years until her cover was finally blown by Miss All Sunday. Since leaving the Straw Hats, she seems to have managed to maintain her role as a princess, all the while successfully keeping both her past as a Baroque Works agent and a companion of a pirate crew secret from the Marines and the World Government."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Despite her lack of combat experience compared to the Straw Hats, Vivi has proven herself more than capable of being able to hold her own in battle. When infiltrating Baroque Works, she held her own within the organization, and quickly rose up the ranks within two years. As a Baroque Works frontier agent, she and her partner surpassed three other pairs in skill, and was experienced as both agents and bounty hunters, as they were the pair tasked with killing Laboon. Her confidence in her own fighting abilities were so great that she even openly tried to attack Roronoa Zoro, till she realized the clear difference in strength between the two of them. Vivi can also make use of Karoo, in spite of his frequent incompetence, to gain more mobility in battle. She was able to hold her own against a group of Billions, although she was eventually overwhelmed by their sheer numbers and had to be saved by Pell."}, {"type": "paragraph", "text": "On her own, she has surprising natural agility, often dodging attacks gracefully and almost mindlessly, often appearing surprised after it happens. Her instinct seems to be to tackle her opponent and hold them down, as seen during her confrontations with Luffy and Koza. Her time as a Baroque Works agent also seems to have given her a preference for surprise attacks and ambushes, as seen during her confrontations with Zoro and Crocodile. However, since both her attempts failed, her actual ability in these skills is currently unknown."}, {"type": "paragraph", "text": "Vivi is resilient and able to endure a lot of pain, such as a bullet wound to the arm and a skinned knee caused when she fell due to her wedges falling apart, slowing her down momentarily. Her feet are also tough enough that she can go barefoot with ease, as she was able to trek through Alubarna unhindered after her wedges fell apart, run across cobblestone streets without any visible pain, and stand perched steadily atop a narrow ledge on the city's clock tower. After all this, she only suffered minor scrapes and tarnishes to her feet and needed no bandages on them afterwards. After the timeskip, Vivi has seemingly become much more physically agile and resilient, as evidenced by her deftly jumping from a crow's nest hundreds of feet high and landing on her feet in front of her father and guards."}, {"type": "paragraph", "text": "In terms of physical strength, she is highly outmatched by other members of the Straw Hat Pirates. This was made very evident when she struggled against a single Bananawani while Luffy and Zoro could defeat a group of them effortlessly. This huge difference in strength briefly made Vivi comically depressed, as she even had trouble with just running from one."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Vivi's weapons of choice are her twirling \"Kujakki (Peacock) Slashers,\" which are small, sharp discs attached to her fingers by wires. She is left handed but capable of dual-wielding the slashers."}, {"type": "paragraph", "text": "At Alabasta, she started using the longer range Kujakki String Slashers, which carry enough power to behead someone with a single slash. If her Peacock Slashers miss the target, as seen when she was fighting Miss Father's Day and Mr. 7, she can use a special backup move she has dubbed Run Back. This technique has been proven to be extremely useful, as it defeated the two frontier agents of Baroque Works."}, {"type": "paragraph", "text": "Before joining the Straw Hats, she had another attack, first seen being used on Zoro: the Miwaku no Memaii Dansu, in which she performs an hypnotic dance utilizing the concentric patterns on her outfit. The effect immobilizes her opponent and creates an opening for her final attack. In the anime (where the design of her outfit is altered), this attack is changed to the Miwaku no Kousui Dansu and relies on a special perfume for effect."}, {"type": "paragraph", "text": "She and Mr. 9 briefly wielded bazookas during their attempt to kill Laboon."}, {"type": "paragraph", "text": "Vivi was once seen hitting Luffy, Zoro, and Sanji with a large mace, after which the weapon was never seen again. It was replaced with a broom in the anime."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/Vivi_Rides_Karoo.png/revision/latest/scale-to-width-down/210?cb=20130513044433", "caption": "Vivi rides Karoo as Miss Wednesday while spinning her Peacock Slashers."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Incredible Princess", "level": 4, "content": [{"type": "paragraph", "text": "Vivi's past is first mentioned by Dalton in the Drum Island Arc. She was taken to the Council of Kings by her father and some of his attendants. During the meeting, Wapol had been upset by Cobra's words, and after the meeting, he \"accidentally\" slapped her. Despite this obvious attack, she stood tall and offered an apology for clumsily bumping into Wapol, impressing Dalton with her diplomatic spirit. Afterward, out of Wapol's sight, she cried about how much it had hurt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Wapol_shoving_Vivi.png/revision/latest/scale-to-width-down/200?cb=20191202204658", "caption": "Wapol shoving Vivi when she was a child."}]}, {"title": "The Suna Suna Clan", "level": 4, "content": [{"type": "paragraph", "text": "Vivi and Koza met for the first time eleven years ago. Koza's father had paid the King a visit, but the boy felt that his father was not saying enough. After directly confronting the king, Koza left the room in tears and almost immediately encountered young Vivi, who called him a crybaby. Thus a fight broke out between the two which rapidly transformed into friendship."}, {"type": "paragraph", "text": "Soon, Vivi appeared before her father and told him that she got into a fight but lost. Igaram was angry that Koza hit the princess, and Toto begged the king to let him apologize by committing suicide, but Cobra told them to stay out of it, recognizing it as just a fight between children. Later, while covertly keeping an eye on Vivi, Igaram and Cobra remarked that she had made a friend."}, {"type": "paragraph", "text": "Koza invited Vivi to fight him for the right to join his group. She fought him again and lost but ultimately gained his followers' respect and was declared the vice leader of the Suna Suna Clan. For a long time, she and the others played together frequently, unaware that they were being followed and monitored by the overly cautious Igaram and Cobra. After joining the clan, Vivi became close to Koza's family."}, {"type": "paragraph", "text": "When a group of kidnappers threatened Vivi, she was rescued by her friends. The Suna Suna Clan was still fighting the kidnappers when a third one appeared, grabbing Vivi. She bit him and ran towards the ruins. Igaram and Cobra appeared after the children's defeat and inquired about what had happened, after which they went to help Vivi. At the ruins, the kidnappers were looking for Vivi and one found her. Koza came from behind and hit him with a stick. The kidnapper and Koza went at each other, but Koza defeated him by hitting his head despite suffering a knife cut to his left eye. Just then, the other two kidnappers arrived and were about to fight Koza when Igaram and Cobra knocked them out. Pell and Chaka defeated the rest of the kidnapping crew shortly thereafter."}, {"type": "paragraph", "text": "Soon afterward, Koza left to help his father build a town at the oasis of Yuba. Upon his departure, Koza told Vivi to become a great princess."}, {"type": "paragraph", "text": "At some point during Vivi's childhood, she tried to make fireworks out of gunpowder to commemorate the anniversary of Pell joining the guard. Pell slapped her and scolded her for trying something so dangerous, but told her that if any harm befell her, he would not know what to do. As a way to make up, he allowed her to ride on his back as he flew in falcon form and told her that he was always training in order to protect the kingdom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Vivi_Nominated.png/revision/latest/scale-to-width-down/210?cb=20130518180755", "caption": "Vivi is declared the sub-leader of the Suna Suna Clan."}]}, {"title": "Baroque Works Conspiracy", "level": 4, "content": [{"type": "paragraph", "text": "Many years later, Crocodile of the Shichibukai came to the country. A period of drought ensued, during which the entire country experienced a complete lack of rain, save for the city of Alubarna. Everyone thought the rain falling over the capital was a blessing of the King until some Dance Powder was discovered on its way into the city. Later, more Dance Powder was found planted in the royal palace, framing the king as the culprit behind the drought. Many knew the King would never do this, but the findings were enough to instill doubt in many younger citizens."}, {"type": "paragraph", "text": "When the reputation of the King was sullied and a rebellion instigated, Vivi (along with Igaram, the Captain of the Royal Guard) infiltrated the criminal organization Baroque Works under an alias in order to discover the identity of the mastermind and ultimately prove the king's innocence. There, she discovered that the villain responsible for the chaos in her homeland was none other than Crocodile, a member of the Shichibukai."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Reverse Mountain Arc", "level": 4, "content": [{"type": "paragraph", "text": "Vivi, as Miss Wednesday, and her partner Mr. 9 were sent to try and kill a whale named Laboon for his meat. During what would be their final attempt, they met a charging Luffy who ended up catapulting all three into Laboon's stomach.Crocus, the whale's doctor, helped the Straw Hats leave the whale, while Mr. 9 and Vivi were thrown out to sea and escaped."}, {"type": "paragraph", "text": "Luffy revealed to Nami a Log Pose he found after they dumped the Mr. 9 pair, but Sanji broke it almost immediately when he kicked Luffy for eating his entire elephant tuna. Crocus loaned them his in return for helping Laboon. The Mr. 9 pair spied on the group from afar until they were almost blown up by The Unluckies for failing in their mission to kill Laboon. They reacquainted themselves with the Straw Hats again and begged them to take the pair back to their hometown, Whisky Peak, to which Luffy agreed. With that, they bade Crocus and Laboon farewell and set off."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Vivi_and_Mr._9_Prepare_to_Kill_Laboon.png/revision/latest/scale-to-width-down/230?cb=20130122222154", "caption": "Miss Wednesday (Vivi) and Mr. 9 prepare to kill Laboon."}]}, {"title": "Whisky Peak Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Straw Hats were quickly introduced to the Grand Line's ever-changing weather, they forced Vivi and Mr. 9 to help as well. Eventually, the weather stabilized, and the crew spotted an island on the horizon: the cactus town Whisky Peak. When they approached the island, Vivi and Mr. 9 thanked the pirates and abruptly jumped ship, much to the crew's confusion. As the Straw Hats were welcomed like heroes, Vivi and Mr. 9 wrote an apology letter to their boss regarding their failure."}, {"type": "paragraph", "text": "That night, Vivi and Mr. 9 met up with Igaram (as Mr. 8), who informed them that the Straw Hats had fallen to hell. When Miss Monday showed up and questioned whether they should have thrown that party for the Straw Hats when the town was already short on food to begin with, citing the Mr. 9 pair's failure to get the whale meat, Vivi and Mr. 9 defended themselves by claiming they had tried their best. Vivi was shocked when Igaram showed her and the others Luffy's bounty of 30,000,000. After Zoro appeared and revealed that he knew of Baroque Works, Vivi and the others prepared to kill him."}, {"type": "paragraph", "text": "After Zoro displayed his strength by effortlessly taking out dozens of bounty hunters, including Miss Monday, Vivi and the other agents assumed that he was the real captain of the Straw Hats and that the Marines made a mistake with their bounties. Vivi called for Karoo but was exasperated when he misunderstood her commands and sat down instead of pursuing Zoro. After Mr. 9 fell off a building while trying to kill Zoro, Vivi confronted the swordsman herself and danced to make him dizzy before attempting to cut him down with her Kujakki. However, her attempt was ruined when Karoo went the wrong way and fell off the building as well. After Mr. 9 managed to bind Zoro with the iron wire stored in his bat, Vivi held a sleeping Luffy hostage with a knife and told Zoro not to move as Igaram prepared to attack. However, Zoro threw Mr. 9 into a building before slamming him into Vivi, and both were defeated."}, {"type": "paragraph", "text": "When Mr.5 and Miss Valentine arrived, Vivi asked them to take care of Zoro, but Mr. 5 revealed that they were there to take care of a spy who had been investigating the identity of their boss, Mr. 0. As Mr. 5 was about to reveal the identity of the spy, Igaram attacked him with Igarappappa, leading Vivi to call him by his real name rather than his alias. Miss Valentine attacked Vivi and broke her hairpiece, causing her hair to fall down as Mr. 5 revealed that the first spy was Igaram and the second was Vivi herself, the princess of Alabasta. Vivi prepared to fight Mr. 5, but Mr. 9 intervened, claiming that he would hold them off before attacking Mr. 5 head-on and being promptly defeated. Seeing this, Vivi fled on Karoo's back."}, {"type": "paragraph", "text": "Vivi headed for a ship docked behind Cactus Mountain but was surprised when Miss Monday appeared and revealed that she also intended to buy Vivi some time by holding off Mr. 5 and Miss Valentine. After taking out Miss Monday, Mr. 5 fired an explosive booger at Vivi, who was saved when Zoro cut the projectile in half. Thinking Zoro was still trying to get in her way, Vivi attacked him, but he revealed that he had come to save her. When Luffy arrived and accused Zoro of cutting down innocent townspeople, Vivi was stunned by his dense nature, and later expressed shock when Luffy managed to effortlessly defeat Mr. 5."}, {"type": "paragraph", "text": "After witnessing Luffy and Zoro defeat Mr. 5 and Miss Valentine with a single blow each during their fight, Vivi wondered how such strong people could be so close to the Grand Line entrance. Nami interrupted the battle and scolded Luffy and Zoro for nearly making her lose out on 1,000,000,000, prompting Vivi to ask why they were saving her. Later, after Nami explained the situation to her, Vivi refused to make a contract but thanked the Straw Hats for saving her. Vivi explained that her kingdom was currently in turmoil due to revolutionary activities and how she and Igaram had entered Baroque Works after learning that they had been instigating the rebellion. When Nami questioned Mr. 0's apparent intention to create an ideal nation, Vivi revealed that he was actually planning to take over Alabasta. Luffy asked Vivi who Mr. 0 was, but Vivi frantically told him that he was better off not knowing, although in her panic she accidentally revealed his true identity as Crocodile, shocking everyone in the vicinity."}, {"type": "paragraph", "text": "Having heard this, Mr. 13 and Miss Friday flew away to inform Crocodile that the Straw Hats now knew his identity. Nami furiously berated Vivi for putting them on Baroque Works's hit list, prompting Vivi to claim it accidentally slipped out. After Nami learned that she could not run away because Mr. 13 already knew what they looked like, Vivi offered her the 500,000 in her savings account in lieu of the impossible  she had requested. When Igaram showed up dressed like her, a startled Vivi asked what he was doing, and Igaram revealed that he would act as a decoy for the Baroque Works agents to chase after while Vivi and the Straw Hats took the normal route to Alabasta. Almost immediately after Igaram left, his ship was blown up. Seeing this, the group assumed he was dead. Nami told the others to leave and promised a tearful Vivi that they would bring her to Alabasta."}, {"type": "paragraph", "text": "As she and Nami ran through the streets, Vivi wondered where Karoo was, only to be shocked and somewhat annoyed to find him already on board the Going Merry. After telling the crew to turn the ship upstream, Vivi informed Luffy that there were about 2,000 people working for Baroque Works. However, she was startled when Miss All Sunday appeared on the ship and mentioned having just met Mr. 8, leading Vivi to realize that she was the one who blew up Igaram's ship. Vivi explained to the others that Miss All-Sunday was Mr. 0's partner and that she had been tailing the mysterious woman. Vivi demanded to know whether Miss All Sunday was the one who informed Crocodile that she and Igaram were spies. After taunting Luffy, Miss All Sunday gave Vivi an Eternal Pose to Nanimonai Island to make their journey easier, but Luffy destroyed it, saying that no one had the right to determine the path of their voyage. After Miss All-Sunday left, Vivi apologized because she felt that she would only cause the crew trouble, but Nami told her that she should not have followed them in the first place, and the crew set sail for Little Garden."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Frontier_Agents_in_Whisky_Peak.png/revision/latest/scale-to-width-down/230?cb=20191212232857", "caption": "Miss Wednesday and Frontier Agents of Whisky Peak gathered to capture the Straw Hat Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/99/Mr._5_and_Miss_Valentine_Arrive_on_Whisky_Peak.png/revision/latest/scale-to-width-down/230?cb=20191212232935", "caption": "Mr. 5 and Miss Valentine arrive on Whisky Peak when they discover the identity of Princess Vivi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6b/Vivi_Tells_Her_History_to_the_Straw_Hat_Pirates.png/revision/latest/scale-to-width-down/230?cb=20191212233001", "caption": "Vivi tells her history to the Straw Hat Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/30/Straw_Hat_Pirates_and_Vivi_Meet_Miss_All_Sunday.png/revision/latest/scale-to-width-down/230?cb=20191212233858", "caption": "Vivi and the Straw Hat Pirates meet Miss All Sunday on the Going Merry."}]}, {"title": "Little Garden Arc", "level": 4, "content": [{"type": "paragraph", "text": "Vivi and the crew eventually arrived in Little Garden. The jungle island fascinated Luffy, not only because of the adventure it could provide, but also because it contained all sorts of prehistoric animals, ranging from saber-toothed cats to dinosaurs. From Vivi, who decided to accompany him in exploration, Luffy learned why the island seemed to be stuck in the past. As they ventured around the island, the three soon discovered something even larger than the dinosaurs. As Luffy messed around with a Brontosaurus, they met a giant named Dorry."}, {"type": "paragraph", "text": "Luffy and Vivi were invited to the giant's place. There, they were treated to some dinosaur meat and got acquainted with Dorry. From the giant, they learned that he was staying on Little Garden in order to settle his long-standing battle with a fellow giant, Brogy. As the matter was being discussed, the island's volcano erupted, signaling the next match between the giants. The giant reappeared shortly after his 73,468th tie with Brogy, carrying with him a barrel of alcohol he had received from his opponent."}, {"type": "paragraph", "text": "When Dorry drank the alcohol, it exploded in his stomach. Since the barrel was taken from Luffy's ship and given to Dorry by Brogy, Luffy and his crew were suspected of sabotaging it. With this, Luffy and Dorry got into a fight, though Vivi objected. Eventually Luffy battled Dorry to a standstill and she scanned the area and noticed Karoo had gone missing. With this sudden turn of events, Luffy started to suspect that his crew weren't the only ones in the island."}, {"type": "paragraph", "text": "The volcano erupted again, signaling the next match, and neither Vivi nor Luffy could stop Dorry from going to battle. While Luffy was trapped under the edge of the giant's house, Usopp suddenly showed up, having wandered over from Brogy's place. Reunited, Luffy and Vivi recounted what had just happened and were likewise filled in by Usopp. As they were figuring out what to do next, they heard the awful scream of Dorry being defeated by Brogy due to the tainted fight."}, {"type": "paragraph", "text": "Soon Mr.5 and Miss Valentine appeared before Vivi and her companions, bringing a beaten-up Karoo. Because of his current predicament, Luffy was unable to aid his companions and bore the full brunt of Bomu Bomu no Mi powers while immobilized. The two officer agents abducted Vivi and left Luffy, Usopp, and Karoo for dead."}, {"type": "paragraph", "text": "After Usopp and Karoo manage to help Luffy free Nami, Vivi, and Zoro from Mr. 3's Special Candelabra, Vivi joined Nami in defeating Miss Valentine. Later, the group discovered that, due to the giants' weapons being worn out from one hundred years of use, Dorry was alive and had only passed out from the wound inflicted. As everyone was resting from the ordeal and wondering how to deal with the island's magnetic field, they were rejoined by Sanji, who brought with him some great news and an eternal pose to Alabasta. Vivi was happy enough to hug the cook, to his shameless delight. With the eternal pose, Vivi and the crew bid their farewells to the giants and set off."}, {"type": "paragraph", "text": "As Vivi and the crew sailed off from Little Garden, they were provided by the giants with an act of gratitude. With help from the giants' strength, Vivi and crew were able to pass through a giant goldfish and sail on."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Luffy%2C_Vivi%2C_and_Karoo_Dining_with_Dorry.png/revision/latest/scale-to-width-down/210?cb=20130525215454", "caption": "Vivi, Luffy, and Karoo eat with the giant Dorry."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Miss_Valentine_Captures_Vivi.png/revision/latest/scale-to-width-down/210?cb=20130926214309", "caption": "Vivi is held captive by Miss Valentine."}]}, {"title": "Drum Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Nami became horribly sick, so the crew detoured from Alabasta to look for a doctor. Nami overexerted herself to help steer the crew and luckily avoided a cyclone in the process. Vivi was shocked and took note of Nami's incredible ability to feel the weather and oncoming storms. While looking for a doctor, they were attacked by the pirate Wapol, but Luffy sent him flying right away. Vivi, worried by all the noise, left Nami's bedside and briefly saw Wapol, thinking he looked familiar."}, {"type": "paragraph", "text": "When they finally reached an island, they received a hostile welcome. Vivi and Luffy manage to gain the trust of the people that attacked them and were taken to the village, leaving Zoro and Karoo to guard the ship."}, {"type": "paragraph", "text": "Luffy and Sanji set out to bring Nami to the island's only doctor, a \"witch\" living at the top of a mountain. Dalton told Vivi and Usopp about the island's history. Vivi brought up several royal references which instigated Dalton to become suspicious of her background. Dalton almost recognized Vivi, but she avoided all his questions and changed the subject."}, {"type": "paragraph", "text": "The doctor was discovered to be on the other side of the island, and Usopp, Vivi, and Dalton rushed to find her. However, they were too late and Dalton soon received word that Wapol had returned. He left Vivi and Usopp his sled to continue towards the doctor as he took off to fight Wapol. Vivi and Usopp stumbled through the snow attempting to find the village but passed it due to their sub-par navigational skills. Soon, Usopp heard a sound and realized an avalanche was careening towards them. After the avalanche, Vivi and Usopp were still alive but lost. As they traveled, they accidentally bumped into a half-naked Zoro. Finally arriving at a village, they realized they had come back to Bighorn. They learned that Dalton was still buried in the avalanche but that the Wapol men were preventing the villagers from searching for him. After confirming that they were enemies, Zoro beat up all the guards and stole warm clothes from one of them. After some searching, Dalton was found in a critical state."}, {"type": "paragraph", "text": "The Isshi-20 decided to betray Wapol, whom they had followed by fear, and rescue Dalton. Usopp told Vivi that they should not worry about Luffy and Sanji, but when Dalton decided to go fight against his former king despite being barely able to stand up, Usopp offered to carry Dalton on his back."}, {"type": "paragraph", "text": "Dalton, Vivi, Usopp, Zoro, and the villagers started their ascent to the castle via a hidden rope-way, not arriving until after Luffy defeated Wapol. Chopper joined the Straw Hats, the crew rocketed down the ropeway on a sled, and cherry blossoms bloomed in winter. Vivi tended to Karoo, who had frozen himself trying to save Zoro."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/Vivi_Keeps_Usopp_Conscious.png/revision/latest/scale-to-width-down/240?cb=20190207164358", "caption": "Vivi helps Usopp stay conscious."}]}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "On their way to Alabasta, they steered through a cloud of steam and happened to catch Mr. 2 Bon Kurei, having incidentally pulled him off of his nearby boat. Mr. 2 entertained the crew with his Mane Mane no Mi powers. He gained the ability to imitate everybody on the ship except Vivi and Sanji, whose faces he was not able to touch. Mr. 2 was then picked up by his own ship and crew, praising their new-found friendship as he left. Someone on the other ship greeted the man as Mr. 2 Bon Kurei, informing the shocked Straw Hats that they had just partied with an enemy. However, knowing about his power beforehand allowed them to take precautions against falling victim to it in the future."}, {"type": "paragraph", "text": "The Straw Hats finally reached the desert kingdom of Alabasta, making landfall at the port town of Nanohana. While shopping for clothes, Sanji bought dancing girl outfits for Nami and Vivi. Vivi reminded him that they were supposed to be normal people, though Sanji argued (with a perverted smile) that dancers \"are people too.\" Running away from Marine captain Smoker, Luffy led the Marines directly to his crewmates. Just as Smoker tried to catch them, Ace interrupted and secured an escape route for the Straw Hat Pirates."}, {"type": "paragraph", "text": "Back on the ship, Luffy told the crew that the man who saved them was his brother. Ace hopped onto the ship and met the crew but did not stay long, giving Luffy a mysterious piece of paper before leaving and destroying seven ships with Billions of the Baroque Works on the way out. Vivi sent Karoo with a message to Alubarna to warn the King."}, {"type": "paragraph", "text": "The Straw Hats sailed to the west side of the Sandora River delta and anchored, leaving the ship. They encountered a group of Kung-Fu Dugongs, who challenged the crew but were beaten by Luffy en masse. They soon entered the town of Erumalu, formerly also known as the Green City but now deserted and destroyed by the sand."}, {"type": "paragraph", "text": "They continued their journey through the desert. Luffy lost half their stuff to Warusagi Birds, who, as Vivi explained after the fact, trick travelers and steal their luggage. Luffy chased after them but returns alongside a camel and being chased by a gigantic Sandora Lizard. The camel, who happened to be a pervert, was given the name \"Matsuge\" by Nami and joined the crew, giving Nami and Vivi (exclusively) a ride on his back."}, {"type": "paragraph", "text": "The journey continued and the Straw Hats finally arrived in the Yuba Oasis, the supposed hideout of the Rebel Army. However, the only citizen left in town told them that the rebels had relocated to an oasis near Nanohana, for Yuba had become almost a daily target of sandstorms. The old citizen turns out to be an old friend of Vivi's, Toto. We learned of their past together along with his son and her friend, Koza, who was currently the leader of the Rebel Army. He gave the Straw Hats a place to sleep and managed to dig up a gallon of water overnight."}, {"type": "paragraph", "text": "The Straw Hats left Yuba in the morning, and as Vivi started leading them back the way they came, Luffy became stubborn and told her that stopping the rebels would not get rid of Crocodile, suggesting they target Crocodile instead. He noted that even if they managed to reach the rebels, Crocodile would still try to continue the war— it should be noted that, at this point, they still thought there was time before the battles started. After a tough argument, Vivi agreed and led them to Rainbase."}, {"type": "paragraph", "text": "Meanwhile the Officer Agents of the Baroque Works met up with Miss All-Sunday and Crocodile in the basement of the Rain Dinners Casino, owned by Crocodile. They are told the goal of the Baroque Works, their final mission and their respective parts in overthrowing Alabasta. They are interrupted by Mr. 3, who tells them that the Straw Hats and Vivi have escaped him during their time in Little Garden. He asks Crocodile for forgiveness, but is fed to his pet Bananawani instead. The Officer Agents all get pictures of Vivi and the Straw Hat crew (excluding Sanji) with the help of Bon Kurei's abilities and are given the order to hunt them down (excluding Chopper as Crocodile believed he was the Straw Hats pet). Upon their arrival in Rainbase, Luffy and Usopp ran into Smoker and Tashigi and got chased by the two and their Marine squad as well as the Baroque Works Billions stationed there. The crew split into groups: Nami and Usopp; Zoro and Vivi; Sanji; Luffy, chased by Smoker; and Chopper, who was left behind. Luffy, Nami, Usopp, Zoro, and Smoker simultaneously arrived at Rain Dinners, but they all fell for an obvious trap and were thrown in a seastone cage by Crocodile."}, {"type": "paragraph", "text": "Vivi was surrounded by Billions, but Pell saved her, having flown to Rainbase after Karoo's arrival in order to scout. Pell, however, was soon defeated by Miss All Sunday, and Vivi was taken to the Rain Dinners basement. There, the princess attacked Crocodile but could not counter his sandy powers, and he informed her that his final plan to overthrow Alabasta was already underway."}, {"type": "paragraph", "text": "Crocodile dared Vivi to try and help her friends as he flooded the room, lets Bananawani in, and allowed one to swallow the key to the seastone cage. However, he suddenly got a snail call from a \"Mr. Prince,\" recognized by the crew as Sanji, who started off by reenacting the call he had made in Little Garden. Sanji made Crocodile believe he got caught in front of Rain Dinners, prompting the Shichibukai to check out the situation in front of the casino. In the end, everyone was released from the cage and the crew headed toward Alubarna."}, {"type": "paragraph", "text": "Chopper picked up the crew with a Moving Crab named Hasami, a friend of Matsuge. As the Straw Hats ran away, Crocodile tried to snatch Vivi from the crab, but she was saved when Luffy took her place, promising to meet them in Alubarna."}, {"type": "paragraph", "text": "After crossing the desert and the river, Vivi and the Straw Hats reunited with Karoo, who was accompanied by the Super Spot-Billed Duck Troops, the fastest animals in Alabasta."}, {"type": "paragraph", "text": "Meanwhile, the Rebel Army had started their rush toward Alubarna. With the citizens evacuated, the royal army, led by Chaka, was preparing the city for the rebel attack. Outside of Alubarna, the officer agents waited for Vivi to arrive so they could catch her but were thrown into confusion when six hooded people arrive on Super Spot-Billed Ducks. Unable to identify which was Vivi, the agents split up to pursue all six."}, {"type": "paragraph", "text": "The real Vivi, however, hid behind a rock and silently thanked the Straw Hats for buying her some time. She tried to stop the rebel army, but a dust cloud caused by a Baroque Works agent under cover in the royal army prevented the rebel army from seeing her. Karoo shielded her with his body as thousands of soldiers stampeded past them. As she awoke, she was greeted by Usopp, but she saw through Mr. 2's disguise and absconded. Karoo ran off with her, climbing the steep walls of Alubarna, but Mr. 2 was still in pursuit until Sanji appeared to delay him."}, {"type": "paragraph", "text": "Vivi arrived at the palace and ordered the Royal Army to blow up the palace in order to get everyone's attention and stop the war. Her plan was stopped by Crocodile. The army, realizing what was happening, tried to enter the palace but was stopped by Miss All Sunday. Koza also arrived at the scene, intending to demand Cobra's surrender, only to find out the truth of the situation. Crocodile revealed that he was going to blow up the palace plaza, soon to be center point of battle, with a massive and powerful bomb. He also revealed his true intentions: to find the location of the secret ancient weapon Pluton, which was said to be buried in Alabasta."}, {"type": "paragraph", "text": "Koza wanted to warn the city but was stopped by Vivi, who said that it would create a panic. Instead, she had the Royal Army raise the white flag, with Koza in front, but he was suddenly shot down by a double agent in the Royal Army, provoking the rebels. A battle started on the palace plaza as Vivi watched in horror. After gloating how her ideals are foolish, Crocodile proceeded to throw Vivi off a palace wall, but she was saved by Luffy who came in flying on Pell's back. Vivi met with the rest of the Straw Hats on the foot of the wall and went to search for the bomb with them and Pell."}, {"type": "paragraph", "text": "Vivi, Pell and the Straw Hat crew were separately fighting their way through gangs of Billions and Rebel/Royal soldiers to find the hideout for the bomb, but without any luck. Right then, Vivi thought about the only place that would be useful for launching such an attack: the clock tower, which used to be a hideout for Koza and her other friends."}, {"type": "paragraph", "text": "The Straw Hats use a unique maneuver to propel Vivi to the top of the clock tower. She reached the tower, defeated Mr. 7 and Miss Father's Day, and defused the cannon, only to discover that it was a time bomb that would go off even without being launched. Just when it seemed that everything was for naught, Pell showed up and carried the bomb off into the sky, allowing it to explode harmlessly high above the city while sacrificing himself."}, {"type": "paragraph", "text": "However, despite the bomb's explosion knocking the soldiers over, they simply got back up and continued the battle. Over and over, Vivi desperately yelled for them to stop fighting, but her voice was not heard."}, {"type": "paragraph", "text": "It was then that Crocodile was finally defeated by Luffy, and as a result, Crocodile's effect on the land was broken, causing it to rain. The Rebels and Royal Guards noticed the rain and hesitated enough for Vivi's pleas to finally be heard. Having gotten the crowd's attention, Vivi told them that the rain would fall as it had always fallen and that the nightmare was over."}, {"type": "paragraph", "text": "During her time on the Going Merry, Vivi grew close to the Straw Hat Pirates, admiring their indomitable spirit in the face of adversity as well as their kind-hearted nature. She even reflected that she would have liked to be a member of their crew if she hadn't been a princess. The feeling was mutual, in fact: Luffy begged her to keep traveling with them, but though Vivi very nearly did, she ultimately (and tearfully) declined the offer, saying that her country needed her."}, {"type": "paragraph", "text": "To keep the nearby Marines from recognizing Vivi as their ally, they said only a silent goodbye to her, showing the marks on their wrists as a sign of their friendship. Vivi and Karoo returned the gesture. Vivi still follows her friends in the newspapers, but they have not met since."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f1/Straw_Hats_Saved_By_Ace_in_Alabasta.png/revision/latest/scale-to-width-down/230?cb=20130525215655", "caption": "Ace saves Vivi and the Straw Hats."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dd/Vivi_Attacks_Crocodile.png/revision/latest/scale-to-width-down/215?cb=20160408123620", "caption": "Vivi attacks Crocodile."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Crocodile_tries_to_kill_Vivi.png/revision/latest/scale-to-width-down/215?cb=20191202210252", "caption": "Crocodile tries to kill Vivi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8e/X_Mark_Farewell.png/revision/latest/scale-to-width-down/240?cb=20150203191111", "caption": "Bidding farewell using their X mark."}]}, {"title": "Ruluka Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Vivi was also seen in the Ruluka Island Arc, where Igaram was picking up a book and placing it on a shelf."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Gedatsu's Accidental Blue-Sea Life", "level": 3, "content": [{"type": "paragraph", "text": "Vivi was later seen enjoying the geothermal baths of Ukkari Hot-Spring Island, owned and operated by Goro (Toto's brother and Koza's uncle)."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Vivi was also seen when the Straw Hats received their bounties. Her father and the others alerted her to an article in the newspaper about the Enies Lobby attack and how one of her biggest former enemies was working with the Straw Hats now. Despite seeing Miss All-Sunday amongst the crew, she was happy about how they were getting along, saying that she trusted Luffy's judgement completely concerning his choice of crew members. She also mentioned that she already knew Robin was in the crew, implying that she had been keeping track of the Straw Hats ever since she left them."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later, after the Battle of Marineford, she was seen puzzling over a newspaper article with Karoo, trying to figure out what the markings pictured on Luffy's arm meant."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Vivi_and_Karoo_Read_About_Luffy.png/revision/latest/scale-to-width-down/210?cb=20130418211926", "caption": "Vivi reads about Luffy's reappearance at Marineford."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Vivi was out and about in Alubarna. She was walking with Karoo and Matsuge, carrying a newspaper as the two animals ate apples. She was later seen delivering groceries to her father in his bed."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the disclosure of Luffy's new bounty after his victory over Doflamingo reached Alabasta, Vivi was elated at the status of her friends while Karoo was carefully scrapbooking the recent tabloid about the Straw Hats."}], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Vivi was shown to be happy sailing again, this time to Mary Geoise for the Levely, with her father, Chaka, Pell, and Karoo. Vivi's antics caused Igaram to worry deeply about her. When her father mentioned the photos of potential suitors at the palace, Vivi cheerfully told him to throw them away."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Vivi_Heads_to_Sea.png/revision/latest/scale-to-width-down/210?cb=20170212152448", "caption": "Vivi departing for the Levely."}]}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Vivi read about it in the newspaper."}, {"type": "paragraph", "text": "The Alabasta Kingdom participants later arrived at Mary Geoise. At the castle, Vivi quickly befriended Rebecca and Leo and later Shirahoshi due to their relationship with Luffy. Vivi was then displeased to see Wapol again as the latter approached and insulted her. After Dalton interrupted and drove Wapol away, Vivi was happy to be reacquainted with him and Kureha."}, {"type": "paragraph", "text": "Later, a World Noble named Charlos tried to take Shirahoshi by force. Vivi was outraged and protested against the noble's actions. She was furious that CP-0 would even allow it. As Neptune prepared to attack the noble and CP-0, Vivi tried to stop him from attacking them recklessly. She then witnessed another World Noble, Donquixote Mjosgard, intervened on Shirahoshi's behalf and struck Charlos with a spiked mace before releasing Shirahoshi and apologizing to Neptune for Charlos' actions."}, {"type": "paragraph", "text": "After Charlos was taken away, Pell came and apologized to Vivi for not being at her side during the incident. Vivi then asked Pell about her father and Pell informed her that Cobra received a letter from Fujitora and he was in a meeting with the admiral and Riku Doldo III."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Shirahoshi%2C_%E2%80%8B%E2%80%8BVivi_and_Rebecca_Become_Friends.png/revision/latest/scale-to-width-down/215?cb=20190925183946", "caption": "Vivi, Rebecca, and Shirahoshi become friends."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Vivi vs. Koza (twice)", "elements": []}, {"text": "Vivi (as Miss Wednesday), Mr. 8, Mr. 9, and Miss Monday vs. Roronoa Zoro", "elements": []}, {"text": "Vivi and Usopp vs. Mr.5 and Miss Valentine", "elements": []}, {"text": "Vivi and Nami vs. Miss Valentine", "elements": []}, {"text": "Vivi and Pell vs. Miss All-Sunday", "elements": []}, {"text": "Vivi vs. Crocodile", "elements": []}, {"text": "Vivi vs. Bananawani", "elements": []}, {"text": "Vivi and Karoo vs. Mr. 2 Bon Kurei", "elements": []}, {"text": "Vivi vs. Mr. 7 and Miss Father's Day", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, when Vivi is still a member of Baroque Works, her top is different than that of the anime. The reason why the anime changed it is unknown, but it is most probably because of how the circles on her chest resemble nipples."}, {"type": "paragraph", "text": "This difference in the outfit caused one of her attacks, Miwaku no Memai Dance, to change in the anime, as explained in the article Peacock Slashers."}, {"type": "paragraph", "text": "She does have her original outfit design in some other media formats, such as Treasure Battle! and the extended version of Movie 8."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The FUNimation dub of Movie 8 calls her by this name, but it is written as \"Nefertari\" in the subtitles for the Japanese language track. Her name was later changed to \"Nefertari\" for the FUNimation uncut TV series. However, a strange situation with her naming scheme was used. Despite FUNimation using Japanese name order (surname before given name) for all other characters like Luffy, Zoro, and Robin, Vivi and her father's names are inexplicably flipped into Western name order (given name before surname), so she is referred to as \"Vivi Nefertari\" in this dub, causing a strange inconsistency."}, {"type": "paragraph", "text": "In the 4Kids dub, she suffered the same treatment as other female characters, mainly how her cleavage was often edited over."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Vivi has been shown in many forms of merchandise. She has been featured in the series of models Portrait of Pirates. She was also featured alongside Sanji in the One Piece Desert Kingdom Mascot Keychain/Cellphone Strap collection."}], "images": []}, {"title": "Songs", "level": 3, "content": [{"type": "list", "elements": [{"text": "Arabasta no Suna, Oasis no Shizuku", "elements": []}, {"text": "Wish Upon a Star", "elements": []}, {"text": "Girls ni Kubittake (Sanji with Nami and Vivi as back up singers)", "elements": []}]}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Legend of the Rainbow Island", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Big Secret Treasure of the Seven Phantom Islands", "elements": []}, {"text": "Grand Battle! Swan Colosseum", "elements": []}, {"text": "One Piece: Grand Battle! 3", "elements": []}, {"text": "One Piece: Grand Battle! Rush", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Vivi has her own personal jolly roger. This was first seen on the hat she was wearing in Igaram's nightmare when he feared that Vivi would run off to become a pirate with the Straw Hats.", "elements": []}, {"text": "As of the 5th Japanese Fan Poll, Vivi is the 24th most popular character, making her the fifth most popular female of the series behind Perona, Nico Robin, Boa Hancock, and Nami.", "elements": []}, {"text": "Vivi is similar to Rebecca as they are both princesses who became acquainted with Luffy and his crew, who in turn saved their country from a Shichibukai.", "elements": []}, {"text": "The Mr. 9 pair had a \"performing\" theme, with dancing and acrobatics.", "elements": []}, {"text": "Despite her long absence from the series and her separation from ties to the Straw Hat crew, Vivi and Karoo have been featured on the cover pages of several chapters.", "elements": []}, {"text": "She is a playable but secret character in One Piece: Mezase King of Pirates (with Igaram, Karoo, and Pell as support), One Piece Grand Battle as secret character (played as Miss Wednesday), One Piece Grand Battle 2 as Vivi with Chaka and Pell as her support, One Piece: Grand Adventure (with Karoo as a support character in addition to Chaka and Pell), and One Piece: Gear Spirit, with Karoo assisting with all of her super moves, One Piece Unlimited Adventure and One Piece Unlimited Cruise 2 as a character in vs. mode, and in One Piece Gigant Battle 2. She is also a support character in One Piece Gigant Battle.", "elements": []}, {"text": "In the 4Kids dub, her name is pronounced as Vivi with short I's, as opposed to FUNimation's dub, where it is pronounced as 'Veevee'.", "elements": []}, {"text": "Vivi is the first person that has an eyecatcher used during commercial breaks that is not part of the Straw Hat Pirates, and the only one to have one during the first set of eyecatchers.", "elements": []}, {"text": "Vivi may be named for Nefertari Meritmut, the wife of famed pharaoh Ramesses the Great.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Vivi%27s_Jolly_Roger.png/revision/latest/scale-to-width-down/140?cb=20080820204911", "caption": "Vivi's jolly roger."}]}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "The surname \"Nefertari\" is an ancient Egyptian name meaning \"the most beautiful\" or \"most wonderful.\" It was a word often used to describe Egyptian queens and princesses. Oda admitted the Alabasta Arc was based around ancient Egypt but apparently had no clue on what the word meant when he chose the name.", "elements": []}, {"text": "Vivi's favorite foods are curry and pudding, and her least favorite food is dried squid.", "elements": []}, {"text": "Vivi's specific number is 5.5.", "elements": []}, {"text": "Vivi's specific color is white (gold).", "elements": []}, {"text": "Vivi's animal resemblance is a dove (discussed with her Japanese voice actor: Misa Watanabe).", "elements": []}]}], "images": []}]}