{"sections": [{"title": "Queen", "level": 1, "content": [{"type": "paragraph", "text": "Queen the Plague is an All-Star of the Beasts Pirates as one of Kaido's three closest confidants, the Disasters. Currently, he serves as the de-facto ruler of Udon, a region in Wano Country."}, {"type": "paragraph", "text": "Due to his actions and role, he is a major antagonist in the Wano Country Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Queen is a massive, round-figured man (evidently obese, though claiming otherwise) with light skin. He seems marginally shorter than his fellow two All-Stars but is still at least twice a normal human's height. Similar to Jack, he is built top-heavy, with thick, tapering arms yet, compared to his upper self, smallish legs."}, {"type": "paragraph", "text": "Queen's head is hunched, undistinguished from his neck due to its plumpness, with a small face. His eyes are covered by sunglasses with white, oval rims, which instead of having temples are strapped on by black bands, going around his head in such a way as to form an X both on his forehead and occiput. He has no visible eyebrows, a small hook nose, and his small mouth, which sports blue lipstick, always smokes a big cigar. His hair is blond: a thick, queue-like braid through eight ties, with a stinger-shaped ending tuft, comes out the back of his head, which is otherwise bald. Additionally, he dons a Fu Manchu mustache whose tendrils widen as they droop to his chest. A stitched scar runs curvilinear from his right chest up to the shoulder. On Queen's upper right arm is a black tattoo consisting of his crew's Jolly Roger above his name in block capitals. Queen's left arm, up to the shoulder, seems cybernetic, composed of metallic rings, bolted plating, wiring, and even a small clock, with the corresponding hand covered in an orange glove."}, {"type": "paragraph", "text": "Queen wears large, extremely high-waisted overalls, reaching just below the chest, which are thickly, vertically striped black-and-white, and held up by suspenders connecting with 8-shaped, golden clasps on the frontal top edge; a piece of cloth striped the same is integrated into his metal arm. As footwear, Queen has simple, dark ankle boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Queen is a very flamboyant man who likes to sing and dance. Being extremely dramatic, he tends to treat matters like he is in a show, as seen when he told Babanuki to make an official ranking of his issues."}, {"type": "paragraph", "text": "Due to his flair for drama, Queen is very expressive and exaggerated in showing his shock to bad news. He can be rather vain, as he proudly proclaimed his muscle and how he would be much more attractive if he was not voluntarily this large."}, {"type": "paragraph", "text": "Like King, Queen is extremely rude and critical of his crewmates, as he was quick to deride his fellow All-Stars and call them names. He and King seem to have a mutual sense of disdain for Jack, as they are quick to gang up on him when in the same room. He also used derogatory language when addressing his subordinates in Prisoner Mine."}, {"type": "paragraph", "text": "Queen believes that the time it takes for a battle to conclude combined with the number of fighters is what determines the level of excitement in combat. To this end, Queen is fair to some extent, allowing Luffy to fight in the Great Sumo Inferno without being restricted by the Seastone cuffs. However, his execution games are nevertheless intended to be inescapable and unwinnable. He is also willing to add sadistic rules such as keeping Kid and Kamazo submerged in water until Luffy and Hyogoro die in the ring."}, {"type": "paragraph", "text": "According to Daifugo, Queen's hobbies are building weapons and viruses."}, {"type": "paragraph", "text": "Queen also has a fondness for beautiful women, as he was seen ogling a picture of Komurasaki, and he appears to frequent the Red-Light District for prostitutes. His subordinates believed that he would go berserk and take his anger out on them if he found out that Komurasaki was dead."}, {"type": "paragraph", "text": "Queen is a glutton who is extremely fond of oshiruko, claiming it is just as important to him as the air he breathes. He is adamant in his refusal to share with anyone. When Queen does not get his daily fill of oshiruko, he becomes easily irritable and even murderous. Queen's love for oshiruko is so immense, that he is willing to fight the Yonko Big Mom to prevent her from stealing his oshiruko."}, {"type": "paragraph", "text": "Queen is not completely fearless as he was terrified after seeing the change in Big Mom once she regained her memory. After Big Mom abruptly fell asleep, Queen took extreme precautions to restrain the sleeping Yonko and escort her to Onigashima as quickly as possible. However, this caused him to overlook the fact that Luffy was free of his collar and of the threat he now represent to Udon."}, {"type": "paragraph", "text": "Though Queen can be afraid, he would hide his fear behind a brave face. During Kaido and Big Mom's fight on Onigashima, Queen told his subordinates not to cower only for them to accuse Queen of trying to come up with a reason to leave Onigashima."}, {"type": "paragraph", "text": "Like many other characters, Queen has his own way of laughing, \"Muhahaha\" (ムハハハ, Muhahaha)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/71/Queen_Shocked.png/revision/latest/scale-to-width-down/210?cb=20190610125302", "caption": "Queen's exaggerated shock."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Queen is extremely rude toward his crewmates, but his subordinates are loyal to him and love his performances. In spite of that, Queen had faith that his subordinates could defeat Luffy despite the fact that Luffy had a higher bounty than Queen himself. Also, his crew has a sense of fear when Queen becomes angry especially when he did not get his oshiruko."}], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "Queen is one of Kaido's right hand men, meaning that Kaido has a great deal of trust in Queen and his abilities. They appear to have a casual standing, as Queen addresses Kaido by his name, rather than by title, such as \"Sir\" or \"Boss\". However, Queen is loyal to his general, as he attacked Big Mom for invading Wano."}], "images": []}, {"title": "King", "level": 4, "content": [{"type": "paragraph", "text": "Queen has a rivalry with his fellow All-Star, King, as they both didn't hesitate to insult one another in front of their subordinates. However, they both share a mutual disdain toward their other fellow All-Star, Jack. After escorting Big Mom to Onigashima, Queen furiously blamed King for Big Mom's presence."}], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "Despite both being All-Stars, Queen has an extreme amount of ridicule for Jack, as he joined King in ganging up on and insulting him when in the same room. Jack was silent at this verbal abuse and only replied in a respectful tone, despite his ruthless personality."}], "images": []}, {"title": "Komurasaki", "level": 3, "content": [{"type": "paragraph", "text": "Queen is immensely infatuated with Komurasaki, believing that her beauty is wasted on the Shogun Orochi and even carrying around her picture to ogle at in his free time. Queen's adoration for Komurasaki is so great that his subordinates are terrified of reporting her death to Queen in fear that he will kill them in a fit of rage. When Queen found out about her \"death\", he started crying and begging for it to be a lie."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Queen has genuine respect for Luffy for his strength and reputation as a member of the Worst Generation, as he repeatedly tried to convince Luffy to join the Beasts Pirates, and will personally ask his captain to pardon him for his crimes if he does, despite Luffy's openly rebellious attitude towards Kaido and his crew. Queen was impressed that Luffy was able to use Haoshoku Haki. Queen later became murderous towards Luffy after Kid and Killer were brought back. He also spoke derisively to him after the latter tried to attack him. When Big Mom breaks into Udon, Queen takes advantage of how Luffy was being chased by Big Mom where Luffy unknowingly lures Big Mom to be hit by Queen's Brachio Bomber. After Queen manages to subdue and capture Big Mom, Queen briskly chooses to prioritize the captured Yonko over Luffy, where Queen takes a large number of guards to help him transport Big Mom to Onigashima, leaving Udon severely weakened and more vulnerable as a freed Luffy begins his assault."}], "images": []}, {"title": "Hyogoro", "level": 4, "content": [{"type": "paragraph", "text": "Queen is familiar with Hyogoro as the legendary yakuza boss of the Flower Capital. After they first met, Queen mocked Hyogoro for his miserable plight and also sentenced him to the Great Sumo Inferno as a death sentence. Nevertheless, he was impressed by the latter's strength."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "As Big Mom is his general's rival, Queen is familiar with her. He was very shocked to see her at the Prison Mines, as he heard that her ship was sunk by King. Nevertheless, Queen and Big Mom came to blows when she demanded oshiruko, something Queen favored too. Despite her status as a Yonko, Queen prepared to fight her by transforming into a brachiosaurus only to be slammed by her. After devising a new strategy against Big Mom, Queen used his Brachio Bomber technique on her only to be shocked when Big Mom did not fall and became terrified when Big Mom suddenly regained her memory and recognized him though she suddenly fell asleep afterwards. Queen then chose not to underestimate Big Mom by imprisoning her using 100% pure Seastone chains, along with 100 injections of beast tranquilizers before quickly transporting her to Onigashima with tight security as escorts. Despite his fear towards her, Queen still showed her disrespect, calling her an \"old hag\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being an All-Star, Queen holds authority over the Beasts Pirates that is just below Kaido's. He also presides over the region of Udon in Wano Country where, chiefly, he superintends the prisoner mine; a task of him is coercing prisoners of notable strength into becoming subordinates to the Beasts Pirates. Additionally, Queen manages assassins in the crew's service, as Kyoshiro recommended contacting him when men of his family were attacked."}, {"type": "paragraph", "text": "With his incredibly high bounty of 1,320,000,000 and his All-Star rank, Queen is one of the most powerful members of the Beast Pirates, being considered an extreme threat to the World Government's operations."}, {"type": "paragraph", "text": "He has a powerful will, remaining unfazed by Luffy's Haoshoku Haki."}], "images": []}, {"title": "Engineering Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Queen is a highly skilled craftsman noted to have a particular interest in the creation of both Mechanical Weapons (カラクリ武器, Karakuri Buki) and viruses, having constructed his own prosthetic arm as well as \"Excite Bullets\", special ammunition contaminated with a highly infectious disease known as \"Mummy\"."}], "images": []}, {"title": "Medical Expertise", "level": 3, "content": [{"type": "paragraph", "text": "True to his epithet, Queen has immense knowledge in virology, having invented extremely infectious and deadly viruses which are contained in his creations the Excite Bullets. The viruses are powerful enough to affect even Luffy, who developed an immense resistance to poison due to his previous battle with Magellan."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Queen has the strength to stop a punch from Luffy with only one hand and then toss Luffy away, though these actions were done with his artificial arm. He has very fast reflexes, as he was able to catch a punch from Luffy before it could hit him. He also has tremendous durability, as he took a violent beating from the Yonko Big Mom and was able to remain conscious and stand back up on his feet only moments afterwards."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Queen ate the Ryu Ryu no Mi, Model: Brachiosaurus, an Ancient Zoan Devil Fruit that allows him to transform into a brachiosaurus hybrid and full brachiosaurus at will."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/25/Ryu_Ryu_no_Mi%2C_Model_Brachiosaurus_Infobox.png/revision/latest/scale-to-width-down/210?cb=20190610152351", "caption": "Queen's full brachiosaurus form."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Queen carries two swords, one on each of his hips. He also has access to special collars that eject blades from the inside."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Queen was present 20 years ago along with King and Jack when Kaido set Oden Castle ablaze in order to kill the Kozuki Family."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "At Onigashima, Queen was tinkering with his cybernetic arm while King was reprimanding Jack. Queen jumped in to insult both King and Jack, causing an argument between Queen and King."}, {"type": "paragraph", "text": "Sometime later, Queen paid a visit to Prisoner Mine in Udon. After spending time ogling a picture of Komurasaki, he was brought before the prison warden Babanuki. Following Queen's request for a list of the prison's top three problems, Babanuki told him that Eustass Kid had escaped, the keys to the Seastone handcuffs were stolen, and Luffy was currently trying to escape. Queen reacted with total shock to each of these problems and ordered for Luffy to be caught immediately. Luffy and Hyogoro were then caught and brought before him. Queen attempted to convince Luffy to join the Beasts Pirates and even offered to request that Kaido pardon Luffy's crimes against him, though Luffy still refused. Queen recognized Hyogoro as the former Yakuza boss who was overthrown around the same time as the Kozuki Family, and decided to execute him and Luffy through the Great Sumo Inferno."}, {"type": "paragraph", "text": "Queen had his men put collars around Luffy and Hyogoro which would blow their heads off once they left the ring, and explained that they would have to fight against his men, who had no restrictions. However, he gave them a boost in strength by removing their Seastone handcuffs before letting his men into the ring to knock out the two prisoners. Luffy immediately knocked out the attackers with Haoshoku Haki, impressing Queen."}, {"type": "paragraph", "text": "As Luffy continuously defeated his opponents in the Sumo Inferno, Daifugo commented that the execution would have ended sooner if he had been fighting in the ring, but Queen told him that the length of time and the number of fighters make the battles more exciting. Queen then ordered more oshiruko, saying they are as important to him as air and he would not share them with anyone."}, {"type": "paragraph", "text": "After Alpacaman and Madilloman entered the ring, some of the spectators thought that the death match would be over, but Queen disagreed with them. After watching Luffy defeat more opponents, Queen left the arena when night fell, but Luffy and Hyogoro remained in the ring."}, {"type": "paragraph", "text": "On the next day, Queen was informed by Kaido about Komurasaki's \"death\", causing him to be devastated. He was also suprised to see Luffy and Hyogoro becoming fat, but ignored them to turn on the Picture Tanishi to see Komurasaki's funeral. Through the broadcast, Queen watched the execution of Shimotsuki Yasuie. Queen was then amused to watch the commotion started by Luffy's crewmates. Afterwards, Babanuki informed Queen that they brought Kamazo and the recaptured Kid. Queen then subjucated Kid and Kamazo to water torture and declared that they would remain submerged until Luffy and Hyogoro die. Luffy attempted to punch Queen, but he easily caught his fist and threw it aside. Queen then heard a loud noise coming from outside the gate."}, {"type": "paragraph", "text": "Queen was then surprised to see Big Mom breaking into the prison. As he confronted her, she asked him to give her oshiruko. Upon hearing this, Queen became extremely angry, asking Big Mom who had told her that oshiruko was his favorite food, and transformed while refusing to share any of it with her. In response, Big Mom attacked him, smashing his head into the ground with great force. Big Mom then swung Queen around by the neck and threw him into a wall, defeating him. While lying on the ground in human form, Queen heard that Luffy ate the oshiruko."}, {"type": "paragraph", "text": "As Big Mom chased Luffy through the Prisoner Mines, Queen got back on his feet and devised a plan to subdue Big Mom. When she came back, Queen distracted Big Mom with the pot of oshiruko and attacked her by slamming into her head in his brachiosaurus form. The attack did not inflict any significant damage, and in fact seemed to restore her memories, causing Queen to panic. However, Big Mom fell asleep immediately afterwards. Queen then ordered his men to wrap the sleeping Big Mom in 100% pure Seastone chains and inject her with heavy doses of anesthesia before bringing her to his ship. As he left Babanuki in charge of the prison, Queen escorted Big Mom to Onigashima."}, {"type": "paragraph", "text": "After bringing Big Mom to Onigashima, Queen scolded King for not being thorough in eliminating her. When Jack asked Queen his reason for bringing Big Mom, Queen angrily answered that communications in Udon were cut off. He was then later shocked to witness a clash between Kaido and Big Mom. As Kaido and Big Mom continued their fight, Queen planned to check on Udon, which his subordinates thought was an excuse to get away from the battle. Queen then contacted Babanuki, who reported that Luffy, Kid, and the prisoners were locked up."}, {"type": "paragraph", "text": "Queen was later displeased to hear that the Numbers had returned to Wano Country. He was then surprised to see Kaido and Big Mom suddenly becoming friendly with each other."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/53/Big_Mom_Attacks_Queen.png/revision/latest/scale-to-width-down/210?cb=20190719223158", "caption": "Big Mom attacks Queen after he refuses to share his oshiruko."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Queen vs. Charlotte Linlin", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Like his fellow All-Stars King and Jack, Queen is named after the playing card rank, fitting with the card-themed names of the Beasts Pirates.", "elements": []}, {"text": "Queen's appearance is reminiscent of the character Heart from Fist of the North Star.", "elements": [{"text": "He also seems to take some visual cues from Obelix, a character from the Franco-Belgian comic The Adventures of Asterix.", "elements": []}]}, {"text": "Queen has interjected the word \"Ekisaito\" (エキサイト, \"Ekisaito\" literally \"Excite\") into his sentences. The Japanese word for his epithet, \"Plague\", is \"Ekisai\" (疫災, \"Ekisai\"). The Viz translation retains the pun, with Queen saying phrases like \"I'm plagued with excitement!\".", "elements": []}, {"text": "Queen is the only All-Star that is human.", "elements": []}]}], "images": []}]}