{"sections": [{"title": "Moda", "level": 1, "content": [{"type": "paragraph", "text": "Moda is a milk maiden that Ace met during his cover story. She is the daughter of Koda and Kyuji."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Moda is a young girl with shoulder-length blonde hair (light brown in the manga), that is half covered by a white bandanna, and light blue eyes. She wears a long red and pink skirt decorated with an intricate pattern with a light blue shirt and dark blue boots."}, {"type": "paragraph", "text": "After the timeskip, she has notably grown, looking more like an adult woman with defined curves and her hair has become longer. However, her attire is similar to what she wore before the timeskip but has replaced her top with a long-sleeved blouse. Her bandana now has a cow pattern and has long brown boots. One of her teeth has also been chipped."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Moda is a kind and caring girl, rescuing Ace from a river and nursing him to health. She also cares deeply for her parents. Moda is also afraid of the wrath of the World Nobles."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "After having her latent power awakened by Betty's Kobu Kobu no Mi, Moda was able to beat down Pinkbeard, a pirate captain with a bounty of 52,000,000, with only one hit with a stick."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Ace's Great Blackbeard Search", "level": 3, "content": [{"type": "paragraph", "text": "She saved Ace from the river after he was kicked into it by Doctor Black Beard, an angry chef Ace had skipped out on, and several others. Ace later returned the favor by reuniting Moda with her parents who were working as cooks on one of the Marines' ships."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Pinkbeard and his crew invaded Lulusia Kingdom, Moda begged him not to steal from them, as the only money they possess goes to the World Nobles as an offering. Pinkbeard struck her down and demanded she hand it over, but Moda was caught by Belo Betty. After Betty bolstered the townspeople using her abilities, Moda used her newfound strength to defeat Pinkbeard."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/Moda_Batters_Pinkbeard.png/revision/latest/scale-to-width-down/180?cb=20190414113545", "caption": "Moda batters Pinkbeard."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Moda vs. Pinkbeard", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "During the Pinkbeard Pirates' attack in the anime, Moda is trying to protect a jar of milk from them, which was not shown in the manga. In the manga, Moda struck Pinkbead on the top of his head. In the anime, she struck him in the face."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "One Piece Green: Secret Pieces revealed a sketch of an older Moda from Oda's notebook."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Early_Moda.png/revision/latest/scale-to-width-down/105?cb=20110301124946", "caption": "Moda from One Piece Green."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Moda\" in many Latin, Slavic, and other languages, means \"fashion\". In Japanese, this may be a pun on \"moh\", which is the sound cows make.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 30 Chapter 278, cover story: Ace's Great Blackbeard Search Vol. 6.", "elements": []}, {"text": "↑  One Piece Anime — Episode 381, Moda and her parents appear in the newspaper Crocus is reading.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904, Moda appears as a citizen of Lulusia Kingdom.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 179).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 30 Chapter 279, cover story: Ace's Great Blackbeard Search Vol. 7, Moda is seen working as a milk maiden.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 30 Chapter 280, cover story: Ace's Great Blackbeard Search Vol. 8.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 30 Chapter 281, cover story: Ace's Great Blackbeard Search Vol. 9.", "elements": []}, {"text": "↑  One Piece Anime — Episode 880.", "elements": []}]}], "images": []}]}