{"sections": [{"title": "Tonjit", "level": 1, "content": [{"type": "paragraph", "text": "Tonjit is a nomad who lives on Long Ring Long Land."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tonjit is an elderly man, with wrinkles and a round white beard. He has small round eyes, a round nose, and is missing one tooth. He has a purple-brown hat, with brown fur lining, and brown cloth on the sides. He wears a yellow tunic, with green lining with a circle design on the end of the sleeves, and side of the chest. He has a purple sash, with a red string hanging down. He wears purple shoes, held on by white strings, and grey on the toe area. He also wears vertical zigzag striped purple and tan pants."}, {"type": "paragraph", "text": "Twenty two years ago, he wore the same clothes, but had a less wrinkled face, and a shorter beard, which was black. He also had not lost his tooth yet."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Tonjit is a very kind yet equally eccentric old man, as he claimed to remember Luffy from a long time ago when he first met him, and calmly accepted the truth once Luffy and Chopper said that they haven't seen him before. He has a tendency to have no consideration of the consequences of his actions, as he wound up getting himself stuck on a pair of bamboo stilts for ten years while attempting to break a world record for the tallest pair of stilts. He loves his horse Shelly very much and she also feels the same about him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Twenty-two years ago, one week after Gol D. Roger's execution, Tonjit was seen inspired to challenge the world with stilts and break a world record."}], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "Years later, Tonjit was trapped on a pair of very tall stilts for ten years, causing him to be separated from the rest of the nomads. After the Straw Hat Pirates got him down, he lamented that he could not get to the rest of the nomads because of the high tides, but was nonetheless reunited with his long horse, Shelly. Shelly however was later captured by Foxy, which prompted the Davy Back Fight between the Straw Hat Pirates and the Foxy Pirates. After Luffy finally beat Foxy, Admiral Aokiji appeared and used his Devil Fruit powers to freeze all of the water on the island for a week, allowing Tonjit to ride his horse Shelly across the water in order to meet up with his clan."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Chopper%2C_Luffy%2C_and_Usopp_Meet_Tonjit.png/revision/latest/scale-to-width-down/180?cb=20130416202417", "caption": "The Straw Hats save Tonjit."}]}, {"title": "From The Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "He was able to reunite with the rest of the nomads and was seen reading the news about the Straw Hats while his grandchildren are playing around him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Tonjit_with_his_grandchildren.png/revision/latest/scale-to-width-down/180?cb=20140601232815", "caption": "Tonjit with his grandchildren."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tonjit's clothing, nomadic lifestyle, his horse, and his dwelling in a yurt seems to be based on the lifestyles of the nomadic peoples of Mongolia.", "elements": []}, {"text": "He is the shortest adult human male in One Piece, with the only other human being shorter than him is Bakkin.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 32 Chapter 304 and Episode 207, Tonjit is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 118), Tonjit's birthday is given.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0338), Information about Tonjit is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 0 Chapter 0 and Episode 0.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 66 Chapter 650, cover story: From the Decks of the World Vol. 33.", "elements": []}]}], "images": []}]}