{"sections": [{"title": "Hyogoro", "level": 1, "content": [{"type": "paragraph", "text": "Hyogoro of the Flower was the most famous yakuza boss in Wano Country during the Kozuki Family's reign. During Kurozumi Orochi's reign, he was imprisoned in Udon's prisoner mines until he was freed by Monkey D. Luffy. As a prisoner, he was known as Grandpa Hyo (ヒョウじい, Hyō-jii)."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hyogoro is a small, elderly man with a cyan tuft of hair and goatee that resemble small flames. He has a blue tattoo covering his shoulders and upper back that resembles a vest with pink flower patterns and a border."}, {"type": "paragraph", "text": "He appears to wear a black and white striped yukata undone above the waist, leaving his upper body bare aside from a small orange scarf. He also wears small round orange glasses and warabi sandals."}, {"type": "paragraph", "text": "Over twenty years ago, he was a taller heavyset man with longer hair and goatee resembling wilder flames."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hyogoro is an extremely honorable and kind man who was once famous throughout Wano for his unmatched chivalry as a samurai. Countless samurai and even Oden himself held utmost respect for him. Hyogoro deeply despises the tyranny of Kurozumi Orochi and the Beasts Pirates, denouncing their oppression of Wano's citizens and murder of everyone who stood up to them. When given the chance to submit before Orochi, he refused, yearning for the old days when honorable people were still alive."}, {"type": "paragraph", "text": "After spending a long time in the prison, he became somewhat timid, although still voiced his disappointment with his lack of food despite such an attitude being punishable. However, when Luffy gave him more dango, Hyogoro took the pirate's honor very seriously and made no secret of his new fortune, being willing to accept death for it because of how it fulfilled his memories of the past. By his admission, he consigned himself to a miserable death in prison."}, {"type": "paragraph", "text": "Upon reuniting with Raizo and made aware of the whereabouts of the alleged deceased members of the Nine Red Scabbards and Momonosuke, Hyogoro came to appreciate a new will to live, being very relieved that he did not die before knowing everything, and requesting to join the Ninja-Pirate-Mink-Samurai Alliance to crush Orochi and Kaido."}, {"type": "paragraph", "text": "He can be bold, staying in the path of an angry Big Mom just to test Luffy."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Wano Country", "level": 3, "content": [{"type": "paragraph", "text": "Hyogoro was respected by all the samurais of Wano for his immense chivalry and kindness towards the citizens. Shinobu believed that if Hyogoro joined their campaign in overthrowing Kaido and Orochi, he could rally all the samurais to their cause. After being imprisoned, most of the citizens thought he was executed by Orochi for defiance and his fellow prisoners no longer recognized him as the legendary Yakuza, simply referring him as Grandpa Hyo. They cared deeply for Hyogoro who no longer had the strength to work in the hard prison labor, but lack the courage to help him by defying the Beast Pirates. When Daifugo attacked Hyogoro for cheating the system, they pleaded him to stop hurting Hyogoro as he could possibly die due to his old age. However, when seeing him use an advanced Busoshoku Haki technique on a Gifter, the prisoners realize that he is Hyogoro. Hyogoro also expressed sadness at the death of the former benevolent Hakumai Daimyo Shimotsuki Yasuie after seeing his execution. Hyogoro held immense sympathy towards the poor citizens of Wano's immense suffering and misery from Kaido and Orochi's tyranny, as when Luffy was silently angered at the Ebisu Town citizens laughing at Yasuie's death, Hyogoro solemly explained about the side effects of the defective SMILE fruits whom Orochi had fed his own citizens including some of their fellow prisoners who had fallen victim to Orochi's twisted cruelty. When Daifugo and the other Beast Pirates attacked his fellow prisoners, Hyogoro rushed to their aid, though was disappointed by their broken morale that led them to simply give into the Beast Pirates's oppression, when Luffy successfully convinced them to retaliate back at the Beast Pirates, Hyogoro was elated while praising Kinemon for making an extremely wise choice of recruiting Luffy as their ally. "}], "images": []}, {"title": "Kozuki Family", "level": 3, "content": [{"type": "paragraph", "text": "Among the many Wano citizens, even Kozuki Oden himself held the utmost respect for Hyogoro. In turn, when the family was believed to have died out completely, Hyogoro came to lose his will to live and consigned himself to a miserable death in Udon. Seeing Raizo still alive renewed his will to live, and he requested to join the alliance to topple Orochi. Raizo was surprised to see the difference in Hyogoro's appearance since their last contact 20 years ago, but was nevertheless confident in his charisma being a valuable asset to their alliance. Even after Hyogoro's fall from grace, Kawamatsu continues to worry for his safety, imploring Luffy not to let the elderly yakuza die."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Due to Luffy saving his life and offering him dango, Hyogoro held immense gratitude and respect for Luffy because of how he reminded him of his past. Luffy himself took a liking to Hyogoro and openly attacked Daifugo when the latter tried to kill Hyogoro despite the consequences of execution. Hyogoro showed great concern when Luffy was hurt by Babanuki and pleaded with Queen to spare Luffy, even offering to be punished in his place. During the Sumo Inferno, Hyogoro was able to dodge attacks because he trusted Luffy's instructions. Once he found out about the advanced Busoshoku Haki technique that Luffy was trying to learn, Hyogoro offered to teach him. Upon learning that Luffy is an ally of the still living Momonosuke, Hyogoro came to believe that it was fate that Luffy was sent to Udon, where many potential allies are imprisoned by Orochi, and that it is the most ideal location to reinforce their rebellion against the tyrants of Wano."}, {"type": "paragraph", "text": "Hyogoro wishes for Luffy to get stronger as he put himself in the path of an angry Big Mom in the hopes that Luffy can improve his skills. When the prisoners in Udon began to doubt Luffy after learning he is a pirate, Hyogoro vouched for him. He has shown to have great faith in Luffy's abilities as he continued to supervise his training after the prison takeover."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Beasts Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Hyogoro strongly despises the tyranny of the Beasts Pirates and their ally Orochi and was thrown into prison for his refusal to submit. After being helped by Luffy, Hyogoro bravely declared his disdain for the Beasts Pirates when Daifugo threatened to kill him. When they first met after many years, Queen mocked Hyogoro for his miserable plight. Once he witnessed Hyogoro used an advanced Busoshoku Haki technique to defeat Alpacaman, Queen expressed praise towards the old man."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "In the past, Hyogoro was once Wano's most famous yakuza boss, being in charge of all Underworld dealings in the Flower Capital. He curried enough respect to hold authority over the five yakuza bosses of the other regions of Wano. In fact, his popularity among the Wano population was so massive that Shinobu was certain that, even after two decades, Hyogoro alone would be able to recruit the necessary amount of samurai to stand a chance in the revolution against Orochi."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As an elderly man, he appears weak and frail. He was hurt heavily when attacked by the prison guards. However, he is strong enough to move five large stone blocks. He does have some endurance as he survived getting sent flying into a wall by Big Mom though he used Busoshoku Haki to soften the impact. Despite suffering this injury, he is able to fight the Beasts Pirates later on."}, {"type": "paragraph", "text": "Hyogoro has displayed great agility in spite of his old age. He was able to avoid the sword attacks of Alpacaman and counterattack fairly easily, though he did have Luffy's future vision to tell him what would happen next."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Hyogoro is an extremely skilled and experienced Busoshoku Haki user, which is called \"Ryuo\" in Wano. He can harden parts of his body and can utilize an advanced application of Busoshoku Haki that allows him to emit his Haki a short distance without a medium. It is strong enough to strike down a Gifter without touching him. He also withstood an attack from Big Mom by guarding himself with Busoshoku Haki."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Hyogoro_Attacks_Alpacaman.png/revision/latest/scale-to-width-down/180?cb=20190426071738", "caption": "Hyogoro demonstrates his Busoshoku Haki."}]}, {"title": "Swordmanship", "level": 3, "content": [{"type": "paragraph", "text": "Hyogoro is an extremely skilled veteran samurai as despite his old age and twenty years of imprisonment, he manages to dispatch dozens of Beasts Pirates easily with his sword."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "20 years ago, Hyogoro wielded a long thin katana. He regains his sword after joining the rebellion."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Years ago during the Kozuki Family's reign, Hyogoro was the most famous yakuza boss in Wano Country. He was allied with the Kozuki Family, whose patriarch, Kozuki Oden, was a fan of his since childhood. When Oden was 15, Hyogoro and his yakuza family got dragged into the Harem Revolt incident. 41 years ago, his subordinates informed him of Kin'emon stealing their money. Hyogoro simply told his men that they would not stand a chance against Kin'emon in a one-on-one fight. He later witnessed Oden defeating the Mountain God and was impressed by this feat."}, {"type": "paragraph", "text": "When Kurozumi Orochi took over as Wano's shogun 20 years ago, Hyogoro refused to submit to him, causing him to be imprisoned by the Beasts Pirates in Udon's Prisoner Mine."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After moving five big block rocks in the Prisoner Mines, Hyogoro went to collect his dango allotment and was disheartened to see that he only received one piece of kibi dango for his work. The guard punched Hyogoro for talking back, leaving him lying on the ground. The deputy warden Dobon then arrived and stepped on Hyogoro, but was then defeated by the prisoners Monkey D. Luffy and Eustass Kid, and Luffy picked up Hyogoro and carried him on his shoulder."}, {"type": "paragraph", "text": "On the next day, Hyogoro thanked Luffy for saving him. Luffy then gave Hyogoro some of his meal tickets in an act of kindness."}, {"type": "paragraph", "text": "The next day, Hyogoro was attacked by the guards, who were suspicious about him having so many meal tickets. However, he refused to give up his dango, as Luffy's actions reminded him of Wano's past and he was willing to die now that this had fulfilled him. Before Daifugo could kill Hyogoro, though, Luffy came in and attacked the guard. Hyogoro and Luffy were then caught and brought before Queen. After Queen mocked him for being a weak old man, Hyogoro begged Queen to spare Luffy."}, {"type": "paragraph", "text": "Hyogoro and Luffy were sentenced to fight in death matches called the Sumo Inferno. Both of them were forced to wear collars that will behead them if they step out of the ring, but they were allowed to have their handcuffs removed for combat. As the first group of opponents attacked them, Hyogoro watched as Luffy instantly knocked them out with Haoshoku Haki. After Luffy defeated more opponents, Hyogoro was puzzled when Luffy mentioned Rayleigh."}, {"type": "paragraph", "text": "Hyogoro and Luffy were eventually confronted by Alpacaman and Madilloman. Thanks to Luffy being able to predict their attacks, Hyogoro was able to avoid them. When Luffy told Hyogoro about trying to learn an advanced Busoshoku Haki technique, Hyogoro demonstrated this technique and defeated Alpacaman with it."}, {"type": "paragraph", "text": "Hyogoro tried to teach Luffy, but the latter continued defeating opponents without making any progress. They eventually exhausted to nighttime when everyone else went to sleep. Hyogoro questioned Luffy why he wanted to defeat Kaido, and in the process, Raizo came to explain everything. Surprised to see Raizo and learn that the Nine Red Scabbards and Momonosuke are all still alive, Hyogoro came to renew his will to live and requested to join their alliance to topple Kaido and Orochi. He also revealed many potential allies that were locked in the prison."}, {"type": "paragraph", "text": "During the night, Hyogoro and Luffy ate oshiruko that were stolen from Queen but overate and grew fat. On the next day as the Beasts Pirates gathered around the ring, Hyogoro and Luffy prepared for the next set of matches, but Queen went to turn on the Picture Tanishi. Hyogoro then tearfully witnessed the execution of Shimotsuki Yasuie. When Luffy commented that no one should laugh when a person dies, Hyogoro explained about a side effect of the SMILE fruits. After watching Luffy's crewmates causing a commotion at the execution site, Hyogoro saw Kamazo and the recaptured Kid brought to the prison. After Kid revealed Kamazo to be his crewmate Killer, Hyogoro noted that Killer became a victim of a defective SMILE fruit."}, {"type": "paragraph", "text": "Soon afterwards, Hyogoro witnessed Big Mom breaking into the prison. Unlike Luffy and the Beasts Pirates, Hyogoro was not shocked since he was unfamiliar with her. He was then surprised to see Big Mom overpowering Queen. After Luffy unwittingly admitted that he ate the oshiruko that Big Mom was looking for, Big Mom directed her anger towards Luffy and pushed him and Hyogoro out of the ring. Fortunately, Luffy managed to remove the collars. Hyogoro stayed in Big Mom's path, hoping that Luffy could become stronger by fighting her."}, {"type": "paragraph", "text": "Hyogoro noted that what Luffy just did was superior to what he had been trying to teach him, and so if Luffy could do that, he should be able to protect him from the attacking Big Mom. However, Big Mom instantly sent Luffy and Hyogoro crashing into a wall. Luffy worriedly apologized to Hyogoro as he pulled him out of the wall, and Hyogoro revealed that he used Haki just in case. Hyogoro told Luffy more about the advance usage of Busoshoku Haki before Big Mom chased Luffy throughout the Prisoner Mines."}, {"type": "paragraph", "text": "After Queen took Big Mom away from the Prisoner Mines, Hyogoro watched Luffy fight the Beasts Pirates, commenting that Luffy was not easily discouraged. After Raizo freed Kawamatsu and joined up with Kikunojo and Chopper, Hyogoro told Kikunojo and Raizo to reveal themselves in order to rally the prisoners. Hyogoro and his allies then prepared for battle. As they fought against the Beasts Pirates, they were soon cornered by prisoners who were infected by the Mummy virus. Hyogoro was amazed when Luffy managed to sway them into rebelling against the Beasts Pirates. He was then pleased to see Luffy defeat Babanuki."}, {"type": "paragraph", "text": "After the prison takeover, the prisoners became skeptical when they learned that Luffy is a pirate. Hyogoro became worried as he tried to reassure them. He then wondered where Luffy went. While seeing the prisoners bowing to Momonosuke, Hyogoro realized that they needed a goal in order to fight."}, {"type": "paragraph", "text": "After Chopper treated Luffy and the infected prisoners, Hyogoro was pleased to see how much trust Luffy had gained. He then got reacquainted with the four yakuza bosses who were also imprisoned in Udon. When they threatened Luffy for speaking to Hyogoro casually, Hyogoro once again vouched for him."}, {"type": "paragraph", "text": "As the day of the Fire Festival drew closer, Hyogoro continued supervising Luffy's Busoshoku Haki training. He also received Yasuie's last message. After Luffy finished with his training and left Udon two days before the raid on Onigashima, Hyogoro was contacted by Kin'emon, who told everyone participating to use the remaining time to prepare. Hyogoro also informed his fellow rebels in Udon that Cho would be bringing weapons from Ringo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/32/Luffy_and_Hyogoro_in_the_Sumo_Inferno.png/revision/latest/scale-to-width-down/200?cb=20190322044047", "caption": "Hyogoro and Luffy competing in Queen's Sumo Inferno."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d9/Luffy_Saves_Hyogoro.png/revision/latest/scale-to-width-down/180?cb=20190629004503", "caption": "Luffy saves Hyogoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3e/Luffy%27s_Group_Fights_in_Udon.png/revision/latest/scale-to-width-down/210?cb=20190709072609", "caption": "Hyogoro and his allies prepare to take over Udon."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Luffy_training_advanced_haki.png/revision/latest/scale-to-width-down/286?cb=20190902181004", "caption": "Hyogoro supervises Luffy's training in advanced Busokoku Haki."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hyogoro and Monkey D. Luffy vs. Madilloman and Alpacaman", "elements": []}, {"text": "Hyogoro, Monkey D. Luffy, Tony Tony Chopper, Raizo, Kikunojo, and Kawamatsu vs. Beasts Pirates (Prisoner Mines)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His appearance from 20 years ago resembles Fudō Myō-ō, a guardian deity primarily revered in Vajrayana Buddhism, and the Kongōrikishi, the two wrathful guardians at the entrance of many Buddhist temples.", "elements": []}, {"text": "He is the second person to teach Luffy the art of Haki (after Rayleigh). In this case, it is advanced Busokoku Haki.", "elements": []}]}], "images": []}]}