{"sections": [{"title": "Dobon", "level": 1, "content": [{"type": "paragraph", "text": "Dobon is a Headliner of the Beasts Pirates who serves as a vice warden of the Prisoner Mine in the Udon region of Wano Country."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dobon is a very large man with short, dark spiky hair and a hippopotamus' muzzle. He wears a pair of very large trousers held up by two suspenders, and does not wear a shirt. He also wears a frilly garment on his shoulders with hippo's feet designed on them and dark gloves, and he has flame-shaped tattoos on his arms near the wrists."}, {"type": "paragraph", "text": "Because he ate a hippo SMILE, Dobon's legs have become infused with the bottom lip of an extremely large hippo, causing him to effectively sit inside the hippo's mouth. The hippo only has a pair of hind legs as Dobon's legs are the forelegs, and it wears dark pants around its hindquarters."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Dobon is very gluttonous and selfish, getting angry at Monkey D. Luffy and Eustass Kid for depleting the Prisoner Mines' kibi dango rations even though they worked to earn it, and he was willing to abuse his authority as deputy warden to withhold their earnings from them. He is also very flippantly callous towards prisoners, as shown when he stepped on Hyo."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Headliner in the Beasts Pirates, Dobon holds a high position in the crew and has authority over lower-ranking members, and as a vice warden of the Prisoner Mines, he has a great amount of authority over the prisoners there and can do whatever he likes to them."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Dobon ate a hippo SMILE, causing a hippopotamus' body to grow out from the back of his legs, resulting in his legs being fused with the hippo's lower lip. Dobon also gains hippo features on his face. The hippo's mouth is very large, and can fit Dobon as well as other people, which can give Dobon an advantage in battle if the hippo catches his opponents in its mouth, which is dubbed a \"Slaughter Room\" (惨殺部屋, Zansatsu Beya) by his subordinates. However, the hippo has a mind of its own, meaning it sometimes acts without Dobon's input, most notably closing its mouth and cutting Dobon off from those around him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Dobon%27s_Hippo.png/revision/latest/scale-to-width-down/210?cb=20181204012416", "caption": "Dobon's hippo (with its mouth closed)."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Dobon wields two daggers, which he presumably uses to attack opponents when he catches them in his hippo's mouth."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After discovering that the Prisoner Mines' kibi dango rations had been cleared out to the point of leaving him with only three pieces left to eat, Dobon became enraged and demanded to know which prisoners were responsible, while he crushed Grandpa Hyo beneath his feet. His subordinates attempted to explain to him that the prisoners had earned their kibi dango through their work, but when Dobon tried to continue speaking, his hippo had already closed its mouth on him, causing his words to be muffled. Monkey D. Luffy and Eustass Kid were then brought before him, and Dobon prepared to discipline them by entrapping them in his hippo's mouth where he would then dish out their punishment. However, before Dobon could initiate his \"Slaughter Room,\" Luffy and Kid quickly knocked out him and his hippo out from within its mouth. Dobon then collapsed on the ground and, although his subordinates threatened the two with execution, none of the prisoners would bear witness to Luffy and Kid's transgression."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dobon vs. Monkey D. Luffy and Eustass Kid", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Dobon is a card game in Japan. This fits with the game-themed names of the Beasts Pirates Headliners.", "elements": [{"text": "Dobon is also a term for the ending of Japanese Mahjong, where a player loses all of their points.", "elements": []}]}, {"text": "Dobon's appearance and gluttonous personality, especially by the dangos, may also be based off the board game Hungry Hungry Hippos.", "elements": [{"text": "Along with the gluttony and hippo theme, Dobon shares similarities to Wapol.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 92 Chapter 926 (p. 14-17), Dobon makes his debut.", "elements": []}]}], "images": []}]}