{"sections": [{"title": "Killer", "level": 1, "content": [{"type": "paragraph", "text": "\"Massacre Soldier\" Killer is a pirate from the South Blue and a member of the Kid Pirates. He is one of twelve pirates who are referred to as the \"Worst Generation\". After the timeskip, his bounty has been raised from 162,000,000 to 200,000,000."}, {"type": "paragraph", "text": "Following the confrontation with Kaido, unknown events occurred, leading to Killer eating a defective SMILE and taking on the alias of Kamazo the Manslayer, a street murderer in Wano Country who secretly acted as an assassin working for the shogun, Kurozumi Orochi, until the shogun discarded him after he failed his mission to kill Toko."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Killer is a tall, muscular man. He has long wild blonde hair that reaches down to his thighs. He wears a plain, white and light-blue striped full-head helmet with many rows of holes in it, and what look like modern headphones on both sides. He also wears a black shirt with white polka-dots and an open collar that shows his chest, with blue riding chaps over his pants. Additionally, Killer has a red sash around his waist."}, {"type": "paragraph", "text": "He carries a pair of handguards which have very long detachable scythes connected to them. When not fighting, these scythes are placed in a large sheath tied to his right hip."}, {"type": "paragraph", "text": "In an SBS Volume 64, Oda drew the Supernovas as children. Killer is shown as a kid with a wavy hair that covered his eyes with a plain t-shirt, pants and shoes, eating a plate of noodles. This makes a reference to SBS Volume 62, that Oda stated that Killer, as an adult, prefers to consume food that can pass through the holes of his mask, such as stick-shaped ones and ramen."}, {"type": "paragraph", "text": "After the timeskip, Killer is shown as more muscular and with a thicker neck. He has grown a goatee and is shown to have a prominent scar on his left arm. His hair is shorter, now only reaching down to his back. He has changed his attire after the two year timeskip to a blue t-shirt with his customized Jolly Roger on."}, {"type": "paragraph", "text": "Under the guise as Kamazo the Manslayer, Killer lost his mask and has bandages covering most of his face. His hair is kept bound, and he wears a dark kimono with sickle-shaped patterns placed on it irregularly, as well as an obi around his waist and a cape that both have target patterns on them."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like the rest of Kid's crew, Killer comes across as both mildly arrogant and level-headed; in the latter case, probably more so than their captain. Of course, this does not mean he is not as enticed toward violence as anybody else on the crew. He also remains fairly silent during combat, save for the slicing of his blades, and tends to focus on the elimination of his enemies. Killer is more knowledgeable than his captain in terms of historical facts, as shown when he informed Kid the meaning of the Ox Bell. "}, {"type": "paragraph", "text": "After the timeskip, Killer has been shown to be much calmer than his captain, advising him to be polite when meeting with his fellow Supernovas, and was then able to prevent a fight between him and Scratchmen Apoo from escalating while reminding them of the purpose of their meeting. He also seems to be more reasonable than his captain, which is in contrast to his name, as he tried to reason things out rather than immediately trying to start a fight."}, {"type": "paragraph", "text": "After eating a faulty SMILE fruit, Killer lost the ability to express negative emotions and is now only able to smile and laugh."}, {"type": "paragraph", "text": "After taking on the alias Kamazo, he displays the traits of a violent man who takes pleasure in killing. If he encounters someone whom he has not been ordered to kill, he will give them the chance to get out of his way, but will kill anyone who stands between him and his target without issue. He is very confident in his abilities, constantly taunting his opponents and being sure that they will lose to him. As someone who worked for Orochi, \"Kamazo\" held the shogun in high regard and would get mad if anyone referred to the shogun in an impolite manner."}, {"type": "paragraph", "text": "Like many other people, he has a unique laughter style: \"Faffaffaffa\" (ファッファッファッファ, \"Faffaffaffa\"). According to Kid, Killer hates his own laugh to the point of stopping himself from doing so ever since. Moreover, he also hates people laughing at his laugh and is willing to kill them for it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Killer_as_Kamazo_Shedding_Tears.png/revision/latest/scale-to-width-down/210?cb=20190603133703", "caption": "\"Kamazo\" sheds tears through his smile."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Killer is a fearsome pirate and combatant. His skills have earned him a bounty of 200,000,000 which is considered to be very impressive for a rookie, even within the Grand Line. Like his captain, he was able to resist Rayleigh's burst of Haki."}, {"type": "paragraph", "text": "Killer's style of fighting seems to rely mainly on agility and speed, which he uses to overpower his opponent before they can strike him, or to dodge attacks. He was capable of fighting head on with Urouge at Sabaody Archipelago and with Roronoa Zoro at Wano Country."}, {"type": "paragraph", "text": "After eating a failed SMILE, Killer lost his ability to swim."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Killer_Attacking_with_Scythes.png/revision/latest/scale-to-width-down/210?cb=20100725005742", "caption": "Killer agilely attacking with his scythes."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Killer is seen using a pair of scythe-bladed weapons attached to his armbands that are capable of spinning around or being used as hand scythes. These weapons can also be used to block other weapons, leaving the foe open for Killer to kick the enemy's flank or other exposed areas. This, combined with the agility he has so far displayed in combat and the notion that he is not afraid to kill, makes him a formidable foe."}, {"type": "paragraph", "text": "As Kamazo, Killer used two regular scythes but lost them after he was defeated by Zoro."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Killer knew Eustass Kid since they were children. One day, they ate curry udon with their first love, Shiruton Doruyanaika. They laughed when she spilled curry broth all over herself while eating it, causing her to beat them up. This caused curry udon to become their least favorite food."}, {"type": "paragraph", "text": "According to Kid, Killer hated his own laugh so much that he beat up anyone who made fun of it. He eventually stopped laughing at all and started to wear a mask to hide his face."}], "images": []}, {"title": "Marineford War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "After a long voyage following one of the Log Pose routes of the Grand Line, Kid and his crew came to the Sabaody Archipelago to prepare themselves for the New World. Killer fight with Urouge was broken up by X Drake."}, {"type": "paragraph", "text": "He later rejoined with his captain at the Human Auctioning House, to observe the auction taking place. After interruptions caused by Monkey D. Luffy, Killer found himself fighting to escape alongside Trafalgar Law's and Luffy's crews, in the face of a daunting Marine attack. During the battle, Luffy remarked how he will be the one to find the great treasure One Piece, Kid responded to this statement by ceasing current fighting, and facing Luffy. After a brief recollection between the captains, on how their journey was met with laughter and dismissal at their crews' dreams, on their route along the Grand Line, the crew escaped together."}, {"type": "paragraph", "text": "The crew managed to defeat the Marines and headed back to their ship to escape the island. Destroying a bridge to halt enemy progress, their crew was amazed at the tenacity shown by the Marines, as they continued the chase despite the bridge being destroyed. Their attention is drawn at that moment, however, to the presence of a Pacifista, whom they assume to be the Shichibukai Bartholomew Kuma."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Kid Pirates managed to escape capture by the Pacifista and later returned to Sabaody Archipelago. They watched the live broadcast of the execution of Portgas D. Ace up until it was cut off by the Marines."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Kid Pirates then approached Marineford and watched the war unfold from a safe distance on board of their ship."}, {"type": "paragraph", "text": "Several weeks after the war, Killer and the rest of the Kid Pirates were on a rainy island in the New World. When Kid read the newspaper about Luffy ringing the Ox Bell and asked about it, Killer explained the significance to his captain."}, {"type": "paragraph", "text": "They had taken another pirate crew captive. After the crew begged Kid to let them go back to \"Paradise\" (the first half of the Grand Line), Kid tied them to branches in the shapes of different crosses and crucified them using his Devil Fruit powers, saying that people with that little amount of resolve have no business in the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6c/Eustass_Kid_in_the_New_World.png/revision/latest/scale-to-width-down/210?cb=20141206070009", "caption": "Kid pirates defeat Haritsu Kendiyo."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Sometime during the two-year timeskip, Killer and his crew wandered into Big Mom's territory but were forced to flee."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "A few days after sinking two Big Mom Pirates' ships, Killer and Kid watched Caesar Clown's broadcast of his new weapon of mass destruction via a video Den Den Mushi, and Killer commented on how his captain was not suited to be a broker. Leading Kid away to one of the main rooms, he warned the other to be civil before entering the room. Discovering the place a mess due to Scratchmen Apoo looking for an alleged sniper, Kid quickly started a fight with Apoo, while Basil Hawkins decided to leave. Calming the others down, Killer then revealed their intention to create an alliance with the On Air and Hawkins pirates."}, {"type": "paragraph", "text": "Later on, he continued watching Caesar's video broadcast, where Luffy defeated Caesar."}, {"type": "paragraph", "text": "The next morning, the newspaper printed a story which announced the alliance between the three crews. The group was confused on how the information got out but put the issue aside, as they were planning to take down a Yonko."}], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kid, Hawkins, and Apoo were dining together when they heard the news of Doflamingo's defeat. They figured that Luffy and Law were after Kaido. Killer revealed that the target of the Kid's alliance is Shanks."}, {"type": "paragraph", "text": "A mysterious figure then landed on the Kid Pirates' base, and when it got up, Killer wondered in shock what kind of monster it was before the figure revealed himself to be Kaido. At that time, Killer, Kid, and Hawkins discovered that Apoo was already working for Kaido with the intention of setting them up to join Kaido as his subordinates. While Hawkins joined Kaido, Killer and Kid refused to submit to the Yonko and tried to fight him only to be defeated. Afterwards, the Kid Pirates were separated."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Kid_Alliance_facing_Kaido.png/revision/latest/scale-to-width-down/210?cb=20160501075538", "caption": "The allied pirates find themselves facing Kaido."}]}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo along with the rest of the Kid Pirates."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "At some point after the encounter with Kaido, Killer was forced to eat a failed SMILE and later became known as the assassin \"Kamazo\". According to a Wano newspaper, he was responsible for a street murder on the eighth street in District 2 of the Flower Capital."}, {"type": "paragraph", "text": "After the chaos at the palace, Kamazo was hired by Kurozumi Orochi to kill the kamuro Toko. He then pursued Toko and Kozuki Hiyori to the Ringo region, where he came across a confrontation between Roronoa Zoro and Gyukimaru. Zoro then clashed with Killer in order to protect Toko and Hiyori. When Zoro was distracted by Gyukimaru, Killer manages to land a grievous hit on him. However, Zoro was able to take one of his scythes as a result and strike him. After that blow, Killer fell to the ground defeated."}, {"type": "paragraph", "text": "Later on, for failing to kill Toko, he was sent to the Prisoner Mine at Udon alongside Kid, who previously escaped and got recaptured. Kid questioned him on what Kaido had done to him and the fate of their crew, but Kamazo could not answer through his laughter and tears. Queen then subjugate them both to water torture and threatened to keep them submerged until Luffy and Hyogoro die. When Big Mom was swinging Queen around, Killer and Kid were saved from drowning when Queen crashed into the contraption holding them and knocked them out of the water."}, {"type": "paragraph", "text": "As Luffy and his allies from the Ninja-Pirate-Mink-Samurai Alliance were fighting against the Beasts Pirates, Raizo tossed some keys to Killer and Kid."}, {"type": "paragraph", "text": "After the prison takeover and Kid rejected Luffy's offer for an alliance, Killer left the Prisoner Mines with Kid."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Zoro_Strikes_Kamazo.png/revision/latest/scale-to-width-down/200?cb=20190326081219", "caption": "Zoro defeats Kamazo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2c/Kid_and_Kamazo_Undergo_Water_Torture.png/revision/latest/scale-to-width-down/200?cb=20190603133651", "caption": "Killer and Kid undergo water torture."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Killer vs. Urouge (interrupted by X Drake)", "elements": []}, {"text": "Kid Pirates, Heart Pirates and Straw Hat Pirates vs. Marines", "elements": []}, {"text": "Kid Pirates and Heart Pirates vs. Pacifista", "elements": []}, {"text": "Kid Pirates vs. Haritsu Kendiyo and crew", "elements": []}, {"text": "Kid Pirates vs. Big Mom Pirates' allies (unseen)", "elements": []}, {"text": "Kid Pirates vs. Big Mom Pirates (unseen)", "elements": []}, {"text": "Killer (as Kamazo) vs. Roronoa Zoro", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Killer's helmet has been noted to bear resemblance to the French musician Guy-Manuel de Homem-Christo's helmet from Daft Punk. Daft Punk was made famous in Japan by their animated film Interstella 5555: The 5tory of the 5ecret 5tar 5ystem, during which time the duo were wearing outfits designed to make them look like robots.", "elements": []}, {"text": "Killer and Zoro share a number of similarities, including their inclination towards killing/violence, status as the only non-captain Supernovas, lack of an apparent position in their crew, and a fighting style that includes blades. Also, both are the only members of the Worst Generation without powers of a Devil Fruit (although Killer has the weaknesses of a user by having eaten a defective SMILE).", "elements": []}, {"text": "In the 5th fan poll, Killer ranked 61st.", "elements": []}, {"text": "Killer's blood type is X.", "elements": []}, {"text": "Kama (鎌, Kama) can mean \"scythe\" or \"sickle\" in Japanese.", "elements": []}, {"text": "The water torture that Killer and Kid were subjected to is a version of the old Japanese torture and execution method known as tsurushi or \"reverse hanging\".", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Killer_and_Daft_Punk.png/revision/latest/scale-to-width-down/180?cb=20080727081508", "caption": "Guy-Manuel de Homem-Christo, as seen in Interstella 5555: The 5tory of the 5ecret 5tar 5ystem."}]}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Killer's birthday, February 2nd, comes from his epithet \"Massacre Soldier\" (殺戮武人, Satsuriku Bujin) since 2-2 can be derived from bu-ji.", "elements": []}, {"text": "Oda said he picked the name \"Killer\" out of sheer laziness, thus the name holds little to no meaning. It means that he is the only Supernova introduced in the Sabaody Archipelago Arc whose name is not linked to a real life pirate or privateer and the only one of the group with no other meaning at all.", "elements": []}]}, {"type": "list", "elements": [{"text": "Killer eats with his mask on, and prefers food he can consume through the holes of his mask (stick-shaped or foods such as ramen). His meals have pasta as main every day and his favorite is Aglio e Olio. He also drinks alcohol through a straw. His stated preference for remaining masked while eating ascended from trivia to a known fact when he did just that in Chapter 793.", "elements": []}, {"text": "Killer's favorite food is peperoncino, and his least favorite is curry udon.", "elements": []}, {"text": "If One Piece was set in the real world, then Killer would be from Scotland.", "elements": [{"text": "He notably shares his dislike of curry udon and real-world nationality with his captain.", "elements": []}]}, {"text": "If Killer was not a pirate, then he would be a pasta shop owner.", "elements": []}, {"text": "Killer's hobbies are playing drums and cooking.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6b/Killer_Eating.png/revision/latest/scale-to-width-down/125?cb=20190601042658", "caption": "Killer eating through the holes in his mask."}]}]}