{"sections": [{"title": "Kuni", "level": 1, "content": [{"type": "paragraph", "text": "Kuni is a gangster who is a member of the Kyoshiro Family in Wano Country."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kuni is a man of slightly above average height. His face is extremely long and thin, and he has light, shoulder-length wavy hair that is gathered into a topknot. He wears a checker-patterned kimono underneath a light coat with a character written on both its shoulders."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like Kaku and Suke, Kuni is quite greedy and wishes to extort local businesses for money to support his crime family, claiming that they control operations in Wano, and will get violent if met with resistance."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As he, Kaku, and Suke were preparing to get violent against Sanji, it can be assumed that Kuni has some degree of fighting skill. However, he was swiftly beaten by Sanji kicking his head into the ground."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Kuni carries a katana on his hip, but has not been seen using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Sanji opened up a soba stand in the Flower Capital, Kuni, Kaku, and Suke went up to him and demanded that he pay them a fee to keep his stand safe. When Sanji refused, Kuni decided to become violent as he kicked Sanji's soba pot onto the ground, ruining its contents. Sanji told Kuni he would have to eat all the soba on the ground, and Kuni responded by having Kaku and Suke attack, but Sanji immediately kicked his head into the ground. The cook then forced the soba noodles into the defeated Kuni's mouth."}, {"type": "paragraph", "text": "After Shimotsuki Yasuie's execution at Rasetsu Town, Kuni witnessed Kyoshiro's clash with Zoro."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kuni vs. Sanji", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 92 Chapter 927 (p. 3-4, 6, 8), Suke makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 945 (p. 2).", "elements": []}]}], "images": []}]}