{"sections": [{"title": "Kozuki Hiyori", "level": 1, "content": [{"type": "paragraph", "text": "Kozuki Hiyori is the daughter of Kozuki Oden and Kozuki Toki. She is originally Kozuki Momonosuke's younger sister, but when he was sent into the future, she has become older than him."}, {"type": "paragraph", "text": "To the people of Wano, Hiyori became known as Komurasaki, working as an oiran of the dayu (太夫, dayū) rank, the highest of all. However, she lost this status after angering the current shogun Kurozumi Orochi and being presumed to have been murdered by Kyoshiro."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hiyori is a slim woman of average height. She has long teal hair that reaches her waist and blue eyes that are distinctively slanted at an upward angle. She wears light pink lipstick on her prominent lips. Hiyori holds a strong resemblance to her mother."}, {"type": "paragraph", "text": "As Komurasaki, she wore geta to make her look very tall. Her hair was extremely adorned, with multiple flowers and pins attached to it. She wore an extremely opulent red furisode kimono that sparkles in the sunlight, with the sleeve adorned with a peacock and flowers on it. Her appearance was considered by many to be amazingly beautiful to the point where men are blinded or pass out by trying to gaze at her."}, {"type": "paragraph", "text": "After leaving the Flower Capital, Hiyori left most of her hair down with her bangs covering her forehead while some of her hair is held up by pins in an elaborate bun behind her head. She took out most of its adornments except for one on each side of her head shaped like a pink rose with a gold dangler. She also stopped wearing her outer garment, wearing a pink furisode kimono with purple flower designs along the sleeves and the bottom."}, {"type": "paragraph", "text": "A flashback of twenty years ago only showed her in silhouette. She had a bob cut when she was six."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hiyori is a very proud woman, unwilling to back down or show vulnerability in front of others. She claims that this is due to being a daughter of a samurai. This is true even in the face of authority, being unafraid of standing up to and even attacking the shogun Kurozumi Orochi despite the heavy consequences. She sees nothing appealing about becoming his wife, and would rather be killed than live a submissive life. Because of her pride, she refuses to cry at the thought of reuniting with her brother, stating that as the daughter of a samurai, she must not cry. Despite this, she cried uncontrollably when Yasuie was killed, and also when she reunited with her guardian Kawamatsu."}, {"type": "paragraph", "text": "However, Hiyori was infamous for actions she has apparently committed in private as Komurasaki. She appeared to be a greedy and materialistic woman, as well as a good manipulator. After successfully swindling her victims, she treated them very coldly without any compassion or remorse, saying that she despises the poor. However, it was later revealed that the men she swindled were guilty of highly immoral acts, indicating that she is more noble than she seems."}, {"type": "paragraph", "text": "In reality, Hiyori is an extremely kind and compassionate woman. She is kind to those she is close to, such as her kamuro Toko, and she was appalled when Orochi attempted to attack her, given that she is a child. She is deeply sympathetic towards the many citizens of Wano who had been cruelly oppressed by Orochi and Kaido. She broke down crying uncontrollably after Yasuie was executed. Despite her kindness, Hiyori has the desire to kill Orochi as she is not afraid to get her hands dirty."}, {"type": "paragraph", "text": "While being chased by Kamazo, Hiyori let go of her prideful attitude, pleading for Zoro to help her and Toko. She is very gracious, as she was extremely grateful to Zoro for saving her and made good on her offer to feed him in return. She can be rather careless and timid."}, {"type": "paragraph", "text": "She can be a tease, asking Zoro if he was happy to be sleeping with her."}, {"type": "paragraph", "text": "Hiyori has a deep love for her country, as she is willing to give up her father's heirloom Enma to Zoro in exchange for Wano's national treasure Shusui in order to return it to the country. Before Kawamatsu and Zoro left to rejoin their comrades to overthrow Kaido and Orochi, Hiyori sincerely bowed to the two, requesting them to do their best in saving Wano from their tyranny."}, {"type": "paragraph", "text": "According to Kin'emon, she was a tomboy when she was a child and was quite insolent and brash, a trait she inherited from her father when he was young. Momonosuke stated that Hiyori liked to act tough, but she was quite a crybaby."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Hiyori_Restrains_Herself.png/revision/latest?cb=20190415175027", "caption": "Hiyori refuses to cry for joy at the thought of reuniting with her brother."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f0/Hiyori_Breaks_Down_Crying.png/revision/latest/scale-to-width-down/100?cb=20190523001409", "caption": "Hiyori cries over Yasuie's death."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Parents", "level": 4, "content": [{"type": "paragraph", "text": "Hiyori loved her parents dearly. She became so traumatized by their deaths that she never spoke again for a long period of time. Hiyori is deeply respectful towards her father Kozuki Oden as a samurai. Hiyori believed that as his daughter, she must not shame her father so she refused to live a submissive life. Even when threatened with death, Hiyori strongly refused to bow to Orochi, her father's archenemy and murderer. Oden also reciporated Hiyori's love and respect and upon his death bequeathed to Hiyori one of his swords Enma. According to Hitetsu, part of the reason Hiyori is willing to give Enma to Zoro is due to seeing Oden's image in Zoro's abilities as a swordsman."}], "images": []}, {"title": "Momonosuke", "level": 4, "content": [{"type": "paragraph", "text": "As siblings, Hiyori cares deeply for her elder brother, Momonosuke as she was searching for him for 20 years. Hiyori was very excited to hear from Zoro that Momonosuke is still alive and learns that he kept the promise she doubted years ago. Hiyori even excitedly questioned how he was doing but decided to wait until after Orochi was defeated to reunite. As a child, she often performed drop kick on Momonosuke as a prank."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f4/Momonosuke_and_Hiyori_Childhood.png/revision/latest/scale-to-width-down/180?cb=20190912065223", "caption": "Momonosuke and Hiyori playing."}]}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Toko", "level": 4, "content": [{"type": "paragraph", "text": "While Hiyori was the oiran Komurasaki, Toko served as her kamuro. Hiyori is very affectionate with her, as she was worried when the latter went off to try Sanji's famous soba without informing her. She tried to defend Toko from Orochi when the shogun tried to kill her for laughing at him. This led to Komurasaki getting \"killed\" by Kyoshiro. Hiyori tried to protect Toko again when Orochi sent an assassin after her and fled the Flower Capital with her. Toko is also the only person who knows the truth about Hiyori and her lineage. Her cheerful and bright personality helped Hiyori to push forward. When Toko received news of her father's impending execution, Hiyori immediately ran after the frantic girl out of concern for her safety."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/32/Hiyori_and_Toko.png/revision/latest/scale-to-width-down/180?cb=20190420135843", "caption": "Toko is Hiyori's closest friend and confidant."}]}, {"title": "Kawamatsu", "level": 4, "content": [{"type": "paragraph", "text": "One of her father's retainers, Kawamatsu became Hiyori's guardian after the death of her parents. Kawamatsu did everything he could to raise Hiyori and make her happy after she was deeply traumatized, including dancing and telling jokes to cheer her up. Hiyori has immense respect and gratitude towards Kawamatsu for his care and wished to reunite with him again. When reuniting with him after many years, they were extremely overjoyed to see each other again, with Hiyori crying tears of joy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a5/Kawamatsu%27s_Kappa_Dance.png/revision/latest?cb=20190421012512", "caption": "Kawamatsu, Hiyori's savior and protector."}]}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Zoro is her second savior and protector after Kawamatsu. When he rescued her from Kamazo, Hiyori was deeply awed by his strength. She healed his injuries and thanked him, speaking to him in a grateful manner. After learning her name, Zoro reveals to her that her brother is alive, indicating that he believes her. Hiyori has also shown to trust Zoro very much, revealing her own identity to him, sleeping on top of him during a cold night, and remaining with him after being chased by the Oniwabanshu. After learning that he had Shusui, Hiyori respectfully asked him to return it to its resting place, and offered her father's sword, Enma, a legendary blade that wounded Kaido, as a replacement. She did not question him on how Shusui came to his possession, nor did she accuse him of its thievery, while offering Enma as replacement despite Kawamatsu's protest, furthering her trust in Zoro."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Kurozumi Orochi", "level": 4, "content": [{"type": "paragraph", "text": "While Hiyori was under the guise as Komurasaki, Orochi was deeply infatuated with her, harboring a strong desire to marry her. However, during his banquet, Orochi tried to kill Toko over a trivial matter, causing her to slap him. When she refused to apologize for her actions, Orochi attacked her but later mourned her \"death\" when Kyoshiro struck her down."}, {"type": "paragraph", "text": "Hiyori has immense hatred and disgust for Orochi, not only for being one of the two masterminds behind her parents' unjust death, but also for Orochi's twisted cruelty towards the countless citizens of Wano, tyrannically oppressing the poor by forcing them to live in wastelands, being enslaved by the Beast Pirates, and to survive only on leftover food, even went as far as to feed them defective SMILE fruits to prevent them from expressing their sadness and despair from suffering and dying from hunger and sickness as she tearfully confided in Zoro that his most heinous crime is putting the poor into so much misery and taking away their ability to express sorrow. Also, she expressed her desire to kill Orochi with her own hands."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Komurasaki_Slaps_Orochi.png/revision/latest/scale-to-width-down/180?cb=20190730010111", "caption": "Hiyori slapping Orochi for trying to kill Toko."}]}, {"title": "Bingo, Bongo, and Bungo", "level": 4, "content": [{"type": "paragraph", "text": "Three men who were all in love with Hiyori, under the guise as Komurasaki. When they met her individually, she would use their affections for her and make them give up all their money and personal belongings to gain her freedom. Knowing the three were responsible for an arson ring and ruining the lives of several innocent people, Hiyori targeted them to get justice for those they harmed. Once she got all their money from them, she left them poor and unable to fend for themselves. The three of them later tried to kill her for revenge only to be thwarted. Because of her actions, the three are forced to live in Ebisu Town barely able to make a living."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Flower Capital Citizens", "level": 4, "content": [{"type": "paragraph", "text": "Due to her great beauty, refined charisma, and mannerism as the highest ranking courtesan of Wano, Komurasaki was immensely popular among the citizens who live in the Flower Capital. She has been described by a fellow courtesan as the dream of all men and perfection of all women in Wano. While proceeding to Orochi's palace, many men and women gathered to see and cheer for Komurasaki while captivated by her beauty. They respectfully referred to her as \"Komurasaki-sama\". After she was presumably killed by Kyoshiro, all the citizens were extremely sorrowful and mourned her death."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Komurasaki%27s_Funeral.png/revision/latest/scale-to-width-down/180?cb=20190428100737", "caption": "The Flower Capital citizens fanatically sorrowful during Komurasaki's funeral."}]}, {"title": "Kyoshiro", "level": 4, "content": [{"type": "paragraph", "text": "The two of them were heavily associated as Kyoshiro was the one who raised her into the oiran she was as Komurasaki. When she defied Orochi and refused to apologize, Kyoshiro struck her down, which she acknowledged as the consequence of her choice and accepted without resistance. By his own admittance, he was granting her a samurai's mercy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Hiyori seems to have great balance and leg strength to walk with extremely tall geta sandals without any strain. She also owned a fair amount of arm strength, as she slapped the extremely large Orochi with enough force to leave a mark. As a child, she is already strong and agile enough to perform drop kicks on her brother."}], "images": []}, {"title": "Beauty", "level": 3, "content": [{"type": "paragraph", "text": "Hiyori is considered the most beautiful woman in all of Wano. Her beauty is so unfathomably great, that people can barely look directly at her. Her looks alone are enough to make people faint, go blind, and suffer severe blood loss via nose bleeds."}], "images": []}, {"title": "Deception and Trickery", "level": 3, "content": [{"type": "paragraph", "text": "Hiyori has shown to be an extremely crafty manipulator, using her beauty in conjunction with superior acting skills to deceive some corrupt men into giving her all their wealth."}], "images": []}, {"title": "Musical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Having trained as a geisha, Hiyori is also an extremely talented musician in playing the shamisen, as she could play an enchanting song that deeply captivated the Orochi, his guests, and her fellow courtesans."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Hiyori_Playing_a_Shamisen.png/revision/latest/scale-to-width-down/210?cb=20190522142015", "caption": "Hiyori has extraordinary skills with the shamisen."}]}, {"title": "Medical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Hiyori possesses some degree of medical skill, as she was able to treat Zoro's large shoulder wound."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Hiyori was born 26 years ago to Oden and Toki while they were on Whitebeard’s ship. 20 years before the present day, Hiyori's father Oden was brought to the Flower Capital and executed by the shogun Kurozumi Orochi after illegally leaving Wano Country and refusing to divulge information of Laugh Tale. Before his execution, Oden designated one of his swords Enma to Hiyori. Hiyori was in Oden Castle with her mother Toki and brother Momonosuke when Kaido, who was working with Orochi, set it ablaze. Toki used her Devil Fruit powers to send Momonosuke and four of their retainers 20 years forward in time, leaving Hiyori remaining with her.Kawamatsu then helped Hiyori escape Oden Castle and took care of her until they were separated when Hiyori was 13. Hiyori stated she ran away from Kawamatsu because he was starving himself and hoping he would be able to survive on his own."}, {"type": "paragraph", "text": "Hiyori was then raised by Kyoshiro who sponsored her to become a geisha and eventually Hiyori rose through ranks to become an oiran, she adopted the name Komurasaki. During her career, Hiyori courted Bingo, Bongo, and Bungo, claiming to want her freedom purchased before the shogun Orochi took her and agreeing to go with each man if they managed to do this. The men gave up everything they had to raise the money, which they put in her possession. However, she had deceived them and left them with nothing, putting an end to their criminal activities in the process."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Kawamatsu_Takes_Care_of_Hiyori.png/revision/latest/scale-to-width-down/180?cb=20190420140011", "caption": "Kawamatsu takes care of Hiyori."}]}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Komurasaki was chosen by Orochi to perform her services at his banquet. She made her way through the streets of the Flower Capital as the citizens gazed at her in awe, and she was joined by her kamuro Toko who had come late to the procession. She was then confronted by Bingo, Bongo, and Bungo, who tried to kill her to avenge their destitution, but her guard defeated them. As the three men cried in anguish, she mocked and degraded them as she walked away from them. She later made it to Orochi's palace. At the banquet hall, she sat next to Orochi."}, {"type": "paragraph", "text": "During the banquet, Komurasaki played some music before returning to Orochi's side. Orochi then talked about the impending return of Kozuki Oden's Nine Red Scabbards and son Momonosuke, and she was shocked when Toko laughed at him. She pleaded with Orochi not to attack her kamuro, but he did not listen, forcing her to slap him. She refused to prostrate herself in apology, and Orochi angrily transformed into the Yamata no Orochi. After she once again refused to apologize, Orochi attacked her and wrested her into one of his mouths. However, she was dislodged from Orochi's grip when the ceiling crashed onto the shogun's head. She then faced Kyoshiro, and accepted his mercy as he struck her down with his sword."}, {"type": "paragraph", "text": "\"Komurasaki\" was considered dead by everyone, but Hiyori somehow managed to survive. She reunited with Toko and they fled the Flower Capital as Toko was pursued by Orochi's assassin Kamazo. They were chased to Ringo, and as they came to Oihagi Bridge, Hiyori pleaded for the swordsman Roronoa Zoro and the samurai Gyukimaru to help. She agreed to Zoro's request for food and alcohol in return, and watched as he battled Kamazo. She was shocked when Kamazo pierced Zoro through the shoulder, but Zoro then managed to strike down the assassin."}, {"type": "paragraph", "text": "Zoro then fell unconscious from his wound, and Hiyori took him to a house in the Northern Cemetery to treat it. When Zoro woke up, he attempted to leave immediately, and Hiyori held him back, accidentally aggravating his wound. Hiyori then gave Zoro his food and alcohol, and told him about Gyukimaru as well as what had happened to her and Toko. She then revealed her own identity and that she was looking for her brother Momonosuke."}, {"type": "paragraph", "text": "After Zoro was shocked to learn that she is Momonosuke's younger sister, Hiyori expressed joy in learning that her brother is alive. After receiving confirmation that Zoro was an ally, Hiyori told him of her past including how Kawamatsu rescued her from the destruction of Oden Castle and raised her until she was 13 and how Toko is an important friend to her. Hiyori and Zoro proceeded to talk about the current status of the alliance including the whereabouts of each of the Nine Red Scabbards. After their conversation, Hiyori wondered if she should meet her brother."}, {"type": "paragraph", "text": "Hiyori and Toko then slept with Zoro and later woke up to meet Brook. After getting acquainted with each other, Brook told the group about Komurasaki's funeral as well as the capture of Tonoyasu and his impending execution. Toko rushed off to save him, causing Hiyori, Zoro, and Brook to run after her."}, {"type": "paragraph", "text": "The group later arrived at the prison in the Rasetsu Town just in time to witness the execution. When the people from Ebisu Town were crying and smiling, Hiyori explained to Zoro that they were actually devastated but could only smile because of the SMILE fruits. She explained more about the work of Orochi in robbing the people of Ebisu Town of their emotions before noticing Toko beside her father's body. Hiyori desperately cried out to Toko, telling her to come back, but Orochi spotted her. She then told Toko to run, but Orochi started shooting at her. Fortunately, Zoro and Sanji shielded the girl."}, {"type": "paragraph", "text": "Hiyori then wondered if Sanji was Zoro's comrade. During the ensuing chaos, Hiyori witnessed Zoro clashing with Kyoshiro. After she saw Usopp fleeing with Toko, Brook told Hiyori to escape as well. However, as she was fleeing, she was pursued by Fujin and Raijin since she was seen with Zoro. Just when they were about to capture her, Zoro came and rescued her."}, {"type": "paragraph", "text": "Hiyori and Zoro fled to a forest outside the capital, but they were still pursued by members of the Orochi Oniwabanshu. Hiyori hid in the Enma Shrine as Zoro defeated their pursuers. After Zoro explained his intention to avenge Yasuie, Hiyori expressed her desire to kill Orochi herself."}, {"type": "paragraph", "text": "Hiyori then returned to Oihagi Bridge with Zoro and watched him fight Gyukimaru again. She was surprised when she heard Shusui being mentioned. Kawamatsu interrupted the fight and Hiyori reunited with him. However, the reunion was interrupted when some Beasts Pirates arrived seeking revenge on Gyukimaru for stealing their weapons."}, {"type": "paragraph", "text": "After the Beasts Pirates were defeated, Hiyori got reacquainted with Kawamatsu, who told her of his ordeals after they separated. He told her of the story of Shimotsuki Ushimaru and his fox companion Onimaru, who Kawamatsu was paired with defending Ringo until he was captured. They caught up with Zoro at a passageway leading to an underground chamber where Kawamatsu kept a stash of weapons. Hiyori then talked with Zoro, respectfully asking him to return Shusui in exchange for Enma, a sword that was once wielded by her father. Ignoring Kawamatsu's objections towards giving away Enma, Hiyori proceeded to explain more about the two swords that were in Oden's possession. She once again implored Zoro to return Shusui, and Zoro agreed with her condition."}, {"type": "paragraph", "text": "Hiyori later told Kawamatsu and Zoro that she would not be meeting their allies yet as she did not want to distract them from their preparations for war."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/57/Kyoshiro_Attacks_Komurasaki.png/revision/latest/scale-to-width-down/200?cb=20190218163411", "caption": "Kyoshiro strikes down \"Komurasaki\"."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b6/Hiyori_Confides_in_Zoro.png/revision/latest/scale-to-width-down/150?cb=20190523012749", "caption": "Hiyori tearfully confides in Zoro for comfort after Yasuie's death."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The name Hiyori means \"weather\".", "elements": []}, {"text": "The name Komurasaki translates to \"small purple\" and is the Japanese name for the purple beautyberry.", "elements": [{"text": "It may also be derived from Miura-ya Komurasaki, a real life Oiran from the Edo period with a tragic love story that is immortalized in Kitagawa Utamaro's painting The Lovers Miura-ya Komurasaki and Shirai Gonpachi. In that story, Shirai Gonpachi also committed crimes to buy her freedom. But the Komurasaki of the story truly loved him and committed suicide when his actions resulted in his death.", "elements": []}]}, {"text": "An oiran is a high-ranking courtesan in Japan, whose occupation arose in the Edo period and was largely replaced by geisha by the late 19th century.", "elements": []}, {"text": "Hiyori has appeared at the beginning and closing of the Wano Country Arc acts, playing the shamisen.", "elements": []}]}], "images": []}]}