{"sections": [{"title": "Toko", "level": 1, "content": [{"type": "paragraph", "text": "Toko is a little girl who lived in the Flower Capital of Wano Country and worked as a kamuro for the courtesan Komurasaki until she angered the shogun Kurozumi Orochi. She is the daughter of Shimotsuki Yasuie who was also known as Tonoyasu and a member of the Shimotsuki clan."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Toko is a little girl with a large head and black eyes. She has relatively short pink hair that slopes down into points at the sides. She wears a red kimono with a dotted blue belt around the waist."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b8/Toko%27s_Manga_Color_Scheme.png/revision/latest/scale-to-width-down/150?cb=20190508130112", "caption": "Toko's color scheme in the manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Toko constantly laughs, even when she cries in sadness, and likes to make jokes when she is happy, especially about her name. She is a very friendly little girl who is grateful, as shown when she thanked Sanji for feeding her soba noodles. She usually takes her job seriously, but was willing to be late to her courtesan's procession to try the soba."}, {"type": "paragraph", "text": "She has no self-control as she could not keep herself from laughing uncontrollably at Orochi during his banquet despite the consequences. She also continued to laugh nonstop even when Orochi held her at sword point, threatening to kill her."}, {"type": "paragraph", "text": "She is naive and she can be easily driven by her emotions. The moment she heard about her father's execution, she quickly ran off without waiting for Hiyori and Zoro, not thinking about the risks of going back to the Flower Capital. After her father was executed, she believed that Usopp's toad oil could revive him. As she tried to revive him, she completely ignored Hiyori's cries and the danger that was approaching her."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Shimotsuki Yasuie", "level": 4, "content": [{"type": "paragraph", "text": "Toko is very close with her father, even though he sold her off. She would send most of her earnings to Tonoyasu to help support the citizens of Ebisu Town. When news about his capture and planned execution reach her, she ran to the Flower Capital, despite being targeted by the shogun. Toko cried hysterically after her father was shot to death and she even tried to use Usopp's toad oil to revive him."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Kozuki Hiyori", "level": 4, "content": [{"type": "paragraph", "text": "While Hiyori was the oiran Komurasaki, Toko served as her kamuro. Hiyori is very affectionate with her, as she was worried when the latter went off to try Sanji's famous soba without informing her. She tried to defend Toko from Orochi when the shogun tried to kill her for laughing at him, which led to Komurasaki getting \"killed\" by Kyoshiro. Hiyori tried to protect Toko again when Orochi sent an assassin after her and fled the Flower Capital with her. Toko also knew the truth about Hiyori and her lineage as she said this is their secret. Her cheerful and bright personality helped Hiyori to push forward. When Toko received news of her father's impending execution, Hiyori immediately ran after the frantic girl out of concern for her safety."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/32/Hiyori_and_Toko.png/revision/latest/scale-to-width-down/180?cb=20190420135843", "caption": "Hiyori is Toko's closest friend and protector."}]}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Due to Zoro having saved her and Hiyori's lives from Kamazo, Toko is very grateful to Zoro for his actions and helped treat his wounds after his fight. She was also shocked to see him not laugh at her jokes. Despite this, Zoro also cares for Toko, as after she ran off trying to save her father, Zoro went after her along with Hiyori to save her. Zoro even defied Orochi directly by protecting Toko from his fired bullets with Sanji's aid."}], "images": []}, {"title": "Nico Robin", "level": 4, "content": [{"type": "paragraph", "text": "The two first met at Sanji's soba noodle stand and Robin immediately took a liking to the young kamuro, even laughing at her joke. The next time they crossed paths was during Orochi's banquet. When Toko becomes targeted by the Shogun after laughing at him, Robin dropped her mission to protect her. Later on in Rasetsu Town, Robin was greatly alarmed when she saw the girl appearing at the execution site and putting herself in harm's way. Following the escape to Amigasa Village, Robin is mostly seen at her side, holding her as she sleeps and also being with her when she visited her father's grave."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Kurozumi Orochi", "level": 4, "content": [{"type": "paragraph", "text": "During the shogun's banquet, Toko incurred his wrath by laughing at him and he mercilessly tried to kill her despite Komurasaki's pleas over her being a child. After Kyoshiro \"killed\" Komurasaki for her defiance, Orochi blamed Toko for the incident and continued trying to kill her. After Toko was able to escape, Orochi refused to let her live and hired Kamazo to hunt and kill her. When he saw Toko again at Rasetsu Town, he still blamed her for Komurasaki's supposed death and wasted no time trying to kill her."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, her father sold her to the Flower Capital. She became a kamuro for the courtesan Komurasaki and she sent the money she earned to her father back at Ebisu Town."}, {"type": "paragraph", "text": "At some point in time, Toko had her emotional expressions stripped away by eating a defective SMILE fruit, and could only smile."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Toko went to a soba stand in the Flower Capital operated by Sanji, but after receiving her soba, the bowl was knocked out of her hands by some thugs from the Kyoshiro Family who were attempting to intimidate Sanji. Toko ran into a nearby alley and came out after Sanji and Franky had beaten the thugs, and to her delight, Sanji gave her another bowl of soba. After finishing the soba, Toko ran off to join Komurasaki in her procession through the Flower Capital."}, {"type": "paragraph", "text": "Toko and Komurasaki went to Orochi Castle to partake in the shogun Orochi's banquet. When Orochi started talking about the return of Kozuki Oden's Nine Red Scabbards, Toko overheard the other guests making fun of him and was unable to stop herself from laughing. Orochi then attacked her with his sword, and when Komurasaki stepped in to defend her, Toko was carried away by the geisha Nico Robin, whom she had met at the soba stand."}, {"type": "paragraph", "text": "As Orochi was going berserk in the banquet hall, Toko begged Robin to help Komurasaki, but Robin was more preoccupied with protecting Toko. Upon seeing Brook's spirit form, Toko screamed in terror and fainted. After Kyoshiro struck down Komurasaki, Orochi pursued Toko and Robin until Nami unleashed Zeus's lightning on him."}, {"type": "paragraph", "text": "After escaping the palace, Robin and her group dropped Toko off in the red light district. After Orochi hired Kamazo to kill Toko, the girl and Hiyori fled and were later chased to the Ringo region. As they were fleeing from the assassin, they came across a confrontation between Zoro and Gyukimaru at Oihagi Bridge. Zoro then clashed with Kamazo to protect Toko and the woman."}, {"type": "paragraph", "text": "After Zoro defeated Kamazo and fell unconscious from the wound he received from the assassin, Toko and Hiyori took him to a house in the Northern Cemetery, where Hiyori treated his injury. Toko then sat close to them as Hiyori revealed her relationship with Momonosuke and her past to Zoro. When Zoro decided to take a nap, Toko went to sleep along with him."}, {"type": "paragraph", "text": "Brook later came to the house and told them about Komurasaki's funeral as well as Tonoyasu's capture and impending execution. Hearing about her father's plight, Toko quickly rushed to the Flower Capital to save him, with Hiyori, Zoro, and Brook running after her. The group later arrived at the Rasetsu Town just in time to witness the execution. Seeing her father shot to death caused Toko great grief and sadness."}, {"type": "paragraph", "text": "Ignoring Hiyori's warnings, Toko went to her father and attempted to revive him with Usopp's toad oil. Orochi spotted Toko and tried to kill her as well, but Zoro and Sanji shielded the girl. Zoro then grabbed Toko while running from the execution site. In the ensuing chaos, Zoro handed Toko to Sanji. While under attack by Drake, Sanji handed the girl to Usopp, who quickly fled with her."}, {"type": "paragraph", "text": "After safely escaping the chaos at Rasetsu Town, Toko cried herself to sleep. She hid under Brook's robes as he, Usopp, and Robin snuck out of the Flower Capital. While riding on a boat, Robin held the sleeping Toko. Sometime after Yasuie was buried, Toko visited his grave."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3e/Toko_and_Yasuie%27s_Corpse.png/revision/latest/scale-to-width-down/180?cb=20190605192700", "caption": "Toko desperately tried to heal her father after his death."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In her debut, Toko made a joke about putting the O- prefix before her name as is common for females in Wano, saying she was not a boy. Otoko (男, Otoko) is the Japanese word for man or male.", "elements": []}, {"text": "A kamuro was a courtesan-in-training. They were apprenticed to an established courtesan to learn proper etiquette and to become versed in a variety of feminine arts that would serve them later on when they had to entertain customers. They also assisted the courtesan while she was on a job by running errands for her.", "elements": []}]}], "images": []}]}