{"sections": [{"title": "Suke", "level": 1, "content": [{"type": "paragraph", "text": "Suke is a gangster who is a member of the Kyoshiro Family in Wano Country."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Suke is a very large and hairy man. He has bushy light hair, long sideburns, and stubble on his lip and chin. He wears a dark kimono with flower patterns on it, and the kimono is open down to the waist, exposing his bare chest. He also wears sunglasses."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Suke is a greedy and cruel man, as he took part in an attempt to take over Sanji's soba stand and knocked a child's bowl of soba away while Sanji was giving his group trouble."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As he and Kuni were preparing to get violent against Sanji, it can be assumed that Suke has some degree of fighting skill. However, he was easily seized by Franky and quickly defeated after being suplexed into the ground."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Suke carries a katana on his hip, but has not been seen using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Sanji opened up a soba stand in the Flower Capital, Kaku, Kuni, and Suke went up to him and demanded that he pay them a fee to keep his stand safe. When Sanji refused, the trio started to attack, with Suke destroying the soba bowl of a nearby child. However, he was then grabbed by Franky, who leaped into the air with him before suplexing him into the ground, defeating him."}, {"type": "paragraph", "text": "After Shimotsuki Yasuie's execution at Rasetsu Town, Kaku and Suke witnessed Kyoshiro's clash with Zoro."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 92 Chapter 927 (p. 3-5, 7-8), Suke makes his debut.", "elements": []}, {"text": "↑  Concept Art - Suke's identity is confirmed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 945 (p. 2).", "elements": []}]}], "images": []}]}