{"sections": [{"title": "Ipponume", "level": 1, "content": [{"type": "paragraph", "text": "Ipponume is Ipponmatsu's wife."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ipponume is a tall, large woman with a pointed nose, low ears, long eyelashes, thin eyebrows, and shoulder-length, curly red hair. She wears a light-colored polo shirt, a light-colored skirt, a dark-colored sweater, and a dark-colored cap with stars on it."}, {"type": "paragraph", "text": "Before the timeskip, she wore a striped yellow polo shirt and a purple cap."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ipponume is a matter-of-fact woman with an honest personality. She did not want her husband to keep the Sandai Kitetsu and disliked the sword."}], "images": []}, {"title": "Relationship", "level": 2, "content": [], "images": []}, {"title": "Ipponmatsu", "level": 3, "content": [{"type": "paragraph", "text": "Ipponume has a good relationship with her husband. He calls her \"honey\" and \"dear\" and cleans the bathtub for her. However, Ipponume thinks that he is a \"cheapskate\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/Ipponmatsu_and_Ipponume.png/revision/latest/scale-to-width-down/180?cb=20191107153038", "caption": "Ipponume and her husband."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Zoro came to her husband's sword shop and Ipponmatsu refused to sell him the Sandai Kitetsu Ipponume smacked Ipponmatsu in the back of the head and demanded that he sell the cursed sword. After he gave Zoro the Yubashiri for free, Ipponume criticized him for giving away all the shop's valuable swords and ordered him to clean the bathroom."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Ipponume stood in the bathroom with her husband while he cleaned the bathroom and bragged about his poster of Zoro."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Ipponume was changed to Ipponmatsu's mother in the 4Kids dub."}, {"type": "paragraph", "text": "In the FUNimation Dub, Ipponume doesn't mention that Yubashiri was the family heirloom."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 97 (p. 15-18) and Episode 49, Ipponume makes her first appearance.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Ipponume's name and birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 64 Chapter 630, cover story: From the Decks of the World Vol. 15, Ipponume watches Ipponmatsu clean the bathroom.", "elements": []}]}], "images": []}]}