{"sections": [{"title": "Chiryaku Ten'nen Maru", "level": 1, "content": [{"type": "paragraph", "text": "Chiryaku Ten'nen Maru is the ship that was used by Mr. 3 and Miss Goldenweek when they were Baroque Works members."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chiryaku Ten'nen Maru is a small, purplish-blue boat with 3 as a figurehead that resembles Mr. 3's hair. On its side, it displays Mr. 3's name in large print in the center of a red circle. It has 2 gun ports on each side, and its cabin is shaped like a clam. It also has a blue and white striped sail and the Baroque Works Jolly Roger as the flag."}], "images": []}, {"title": "Abilities", "level": 2, "content": [{"type": "paragraph", "text": "Nefertari Vivi mentioned that it is powered by his Doru Doru no Mi powers, although the exact method has yet to be explained. It likely functions similarly to Smoker's Billower Bike in that his wax flows around an axle to rotate the paddles."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "After his defeat at Little Garden, Mr. 3 used the Chiryaku Ten'nen Maru to travel to Alabasta."}], "images": []}, {"title": "Miss Goldenweek's \"Operation: Meet Baroque Works\"", "level": 3, "content": [{"type": "paragraph", "text": "After Baroque Works was dissolved, Mr. 3 used the ship to flee to Kyuka Island. When former members of the criminal organization were being targeted by Hina and the Marine demanded that Mr. 3 surrender himself in exchange for Miss Valentine's freedom, Mr. 3 tried to sneak out of the island using the Chiryaku Ten'nen Maru, which he had hidden under a cover on the coast. However, before he could depart, he was stopped by Mr. 2 Bon Kurei, who forced him to help save his former colleagues."}, {"type": "paragraph", "text": "The Chiryaku Ten'nen Maru's current whereabouts are unknown as Mr. 3 was arrested and sent to Impel Down."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 18 Chapter 158 (p. 3) and Episode 93, Vivi sees Mr. 3's ship when they arrive at Alabasta, and explains how it moves.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Mr. 3 and Miss Goldenweek's ship's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 40 Chapter 382, cover story: Miss Goldenweek's \"Operation: Meet Baroque Works\" Vol. 18, Mr. 3 tries to escape Kyuka Island on his ship", "elements": []}, {"text": "↑  One Piece Manga — Vol. 40 Chapters 383 and 384, cover story: , Mr. 3's plot to escape is stopped by Mr. 2 Bon Kurei.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 43 Chapters 412 and 413, cover story: Miss Goldenweek's \"Operation: Meet Baroque Works\" Vol. 41-42, Mr. 3 and Mr. 2 Bon Kurei are arrested and taken to Impel Down.", "elements": []}]}], "images": []}]}