{"sections": [{"title": "Charlotte Basans", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Basans is the 23rd son and 39th child of the Charlotte Family and an officer of the Big Mom Pirates. He is the younger twin brother of Saint-Marc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Basans is a very tall dark-skinned man with several antlers on his head. He wears what appears to be a puffy light blue hooded jacket with circle patterns that has a big zipper. He also wears armor on his legs."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Basans is very loyal to his family and crew, as he went along with their plan to assassinate the Vinsmoke Family and expressed concern when it was not going as planned."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Basans has authority over lower-ranking members of his crew."}, {"type": "paragraph", "text": "Basans possesses a strong will, being able to withstand a burst of Big Mom's Haoshoku Haki and remain conscious from her loud scream."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Basans has above-average physical strength, as he was able to briefly clash with Vinsmoke Yonji, a powerful superhuman fighter who had his Raid Suit on."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "For use in assassinating the Vinsmoke Family, he and other members of the Big Mom Pirates were given Walkers."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Basans attended the tea party and wedding for Charlotte Pudding and Sanji on the Whole Cake Chateau. When Sanji dodged the bullets meant to assassinate him, Basans consulted worriedly with his crewmates, wondering if they should continue the plan.Monkey D. Luffy and the Straw Hat Pirates then broke into the venue in order to hatch the assassination plot against Big Mom with the Fire Tank Pirates. When Charlotte Perospero trapped the Vinsmoke Family with candy, Basans and other members of the Big Mom Pirates held them at gunpoint. However, Big Mom's scream incapacitated them, allowing the Straw Hats to free the Vinsmokes."}, {"type": "paragraph", "text": "Katakuri then created earplugs for everyone, and the Big Mom Pirates besieged Capone Bege. When Bege attempted to escape, Basans and his crew were seen shooting at him, but the shots were blocked by the Vinsmoke Family. Basans was then seen clashing with Vinsmoke Yonji as Bege was flown away. The Big Mom Pirates eventually got the upper hand again against the enemy alliance, but the Tamatebako then fell to the base of the Chateau, tipping it over and sending the Big Mom Pirates plummeting to the ground below. However, their fall was broken when Streusen turned part of the Chateau into soft cake."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Charlotte Basans vs. Vinsmoke Yonji", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Basans, Charlotte Saint-Marc, and Charlotte Cornstarch vs. Vinsmoke Judge", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Basans' name may be based off a Japanese sweet from Kyoto called the pasan (パサン pasan or パサンズ pasanzu), which is a type of cookie. This follows the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}]}