{"sections": [{"title": "Charlotte Montb", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Montb is the 29th son and 50th child of the Charlotte Family and an officer of the Big Mom Pirates. He is the youngest triplet brother of Kanten and Kato."}, {"type": "paragraph", "text": "He was a member of Charlotte Oven's army to ambush Monkey D. Luffy on Cacao Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Montb is a somewhat thickset man with a small round nose. He wears a high-collared shirt which obscures much of his face, dark pants with polka dots, dark boots, a dark cape, and a large belt. He also wears a dark, wide-brimmed hat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5c/Charlotte_Montb_Manga_Concept_Art.png/revision/latest/scale-to-width-down/180?cb=20190323160037", "caption": "Montb's original concept art."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Montb's personality, but he holds no remorse for punishing traitors to his family and crew. He was flustered when he tried to shoot at the Vinsmoke Family but did no damage to them, and he was shocked when he heard of his older brother's defeat."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Montb has authority over lower-ranking members of his crew. He is strong enough to have been sent with many of his siblings to Cacao Island to fight Luffy."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Monbt has a fair amount of physical strength, as he was able to hold down Pekoms' head along with a few of his crewmates while the mink was transforming into his Sulong form."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Like many of his siblings, Montb uses a pistol. He also carries a sword on his hip."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Less than two hours before Monkey D. Luffy was scheduled to arrive at Cacao Island, Montb and his siblings stood guard at the only mirror left on the island and waited for the young pirate to burst out."}, {"type": "paragraph", "text": "To their surprise, however, when it came time for Luffy to come out, Pekoms came out with a captured Brûlée, instead. However, after Pekoms was attacked by Oven, Luffy fell out from where Pekoms had hidden him. In response, Montb and his brother, Chiboust, surrounded the traitor and threatened to gouge out his eyes."}, {"type": "paragraph", "text": "After the Vinsmokes and the Germa arrived, Montb attempted to shoot them, but soon realized that it was impossible to damage their modified bodies with normal weapons. Later, when Brûlée revealed that their elder brother Katakuri had been defeated by Luffy, Montb responded in shock."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Montb's name likely comes from Mont Blanc, a dessert of chestnuts and whipped cream, which fits with the food-themed names of the Charlotte Family.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 89 Chapter 897 (p. 12), Montb debuts in the manga.", "elements": []}, {"text": "↑  One Piece Magazine Vol.5, Montb's name and birth order are revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 898 (p. 2, 8), Montb attempts to shoot the Germa.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 894 (p. 14), Oven gathers his siblings at Cacao Island.", "elements": []}]}], "images": []}]}