{"sections": [{"title": "Charlotte Nougat", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Nougat is the 41st son and 75th child of the Charlotte Family and an officer of the Big Mom Pirates."}, {"type": "paragraph", "text": "He was a member of Charlotte Oven's army to ambush Luffy on Cacao Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nougat is a young and muscular man of around average height, as he is dwarfed by his much taller brothers Raisin and Yuen. He has a big mane of orange hair. He lacks a shirt and wears green polka-dotted pants. He also wears a grassy headdress, a very large feathery white scarf around his neck, and a light green fur cape tied around his waist that covers the back of his legs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Nougat_Full_Body.png/revision/latest/scale-to-width-down/150?cb=20190210155015", "caption": "Full-body view of Nougat."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nougat is loyal to his family and crew, as he helped them ambush Luffy on Cacao Island. He appears to be calm and reasonable, as shown when he gave Luffy credit for outwitting Katakuri, but can get surprised, as shown when he found out that his initial expectations for Luffy were wrong and that the Straw Hat had defeated Katakuri."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the Big Mom Pirates, Nougat has authority over lower-ranking members of his crew. His combat powers and abilities are unknown, but he is presumably strong as he is an officer of a Yonko-led crew. He is strong enough to have been sent with many of his siblings to Cacao Island to fight Luffy."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Nougat carries a katana, but has not been shown using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Nougat joined many of his siblings and crewmates in occupying Cacao Island in order to ambush Monkey D. Luffy if he escaped from Mirro-World. When Oven suggested that Luffy would use Brûlée to escape, Nougat voiced his agreement. When the time came for Luffy to come out, the Big Mom Pirates prepared for battle. Nougat heard a voice coming from the mirror, and to his surprise, Pekoms came out with a captive Brûlée and no Luffy in sight. However, Luffy was quickly exposed, and Nougat commended his ability to escape from Katakuri. As the Big Mom Pirates attacked their enemies, the skirmish was suddenly interrupted by Germa 66. As the Vinsmoke Family facilitated Luffy and Sanji's escape, Nougat was utterly shocked when Brûlée revealed that Luffy had defeated Katakuri. During the battle at Cacao Island, Nougat along with other members of the Big Mom Pirates used the anti-Germa bullets to injure the Vinsmokes."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A nougat is a candy made from sugar or honey, nuts and egg white. This fits with the food-themed names of the Charlotte Family and Big Mom Pirates.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 89 Chapter 894 and Episode 869, Nougat makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 930 (p. 8), Children of the Charlotte Family confirmed to be executives of the Big Mom Pirates", "elements": []}, {"text": "↑  One Piece Magazine Vol.5", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 897.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 898.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 89 Chapter 896.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 89 Chapter 900 and Episode 875.", "elements": []}]}], "images": []}]}