{"sections": [{"title": "Fukurokuju", "level": 1, "content": [{"type": "paragraph", "text": "Fukurokuju is the captain of the Orochi Oniwabanshu who serve the shogun of Wano Country, Kurozumi Orochi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Fukurokuju is a tall man with an elongated bald head. He has a very long and pointed dark beard, and his earlobes are extremely long. He wears a dark kimono with a pattern of circles with three dots in them, as well a Japanese character on his abdomen."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Fukurokuju is duplicitous and not above changing sides, as he once did in the past when he betrayed the Kozuki Family to serve under Kurozumi Orochi."}, {"type": "paragraph", "text": "His current loyalty is to Orochi, which he demonstrates by his dutiful actions of serving his master to the full extent of his powers. However, he was patient enough to give Nico Robin one chance to explain herself when she was caught snooping around Orochi Castle."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As captain of the Orochi Oniwabanshu, Fukurokuju has full control over the group. Fukurokuju is also noted to be an extremely skilled master of ninjutsu by Shinobu, a veteran kunoichi. He is stated to be Raizo's biggest rival as a ninja."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Twenty years ago, Fukurokuju and yakuza leader Hyogoro were allied with the Kozuki Family, but when the Beasts Pirates invaded Wano Country and Kurozumi Orochi took over the country, Fukurokuju betrayed the Kozuki Family and pledged to serve Orochi. His subordinate at the time, Shinobu, was disgusted with this and left the Oniwabanshu."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Orochi Oniwabanshu caught Nico Robin snooping in a secret room in Orochi Castle, and Fukurokuju came into the room and gave her one chance to explain herself. After Robin claimed to be Ushimitsu Kozo, Fukurokuju ordered his ninjas to capture her. However, the Robin they attacked was a duplicate created by her Devil Fruit powers. Fukurokuju then ordered his squad to find her."}, {"type": "paragraph", "text": "As supporters of the Kozuki Family were detained in the Rasetsu District Prison, Fukurokuju told the prisoners to remain silent after telling them that their plan failed. He later went to the palace to report to Orochi about the capture of Shimotsuki Yasuie."}, {"type": "paragraph", "text": "After the Straw Hats began causing chaos at Rasetsu Town following Yasuie's execution, the Orochi Oniwabanshu entered the battle. Fukurokuju recognized Zoro from a wanted poster and ordered his group to capture at least one of the Straw Hats."}, {"type": "paragraph", "text": "Later, Fukurokuju informed Orochi the Straw Hats' escape and the capture of Trafalgar Law. Fukurokuju also informed the shogun that the Flower Captial was on lockdown with the Orochi Oniwabanshu and the Mimawarigumi on guard. He reassured that he would not let anything harm Orochi until they captured their enemies."}, {"type": "paragraph", "text": "On the day of the Fire Festival, Fukurokuju accompanied Orochi to Onigashima."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Fukurokuju is the name of one of the Seven Lucky Gods in Japanese mythology. Aside from his sunglasses, he also bears a similar appearance to the god, especially his elongated head.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 92 Chapter 931 (p. 12-13), Fukurokuju makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 935 (p. 15).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 948.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 932 (p. 3-6), The Orochi Oniwabanshu chase Robin.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 939 (p. 9).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 941 (p. 3-5).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 945 (p. 2-3).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 951 (p. 3-4).", "elements": []}, {"text": "↑  One Piece Manga — Chapter 958.", "elements": []}]}], "images": []}]}