{"sections": [{"title": "Lord of the Coast", "level": 1, "content": [{"type": "paragraph", "text": "The Lord of the Coast is a Sea King that inhabits the waters of Dawn Island, typically near Foosha Village. He is classified as a Type C creature, \"Big Savage\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Lord of the Coast is fairly small in size compared to other Sea Kings. However, he is still large enough to swallow a grown man whole."}, {"type": "paragraph", "text": "His appearance is similar to a large oversized brown eel with red eyes and blue fins. These eyes become bloodshot and the pupils turn catlike when it goes into a berserk frenzy, a trait shared in the fish-man Arlong."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Lord_of_the_Coast_Digital_Colored_Manga.png/revision/latest/scale-to-width-down/210?cb=20130620053330", "caption": "The Lord of the Coast as he is colored in the digital colored manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "The Lord of the Coast is very aggressive and fierce in nature. In the creature classification, he's considered even more savage than a typical Sea King. However, he still possesses enough survival instinct to fear displays of power such as Shanks' angry glare."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being a Sea King, the Lord of the Coast is naturally a very vicious and dangerous predator, as well as a powerful swimmer. His will is weak enough to be affected by Shanks' Haoshoku Haki as Shanks was able to intimidate him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Romance Dawn Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was first seen when he ate Higuma, who was in a small rowboat, shortly after Higuma threw Luffy into the water. He then tried to eat Luffy but bit off Shanks' left arm instead. He was then scared away by Shanks, who stared him down using his Haoshoku Haki."}, {"type": "paragraph", "text": "Ten years later, when Luffy left Foosha Village to start his journey as a pirate, the Lord of the Coast tried to eat him again, and was promptly knocked out with a Gomu Gomu no Pistol."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Lord_of_the_Coast_Eats_Higuma.png/revision/latest/scale-to-width-down/210?cb=20130301083359", "caption": "Higuma meets his demise."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Lord of the Coast vs. Shanks", "elements": []}, {"text": "Lord of the Coast vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Initially, the anime skipped Luffy's \"rematch\" with the Lord of the Coast, as Luffy's past was consigned to a flashback that was somewhat shorter than the corresponding manga chapter. However, the scene was adapted into both the anime's first opening and One Piece: Grand Battle! Rush!'s opening cinematic."}, {"type": "paragraph", "text": "The scene was finally adapted into the anime proper in Episode 504, when the rest of Luffy's backstory was revealed. Luffy's stance in the episode is closer to the manga than in the opening, with his foot sticking up and his left arm holding his right, whereas the opening has his foot on the edge of the boat and his left arm pulled back."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Gomu_Gomu_no_Pistol.png/revision/latest/scale-to-width-down/230?cb=20150730110438", "caption": "Luffy punching the Lord of the Coast."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The Viz manga does not treat 近海の主 (Kinkai no nushi, 近海の主) as a name or epithet, instead translating it as \"our local sea monster\"; the Funimation simulcast of the anime follows this convention. The creature's 'official' English name, Master of the Near Sea, has been established only by video games - first by the American-only One Piece (Game Boy Advance), and subsequently by the localization of One Piece: Treasure Cruise."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He was issued alongside Shanks and Luffy in a One Piece Block Figures set featuring the Straw Hats and their past mentors/loved ones."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Lord of the Coast was the first Sea King to be featured in the series. It is also the first Sea King to appear outside of the Grand Line.", "elements": []}, {"text": "In some older fan translations, he is identified as a \"shark\" rather than a Sea King (possibly in conflation with the original Romance Dawn, where his role was served by an ordinary shark). It should be noted that the term \"Sea King\" was not introduced until Chapter 92.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  https://one-piece.com/news/detail/20171102_6345/", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 1 (p. 40) and Episode 4, The Lord of the Coast sneaks up on a gloating Higuma.", "elements": []}, {"text": "↑  One Piece Red: Grand Characters, The Lord of the Coast is explicitly identified as a Sea King.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 88-89), classification of animals by dangerousness.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, the relative size of the Lord of the Coast is discussed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 1 and Episode 4, The Lord of the Coast eats Higuma and Shanks' left arm. Ten years later, he is punched by Luffy.", "elements": []}, {"text": "↑  One Piece Anime — Episode 4, Luffy's reminiscence of his past ends with Shanks bestowing his famed straw hat.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 92 and Episode 42, Sanji likens the enraged Arlong's eyes to those of a Sea King; an image of the Lord of the Coast is offered as a point of comparison.", "elements": []}]}], "images": []}]}