{"sections": [{"title": "Hanzo", "level": 1, "content": [{"type": "paragraph", "text": "Hanzo is a ninja who resides in Wano Country. He is a member of the Orochi Oniwabanshu who serve and protect the shogun Kurozumi Orochi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hanzo is a very large and thickset man. He wears a dark mask over his face that only exposes his eyes, and has a skull design on the forehead. He also wears a dark kimono with shuriken designs on it and a light scarf around his neck, and his entire body below his head appears to be covered in netting."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like the other members of the Orochi Oniwabanshu, Hanzo is loyal to the shogun Orochi and is dedicated to his job. While appearing calm most of the time he is on the job, he became gripped by fear when he encountered the renowned kunoichi Shinobu."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Despite his large size, Hanzo is extremely acrobatic, and spends most of his time hanging and crawling on the ceiling. As a member of the Orochi Oniwabanshu, Hanzo is an extremely skilled ninja, having snuck up on Nico Robin with his comrades, sneaking through Orochi's banquet hall without attracting attention (although he was noticed by Robin), and sneaking up on Nami and Shinobu in the attic of Orochi Castle."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Hanzo wields a rope and is skilled in using it, as seen when he used it to restrain Robin's body double extremely quickly. He also carries a sword on his back."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After seeing the geisha Nico Robin suspiciously sneaking around Orochi Castle during Orochi's banquet, Hanzo and the rest of the Orochi Oniwabanshu snuck up on her body double and cornered her in a room. When Robin's body double claimed to be Ushimitsu Kozo, Hanzo restrained her with a rope as the Oniwabanshu moved in to attack, but the body double then disappeared. Fukurokuju sent the Oniwabanshu to look for the real Robin, and Hanzo crawled on the ceiling of the banquet hall and looked around."}, {"type": "paragraph", "text": "He eventually crawled into the space above the ceiling and caught Nami and Shinobu peeking into the hall. He correctly identified Shinobu at first, but then doubted it was her, causing Shinobu to get mad and throw a projectile into his groin, which incapacitated him. Shinobu then broke through the floor, causing Hanzo to fall into the banquet hall below."}, {"type": "paragraph", "text": "After the Straw Hats began causing chaos at Rasetsu Town after Yasuie's execution, the Orochi Oniwabanshu entered the battle."}, {"type": "paragraph", "text": "On the day of the Fire Festival, Hanzo accompanied Orochi to Onigashima."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hanzo may be named after Hattori Hanzō, a famous samurai who helped found the Tokugawa shogunate in Japan.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 92 Chapter 931 (p. 12-13), Hanzo makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 933 (p. 8-9), Hanzo encounters Shinobu.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 932 (p. 3-8), The Orochi Oniwabanshu chase after Robin.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 945 (p. 2).", "elements": []}, {"text": "↑  One Piece Manga — Chapter 958.", "elements": []}]}], "images": []}]}