{"sections": [{"title": "Daikoku", "level": 1, "content": [{"type": "paragraph", "text": "Daikoku is a ninja who resides in Wano Country. He is a member of the Orochi Oniwabanshu who serve and protect the shogun Kurozumi Orochi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Daikoku is a large man with a massive mane of light hair that stretches down his back and chest. He wears a dark kimono, two large shoulder pauldrons, and a headpiece on his head that has horns resembling those of a bull."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like the other members of the Orochi Oniwabanshu, Daikoku is loyal to the shogun Orochi to a fault, as he refused to take action against the shogun even when he was threatening his own allies in a mad rampage since he believes Orochi can do whatever he wants. He was also very intent on capturing the intruder Nico Robin upon finding her. He can be shaken by things he does not understand, as shown when he witnessed Robin's and Brook's Devil Fruit abilities."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Orochi Oniwabanshu, Daikoku is an extremely skilled ninja, being capable of stealthily sneaking up on Robin unnoticed along with the rest of the Oniwabanshu, as well as sneaking through a crowded banquet hall without drawing attention. He is acrobatic enough, as he was seen crawling on the ceiling when he spotted Robin in the banquet hall. He also appears to possess some degree of durability as he quickly recovered from a Gigantesco Mano attack. Daikoku has some authority in the Oniwabanshu as he ordered Fujin and Raijin to chase after Hiyori."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Daikoku carries a large katana, but has not been shown using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After seeing the geisha O-Robi suspiciously sneaking around Orochi Castle during Orochi's banquet, Daikoku and the rest of the Orochi Oniwabanshu snuck up on her body double and cornered her in a room. Robin's body double was given a chance to explain herself, and she claimed to be Ushimitsu Kozo, causing the Oniwabanshu to move to capture her as Daikoku revealed that Ushimitsu Kozo had already appeared in the capital that day. Robin's body double then disappeared, and the Oniwabanshu spread out to Orochi's banquet to look for her. When Robin ran away with the young girl Toko after the latter created an incident with Orochi, Daikoku spotted her and alerted his comrades."}, {"type": "paragraph", "text": "Some of Orochi's banquet guests asked Daikoku to stop the rampaging Orochi, but he refused, saying capturing the intruder was more important. Daikoku then watched as Brook overwhelmed Fujin and Raijin, and was himself overpowered by a giant hand created by Robin. He and some other ninja were then chased by Brook, and they eventually realized that the skeleton would not attack them, but then Nami attacked the room with a massive thunderclap."}, {"type": "paragraph", "text": "Daikoku later stood guard at the prison in the Rasetsu District where Shimotsuki Yasuie was held and scheduled for execution, watching as the former daimyo was killed. After the Straw Hats began a commotion, Daikoku ordered Fujin and Raijin to pursue a woman that was seen with Roronoa Zoro. They were about to capture her but she was rescued by Zoro, confirming that she was an ally to Zoro."}, {"type": "paragraph", "text": "On the day of the Fire Festival, Daikoku accompanied Orochi to Onigashima."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Daikoku may be named after Daikokuten, one of the Seven Lucky Gods in Japan, similar to Fukurokuju.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 92 Chapter 931 (p. 12-13), Daikoku makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 933 (p. 5), Daikoku's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 933 (p. 5-9, 15), the Orochi Oniwabanshu confronts the alliance.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 932 (p. 3-8, 16-17), The Orochi Oniwabanshu chase Robin.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 942.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 945 (p. 7).", "elements": []}, {"text": "↑  One Piece Manga — Chapter 958.", "elements": []}]}], "images": []}]}