{"sections": [{"title": "Fujin and Raijin", "level": 1, "content": [{"type": "paragraph", "text": "Fujin and Raijin are ninja who reside in Wano Country. They are members of the Orochi Oniwabanshu who serve and protect the shogun Kurozumi Orochi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "One of them is an average-sized man with long spiky hair. He wears a goggled mask over his face, one side of which is dark and the other light. He also wears a dark kimono, dark gloves, and a large ring on his back holding four fireballs."}, {"type": "paragraph", "text": "The other one is slightly taller. He wears a helmet, and his hair is gathered into a long ponytail sticking up out of the back of the helmet. He also wears a dark kimono with shuriken designs on it, dark gloves, and a cape-like garment on his back that looks inflated."}, {"type": "paragraph", "text": "Both of them have been seen riding on the backs of large catfish that can move on land."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Like the other members of the Orochi Oniwabanshu, Fujin and Raijin are loyal to the shogun Orochi and dedicated to their jobs. However, they are superstitious and can be prone to being scared, as shown when they were confronted by the skeleton Brook. One of them remarked how foolish it was for Robin to attempt to sneak through Orochi Castle in the presence of ninja."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Fujin and Raijin are extremely skilled ninjas, as they were able to sneak up on Robin and catch her by surprise along with the other Oniwabanshu members."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "One of them carries shuriken, which he used to attack Robin."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After seeing the geisha O-Robi suspiciously sneaking around Orochi Castle during Orochi's banquet, Fujin, Raijin, and the rest of the Orochi Oniwabanshu snuck up and cornered her. The ninjas questioned who she was and then moved to capture her, but unbeknownst to them, it was her body double, and so when they caught her, she vanished into thin air. Seeing this, they broke off into the banquet hall to find the real body of the geisha. While searching, Fujin and Raijin encountered Brook's spirit form, and ran screaming for their lives, while mistaking him for the Gashadokuro. As they ran, they encountered their comrades and shouted that a ghost was chasing them, which led to their comrades running away in fear as well."}, {"type": "paragraph", "text": "As the Straw Hats were causing chaos at Rasetsu Town after Yasuie's execution, Daikoku ordered Fujin and Raijin to pursue a woman that was seen with Zoro. As they were about to capture her, Zoro came and attacked them."}, {"type": "paragraph", "text": "After Zoro and Hiyori fled to the forest outside the capital, Fujin and Raijin led a group of ninjas in pursuit of the duo and the entire group was eventually defeated by Zoro."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Zoro_Defeats_Fujin.png/revision/latest/scale-to-width-down/200?cb=20190729150406", "caption": "Zoro defeats Fujin."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Fujin and Raijin are likely named after the Japanese gods of wind and thunder. Their namesakes being Japanese gods is shared with fellow Oniwabanshu members Fukurokuju and Daikoku.", "elements": []}, {"text": "Although they were not identified individually, it should be noted that the one wearing the mask has a ring of taiko drums on his back, similar to many depictions of the god Raijin, while the other carries a large sash behind him, similar to depictions of the god Fujin.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 92 Chapter 931 (p. 12-13), Fujin and Raijin make their debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 933 (p. 6), Fujin and Raijin are chased by Brook.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 932 (p. 3-8), The Orochi Oniwabanshu chase Robin.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 945 (p. 5,9).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 950 (p. 13-14).", "elements": []}]}], "images": []}]}