{"sections": [{"title": "Alpacaman", "level": 1, "content": [{"type": "paragraph", "text": "Alpacaman is a Gifter in the Beasts Pirates who serves as a guard in the Prisoner Mines of the Udon Region of Wano Country."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Alpacaman is a tall and muscular man whose neck and head are those of an alpaca's, increasing his height. He wears an open dark jacket and cape with feather-like frills, as well as a pair of briefs with pockets on them. He wears a vertically striped pant leg on only his left leg, leaving his right one bare."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Alpacaman is very loyal to his crew, as he looked forward to the punishments that Eustass Kid would receive upon being caught. He likes to abuse his position as a guard to spit on the prisoners, and is quick to remind them of the punishments for retaliating against him."}, {"type": "paragraph", "text": "Like many other people, he has a unique laughter style: \"Pacacaca\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a guard over the Prisoner Mines in Udon, Alpacaman possesses great authority over the prisoners, being capable of doing whatever he wants to them without the threat of retaliation."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Alpacaman ate an alpaca SMILE fruit, transforming his entire head and neck into those of an alpaca. With this ability, he is capable of spitting saliva projectiles at a high speed."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is shown using two sabers during his fight with Hyogoro and Luffy. He possesses some skill with them, and has a habit of spinning them around to show off and attack. He calls this style Alpaca Kenpo (アルパカ剣法, Arupaka Kenpō, Viz: \"Alpaca Fencing\")."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When news of Eustass Kid's escape from the Prisoner Mines was announced and the guards were demanding for those that knew of any information to come forward, Alpacaman remarked that Kid was stupid for escaping without freeing himself of his Seastone handcuffs. Alpacaman tormented Monkey D. Luffy by spitting on him and questioned if he had helped Kid escape."}, {"type": "paragraph", "text": "After many fighters failed to kill Luffy and Hyogoro during the Sumo Inferno, Alpacaman and Madilloman entered the ring. Alpacaman tried to attack Hyogoro, but the latter managed to avoid his attacks thanks to Luffy using Kenbunshoku Haki to guide him. Eventually, Hyogoro defeated Alpacaman using Busoshoku Haki."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Hyogoro_Attacks_Alpacaman.png/revision/latest/scale-to-width-down/150?cb=20190426071738", "caption": "Hyogoro defeats Alpacaman."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Alpacaman and Madilloman vs. Monkey D. Luffy and Hyogoro", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He is the second character in the series with a Zoan fruit of an alpaca, after the non-canon Alpacacino.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 93 Chapter 934 (p. 12).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 939 (p. 10).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 939 (p. 10-17).", "elements": []}]}], "images": []}]}