{"sections": [{"title": "Minatomo (East Blue)", "level": 1, "content": [{"type": "paragraph", "text": "Minatomo-san is a carpenter who was created by Oda as a One Piece SBS joke character to explain how the door Higuma kicked off its hinges was suddenly back in place as the bandit left the bar, after Higuma smashed a bottle of sake over Shanks."}, {"type": "paragraph", "text": "According to Oda, Minatomo is a carpenter who cannot go past a broken door without repairing it. Since the answer was given, Minatomo has made several appearances in the anime, normally seen either randomly standing next to people or repairing doors. Minatomo's appearances are similar in idea to Pandaman and Sam."}, {"type": "paragraph", "text": "He is a descendant of someone who originated from Wano Country who left Wano for the East Blue a few decades ago. He is related to another carpenter who is also only known as Minatomo."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Minatomo is a short, elderly man with tanned skin, dark gray hair, and a stern look on his face. He also has a scar on his left cheek. He wears working clothes in varying shades of blue and has a rope tied around his forehead."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Minatomo_in_Warship_Island.png/revision/latest/scale-to-width-down/100?cb=20190112164541", "caption": "Minatomo in Warship Island."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about his personality except that he is apparently short-tempered and cannot stand broken doors, immediately repairing them when he sees one."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Minatomo is a very skilled carpenter, since he could replace the door to Partys Bar in seconds without being seen."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "After Higuma kicked off the door to Partys Bar, Minatomo saw the damage and, due to his inability to ignore a needed fix, quickly replaced it in the brief time between Higuma barging into the bar and hitting Shanks over the head with a bottle."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "Later, Minatomo appeared in Loguetown to watch the Loguetown cooking contest."}], "images": []}, {"title": "Warship Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "As the Straw Hat Pirates were about to leave Warship Island, Minatomo was shown next to Bokuden."}], "images": []}, {"title": "Drum Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "As Usopp, Nefertari Vivi, and Dalton arrived at Cocoa Weed to try to find the only doctor on the island, Minatomo was shown fixing the door of the restaurant belonging to Tamachibi's father."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  SBS One Piece Manga — Vol. 7, Fan question: how come the door was suddenly repaired?", "elements": []}, {"text": "↑  One Piece Anime — Episode 51, Minatomo appears in Loguetown filler.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 1 and Episode 4, Minatomo fixes the door to the bar unseen.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 92, The relationship between the Minatomos is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 61, Minatomo appears in Warship Island.", "elements": []}, {"text": "↑  One Piece Anime — Episode 81, Minatomo appears in Drum Island.", "elements": []}]}], "images": []}]}