{"sections": [{"title": "Minatomo (Wano)", "level": 1, "content": [{"type": "paragraph", "text": "Minatomo is a legendary carpenter in Wano Country and the leader of the Legendary Carpenters (, Legendary Carpenters) that Franky joined to get access to the blueprints of Kaido's fortress. He is related to another person, whose name is also Minatomo, who is a descendant of someone who traveled from Wano to East Blue."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Minatomo is a short, elderly man with tanned skin, dark gray hair, and a stern look on his face. He also has a scar on his left cheek. He wears working clothes in varying shades of blue and has a rope tied around his forehead."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appreciates talented carpenters as he praised Franky for his superior craftsmanship, albeit in a rude and grumpy manner, much to the latter's annoyance."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Minatomo is an extremely skilled carpenter, having been recognized as worthy of building Kaido's residence on Onigashima. Furthermore, he owns his own carpenter guild, of which Franky was temporarily a member, and as such, has an entire guild of carpenters that follow his orders."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "According to Kin'emon, Minatomo built Kaido's residence in Onigashima in Wano Country. Ten years before the present, he sold the blueprints to a pawn shop."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Sometime upon Franky's arrival in Wano, Minatomo hired him as a carpenter. Later, Minatomo praised Franky for the wall he built."}, {"type": "paragraph", "text": "Sometime later when Franky discussed with him about letting him see the blueprints of Kaido's fortress, Minatomo revealed that he just remembered that he had sold the blueprints to a pawn shop ten years ago. Furious, Franky lashed out at Minatomo, who then fired Franky."}, {"type": "paragraph", "text": "Minatomo later visited a bathhouse."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "As \"Minatomo\" appears to be a family name, as evidenced by the other Minatomo, this suggests that Minatomo has a given name which remains unknown.", "elements": []}, {"text": "Unlike the Minatomo of East Blue, this Minatomo's name is written in kanji, as opposed to hiragana.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 909 (p. 10) and Episode 892.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 929 (p. 3).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 92 Chapter 929 (p. 3-4).", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 92 (p. 94), The relationship between the Minatomos is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 91 Chapter 921 (p. 6).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 935 (p. 14).", "elements": []}]}], "images": []}]}