{"sections": [{"title": "Solitaire", "level": 1, "content": [{"type": "paragraph", "text": "Solitaire is a Headliner of the Beasts Pirates who serves as a vice warden of the Prisoner Mine in the Udon region of Wano Country."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Solitaire is a slim woman with long light hair that curves upward at the sides in a wing shape. She wears an aviator's helmet with a dark visor that covers her eyes, and has two horns typical of SMILE users that come out of holes on the sides. She also wears a short one-piece dress jacket decorated with buttons and pockets. As a monkey SMILE user, she has six arms and a tail, and wears six frilly shoulder pads as well as six gloves, one for each arm."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Solitaire is very dedicated to her job, as she became worried upon hearing that the key to the Seastone handcuffs in the Prisoner Mine was stolen. She can also get angry, as she berated her subordinates for their incompetence in letting the key get stolen."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Headliner in the Beasts Pirates, Solitaire holds a high position in the crew and has authority over lower-ranking members, and as a vice warden of the Prisoner Mines, she has a great amount of authority over the prisoners, and can also give orders to lower-ranking guards."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Solitaire ate a monkey SMILE, which gives her four more functional arms as well as a monkey's tail. She is able to use her extra arms to grab more objects than a normal person would be able to."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "With the abilities granted by her Devil Fruit, Solitaire wields four swords with her bottom four arms. Her skill with them is unknown, as she has not been seen using them."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Solitaire was in the Executive Tower of the Prisoner Mine when her subordinates reported that the keys to the prisoners' Seastone handcuffs had been stolen. Solitaire berated them for not being able to prevent this and told them to search every part of the tower, saying the culprit must still be in there."}, {"type": "paragraph", "text": "After Kawamatsu was freed and joined up with Raizo and Kikunojo, Solitaire was seen near Babanuki as he ordered the guards to prepare Excite Bullets. As the prisoners later rebelled and took over the prison, her current status remains unknown."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Solitaire is a popular single-player card game, fitting with the card game-themed names of the Beasts Pirates headliners.", "elements": []}, {"text": "Her overall design is possibly a pun on both Spider Monkey and Spider Solitaire. ", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 93 Chapter 935 (p. 2-3), Solitaire makes her debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 948 (p. 12).", "elements": []}]}], "images": []}]}