{"sections": [{"title": "Daifugo", "level": 1, "content": [{"type": "paragraph", "text": "Daifugo is a Headliner of the Beasts Pirates who serves as a vice warden of the Prisoner Mine in the Udon region of Wano Country."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Daifugo is a man of around average height. His light hair is gathered into a long ponytail with a scorpion stinger at the end. He wears a dark open shirt with frilly soldiers and the number 65 on the back, and a masked helmet on his head. Due to his SMILE power, he possesses six legs, and wears a pair of dark pants that go on all of them. Each pant leg has a spike at the knee."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Daifugo takes his responsibilities as vice warden seriously, and is cruel and violent toward prisoners who are breaking the rules, wanting order in the prison to be maintained and having no leniency toward rule-breakers, as seen when he brutally attacked Hyogoro to stop him from eating kibi dango he had not earned. He is also arrogant, as he proudly proclaimed that he would defeat Luffy in no time if he were given the chance."}, {"type": "paragraph", "text": "He is also shown to be a coward as he showed fear when the prisoners rebelled after Warden Babanuki was defeated."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Daifugo_Assaulting_Hyogoro.png/revision/latest/scale-to-width-down/210?cb=20190603075502", "caption": "Daifugo brutally punishes Hyogoro for violating rules."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice warden of the Prisoner Mines, Daifugo has a great amount of authority over the prisoners in it, and as a Headliner, he holds a high position in the Beasts Pirates and has authority over lower-ranking members of the crew. Daifugo was greatly affected from being kicked in the face by Luffy, and although he managed to recover somewhat quickly, the impact of the attack was notable as Luffy was weakened by Seastone handcuffs."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Daifugo ate a scorpion SMILE fruit, which gives him four extra functioning legs, and also turns his hair into a scorpion's tail and stinger. Specific abilities granted by the fruit have not been seen. It is unknown if Daifugo's stinger is venomous like those of real scorpions."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is often shown with a sword on his back, though he has yet to be shown using it, and was briefly seen holding a rifle during Big Mom's rampage. Daifugo also makes use of two flintlocks loaded with \"Excite Bullets\", a special ammunition created by Queen that contains a highly contagious virus, causing a severe fever in those hit which spreads instantly to others who come into direct contact with an infected victim."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Daifugo beat up the prisoner Hyo after correctly assuming that he had not legitimately earned all the meal tickets he had. Daifugo grabbed Hyo and told him to reveal who had given him the meal tickets, but Hyo responded with defiance. Monkey D. Luffy then came and kicked Daifugo, injuring part of his head and knocking him to the ground. The warden Babanuki then subdued Luffy, and he and Daifugo consulted with Queen about the issues the Prisoner Mine was facing."}, {"type": "paragraph", "text": "As Luffy continuously defeated his opponents in the Sumo Inferno, Daifugo commented that the execution would have ended sooner if he had been fighting in the ring."}, {"type": "paragraph", "text": "On the next day, Big Mom arrived at Udon prison. After Big Mom overpowered Queen, Daifugo asked Babanuki if they should attack her, but Babanuki advised against it. He was surprised when he saw Luffy had removed his and Hyogoro's collars."}, {"type": "paragraph", "text": "After Queen left with a captured Big Mom, Babanuki ordered the prisoners to help subdue Luffy. As Luffy was held back, Daifugo shot a prisoner with an Excite Bullet, causing his body to burn all over. The vice warden revealed that the bullet would cause burning sensations that can be spread by making contact with the skin of someone who was shot by one. Daifugo then aimed at Luffy, saying he could subdue the pirate by shooting any of the prisoners grabbing him. Before he took a shot, he was interrupted by Kawamatsu's shouting. As Luffy and his allies from the Ninja-Pirate-Mink-Samurai Alliance fought against the Beasts Pirates, Daifugo proceeded to infect more prisoners with the Mummy virus. He was surprised when Luffy allowed himself to be infected. After Luffy rallied the prisoners to rebel, Daifugo desperately tried to threaten the prisoners with plague shots only to be pummeled by the inmates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1b/Udon_Rebellion.png/revision/latest/scale-to-width-down/180?cb=20190722162450", "caption": "The prisoners turn against Daifugo."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Daifugō is a Japanese card game where players seek to play stronger cards than the previous turn, which fits with the card game-themed names of the Beasts Pirates headliners.", "elements": []}, {"text": "Daifugo's helmet design has a resemblance to Jagi's from Fist of the North Star, which by itself is inspired by the one shown in Sukeban Deka II.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 93 Chapter 934 (p. 13-15), Daifugo makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 935 (p. 5).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 937 (p. 5).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 949 (p. 18-19).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 935 (p. 4-6).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 946 (p. 7).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 948 (p. 6-7).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 935 (p. 4-6, 10).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 946 (p. 7, 14).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 949 (p. 3-4, 7-9, 11-19).", "elements": []}]}], "images": []}]}