{"sections": [{"title": "Dragon Number Thirteen", "level": 1, "content": [{"type": "paragraph", "text": "Dragon Number Thirteen was a dragon created by Vegapunk to guard Punk Hazard. He carried out this duty, even after the island was sealed off by the World Government and Vegapunk left, until he was killed by Roronoa Zoro four years later. He was named by one of the World Nobles."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dragon Number Thirteen is a very large dragon, being 70 meters (229 feet) in length. He is covered in red scales, has a long neck and tail, and walks on four stumpy legs; his forelegs are much smaller than his hind legs. He boasts very sharp teeth, two horns on his head that point backwards, a pair of wings, and a row of spikes that goes along his backside from the top of his neck to the end of his tail."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/20/Dragon_Number_Thirteen_Full_View.png/revision/latest/scale-to-width-down/210?cb=20130113230214", "caption": "Full view of Dragon Number Thirteen."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Dragon Number Thirteen is a ferocious beast, caring only about eating intruders he encounters. He does not seem to be very intelligent, as he accidentally bit his own wing when trying to attack Monkey D. Luffy, who was on his back."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He is an extremely powerful fighter, able to easily overwhelm most opponents by breathing large streams of fire. He can also attack by biting opponents with his extremely sharp teeth, and his teeth are strong enough to clash with Zoro's swords."}, {"type": "paragraph", "text": "With his wings, he is capable of flight, giving him speed which makes it difficult for opponents to keep up with him. He also possesses an immense level of durability thanks to his very hard scales, protecting him from Luffy's powerful punches. However, his underbelly is unprotected and much more vulnerable. His durability is further evidenced by his survival after a massive fallout on the island that covered it in poisonous gas, as well as the fight between Akainu and Aokiji that changed the entire climate of the island; for the next two years the dragon lived in the scorching heat of the fire lands and continued serving his post without issue."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Vegapunk%27s_First_Dragon_Attacks_the_Straw_Hats.png/revision/latest/scale-to-width-down/210?cb=20140916075301", "caption": "Dragon Number Thirteen breathing fire."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Dragon Number Thirteen was created by Vegapunk and was stationed to protect the scientist's laboratory on Punk Hazard. The World Nobles grew to fancy him, and one of them gave him his name. Four years ago, Caesar Clown detonated his weapon and covered the island in poisonous gas, and Vegapunk abandoned Dragon Number Thirteen as he and the rest of the scientists evacuated and sealed off Punk Hazard. The dragon survived without issue and continued to serve his post, even when Marine admirals Akainu and Aokiji came and fought on the island two years later. Their fight covered one side of the island in fire and the other side in ice and snow, but the dragon remained in the fire lands."}, {"type": "paragraph", "text": "Shortly before the present day, the legs of the samurai Kin'emon ended up in the fire lands after being detached by Trafalgar Law. The dragon tried to eat Kin'emon's legs, only for them to get stuck on the top of his head."}], "images": []}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Monkey D. Luffy, Roronoa Zoro, Usopp, and Nico Robin entered Punk Hazard, the dragon immediately confronted and attacked them. He overwhelmed them with his fire breath and sharp teeth, but Luffy managed to kick his underbelly. He took to the air and resumed assaulting the pirates with his fire breath, and Luffy jumped onto his back. The dragon attempted to attack Luffy, but bit his own wing instead, causing him to fall toward the ground. Zoro then decapitated him with Ittoryu Iai: Shi Shishi Sonson, and his body was cooked and eaten by the Straw Hats."}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "Dragon Number Thirteen's death was slightly censored in the anime, as his blood and bones were omitted during the decapitation."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "When the Straw Hats first met Dragon Number Thirteen, he appeared to be able to speak. However, this turned out to be Kin'emon's legs talking through farts while attached to the dragon's head.", "elements": []}, {"text": "Dragon Number Thirteen was given his name because he was Vegapunk's thirteenth attempt at creating a dragon, and was the first successful one.", "elements": []}, {"text": "In One Piece: Stampede, Ann created a phantom projection resembling Dragon Number Thirteen.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 655 and Episode 579, Dragon Number Thirteen makes his debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Dragon Number Thirteen is officially named.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 656 and Episode 580.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 67 Chapter 664 and Episode 589.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 67 Chapter 658 and Episode 582.", "elements": []}]}], "images": []}]}