{"sections": [{"title": "Pankuta Dakeyan", "level": 1, "content": [{"type": "paragraph", "text": "Pankuta Dakeyan is a prisoner in Impel Down."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In the manga Dakeyan was shown to be a silent and calm person. In the anime, he was insolent and told his cellmates that he did not have to share with the boss every time he ate. He also, in a panic, begged Minotaurus not to transfer him to another cell, since he was not sentenced to death."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Nothing is known about Dakeyan's abilities, but he was considered dangerous by the World Government because he was arrested and sent to Impel Down. It is difficult to determine his strength, since he calmly let himself be beaten by his cellmates, without offering any resistance."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in his life, Dakeyan was sentenced as a criminal and taken to Impel Down."}], "images": []}, {"title": "Impel Down Arc", "level": 3, "content": [{"type": "paragraph", "text": "Dakeyan was eating bread in his cell, unaware of the rule that new prisoners must give their bread to the boss of the room. Another prisoner attacked him for his transgression, but the fight was interrupted by Minotaurus who took both participants into a cell marked L-5 2660."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is a pun on  (パン食っただけ, Pan kutta dake, meaning \"just ate bread\").", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  https://twitter.com/translatosaurus/status/1180541339424808960", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 525 (p. 10-11) and Episode 422, Dakeyan debuts.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0572 (EX Summit War Arc Vol. 5)).", "elements": []}, {"text": "↑  One Piece Anime — Episode 422.", "elements": []}]}], "images": []}]}