{"sections": [{"title": "Jean Goen", "level": 1, "content": [{"type": "paragraph", "text": "Jean Goen is a prisoner on Level 1 of Impel Down."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Goen is an average size man with brown hair. He has a large z shaped scar running from his right temple, through the right eye and across the nose, a light stubble, and several missing teeth. As all Impel Down prisoners, he wears a black and white stripped shirt and pants, which are ragged and torn. He also has chained cuffs on his wrists."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As most prisoners, he peruses his freedom and use any opportunity to ask for others to set him free. He is well informed on what's happening in the prison and knows about Portgas D. Ace's imprisonment. However, like most people, he is unaware of the prison's Level 6 and presumed Ace was locked up in the fifth level."}, {"type": "paragraph", "text": "Upon learning about Luffy' plan, he ridiculed him for his naivety, showing a realistic yet submissive attitude."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Goen's abilities. However, he is dangerous enough to be imprisoned in the great prison although only on the first least secure level."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in his life, Jean was sentenced as a criminal and imprisoned in Level 1 of Impel Down."}], "images": []}, {"title": "Impel Down Arc", "level": 3, "content": [{"type": "paragraph", "text": "After separating from Boa Hancock, Luffy wondered around the first level of Impel Down and came across Goen's cell. Goen and his cellmates questioned why Luffy was walking free and did not believe him when he told them he came from outside. Afterwards, Luffy asked them if they know where Ace was. They laughed at his plan to break him out and asked him to retrieve the keys to the cell from the security room."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is a pun on  (ご縁, goen, meaning \"fate\"), referring to his line about fate leading Luffy to him.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 526 (p. 16-17) and Episode 423, Jean Goen debuts.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0576 (EX Summit War Arc Vol. 5)).", "elements": []}]}], "images": []}]}