{"sections": [{"title": "Madilloman", "level": 1, "content": [{"type": "paragraph", "text": "Madilloman is a Gifter in the Beasts Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Madilloman is a very large man with a somewhat hunched appearance. He has a long and thin bald head and possesses a long round beard that is consistent in length from one ear to the other. He wears a tiny vest held up by a large buckle that runs across his chest, dark pants, and shoes with a long lining of fur on the tops. Due to his consumption of an armadillo SMILE, he carries an armadillo's shell on his back, with a large tail and small hindlegs being visibly attached on the back."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Madilloman cares little about fighting opponents for the sake of entertainment, as he was ready to end the Sumo Inferno quickly by shooting Luffy immediately."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Madilloman ate an armadillo SMILE, which caused an armadillo's shell to grow on his back. At the back end of the shell is a tail and a very tiny pair of hindlegs, and the armadillo's head and forelegs, which are both disproportionately small, can also appear at the front of the shell. The shell gives Madilloman significant defensive capabilities, and he can make the armadillo use its head and forelegs to cover and protect his face. He can also use his transformation offensively by curling up into a ball and rolling into opponents."}], "images": []}, {"title": "Techniques", "level": 4, "content": [{"type": "list", "elements": [{"text": "Armadi-Guard (アルマジガード, Arumajigādo): Madilloman releases an armadillo head, torso, and forelegs from the back of his neck and uses them to shield his face from an incoming attack. This is called Arma-Defense in the Viz Manga.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Madilloman wields two flintlock pistols which contain Seastone bullets."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the Prisoner Mine's Sumo Inferno to execute Monkey D. Luffy and Hyogoro, Madilloman and his fellow Gifter Alpacaman entered the ring. Madilloman announced his intention to end this soon with his Seastone bullets, and was annoyed when the spectators disapproved. He shot at Luffy and Hyogoro, but Luffy was able to predict his shots and tell Hyogoro where to go to dodge them. Luffy then moved to attack Madilloman, and he shielded his face only for Luffy not to land a blow, much to his confusion. Madilloman then rolled up into a ball and spun toward the two prisoners, but they once again avoided him. Madilloman was eventually punched out of the ring by Luffy."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Madilloman and Alpacaman vs. Monkey D. Luffy and Hyogoro", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 93 Chapter 939 (p. 10-17), Madilloman makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 939 (p. 13).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 10-11).", "elements": []}]}], "images": []}]}