{"sections": [{"title": "Bongo", "level": 1, "content": [{"type": "paragraph", "text": "Bongo is a former lumber dealer who currently lives in Ebisu Town in Wano Country. He formerly lived in the Flower Capital, but was exiled after being swindled by Komurasaki."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bongo is a decrepit, thickset man with messy light hair gathered into a topknot. He wears a dotted kimono with a tattered dark robe over it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bongo is a very corrupt and greedy man, as he worked to create dangerous fires so he could sell lumber to the people who needed to rebuild the burned down buildings."}, {"type": "paragraph", "text": "Bongo took great pride in his wealth, but he is foolish enough to be deceived into giving it all away. He was driven to despair after he was swindled by Komurasaki, leading him to go all the way toward trying to kill the courtesan to avenge his destitution."}, {"type": "paragraph", "text": "He is very unhappy being forced to live in the poverty-ridden Ebisu Town. Despite Tonoyasu's kindness, Bongo remains ungrateful and is hostile toward the town's citizens."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Bongo once had considerable wealth, made from his arson partnership with Bungo and Bingo. However, he lost all of it after being swindled by Komurasaki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When attacking Komurasaki, Bongo wielded a knife. He does not seem to be skilled in using it, though, as he was quickly cut down by Komurasaki's guard."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Thirteen years ago, Bongo was a graverobber alongside Bingo and Bungo. At some point, they attempted to steal from the graves in Ringo, but were stopped by Kawamatsu and Onimaru."}, {"type": "paragraph", "text": "When he lived in the Flower Capital, Bongo worked with the Bungo, who was now an arsonist. When Bungo burned down buildings, Bongo would sell his lumber to the people who needed to rebuild them."}, {"type": "paragraph", "text": "However, Bongo was one day courted by the oiran Komurasaki, who expressed a desire to live with him if he bought her freedom. Bongo gave everything he had to purchase her freedom, only to find out she had spent the money with no intention of being freed, leaving him with nothing."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Komurasaki went to Orochi Castle for the shogun Kurozumi Orochi's banquet, Bongo, Bingo, and Bungo confronted her and attempted to attack her out of revenge for her swindling them. However, they were swiftly cut down by Komurasaki's guard, and left in despair as she degraded them. They were then caught by the Flower Capital's police and exiled from the city for having no money."}, {"type": "paragraph", "text": "Bongo, Bingo, and Bungo were then taken to Ebisu Town, and they were very hostile to the citizens there."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 92 Chapter 928 (p. 8-10,15-18), Bongo makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 4), Bongo's name and information are revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 953 (p. 14), Bongo, Bingo, and Bungo are seen as graverobbers 13 years ago.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 3-4).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 3-5).", "elements": []}]}], "images": []}]}