{"sections": [{"title": "Bungo", "level": 1, "content": [{"type": "paragraph", "text": "Bungo is an arsonist in Wano Country. He currently lives in Ebisu Town. He formerly lived in the Flower Capital, but was exiled after being swindled by Komurasaki."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bungo is an older-looking, decrepit man with some missing teeth. The top of his head is bald, but he has long, flowing dark hair on each side. He wears a light jacket with diamond designs over a light kimono."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As an arsonist, Bungo is a destructive and violent man without morals, as he willingly burned down inhabited buildings and used bribery to cover it up, while working with Bongo and Bingo to make a profit for himself."}, {"type": "paragraph", "text": "Bungo took great pride in his wealth, but he is foolish enough to be deceived into giving it all away. He was driven to despair after he was swindled by Komurasaki, leading him to go all the way toward trying to kill the courtesan to avenge his destitution."}, {"type": "paragraph", "text": "He is very unhappy being forced to live in the poverty-ridden Ebisu Town. Despite Tonoyasu's kindness, Bungo remains ungrateful and is hostile toward the town's citizens."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Bungo once had considerable wealth, which enabled him to do whatever he liked and cover it up by bribing Flower Capital officials. However, he lost all his money by giving it to Komurasaki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When attacking Komurasaki, Bungo wielded a knife. He does not seem to be skilled in using it, though, as he was quickly cut down by Komurasaki's guard."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Thirteen years ago, Bungo was a graverobber alongside Bingo and Bongo. At some point, they attempted to steal from the graves in Ringo, but were stopped by Kawamatsu and Onimaru."}, {"type": "paragraph", "text": "When he lived in the Flower Capital, Bungo engaged in arson and burned down several buildings. He worked with Bingo, who was now a priest, and Bongo, who was now a lumber dealer, to increase their businesses' profits through the fires, and bribed city officials to avoid arrest."}, {"type": "paragraph", "text": "However, Bungo was one day courted by the oiran Komurasaki, who expressed a desire to live with him if he bought her freedom. Bungo gave everything he had to purchase her freedom, only to find out she had spent the money with no intention of being freed, leaving him with nothing."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Komurasaki went to Orochi Castle for the shogun Kurozumi Orochi's banquet, Bungo, Bingo, and Bongo confronted her and attempted to attack her out of revenge for her swindling them. However, they were swiftly cut down by Komurasaki's guard, and left in despair as she degraded them. They were then caught by the Flower Capital's police and exiled from the city for having no money."}, {"type": "paragraph", "text": "Bungo, Bingo, and Bongo were then taken to Ebisu Town, and they were very hostile to the citizens there."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 92 Chapter 928 (p. 8-10,15-18), Bungo makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 3), Bungo's name and information are revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 953 (p. 14), Bungo, Bingo, and Bongo are seen as graverobbers 13 years ago.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 3-4).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 3-5).", "elements": []}]}], "images": []}]}