{"sections": [{"title": "Usakkov", "level": 1, "content": [{"type": "paragraph", "text": "Usakkov is a former prisoner of Impel Down and resident of Newkama Land in Level 5.5. He is one of Emporio Ivankov's dancers."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Usakkov is a lean, tan-skinned man with a thick, curled black mustache, a white beard and a few missing front teeth. He wears a white shirt with a teal bowtie, a red and orange-striped coat, a pair of pink briefs, and stockings that go up to his mid-thigh. He also wears high-heeled boots, round yellow sunglasses, and a large rabbit pelt as a hat."}, {"type": "paragraph", "text": "In the cold, Usakkov wears a thick, red coat with a fluffy collar."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Usakkov%27s_Warm_Coat.png/revision/latest?cb=20190512043751", "caption": "Usakkov in his thick coat."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Usakkov is a jovial person who loves to perform in public. He may not be the most confident off stage, as he and the other newkama were nervous and doubtful of Monkey D. Luffy's health after being poisoned, but he is rather positive, joining with Bentham to cheer for the young pirate after being inspired. Usakkov has a flashy style, offering a chance to escape the Great Prison to Level 4's inmates verbosely, almost as if he were announcing an event."}, {"type": "paragraph", "text": "Usakkov greatly values his friends, and he was sobbing profusely when Bentham sacrificed his freedom to let his fellow convicts escape."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Bentham", "level": 3, "content": [{"type": "paragraph", "text": "Usakkov was inspired by Bentham to believe in Luffy's recovery. He was deeply saddened by Bentham's sacrifice, sobbing profusely."}], "images": []}, {"title": "Monkey D. Luffy", "level": 3, "content": [{"type": "paragraph", "text": "Usakkov chose to put himself in harm's way to help Luffy save his brother. He cares deeply for the young pirate's wellbeing, tearfully shouting to Luffy to hang in as he recovered in Trafalgar Law's submarine."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Usakkov must be a very dangerous individual to be locked in Impel Down. He and Tsunokkov have a unique, tandem fighting style where both wield pistols while Tsunokkov rides on Usakkov's shoulders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/85/Usakkov_and_Tsunokkov_Fight.png/revision/latest/scale-to-width-down/180?cb=20190511081859", "caption": "Usakkov and Tsunokkov fight off the Impel Down guards."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Usakkov wields two pistols in Impel Down.. He wielded a sword and, later, a bazooka at Marineford."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, Usakkov was captured and imprisoned in Impel Down as a criminal. He escaped to Level 5.5 and became a Newkama."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Usakkov performed on stage with Ivankov in Newkama Land after Bentham arrived. He and the others stood next to Ivankov as he spoke to Bentham and fought off Bellett. Ivankov explained \"Newkama\" and Luffy's condition to Bentham, and when Bentham wanted to go to Luffy's room, Usakkov and the others nervously told him not to. Bentham did not listen and went to Luffy's room. They followed Bentham, who shouted encouragements to his friend. Though they initially doubted him, the newkama were inspired by Bentham's calls, and Usakkov and the others began to cheer with him. They all stopped cheering and stared in fear as blood seeped out from underneath the door to Luffy's room. They were all shocked and overjoyed when he woke up, shouting out for food. When Luffy came out of his room, reinvigorated, Bentham passed out, and Usakkov looked on smiling as Luffy pledged his debt to his friend."}, {"type": "paragraph", "text": "Later, Usakkov and the rest of Newkama Land conferred on Level 5 and decided to go along with Ivankov as they helped Luffy break out of Impel Down. Usakkov and Tsunokkov fought together against the prison guards as the group stormed Level 4. Usakkov and his peers unlocked the floors prison cells, offering the inmates a chance to escape and claim their freedom."}, {"type": "paragraph", "text": "Having ascended through the levels to Level 1, the group encountered Magellan. Galdino blocked the warden's poison attacks with his Candle Wall, and Usakkov watched as Galdino told them all to run. The group manages to escape Impel Down, but when Bentham stays behind to open the Gates of Justice, Usakkov and the others cry out for him from their stolen Marine battleship."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2f/Impel_Down_Escapees_Storm_Level_4.png/revision/latest/scale-to-width-down/180?cb=20190512140805", "caption": "Usakkov and the other escapees storm Level 4."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sailing toward Marineford, Usakkov, Tsunokkov, and the other newkama watched over Inazuma, who was injured fighting Magellan. Arriving at Marineford, the group's ship was lifted by a wave that quickly froze. The ice broke, and the group fell to the battle below. When they landed, the group declared their intentions to save Portgas D. Ace. Charging into the fray, Usakkov and the other begin fighting through the Marines."}, {"type": "paragraph", "text": "When Luffy freed Ace from the execution platform, Usakkov watched on in amazement. After Ace was killed by Akainu, Usakkov ran towards the ships as the Whitebeard Pirates and their allies began to retreat. Protecting Luffy, Ivankov and Inazuma were struck by Akainu, and Usakkov and his fellow newkama futilely shot at the admiral as he charged at Jinbe."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bf/The_Alliance_Joins_the_War.png/revision/latest/scale-to-width-down/180?cb=20130722045106", "caption": "Usakkov and the Impel Down escapees join the Battle of Marineford."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the war ended, Usakkov was seen alongside his fellow newkama, excited to travel to Kamabakka Kingdom. As Ivanknov discussed Luffy's injuries with Boa Hancock and Trafalgar Law, Usakkov and another newkama shouted to Luffy to hang in. Ivankov and his newkama followers parted ways with Luffy and the others, sailing on a stolen Marine battleship to Ivankov's homeland."}, {"type": "paragraph", "text": "After arriving on Momoiro Island, Usakkov was among the okama who applauded Ivankov after he made fun of Sanji."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Escaped Impel Down convicts vs. Impel Down guards", "elements": []}, {"text": "Usakkov and the other Newkama vs. Akainu", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Usakkov appeared in Ivankov's One Piece Logbox diorama, posing behind him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d0/OnePieceLogbox-Ivankov.png/revision/latest/scale-to-width-down/180?cb=20131128051346", "caption": "Ivankov and his dancers in a One Piece Logbox diorama."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Usakkov's name is possibly based off usagi (ウサギ, usagi meaning \"rabbit\"), matching his appearance.", "elements": []}]}], "images": []}]}