{"sections": [{"title": "Muchana", "level": 1, "content": [{"type": "paragraph", "text": "Muchana is a doctor who currently works at Impel Down's medical room."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Muchana is a man with black hair who wears an Impel Down uniform that consists of a white suit, garnet gloves, a shirt with the Impel Down symbol on the lapels, and a black tie. Being part of the medical team, he wears a doctor's mask that covers part of his face, and a white cap with a small Impel Down symbol on one side."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Muchana's personality. He is nervous when talking to Hannyabal, possibly for fear of receiving retaliation from a superior."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Muchana possesses some medical experience and seems to know the poisons that the Doku Doku no Mi produces very well."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "In the medical room of Impel Down, Bentham (disguised as Hannyabal) asked him about Luffy's condition after Magellan's attack. He told him it was impossible to create an antidote to counteract multiple poisons from Magellan at once, and there was no way to save him."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is likely a pun on \"mucha na\" (無茶な, \"mucha na\" meaning \"unreasonable\"), referring to the request to cure Luffy's poisoning.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  https://twitter.com/translatosaurus/status/1180545295530119168", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 55 Chapter 536 (p. 2) and Episode 437, Muchana debuts.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0596 (EX Summit War Arc Vol. 6)).", "elements": []}]}], "images": []}]}