{"sections": [{"title": "Francois", "level": 1, "content": [{"type": "paragraph", "text": "Francois is a former prisoner of Impel Down and resident of Newkama Land in Level 5.5."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Francois is a muscular man with fair skin, a very wide neck, a sharp nose, predominant brows, and large veins in his forehead. He has long black hair with sideburns and a high hairline, red lipstick, sunglasses with purple lenses, and a red flower in his hair. He wears a purple shirt with blue polka dots and a pink drawing in front, a black thong, and leggings. He also has a dragon tattoo on his arm with a scar next to it. When he removes his shirt, he wears a seashell bra. He wears a sword holster on his right hip."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Francois_Without_a_Shirt.png/revision/latest/scale-to-width-down/180?cb=20190512022402", "caption": "Francois without his shirt and holding a sword."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Francois is a high-spirited, kind person. He was happy to be partying with the other okamas and showed sympathy by offering a drink to Bentham when he woke up. He cares deeply for his friends and was very upset when Bentham sacrificed himself for the rest of the convicts' sake."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Emporio Ivankov", "level": 3, "content": [{"type": "paragraph", "text": "Like many other newkama, Francois admires his queen, Emporio Ivankov. He was impressed by Ivankov's Death Wink."}], "images": []}, {"title": "Bentham", "level": 3, "content": [{"type": "paragraph", "text": "Francois was quite kind and welcoming to Bentham, treating him as a comrade very soon after meeting him. He was distraught when Bentham sacrificed himself and bawled profusely as he and the rest of the escaped Impel Down convicts passed through the Gates of Justice. He continued to cry on their way to Marineford, referring to Bentham as \"Bon-chan.\""}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Francois must be a very dangerous individual to be locked in Impel Down. Francois was shown among a group of convicts that the Marines recognized as notorious pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Francois wielded a sword while trying to escape from Impel Down."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, François was captured and imprisoned in Impel Down as a criminal. He escaped to Level 5.5 and became a Newkama."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Bentham awoke in Level 5.5 after rescuing Luffy, François and other Newkama greeted him. François offered him a drink. François later watched as Ivankov used his Death Wink on Bellett."}, {"type": "paragraph", "text": "The group organized and mobilized on Level 4, battling through the guards and declaring that they were on their way to Marineford. Francois led the charge, slashing at the guards. They all escaped Impel Down, and Francois cheered for their freedom. When the group realized that Bentham had stayed behind to let them escape, they all cried for him and thanked him. He continued crying as they sailed to Marineford."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2f/Impel_Down_Escapees_Storm_Level_4.png/revision/latest/scale-to-width-down/180?cb=20190512140805", "caption": "Francois and the other escapees storm Level 4."}]}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the group fell from the top of a chunk of ice to Marineford below, Francois raised his sword, ready for battle. They all fought in the battle alongside the Whitebeard Pirates."}], "images": []}, {"title": "Post-War Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the war ended, Francois was seen alongside his fellow newkama, excited to travel to Kamabakka Kingdom. Invakov and his newkama followers parted ways with Luffy and the others, sailing on a stolen Marine battleship to Ivankov's homeland."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Escaped Impel Down convicts vs. Impel Down guards", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "When the Impel Down escapees storm Level 4 in Episode 444, Francois' appearance is changed. He has a tanner complexion and appears with a skin-shaved haircut instead of his typically long hair."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}]}