{"sections": [{"title": "Tsunokkov", "level": 1, "content": [{"type": "paragraph", "text": "Tsunokkov is a former prisoner of Impel Down and resident of Newkama Land in Level 5.5. He is one of Emporio Ivankov's dancers."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tsunokkov is a lean man with a round nose, a missing front tooth, and a thin black mustache. He also has prominent cheekbones and wears pink lipstick. He wears a deer-themed leotard that has shaggy fur, a face, and horns. He also wears sunglasses, fishnet leggings, and high-heeled boots."}, {"type": "paragraph", "text": "In the manga, the horns of his leotard have six points each and look more like real antlers. In the anime, they have fewer points and look more like Tony Tony Chopper's horns."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Tsunokkov is a jovial person who loves to perform in public. He trusted Bentham and Monkey D. Luffy enough to join them in escaping Impel Down and saving Portgas D. Ace, and he was grateful to Luffy for allowing him and his comrades to escape."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Tsunokkov must be a very dangerous individual to be locked in Impel Down. He and Usakkov have a unique, tandem fighting style where both wield pistols while Tsunokkov rides on Usakkov's shoulders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/85/Usakkov_and_Tsunokkov_Fight.png/revision/latest/scale-to-width-down/180?cb=20190511081859", "caption": "Tsunokkov and Usakkov fight off the Impel Down guards."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Tsunokkov used two pistols when fighting with Usakkov. He was later seen in Impel Down with a rifle, but he was not shown using it. He wielded a sword at Marineford."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, Tsunokkov was captured and imprisoned in Impel Down as a criminal. He escaped to Level 5.5 and became a Newkama."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Tsunokkov performed on stage with Ivankov in Newkama Land after Bentham arrived. He and the others stood next to their Queen as she spoke to Bentham and fought off Bellett. Ivankov explained \"Newkama\" and Luffy's condition to Bentham, and when Bentham wanted to go to Luffy's room, Usakkov and the others nervously told him not to. Tsunokkov and the other newkama cheered with Bentham for Luffy and were nervous when blood trickled out of the room and Luffy tried to break down the door. Tsunnokov and the others cheered in relief when the young captain called out for food."}, {"type": "paragraph", "text": "Later, the residents of Newkama Land conferred on Level 5 and decided to go along with Ivankov as they helped Luffy break out of Impel Down. Tsunokkov and Usakkov fought together against the prison guards as the group stormed Level 4. After Hannyabal joined the battle against the escapees, Tsunokkov witnessed Blackbeard crush the vice-warden under his foot. Magellan intercepted Blackbeard, poisoning him and his crew, and Tsunokkov and the other fled up the stairs to Level 3."}, {"type": "paragraph", "text": "The group made it out of Impel Down and onto a Marine battleship they seized. Tsunokkov stood on the ship's deck and watched as Luffy spoke to Bentham over Den Den Mushi, the latter of whom stayed in the prison to open the Gates of Justice for his friends."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2f/Impel_Down_Escapees_Storm_Level_4.png/revision/latest/scale-to-width-down/180?cb=20190512140805", "caption": "Tsunokkov and the other escapees storm Level 4."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sailing toward Marineford, Tsunokkov, Usakkov, and the other newkama watched over Inazuma, who was injured fighting Magellan. Arriving at Marineford, the group's ship was lifted by a wave that quickly froze. The ice broke, and the group fell to the battle below. When they landed, the group declared their intentions to save Portgas D. Ace. Charging into the fray, Tsunokkov and the other begin fighting through the Marines."}, {"type": "paragraph", "text": "Afterwards, he fought in the war at Marineford and, after the war concluded, he and the rest of his Newkama Land comrades saw Luffy off at Amazon Lily and returned with Ivankov to Kamabakka Kingdom."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bf/The_Alliance_Joins_the_War.png/revision/latest/scale-to-width-down/180?cb=20130722045106", "caption": "Tsunokkov and the Impel Down escapees join the Battle of Marineford."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the war ended, Tsunokkov was seen alongside his fellow newkama, excited to travel to Kamabakka Kingdom. Ivankov and his newkama followers parted ways with Luffy and the others, sailing on a stolen Marine battleship to Ivankov's homeland."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Escaped Impel Down convicts vs. Impel Down guards", "elements": []}, {"text": "Escaped Impel Down convicts vs. Marines", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tsunokkov's name is likely based off tsuno (角, tsuno meaning \"horn\"), matching his appearance.", "elements": []}]}], "images": []}]}