{"sections": [{"title": "Shimotsuki Yasuie", "level": 1, "content": [{"type": "paragraph", "text": "Shimotsuki Yasuie, also known as \"Yasu the Hedgehog\", Tonoyasu, or just Yasu (ヤス, Yasu), was a member of the Shimotsuki Family, and a taikomochi who lived in Ebisu Town near the capital of Wano Country. He was the father of Toko."}, {"type": "paragraph", "text": "Back when the Kozuki Family ruled over Wano Country, Yasuie served as the daimyo of Hakumai. Twenty years after Kurozumi Orochi's takeover of Wano, Yasuie sacrificed himself in an effort to mislead the shogun's forces and enable Kozuki Momonosuke's revolution to continue."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yasuie was a thin short man with a thick spherical head. He had tiny blush marks on his cheeks, stubble around his mouth, and a thin mustache on his upper lip. Like the other residents of Ebisu Town, he was always smiling due to having consumed a faulty SMILE Devil Fruit. His epithet came from how his thick blue afro spiked out like hedgehog spines. Kanjuro and Shinobu did not recognize him until they saw it. As Tonoyasu, his hair was covered by a bandana with purple polka-dots and tied in a top knot. He wore an orange kimono with stitched patches and waraji sandals."}, {"type": "paragraph", "text": "Over 25 years ago, Yasu's face was much cleaner and less spherical; he wore a dotted kimono with a dark robe over it. He also appeared to be much taller than he was in the current storyline."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Due to eating a failed SMILE, Yasuie was always shown smiling. He was very easily excited, as he gushed over Zoro's accomplishments and showered the swordsman with compliments. He could also be self-deprecating, as he did not object when Zoro accidentally referred to him as \"Kasu\" (trash) instead of \"Yasu\"."}, {"type": "paragraph", "text": "Though eccentric, carefree, and fun loving, Yasuie was extremely kind and compassionate, using the money his daughter earned to support the citizens of Ebisu Town, providing provisions to those who are too sick and injured even if it means starving himself. He enjoyed helping people, even those as amoral as Bingo, Bongo, and Bungo. His friendly and compassionate personality gave him a strong charisma, as when he joined the conversation with Kanjuro and Shinobu about the rebellion, neither of them brought up the fact that they did not know who he was."}, {"type": "paragraph", "text": "According to Shinobu, he was a strict man in the past, but lost much of that attitude over the last 20 years. He took his position as daimyo extremely seriously, especially when it came to protecting the Habu Port. In much of the same way, he expected Kozuki Oden to devote his time proving himself as Sukiyaki's heir. He was also extremely generous as not only did he gave away all the money the Nine Red Scabbards tried to steal, he also gave them extra money to them and encouraged them to buy books to educate themselves for the sake of supporting Oden. He was also perceptive as he did not quickly believe Orochi's claim that Oden stole money from him, knowing that Oden was not the kind of person who would hide his misdeeds."}, {"type": "paragraph", "text": "Yasuie was proud of his deeds as Tonoyasu. With his last breath, he declared to die not as a daimyo of the Kozuki Family but as a fun-loving jester of Ebisu Town."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4b/Yasuie%27s_Compassion.png/revision/latest/scale-to-width-down/210?cb=20190603212721", "caption": "Yasuie showing his compassion."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Toko", "level": 4, "content": [{"type": "paragraph", "text": "Toko is Yasuie's daughter. Although the two were separated after Yasuie sold her to the Flower Capital, they maintained a close bond, with Toko giving Yasuie her earnings from her work. When news about his capture and planned execution reach her, she ran to the Flower Capital, despite being targeted by the shogun. Right before his execution, one of his last thoughts was an apology to Toko for leaving her behind."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Kozuki Family", "level": 4, "content": [{"type": "paragraph", "text": "Yasuie is a strong supporter of the Kozuki Family, so much so, that he was even willing to lay down his life on the line just to be of help to them. Even when the title of shogun was rumored to be going to him by the time of Sukiyaki's death, he acted against it because he firmly believed that only the Kozuki Family should be the ones to have such power. He even disciplined Oden while he was under his care, to make the late daimyo take responsibility of becoming the next shogun seriously. As a result, he believes that Oden's son, Momonosuke, will be the future shogun. He also stood along the other four daimyos in standing up against Orochi to show their disgust against the shogun’s cowardly ways of claiming his title. After witnessing his demise, Oden's daughter Hiyori had broken down in tears."}, {"type": "paragraph", "text": "Yasuie held very high expectations for Oden, believing he would be the future shogun, and was very strict with him, beating Oden whenever he tried to disregard his responsibility as Sukiyaki's heir. While Yasuie was not against Oden's desire to set sail and traveling overseas, he believed Oden could only do so after he proved himself a great samurai."}], "images": []}, {"title": "Ninja-Pirate-Mink-Samurai Alliance", "level": 4, "content": [{"type": "paragraph", "text": "Yasuie is a loyal supporter of the Kozuki Family, and stood by Oden during the Beasts Pirates' takeover of Wano Country 20 years ago. When he came across the secret message Kin'emon sent, he showed his willingness to join the fight to Kanjuro's group immediately. At the time neither Shinobu nor Kanjuro could recognize him and felt awkward to mention that, but when his hair was exposed at his execution site, they realized who he was.  Kanjuro also regretted not realizing his identity sooner when he was executed and called his death a grave mistake."}, {"type": "paragraph", "text": "Despite not knowing their connection to the Kozuki Family, he provided shelter to Law and the Straw Hat Pirates in his home in Ebisu Town. When the masses started laughing and crying at Yasuie's death, Zoro was furious and tried to stop them, believing it was an insult. After Zoro and Sanji started a commotion, the Straw Hats present at Rasetsu Town retrieved Yasuie's body so he would not be left on display."}], "images": []}, {"title": "Nine Red Scabbards", "level": 4, "content": [{"type": "paragraph", "text": "The Nine Red Scabbards once tried to steal money from him during their youth. Despite his first impression of them as a bunch of odd people, Yasuie gave away all the money they tried to steal after confirming their loyalty to Oden while also gave them extra money to buy books to educate themselves, encouraging them to learn knowledge and wisdom in order to effectively support Oden. Thus, the Nine Red Scabbards held immense respect for Yasuie."}, {"type": "paragraph", "text": "When Yasuie reunited with them, he assured them that he would help them, even though they didn't recognize him. However, when he was captured and his hair style restored, they realized who he was and watched as he gave up his life in order to misdirect Orochi's forces into believing that the rebellion's symbol was nothing more than a prank.Kin'emon tearfully expressed his gratefulness of the former daimyo's sacrifice. After his death, most of the members of the Nine Red Scabbards who saw his execution were tearfully heartbroken, with Kanjuro voicing his regret of being unable to save the former daimyo to the point of willing to commit Seppuku. Even Ashura who has distanced himself from the Kozuki Family's revolution is noticably distraught over his death. This made him decide to rejoin his team. Out of respect for Yasuie, Kanjuro took it upon himself to give him a burial."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/14/Nine_Red_Scabbards_Mourn_Yasuie.png/revision/latest/scale-to-width-down/180?cb=20190605192512", "caption": "Having been indebted to Yasuie, the witnessing members of the Nine Red Scabbards mourn Yasuie's death."}]}, {"title": "Ebisu Town", "level": 4, "content": [{"type": "paragraph", "text": "Yasuie has taken upon himself to care for the poor residents of Ebisu Town, going from door to door to see if they needed help, giving his own food rations if he deems necessary. He has shown kindness to anyone, from the old and sick to the young and playful. Because of his kindness, he was beloved by the town's residents and they were devastated when he was executed."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Kurozumi Orochi", "level": 4, "content": [{"type": "paragraph", "text": "41 years ago, Orochi was a servant to Yasuie and the former was subservient to the latter."}, {"type": "paragraph", "text": "Yasuie holds incredible hatred against Orochi, wanting to deliver a message and calling him \"stupid\" as a final request. During his execution, Yasuie viciously insulted Orochi for his cowardice and greed, referring him as a pest. With a last act of defiance against Orochi, Yasuie took the blame for the captured alliance members and humiliated Orochi in front of the whole kingdom by showcasing his cowardly and paranoid behavior about the Kozuki Family's return."}], "images": []}, {"title": "Others", "level": 3, "content": [], "images": []}, {"title": "Flower Capital", "level": 4, "content": [{"type": "paragraph", "text": "When he was captured and his identity revealed, the capital residents showed their support and gathered to ask for his release, showing their love for the former daimyo."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the daimyo of Hakumai, he had control over the region and its inhabitants until he lost the position. In the present day, he showed himself to be very conniving and well-spoken, tricking authorities into believing he was Ushimitsu Kozo in order to give himself a platform to trick Orochi and forces."}, {"type": "paragraph", "text": "After eating a failed SMILE, Yasuie lost his ability to swim."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Kozuki Sukiyaki ruled over Wano Country, Yasuie served as daimyo of Hakumai. 41 years ago before Kozuki Oden's exile from the capital, he took in Kurozumi Orochi as a servant. After Oden was exiled, Yasuie allowed him to stay at his residence in Hakumai. Yasuie later got mad at Oden for living as a vagabond instead of rising to his father Sukiyaki's challenge. Oden told Yasuie how he wanted to set out to sea, and Yasuie replied that he had to become a competent samurai before he could be so selfish. Oden eventually decided to journey to Kuri, and Yasuie was amazed at the mess Oden made in his room. Orochi claimed that Oden stole money before leaving, but Yasuie suspected otherwise. He was impressed with Oden after receiving the news of him bringing order to Kuri."}, {"type": "paragraph", "text": "Sometime after the Nine Red Scabbards were assembled, Yasuie caught them stealing money from him. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Oden and Wano."}, {"type": "paragraph", "text": "20 years ago, Kurozumi Orochi came into power, and after executing Oden and his family, he approached Yasuie and the three other daimyo and gave them the choice to submit to him. The daimyo all refused, and they and their samurai mounted a fight, but were defeated by Kaido of the Yonko."}, {"type": "paragraph", "text": "Yasuie managed to survive, and took on the name Tonoyasu and resided in Ebisu Town. At some point in time, Yasuie and the Ebisu Town residents had their emotional expressions stripped away by eating defective SMILE fruits, letting them only smile. He had a daughter named Toko with an unnamed woman, but at some point, he sold Toko to the Flower Capital. Toko sent him money, which he used to support the people of Ebisu Town."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Yasuie saw the swordsman Roronoa Zoro and decided to follow him, having a good feeling about him and paying for some sushi for him to eat. He believed his decision vindicated when Zoro earned a lot of money gambling and took out some members of the Kyoshiro Family when they decided to stop him. Yasuie gushed over Zoro's accomplishments as they walked toward Ebisu Town, a leftovers town near the Flower Capital that Yasuie was from. After arriving at the town, Yasuie introduced Zoro to the people living there."}, {"type": "paragraph", "text": "He later met Trafalgar Law, Usopp, and Franky after Zoro left to recover a stolen sword. After hearing that they were friends of Zoro, Yasuie invited them to his house and informed them that they just missed Zoro."}, {"type": "paragraph", "text": "As Shinobu, Law, and Kanjuro argued over what to do about the captured Heart Pirates, Yasuie entered and showed them a copy of Kin'emon's secret message and talked about the rumors swirling around the Flower Capital, wondering if the final battle was at hand. After telling Kanjuro and Shinobu that he wished to join them, he went around Ebisu Town, helping those in need."}, {"type": "paragraph", "text": "Before midnight that night, Yasuie went into the Flower Capital to commit robberies in order to pose as Ushimitsu Kozo. He was caught by Orochi's forces, who believed his confession that he was Ushimitsu Kozo. He was taken to the Rasetsu Town prison in the Flower Capital the next morning to be crucified, and he was happy to see that the crowds gathered around him knew who he was. He spoke to Orochi, saying that the Kozuki Family built everything good in Wano and that the current shogun had only ruined it. He then lied that he created the Kozuki Family's secret message as a childish prank, and that the crescent moon symbol that resulted in Orochi making dozens of arrests was a common, unrelated design. As Orochi approached the execution platform, Yasuie cursed him and eagerly anticipated the return of the Kozuki Family. He was then shot multiple times and killed by Orochi and his forces."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/70/Yasuie_is_Killed.png/revision/latest/scale-to-width-down/210?cb=20190513184905", "caption": "Yasuie is shot and executed by Orochi and his forces."}]}, {"title": "Postmortem", "level": 3, "content": [{"type": "paragraph", "text": "As Zoro and Sanji started a commotion by protecting Toko from Orochi, Franky retrieved Yasuie's body while fighting off the shogun's forces because of Shinobu's request to not allow his body to used on display by the enemy."}, {"type": "paragraph", "text": "The alliance took Yasuie's body back to Ebisu Town and Kanjuro promised to give him a burial in Kuri. A grave was later made for him."}], "images": []}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "Yasuie was able to cause significant doubt in the Rasetsu prison guards, leading them to believe the crescent moon symbol signifying loyalty to the Kozuki Family was insignificant and that Orochi was mistaken in arresting people who bore it. Yasuie secretly bought more time for Kin'emon and the Nine Red Scabbards, Momonosuke, and their allies who are against Orochi a new gathering place to start off a new plan. However, Orochi still refused to release the prisoners, not wanting to admit he made a mistake. Yasuie's death has greatly angered Zoro to the point that he would go after Orochi in revenge. Ashura Doji, who wanted to distance himself with the Kozuki Family, decided to rejoin his comrades to take down Kaido."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yasuie's name may come from Tokugawa Ieyasu, the first shogun of the last feudal shogunate in Japan.", "elements": []}, {"text": "Yasuie's appearance (as Tonoyasu) might be based on a popular Hyottoko mask.", "elements": []}, {"text": "A taikomochi is a male geisha.", "elements": []}, {"text": "The method he was killed, crucifixion and then fire squad, resemble the old Japan's crucifixion ritual.", "elements": []}]}], "images": []}]}