{"sections": [{"title": "Sukoshiba Kanishitoru", "level": 1, "content": [{"type": "paragraph", "text": "Sukoshiba Kanishitoru is a guard working in Impel Down."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kanishitoru is a man of average height and brown hair. He wears sunglasses and a cold-resistant version of the standard guard uniform."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Since Kanishitoru was not willing to endure the cold of Level 5 just to imitate Hannyabal's custom, it can be inferred that, in comparison to Hannyabal, he is lacking in boldness."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Hannyabal", "level": 3, "content": [{"type": "paragraph", "text": "Kanishitoru respects Vice Warden Hannyabal for his custom of entering Level 5 without a coat or weapons."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kanishitoru carries a standard guard rifle. It is unknown how proficient he is in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 3, "content": [{"type": "paragraph", "text": "Kanishitoru and two other guards escorted Hannyabal (in truth Bentham in disguise), Buggy and Galdino from Level 4 to Level 5. On the way down, the disguised Bentham inquired about what happened to Emporio Ivankov, to which the guards recounted the rumors of \"demoning away\" within the prison. Once they reached the entrance, Kanishitoru took away \"Hannyabal's\" coat and weapons, praising him for having the ability to endure the cold every time he entered the Freezing Hell."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kanishitoru's name is a pun on \"Sukoshi baka ni shitoru\" (少し馬鹿にしとる, \"Sukoshi baka ni shitoru\" Meaning \"making fun of him a little\").", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  https://twitter.com/translatosaurus/status/1180547218425577472", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 55 Chapter 536 (p. 4-6) and Episode 437, Sukoshiba Kanishitoru makes his debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0621), Kanishitoru's name is revealed.", "elements": []}]}], "images": []}]}