{"sections": [{"title": "Zabo", "level": 1, "content": [{"type": "paragraph", "text": "Zabo was a man that illegally trespassed into Upper Yard and was subsequently punished by Enel during his escape."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Zabo was an average man with gold circular earrings and an orange headband wrapped around his shaggy red dreadlocks. He wears a white shirt and dark purple shorts, that have been dirtied and ripped during his escape from the priests, and was barefoot. He also carried a dagger by his hip that is held up by a sash going across his left side."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Being no match for the priests chasing him, Zabo displayed fear towards them, showing that he is scared of those with the power to kill him."}, {"type": "paragraph", "text": "In the anime, he is shown to be somewhat vicious, as he threatened to kill Nami if she did not let him aboard her waver."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "In comparison to the priests, Zabo is no match for either of them, let alone all four of them attacking him at once. He is, however, equipped with a dagger, but it is unknown whether he was proficient at using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Skypiea Arc", "level": 3, "content": [{"type": "paragraph", "text": "Zabo was running in fear from Ohm while screaming for help as the latter was chasing him through the forest of Upper Yard. Suddenly, Ohm blew a whistle sound, causing Zabo to turn around and pause in fear of something attacking him from behind. However, the whistle ended up calling out to Ohm's dog, Holy, who swept in from behind Zabo after he had turned around. Holy was about to bite down on him, but he was saved by Shura, who had wanted to kill Zabo himself. Zabo then continued running away from Shura and his bird, Fuza."}, {"type": "paragraph", "text": "As Ohm, Shura, and Satori fought over killing him, a guerilla fired a bazooka shot at the three priests, allowing Zabo to reach the edge of Upper Yard. A bloodied and injured Zabo then noticed Nami and called out to her for help, begging her to let him aboard her waver and agreeing to repay her in any way possible. He then noticed the guerilla behind Nami before being engulfed by Enel's divine punishment, leaving no trace of him behind."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1e/Zabo_Attacked_by_Shura.png/revision/latest/scale-to-width-down/210?cb=20190612055144", "caption": "Zabo is attacked by Shura."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Zabo_Engulfed_by_Light.png/revision/latest/scale-to-width-down/210?cb=20190612054724", "caption": "Zabo is incinerated by Enel's punishment."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "While the manga shows Zabo running away while being surrounded by Shura and Satori, it does not depict him tripping during his escape unlike in the anime. Furthermore, the anime subsequently depicts him lying on the ground in fear while the four priests argue over who gets to kill him. Neither him being surrounded while fallen nor Gedatsu's presence during the chase is depicted in the manga (Gedatsu is only seen after Zabo is incinerated by Enel). Likewise, his encounter with Nami is changed in the anime, in which he explains that he came from another Sky Island to search for treasure and even took out his dagger and threatened to kill Nami if she did not help him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/54/Zabo_Threatens_to_Kill_Nami.png/revision/latest/scale-to-width-down/200?cb=20190612054747", "caption": "Zabo threatens to kill Nami."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Zabo's name has not been revealed in the manga; however, it was revealed in the credits of Episode 155 and his concept art.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f9/Zabo_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20190612060723", "caption": "Zabo's concept art."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 26 Chapter 241 and Episode 155, Zabo is introduced.", "elements": []}, {"text": "↑  One Piece Anime — Episode 155, Zabo's name is revealed in the episode credits.", "elements": []}, {"text": "↑  One Piece Anime — Episode 155, Zabo's role in the anime is slightly changed.", "elements": []}]}], "images": []}]}