{"sections": [{"title": "Seki", "level": 1, "content": [{"type": "paragraph", "text": "Seki is the king of Lulusia Kingdom and one of fifty monarchs who took part in the Levely. He is the father of Princess Komane."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Seki is a man with a pronounced jawline with sharp teeth, pointed ears, and long dark-blond hair that is combed back. In the manga, he wears a dark cape over a dark suit with light-colored cravat and rose boutonniere, whereas, in the anime, he wears a purple shirt with a thick white collar, alongside a dark purple cape and white gloves."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Seki is known as a cruel ruler whose regime contributed to the suffering of his people. Even though the commoners could barely make ends meet, he still forced them to provide him and the World Nobles with tributes. On the other hand, he, at the very least, cares greatly about his family, as evidenced by his daughter's claim that her father would pay any amount of ransom to keep her safe."}, {"type": "paragraph", "text": "Furthermore, Seki appears to be somewhat pompous as he seemed to be skeptical that a region unaffiliated with the World Government, such as the Wano Country, could even be considered a nation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Seki is the king of a nation affiliated with the World Government and one of the few allowed to attend the Levely, which grants him some authority over matters concerning the world."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Four years ago, Seki's kingdom was ravaged by pirates, but with the aid of then Admiral Akainu, the pirates were captured and sent to Impel Down, saving his kingdom from destruction."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "While on their way to the Levely, the Lulusia Kingdom's ship was attacked by pirates. Seki was able to make it out safe, but his daughter was kidnapped and held for ransom."}, {"type": "paragraph", "text": "Seki later made it to the Levely where he was seated between Queen Lemoncheese and King Potaufeu. He discussed the matter of Wano Country with Lemoncheese before the meeting began."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Seki and Lemoncheese are only seen having a short conversation about Wano. However, the anime expands this conversation and also discusses a little about Seki's kingdom, establishing through his conversation with Lemoncheese that he has held the throne of his kingdom for at least four years. Additionally, other monarchs, such as Potaufeu and Samosa, also joined in on their conversation."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His design seems to be based on classic vampires such as Count Dracula.", "elements": []}, {"text": "Seki's name was first revealed in the anime credits of Episode 889, alongside other monarchs unnamed in the manga.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 (p. 11-13) and Episode 889, Seki attends the Levely.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 94 (p. 134), Oda talks about Lulusia Kingdom's royalty.", "elements": []}, {"text": "↑  One Piece Anime — Episode 889, Seki is named in the captions and credits.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 904 (p. 5), Seki is revealed to have demanded offerings from his citizens.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 903 (p. 8) and Episode 879, The Lulusia Kingdom's ship is mentioned to have been attacked.", "elements": []}, {"text": "↑  One Piece Anime — Episode 889, Seki's role is expanded in the anime.", "elements": []}]}], "images": []}]}