{"sections": [{"title": "Lemoncheese", "level": 1, "content": [{"type": "paragraph", "text": "Lemoncheese is a queen and one of fifty monarchs who took part in the Levely."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lemoncheese is a woman with sharp facial features, thick pointy nose, and angular eyebrows. Her dark blond hair is tied into a bun that curves upward behind her head except for a thin sidelock that curls at her cheek."}, {"type": "paragraph", "text": "She wore a dark purple top under a green coat with light green floral patterns and white fur trim."}, {"type": "paragraph", "text": "In the anime, she was initially depicted as a brunette with red lipstick and purple coat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f1/Lemoncheese_Initial_Color_Scheme.png/revision/latest/scale-to-width-down/140?cb=20190616224404", "caption": "Lemoncheese's initial color scheme in the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Lemoncheese's personality. She does not seem to despise fish-men or merfolk, as shown when she socialized with King Neptune."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Lemoncheese is the queen of a nation affiliated with the World Government and one of the few allowed to attend the Levely, which grants her some authority over matters concerning the world."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Right before the Levely, Lemoncheese introduced her two children to King Neptune at the Socializing Plaza inside Pangaea Castle. She later attended the beginning meeting of the Levely where she was seated next to King Seki, with whom she discussed the matter of Wano Country."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Lemoncheese's role is expanded, such that her conversation with Seki is joined in by other monarchs expressing their own views. Furthermore, the anime establishes that Lemoncheese has known Seki for at least four years, since the latter discussed matters of his kingdom with her four years ago."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Lemon cheese is another name for lemon curd, a thick preserve made from lemons, egg yolk, butter and sugar.", "elements": []}, {"text": "Lemoncheese's name is not revealed in the manga, but is, instead, revealed in the anime credits of Episode 889, alongside other monarchs unnamed in the manga.", "elements": []}, {"text": "Lemoncheese's color scheme is changed in the anime from her initial appearance at the Socializing Plaza to her most recent appearance at the first Levely meeting. It remains unknown if this was an intentional change or a mistake, as the change occurred over the span of only five episodes.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 906 (p. 6) and Episode 884, Lemoncheese makes her debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 (p. 11-13) and Episode 889, Lemoncheese attends the Levely.", "elements": []}, {"text": "↑  One Piece Anime — Episode 889, Lemoncheese is named in the captions and credits.", "elements": []}, {"text": "↑  One Piece Anime — Episode 889, Lemoncheese's role is expanded in the anime.", "elements": []}]}], "images": []}]}