{"sections": [{"title": "Tea IV", "level": 1, "content": [{"type": "paragraph", "text": "Tea IV is a king and one of fifty monarchs who took part in the Levely."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tea IV is a man with light blue eyes, long blond hair, a long dark brown handlebar mustache and on his thick chin is a thin goatee that resembles clock hands."}, {"type": "paragraph", "text": "He wears rectangular glasses with a black frame and a dark blue bowler hat with a design resembling the Union Jack."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Tea IV's personality. He seems to be well-mannered as he greeted the chairman of the Levely."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Tea IV is the king of a nation affiliated with the World Government and one of the few allowed to attend the Levely, which grants him some authority over matters concerning the world."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "Sometime before the Levely, Tea IV was one of the monarchs who were seen gathering at Mary Geoise."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Tea IV later attended the beginning meeting of the Levely where he greeted the current chairman, Ham Burger."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name may be a reference to how tea is prominent in British culture and society. The design on his hat resembles the Union Jack, and his goatee resembling clock hands may be referring to the famous Big Ben.", "elements": []}, {"text": "Tea IV's name is not revealed in the manga nor in the anime credits like Ban Dedessinée was, but was instead revealed in the captions of Episode 889.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 82 Chapter 823 (p. 8) and Episode 777, Tea IV makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 (p. 12-13) and Episode 889, Tea IV attends the Levely.", "elements": []}, {"text": "↑  One Piece Anime — Episode 889, Tea IV is named in the captions.", "elements": []}]}], "images": []}]}