{"sections": [{"title": "Jeep", "level": 1, "content": [{"type": "paragraph", "text": "Jeep is a king and one of fifty monarchs who took part in the Levely."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jeep is a slightly stocky man with thick lips, high cheekbones, small ears, small eyes, and a high forehead with a mole on the right side. His dark orange hair is pulled up to his small gold crown."}, {"type": "paragraph", "text": "He wore a pale yellow coat with a yellow patterned borders over a charcoal gray button-up shirt and a red bow tie. He also has a dark purple sash with light purple borders hanging from his right shoulder across his torso."}, {"type": "paragraph", "text": "In the anime, he was initially depicted with a gray pompadour and didn't have a mole on his forehead. His outfit was changed into a purple suit with a white shirt and a red necktie during the Levely meeting."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Jeep_Initial_Color_Scheme.png/revision/latest/scale-to-width-down/210?cb=20190616224309", "caption": "Jeep’s initial color scheme in the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like many, Jeep admired the mermaid princess because of her beauty and tried to get his son acquainted with her. He can be easily offended as he got angry when Shirahoshi rejected her suitors. In the anime, he took part in the discussion about Luffy's journey to Wano Country, and asked whether there is something the royals should do in the matter, showing that he cares greatly for world matters."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Jeep is the king of a nation affiliated with the World Government and one of the few allowed to attend the Levely, which grants him some authority over matters concerning the world."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "At the Socializing Plaza, Jeep tried to set up his son with Shirahoshi, but was interrupted by another king also trying to introduce his son to the Mermaid Princess. However, the latter rejected all her suitors, causing Jeep to express that she had made them lose face, leading to Fukaboshi hurriedly trying to calm the royals to avoid further hurting them and starting an incident. When the Levely began, he was seated next to Dalton."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Upon hearing Seki, Lemoncheese, and Potaufeu discuss the matter of Wano Country and Monkey D. Luffy, Jeep asked if there was anything that could be done to prevent another incident."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Unlike in the manga, Jeep is seen conversing with the other royals before Ham Burger called the meeting into session in the anime."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name may be based on the American automobile brand Jeep.", "elements": []}, {"text": "Jeep's name is not revealed in the manga nor in the anime credits like Seki or Lemoncheese were, but was instead revealed in the captions of Episode 889.", "elements": []}, {"text": "Jeep's color scheme is changed in the anime from his initial appearance at the Socializing Plaza to his most recent appearance at the first Levely meeting.", "elements": []}, {"text": "In his first anime appearance in Episode 884, he was voiced by Yasunori Masutani and credited as the \"White Clothes King.\" However, in his latest appearance in Episode 889, Jeep's voice actor was not credited even though the character had a speaking role.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 906 (p. 7) and Episode 884, Jeep introduce his son to Shirahoshi.", "elements": []}, {"text": "↑  One Piece Anime — Episode 889, Jeep is named in the captions and credits.", "elements": []}]}], "images": []}]}