{"sections": [{"title": "Samosa", "level": 1, "content": [{"type": "paragraph", "text": "Samosa is a king and one of fifty monarchs who took part in the Levely."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Samosa is an average sized man with blond hair. He has a long face, sunken cheeks, and thick lips. He wears a black suit, white shirt, and purple tie."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Samosa took part in the discussion about Monkey D. Luffy's journey to Wano Country, and when the question about the World Government's possible action was brought up, he mentioned the high price for sending in the Marines, showing a reserved and calculated attitude."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Samosa is the king of a nation affiliated with the World Government and one of the few allowed to attend the Levely, which grants him some authority over matters concerning the world."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Samosa attended the Levely where he was seated next to Lemoncheese."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "When Jeep asked what could be done about the matter of Wano Country and Monkey D. Luffy after the topic was brought up by Potaufeu, Seki and Lemoncheese before the meeting began, Samosa commented on how sending the Marines to Wano would be costly, implying to Jeep that that would not be an ideal solution."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Samosa is only seen listening on as Ham Burger called the meeting into session. However, the anime expands his role with him conversing with other monarchs before the meeting began. The manga does not show who expressed worries about the cost of deploying the Marines, but the anime explicitly shows Samosa raising this problem. Furthermore, Samosa is not named in the manga."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Samosa's appearance somewhat resembles the United States' 45th president, Donald Trump.", "elements": []}, {"text": "A samosa is a fried or baked dish with a savory filling.", "elements": []}, {"text": "Samosa's name is not revealed in the manga, but is, instead, revealed in the anime credits of Episode 889, alongside other monarchs unnamed in the manga.", "elements": []}]}], "images": []}]}