{"sections": [{"title": "Ramen", "level": 1, "content": [{"type": "paragraph", "text": "Ramen is the king of the Kano Country and one of fifty monarchs who took part in the Levely."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ramen is a man with a tall bald head that has a Chinese dragon tattooed on the left side. He also has a square jaw and black Fu Manchu mustache."}, {"type": "paragraph", "text": "He wears a green Yuanlingshan with white collar and cuffs. He wears a thick metal chain as a necklace and his eyes are covered by small circular sunglasses. He also wears a small Qing Guanmao atop his head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ramen is interested in the well-being of his nation and global matters, as he had many topics he wanted to discuss at the Levely. He seems to be tactical as he sent the Chinjao Family on a secret mission to stop the trade of weapons that was helping enemy nations of the Kano Country."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Ramen is the king of a nation affiliated with the World Government and one of the few allowed to attend the Levely, which grants him some authority over matters concerning the world."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "Ramen sent the Chinjao Family of the Happo Navy to Dressrosa on a mission to stop Doflamingo's weapon trade, which had been providing weapons to enemy nations warring with the Kano Country."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the defeat of Doflamingo, Ramen awaited the return of the new leader of the Happo Navy, Sai. He remarked that the wars had ended and the country would be able to attend the Levely."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Ramen later attended the beginning meeting of the Levely and noted that there were countless topics to discuss."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ramen is a dish that uses Chinese-style wheat noodles, which fits the China theme of the Kano Country.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 82 Chapter 823 (p. 8) and Episode 777, Ramen makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 (p. 12-13) and Episode 889, Ramen attends the Levely.", "elements": []}, {"text": "↑  One Piece Anime — Episode 889, Ramen is named in the captions.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 73 Chapter 726 (p. 7) and Episode 658, Sai and Boo reveal their true motives for competing in the colosseum.", "elements": []}]}], "images": []}]}