{"sections": [{"title": "Potaufeu", "level": 1, "content": [{"type": "paragraph", "text": "Potaufeu is a king and one of fifty monarchs who took part in the Levely."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Potaufeu is an average size man with short brown hair and goatee, and light stubble. His face is long and somewhat wrinkled with thick jaw and lips. His droopy eyes gives him a sleepy expression."}, {"type": "paragraph", "text": "He wears a purple and yellow striped coat with pale yellow fur collar and cuffs over a white turtleneck. He also wears a rectangular gold crown."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Potaufeu seems to take interest in rumors regarding major events and in foreign politics as he took part in the discussion about Luffy's journey to Wano Country, and asked whether there is something the royals should do in the matter."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Potaufeu is the king of a nation affiliated with the World Government and one of the few allowed to attend the Levely, which grants him some authority over matters concerning the world."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Potaufeu attended the Levely where he was seated between Seki and Wapol."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Upon hearing Seki and Lemoncheese discuss the actions of Monkey D. Luffy, Potaufeu chimed in and told them about the rumor that the young pirate was going after Kaido next. The other monarchs and him then continued to discuss the matter of Wano Country and Monkey D. Luffy before the meeting began."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Potaufeu cannot be seen at all aside from a small part of the back of his head and body. As such, his appearance and his role are largely confined to the anime."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is based on pot-au-feu, a French beef stew.", "elements": []}, {"text": "Potaufeu's name is not revealed in the manga, but is, instead, revealed in the anime credits of Episode 889, alongside other monarchs unnamed in the manga.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 (p. 12-13) and Episode 884, Potaufeu debuts.", "elements": []}, {"text": "↑  One Piece Anime — Episode 889, Potaufeu is named in the captions and credits.", "elements": []}, {"text": "↑  One Piece Anime — Episode 889, Potaufeu's role is expanded in the anime.", "elements": []}]}], "images": []}]}