{"sections": [{"title": "Ahiru", "level": 1, "content": [{"type": "paragraph", "text": "Ahiru is the Deputy Commander (副隊長 Fuku taichō) of the East Army in the Revolutionary Army and the assistant of Belo Betty."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ahiru is a woman with tanned skin, prominent lips and long brown hair. Her left arm is a mechanical prosthesis with light and dark green coloring. She wears a black shirt, a red tie and a green jacket. She also has a pair of goggles on her head."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Revolutionary Army, Ahiru has no qualms with challenging the World Government, especially with her status as an officer. As such, she is a brave woman as she has made enemies with one of the most powerful forces in the world."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a deputy commander within the Revolutionary Army, Ahiru has some authority over lower ranking revolutionaries, especially ones within the East Army."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Ahiru was present on Momoiro Island with Belo Betty and Koala after the plan to infiltrate the Levely had been put into action."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Ahiru\" (あひる, \"Ahiru\") means \"duck\" in Japanese. This follows the theme of female characters being named after birds.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 905 (p. 16) and Episode 883, Ahiru debuts.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 93, Ahiru's name and rank revealed.", "elements": []}]}], "images": []}]}