{"sections": [{"title": "Didit", "level": 1, "content": [{"type": "paragraph", "text": "Didit is a noble living in the Goa Kingdom on Dawn Island. She is the wife of Outlook III, the biological mother of Sabo, and the adoptive mother of Sterry."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Didit is a tall, fair-skinned woman with slanted eyes, a pointed nose, and an oval-shaped head. She has shoulder-length blonde hair that is curled in the back and parted in the front. She wears long, lavender-colored cardigan over a dark-purple dress with a frilled neckerchief. She wears a red sash around her waist, a purple hair band with a flower on it, and red lipstick."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like many other nobles, Didit has very materialistic values and strongly believes in the social hierarchy of class systems."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In many instances in Sabo's life, Didit tried to guide and teach him by ways of nobility. She told him that he should marry a royal princess so the family could live easier and be happier. When Sabo was assaulted by an armed royal boy, Didit was much more concerned by the wellbeing of the royal child then her own. These attitudes of Didit and Outlook III caused Sabo to leave home to live in Gray Terminal."}, {"type": "paragraph", "text": "When Sabo returned home, Didit welcomed him, commenting on his awful smell, and introduced him to Sterry, his adopted younger brother."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, after Sabo stole a small boat to escape and start his life as a pirate, Didit and her husband witnessed this departure, much to their shock. To make matters worse, Sabo had accidentally cut in front of World Noble Jalmack's ship, which caused him to be shot down. His mother and father both seemed horrified at this, either at the presumed death of their son or that their son would dare to obstruct a Celestial Dragon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8c/Sabo%27s_Parents_Horrified.png/revision/latest/scale-to-width-down/210?cb=20160219064154", "caption": "Outlook and Didit horrified."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 585 and Episode 496, Didit makes her first appearance.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0663).", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 586 and Episode 500, Didit introduces Sabo to Sterry.", "elements": []}, {"text": "↑  One Piece Anime — Episode 502, In the anime only, Sabo's parents witness his departure.", "elements": []}, {"text": "↑  One Piece Anime — Episode 503, In the anime only, Sabo's parents witness their son's presumed death.", "elements": []}]}], "images": []}]}