{"sections": [{"title": "Keith", "level": 1, "content": [{"type": "paragraph", "text": "Keith is a monkey mink and a member of the Guardians who protect the Mokomo Dukedom at night."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Keith is an average-sized monkey mink with a curled tail and brown fur. He wears a black suit with a black tie, a light-colored shirt, black pants, and a black top hat on his head. He also wears a red ascot and two black paw gauntlets on his hands."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Keith's personality, but he is loyal to the Mokomo Dukedom and their allies, as shown by him joining the fight against Jack and the Beasts Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a mink, Keith is a natural-born warrior and is capable of using Electro. As a member of the Guardians, he likely possesses above-average combat skills for a mink."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Pre-Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Jack and the Beasts Pirates invaded the Mokomo Dukedom looking for Raizo, Keith and the Guardians raced in as night fell to fight in relief of the Inuarashi Musketeer Squad. The battle lasted five days, with the Guardians fighting during the night. Jack managed to defeat the minks by exposing them to the Koro gas, leaving the minks poisoned. However, two days later, some of the Straw Hat Pirates arrived on Zou just in time to prevent them from succumbing to the poison."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "While Nami, Sanji, Chopper, Brook, and Caesar were working to treat all the minks on the island, Keith cheered them on alongside his comrades, Roddy and Blackback."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/39/Keith%2C_Blackback%2C_and_Roddy.png/revision/latest/scale-to-width-down/180?cb=20190905053100", "caption": "Keith, Blackback, and Roddy cheer on their saviors."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later, Keith announced to all the Guardians that Wanda had returned with the entire Straw Hat crew. Afterwards, he partied alongside the Straw Hats during their feast."}, {"type": "paragraph", "text": "When it was time for the Sanji Retrieval Team to depart, Keith and everyone else that remained watched in surprise as Luffy suddenly wrapped their group in his arms and then jumped off Zou."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Keith and the Guardians later accompanied Nekomamushi to Sphinx in order to recruit Marco to their alliance with the Straw Hats, the Heart Pirates, and the Kozuki Family."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Guardians, Inuarashi Musketeer Squad, and Heart Pirates vs. Beasts Pirates", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The anime expands the number of instances that Keith is seen. He was only seen during flashbacks during the Beast Pirates' invasion and not the actual Zou Arc. Although he most likely did partake in the general events that also involved the Mink Tribe and the Guardians during the Zou Arc, his presence in these events were only seen in the anime."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Originally, Oda had intended for Keith to be one of the Three Inuarashi Musketeers, but then replaced him with Giovanni.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c9/Three_Inuarashi_Musketeer_Concept_Art.png/revision/latest/scale-to-width-down/210?cb=20190712184112", "caption": "Concept art of the Three Inuarashi Musketeers, including Keith."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 81 Chapter 809 and Episode 759, Keith makes his debut.", "elements": []}, {"text": "↑  One Piece Anime — Episode 765, Keith alerts the rest of the Guardians that the Straw Hats have arrived.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0966), Keith is named in concept art for the Three Inuarashi Musketeers.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 81 Chapter 810 and Episode 760.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 81 Chapter 811 and Episode 761.", "elements": []}, {"text": "↑  One Piece Anime — Episode 761, Keith cheers alongside Roddy and Blackback.", "elements": []}, {"text": "↑  One Piece Anime — Episode 766, Keith parties with the Straw Hats.", "elements": []}, {"text": "↑  One Piece Anime — Episode 776, Keith stares on in surprise as Luffy and his group fall off Zou.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 909 and Episode 890.", "elements": []}]}], "images": []}]}