{"sections": [{"title": "Eikon", "level": 1, "content": [{"type": "paragraph", "text": "Eikon is a dwarf from the Tontatta Kingdom and a member of the Tonta Corps."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Eikon is small in stature and has a large fluffy tail, a pointy nose, and puffy cheeks. She has puffy dark hair that is held up with a bright hairband and wears a striped shirt with a fluffy collar."}, {"type": "paragraph", "text": "In the Digitally Colored Manga, she has brown hair with a yellow hairband and wears a pink and purple striped shirt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Eikoso_Concept_Art.png/revision/latest/scale-to-width-down/140?cb=20190721054819", "caption": "Concept Art of Eikon."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Eikon, like all the Tontatta dwarves, is very trusting towards others. Even though Nico Robin was perceived to be their enemy, she immediately trusted her when she claimed that she meant no harm and even gave her a warm welcome."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a dwarf, Eikon has strength and speed that is superior to that of an average human. However, she has not been seen directly participating in any combat."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In the anime Eikon wielded a spear."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Nico Robin's capture by the dwarves and subsequent release upon them believing her to be a good person, Eikon smiled at Robin and stood behind Gancho after he introduced himself."}, {"type": "paragraph", "text": "Later, Eikon and the other dwarves on Green Bit accompanied their new allies, Robin and Usopp, to the Riku Royal Army Headquarters, where they attended the meeting led by the Thunder Soldier announcing the start of their rebellion against Donquixote Doflamingo."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime equivalent of Chapter 711, Eikon's design is slightly different. Instead of a headband, she was shown wearing a white visor cap and holding a spear. Furthermore, she was shown attacking Robin after she revealed that she had no weapons to give them, instead of smiling at her after Gancho's self introduction."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Unlike most dwarves, her name was not revealed in an SBS, but was instead revealed in the One Piece Magazine Vol.2.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 711 (p. 8) and Episode 641, Eikon makes her debut.", "elements": []}, {"text": "↑  One Piece Magazine — Volume 2 (p. 119), Eikon's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 73 Chapter 722 (p. 10-11), Eikon attends the meeting led by the Thunder Soldier.", "elements": []}, {"text": "↑  One Piece Anime — Episode 641, Eikon's anime design is slightly different.", "elements": []}]}], "images": []}]}