{"sections": [{"title": "Omatsuri", "level": 1, "content": [{"type": "paragraph", "text": "Baron Omatsuri is the main antagonist of the sixth One Piece movie and the captain of the Red Arrows Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Omatsuri is a tall, lean man with broad shoulders, long limbs, and a thin waist. He has a triangle shaped head, long eyebrows, and a pointed nose. He sports a pointy black goatee and a mustache that curves up. His hair somewhat resembles a palm tree. He wears a dark purple suit with a purple brim, white collar and neckerchief, and it has orange-yellow flower patterns on it. He wears matching slacks and dark colored shoes. He also has pink goggles on his forehead."}, {"type": "paragraph", "text": "When he was younger, he lacked his goatee and his hair was a lot shorter. Instead of his current jacket, he wore a typical dark colored pirate jacket and retained his goggles and neckerchief."}, {"type": "paragraph", "text": "After Lily Carnation died, he turned into a plant that produced three yellow flowers and green leaves. His goggles sat around the base of his stalk."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "At first, he appears to be an eccentric man like most characters in the series, but is revealed to be a facade."}, {"type": "paragraph", "text": "He had a huge amount of respect and care for his deceased crewmates, as he was willing to bring them \"back to life\" by combining his fond memories of them with the powers of Lily Carnation. He was frustrated when his crew's lives were washed away, and it made him hate all Pirates in the Pirate Era, resulting in him becoming a bitter, hopeless man, who openly mocked the dreams of others."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Weapon", "level": 3, "content": [{"type": "paragraph", "text": "In battle, Omatsuri uses a bow with explosive arrows that home in on their targets. He is also capable of summoning massive arrow storms out of Lily's body and generating them from his bow, which suggests that these powers come from her."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Omatsuri was captain of the Red Arrows Pirates, and they were dated back to the time when Gol D. Roger was still alive. The crew died in a storm, leaving Omatsuri to be washed ashore on an island, and left stranded alone. He grew bitter from the loneliness and sought to break the spirit of any pirate crew that came to his island. With Lily's help, he found that he could use her plant powers to create replicas of his dead crew mates from his memories, as well as make a massive army of servants for free."}], "images": []}, {"title": "Baron Omatsuri and the Secret Island", "level": 3, "content": [{"type": "paragraph", "text": "He claimed to be the owner and founder of the resort on Omatsuri Island, a recreational island in the middle of the Grand Line. However, he always challenged pirates who came to his island to a test called \"The Trials Of Hell\" before he let them relax, in which they must take part in a variety of competitions, ostensibly to prove their strength. These games were, in reality, to see if they were suitable for feeding to his man eating plant, Lily Carnation, which grew out of his shoulder and seemed to exist in a symbiotic relationship with him."}, {"type": "paragraph", "text": "The last pirate crew that he attempted this with was the Straw Hat Pirates, and after seeing their promising skills in the Trials, he used careful cunning to sever their emotional ties to each other and capture them, forcing Luffy to watch as they were absorbed. He was defeated when the father of the Tearoom Pirates shot an arrow through Lily, killing the plant and destroying the illusions on the island. Omatsuri mourned Lily briefly, but quickly turned to fly at Papa in an unrestrained rage. However, before he could take a step towards him, Luffy came behind him. With more hatred for Omatsuri than anyone else had ever provoked, he put all of his energy into an immensely powerful punch, striking the Omatsuri's face and ending his life. After his death, he truly reunited with his crew, who did not blame him for their deaths but wished that instead of living on as a bitter and vengeful shell, creating illusions of them, he had moved on and found hope from new friends, like Luffy had with the Tearooms and Brief when he thought he had lost the rest of the Straw Hats."}, {"type": "paragraph", "text": "Nico Robin later spots Omatsuri's goggles laying next to a batch of flowers growing out of the rocks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f6/Lily_Carnation_True_Form.png/revision/latest/scale-to-width-down/202?cb=20180226225425", "caption": "Lily Carnation takes it's true form while possessing Omatsuri."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Omatsuri and Lily Carnation vs. Ochanoma Papa and Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Baron and his crew are said to have met Gol D. Roger, as said by Muchigoro.", "elements": []}, {"text": "Baron (だんしゃく), means “Lord\".", "elements": []}, {"text": "His name, Omatsuri (お祭り, Omatsuri), means \"festival\" or \"gala\".", "elements": []}, {"text": "He shares the Japanese voice actor for Marshall D. Teach, Akio Ōtsuka.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Movie 6, Omatsuri is introduced as the island's owner.", "elements": []}, {"text": "↑  One Piece Movie 6, Papa reveals that Omatsuri and his crew are pirates.", "elements": []}, {"text": "↑  One Piece Movie 6, Omatsuri turns into a flower after Lily Carnation died.", "elements": []}, {"text": "↑  One Piece Movie 6, Omatsuri reveals the former fate of his crew.", "elements": []}, {"text": "↑  One Piece Movie 6, Omatsuri reveals his plan to split up crews and feed them to Lily.", "elements": []}, {"text": "↑  One Piece Movie 6, Omatsuri and Lily fight Luffy and Papa and are defeated.", "elements": []}, {"text": "↑  One Piece Movie 6, Omatsuri's crews tells him in the afterlife that he should've found new nakama.", "elements": []}]}], "images": []}]}