{"sections": [{"title": "Chicory", "level": 1, "content": [{"type": "paragraph", "text": "Chicory is a dwarf from the Tontatta Kingdom and a member of the Tonta Corps."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chicory is small and has a fluffy tail, a pointy nose, and long flowing, bright-colored hair. She wears a bright-colored dress with light and dark stripes on the bottom and a large bright-colored hat with a flower on the left side. She also wears a pair of dark-colored high heels."}, {"type": "paragraph", "text": "In her initial appearance in the Digitally Colored Manga, she had light brown hair, a pink hat with a yellow flower, and a white dress with stripes in different shades of orange."}, {"type": "paragraph", "text": "In her second appearance, she had yellow hair, a white hat, and a pink and purple dress."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Chicory is brave as she was willing to take on Sugar alongside her comrades. Furthermore, she cares greatly about friendship as she fought against the Donquixote Pirates for the purpose of saving their 500 friends from imprisonment."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a dwarf, Chicory has strength and speed that is superior to that of an average human. However, she was no match for the combined forces of Sugar and Trebol."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "During Operation SOP, Chicory accompanied Leo and other members of the Tonta Corps to attack Sugar at the executive tower. After Robin lured Trebol away, the dwarves confronted the girl and prepared to attack her. However, as they charged towards her, Sugar turned some of them into toys. Seeing as how the toys seemingly magically appeared in front of them, and having completely forgotten that they were their friends, Chicory and the remaining dwarves stared on in surprise and confusion at where they came from and what they were just doing."}, {"type": "paragraph", "text": "Before long, they were all captured in Trebol's slime. Trebol then lit the slime on fire, causing all the dwarves to be burned in the explosion. As they laid defeated, their trust in Usopp did not wane and they continued to cry out his name in the belief that he would come save them. Hearing this, Usopp gave into their cries and returned to challenge Trebol and Sugar. However, he was quickly defeated and, as punishment, Sugar forced him to eat the supposedly poisonous grape. The dwarves watched on as their last hope of the Tatababasco was eaten by Usopp, but, to all of their surprise, Sugar ended up losing consciousness after being horrified by Usopp's facial reaction towards the spiciness of the Tatababasco. In response, Chicory stared in utter disbelief at what just unfolded before her eyes."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tonta Corps vs. Sugar and Trebol", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime equivalent of Chapter 738, Chicory is replaced by Cotton in the scene where she is supposed to be standing next to Leo and Bomba as they watch in surprise at the toys appearing from nowhere. Chicory is not seen in the anime, which was most likely an oversight due to her seemingly being a background character without a name at the time of production."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Unlike most dwarves, her name was not revealed in an SBS, but was instead revealed in the One Piece Magazine Vol.2.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 74 Chapter 738 (p. 14), Chicory makes her debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 74 Chapter 738, Chicory participates in the fight against Sugar.", "elements": []}, {"text": "↑  One Piece Magazine — Volume 2 (p. 119), Chicory's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 74 Chapter 740 (p. 19), The dwarves are all defeated by Sugar and Trebol.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 74 Chapter 739 (p. 5-6), Trebol captures all the dwarves.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 74 Chapter 741 (p. 1-3), The dwarves cry out for Usoland to come save them.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 74 Chapter 742 (p. 18-19), The dwarves watch as Sugar passes out.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 75 Chapter 743 (p. 2), Chicory watches in shock at Sugar fainting.", "elements": []}, {"text": "↑  One Piece Anime — Episode 671, Chicory is replaced by Cotton.", "elements": []}]}], "images": []}]}