{"sections": [{"title": "Yatappe", "level": 1, "content": [{"type": "paragraph", "text": "Snake-Eyes Yatappe is a Yakuza boss who was in charge of the Kibi region in Wano Country. He was imprisoned in Udon by the Beasts Pirates, but was freed when Luffy took over the prison."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yatappe is an average size man, with long dark wavy hair, a french cut facial hair, and thick sideburns. He has thick lips, a thin nose, and a circular scar over his right eye."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8b/Yatappe_Portrait.png/revision/latest/scale-to-width-down/120?cb=20190904043027", "caption": "Close-up of Yatappe's face."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Being a yakuza boss, he had the respect of his followers from Kibi, as well as the other yakuza bosses of his time, being able to work alongside them. He seems to highly respect Hyogoro, and would threaten those who offend the elder as well as obey his commands."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Yatapee seems to have enough strength to hold down a struggling Luffy while the latter is being punished for his rudeness."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At a certain point in his past, he became the yakuza boss of the Kibi region of Wano Country. After the Beasts Pirates took over the country, he opposed then and ended up in the Prisoner Mine in Udon."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Luffy led a rebellion in the prison, he was freed with the rest of the prisoners, among them being the other yakuza bosses. The group later approached Hyogoro to show him respect and upon seeing Luffy's casual way of addressing him, they tried to punish him, only to be stopped by Hyogoro. The group then let Luffy go and left to recruit their followers from across Wano."}, {"type": "paragraph", "text": "Yatappe later joined up with the Rebel Command Squad in the Kibi region where he deciphered the meaning of Yasuie's last message. Two days before the raid on Onigashima, Yatappe and the other Yakuza bosses contacted Kin'emon and informed him of the number of allies they recruited."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 94 Chapter 952 (p. 8-10), Yatappe makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 16), Hyogoro talks about the yakuza bosses.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 954 (p. 7).", "elements": []}, {"text": "↑  One Piece Manga — Chapter 955 (p. 10).", "elements": []}]}], "images": []}]}