{"sections": [{"title": "Omasa", "level": 1, "content": [{"type": "paragraph", "text": "Blood Letter Omasa is a Yakuza boss who was in charge of the Udon region in Wano Country. He was imprisoned in Udon by the Beasts Pirates, but was freed when Luffy took over the prison."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Omasa is a large man with light colored hair, with two braids at the front of his face and bells at the end of them. He has thin whiskers and a large scar over his right eye."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Omasa_Portrait.png/revision/latest?cb=20190904043327", "caption": "Close-up of Omasa's face."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Being a yakuza boss, he had the respect of his followers from Udon, as well as the other yakuza bosses of his time, being able to work alongside them. He seems to highly respect Hyogoro, and would threaten those who offend the elder as well as obey his commands."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Omasa seems to have enough strength to hold down a struggling Luffy while the latter is being punished for his rudeness."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At a certain point in his past, he became the yakuza boss of the Udon region of Wano Country. After the Beasts Pirates took over the country, he opposed then and ended up in the Prisoner Mine in Udon."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Luffy led a rebellion in the prison, he was freed with the rest of the prisoners, among them being the other yakuza bosses. The group later approached Hyogoro to show him respect, and upon seeing Luffy's casual way of addressing him, they tried to punish him, only to be stopped by Hyogoro. The group then let Luffy go, and they left to recruit their followers from across Wano."}, {"type": "paragraph", "text": "Two days before the raid on Onigashima, Omasa and the other Yakuza bosses contacted Kin'emon and informed him of the number of allies they recruited."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 94 Chapter 952 (p. 8-10), Omasa makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 16), Hyogoro talks about the yakuza bosses.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 955 (p. 10).", "elements": []}]}], "images": []}]}