{"sections": [{"title": "Tsunagoro", "level": 1, "content": [{"type": "paragraph", "text": "Broken Hat Tsunagoro is a Yakuza boss who was in charge of the Hakumai region in Wano Country. He was imprisoned in Udon by the Beasts Pirates, but was freed when Luffy took over the prison."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tsunagoro is a thin man with a long face and light colored hair. He has a signature double chonmage, while the rest of his hair falls down his face, covering his right eye. He is constantly seen with a sinister grin and twig in his mouth."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e7/Tsunagoro_Portrait.png/revision/latest?cb=20190819220208", "caption": "Close-up of Tsunagoro's face."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Being a yakuza boss, he had the respect of his followers from Hakumai, as well as the other yakuza bosses of his time, being able to work alongside them. He seems to highly respect Hyogoro and would threaten those who offend the elder as well as obey his commands."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Tsunagoro seems to have enough strength to hold down a struggling Luffy while the latter is being punished for his rudeness."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At a certain point in his past, he became the yakuza boss of the Hakumai region of Wano Country. After the Beasts Pirates took over the country, he opposed then and ended up in the Prisoner Mine in Udon. He was put to work in the Iron Factory."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was seen working in the Iron Factory while O-Lin rampaged in the prison and the Beasts Pirates tried to call for help."}, {"type": "paragraph", "text": "After Luffy led a rebellion in the prison, he was freed with the rest of the prisoners, among them being the other yakuza bosses. The group later approached Hyogoro to show him respect and upon seeing Luffy's casual way of addressing him, they tried to punish him, only to be stopped by Hyogoro. The group then let Luffy go and left to recruit their followers from across Wano."}, {"type": "paragraph", "text": "Two days before the raid on Onigashima, Tsunagoro and the other Yakuza bosses contacted Kin'emon and informed him of the number of allies they recruited."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In Chapter 940, during Hyogoro’s monologue about the Yakuza bosses imprisoned in Udon, Tsunagoro is the only one whose silhouette matches his appearance, while the rest had their appearance altered.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 94 Chapter 947 (p. 8), Tsunagoro is seen in the Iron Factory.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 16), Hyogoro talks about the yakuza bosses.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 952 (p. 8-10), Tsunagoro is introduced.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 955 (p. 10).", "elements": []}]}], "images": []}]}