{"sections": [{"title": "Cho", "level": 1, "content": [{"type": "paragraph", "text": "Moonflower O-Cho is a Yakuza boss of the Ringo region of Wano Country. She was imprisoned in Udon by the Beasts Pirates, but was freed when Luffy took over the prison."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cho is an average-sized woman with light skin and hair that is arranged in an exaggerated Tōrōbin Shimada that resembles a butterfly, but also has some of her curly hair loose and covering her right eye. She has simple flower tattoos on her right shoulder and upper arm. She also appears to wear mascara and lipstick."}, {"type": "paragraph", "text": "She wears a furisode with burning mitsudomoe designs on the sleeves and along the bottom. She keeps her right arm out of the sleeve, letting it hang loose on the obi. She also binds her breasts with bandages."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Cho_Portrait.png/revision/latest?cb=20190904064931", "caption": "Close-up of Cho's face."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Being a yakuza boss, she had the respect of her followers from Ringo, as well as the other yakuza bosses of her time, being able to work alongside them. She seems to highly respect Hyogoro and would threaten those who offend the elder as well as obey his commands, showing that she values respect and expects others to do the same."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Cho had enough strength to hold down a struggling Luffy while the latter was being punished for his rudeness."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At a certain point in her past, she became the yakuza boss of the Ringo region of Wano Country. After the Beasts Pirates took over the country, she opposed them and ended up in the Prisoner Mine in Udon."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Luffy led a rebellion in the prison, she was freed with the rest of the prisoners, among them being the other yakuza bosses. The group later approached Hyogoro to show him respect and upon seeing Luffy's casual way of addressing him, they tried to punish him, only to be stopped by Hyogoro. The group then let Luffy go and left to recruit their followers from across Wano."}, {"type": "paragraph", "text": "Cho later joined the weapon recovery squad to collect the hidden weapons in the Ringo region. While there, she read Yasuie's last message and praised his cleverness after deciphering the message. Two days before the raid on Onigashima, Cho and the other Yakuza bosses contacted Kin'emon and informed him of the number of allies they recruited."}, {"type": "paragraph", "text": "On the night before the raid on Onigashima, the Beasts Pirates destroyed the bridges linking Wano's regions, preventing Cho and her group from going to the meeting place."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name, \"Cho\" (蝶, \"Cho\"), is the Japanese word for butterfly and her hair is shaped like one.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 94 Chapter 952 (p. 8-10), Cho makes her debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 940 (p. 16), Hyogoro talks about the yakuza bosses.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 954 (p. 7).", "elements": []}, {"text": "↑  One Piece Manga — Chapter 955 (p. 10).", "elements": []}, {"text": "↑  One Piece Manga — Chapter 959 (p. 11).", "elements": []}]}], "images": []}]}