{"sections": [{"title": "Shimotsuki Ushimaru", "level": 1, "content": [{"type": "paragraph", "text": "Shimotsuki Ushimaru was a member of the Shimotsuki Family, and the last daimyo of Ringo in Wano Country. He ruled until the takeover of Kurozumi Orochi as shogun 20 years ago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ushimaru had short, somewhat spiky hair that was gathered into a large bun at the back. He had a pronounced nose. 39 years ago, he wore a dark colored yukata with a light colored marking and a light colored jittoku haori with dark colored images of bulls  (牛, Ushi)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Ushimaru_and_Onimaru.png/revision/latest/scale-to-width-down/180?cb=20191118123056", "caption": "Ushimaru as he appeared 39 years ago."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ushimaru was loyal to the Kozuki Family, and so opposed the takeover of Orochi, electing to rise up against him even though it ultimately cost him his life."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As daimyo of Ringo, Ushimaru had full control over the region. According to Kawamatsu, he was a master swordsman."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Ushimaru served as daimyo for an unknown period of time before 20 years ago, with the komakitsune Onimaru serving as his companion. Twenty years ago, Kurozumi Orochi assumed the title of shogun, and after executing the daimyo of Kuri Kozuki Oden, he gave the remaining four daimyo the chance to submit to him. The daimyo all refused and staged a rebellion against him. The rebellion was quashed by Kaido, resulting in Ushimaru losing his life."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ushimaru's name may come from Ushiwakamaru (牛若丸, Ushiwakamaru), the childhood name of Minamoto no Yoshitsune. Minamoto no Yoshitsune had a retainer named Benkei whose childhood name was Oniwakamaru, which is the possible source of Onimaru's name.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 94 Chapter 953, Ushimaru is first seen when mentioned by Kawamatsu.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 93 Chapter 942, Yasuie reveals the daimyo's uprising against Orochi.", "elements": []}]}], "images": []}]}