{"sections": [{"title": "Snakeman (Gifter)", "level": 1, "content": [{"type": "paragraph", "text": "Snakeman is a Gifter in the Beasts Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Snakeman is an average-sized man. He is bald, but has horns like most Gifters, as well as prominent sharp teeth. He wears a blue shirt, purple cape, red pants, and brown boots. Due to him eating a SMILE, he has a green snake coming out of his abdomen through his belt. He also carries a sword on the left side of his waist."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Snakeman is very loyal to his crew. He is also dedicated to maintaining the social order of Wano, as he tried to prevent the residents of Okobore Town from eating clean food."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Snakeman's abilities, but he has enough authority in Kuri to demand the retrieval of the food supply from Okobore Town."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "His SMILE Devil Fruit resulted in a snake coming out from his abdomen."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Snakeman has a sword, but his ability to wield it is unknown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the sumo competition in Bakura Town, Snakeman was with Rabbitman and the other Gifters as they watched the fights. When Luffy defeated Urashima and demanded to see Holdem, Snakeman ordered his crew to fight Luffy and his company."}, {"type": "paragraph", "text": "Later, after Luffy and his group had stolen a cart of food from Bakura Town, Snakeman, Rabbitman, and Batman chased after them into Okobore Town. They tried to stop the townspeople from eating the food, but were ignored. Snakeman then noticed something looming over them before Luffy suddenly crushed them under a giant container of water as he tossed it down."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Leftovers_Retrieval.png/revision/latest/scale-to-width-down/150?cb=20191027075633", "caption": "The Beasts Pirates try to take back the food supply."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 916 (p. 16) and Episode 900, Snakeman debuts.", "elements": []}, {"text": "↑  One Piece Anime — Episode 908, Snakeman's name is listed in the credits.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 918 (p. 14) and Episode 908, Snakeman and his crew at Okobore Town.", "elements": []}]}], "images": []}]}