{"sections": [{"title": "Rabbitman", "level": 1, "content": [{"type": "paragraph", "text": "Rabbitman is a Gifter in the Beasts Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rabbitman is a large man. Due to him eating a SMILE, he grew a rabbit face on his chin, with the rabbit's head doubling as his beard, rabbit ears framing his face from both sides, and a large rabbit tail on his back. His hair is shaped like horns worn by most Gifters. He wears a light green shirt, green pants, a brown and orange vest, and brown boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Rabbitman is very loyal to his crew. He is also dedicated to maintaining the social order of Wano, as he tried to prevent the residents of Okobore Town from eating clean food."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Rabbitman's abilities, but he has enough authority in Kuri to demand the retrieval of the food supply from Okobore Town."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Rabbitman ate the rabbit SMILE fruit which gave him rabbit ears on his shoulders and the face on his beard and also the tail from behind. It is unknown what abilities the fruit gives him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Rabbitman was with Snakeman in Bakura Town as they watched the sumo competition. When Luffy defeated Urashima and demanded to see Holdem, Rabbitman watched his crew attack Luffy and his company."}, {"type": "paragraph", "text": "Later, after Luffy and his group had stolen a cart of food from Bakura Town, Batman, Snakeman, and Rabbitman chased after them into Okobore Town. When they tried to stop the town's citizens from eating the food, Luffy crushed them under a giant water container when he threw it down."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Leftovers_Retrieval.png/revision/latest/scale-to-width-down/210?cb=20191027075633", "caption": "The Beasts Pirates try to take back the food supply."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 916 (p. 16) and Episode 900, Rabbitman debuts.", "elements": []}, {"text": "↑  One Piece Anime — Episode 908, Rabbitman's name is listed in the credits.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 918 (p. 14) and Episode 908, Rabbitman and his crew at Okobore Town.", "elements": []}]}], "images": []}]}