{"sections": [{"title": "Mountain God", "level": 1, "content": [{"type": "paragraph", "text": "The Mountain God, respectfully called Yama-san (山さん, Yama-san, VIZ Media: Yama) by Kozuki Oden and his retainers, is a giant boar that lived in the forests of Wano Country as late as thirty years ago. In what became known as the Mountain God Incident, it was cut down by Kozuki Oden during its attack on Flower Capital, but it ultimately survived the ordeal."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Mountain God is an enormous white boar the size of an entire mountain. It has two large tusks and a bunch of sharp teeth that stick out from its lower lip."}, {"type": "paragraph", "text": "After the attack from Oden, it received scar lines from the lip to the back on both sides."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "The Mountain God is protective of its child and becomes vengefully destructive if it is taken."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Child", "level": 3, "content": [{"type": "paragraph", "text": "The Mountain God is extremely protective of its child, called Koyama (小山, Koyama) by Kozuki Oden and his retainers. If its child is taken, the Mountain God will relentlessly track it down, going so far as to rampage throughout a city to find it."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Due to its immense size and power, the Mountain God could easily wipe out a quarter of the Flower Capital before it was stopped by Oden. It also had an acute sense of smell, which it used to track down its child. The Mountain God also has tremendous endurance, being able to survive being bisected by Oden after being stitched back together."}, {"type": "paragraph", "text": "It is considered a divine creature in the legends of Wano Country."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Forty-one years ago, the Mountain God went on a rampage after its child was captured by a trio of men and taken to the Flower Capital by Kin'emon. It devoured a village's worth of people, including Tsuru, before attacking the capital. Kin'emon tried in vain to attack the beast after hearing that it ate Tsuru. It then charged at Kozuki Oden after seeing its child with him. Oden cut the creature horizontally with his swords, freeing the people from its stomach."}, {"type": "paragraph", "text": "The Mountain God had its huge gash stitched back together, and several years later when Oden was about to visit the capital, it was told to wait while its child was asked to get into a crate."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mountain God vs. Kin'emon", "elements": []}, {"text": "Mountain God vs. Kozuki Oden", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Chapter 960 (p. 15-17), The Mountain God appears in the Flower Capital.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963, The Mountain God is shown to have survived the \"Togen Shirataki.\"", "elements": []}, {"text": "↑  One Piece Manga — Chapter 961 (p. 2-15), The Mountain God Incident takes place.", "elements": []}]}], "images": []}]}