{"sections": [{"title": "Rokuro", "level": 1, "content": [{"type": "paragraph", "text": "Rokuro-sensei is a school teacher in the Flower Capital and a Gifter of the Beasts Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rokuro is a woman of average height with pale purple, shoulder-length hair. She has yellow eyes, red lipstick, and a small flower in her hair. Due to the snake SMILE fruit, she has an elongated neck, with fangs and a long forked tongue. As a Gifter, she has been seen with black horns. She wears a dark purple kimono adorned with blue floral patterns and an obi with red and dark red stripes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Rokuro is loyal to Kurozumi Orochi as she teaches children propaganda that portrays him as a hero while vilifying Kozuki Oden and the Nine Red Scabbards."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a school teacher for all the children in Wano Country, she is responsible for teaching the children lectures and also convincing them that the Kozuki Clan are more evil and Orochi is the hero of Wano Country. She seems charismatic enough for the children to accept her lectures."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Rokuro ate a snake SMILE Devil Fruit, which allows her to stretch her neck and gain snake-like fangs and tongue. She used it to intimidate any students who disagree with her lecture."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/73/Rokuro_SMILE.png/revision/latest?cb=20191111215828", "caption": "Rokuro's SMILE."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, Rokuro ate a SMILE Devil Fruit and successfully gained snake-like abilities like stretching her neck."}, {"type": "paragraph", "text": "She also became a teacher in the Flower Capital to teach children to believe that Orochi was the hero of Wano Country and the Kozuki Family were villians."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "Rokuro held a lesson to young children about the concepts of open and closed countries and the history of Wano Country."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her ability and name are inspired by the mythical Japanese creature rokurokubi.", "elements": []}, {"text": "She is currently the only Gifter with a known name, while the others are either called by the name of the animal that represents their SMILE followed by \"-man\", or following the other Beasts Pirates card games themed names.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 91 Chapter 919 (p. 6-7) and Episode 909, Rokuro debuts.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 94 Chapter 943 (p. 9), Rokuro appears among the Gifters.", "elements": []}, {"text": "↑  One Piece Anime — Episode 909, Rokuro's name is listed in the credits.", "elements": []}]}], "images": []}]}