{"sections": [{"title": "Koza", "level": 1, "content": [{"type": "paragraph", "text": "Koza is Princess Nefertari Vivi's childhood friend. As a child, he was the leader of the Suna Suna Clan. As an adult, he became the leader of the Alabasta Rebellion. He later became the environmental minister of the Alabasta Kingdom."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Koza is a young blond man from the Alabasta Kingdom."}, {"type": "paragraph", "text": "He wears purple-tinted glasses and has a scar on his left eye that he received as a young boy from his fight against Agotogi. During the Battle of Alabasta, he wore a blue scarf around his neck, a dark purple jacket that was going all the way down to his ankles, a white shirt with an ornament of some sort hanging on his neck, black pants and a yellow sash around his waist."}, {"type": "paragraph", "text": "After two years he is seen in Yuba reading news about the Straw Hats. He has grown more muscular. He is wearing a short-sleeve shirt with black pants. He still wears the purple-tinted glasses and has desert goggles around his shirt collar. He also has a pistol attached to his belt and pair of gloves on his hands."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "One of the main characteristics of Koza's personality, which is reflected throughout the Alabasta arc, is his love for his country, family and friends. He goes through a lot to protect what he values. As a child, he is seen willing to risk his own life to protect members of the Suna Suna Clan. As an adult, he stands for what he believes, leading a whole army with the aim to protect his country.Cobra took notice of his powerful belief in the country since Koza was a kid. When the two met again during the period of drought in Alabasta, Cobra remarked that he has not changed a bit from his childhood, which Koza also admitted himself when he prevented a young boy from joining the rebel army."}, {"type": "paragraph", "text": "A natural born leader, he was the captain of the Suna Suna Clan when he was a kid, and later took the head of the Rebel Army. He is seen to be quite influential to others, since he was able to lead an army of 2 million warriors to a battle against the Royal Palace. After the timeskip, he still holds an influential role as Environmental Minister of Alabasta."}, {"type": "paragraph", "text": "Courageous, he always tries to protect his friends, his village, or his country when he thinks they are in danger. As a child, he did not hesitate to attack a bandit who was threatening Vivi. This is valued from his friends and followers, who put their trust and love in him."}, {"type": "paragraph", "text": "Koza can also be characterized as short tempered and he does not hesitate to break rules if they go against what he considers just. This has led him to rebel against the king, against his father's judgment. However, his motivation is always pure and he only wishes for the prosperity of his country and the well-being of his friends. This is proved by his actions, such as his effort to stop the war between the royal army and the rebels, once he finds out the truth about the Baroque Works conspiracy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Koza has possessed great courage and leadership abilities since childhood; as an adult, he was able to raise and direct an army of millions against Alabasta's reigning monarch, and quell that same army with a single command."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "While his strength and speed do not appear to surpass that of an ordinary human, Koza at least possesses some incredible endurance and stamina, as he not only survived multiple gunshots to the torso, but was able to speak and fight less than a day afterward."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Like all members of the Suna Suna Clan, Koza fought with a crude wooden club as a youth; despite his small size, he could swing it hard enough to knock out a grown man."}, {"type": "paragraph", "text": "As leader of the rebel army, Koza wielded several firearms as well as a sword; his swordsmanship, borne out of childhood training from Chaka, was competent if unremarkable."}, {"type": "paragraph", "text": "In his post as Environment Minister, he still carries a pistol at his side."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Young Rebel", "level": 4, "content": [{"type": "paragraph", "text": "Born in an unnamed village outside Alubarna, Koza was primarily raised by his father Toto. At ten years old, he witnessed his home succumbing to drought, and personally traveled to Alubarna to rebuke King Nefertari Cobra for \"allowing\" so many villagers to suffer. While Cobra patiently explained that no king could command the forces of nature, a horrified Toto found and restrained Koza, begging forgiveness for his son's impudence."}, {"type": "paragraph", "text": "Instead, Cobra expressed admiration for Koza's fierce courage and love for his people, and promised a royal fund for the village's relief, even offering to resettle Koza and his family in Alubarna. While Toto was immediately grateful, Koza accused the king of belittling their pain, and quit his \"audience\" in a tearful rage. Subsequently, he encountered the six-year-old Princess Nefertari Vivi, who mocked his tears and goaded him into a fight."}, {"type": "paragraph", "text": "On finding the scraped and bloodied - but defiant - Vivi, Igaram broke into a violent rage, while Toto offered to kill himself in penance. However, Cobra dismissed the incident as an ordinary childhood squabble, and left his proposals open."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6b/Koza_Forced_Apology.png/revision/latest/scale-to-width-down/210?cb=20130413181101", "caption": "Toto apologizes on his son's behalf."}]}, {"title": "The Suna Suna Clan", "level": 4, "content": [{"type": "paragraph", "text": "After his family resettled to a small farm on Alubarna's outskirts, Koza gathered dozens of local children into a gang called the Suna Suna Clan. Eventually, Vivi learned of this gang and demanded a rematch; while still unable to outfight Koza, she impressed him enough to win his friendship and be named the Clan's deputy leader."}, {"type": "paragraph", "text": "For a time, the Clan fearlessly explored Alubarna and its surrounding ruins, even forming a \"secret base\" in the city's central clock tower. Cobra approved of these outings, judging Koza and his friends a positive influence on Vivi's development as a future ruler; with their liege, Igaram, Chaka, and Pell came to care for (and monitor) the Clan as well."}, {"type": "paragraph", "text": "The outings took a dangerous turn, however, when a bandit named Agotogi tried to kidnap Vivi for ransom. Without hesitation, Koza ordered the Clan - himself included - to protect Vivi with their lives. Though they fought bravely, they were easily beaten by Agotogi and his accomplices, who proceeded to chase Vivi into the nearby ruins; Koza alone gathered enough strength to follow them, and managed to overpower Agotogi with a makeshift club, while sustaining a wound over his left eye."}, {"type": "paragraph", "text": "Koza's efforts enraged the remaining bandits, but fortunately occupied them long enough for Chaka and Pell - as well as Igaram and Cobra - to arrive and beat them all unconscious. Subsequently, Koza and the other children were treated by Cobra's best physicians, while Vivi broke into tears - not over the attack itself, but over Koza and the others' willingness to die for her."}, {"type": "paragraph", "text": "For his part, Koza became more determined than ever to fight for his beliefs and those he loved, even cajoling Chaka for combat lessons."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Vivi_Nominated.png/revision/latest/scale-to-width-down/210?cb=20130518180755", "caption": "Koza names Vivi his lieutenant in the Suna Suna Clan."}]}, {"title": "The Birth of Yuba", "level": 4, "content": [{"type": "paragraph", "text": "Some time after the Agotogi incident, Toto accepted a new proposal from Cobra: to convert the oasis of Yuba into a proper town. Excited by the prospect, Koza - despite his father's reservations - joined the settlement effort with dozens of other families. This marked the unofficial end of the Suna Suna Clan, though Koza promised to keep in contact with Vivi, and urged her to become a great princess."}, {"type": "paragraph", "text": "Although Yuba began promisingly, it easily fell prey to the machinations of Sir Crocodile, who sought to dethrone the Nefertari family and rule Alabasta himself. To this end, Crocodile's syndicate Baroque Works smuggled large amounts of Dance Powder into Alubarna and burned it, inundating the city with rain while generating severe droughts over the rest of Alabasta. This, coupled with acts of outright sabotage, spurred whole villages and towns - including Yuba - into armed rebellion."}, {"type": "paragraph", "text": "While Toto's faith in the king remained unwavering, an increasingly cynical Koza returned to Alubarna and urged Cobra to relieve the drought-stricken areas with Dance Powder. When Cobra refused and insisted on waiting for natural rain, Koza once again accused him of belittling his subjects' pain, and joined the rebellion."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [{"type": "paragraph", "text": "As the drought persisted and unrest worsened, Koza became the leader of a rebel army several hundred thousand strong. Completely unaware of Crocodile's role - or that Vivi and Igaram had left the country to investigate the matter - he led these rebels through countless skirmishes against Cobra's soldiers."}, {"type": "paragraph", "text": "In spite of his father's scorn, Koza and his lieutenants favored Yuba as their main base of activities. When the drought (exacerbated by Crocodile's personally-generated sandstorms) rendered it totally uninhabitable, they relocated to the oasis-town of Katorea."}], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the same day Vivi - having gained the Straw Hat Pirates as allies, as well as knowledge of Crocodile's machinations - returned to Alabasta, Koza judged the rebellion to have reached its tipping point, and determined to take Alubarna in an all-out assault. Despite this, he consistently refused any and all \"enlistments\" by children, delivering a particularly harsh rebuke to a Nanohana shoeshine boy named Kappa."}, {"type": "paragraph", "text": "Concurrently, Baroque Works launched its own endgame Operation Utopia, abducting Cobra and using Mr. 2 Bon Clay to impersonate him. The impostor king promptly traveled to Nanohana, \"confessed\" to causing the drought through Dance Powder overuse, and ordered his \"soldiers\" (in reality, lesser Baroque Works agents) to raze the entire city. Despite his cynicism, Koza was deeply unsettled by this behavior, and traveled to Nanohana with a small contingent demanding an explanation; in response, \"Cobra\" had him shot in cold blood."}, {"type": "paragraph", "text": "Per Baroque Works' plans, Koza survived the wound, while losing what little faith he had in the king. As he struggled through the burning Nanohana, he found several of his lieutenants tending to a gravely wounded Kappa; unaware the boy had actually been attacked by Mr. 1 and Miss Doublefinger (for witnessing \"Cobra's\" true identity), Koza resolved to invade and capture Alubarna as quickly as possible."}, {"type": "paragraph", "text": "Though Koza's troops swelled to nearly two million (bolstered by thousands of weapons from a Baroque Works freighter) after the Nanohana attack, Vivi and her allies made a last-ditch effort to intercept and reason with them at Alubarna's main gate. Anticipating this, Crocodile set Baroque Works to thwart them; while his elite agents were all diverted by the Straw Hats, a common infiltrator in the Royal Army succeeded by \"accidentally\" firing a cannon prematurely. Under the cannonball's smoke, Koza and his men passed Vivi without ever seeing her."}, {"type": "paragraph", "text": "As the rebels stormed and overran Alubarna, Koza rushed for the royal palace in hopes of securing Cobra's surrender. To his shock, he found Cobra impaled atop the palace gardens by Crocodile and Miss All-Sunday, with most of the palace guard - including Chaka - downed and Vivi alone defying the pair."}, {"type": "paragraph", "text": "Amused, Crocodile openly explained his machinations (and Cobra's innocence), \"commending\" all of Koza's misguided efforts. Chaka, however, used the last of his strength to warn Koza that Crocodile meant to unleash a massive bomb on the city square, and held Crocodile off while Vivi and Koza determined a mutual surrender between their respective factions."}, {"type": "paragraph", "text": "Under Vivi's orders, dozens of royal soldiers joined Koza just outside the palace, all hoisting white flags and proclaiming peace to the approaching rebels. Right as tensions began to cool, however, several Baroque Works infiltrators among the soldiers shot Koza from behind. This immediately reignited the rebels' worst suspicions, and the confusion was soon exacerbated by one of Crocodile's sandstorms; despite Koza's desperate pleas, the fighting resumed, more vicious than ever."}, {"type": "paragraph", "text": "Only when Crocodile was personally defeated by Monkey D. Luffy - a defeat miraculously coupled with a sudden rainstorm - did the chaos finally fade, bringing the war to an end. Almost immediately after, Koza was rejoined by Vivi; despite his wounds, he remained optimistic about recovery, and pledged his future to helping his father rebuild Yuba. On returning to Yuba, he recovered quickly enough to hear Vivi's coming-of-age speech."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/02/Chaka_Defending_Vivi_and_Koza.png/revision/latest/scale-to-width-down/210?cb=20130518182201", "caption": "Despite his wounds, Chaka protects Vivi and Koza."}]}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Founding of Ukkari Hot-Spring Island", "level": 4, "content": [{"type": "paragraph", "text": "Koza was later seen at Ukkari Hot-Spring Island, owned and operated by his uncle Goro, along with Enel's ex-high priest, Gedatsu."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "By the time of the Straw Hats' reunion on Sabaody, Koza had become Alabasta's Environmental Minister. Smiling, he read the latest news about the Straw Hats in the newspaper."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9b/Koza_Manga_Post_Timeskip_Infobox.png/revision/latest/scale-to-width-down/100?cb=20130113213037", "caption": "Koza reads about the Straw Hats."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "As Vivi and her father departed Alabasta for the upcoming Levely, Koza was there to see their departure."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Koza vs. Nefertari Vivi (Twice)", "elements": []}, {"text": "Suna Suna Clan vs. Agotogi and his bandit gang", "elements": []}, {"text": "Koza vs. Agotogi", "elements": []}, {"text": "Rebel Army vs. Alabasta Kingdom", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Going Baseball", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gear Spirit", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}, {"text": "One Piece: Grand Battle! Rush!", "elements": []}, {"text": "Dragon Dream!", "elements": []}, {"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Despite his central role in the events of the Alabasta Arc, Koza never met any of the Straw Hat Pirates (aside from a brief encounter with future member Nico Robin).", "elements": []}]}], "images": []}]}