{"sections": [{"title": "Woonan", "level": 1, "content": [{"type": "paragraph", "text": "Woonan was \"The Great Legendary Pirate of Gold\" from the East Blue. He was also a childhood friend of the oden chef, Ganzo."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Woonan is a fairly muscular old man. He has scraggly brown hair, predominant eyebrows, and stubble on his chin as well as a thin mustache. He wears a low-cut beige shirt with golden edging and buttons, a large black pirate's coat, and a sash around his waist that he holds a gun in. He also wears a beaded necklace around his neck and a red and black pirate hat on his head with his jolly roger on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a child, Woonan was incredibly ambitious and hot-tempered, caring little for the simple village life he had been born into. Indeed, he even dismissed his own father as \"worthless\" for earning a pittance over a lifetime of labor. Throughout all his childhood and most of his adulthood, he held gold to be the highest measure of a man's worth, and had few compunctions about becoming a pirate to acquire it (though he also appears to hold a romanticized view of piracy, swearing to only plunder from the evil)."}, {"type": "paragraph", "text": "Deep down, however, Woonan was also a sentimental man. Despite their diametrically opposed worldviews, he heavily respected Ganzo for his strength of character, and kept his first flag (a reminder of the last day they ever shared) all throughout his pirate career, claiming that as long as it flew, he could believe Ganzo's spirit was voyaging alongside him."}, {"type": "paragraph", "text": "In old age, after acquiring fame and fortune beyond his childhood dreams, Woonan came to adopt a worldview similar to Ganzo's, valuing adventure and friendship over worldly goods. Even so, and even after returning all the gold he plundered, he never regretted his time as a pirate."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Ganzo", "level": 3, "content": [{"type": "paragraph", "text": "As a child Woonan was close friends with Ganzo, despite their regular disagreements. One of their fights got them into hanging over a cliff. Ganzo let go of Woonan so that he could survive, and then Woonan dedicated his piracy to Ganzo."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "It is believed Woonan was a very skilled pirate as he was able to steal a third of the world's gold."}, {"type": "paragraph", "text": "In his wanted poster, he carried a gun in the sash on his waist. It is unknown how proficient he was in using it."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "When they were young, Ganzo and Woonan had an argument about how important gold really is. Woonan was bitter about how little his father earned in his lifetime and was determined to make a mountain of gold. During the fight, they fell over the cliff they were on, hanging onto Woonan's pirate flag. Ganzo lets go so the flag would not be ruined and Woonan could climb up. Fortunately, Ganzo was rescued by a passing ship and woke up days after the accident to find that Woonan had already left to become a pirate. They never saw each other again."}, {"type": "paragraph", "text": "Over the years, it was said he stole up to a third of the world's gold which he piled as high as a mountain on his secret Gold Island, and he has earned a bounty of 60,000,000, which was among the highest within East Blue."}, {"type": "paragraph", "text": "Eventually, however, Woonan grew to lament stealing all his gold fortune, as it became meaningless to him. Despairing, he decided to return all of it. Having lived a regretful life and gained infamy as a pirate, it was too late for him to turn back to a life of peace. He simply returned to his storeroom, sealed himself inside, sat down all alone, and apparently awaited his demise."}, {"type": "paragraph", "text": "By the time he died, his treasure was allegedly left hidden, and El Drago went after it, along with the Straw Hat Pirates, Ganzo and Tobio. However, when the Straw Hats, Ganzo, and Tobio reached the gold's hidden location, they found nothing but Woonan's remains and a note telling them that he realized that the gold he dedicated his life to was not what was important, but the adventure he had chasing it and the friendship he had with Ganzo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5f/Ganzo_Lets_Go.png/revision/latest/scale-to-width-down/210?cb=20130124214634", "caption": "Ganzo \"sacrifices\" his life in order for Woonan to survive."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Movie 1, Woonan is introduced.", "elements": []}, {"text": "↑  One Piece Movie 9, Woonan's wanted poster is seen in the intro alongside others.", "elements": []}]}], "images": []}]}