{"sections": [{"title": "Chadros Higelyges", "level": 1, "content": [{"type": "paragraph", "text": "Chadros Higelyges, better known as Brownbeard, is a former New World pirate. After Whitebeard's death he went off and took control of Foodvalten, one of the New World islands formerly under Whitebeard's protection."}, {"type": "paragraph", "text": "After his defeat at the hands of Basil Hawkins, he quit being a pirate and resided on Punk Hazard, where he became the boss of the Centaur Patrol Unit which guarded part of the island, until his \"Master\" Caesar Clown betrayed him."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Brownbeard is a very large, overweight man who appears to be roughly three times the height and four times the width of a normal human. He possesses a long brown beard, with three distinctly kept braids, as well as a mustache. He wears a large coat, over an open shirt, that seems to only reach to his shoulders. He leaves his chest bare, with something that appears to be a large wrestling belt with his jolly roger on it. His hair appears to come out of the top of his tricorne, and is braided back."}, {"type": "paragraph", "text": "After his encounter with Hawkins just before the timeskip, he lost the use of his legs. He is now an alligator centaur, thanks to the efforts of Caesar Clown and Trafalgar Law. His lower body consists of four alligator legs and a tail. He also added a maroon colored jacket with fur-rimmed gloves, fitting for the cold nature of Punk Hazard."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Upon his introduction, Brownbeard was rather arrogant, as he claimed an island as under his protection, and addressed himself as \"Brownbeard-sama\", \"sama\" being an honorific of something like \"lord\" or \"master\"; this led him to proudly show off his bounty in an attempt to intimidate his opponents, despite it being lower than the New World average of 100,000,000, as well as being worth less than one-third of said opponent's bounty. He was angry when the Straw Hat Pirates claimed that they never heard of him before when he bragged about his own name, and coupled with how Basil Hawkins claimed his name was a joke, seemed to make him start to doubt his level of recognition, as he was joyfully surprised when the G-5 Marines recognized him."}, {"type": "paragraph", "text": "He seems to be an opportunist, as he attacked an island that was once under Whitebeard's protection right after the great pirate's demise. Although he thinks himself as powerful, he is shown to know when his opponent out-classes him; he became terrified when he realized that he was fighting someone who has a bounty of 400,000,000."}, {"type": "paragraph", "text": "After two years, it would seem that his defeat at the hands of Basil Hawkins has humbled Brownbeard. Contrary to how he acted before the timeskip, he seems to truly value camaraderie and friendship. He deeply cares about his crew as well as the other former prisoners whom he had befriended, as he fought Caesar and aided the Straw Hats when he realized that Caesar was merely using them as guinea pigs, and grew angry at Caesar once realizing that; this anger grew stronger when Caesar revealed that he was the one who caused the poison gas explosion four years ago, not Vegapunk. His perception of the Straw Hat Pirates also changed once he realized Caesar's true nature."}, {"type": "paragraph", "text": "Like many other characters, Brownbeard has his own unique laugh, which is \"Uohhohho\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Brownbeard cares deeply for his crew and is always concerned for their safety. However, upon being taken in by Caesar Clown, they have grown more attached to him than their former captain. Upon Caesar's betrayal, Brownbeard demanded his crew back from the scientist, only to realize that they were left to die, much to Brownbeard's fury and devastation."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After confronting the Straw Hats, he blew them out of the water with his crew. However, he became scared of them when he recognized their captain and swordsman were pirates of the Worst Generation. Upon being defeated afterward, he was forced to ferry the Straw Hats around. In this time, Brownbeard began to dislike them. However, Brownbeard cooperated with them in order to escape Shinokuni and eventually developed respect for Monkey D. Luffy when he prevented Caesar and his troops from attacking him. Luffy also later expressed his anger at Caesar for hurting Brownbeard. He later called Brownbeard a friend after the latter decided to turn himself over to Smoker."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Caesar Clown", "level": 4, "content": [{"type": "paragraph", "text": "Originally seeing Caesar Clown as a \"kindhearted god\" for saving him and his crew by giving them new legs, as well as believing that he purified Punk Hazard from the chemical weapon that Vegapunk set off four years ago, Brownbeard came to worship Caesar, and further believed that the scientist would go out of his way to rescue Brownbeard from the Straw Hat Pirates' captivity."}, {"type": "paragraph", "text": "However, after hearing a voice recording of Caesar's order for Brownbeard's elimination, the former pirate captain became devastated, and upon awakening from the attempted assassination, he attacked Caesar in fury, demanding his crew back. Caesar mocked Brownbeard, revealing that he (Caesar) left the crew to die from the fatal gas H2S, as well as he was the one who truly set off the chemical weapon four years ago, all of which infuriated Brownbeard further."}, {"type": "paragraph", "text": "After Caesar's defeat, Brownbeard commented that he was satisfied to see Luffy dealing a devastating blow to Caesar."}], "images": []}, {"title": "Other Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Due to his defeat by the hands of Basil Hawkins, Brownbeard came to hate the pirates from the Worst Generation."}, {"type": "paragraph", "text": "However he respects Trafalgar Law because he gave him new legs. When Brownbeard was captured by the Straw Hats, he was sure that Law would come and save him. It is currently unknown what Law thinks about Brownbeard. However, he completely ignored Brownbeard when he asked Law to save him which shows that Law has no concern for Brownbeard  though he expresses no opposition to temporarily cooperating with him in order to defeat Caesar."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Since Brownbeard is a former New World pirate captain, it can be assumed that he has a decent amount of strength, though he was no match for a member of the Worst Generation. As the boss of the Centaur Patrol Squad, he held some authority on Punk Hazard prior to Caesar dismissing him."}, {"type": "paragraph", "text": "He seems to possess endurance that can easily be seen as superhuman, since he survived getting shot point-blank multiple times by Scotch's massive gun, and even being blown away by Caesar's attack afterwards, an attack that was powerful enough to eradicate the remains of the laboratory ruins they were all in. He was even able to move after all those ordeals, without showing any signs of strain, although he was obviously wounded. Even after Caesar injecting him with a muscle relaxant, Brownbeard was still able to force himself to stand and retaliate with his sword. He was also able to endure being openly fired upon by Caesar's subordinates and not pass out."}, {"type": "paragraph", "text": "Having his original legs crippled by Basil Hawkins, he was transformed into an alligator centaur; his new legs enables him to carry a group of people with ease so the Straw Hats use him as a means of transportation. He can also run very fast."}, {"type": "paragraph", "text": "Brownbeard had some tactical intelligence. After observing Luffy deflecting his troop's cannon shots, he deduced that Luffy is a Devil Fruit user and that his men could kill him by aiming at the water near Luffy's boat to capsize it."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When first revealed to be the leader of the centaurs patrolling Punk Hazard, he was seen with a large sword fitting one of his size, but was not seen using it."}, {"type": "paragraph", "text": "Later, during his short fight with Caesar and afterwards, he used a metal pipe. However, it was useless against Caesar's Logia ability."}, {"type": "paragraph", "text": "After that, he returned to using his sword against Caesar during their second confrontation, but it was once again ineffective."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Post-War Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was first seen with his crew terrorizing Foodvalten, an island formerly protected by Whitebeard. He had one of his men slash apart Whitebeard's flag when the islanders tried to point it out to him as a warning, and declared that the island was now under his protection."}, {"type": "paragraph", "text": "However, not too long after making his claim, Brownbeard ended up encountering the Hawkins Pirates. Basil Hawkins casually angered Brownbeard by asking what his name was. Brownbeard then started ranting proudly about his \"over 80 million\" bounty and glory. Hawkins proceeded to say that Brownbeard's name sounds ridiculous and then, as Hawkins drew his sword and prepared to fight, he states that \"he sees the shadow of death upon him\"."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Brownbeard and his crew were defeated by Basil Hawkins. As a result of the battle, Brownbeard lost the use of his legs. Eventually he arrived at Punk Hazard, where he and other paraplegics were taken in by Caesar Clown. He was at some point given the legs of an alligator by Trafalgar Law, turning him into an alligator centaur and allowing him to walk once again. In gratitude, Brownbeard became Caesar's subordinate."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/85/Brownbeard_After_Hawkins.png/revision/latest/scale-to-width-down/180?cb=20130331210906", "caption": "Brownbeard arriving at Punk Hazard after losing his legs to Hawkins."}]}, {"title": "Punk Hazard Arc", "level": 3, "content": [{"type": "paragraph", "text": "He is later seen as the \"boss\" of the Centaur Patrol Squad on Punk Hazard. When Luffy, Zoro, Usopp, and Robin are traveling to the frozen side of the island by boat, Brownbeard and his fellow centaurs intercepted them because he assumed Zoro was the samurai that has been cutting down his comrades. Once the boat is capsized by a bazooka shot into the water, Brownbeard ordered his fellow centaurs to finish off the Straw Hats. They are then stopped by Brook, which gives Luffy, Zoro, Usopp, and Robin enough time to escape the lake. Once Brownbeard recognizes Luffy, he becomes terrified."}, {"type": "paragraph", "text": "After his group is defeated, the Straw Hats force him to transport them to Vegapunk's former research facility. On the way, Luffy asks him where the rest of his crew is, but Brownbeard refuses to talk. They soon arrive at the scene where Law and Smoker had just been fighting."}, {"type": "paragraph", "text": "While Luffy is getting reacquainted with Trafalgar Law, Brownbeard quietly asks Law to help him. After Law goes back into the facility, Brownbeard and Luffy's group quickly leave the scene to get away from the marines. They eventually meet up with the rest of the Straw Hats and some of the children that were held prisoner in the research facility. They then take shelter in a laboratory ruin. While tied up in chains, Brownbeard explains to the Straw Hats many things, including his defeat at the hands of Hawkins, how Brownbeard himself became a centaur, the incident on Punk Hazard, and his belief that Caesar is a good man. He goes on to say that the Straw Hats will become a part of Caesar's experiments."}, {"type": "paragraph", "text": "When the children start crying out in pain, all Brownbeard can do is tell the Straw Hats that the children have not received their \"treatment\". Chopper then explains that he has found a drug called NHC10 in the children's bodies and deduces that Caesar must have been doing horrible experiments to the children. Brownbeard angrily tells Chopper not to speak ill of Caesar. One by one, the children succumbed to violent withdrawal symptoms and Usopp managed to pacify them with his new attack, \"Burst Sleep Star\". Unfortunately for Brownbeard, the gas released from the pellet also puts him to sleep."}, {"type": "paragraph", "text": "When he wakes up, he notices that the Straw Hats are under attack by invisible enemies and was quick to realize that the Yeti Cool Brothers have arrived. Nami (in Franky's body), overhears and threatens him to tell them what they are facing. After giving her a brief profile of the Yeti Cool Brothers, he mocks her and Chopper (in Sanji's body) by saying that they will save him and that the Straw Hats are on their kill list. Suddenly, one of the brothers, named Scotch, appeared with his gun barrel in front of Brownbeard's face and says that he is also on the kill list. At first, Brownbeard thinks he misheard him but Scotch says that he was under orders from Caesar to kill him for being captured. This is confirmed when Scotch plays a Den Den Mushi with a recording of Caesar's orders, leaving Brownbeard crushed by his master's betrayal. Scotch then asks him if he is Brownbeard, but he weakly replied \"no way\" and then cried out for his master before Scotch shot him with an explosive bullet."}, {"type": "paragraph", "text": "He wakes up again during Nami's and Usopp's confrontation with Caesar. Enraged at his betrayal, Brownbeard attacks the former Marine scientist but is quickly defeated and blown up again."}, {"type": "paragraph", "text": "He manages to survive the explosion and helps Nami and Usopp escape the poison cloud released by Smiley. They rush to the facility in order to rescue Brownbeard's men and the abducted children. While fleeing from the gas, they encountered Zoro's group. Once they reached the facility, they escape the poison cloud by going through the shutters opened by Law."}, {"type": "paragraph", "text": "After the G-5 Marines plug up the hole made by Kin'emon and Zoro, they prepare to arrest the Straw Hat Pirates and Brownbeard, who is surprised that they know who he is. They are interrupted by Law, who tells everyone present about a way off the island but will have two hours to escape. Brownbeard goes with the Straw Hats (minus Luffy), Kin'emon, and the G-5 Marines with Tashigi, and the little dragon. Nami, Robin, Usopp and Sanji use Brownbeard as a personal transport."}, {"type": "paragraph", "text": "After one of Caesar's henchmen blows a hole in the wall with a cannon, letting the poison gas in, Brownbeard helps the group escape to Building B. Caesar, attempting to kill the group, tries to close the gate that leads out of Building A in order to trap them with the gas. Brownbeard and the rest of the group jumps through just in time, but a group of G-5 Marines die."}, {"type": "paragraph", "text": "Brownbeard goes on ahead, with Kin'emon and the Straw Hats (except Franky, Chopper, and Luffy) riding on his back. They leave Tashigi and the Marines behind and continue on through Building B. They are suddenly attacked by the tiny dragon, who has just finished attacking Tashigi's group. Brownbeard states that the sedatives used to control the dragon must have worn off. The dragon starts breathing fire everywhere and everyone but Brownbeard and Zoro takes it down. They later find Chopper (in Monster Point) struggling with the rampaging children."}, {"type": "paragraph", "text": "While the Straw Hats and Kin'emon have their hands full, Brownbeard goes to the first floor of Building R. While being watched on a monitor, Brownbeard is about to reveal to the soldiers of Punk Hazard about Caesar's true colors. Before he speaks any further, Caesar and his subordinates go down to the first floor to meet him. Upon seeing Caesar, Brownbeard demands him to tell him what happened to his men outside on the island before Shinokuni was released. Caesar, in order to deceive the subordinates in the area, merely shrugged and said that he did not receive their distress call."}, {"type": "paragraph", "text": "Angered by the casual disregard of the welfare of his crew, Brownbeard tried to reveal Caesar's true nature to the rest of the men protecting their 'generous' master, but Caesar managed to inject a muscle relaxant in Brownbeard making him spurt out gibberish and unable to stand. Now in control of the situation, Caesar whispered to Brownbeard that he did receive the distress call from his men but left them to die outside, and that the poison gas incident from four years ago was his doing. Brownbeard then furiously tried to attack Caesar, only to be shot down by the subordinates he swore to save due to Caesar manipulating them into believing Luffy somehow changed him. Feeling victorious, Caesar prepares to finish off Brownbeard. He is then saved when a giant fist from Luffy punches Caesar away from the wounded alligator centaur."}, {"type": "paragraph", "text": "After Luffy sends Caesar flying out of the facility, everyone reaches Building R safely. They board the rail car and make their escape. Once they are outside and all is said and done, Brownbeard decides to turn himself in. He learns that Caesar poisoned him during his research and that the Marines could cure him. He also reasons that he has no men to go back to anyway and jail would be better than to continue being a test subject. He then participated in a party with the G-5 Marines and the Straw Hat Pirates."}, {"type": "paragraph", "text": "After learning that his petrified men could still be saved, Brownbeard graciously thanked Smoker for allowing him to search for them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/20/Brownbeard_Captured.png/revision/latest/scale-to-width-down/210?cb=20130406183254", "caption": "Brownbeared Captured"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/34/Scotch_Prepares_to_Shoot_Brownbeard.png/revision/latest/scale-to-width-down/210?cb=20141206192601", "caption": "Scotch preparing to shoot Brownbeard"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/31/Brownbeard_Saves_Nami_and_Usopp.png/revision/latest/scale-to-width-down/210?cb=20130224134020", "caption": "Brownbeard saves Nami and Usopp from the children and Caesar."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/67/Luffy_Protects_Brownbeard.png/revision/latest/scale-to-width-down/210?cb=20131010021419", "caption": "Luffy protecting Brownbeard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Brownbeard_Celebrating_at_Punk_Hazard_Party.png/revision/latest/scale-to-width-down/210?cb=20141206184748", "caption": "Brownbeard celebrating at the party."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Brownbeard vs. Basil Hawkins (unseen)", "elements": []}, {"text": "Brownbeard and Centaur Patrol Unit vs. Luffy, Zoro, Usopp and Robin", "elements": []}, {"text": "Brownbeard and Centaur Patrol Unit vs. Luffy, Zoro, Usopp, Robin, and Brook (unseen)", "elements": []}, {"text": "Brownbeard, Usopp, and Nami vs. Caesar Clown", "elements": []}, {"text": "Brownbeard vs. Caesar Clown and Subordinates", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Higelyges' alias is a pun on his real name, as the first letters of Chadros Higelyges form Chahige, the Japanese word for \"Brownbeard\".", "elements": []}, {"text": "His braided beard is reminiscent of that of the real life pirate Edward Teach.", "elements": []}, {"text": "Brownbeard has had three different voice actors throughout the anime- one for each of his two initial appearances before the timeskip, and then a regular voice actor for his appearances after the timeskip.", "elements": []}]}], "images": []}]}