{"sections": [{"title": "Charlotte Linlin", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Linlin, better known as Big Mom, is the captain of the Big Mom Pirates, as well as one of the Yonko that rule over the New World. and the only female member of the group. Decades ago before the formation of her own crew, Big Mom was part of the legendary Rocks Pirates."}, {"type": "paragraph", "text": "She is the matriarch of the very large Charlotte Family, which makes up the infrastructure of her crew. She also rules over Totto Land as its queen, seeking to form it into a utopia where all the world's races can live together in peace without experiencing discrimination or segregation. She and her crew have recently entered an alliance will fellow Yonko Kaido and his crew, the Beasts Pirates."}, {"type": "paragraph", "text": "She was the last Yonko to be named; her epithet was first mentioned after the Battle of Marineford by Eustass Kid and her real name by Pappag on Fish-Man Island. Due to her actions, role and intentions, she is the primary antagonist of the Whole Cake Island Arc, the secondary antagonist of the Wano Country Arc, and one of the central antagonists of the Yonko Saga."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Big Mom is a round, obese old woman with a chin often hidden by her torso. She has an enormous physique, standing at 880 centimeters or just shy of 29 feet tall, which is the largest known height for any human. She is taller than the extremely large Whitebeard, and was able to hold the 277cm tall Brook in her hand. Even as a five-year old child, Linlin was already massive to the point she was mistaken for a giant, and was as tall as giant children. However, as an adult, she is a little over three meters short of the minimum giant height of 12 meters. She has moderately round, orange eyes, prominent eyelashes, and wears thick purple eyeshadow. She has a very wide mouth with full lips sporting red lipstick, large, round teeth, and a long, thick tongue that often sticks out. She also has long, curly, and wild pink hair that falls halfway down her back, as well as a long beak-like nose, and plump, round cheeks. She also sports a tattoo on her left shoulder and arm, consisting of a large, standard-shaped red heart framed by thin lines curled at their bottom ends, which all tops a far smaller heart."}, {"type": "paragraph", "text": "When she was five years old, Linlin towered over normal humans and was about the same size as a giant child. She had a much rounder face and had freckles on her cheeks, her hair was kept into two buns on both sides of her head. Her nose was more triangular compared to present-day where it now protrudes outward in a rounded, beak-like shape. She wore a polka-dotted dress very similar to the one she currently wears, but with this one reaching her neck and having a bow at the top. At the start of her pirating career, Linlin's hair grew longer and she donned a dark sunhat."}, {"type": "paragraph", "text": "At 28 years old, Linlin looked drastically different compared to both her early childhood days and her later years. She was remarkably slimmer and had a visible neck, chin, and jawline, and her features were significantly smaller and more proportionate to her face. Her hair was long, yet considerably less wild than in the present day, and she had a large strand of hair falling to the left side of her face. In Oda's depiction of her at this time, she wore a dark fedora with a polka dot pattern, a bandana, and a dark, polka dotted top with a captain's coat draped over her shoulders. She had a similar appearance (although shadowed) during her time in the Rocks Pirates."}, {"type": "paragraph", "text": "At 48 years old, her neck was considerably larger and more muscular than it was at 28 and she had a much larger, more pronounced jaw. By this time, she had already begun wearing Napoleon and her polka-dotted bandana."}, {"type": "paragraph", "text": "Five years ago, at age 63, she wore a purple and pink vertical stripped dress."}, {"type": "paragraph", "text": "During her first appearance, Big Mom was shown to often drool large quantities of saliva when talking. When in her regular fits of rage from not having a certain food at her direct disposal or simply when extremely furious her pupils take on a spiral appearance."}, {"type": "paragraph", "text": "Big Mom wears a large pink bicorne hat bearing a Jolly Roger on the front. She has worn two versions: the first design consisted of a standard skull with crossbones behind it, as well as large flame-like patterns to the sides, whereas the current version, named Napoleon, has two crossed sabers instead of crossbones, possesses smaller lateral flame patterns, and is imbued with a fragment of her soul, causing its skull to change expressions and talk to Big Mom; on its top, the hat is edged with a thick yellow streak, it has a strip snap-fastened to it, and beneath it is a light, polka-dotted bandana fastened around Big Mom's head. Big Mom also dons a pink dress with red polka dots and white ruffles on its neckline and hemline, with a wide, rippling white cape attached to its back that falls to the ground. The outfit is completed with dark blue high heels, one turquoise pearl wristband on either wrist, and golden, jeweled rings on all her fingers."}, {"type": "paragraph", "text": "Hours after her craving fit for wedding cake started, Big Mom was noted to have gotten slimmer and slimmer up to the point where she has become emaciated. She went back to her usual appearance after eating Sanji's wedding cake."}], "images": []}]}