{"sections": [{"title": "Mr. 9", "level": 1, "content": [{"type": "paragraph", "text": "Mr. 9 is the code name of a bounty hunter of Baroque Works, and Miss Wednesday's former assigned partner during her infiltration. He is one of the main antagonists of the Reverse Mountain Arc. He is currently married to Miss Monday."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mr. 9 is a young man who wears a golden crown on top of his red hair and has his agent number written on his cheeks. He wears a green suit with white lace along with a ruffled red scarf. His attire makes him look like a prince or a king, but he isn't."}, {"type": "paragraph", "text": "After two years, his hair is much longer, and he has grown a bit of a mustache. He wears a different, longer scarf and has erased his agent numbers. His clothes also look different, lacking the lace that trimmed the collar and sleeves. His crown is the same, though."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mr. 9 is very sure of himself and very loyal to his friends. His favorite phrase is \"Bye bye, baby;\" these were his last words to Miss Wednesday before he attempted to hold off Mr. 5 so she could escape. Unlike Officer Agents, who seem to believe that friendship is a sign of weakness, Mr. 9 is shown to highly value friendship and loyalty, as shown when he fought for Vivi's sake."}, {"type": "paragraph", "text": "He seems to have a superiority complex, wanting to appear to be a prince. He also tends to perform noble gestures in a very uncouth manner, such as bowing and raising his pinky finger when grabbing an object."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Mr. 9 was skilled enough to become a Frontier Agent. He uses his metal bats in conjunction with his acrobatic skills to deal damage to foes. His body is quite flexible, as he is able to perform several acrobatic jumps and cartwheels. Despite this, he is a weak foe; his acrobatics being useless against Officer Agents such as Mr. 5, and he is clumsy enough to fall off a building unprovoked while fighting Zoro."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Mr. 9 wields two steel bats and uses them in conjunction with his \"acrobatics\". With the momentum generated from his gymnastic feats, they can be quite powerful. He also hides steel ropes within the bats, allowing to subdue foes as shown in his fight against Zoro. However, this technique was used against him, causing his defeat. He also used a bazooka during the Reverse Mountain Arc and was seen wielding a pistol when first introduced."}], "images": []}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Nekketsu Nine Konjo Bat (熱血ナイン根性バット, Nekketsu Nain Konjō Batto, Hot Blooded Bat of Guts): A pair of steel bats which, when coupled with his acrobatics, create a powerful close-combat attack.", "elements": []}]}, {"type": "list", "elements": [{"text": "Kattobase Shikomi Bat (カッ飛ばせ仕込みバット, Kattobase Shikomi Batto, Home-Run Hide-A-Bat): His other attack, which uses the steel rope inside the bats to bind the opponent. This attack had little effect on Roronoa Zoro and Mr. 5. In the anime, the rope was replaced with chain.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6d/Mr._9_Bat.png/revision/latest/scale-to-width-down/190?cb=20140823030742", "caption": "\"Kattobase Shikomi Bat\"."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whisky Peak Arc", "level": 3, "content": [{"type": "paragraph", "text": "He and Vivi (known as Miss Wednesday at the time) met the Straw Hat Pirates during the Reverse Mountain Arc while trying to kill Laboon in order to bring the whale meat to Whisky Peak as food for the town. The Straw Hats gave them a ride when they accidentally lost their Log Pose."}, {"type": "paragraph", "text": "As they navigated towards the island, Miss Wednesday and Mr. 9 jumped overboard before landing on shore. That night, Vivi and Mr. 9 met up with Igaram, who informed them that the Straw Hats had fallen to hell. When Miss Monday showed up and questioned whether they should have thrown that party for the Straw Hats when the town was already short on food to begin with, citing the Mr. 9 pair's failure to get the whale meat, Vivi and Mr. 9 defended themselves by claiming they had tried their best. Vivi was shocked when Igaram showed her and the others Luffy's bounty of 30,000,000. After Zoro appeared and revealed that he knew of Baroque Works, Vivi and the others prepared to kill him."}, {"type": "paragraph", "text": "After Zoro displayed his strength by effortlessly taking out dozens of bounty hunters, including Miss Monday, Vivi and the other agents assumed that he was the real captain of the Straw Hats and that the Marines made a mistake with their bounties. Mr. 9 fell off a building while trying to kill Zoro. After Mr. 9 managed to bind Zoro with the iron wire stored in his bat, Vivi held a sleeping Luffy hostage with a knife and told Zoro not to move as Igaram prepared to attack. However, Zoro threw Mr. 9 into a building before slamming him into Vivi, and both were defeated."}, {"type": "paragraph", "text": "After Vivi's identity was exposed by Mr. 5 and Miss Valentine, Mr. 9 tried to hold them off to allow her to escape, as he had grown fond of Vivi during their time together. He declared that they were still partners, effectively placing his loyalty to her above his loyalty to Baroque Works. Mr. 5 was irritated by this and finished him off with a Nose Cannon attack that knocked Mr. 9 into a river."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Vivi_and_Mr._9_Prepare_to_Kill_Laboon.png/revision/latest/scale-to-width-down/210?cb=20130122222154", "caption": "Vivi (as Miss Wednesday) and Mr. 9 prepare to kill Laboon."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Mr. 9 is shown two years later alive and well, still living in Whisky Peak. He and Miss Monday have apparently married and had a child, and he was seen playing with their infant."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Miss_Monday_and_Mr._9_Post_Timeskip.png/revision/latest/scale-to-width-down/210?cb=20130724084839", "caption": "Mr. 9 plays with his child while Miss Monday reads about the Straw Hats."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mr. 9 vs. Roronoa Zoro", "elements": []}, {"text": "Mr. 9 vs. Mr. 5", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Line Dream Adventure Log", "elements": []}, {"text": "One Piece: Going Baseball", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Legend of the Rainbow Island", "elements": []}, {"text": "One Piece: Treasure Wars", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In a character poll, Mr. 9 is currently ranked the 122nd most popular character in One Piece.", "elements": []}, {"text": "The Mr. 9 pair has a \"performing\" theme with dancing and acrobatics.", "elements": [{"text": "They also have royalty theme, as Mr. 9 wear a crown and Miss. Wednesday being an actual Princess.", "elements": []}]}, {"text": "In the 4Kids dub, it was translated that Mr. 9 was considered to be a double agent for Alabasta.", "elements": []}]}], "images": []}]}