{"sections": [{"title": "Mr. 7", "level": 1, "content": [{"type": "paragraph", "text": "Mr. 7 is the replacement for the previous agent of the same codename, who died in the line of duty. He is an agent and part of a sniper pair along with Miss Father's Day."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mr. 7's body is covered with sevens, including his eyebrows, shoes, and gun. Many of his body parts, the gestures he makes with his hands, and the way he opens his mouth also resemble the number seven."}, {"type": "paragraph", "text": "He has puffy blueish-white hair, that is styled similar to a helmet. He sports a purple coat that goes down to his ankles, with yellow frills on the shoulders, in of the sleeves, and in the middle part. The coat also has parallel sevens on each side of the chest. Under the coat he wears a dark blue shirt with pink lines on it, and a light blue neckerchief. He wears black trousers with long white socks, and yellow shoes in the shape of sevens. He also has square yellow sunglasses with red lenses."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/be/Mr._7_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180909043859", "caption": "Mr. 7's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mr. 7 seems to have a laid back, though slightly more serious attitude than his partner. Like other characters, he has a unique laugh, his being \"Ohahahaha\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Mr. 7, together with his partner, Miss Father's Day, form the sniper pair of Baroque Works. His Yellow Gun is a custom-made flintlock, which shoots dice-shaped bullets that have seven dots on them, which he fires so they line up with Miss Father's Day's bullets, creating an explosion."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "Crocodile gave them the job to guard the cannon at the top of the clock tower until it went off and destroyed the people fighting in the middle of the capital city of Alabasta, Alubarna (both unaware of the fact that they would be caught in the blast as well). He always seems to yawn or whisper to Miss Father's Day. Both he and Miss Father's Day were defeated by Princess Vivi. It is unknown what happened to him after the war."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3f/Mr._7_and_Miss_Father%27s_Day_Preparing_to_Destroy_Alubarna.png/revision/latest/scale-to-width-down/210?cb=20130307171158", "caption": "Mr. 7 and his partner about to destroy Alubarna."}]}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids dub of the anime, he uses phrases and terms commonly used during the 1970s."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Playable Appearances", "level": 3, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In an SBS, a fan asked what Mr. 7 would look like if he were promoted. Oda drew what Mr. 7 would look like if he became the new Mr. 6, altering his eyebrows, sunglasses, mouth, and nose to look like 6's.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/SBS_Vol_23_1.png/revision/latest/scale-to-width-down/200?cb=20180529143310", "caption": "Mr. 7 promoted."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 22 Chapter 205 and Episode 124, Mr. 7 makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 21 Chapter 190 (p. 8), Mr. 1 and Miss Doublefinger reveal that a previous Mr. 7 asked Zoro to join Baroque Works.", "elements": []}]}], "images": []}]}