{"sections": [{"title": "Miss Father's Day", "level": 1, "content": [{"type": "paragraph", "text": "Along with Mr. 7, Miss Father's Day is part of the \"sniping\" pair who apparently are deployed for jobs by the Baroque Works where sniping is necessary."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Miss Father's Day has a strange sense of fashion involving frogs. She has purple hair, with a long, thin widow's peak. Over her hair she has a frog styled hat, with appendages jutting out with white balls on the end. She wears a purple shirt with pink dots that shows off her belly with a yellow button up shirt underneath, and a blue tie. She has frog styled sleeves at the end of her shoulders, and white gloves. She wears a purple skirt with pink dots on it, and a frog styled decoration with white balls on the end. She also has frog themed boots, that go up to the middle of her shins."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bd/Miss_Father%27s_Day_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180909043906", "caption": "Miss Father's Day's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She seems very nonchalant about whatever she has to do. She seemed very relaxed about her mission to set off the bomb in the clock tower. She also can act overconfident, as she was talking to Mr. 7 about getting a promotion before their assignment was over."}, {"type": "paragraph", "text": "Like many characters in One Piece she has a unique laugh: 'geeerogerogerogero' (or 'Ribbitribbitribbit' in the English adaptations)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "She is a very good sniper and works well with her partner, being able to line up their shots so they collide exactly where they want. She wields a gun shaped like a frog that shoots frog-shaped bullets, called Gero Gero Gun (ゲロゲロ銃, Gerogero Gan, \"Gero\" being the sound in Japanese frogs make; FUNimation dub: \"Ribbit Ribbit Gun\")."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "Miss Father's Day first shows up in the main story briefly during the climax of the Alabasta arc manning the giant cannon that Baroque Works had placed in the Alabasta capital, Alubarna. Princess Vivi figures out the location of this cannon and, during the final moments of the battle of Alubarna, she (with the Straw Hat Pirates' help) attacks it. Miss Father's Day and Mr. 7 attempt to stop her, but Vivi skillfully evades their gunfire and defeats them by using her peacock slashers. Miss Father's Day was also responsible for sniping down an airborne Pell while his attention was occupied by looking for the bomb and at Vivi and the Straw Hat Pirates. It is unknown what happened to her after the war."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Miss Father's Day and Mr. 7 vs. Zoro, Nami, Usopp, Sanji, and Chopper", "elements": []}, {"text": "Miss Father's Day and Mr. 7 vs. Nefertari Vivi", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the 4Kids English dub of the anime, she speaks with a French accent. This has generated some controversy among fans since \"frog\" is an ethnic stereotype for a French person."}, {"type": "paragraph", "text": "Also in the 4Kids dub, her dialogue from when she shot Pell is edited out."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Playable Appearances", "level": 3, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 3, "content": [{"type": "list", "elements": [{"text": "Grand Battle! Swan Colosseum", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 22 Chapter 205 and Episode 124, Miss Father's Day is introduced.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 81.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 206 and Episode 125, Miss Father's Day talks about their assignment.", "elements": []}]}], "images": []}]}