{"sections": [{"title": "Ipponmatsu", "level": 1, "content": [{"type": "paragraph", "text": "Ipponmatsu is the owner of an arms shop in Loguetown and Ipponume's husband. He is the previous owner of Sandai Kitetsu and Yubashiri."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a short man with black hair that goes to the sides of his head. He has tan skin and wears a blue shirt. His nose is red."}, {"type": "paragraph", "text": "The crest-like piece of hair on his forehead shifts between arcing up to arcing down several times in the chapter."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cd/Ippon-Matsu_Boss_Luffy_Historical_Special.png/revision/latest/scale-to-width-down/135?cb=20170929131324", "caption": "Ipponmatsu in \"Boss Luffy Historical Special\"."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ipponmatsu has a large knowledge of swords and seems to really like them. Despite trying to trick Zoro into selling him the Wado Ichimonji, Ipponmatsu has some conscience, initially refusing to sell the Sandai Kitetsu because of the sword's curse of bringing death and insanity to its wielders. He also stated that he likes bad guys and was shown to be a fan of Roronoa Zoro, as Ipponmatsu was the one who gave him the replacement swords: one destroyed and one that he currently uses."}, {"type": "paragraph", "text": "Ipponmatsu is also a man of honor, as after witnessing Zoro's bravery at testing his luck against the Sandai Kitetsu, Ipponmatsu willingly gave him his best sword and acknowledged Zoro as a true swordsman while mentioning it had been a long time since a real swordsman had entered his shop."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Ipponume", "level": 3, "content": [{"type": "paragraph", "text": "Ipponmatsu has a good relationship with his wife. He calls her \"honey\" and \"dear\" and cleans the bathtub for her. However, Ipponume thinks that he is a \"cheapskate\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/Ipponmatsu_and_Ipponume.png/revision/latest/scale-to-width-down/180?cb=20191107153038", "caption": "Ipponmatsu and his wife."}]}, {"title": "Zoro", "level": 3, "content": [{"type": "paragraph", "text": "When he first met Zoro, he thought that he was an amateur because of the little amount of money he had with him at the time. However, Ipponmatsu was greatly impressed by the swordsman's skill after he tested his luck against the curse of Sandai Kitetsu. He even gave Zoro his family heirloom for free. The shop owner believed that he entrusted his dream to Zoro. Ipponmatsu still thinks highly of Zoro after two years since he now has an enlarged poster of Zoro in his bath."}], "images": []}, {"title": "Tashigi", "level": 3, "content": [{"type": "paragraph", "text": "Ipponmatsu dislikes Tashigi, thinking that she is a timid girl and an amateur regarding swords. He even threatened to sue her for obstruction of business when she ruined the shop owner's trickery. However, he polished her sword, Shigure, for her."}], "images": []}, {"title": "Smoker", "level": 3, "content": [{"type": "paragraph", "text": "Ipponmatsu thinks of him as a monster because of his Devil Fruit powers. When Smoker was in charge of the Marine base, the shop owner disliked him because he lost his customers due to the Marine captain's presence."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in the past, Ipponmatsu became the owner of an arms shop in Loguetown. He used to have multiple pirate customers that were looking to enter the Grand Line. However, since Smoker was put in charge of the Marine base on the island, Ipponmatsu barely had any customers."}], "images": []}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "At some point, Tashigi brought her sword, Shigure, to Ipponmatsu's arms shop to get it polished. The shop owner accepted the job and later finished polishing the sword."}, {"type": "paragraph", "text": "When he first met Zoro, Ipponmatsu acted polite due to Zoro being his first customer in a long time, but he became dismissive when he discovered that Zoro only had 100,000 on him. After he recognized the Wado Ichimonji held by the swordsman, he tried to fool Zoro to sell it for far less than it was worth, but Zoro refused to sell it. He stopped trying when Tashigi showed up and ruined his plan. His greedy attitude changed when Zoro tested his luck against the Sandai Kitetsu, tossing it up into the air and holding out his arm to see if it would be sliced off. The sword missed Zoro's arm entirely, defying Ipponmatsu's refusal to sell it due to the curse on the blade."}, {"type": "paragraph", "text": "Ipponmatsu was impressed by Zoro's skill, so he gave him both Sandai Kitetsu and Yubashiri, his family heirloom and his store's best sword. He told his wife that he was passing on his dream to Zoro."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "While cleaning his bathroom, Ipponmatsu proudly talked to Ipponume about the enlarged poster of Zoro on the wall behind him."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Ipponume tells him to go clean the bathtub, while in the anime she tells him to take out the garbage."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}, {"text": "Legend of the Rainbow Island", "elements": []}, {"text": "Aim! The King of Berry", "elements": []}, {"text": "One Piece (Game Boy Advance)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ipponmatsu made a cameo appearance in the The Detective Memoirs of Chief Straw Hat Luffy TV special. He was the owner of a shop that was attacked by the Clown Clan. He insulted Buggy's nose, so the criminal almost shot him. Buggy then stole all of his money. However, as discovered by Chief Luffy, Ipponmatsu's money was counterfeit, so he was arrested later.", "elements": []}, {"text": "Ipponmatsu's favorite food is ippon udon, a singular thick udon noodle which is usually served on its own in soup.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 97 (p. 5-18) and Episode 49, Ipponmatsu first appears and gives two of his swords to Zoro.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Ipponmatsu's name is romanized and his information is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 64 Chapter 630, cover story: From the Decks of the World Vol. 15, Ipponmatsu appears again after two years.", "elements": []}, {"text": "↑  Ipponmatsu appears in the 4th Special Episode.", "elements": []}]}], "images": []}]}