{"sections": [{"title": "Yu", "level": 1, "content": [{"type": "paragraph", "text": "Yu is a little girl who accidentally bumped into Smoker and got ice cream on his uniform."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yu is a young girl, with blonde hair. She has her hair in a ponytail in the back, and part of it in the front. In her hair, she wears two blue clips. She has big brown eyes, and wears a tan shirt, with a striped red and white color, and two orange stripes on the end of the sleeves."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She is a young innocent girl, who was excited to get some ice cream. When seeing that she had spilled her ice cream on Smoker's uniform, she seemed very scared."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "After getting a triple scoop of ice cream, she was very excited. She ran down the streets of Loguetown, only to run into Captain Smoker."}, {"type": "paragraph", "text": "Her father, scared that the captain might do something harsh, apologized for Yu. But, Smoker was not angry. He apologized for his uniform \"eating her ice cream\"; to the surprise of her frightened father. Smoker then proceeded to give her some money to buy another cone."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Smoker_Comforts_Yu.png/revision/latest/scale-to-width-down/200?cb=20191208160057", "caption": "Smoker comforts Yu after she bumped into him."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 98 and Episode 48, Yu makes her debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Yu's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 56), Yu's name is revealed.", "elements": []}]}], "images": []}]}