{"sections": [{"title": "Negikuma Maria", "level": 1, "content": [{"type": "paragraph", "text": "Negikuma Maria is the big woman who spoke to Dalton while the Straw Hat Pirates were in Bighorn."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Negikuma Maria is a big woman roughly twice the height of Luffy. Her body shape looks like that of a Hiking Bear, so much that Luffy and Usopp mistakenly took her as one and bowed their heads. She has curly hair that is in a round shape."}, {"type": "paragraph", "text": "She wears a brown coat with dark brown buttons that covers her whole body, with white fur on the ends of the sleeves, the hood, and the bottom of the coat, along with light brown frills on the chest, and a dark brown stripe where the upper body separates from the lower body. She also wears a light red scarf and dark brown shoes that have white fur at the top."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Negikuma_Maria_Portrait.png/revision/latest/scale-to-width-down/200?cb=20130603210028", "caption": "Maria's face up close."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Maria is leery around pirates because Drum Island had been previously destroyed by them.  Otherwise, she is a typical housewife, and she cares for her two children."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Dalton", "level": 3, "content": [{"type": "paragraph", "text": "Maria knows Dalton personally, and she greets Dalton in a very friendly manner as they meet. She also has strong trust in Dalton's judgment, as seen in their conversation about the Straw Hat crew."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Drum Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "When the Straw Hat Pirates were searching Drum Island for a doctor with the help of Dalton, they met Maria in the village of Bighorn. Luffy and Usopp mistook her for a Hiking Bear and bowed to her as she approached. Maria had heard the news of the arrival of a group of pirates and was worried by it since the country was previously destroyed by the Blackbeard Pirates' raid. She asked Dalton if everything was alright, which he confirmed."}, {"type": "paragraph", "text": "That day was her eldest son's birthday and she wanted to bake an onion cake for celebrating, so she was out looking for onions. The second time she appeared, she informed Dalton that Dr. Kureha was in the next village. During that occasion, she had a lot more onions in her basket."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ad/Negikuma_Maria_Bear.png/revision/latest/scale-to-width-down/220?cb=20130319021109", "caption": "Luffy and Usopp mistake Maria for a Hiking Bear."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Maria's surname, Negikuma, seems to be derived from the Japanese name for the A. fistulosum, negi, and the Japanese word for bear, kuma. The onions that Maria collected for her son's birthday cake were the same kind of onion.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 15 Chapter 133 and Episode 80, Negikuma Maria makes her debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Negikuma Maria's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 64), Negikuma Maria's age is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 16, Negikuma Maria is named.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 15 Chapter 134.", "elements": []}]}], "images": []}]}