{"sections": [{"title": "Agotogi", "level": 1, "content": [{"type": "paragraph", "text": "Agotogi was the leader of a gang of bandits who tried to kidnap Vivi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Agotogi is a man of regular height, who has red spiky hair. He wears an open-up green kimono with a few purple dots on it. He wears brown pants with a yellow sash to hold it up. He also wears typical sandals. It is also notable that he was always seen smiling until he was defeated."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He seems greedy, as he tried to kidnap Vivi so that he could ransom her for money. He was quite persistent, continuing in his pursuit of Vivi until his defeat. He was also merciless, going as far as injuring children."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Agotogi was seen wielding a large knife. Not much is known about his true strength, but he seemed very weak as he was defeated easily by Koza at a young age."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He tried to kidnap Vivi, but the Suna Suna Clan attacked him while telling Vivi to run away. Agotogi easily beat up the clan except Koza. Koza tried to protect Vivi at all costs and ended up beating Agotogi but he pushed him away and was about to kidnap Vivi but Cobra showed up and kicked him away. His fellow bandits also ended up beaten by Pell and Chaka. In the end, Agotogi was arrested and he has never been seen again since."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a1/Koza_Beats_Agotogi.png/revision/latest/scale-to-width-down/210?cb=20130518181015", "caption": "Koza defeats Agotogi."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Agotogi and his bandit gang vs. Suna Suna Clan", "elements": []}, {"text": "Agotogi vs. Koza", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Agotogi's name means \"pointed chin\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 18 Chapter 164 and Episode 100, Agotogi is introduced in a flashback.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Agotogi's name is revealed.", "elements": []}]}], "images": []}]}