{"sections": [{"title": "Octopako", "level": 1, "content": [{"type": "paragraph", "text": "Octopako is an octopus fish-woman whom Hatchan tried to win over during his cover story, Hatchan's Sea-Floor Stroll."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As an octopus fish-woman, Octopako has six arms and two legs, making a total of eight appendages, all of which are slender."}, {"type": "paragraph", "text": "She wears a tanktop and a round hat with goggles, with her long hair jutting out, as well as sandals."}, {"type": "paragraph", "text": "In the anime, she is depicted with pink skin, dark pink lips, and blonde hair. Her hat is black and white and she wears a light pink tank top with dark pink flower pattern."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Octopako is very vain and snobbish. She only thinks of herself and generally does not care for the feelings of others, least of all Hatchan. Being raised as a celebrity, she dreams of marrying a prince. Never having stepped into Ryugu Palace, she was angry that the Straw Hat Pirates were invited by King Neptune."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Octopako possesses the typical abilities of her race, such as the ability to breathe underwater and natural strength ten times that of an average human, and twice that underwater."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Octopako is a celebrity girl who grew up in Gyoverly Hills. She dreamed of marrying a prince. Despite her ambitions, she never had a chance of stepping into Ryugu Palace."}], "images": []}, {"title": "Hatchan's Sea Floor Stroll", "level": 3, "content": [{"type": "paragraph", "text": "When Hatchan met with Octopako, he became attracted to her, and tried to win her affection. Unfortunately for him, her vanity and snobbishness led to several rejections. When Hatchan started to cook takoyaki, Octopako was attracted to the smell, and demanded some while disregarding the Catfish Village's hunger problem. However, Hatchan instead gave the takoyaki to the hungry catfish, which led Octopako to once again reject the cook."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "After King Neptune invited the Straw Hats to the Ryugu Palace, she seemed furious. She was later seen among the fish-men and merfolk fleeing the island as the ark, Noah, was falling down on it."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She is the first female fish-man to appear in the series, and the only one to be given a name.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 40), Her birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 22 Chapter 203, cover story: Hatchan's Sea-Floor Stroll Vol. 18, Octopako is introduced.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 23 Chapter 214, cover story: Hatchan's Sea-Floor Stroll Vol. 28, Octopako does not show any care for the tragedy of the headband catfish.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 63 (p. 42), Octopako's past and appearance on Fish-Man Island revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 62 Chapter 612, Octopako is seen as the Straw Hat Pirates leave together with King Neptune.", "elements": []}]}], "images": []}]}