{"sections": [{"title": "Erik", "level": 1, "content": [{"type": "paragraph", "text": "Erik is a member of the Rebel Army in Alabasta led by Koza. He is from Suiren, a town that had been completely dried out."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He has long, dark pink hair along with a little stubble on his chin. Erik wears a black top hat and a dark blue coat with badges on the chest and side of the arm."}, {"type": "paragraph", "text": "After the timeskip, he is seen with his hair noticeably longer, and is wearing shorts and a shirt that retains his badges."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Erik was willing to risk his life for a cause he believed in. As a rebel member, he was willing to fight against the super strong Alabasta army, and only wanted what was best for the country."}], "images": []}, {"title": "Relationships", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the Rebel Army, Erik believes in Koza's ideals and also participated in the big war on Koza's side. He is also friends with fellow members of the Rebel Army, like Farafra, Okame and Kebi."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Erik has been shown to be a fairly strong and skilled fighter, since he was able to clash with Alabasta army members with ease."}, {"type": "paragraph", "text": "He played a major role in the rebel army, so Koza must have seen leadership ability in him as well."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Erik has been seen fighting with a sword, and he seems to be fairly proficient in using it, since he was at, if not beyond, the fighting ability of the Alabasta army members."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Erik was a kid, he met Koza at some point and became good enough friends to join the Suna Suna Clan. He and the other kids managed to protect Vivi from Agotogi and his gang of thugs."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [{"type": "paragraph", "text": "Years later, Erik became a member of the Rebel Army led by Koza.Kappa, a child from Nanohana tried to join the rebels, but Koza, Erik, and the others wouldn't let him. When Koza was shot by the imposter King Cobra, Erik and Kebi take on leadership positions and try to help Koza out. When the pirate ship is overturned and Kappa is attacked by Mr. 1 and Miss Doublefinger, he believes it was an act by the royal army and wants to avenge the innocent injuries."}, {"type": "paragraph", "text": "Later on, he and the other rebels clash head on with the royal army as Vivi tries to stop the fighting."}, {"type": "paragraph", "text": "When Koza is shot by a Baroque Works member disguised as a royal army member while trying to surrender with the royal army, Erik and the other rebels believe the peace proposition was a trap and that the army can't be trusted, causing more fighting to ensue."}, {"type": "paragraph", "text": "After the fighting has stopped due to the rain and Crocodile's defeat, Erik, Koza, and the other rebels ask for forgiveness, but King Cobra tells them the past can't be undone and that we must continue living."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/87/Koza%27s_Rebellion_and_Alabasta%27s_Royal_Guards_Clash.png/revision/latest/scale-to-width-down/220?cb=20130503122419", "caption": "Erik and the other rebels clash with the royal army."}]}, {"title": "Two Years Later", "level": 3, "content": [{"type": "paragraph", "text": "Erik was seen next to Koza, who became the Environmental Minister of the kingdom of Alabasta."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Erik and the Rebel Army vs. Royal Guards of Alabasta", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 167 and Episode 105, Erik is first introduced.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 171 and Episode 107, Erik helps out Koza when he is first shot.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 172 and Episode 107, tErik and the rebels find Kappa injured.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 20 Chapter 182 and Episode 112, Erik and the rebels begin directly fighting with the royal guard.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 22 Chapter 198 and Episode 121, Erik and the rebels believe the royal army tricked them into a fight.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 211 and Episode 127, Erik and the other rebels ask the king for forgiveness of their actions.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 65 Chapter 638, cover story: From the Decks of the World Vol. 22, Erik is seen with Koza and Farafra after the timeskip.", "elements": []}]}], "images": []}]}