{"sections": [{"title": "Porchemy", "level": 1, "content": [{"type": "paragraph", "text": "Porchemy was a member of the Bluejam Pirates until he was killed by his captain Bluejam for losing to Ace and Sabo."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Porchemy was a very large man with long whitish blue hair, narrow eyebrow-less eyes, and a broad chest with an open red, ruffle-edged vest. He had tattoos on his left bicep and wore an earring on each ear. He also wore a yellow sash with stripes around his waist and a belt over it. He wore regular pants and boots. He was seen carrying a large sword as well."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Porchemy_Portrait.png/revision/latest/scale-to-width-down/180?cb=20190724224227", "caption": "A close-up of Porchemy's face."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He was not easily fooled, as he could tell Luffy was lying. He was seemingly a ruthless pirate, due to his intolerance of Luffy and the degree of violence he used to interrogate Luffy to talk, along with Sabo's claim that he skins the heads of those he fights."}, {"type": "paragraph", "text": "He appeared to have some sense of pride for his status as a pirate, as he said that \"he will quit being a pirate\" if he is beaten by kids."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He appeared to have some knowledge about Devil Fruits, as he did not appear shocked learning about Luffy's powers and quickly decided on a method that could harm Luffy."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wields a sword, resembling a cutlass, and also has spiked gloves to increase the damage done from his punches. He was also strong enough to wield a very large mallet. Despite this, he was defeated by Ace and Sabo."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He was introduced with two fellow Bluejam pirates, one of whom had been seemingly attacked by Ace, as they heard children's voices. He caught Luffy as he was trying to escape from Ace and Sabo. Luffy blurted out Ace's name but when Porchemy asked about where the treasure was that Ace stole, Luffy responded that he did not know (in an incredibly suspicious way), but Porchemy easily saw through his lies and took Luffy away."}, {"type": "paragraph", "text": "He later tries to convince Luffy to speak by coercion, first unsuccessfully using a large mallet and later with spiked gloves. After he switches to a sword and is about to murder Luffy once and for all, he is attacked and defeated by Sabo and Ace, who came back to rescue Luffy. After his failure, his captain, Bluejam, disgusted by his weakness, shoots and ruthlessly executes him, saying that he is pathetic."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Porchemy_Tortures_Luffy.png/revision/latest/scale-to-width-down/210?cb=20141206164158", "caption": "Porchemy torturing Luffy to reveal the location of Ace and Sabo's hidden loot."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Porchemy vs. Sabo and Portgas D. Ace", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 583 and Episode 494, Porchemy is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 166), Porchemy's birthday is given.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0660), Information about Porchemy is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 583 and Episode 494, Porchemy encounters Luffy and was not fooled by Luffy's obvious lies.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 584 and Episode 495, Porchemy is defeated by Ace and Sabo, and then killed by Bluejam.", "elements": []}]}], "images": []}]}