{"sections": [{"title": "Bluejam", "level": 1, "content": [{"type": "paragraph", "text": "Bluejam was the captain of the Bluejam Pirates, and an infamous pirate of the East Blue. He was one of the main antagonists of the Post-War Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bluejam was a rather tall man with short hair on the top of his head, that is fashioned in a striped manner, while the hair flowed down long and unkempt down his sides. It seemed half of his molars were missing in an alternating pattern, and he wore a traditional captain's jacket over a white shirt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bluejam was a cruel pirate, who murdered his own subordinate for failure. He was also deceptive as he claimed that he liked strong people which incited Ace and Luffy into his crew. However, this was only part of his ploy to use them to load explosives into the Gray Terminal, and then tying them down to leave them to die in the flames after they refused to join his crew."}, {"type": "paragraph", "text": "On top of this, his most defining character trait was his wish to become a Noble, for the wealth and the life would grant him. When the king of the Goa Kingdom promised to make him a noble if he would burn down the Gray Terminal and kill its inhabitants, he quickly agreed. This proved to be his downfall, as he was betrayed and left to die with the other inhabitants."}, {"type": "paragraph", "text": "Bluejam also believed that on the battlefield the only ones who survived were the strong and cowardly."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Bluejam was a well-known pirate in the East Blue, whose feared reputation had been remarked by many characters since his first appearance. He was shown to have a strong will, appearing unaffected by Ace's burst of Haki, while his entire crew fainted."}, {"type": "paragraph", "text": "His bounty of 14,300,000 attests that he was considered a significant threat within East Blue, where any bounty over 10,000,000 is noteworthy."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Bluejam was seen using a flintlock when shooting Porchemy to death, and also wielded a rifle during the arson of the Gray Terminal. He was later armed with a long, standard pirate sabre, which he seemed quite proficient in wielding, as he was able to draw it and parrying Curly Dadan's attack in mere seconds."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Portgas D. Ace and Sabo stole Bluejam's money to buy a pirate ship. After Porchemy's defeat at the hands of Ace and Sabo, Bluejam shot Porchemy dead. Later, Sabo's father paid him and his crew to find his son for him, so he could take him home to live with his family. He was also ordered to \"take care\" of Ace and Monkey D. Luffy so that they would never bother Sabo again."}, {"type": "paragraph", "text": "Instead of killing Ace and Luffy right away, he convinced them to help him move some cargo boxes to marked points in a map. In reality, the boxes contained explosives and oil, that would be used to start a fire that would kill everyone in Trash Mountain. Bluejam was promised by the King of Goa Kingdom that if he succeeded, he would be made a noble. However, once the plan was in operation, Bluejam and his pirates were deceived and left outside the Great Gate to die in the fire they themselves created."}, {"type": "paragraph", "text": "Bluejam's crew were used by the nobles, who put the blame for the fire all on them, ironically believing they did so to prevent the World Nobles from visiting. Bluejam attempted to head back to his boat, but it was caught up in flames as well, and it was then, when he spotted Ace and Luffy. Infuriated, he threatened to kill them if they did not tell him the location of their treasure. Ace revealed the location and Bluejam's crew tried to take Ace and Luffy with them, but were stopped by Dadan and her family of Mountain Bandits."}, {"type": "paragraph", "text": "The bandits managed to save the children, but, when provoked by Bluejam, Ace stayed behind to fight him. Dadan, feeling responsible for Ace, stayed behind, too. After a brief fight, Bluejam was defeated by the combined efforts of Ace and Dadan."}, {"type": "paragraph", "text": "It is unknown what happened to him afterwards, but he is most likely dead due to the fire started by his crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Dadan_vs._Bluejam.png/revision/latest/scale-to-width-down/200?cb=20141206164032", "caption": "Bluejam vs. Curly Dadan."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bluejam vs. Curly Dadan and Portgas D. Ace", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The anime shows his defeat in more detail, where it is shown that during the fight, Bluejam was overpowering the two of them. However, Ace managed to strangle him while Dadan gave him a beating. The fight presumably left Bluejam unconscious and he likely perished in the fire."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 584 and Episode 494, Bluejam is introduced.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0661), Information about Bluejam is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 151), his birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 584 and Episode 494, Bluejam kills Porchemy for losing to Ace and Sabo.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 585 and Episode 500, Bluejam retrieves Sabo from Ace and Luffy.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 586 and Episode 500, Bluejam reveals his desire to be a noble, and that he was contracted the Goa king to destroy Gray Terminal.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 587 and Episode 501, Bluejam's last actions after being betrayed by his contractors.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 96 and Episode 45, Lieutenant Brannew explains the East Blue bounties.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 588 and Episode 503, Ace and Dadan return to Mount Colubo, revealing that they successfully defeated Bluejam.", "elements": []}]}], "images": []}]}