{"sections": [{"title": "Pisaro", "level": 1, "content": [{"type": "paragraph", "text": "Pisaro is the musician of the Arlong Pirates. He is an ocean sunfish fish-man. He was previously a member of the Sun Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pisaro is a normal sized fish-man, with large lips and light blue skin, and curly brown hair. He wears a purple short-sleeved, button-up open shirt with pink stars on it. He also wears a puffed collar around his neck, a white sash, tan shorts, and sandals, and he is usually seen carrying maracas. He has a red star tattoo on his chest. In the manga, he was overweight, but in the anime, he was quite muscular."}, {"type": "paragraph", "text": "When the Arlong Pirates first arrived at Cocoyasi Village, Pisaro wore a flower-patterned shirt."}, {"type": "paragraph", "text": "When he was a member of the Sun Pirates, Pisaro wore similar attire, and the anime kept the same differences of a slimmer appearance. In the anime, he wore a green vest with yellow lines on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Pisaro is fearful of Arlong’s rage, as seen when he and his crewmates tried to calm Arlong down and prevent him from destroying Cocoyasi Village. He is very allegiant to Arlong and followed him to the East Blue, and he seemed indifferent to Arlong’s mistreatment of humans."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a fish-man, he possesses the strength of ten men and has incredible mobility underwater as well as the ability to stay submerged for as long as he desires. When in the water, he possesses the strength of twenty men. This strength was shown when Pisaro picked a man up by his leg and flung him to the ground."}, {"type": "paragraph", "text": "As a musician, Pisaro often carries around maracas. However, his skill with them is unknown, as he has not been shown playing them to much extent."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Pisaro was once part of the Sun Pirates, as seen when he and his comrades cheered over a group of defeated Marines.. After Tiger died and the crew split up, he joined Arlong and several other fish-men on his quest to set up a Fish-Man Empire in East Blue."}, {"type": "paragraph", "text": "When the Arlong Pirates invaded the Conomi Islands, Pisaro spotted smoke coming out of Bell-mère's chimney and told Arlong right before the crew was going to leave the village. After Arlong killed Bell-mère and took Nami to be his mapmaker, Genzo and the other villagers tried to revolt. The Arlong Pirates attacked them, with Pisaro grabbing a man by the leg and flinging him to the ground."}], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Arlong came to Cocoyasi Village and began tormenting Genzo, Pisaro stood alongside his comrades and watched. After Usopp stood up for Genzo and shouted down the pirates from the roof of a house, Arlong tore the entire building up from the ground, and Pisaro and his comrades tried to calm Arlong down and tell him not destroy the village. Arlong threw the building anyway, but when Usopp survived, Pisaro and another fish-man had to hold Arlong back to prevent him from leveling the entire village."}, {"type": "paragraph", "text": "Later, Chew captured Usopp and brought him to Arlong. He threatened Usopp before Nami struck Usopp down with her staff, prompting a confrontation. Usopp launched a Smoke Star, causing Pisaro and the others to lose sight of Usopp. Nami found him and pretended to stab him, cutting into her own hand before pushing him into the sea."}, {"type": "paragraph", "text": "He was defeated by the Straw Hat Pirates early in the battle when they attacked Arlong Park. Pisaro was eventually arrested by the Marines."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In Episode 33, Pisaro helps carry Arlong through the forest back to Arlong Park. However, Arlong breaks free from his grip with rage, recalling his hatred toward Usopp. Pisaro and Kaneshiro, having both been knocked on the ground, cower in fear of Arlong’s anger. After Arlong collects himself, the group returns to Arlong Park. This scene occurs between Arlong’s encounter with Usopp in Gosa Village and when he finds his crew defeated by Zoro at Arlong Park."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Non-Playable Game Appearances", "level": 3, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush", "elements": []}, {"text": "One Piece: Grand Adventure", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He is the very first musician to appear in the series.", "elements": []}, {"text": "He appears in the Arlong Park stage of One Piece: Grand Battle! Rush and One Piece: Grand Adventure. Hitting him results in either Kuroobi, Hatchan or Chew attacking the player.", "elements": []}]}], "images": []}]}