{"sections": [{"title": "Magra", "level": 1, "content": [{"type": "paragraph", "text": "Magra is a member of the Dadan Family that are active on Mt. Colubo on Dawn Island. He helped take care of Ace and Luffy for Garp."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Magra's overall appearance resembles that of a chicken. He has what appears to be a wattle on his chin, and a comb on his bald head. He has a mustache and sideburns, and big eyelashes, similar to Franky's. He's always seen with a rather worried look on his face."}, {"type": "paragraph", "text": "He wears a decorated jacket paired with a scarf around his neck, and a pairs of shorts held up by a standard sash. He also sports what appear to be long, striped socks. He carries a saber on his right hip."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c3/Magra_Anime_Full_Body.png/revision/latest/scale-to-width-down/210?cb=20150828191319", "caption": "A full body view of Magra in the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Whenever Dadan is throwing a fit, Magra is the one who will try to calm her down."}, {"type": "paragraph", "text": "He seems sincerely interested in Luffy's welfare, as he immediately took care of him after his rescue from Bluejam, and urged him to stay in bed in order to heal from his wounds and to avoid the Noble's soldiers. Also, like the rest of his companions, he is extremely loyal to Dadan, as he's always by her side, and was seen crying with the others when she did not return from the arson of Gray Terminal. He was also the one who tried to stop Dadan from beating up Garp any further for Ace's death."}], "images": []}, {"title": "Abilities", "level": 2, "content": [{"type": "paragraph", "text": "Magra does not seem to possess any particular abilities, but the fact that he is part of the Dadan Family indicates that he possesses discreet abilities."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries a saber by his side, but his skills with it are not known."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Taking Care of Garp's Grandsons", "level": 4, "content": [{"type": "paragraph", "text": "He is first seen with Dadan and the rest of the bandits when Garp came to leave Luffy in their care. When Dadan gets annoyed at Luffy during his first day at her house, Magra would try to calm Dadan down."}, {"type": "paragraph", "text": "He was later seen, along with Dogra, when the two of them were keeping an eye on Ace and Luffy while they were in the forest together."}, {"type": "paragraph", "text": "After Gray Terminal was set on fire, he was seen with Dadan and the rest of the bandits when they came to rescue Luffy and Ace from Bluejam. The bandits carried Luffy away when they ran from the fight. They managed to get away from the fire, but with Ace and Dadan nowhere to be seen, Magra and the other bandits cried. After returning to the Dadan house, Luffy wanted to make sure that Ace and Dadan were all right. Magra told Luffy that it is not safe to return to the Gray Terminal with the Goa soldiers there cleaning up after the fire. Magra did his best to calm Luffy down when he started getting distressed."}, {"type": "paragraph", "text": "When Ace and Dadan returned, Magra and the other bandits were very happy to see them safe. Years later, Magra was seen with the other bandits bidding farewell to Ace when left to become a pirate."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Ace died in the Whitebeard War, Magra was seen alongside the Dadan family, who were occupying Partys Bar, waiting for Garp to return. When Garp returned from the war, Dadan stepped outside and beat Garp repeatedly. Magra then held Dadan back until Makino calmed her down."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After reading the news about Luffy's return, the entire Dadan Family celebrates, including Magra, who reads the newspaper article about the return with an excited look on his face."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/Dadan_Family_Post_Timeskip.png/revision/latest/scale-to-width-down/150?cb=20130913000136", "caption": "Magra two years later with Dadan Family."}]}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "When the news of Luffy's new bounty after his victory over Doflamingo reached Dawn Island, the Dadan Family celebrated along with the people of Foosha Village."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Levely, the Dadan Family read some distressing news concerning Sabo, causing them to be upset."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name seems to come from Yumeno Kyūsaku's novel \"Dogra Magra\".", "elements": []}, {"text": "He has a habit of beginning each sentence with, \"Now, now...\"", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 172), Magra's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 80 Chapter 806, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 2.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956 (p. 11).", "elements": []}]}], "images": []}]}