{"sections": [{"title": "Sterry", "level": 1, "content": [{"type": "paragraph", "text": "Sterry is the king of Goa Kingdom and the husband of the queen, Sarie Nantokanette."}, {"type": "paragraph", "text": "He was adopted by Sabo's family at eight years of age, having originally been born in a separate noble family."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "At eight years old, he was somewhat tall for his age, since he was two years younger than Sabo but was still about the same height as him. He wore a shirt with frills going down the middle along with a bow-tie and suspenders. He was often seen smiling. He had a round head with a thin, flat nose and a bowl-shaped haircut."}, {"type": "paragraph", "text": "As an adult, Sterry is much taller, wearing a jacket with a sash on the back over a frilly shirt, frills on his shoulders, and a high collar, as well as a crown on his head. He still has the same hairstyle as he did as a child."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like most nobles in the Goa Kingdom, he is an arrogant person who does not care for anyone that is of lesser status than himself, referring to them as trash. This extends to referring to Sabo as \"stupid\" and \"trash\" due to what he heard from their parents, all casually, disregarding any manners or respect. As an adult, Sterry still acts rudely to people of lower status and acts spoiled, as he complained about his lavish living quarters in Loguetown. He even treated the Marine hero Monkey D. Garp rudely because Garp was a citizen of his kingdom, and was aghast when Garp insulted him. However, Sterry can put up a facade of good manners and devotion in front of his adoptive parents."}, {"type": "paragraph", "text": "Although Sterry's teacher and adoptive parents stated that he was extremely intelligent when he was a child (though by their noble standards), he seems to be extremely ignorant about much of the world, with his views on other races being mainly based on racist stereotypes and rumors. He considers fish-men to be fish and believes they have a disease, and was unable to identify Neptune as a merman. He has a condescending attitude around the royalty of Fish-Man Island, silently mocking their decision to explore the forests of Mary Geoise, viewing it as an ignorance of human amenities."}, {"type": "paragraph", "text": "He is also not very brave, crying in fear when Sabo threatened him, and shunning any responsibilities when Sabo ran away again. As an adult, he shrunk back in fear upon seeing a flock of crows near his bondola, worrying they could send him plummeting down the Red Line. He also became panicked when being moved on Mary Geoise's travelator for the first time, thinking it was an earthquake."}, {"type": "paragraph", "text": "He is hungry for power and does not make it a secret, as he explicitly asked Garp about ways to become a World Noble. He even showed a great interest in sitting on the Empty Throne and ruling over the entire world, despite the World Government's creed that \"no-one\" should sit in it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/62/Sterry_Falls_Depressed.png/revision/latest/scale-to-width-down/210?cb=20190517093500", "caption": "Sterry falls depressed after Garp treats him insolently instead of as his king."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As king of the Goa Kingdom, Sterry has authority over its subjects as well as considerable wealth, and he can attend Levely."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When he was eight years old, Sterry's biological parents were unable to continue raising him and he was adopted by Outlook III and Didit since he had shown lots of promise. When Sabo was brought home by his father after running away to Gray Terminal, Sterry introduced himself to him. Later, he went into Sabo's room to insult him as he had heard their parents do, and revealed that Sabo was lucky to have been brought home before the nobles had Gray Terminal burned down in preparation for a World Noble's arrival. Sabo grabbed Sterry and forced him to tell him about this plan, and Sterry watched in shock as Sabo jumped out the window. The next day, Sterry and Sabo met with their teacher before Sabo ran away again."}, {"type": "paragraph", "text": "Sometime before the present, Sterry married Princess Sarie Nantokanette, and a few months ago became king of the Goa Kingdom after the suspicious deaths of the king and prince."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Sterry_Talks_About_Gray_Terminal.png/revision/latest/scale-to-width-down/200?cb=20190517094653", "caption": "Sterry reveals to Sabo the plan to burn Gray Terminal."}]}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Sterry and his wife were staying at a hotel for royalty in Loguetown. He commented to his queen that the hotel was nothing special, only offering a view of Gol D. Roger's gallows."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Sterry and Nantokanette arrived at the Red Port, and Sterry went up to Garp, trying to give him orders as his king and looking for ways to get in with the World Nobles, but Garp acted rude towards him, much to Sterry's shock. He then encountered the royals from Fish-Man Island, and was overwhelmed by ignorance and fear. He and his wife later went up to Mary Geoise on the Bondola, and he saw a giant pop out of the cliff, but Ham Burger believed he was hallucinating. Sterry then grew fearful of some crows flying nearby, but Sabo (disguised as a guard) tried to assure him that it was safe."}, {"type": "paragraph", "text": "Sterry and the Levely participants with him later reached the top of the Red Line. As they made their way to the Mary Geoise castle, Sterry looked down on Neptune and his family when they declined to use the travelator. Sterry was later asked to make a pledge before the Empty Throne. He was told of the throne's significance and even though he was informed that no one was allowed to sit on it, Sterry desired to do so."}, {"type": "paragraph", "text": "Sterry later went to the conference room with the other kings and queens to begin the Levely."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Sterry, his wife, and loyal subjects left the Levely, he received a newspaper and expressed shock to find out his adoptive brother Sabo had infiltrated Mary Geoise."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sterry's favorite drink is high quality champagne.", "elements": []}]}], "images": []}]}