{"sections": [{"title": "Blamenco", "level": 1, "content": [{"type": "paragraph", "text": "Blamenco is the commander of the 6th division of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Blamenco is a short, rotund man, with a rather grayish skin tone, large lips, and two pockets near his chin area, possibly on his chest. He wears purple overalls adorned with a pig-like jolly roger and a purple and gray pirate tricorn with Whitebeard's symbol on it. He dons a standard yellow sash as a belt, tucked inside the loops of his overalls. He is noticeably missing one of his front teeth, possibly more."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fe/Blamenco_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180910153722", "caption": "Blamenco's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Blamenco seems to be very loyal to Whitebeard and was willing to risk his life to save Ace. Therefore, it can be presumed that he is a loyal member of the Whitebeard Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As Commander of the 6th Division, Blamenco has authority over the lower-ranking subordinates."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Blamenco is extremely strong, as he is seen wielding a gigantic hammer more than twice the size of his body with ease. During the Battle of Marineford he is seen as being able to fight and defeat multiple Marine officers with one strike, and later emerge uninjured and unharmed at the end of the battle."}], "images": []}, {"title": "Miscellaneous Skills", "level": 3, "content": [], "images": []}, {"title": "Body Pockets", "level": 4, "content": [{"type": "paragraph", "text": "Blamenco possesses an as-of-yet unnamed ability that allows him to store objects in pockets on his body, regardless of the object's size. The storage area is connected to the pockets on his chin area. Any limitations to this power are unknown. So far, he has only pulled out a giant mallet from his right chin pocket."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b3/Blamenco%27s_Body_Pockets.gif/revision/latest?cb=20120530074019", "caption": "Blamenco has the ability to keep a gigantic hammer stored inside him."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Blamenco is capable of storing in the pockets on his body a massive mallet far bigger than he is. The weapon appears to be made of wood, and somewhat resembles a drum. It also could likely be based on an ōtsuchi - A large, wooden hammer of Japanese origin, used mainly in the past for busting through castle gates and doors. The handle of Blamenco's mallet is quite small in comparison to the giant hammerhead. He is quite proficient with it, using one swing to defeat a large group of high-ranking Marines."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When it was revealed that Ace was going to be publicly executed in Marineford, Blamenco joined the rest of Whitebeard's fleet and their subordinate crews to rescue him. Arriving at Marineford, they fought to save their captured comrade alongside some late additions to the war."}, {"type": "paragraph", "text": "During the fighting, he was seen drawing a massive hammer from a pocket from his body and striking several enemy Marines. Later on, Blamenco and the rest of the Whitebeard Pirates reached the plaza and continued to fight. He was shocked and terrified when Akainu fatally injured Ace, before telling everyone to fire at the admiral."}, {"type": "paragraph", "text": "After the war had ended, Blamenco was seen crying alongside his fellow Division Commanders over the loss of Ace and Whitebeard. Upon the arrival of Shanks and Sengoku subsequently calling the war to close, he and the rest of Whitebeard's crew left."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended the funeral of Whitebeard and Ace at an undisclosed location somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Blamenco vs. Marine Officers", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu, and Thatch), Crocodile, and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His ability and weapon of choice could be a pun on a common and famous occurrence in anime and western cartoons, as he literally pulled a hammer from a small space.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 461, Blamenco makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 147), His birthday is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 58, Fan question: What are the names of the 16 Division commanders of Whitebeard's crew?", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}]}], "images": []}]}