{"sections": [{"title": "Izo", "level": 1, "content": [{"type": "paragraph", "text": "Izo is the commander of the 16th division of the Whitebeard Pirates. He is also the older brother of Kikunojo. Before becoming a member of the Whitebeard Pirates, he was a former resident of Wano Country, and the heir of his father's dancing school, Hanayanagi School (花柳流, Hanayanagi-ryū) in Ringo. Like Kiku, he was also associated with the Kozuki Family, namely Kozuki Oden, and was one of his retainers."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Izo is a cross-dressing man who wears a pink and purple kimono. He has a pale complexion and hair tied in a way resembling that of a geisha. He also carries another Japanese-looking, light-red spotted indument tied around his waist."}, {"type": "paragraph", "text": "When he was a child, he was seen dressing as a geisha, wearing a kimono with a diagonal spot design. He had the top of his head shaven, with his bangs parted and the back tied up and pinned. He was also seen holding Japanese fans and dancing."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Izo is very loyal to the Whitebeard Pirates and Whitebeard, as he was willing to risk his own life in order to save Ace from execution during the Battle of Marineford."}, {"type": "paragraph", "text": "Prior to joining the Whitebeard Pirates, Izo was loyal and very close to Kozuki Oden after he found both him and his younger sibling Kikunojo on the streets of Ringo dirtied and hungry."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Kikunojo", "level": 4, "content": [{"type": "paragraph", "text": "Kikunojo is Izo's only sibling. After their father was arrested and convicted, they stayed together to survive in the streets of Ringo and they both joined Kozuki Oden."}], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Before Izo joined the crew, he was cold towards Whitebeard when Oden’s life was in grave danger. After Oden officially joined the Whitebeard Pirates, his attitude changed as he became close with the crew. Izo has been a member for around two decades and became the sixteenth division commmander. He was willing to rescue any of his crew when he was at Marineford. Izo, like the rest of the crew, was saddened when Whitebeard and Ace died."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the commander of the 16th division, Izo has authority over the lower-ranking subordinates. Like the other commanders, he is very powerful."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is seen wielding a pair of flintlock pistols and is apparently very adept with them, especially in close quarters combat: with a single shot, he was able to break a sword in half as well as injure its owner by shooting it just moments before it slashed him."}, {"type": "paragraph", "text": "By the end of the war, he was also seen carrying a sheathed sword, which may indicate that he is a swordsman as well."}, {"type": "paragraph", "text": "During his younger time in Wano Country, he is seen wielding a sword in order to assist Oden to fight against Ashura Doji."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Izo and his sibling, Kikunojo, were born in Wano Country. During their childhood, they were raised in a dancing school but their family was torn apart after their father was arrested. Afterwards, they had to survive on the streets in Ringo. When Kozuki Oden arrived and gave them food, they joined him. After Oden became daimyo of Kuri, he became one of his retainers."}, {"type": "paragraph", "text": "After Inuarashi, Nekomamushi, and Kawamatsu joined Oden, they were running low on funds. Therefore, he and the other retainers attempted to steal money from Yasuie, but they were caught. Instead of punishing them, Yasuie allowed them to take the money and encouraged them to use it to become better people for the sake of Oden and Wano Country. Following Yasuie's advice, they educated themselves and trained to become dignified warriors. 30 years ago, they visited the Flower Capital with Oden."}, {"type": "paragraph", "text": "Two weeks after the Whitebeard Pirates arrived at Wano, Oden secretly followed the crew when they decided to leave Wano at night secretly to prevent him from joining the crew. However, Izo knew Oden's plan beforehand and chased after him. He was pulled up after hanging onto Oden's body and tied up on the ship for at least three days before Whitebeard decided to let Oden join the crew. Soon after, his fellow comrades, Inuarashi and Nekomamushi, were discovered to have stowed away on the ship as well, having waited for Oden. After many adventures together, Izo was seen partying with the crew happily."}, {"type": "paragraph", "text": "At least some time before Battle of Marineford, he became one of their Division Commanders."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When it was revealed that Portgas D. Ace was going to be publicly executed in Marineford, Izo joined the rest of Whitebeard's fleet and their subordinate crews to rescue Ace. Arriving at the Marines headquarters, they fought to save their captured comrade alongside some late additions to the war. He was the one to talk to Monkey D. Luffy, asking him if he was tired, when he and several other division commanders were charging Kizaru. He stated that it was the right time to move on since the Marines were pulling back. After Whitebeard was stabbed by Squard, Izo is seen with the rest of the commanders looking on in shock and terror. After Squard realized that he had been tricked, the Marines raised the siege walls keeping the pirates from entering the plaza. Izo and the other pirates managed to board Whitebeard's hidden paddle ship. Little Oars Jr. helped the pirates by pushing their ship through the hole that the giant created."}, {"type": "paragraph", "text": "Later on, he fought alongside his subordinates against the Marines gathered in the plaza. After Luffy freed Ace from the scaffold, the pirates rejoiced. Whitebeard then gave his final order and the pirates reluctantly followed. Just when the pirates were about to leave with Ace, Admiral Akainu called Whitebeard a failure. Ace quickly turned back and Izo tried persuading Ace to forget about Akainu but was unsuccessful. Akainu took Ace's life and then aimed to kill Luffy. Izo and the other division commanders fought against the admiral to ensure that Luffy sees the New Era. Upon the arrival of Shanks and Sengoku calling the war to a close, Izo, like the rest of the Whitebeard Pirates and their subordinates, mourned for the outcome of the war and left the battlefield."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/05/Izo%27s_Guns.png/revision/latest/scale-to-width-down/210?cb=20150308231253", "caption": "Izo is shocked by Whitebeard's order to back Luffy up."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Izo and the rest of the crew attended the funeral of Whitebeard and Ace at an undisclosed location somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Izo vs. Marine Officers", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu and Thatch), Crocodile and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 461, Izo makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 962, Izo is revealed to be Kikunojo's brother.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 26), His birthday is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 58, The names of the 16 division commanders revealed.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Onnagata – Wikipedia article about onnagata in general.", "elements": []}, {"text": "Geisha – Wikipedia article about geishas in general.", "elements": []}, {"text": "Kimono – Wikipedia article about the type of dress Izo wears.", "elements": []}]}], "images": []}]}