{"sections": [{"title": "Rakuyo", "level": 1, "content": [{"type": "paragraph", "text": "Rakuyo is the commander of the 7th division of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rakuyo is an average-height man with dark blonde dreadlocks. He has a mustache that consists of two straight points angled diagonally. He wears a typical outfit consisting of a yellow coat with green linings, a green vest under an unbuttoned shirt, a standard light green pirate sash, square-patterned pants, and standard boots. His outfit most notably includes a yellow and purple bandanna bearing Whitebeard's mark. He is often seen wielding a unique spiked ball and chain that has a face at the end."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Rakuyo is very loyal to the Whitebeard Pirates and Whitebeard, as he was willing to risk his own life in order to save Ace from execution during the war at Marineford."}, {"type": "paragraph", "text": "Rakuyo is one of the more daring commanders as he attacked Kizaru directly by himself."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the commander of the 7th division of Whitebeard's crew, Rakuyo has authority over the lower-ranking subordinates. Like all Whitebeard commanders, he is very strong. Also, he appeared unharmed after his confrontation with Admiral Kizaru, despite the latter possessing destructive light-based powers, which suggests that he must be particularly powerful."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Rakuyo possesses a spiked flail with a canine-like face on it, and the chain attached to it moves in a manner similar to a snake. By hurling the spiked ball towards an opponent, it can cause both impact and biting damage. It is unknown if this weapon has \"eaten\" a Devil Fruit or has some sort of mechanical device that allows it to move."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/be/Rakuyo_Chomp_Flail.png/revision/latest/scale-to-width-down/150?cb=20120703003409", "caption": "Rakuyo's flail."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "​​​​​Thirty years ago, Rakuyo was among the Whitebeard Pirates when they arrived for the first time at Wano Country. The crew was shipwrecked and before going to civilization to get supplies, they encountered Kozuki Oden, who asked Newgate to let him join their crew after a brief clash."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Oden kept asking to join the crew, but he was turned down. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. After Izo was pulled up onboard, Oden accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, the crew started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When it was revealed that Ace was going to be publicly executed in Marineford, Rakuyo joined the rest of Whitebeard's fleet and their subordinate crews to rescue him. Arriving in the Marine headquarters, they fought to save their captured comrade alongside some late additions to the war. He personally fought Admiral Kizaru, making his spiked ball \"bite\" through him."}, {"type": "paragraph", "text": "He first cried when Whitebeard announced his decision to sacrifice himself in order to save his \"sons\". Rakuyo cried out his captain's name, begging him to come with them. He cries again while Ace pronounced his last words after the latter suffered a fatal wound from Akainu and also when Whitebeard was killed by the Blackbeard Pirates. He then faced Akainu with the other Whitebeard Pirates and Crocodile in order to protect Luffy. Upon the arrival of Shanks and Sengoku calling the war to a close, Rakuyo was seen with the other Whitebeard Pirates, mourning the results of the war. He and the rest of Whitebeard's crew left the battlefield."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Rakuyo_Grieving.png/revision/latest/scale-to-width-down/230?cb=20150309002038", "caption": "Rakuyo and his crewmates mourn."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended Ace's and Whitebeard's funeral at an undisclosed island somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and the Shichibukai", "elements": [{"text": "Rakuyo vs. Admiral Kizaru", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu and Thatch), Crocodile and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the manga, when Rakuyo hurled his ball and chain at Kizaru from the front the ball chomped through him; in the anime it was an attack from behind, and it just shot through his body.", "elements": []}, {"text": "His weapon appears to be bigger in the manga.", "elements": []}, {"text": "In the manga, the ball and chain is almost always hanging down, in the anime, however, the chain is quite often seen sticking up, similar to a snake.", "elements": []}, {"text": "In the manga, Rakuyo's trousers resemble a Scottish motif. In the anime this is substituted with a brown color.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 461, Rakuyo is seen disembarking from the Moby Dick along with other Whitebeard Pirates.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 198), Rakuyo's birthday is given.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 58, Fan question: What are the names of the 16 Division commanders of Whitebeard's crew?", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 562 and Episode 471, Jinbe mentions that the Division commanders of Whitebeard's crew have the strength of 100 men.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 567 and Episode 476, Rakuyo attacks Kizaru with his weapon.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}]}], "images": []}]}