{"sections": [{"title": "Namur", "level": 1, "content": [{"type": "paragraph", "text": "Namur is the commander of the 8th division of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Namur appears to be a shark fish-man, as evidenced by his shark-like teeth. His teeth stick out of his mouth from his lower jaw similar to Jinbe, but unlike Jinbe he has three small teeth on each side instead of one large. He also has three pairs of gills on his neck."}, {"type": "paragraph", "text": "He is somewhat short and rotund in shape, and his hair is arranged in spikes pointing upwards, similar to Gecko Moria. He has the number \"8\" tattooed to the left side of his neck to represent the division that he leads. He also wears a white t-shirt with sky blue sleeves with the star logo for the Criminal brand (colored orange) on his chest. Due to his legs not being visible in the manga, in the anime he was given standard grey pants held up by a belt. Also in the anime, he is also seen with a gray shark fin protruding from his back, and no shoes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b4/Namur_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180910153737", "caption": "Namur's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Namur is very loyal to the Whitebeard Pirates and Whitebeard, as he was willing to risk his own life in order to save Ace from execution during the war at Marineford."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the commander of the 8th division of the Whitebeard Pirates, Namur has authority over the lower-ranking subordinates. As a fish-man, he is ten times stronger than an average human on land, and twice that in water, although since he is a division commander it can be assumed that he is even stronger than that."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Namur's combat capabilities are more portrayed in the anime than in the manga. He is shown as an adept martial artist, though whether or not he knows Fish-Man Karate is unknown. He was also shown to have extremely strong jaws, much like Arlong, to the point where he could even destroy a battle axe with his teeth easily."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Namur and the other Whitebeard Pirates fought to save him. He was one of the first Commanders to appear, and along some of them backed Luffy up when the latter was attacked by Admiral Kizaru. He joined his comrades in the assault of the plaza of Marineford. After Whitebeard was brutally murdered by the Blackbeard Pirates, he was seen wondering on what Blackbeard wanted to do with Whitebeard's body. Upon the arrival of Shanks and Sengoku calling the war to a close, he and the rest of Whitebeard's crew left."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/94/Namur_Attacks_a_Marine.png/revision/latest/scale-to-width-down/210?cb=20140916111227", "caption": "Namur advances towards the plaza."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew attended Whitebeard's and Ace's funeral at an undisclosed location somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Namur vs. Marine Officers", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu and Thatch), Crocodile and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Namur's combat capabilities are more portrayed in the anime than in the manga. He is shown as an adept martial artist, though whether or not he knows Fish-Man Karate is unknown. He was also shown to have extremely strong jaws, much like Arlong, to the point where he could even destroy a battle axe with his teeth easily."}, {"type": "paragraph", "text": "In the manga, Namur appears to be larger than he is in the anime."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/04/Namurteeth.png/revision/latest/scale-to-width-down/210?cb=20101212094040", "caption": "Namur biting through an iron axe."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Namur appears to be the only Whitebeard division commander to have his division number written anywhere on his body, his being below his left jaw bone.", "elements": []}, {"text": "Namur is the only non human division commander of the Whitebeard Pirates. ", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 552 and Episode 461, Namur makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 124), Namur's birthday is given.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 58, The names of the 16 division commanders revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}]}], "images": []}]}