{"sections": [{"title": "Haruta", "level": 1, "content": [{"type": "paragraph", "text": "Haruta is the commander of the 12th division of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Haruta has a crop of short brown hair, blue eyes, and is fairly short. He wears a green and white 16th century-style ruffed outfit with white tights and carries a saber whose hand guard resembles the ruffles of his shirt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/62/Haruta_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180910145927", "caption": "Haruta's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Haruta was loyal to Whitebeard, and wanted to save Portgas D. Ace at Marineford. Haruta cried when Ace died, showing that he cared for him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the commander of the 12th division of the Whitebeard Pirates, Haruta has authority over the lower-ranking subordinates. He is presumably very strong: this statement was bolstered when Jinbe remarked that all of the Whitebeard commanders have great strength."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Haruta wields a decorated saber with a purple hilt, and appears to prefer a fighting style based on agility and speed, rather than strength, as he was seen jumping around when performing attacks. One demonstration of Haruta's level of swordsmanship is the fact that he is able to cut through steel."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e7/Haruta_Cuts_Through_Steel.png/revision/latest/scale-to-width-down/230?cb=20130919133936", "caption": "Haruta cuts through the steel equipment of a Marine."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Haruta joined along with the rest of the Whitebeard Pirates during the assault on Marineford in order to save Ace, and was one of the commanders who backed up Luffy when he was attacked by Admiral Kizaru and later helped in the assault of the Plaza. Haruta was seen crying when Admiral Akainu killed Ace and later appeared along side the rest of the Whitebeard division commanders to fight Akainu. This battle was never shown, but Haruta is shown to be unharmed later on. Upon the arrival of Shanks and Fleet Admiral Sengoku calling the war to a close, Haruta and the rest of Whitebeard's crew left."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Haruta_Jumping_Into_Battle.png/revision/latest/scale-to-width-down/230?cb=20100816092532", "caption": "Haruta leaping into battle."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Haruta, along with the rest of the crew, attended Whitebeard's and Ace's funeral at an undisclosed location somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost in the Payback War. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Haruta vs. Marine Officers", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu and Thatch), Crocodile and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "For several years, Haruta's gender was unknown to fans. In the anime, Haruta has a female voice actor. However, in an SBS Oda stated that no female members of the Whitebeard Pirates were at the battle of Marineford.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 461, Haruta makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 139), Haruta's birthday is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 58, The names of the 16 division commanders revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 76 (p. 98), Oda states that no female Whitebeard Pirates were present at Marineford.", "elements": []}]}], "images": []}]}