{"sections": [{"title": "Speed Jiru", "level": 1, "content": [{"type": "paragraph", "text": "Speed Jiru is the commander of the 14th division of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Speed Jiru is somewhat a round man of average height, wearing a brown fez with a white Whitebeard's insignia and a white robe with brown sleeves/leggings, both with Whiteboard's insignia printed on them. He wields a jousting lance for a weapon. He also carries a golden heater shield, also with a purple Whitebeard's insignia."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1b/Speed_Jiru_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180910160321", "caption": "Speed Jiru's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Speed Jiru is very loyal to the Whitebeard Pirates and Whitebeard, as he was willing to risk his own life in order to save Ace from execution during the war at Marineford."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the commander of the 14th Division, Speed Jiru has authority over the lower-ranking subordinates."}, {"type": "paragraph", "text": "In the anime, true to his name, he is shown to have extremely fast movements. A proof of this is when Admiral Kizaru launched a laser beam to stop him and his division from getting closer to the broken wall Oars made he was seen evading it by jumping backward, and commenting on Kizaru's \"speed of light\" attack. This is quite a remarkable feat considering the fact that Kizaru can move and shoot beams from his body without himself or his beams even getting noticed due to sheer, unmitigated speed (evidenced when X Drake fought Kizaru and just noticed a blink of light from far away, when Kizaru actually was already in front of him aiming a kick)."}, {"type": "paragraph", "text": "Also, his combined strength and agility is astounding, as seen when he took the offense and dashed forward to engage the Marines: in a split second, a group of them was easily eliminated."}, {"type": "paragraph", "text": "His body structure also seems to change from time to time as shown in both the manga and anime, if this is because of a Devil Fruit, a technique like Life Return or simply a drawing mistake is unknown."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Speed Jiru has been seen using a jousting lance and a shield."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d5/Speed_Jill_Battle.png/revision/latest/scale-to-width-down/150?cb=20100919223205", "caption": "Speed Jiru's weapons."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was first seen, along with the other Whitebeard Pirates, in Marineford's bay, ready to save Ace. He was amongst the commanders who backed up Luffy when the latter was attacked by Admiral Kizaru. He attacked the Plaza along with his comrades, and was shocked to hear of Whitebeard's will to sacrifice himself for his sons. As Ace pronounced his last words, he was seen crying. Upon the arrival of Shanks and Sengoku calling the war to a close, he and the rest of Whitebeard's crew left."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew attended Whitebeard's and Ace's funeral at an undisclosed island somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Speed Jiru vs. Marine Officers", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu, and Thatch), Crocodile, and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 461, Speed Jiru makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 95), His birthday is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 58, The names of the 16 division commanders revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 467, Speed Jiru evades Kizaru's speed of light attack.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}]}], "images": []}, {"title": "External References", "level": 2, "content": [{"type": "list", "elements": [{"text": "Fez – Wikipedia article about the type of hat Speed Jiru wears.", "elements": []}]}], "images": []}]}