{"sections": [{"title": "Kingdew", "level": 1, "content": [{"type": "paragraph", "text": "Kingdew is the commander of the 11th division of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kingdew is a large tanned man with short blonde hair and hollowed-out cheeks. He wears a pair of long, armored blue gauntlets. He also wears a brown cape that he seems to have pierced to his shoulders, and black and golden yellow striped pants tucked inside simple boots, with a light blue sash around his waist. On the right side of his chest there is a large, elaborate tattoo, which seems to incorporate a dark blue Whitebeard's iconic mustache in it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kingdew is very loyal to the Whitebeard Pirates and Whitebeard, as he was willing to risk his own life in order to save Ace from execution during the war at Marineford."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the 11th division commander of the Whitebeard Pirates, he has authority over a number of subordinates. He's presumably a proficient combatant, as Jinbe remarked that each commander is very strong. In the anime, he also dodged a cannonball aimed at him that then hit his crewmembers, indicating that he has fairly quick reflexes. He has great stamina, having fought multiple Marine officers and a Marine admiral without showing any signs of exhaustion."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Sporting large iron gauntlets on his hands, he is a powerful hand-to-hand combat fighter."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "​​​​​Thirty years ago, Kingdew was with the Whitebeard Pirates when they arrived for the first time at Wano Country. The crew was shipwrecked and before going to civilization to get supplies, they encountered Kozuki Oden, who asked Newgate to let him join their crew after a brief clash."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Oden kept asking to join the crew, but he was turned down. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. After Izo was pulled up onboard, Oden accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, the crew started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He arrived at Marineford alongside his comrades to save Ace, and was one of the commanders who backed up Luffy when he was attacked by Admiral Kizaru. When Ace was freed, he rejoiced, but was seen crying when the latter was killed by Admiral Akainu. He was also seen crying when Whitebeard announced his will to sacrifice himself, and again when Whitebeard died at the hands of the Blackbeard Pirates. He appeared alongside his fellow Whitebeard division commanders, ready to face Akainu. This battle was never shown, but he is shown to be unharmed later on. Upon the arrival of Shanks and Sengoku calling the war to a close, he and the rest of Whitebeard's crew left."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew attended Whitebeard's and Ace's funeral at an undisclosed island somewhere in the New World."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Kingdew vs. Marine Officers", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu and Thatch), Crocodile and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kingdew bares a resemblance to cartoon character He-Man, but whether his appearance is based on him is unknown.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 562 and Episode 461, Kingdew makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 51), His birthday is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 58, The names of the 16 division commanders revealed.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}]}], "images": []}]}