{"sections": [{"title": "Fossa", "level": 1, "content": [{"type": "paragraph", "text": "Fossa is the commander of the 15th division of the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Fossa is a large and muscular older looking man, with a bald patch on the top of his head, a white mustache (black in the anime), and a scar running diagonally across his face (on the head and forehead in the anime). He has Whitebeard's symbol tattooed in crimson on his right deltoid, along with three little circles, and he wears an open dark blue sleeveless jacket, with lighter edges, and loose light brown pants tucked inside his boots and are held up by a reddish brown belt. He carries his weapon of choice; a katana with a square tsuba, on his left hip attached to his belt, but was also seen carrying it over his left shoulder with a long strap. He has been seen smoking a cigar in all of his appearances."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Fossa is very loyal to the Whitebeard Pirates and Whitebeard, as he was willing to risk his own life in order to save Ace from execution during the war at Marineford."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the commander of the 15th division, Fossa has authority over the lower-ranking subordinates. He is very strong, like the other division commanders."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Fossa seems to be a swordsman, although his exact level of ability remains unknown; however it is presumably quite high. He wields a katana with a square shaped hilt, and was somehow able to engulf the blade in flames. Whether this ability stems from a Devil Fruit, a Dial, friction, or another method is currently unknown. In the anime, however, he was shown doing so with his cigar, which may suggest that the sword is coated with some kind of flammable liquid."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/Fossa%27s_Flaming_Katana.png/revision/latest/scale-to-width-down/230?cb=20130303104553", "caption": "Fossa's flaming katana."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "​​​​​Thirty years ago, Fossa was with the Whitebeard Pirates when they arrived for the first time at Wano Country. The crew was shipwrecked and before going to civilization to get supplies, they encountered Kozuki Oden, who asked Newgate to let him join their crew after a brief clash."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Oden kept asking to join the crew, but he was turned down. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. After Izo was pulled up onboard, Oden accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, the crew started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Fossa first appeared when Whitebeard arrived at Marineford in order to save Ace. He landed on the ice created by Aokiji along with the other Commanders, and started to attack, slashing enemies with his flame-covered sword. He was seen again when Admiral Kizaru kicked Luffy: he assaulted the high-ranking Marine with other Commanders, giving Luffy a chance to carry on."}, {"type": "paragraph", "text": "Later, he was shocked at witnessing Squard stabbing Whitebeard in the chest, and when his captain's quake-attack failed to destroy the siege wall, he commented on the unusual type of iron that was used in making the wall. He entered the plaza behind the wall with the others and was seen fighting alongside his comrades. He later joined Jinbe and other Commanders in protecting Whitebeard's back, and he was the one to reveal that both his captain and Red-hair possessed Haōshoku Haki."}, {"type": "paragraph", "text": "He appeared shocked when Whitebeard declared his will to sacrifice himself in order to save his \"sons\", and incredulously witnessed Admiral Akainu piercing Ace with his magma-fist. When the latter died, he appeared angry, declaring that it could not be really happening. When the Blackbeard Pirates killed Whitebeard, he was seen crying, his cigar falling from his mouth for the first time. When Akainu resurfaced from the ground, he commented on his ability to melt the rock, and was among the others when they faced off against the admiral in order to save Luffy. He was seen mourning the results of the war along with the other Whitebeard Pirates. Upon the arrival of Shanks and Sengoku calling the war to a close, he and the rest of Whitebeard's crew left."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew attended the funeral of Whitebeard and Ace at an undisclosed location somewhere in the Grand Line."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the remnants of the Whitebeard Pirates fought against the Blackbeard Pirates but ultimately lost. They went into hiding and have not been seen since their defeat."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their subordinate crews vs. the Marines and Shichibukai", "elements": [{"text": "Fossa vs. Marine Officers", "elements": []}, {"text": "Whitebeard Pirates Commanders (minus Ace, Jozu and Thatch), Crocodile and Andre vs. Admiral Akainu", "elements": []}]}, {"text": "Whitebeard Pirates (under Marco) vs. Blackbeard Pirates (unseen, during timeskip)", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 461, Fossa makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 146), Fossa's birthday is given.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 58, The names of the 16 division commanders are revealed.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 820.", "elements": []}]}], "images": []}]}