{"sections": [{"title": "Caroline", "level": 1, "content": [{"type": "paragraph", "text": "Caroline, as depicted in the anime, is the substitute Queen of Kamabakka Kingdom, holding the throne for Emporio Ivankov after he was imprisoned. The people from the kingdom call him Carol-sama. Just like Ivankov, he calls the Okamas of the island \"candies\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Caroline is a very big, middle aged looking Okama with strong chiseled features to his face. He wears a red wig with a long frilly purple dress with fake breasts underneath. He has red lipstick, with a pink masquerade mask over his face with light pink eyes. He has white stockings over his legs with dark blue slipper shoes. He also owns a more formal blue dress which he wears when acting as the substitute Queen and also keeps his hair tied up when in said role."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He has a very arrogant personality, refusing to take no for an answer and constantly harassing Sanji despite how tormented he was. Like the rest of the Okama on the island, he is quite ruthless and forceful when trying to convert newcomers into Okama and is also quite loyal to Ivankov."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Caroline professes \"herself\" to be the \"stand-in grandmaster\" of Newkama Kenpo, and demonstrates some ability to fight when he fought Sanji."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Caroline has incredible superhuman strength, having easily stopped a kick from Sanji using only his index finger and thumb. He is extremely fast, being able to vanish from Sanji's sight during their fight."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Straw Hat Separation Adventure: Kamabakka Kingdom", "level": 3, "content": [{"type": "paragraph", "text": "When Sanji ends up on the island, he is lured into the castle where he meets Caroline. When Sanji demands a way off the island, he agrees to fight the islands strongest Okama under Kamabakka conditions, with his victory resulting in liberation from the island."}, {"type": "paragraph", "text": "Sanji is then forced to dress as an Okama during their fight, which were the Kamabakka terms. Caroline easily deflects Sanji's best kicks, noticing Sanji's embarrassment and hesitation. He begins to point out during the fight how he is showing his inner woman, and eventually converts him to a full fledged Okama resident."}, {"type": "paragraph", "text": "By the time Ivankov returns, Sanji reverts to his normal self. Ivankov gives Sanji a challenge to earn the 99 Attack Cuisine recipes by defeating the 99 Newkama Kenpo masters while resisting the island's residents. Once Sanji accepts the challenge, the okamas immediately begin the ordeal. Caroline, as one of the Newkama Kenpo masters, then challenges Sanji to take a recipe from him."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Caroline and the other okamas later chase Sanji all over the island day after day. Just when they finally cornered him, they were extremely surprised when Sanji suddenly developed the skill, Sky Walk, allowing him to escape their grasp by jumping on air."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Caroline vs. Sanji", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Anime — Episode 454, Caroline makes his debut.", "elements": []}, {"text": "↑  One Piece Anime — Episode 514, Caroline is one of the 99 Newkama Kenpo masters.", "elements": []}]}], "images": []}]}