{"sections": [{"title": "Jalmack", "level": 1, "content": [{"type": "paragraph", "text": "Saint Jalmack is a World Noble who was introduced ten years prior to the start of the series."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Though his initial appearance is hidden in the shadows, Jalmack has a similar hairstyle as the Rosward family, but his goes up in two bulbs. He also has a wide chin and wears a red earring on his right ear."}, {"type": "paragraph", "text": "As with all other World Nobles, Jalmack wears a thick white suit adorned with medal-like knobs on the front. He also added a cape to go along with it. However, since he was not at Sabaody Archipelago, he cannot wear one of the resin bubbles as a helmet, due to the bubbles popping outside of that area. Instead, he wears a rectangular helmet, in order to prevent himself from breathing the same air as \"commoners\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Jalmack_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180916223228", "caption": "Jalmack's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As is typical for a World Noble, Jalmack is cruel and self-centered, looking down on those who are lower in social status than his kind. To this end, he would gladly shoot down anyone who dares defy him, including children such as Sabo. He was also seen with three slaves: one carrying him like a horse and two walking behind him in chains; this shows that he has no qualms concerning enslaving people."}, {"type": "paragraph", "text": "However, unlike the other World Nobles shown, he shared his reasoning for shooting down Sabo: the child had raised a pirate flag, which classifies him a pirate and a criminal, and deserves to be killed. This falls in line with the Justice doctrine many Marines have adopted. However, his more important reason for gunning down the small ship was due to it cutting his ship off, meaning justice was just an excuse to make him look more moral than he truly is."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a World Noble, Jalmack has the authority to do as he pleases. If a person defies him, they shall be targeted by an Admiral, whom Jalmack has the right to summon to eliminate anyone whom he thinks has offended him."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Jalmack was seen wielding a rifle-styled bazooka. Unlike Roswald, who wields a rifle with no skill or accuracy, Jalmack managed to shoot down a boat in the middle of the sea. However, the bazooka had a cross-hair, which may contribute to the increased accuracy."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Twelve years prior to the storyline, Jalmack went to visit the Goa Kingdom in East Blue. When Sabo's ship got in his way, Jalmack shot it down with a bazooka, supposedly killing him, claiming that, despite being a child, he dared to raise a pirate flag and that he had the nerve to cut in front of his ship. Afterwards, Jalmack was escorted into the town by his slaves and the kingdom's royal guards."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Jalmack%27s_Ship.png/revision/latest/scale-to-width-down/210?cb=20160310021126", "caption": "Jalmack's ship approaching Dawn Island."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 588 and Episode 502, Jalmack is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 77), Saint Jalmack's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 502.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Sabo's death at the hands of Jalmack is (incorrectly) confirmed.", "elements": []}]}], "images": []}]}