{"sections": [{"title": "Rokkaku", "level": 1, "content": [{"type": "paragraph", "text": "Lieutenant Junior Grade Rokkaku was one of Axe-Hand Morgan's officers at the 153rd Marine Branch. He currently serves under Commander Ripper."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rokakku has tanned skin, with prominent cheekbones and a black (light color in the manga) mustache and beard. He has a scar above his right eye."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Although everyone was scared of Morgan's wrath, he was willing to stand up against him when he ordered him to kill Rika, showing that he is brave enough to stand up for what he believes in. Also, in contrast to Morgan, he is not a heartless person as he refused to kill a little girl."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, he most likely had to go through training and so may have some combat skills."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Romance Dawn Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Morgan was discovered that Rika was still alive after trespassing into the courtyard of the Marine base, he immediately ordered Rokkaku to go into town and kill her. Rokkaku refused to do so because she was just a little girl. Upon hearing this, Morgan exclaimed that his orders were absolute, but Rokkaku refused once again. Because of this \"insubordination\", he was slashed down the back by Morgan's axe-hand."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, Rokkaku is shown to have survived his former captain's attack and was enjoying food at the canteen. He still works at the Marine Base but now serves under Ripper."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Rokkaku_and_Ripper_Post_Timeskip.png/revision/latest/scale-to-width-down/180?cb=20140805200403", "caption": "Rokkaku eating at Rika's table."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Instead of being slashed down the back by Morgan's axe-hand, he was simply knocked out by him using the side of his axe."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Become the Pirate King!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name apparently comes from a villain in Romance Dawn, Version 2, a prototypical One Piece manga. This is the only resemblance between the characters. Interestingly, Rokkaku (lit. Hexagon) has a face shaped like his namesake.", "elements": []}, {"text": "For some unknown reason, his scar disappeared in his post timeskip reappearance.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Vivre Card - One Piece Visual Dictionary, Rokkaku's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, his name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 4 and Episode 2, Morgan attacks Rokkaku.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 616, Rokkaku appears for the first time after the timeskip.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 616, Rokkaku appears without his scar.", "elements": []}]}], "images": []}]}