{"sections": [{"title": "Pekkori", "level": 1, "content": [{"type": "paragraph", "text": "Pekkori is the leader of Harahettania, the Land of Poverty, situated on Namakura Island in the Grand Line. He directed the ritual in which he and his people \"summoned\" Brook, though they were trying to summon the devil."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pekkori is a middle-aged man who is always seen wearing sunglasses, even when he is inside or when it is raining. He has a rather rectangular-shaped face and a shaved beard. He wears a black hat with an embalmed goat on it and a robe similar to the ones worn by the other cultists, but over his hood he sports a hat shaped like a ram. He has a red, thin sash tied around his waist, with the knot on the front, and he wears a necklace made of light-green beads and what look like some animal's fangs."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is apparently very attached to his people, as he is willing to save them by any means necessary, even summoning Satan himself. He however has a darker side, as he was willing to make a show of the longarms for money."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Pekkori is the leader of Harahettania, and thus has power over the inhabitants of the kingdom. He was seen using a spear alongside the other cultists when fighting the Longarms raiders."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "When Brook arrived, he welcomed him, thinking he had successfully summoned the Devil. When a young woman was kidnapped by the longarms, he and the rest of the villagers did nothing. Later, he watched as Brook wrote a song."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Pekkori is only named in the anime, where he takes part in more scenes than the ones seen in the manga."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Pekkori is only named in the anime which makes his name non-canon.", "elements": []}, {"text": "His name probably comes from \"Pecora\", the Italian word for \"sheep\", as a reference to the goat he has on his hat.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 524 and Episode 421, Pekkori makes his debut.", "elements": []}]}], "images": []}]}