{"sections": [{"title": "Island Eater", "level": 1, "content": [{"type": "paragraph", "text": "Island Eater was a giant goldfish that inhabited the sea near Little Garden. He was said to be the main reason ships leaving the island never reached their destination. He was classified as a Type C creature, \"Big Savage\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Island Eater was an enormous fish, rivaling the size of even the most massive of Sea Kings. He resembled a typical white-red colored goldfish, with protruding eye sockets and a wide mouth that had a set of large teeth."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Island Eater's personality, but he was considered highly savage in nature."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Island Eater's massive size allowed him to easily consume ships or even entire islands, producing feces large enough to be known as Nanimonai Island. However, he was quickly defeated by Dorry and Brogy."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Little Garden Arc", "level": 3, "content": [{"type": "paragraph", "text": "Island Eater appeared at the end of the Arc, when the Straw Hats were leaving Little Garden. He ate the Going Merry, but was killed by Dorry and Brogy's strongest attack, Hakoku."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Brogy_and_Dorry_Slay_Island_Eater.png/revision/latest/scale-to-width-down/210?cb=20150323185650", "caption": "Dorry and Brogy slay Island Eater."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "This fish was another example of Usopp's lies becoming true.", "elements": []}, {"text": "The Fighting fishes are related to the giant gold fishes.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 15 Chapter 128 (p. 19-20) and Episode 77, Island Eater starts rising from the sea and Dorry states his name.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Island Eater's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 15 Chapter 128 (p. 17) and Episode 77, The giants talk about Island Eater.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 88-89), classification of animals by dangerousness.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 15 Chapter 129 and Episode 77, Island Eater makes his full appearance.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 15 Chapter 129 (p. 6) and Episode 77, Brogy states that Island Eater swallows entire islands whole, and produces feces known as Nanimoinai Island.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 24 (p. 10) and Episode 9, Usopp lies about a giant goldfish.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 72 Chapter 713 and Episode 643, The dwarves state the fighting fishes are related to the giant goldfish.", "elements": []}]}], "images": []}]}