{"sections": [{"title": "Thatch", "level": 1, "content": [{"type": "paragraph", "text": "Thatch was the commander of the 4th division of the Whitebeard Pirates. He was murdered by Marshall D. Teach prior to the main storyline."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Thatch was a tall man with a light brown pompadour hairstyle, which went to a point at the back of his head, and a goatee around his chin. He also had a stitched scar running down his face, around his left eye, reminiscent that of Garp. Thatch often dressed in a posh uniform, with calf-long pants and a black belt around his waist, and brown shoes."}, {"type": "paragraph", "text": "Initially in the anime, he was given blonde hair spiking out rather than being arranged in a pompadour and his goatee was black. He wore a white foulard, a blue shirt, and gray pants with a sword on his right hip. Later in the anime, he was given a different color scheme. His hair was changed to orange brown, his foulard became yellow, and his entire uniform changed to a much lighter blue, with his shirt and pants the same color."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Jovial and affable, Thatch appeared to be one of the friendlier and more sociable commanders of Whitebeard's crew, being the first to interact with Ace after they captured him and the rest of the Spade Pirates. He also may have had a confident side, having chosen not to devour the Yami Yami no Mi after retrieving it from a raid, as according to the Whitebeard Pirates, the finder of the Devil Fruit has the right to consume it. However, this turned out to be a fatal mistake, as Teach took advantage of it and murdered Thatch for that very fruit."}, {"type": "paragraph", "text": "Thatch and Ace were particularly close, as it was the former's demise that proved an immense blow for Ace, prompting him to hunt down Blackbeard to avenge his friend."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Having been a division commander, he had authority over a vast number of subordinates. One testament of his power is that Teach, who was able to defeat Ace in a direct fight, had to resort to a sneak attack to take Thatch's life and the Yami Yami no Mi (though it should be noted that Blackbeard was considerably stronger when he faced Ace and he used the powers of the Yami Yami no Mi in their battle)."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Thatch is seen carrying a sword on his right hip. His exact level of swordsmanship remains unknown, however it is presumably quite high, with him being a division commander in a Yonko's crew. In an anime only scene, he was shown dual-wielding swords and was capable of fighting the Decalvan Brothers, although he was struggling a bit."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "The New Comrade", "level": 3, "content": [{"type": "paragraph", "text": "Thatch was one of the first to try befriending Ace when he had arrived on the ship. Ace responded cynically, and questioned why he is not being held with shackles while on board the Moby Dick. Thatch merely gave an amused look, as though he believed that was unnecessary."}], "images": []}, {"title": "Death over a Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Thatch later found the Yami Yami no Mi, the Devil Fruit that Blackbeard was after for a long time. This Devil Fruit was the very reason that Blackbeard joined the Whitebeard Pirates. Because of the rule on Whitebeard's ship is that the one who finds a Devil Fruit is the only one allowed to eat it, Teach murdered Thatch and ran off with it, leaving his former commander, Portgas D. Ace, to hunt him down for revenge."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Thatch_and_Yami_Yami.png/revision/latest/scale-to-width-down/230?cb=20130510051454", "caption": "Thatch holding the Yami Yami no Mi."}]}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "However, when Ace failed and was captured and ultimately executed, the quest for revenge also ended in failure. Whitebeard himself attempted to get revenge in place of Ace, but he was assassinated by the Blackbeard Pirates. A year after the war, one of the reasons the remnants of the Whitebeard Pirates led by Marco attacked the Blackbeard Pirates was to avenge Thatch."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The episode showing Ace's flashback contains more information about Thatch than ever given in the manga. These scenes ultimately depict Thatch as a very close friend to Ace. This would include him and Ace fighting together back to back against the Decalvan Brothers, even so far as the betrayal by Marshall D. Teach and his corpse laying on the deck of the Moby Dick, having been stabbed to death in the back. Also there is a scene in which Ace received a banquet for becoming the 2nd division commander, and Thatch is shown giving something to Ace to drink after he choked on his food. In the anime, it is also seen that he gets along quite well with Marco."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/96/Death_of_Thatch.png/revision/latest/scale-to-width-down/220?cb=20130719121551", "caption": "Thatch's death as seen in the anime."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Thatch vs. Marshall D. Teach (past battle unseen)", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Portgas D. Ace and Thatch vs. Decalvan Brothers (past battle)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Seeing a resemblance between Thatch's name and that of the real life pirate known as Blackbeard, Edward Teach, a fan asked Oda in a SBS question if Thatch was based on the real life Blackbeard along with Edward Newgate and Marshall D. Teach. Oda replied to the fan that he indeed based Thatch's name on the real life Blackbeard's. However, the similarity is in name only.", "elements": []}, {"text": "During the war at Marineford, Whitebeard is seen with only fourteen division commanders, not including Ace, indicating that Thatch had not been replaced.", "elements": []}, {"text": "In Episode 476, a statue resembling Thatch can be seen after Hancock's first attack.", "elements": []}, {"text": "Thatch was the only division commander known to be killed before the start of the story line.", "elements": []}, {"text": "In volume 2 of One Piece novel A, Thatch claimed that Teach wanted to eat the Suke Suke no Mi, unaware that Teach truly wanted the Yami Yami no Mi.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 440 and Episode 325, Thatch makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 67), His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Thatch's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 552 (p. 10) and Episode 461, Thatch makes his first live appearance.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 440 (p. 17) and Episode 325, Blackbeard's chilling tale.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 49 (p. 88), Fan Question: Is Whitebeard's 4th division leader based on Edward Thatch, the real life Blackbeard's alias?", "elements": []}]}], "images": []}]}