{"sections": [{"title": "Koushirou", "level": 1, "content": [{"type": "paragraph", "text": "Koushirou is a master swordsmen and was the teacher of Roronoa Zoro. He is also the father of the late Kuina. He is the dojo master of Isshin Dojo in Shimotsuki Village."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Koushirou has black hair tied back in a long ponytail, his face is wrinkled and wears glasses with circular frames. He always wears a gray yukata and sometimes he has a beige haori over it with two crossed swords on the left breast."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He was a believer that females are naturally weaker than their male counterparts and are therefore unsuitable to be warriors. Koushirou deeply appreciate talent as shown when he noted that as long as Zoro valued his swordsmanship he did not care if he had became a pirate. However, he was rather dismayed that the students of his dojo hoped to become great pirates like Zoro and started practicing Santoryu to better emulate him."}, {"type": "paragraph", "text": "Although he is always seen smiling, he gives the impression of being a mostly emotionless person. Koushirou's reaction to his daughter's death was just a comment that \"humans are fragile\" when telling Zoro that she died, though it is possible that he was masking his pain."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He is skilled enough with a sword that he can teach others to use it. His skill in swordsmanship is so great he has knowledge of techniques known only in Wano he would pass on to Zoro."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "One day, a young Zoro came to his dojo for a challenge. Koushirou pitted Zoro against his daughter Kuina and stated that if Zoro loses, he would become a student of the dojo. Zoro accepted the challenge and lost and became Koushirou's student as agreed."}, {"type": "paragraph", "text": "At least once, Isshin Dojo helped the Revolutionaries by providing them food and supplies. A man with a large face (probably Emporio Ivankov) was seen and Dragon said that the army received food from the dojo."}, {"type": "paragraph", "text": "One night, Koushirou discussed about Zoro's progress with a fellow teacher and was confident that Zoro would one day surpass Kuina. Kuina, having overheard this conversation, became outraged saying that she would be the world's greatest swordsman. Koushirou stated that as a woman, Kuina cannot be the world's greatest swordsman, causing her to be distraught."}, {"type": "paragraph", "text": "On the day after Zoro and Kuina made their vow, Kuina had fallen down the stairs and died. On Zoro's request, Koushirou handed him the family's Meito Wado Ichimonji."}, {"type": "paragraph", "text": "Several years later, Zoro left the village to become the world's best swordsman."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Enies Lobby incident, Koushirou was seen again in his dojo when his students were asking him about Zoro. He wished Zoro to go on ahead and fulfill his dream. Koushirou also stated that as long as Zoro treasures his sword, it will not matter what person he becomes."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the news of the Straw Hat Pirates spread across the world, Koushirou was seen next to Kuina's grave."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Straw Hats' victory at Dressrosa, Koushirou was dismayed that his young students began to imitate Zoro by practicing Santoryu and taping their left eyes shut."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "At the end of the anime's flashback of Zoro's past, Koushirou was shown with bits of gray hair when Zoro left the village. Yet, his hair was fully black when Zoro received his second bounty. This is most likely due to him not yet having been seen outside of Zoro's flashback in the manga at the time."}, {"type": "paragraph", "text": "In the manga, his actions are limited to Zoro's flashback while in the anime his role is expanded. Kuina's increased fighting potential is noted by him because of her rivalry with Zoro, while in the manga he makes no statement. His traditional values are also touched upon as he contemplated making Zoro his heir rather than his own daughter Kuina simply because of her gender."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/77/Koshiro_Graying_Hair.png/revision/latest/scale-to-width-down/150?cb=20130127222428", "caption": "Koushirou with graying hair in the anime."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Koushirou made a very small cameo appearance in one of the \"Boss Luffy Historical Arc\" filler episodes.", "elements": []}, {"text": "The symbol on his yukata and coat is identical to a symbol on a samurai outfit of the Hakumi region in Wano who are loyal to Shimotsuki Yasuie of the Shimotsuki Family.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/83/KoshiroCameo.png/revision/latest/scale-to-width-down/200?cb=20130128012017", "caption": "Koushirou's cameo in the crowd."}]}]}