{"sections": [{"title": "Nako", "level": 1, "content": [{"type": "paragraph", "text": "Dr. Nako is a doctor from Cocoyasi Village."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nako is an elderly man with a wrinkled face, grey hair, grey eyebrows, and a grey mustache and goatee. He wears a bandanna with a red cross, a common symbol for medical personnel (which is edited out in the 4Kids dub) and sunglasses. He wore a striped light green and dark green shirt under a doctor’s coat with a red cross on the side of the right sleeve."}, {"type": "paragraph", "text": "After the timeskip, he has a flower-patterned shirt and striped shorts, with the same sunglasses, coat, and bandanna."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Nako_Without_Sunglasses.png/revision/latest/scale-to-width-down/160?cb=20190529054507", "caption": "Nako without his sunglasses."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Nako has a very matter-of-fact kind of personality, forgoing sentimentality for logic. Nako is also brave, as he joined the others to try and defeat Arlong even though he knew he would die if he faced them."}, {"type": "paragraph", "text": "When Nako is angry, surprised, or nervous, he tends to grit his teeth, making his expressions less discernable. Despite often wearing a stern expression, Nako is rather compassionate and thoughtful towards those who he cares about."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Genzo", "level": 3, "content": [{"type": "paragraph", "text": "Nako and Genzo are close friends, and they have often been seen working together. They are the primary leaders in Cocoyasi Village, as they lead discussions on whether or not to confront the Arlong Pirates for Nami’s sake. He also recognizes Genzo and Nami’s relationship, as he showed his friend the tattoo Nami designed that pays tribute to him and her mom."}], "images": []}, {"title": "Bell-mère", "level": 3, "content": [{"type": "paragraph", "text": "As Bell-mère’s friend, Nako cared about her wellbeing. However, he listened to her wishes when she put Nami and Nojiko’s safety before her own. He was shocked when Bell-mère decided to adopt the girls, as he did not trust her to take care of them, but he was quite saddened by her death."}], "images": []}, {"title": "Nami", "level": 3, "content": [{"type": "paragraph", "text": "Nako has looked after Nami and Nojiko since they were young children. In hopes that they would escape Arlong, he tried to make them leave the Conomi Islands, and though it seemed harsh to others, it was done out of care. Though Nami joined the Arlong Pirates, Nako still cared deeply about her and resolved to sacrifice himself for her sake."}], "images": []}, {"title": "Arlong Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Nako is afraid of the Arlong Pirates, as seen when he tried to convince Nami and Nojiko to leave the Conomi Islands. However, he was willing to sacrifice himself to fight against them, showing that his fear is weaker than his pride."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a doctor, Nako possesses some medical skill, as he was able to re-sew Zoro's abdomen wound."}, {"type": "paragraph", "text": "He is also quite capable at tattooing, as he covered the scar on Nami’s shoulder with a well-drawn pinwheel-tangerine symbol."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Nami%27s_Current_Tattoo_in_the_Manga.png/revision/latest/scale-to-width-down/110?cb=20131122152626", "caption": "Nami's tattoo, drawn by Nako."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When he and the other townspeople stormed Arlong Park, he wielded a spear. However, his abilities with it are unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Nako_With_a_Spear.png/revision/latest/scale-to-width-down/150?cb=20190529034415", "caption": "Nako with a spear."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Bell-mère returned to Cocoyasi Village with Nojiko and Nami, Nako took the children from her to take care of their fevers. Nako was concerned about Bell-mère’s injuries, but she told him to save the children first. Bell-mère decided to adopt the girls, and when she told Nako and the others, they were shocked and very worried."}, {"type": "paragraph", "text": "After Arlong arrived at the Conomi Islands and left Cocoyasi Village for Bell-mère’s house, Nako and Genzo rushed to find Nami and Nojiko, worried that if the fish-men found Bell-mère, she wouldn’t be able to afford the payment for all three of them. Nako intercepted the girls before they could reach home. He explained that they had to flee from the island and leave their mother behind. Though Nojiko agreed, his attempts to sway them were in vain, as Bell-mère revealed to Arlong that she had daughters. Nako tried to stop the girls from running to her but could not. After Bell-mère embraced her daughters, she sacrificed herself for their sake, and Arlong took Nami with him when he left."}, {"type": "paragraph", "text": "Recovering from the wounds left by the Arlong Pirates, Nako explained to Genzo that Arlong sunk all of the village’s boats, ruining their plan for Nojiko and Nami to flee. The townspeople gather the next morning to discuss how to save Nami. Nako proposed that they either fight now or wait for the Marines to save them. Genzo shot down the latter option, as the Marines were not doing anything to save them. The group resolved to fight and try to rescue Nami, but before they could, she returned to the village on her own. The townspeople were upset when the found out that Nami had joined Arlong for money, and Genzo told her to leave and never come back."}], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Nezumi confiscated Nami’s savings she planned to use to buy back her village from Arlong, Nako and the others gathered to fight back. Nami arrived to tell them to wait longer and not lose hope. When they did not listen, she threatened them with a knife. However, Genzo grabbed it from her by the blade, and Nako explained that they had all already made up their minds to fight back."}, {"type": "paragraph", "text": "The townspeople mobilized to Arlong Park to support the Straw Hat Pirates. Nako and the others were nervous when Hatchan summoned Momoo. He and the others watched as Luffy defeated Momoo and most of Arlong’s crew. When the Straw Hat Pirates challenged Arlong’s officers, Nako commented on how odd Usopp was, as the pirate pretended to be brave before running from Chew in fear.Zoro and Sanji appeared to fall to their enemies, but Nako and the other townspeople watch in surprise as they stand up ready to continue their fights with Hatchan and Kuroobi. Nako watched through Zoro’s fight and was fearful that Zoro was hurt when he dove into Hatchan’s swords and spun at the same speed, cutting the fish-man’s hands."}, {"type": "paragraph", "text": "After Zoro and Sanji defeated their fish-man opponents, Arlong knocked them to the ground. When Nami appeared to confront him, Nako and the others turned to face her. When Luffy, who was trapped underwater in the Park’s plaza, was freed and flies through the air, Nako and the townspeople called him an idiot for grabbing an injured Zoro from Arlong’s grasp but flinging him through the air in his place. Nako and the others were shocked at the young captain’s quick, successive attacks on Arlong, even if they did not affect the fish-man. Nako continued to watch the fight and was unsure of the victor when Arlong Park fell into ruins. Luffy arose from the rubble, and the people of the Conomi Islands were now saved. After Nezumi tried to claim responsibility for Arlong’s defeat and was driven off by the Straw Hat Pirates, Genzo and Nako converse about the fact that they were saved by pirates."}, {"type": "paragraph", "text": "Back in Cocoyasi Village, Nako tended to the wounds of Zoro, Luffy, Yosaku, and Johnny. Nako grumbled about the crew having no doctor, giving Luffy the idea to find a doctor of their own. While everyone else continued to celebrate their victory, Nako tattooed Nami in his office, telling her that a scar from her stab wound would always be there, even with a tattoo. Nami gave him a slip of paper with a design on it, asking Nako to tattoo it over her scar. On the morning of the Straw Hat Pirates departure, Nako, Genzo, and Nojiko discussed whether or not Nami would leave without her money. Sprinting to the Going Merry, Nami weaved through the crowd and leaped to the ship from the dock. She landed and revealed that she stole everyone’s wallets, much to the townspeople’s dismay. As Nami and her friends sailed off, Nako handed Genzo the slip of paper Nami gave him earlier, showing him that the tattoo she designed included a tangerine to represent Bell-mère and a pinwheel to represent Genzo."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Nako_Treating_Zoro%27s_Wounds.png/revision/latest/scale-to-width-down/250?cb=20190529034746", "caption": "Nako treating Zoro's wounds and lamenting the Straw Hat Pirates' lack of a doctor."}]}, {"title": "Two Years Later", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, Nako was seen with Nojiko, Chabo, and Genzo, carrying a bottle and watching them carry tangerines."}], "images": []}]}