{"sections": [{"title": "Vasco Shot", "level": 1, "content": [{"type": "paragraph", "text": "Vasco Shot, known as the \"Heavy Drinker\", was one of the legendary criminals who was given a life sentence in Level 6 of Impel Down. He was freed by Marshall D. Teach and is currently a member of his crew."}, {"type": "paragraph", "text": "He is currently one of the Ten Titanic Captains, and the captain of the Eighth Ship of the Blackbeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Vasco Shot is a huge man, three times a normal man's height; of the Blackbeard Pirates' core members, his size is second only to Sanjuan Wolf's. He is stocky, overly top-heavy in build with thick-sized arms, proportionate to his torso, that reach knee level, looking massive compared with his disproportionally shorter, thinner legs."}, {"type": "paragraph", "text": "He has light, slightly reddish skin, an extremely wide neck, and atop it a particular, unprepossessing face that is most set apart by his big, bulbous nose: uniform in its thickness, protruding down over his mouth plus slightly frontward, with small, nearly unseen nose wings, and a strange placement: its bridge starting higher than Vasco's eyes are set. The latter are widely spaced beside his nose, drooping, with purplish-gray irises, underlined by blackish lines (more prominent in the manga) that jut upward from the outer eye corners akin to lashes, and being topped by what seems to be thin, short brows always drawn downward, touching the nose's upper edge. Otherwise, Vasco's expression is perpetually a drunken smile with his mouth gaping wide, exposing his big, rounded teeth, his tongue sticking out, salivating, thickening the apples of his cheeks (marked by blush marks), and forming prominent chin folds. His tall, rounded forehead is furrowed, with a black jester's hat above whose two cones bend over, and are tipped by white pompoms. Behind, his black, waved hair comes out to go down his back, and placed upon the sides of his neck (three on each) are large, golden ring piercings."}, {"type": "paragraph", "text": "True to his moniker, Vasco is always seen chugging on a large, yellowish gourd of liquor strapped on his back by a brown cord, which has the kanji \"sake\" (酒, \"sake\") on its bottom section. Clothes-wise, beside his hat, he has only been seen donning the basic Impel Down prison uniform, comprising a long-sleeved shirt and shorts striped black-and-white, and white slip-on shoes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bc/Vasco_Shot_Anime_Concept_Art.png/revision/latest/scale-to-width-down/190?cb=20180910230044", "caption": "Vasco Shot's concept art from the anime"}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shot appears to have a very vicious personality, as he asked Blackbeard for permission to kill all the people at Marineford regardless of their strength. As his epithet suggests, he is a drunk, and loves to drink all the time, to the point of complaining that they should invade a town only to get more alcohol. It is unknown how much of his drunkenness influences his sober personality."}, {"type": "paragraph", "text": "Like many characters in One Piece, he has a unique laughter style: \"Toputoputoputopu...\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "His abilities have not yet been shown, but he was powerful enough to be contained in Level 6 of Impel Down when caught by the World Government. Another testament to his power is the fact that when Blackbeard recruited the Level 6 prisoners, he only chose the strongest ones that could survive when pitted against everyone else in a free-for-all battle. After becoming captain of the Eighth Ship of the Blackbeard Pirates, he gained the authority associated with the status."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Vasco Shot is shown to have good endurance where he endured a Gura Gura no Mi shock wave from Whitebeard (albeit not a direct hit), and a shock wave from Sengoku in his Daibutsu Form and recovered quickly enough to assist the other Blackbeard Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was seen using dual pistols to shoot Whitebeard."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Vasco Shot was once one of the most feared criminals in the world, but was eventually caught by the World Government and was given a life sentence in level 6 of Impel Down where he was effectively erased from history."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "Shot was mentioned briefly by Emporio Ivankov as part of an explanation of Level 6's true horror to Bentham. Later, under Marshall D. Teach's orders, Shot fought to the death with the inmates of his cell, and being victorious, was given freedom and was recruited into the Blackbeard Pirates."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was seen alongside the Blackbeard Pirates and fellow criminals, all of whom were recruited into the crew, and were at Marineford to watch Whitebeard die. He joined the rest of the crew in assaulting Whitebeard, and attacked him with a barrage of bullets."}, {"type": "paragraph", "text": "After Whitebeard dies, Vasco Shot assists his fellow crewmates in covering Whitebeard's body in a black cloth and guards Blackbeard as he starts to demonstrate his powers. He is then, along with the rest of his crew, attacked by a shockwave caused by Sengoku in his Buddha form. After Shanks intervened in the war and ended it, Shot left with his crewmates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Whitebeard_vs_Blackbeard_Pirates.png/revision/latest/scale-to-width-down/210?cb=20151018201408", "caption": "The Blackbeard Pirates dealing the death blow to Edward Newgate."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "The crew makes their move in the New World, taking out Jewelry Bonney in the process. When the crew is seen bickering amongst each other, Shot is complaining that he is running out of alcohol, and that they should next travel to an island with a town. The Blackbeard Pirates' raft was brought close to the point of destruction due to Sanjuan Wolf's size, and they seemingly got in contact with the Marines to trade Jewelry Bonney for a battleship. Van Augur alerts Teach that the battle ship has arrived, but not for trade because Akainu is on board. Knowing that the deal will not happen, the Blackbeard Pirates flee, leaving Bonney and her crew behind to be arrested."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fd/Shiryu_Fire_Island.png/revision/latest/scale-to-width-down/210?cb=20130223001648", "caption": "Shot with the Blackbeard Pirates waiting for the delivery of a Marine ship."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "One year after the war at Marineford, the Blackbeard Pirates fought against the remnants of the Whitebeard Pirates and ultimately won."}, {"type": "paragraph", "text": "The Blackbeard Pirates used their captain's knowledge of Whitebeard's former territory to conquer it. Now that Blackbeard has become a Yonko, the Blackbeard Pirates are hunting down powerful Devil Fruit users in order to absorb their abilities."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Blackbeard Pirates later attacked Baltigo, the Revolutionary Army's headquarters. Baltigo was destroyed by the time the Marines and Cipher Pol arrived, but the Revolutionary Army was able to escape. However, the Blackbeard Pirates fled after briefly clashing with Cipher Pol."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Blackbeard Pirates vs. Edward Newgate", "elements": []}, {"text": "Blackbeard Pirates vs. Fleet Admiral Sengoku", "elements": []}, {"text": "Blackbeard Pirates vs. Bonney Pirates", "elements": []}, {"text": "Blackbeard Pirates vs. Whitebeard Pirates (under Marco, unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Revolutionary Army (unseen)", "elements": []}, {"text": "Blackbeard Pirates vs. Cipher Pol (unseen)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Vasco's name is similar to Vasco da Gama, a Portuguese explorer, and Vasco Núñez de Balboa, a Spanish explorer and conquistador. His surname, Shot, is also a common term for small amounts of alcoholic beverages (usually about 1 to 4 oz).", "elements": []}, {"text": "Vasco's favorite food is Shaoxing wine.", "elements": []}]}], "images": []}]}