{"sections": [{"title": "Karma", "level": 1, "content": [{"type": "paragraph", "text": "Karma is the captain of the Takotopus Pirates, an infamous New World pirate crew subordinate to the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Karma is an octopus fish-man whose most distinctive trait is the large dark pink octopus he wears on his head and his six arms, but unlike Hatchan and Octopako, his arms lack suction cups nor does he have an elongated mouth. He has a red circle right in the middle of his forehead and a black goatee. He wears a striped shirt with ripped sleeves, a standard pirate's sash and loose pants similar to Buggy's"}, {"type": "paragraph", "text": "30 years ago, he did sport his goatee and he wore a shirt with a stylized kanji \"業\" which means \"karma\"."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Karma was once a cruel man, willing to capture humans, such as Kozuki Toki, to sell for a profit. However, it remains unclear if he is still involved in this trade after he became subordinate to Whitebeard."}, {"type": "paragraph", "text": "Since he refers to Whitebeard as \"Pops\" and came to Marineford in order to save Ace, it is assumed that Karma has a strong bond with the Whitebeard Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Karma is a fearsome pirate who has managed to make himself an infamous reputation in the New World and ally himself with the Whitebeard Pirates. He avoided injuries from the war."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "With his multiple arms, Karma is capable of wielding a total of six sabers, similar to Hatchan's Rokutoryu. It can be assumed that he is a capable swordsman, and the fact that he can use six weapons at the same time helps him greatly in battle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/42/Karma%27s_Weapons.png/revision/latest/scale-to-width-down/200?cb=20150802020439", "caption": "Karma wielding his swords."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Karma and his crew were kidnappers. Thirty years ago, his crew tried to capture Toki on a certain island to sell her. His crew was then scared off by Kozuki Oden, who they had mistaken for an umibozu, and so they went to get their captain for help. When Karma returned, he threatened to sell them both, but before he could act, he was swiftly knocked out by Whitebeard."}, {"type": "paragraph", "text": "Sometime later, Karma became a known pirate in the New World and allied himself with the Whitebeard Pirates."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Karma and his crew joined forces with the Whitebeard Pirates to save him. He was seen attacking the Marines out of the bay with his fellow allies, and later managed to enter it. At Epoida's side, he was surprised to hear that Monkey D. Luffy's father was the revolutionary Monkey D. Dragon. Later, Karma followed Whitebeard's orders in attacking Marineford from the side instead from the front."}, {"type": "paragraph", "text": "When Fleet Admiral Sengoku put his plan into motion, Karma and his crew were attacked by the Pacifista army. After Squard stabbed Whitebeard and claimed that he sold out his allies to save Ace, Karma began to doubt Whitebeard. While he was fighting against Pacifistas, he even turned towards the Yonko to ask him if all that was true or not. When Whitebeard showed his selflessness by giving the pirates an escape route, Karma's loyalty to Whitebeard was renewed."}, {"type": "paragraph", "text": "After the siege wall was raised and Admiral Akainu melted the ice with his magma powers, Karma boarded Whitebeard's hidden ship and entered the plaza with the help of Little Oars Jr.. After Luffy saved Ace from the second execution attempt with his Haoshoku Haki, Karma and the other pirates support Luffy on Whitebeard's orders. When Luffy managed to free Ace on the scaffold, the pirates rejoiced. When Squard wanted to sacrifice himself in order to help the pirates escape, Karma was one of the ones who told him not to do it. Just when the pirates were about to leave with Ace, Akainu provoked Ace and took his life. When the admiral aimed for Luffy's life, Karma and the other pirates made protecting Luffy their top priority. After Shanks arrived and called for a ceasefire, Karma and the other pirates left."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Karma%27s_Ship.png/revision/latest?cb=20100928004245", "caption": "Karma's ship."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Karma and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, Karma cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows Karma alongside the other attendees. Although it can be assumed that Karma was at the funeral, there is no visual evidence of his attendance in the manga to support this assumption and, as such, his attendance can only be considered non-canon."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 467, Karma makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 48), Karma's birthday is given.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 337), Karma's name is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 48), Karma is revealed to be an octopus fish-man", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964 (p. 13), Karma is revealed to have been human trafficker.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 558 and Episode 467, Karma reacts to Sengoku's words about Luffy's father.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 58 Chapter 563, Karma wonders if Whitebeard really betrayed his allies.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, Karma attends Whitebeard and Ace's funeral.", "elements": []}]}], "images": []}]}