{"sections": [{"title": "Hamburg", "level": 1, "content": [{"type": "paragraph", "text": "Hamburg is a member of the Foxy Pirates and also the leader of the Groggy Monsters. Along with Porche, he was one of Foxy's first crewmates."}, {"type": "paragraph", "text": "Due to his actions, he is a major antagonist during the Long Ring Long Land Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hamburg is a huge gorilla-like human who is almost always seen laughing. He wears the typical clothing of a Foxy Pirate from the mask to the long-sleeved gloves. He is the smallest member of the Groggy Monsters. He also wears a leopard patterned scarf. In the 4kids version of the game One Piece: Pirates Carnival, Hamburg has very dark skin and wears red instead of blue."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hamburg is very unintelligent, similar to his fellow Groggy Monsters. He laughs at anything, whether it is his crew cheating or his depressed captain. He also laughs when he is nervous, as seen when the Straw Hats are deciding who to pick for their crew after the last round of the Davy Back Fight. Like the rest of the Foxy Pirates, he is quite dishonest and cheats whenever the opportunity presents itself."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Foxy", "level": 3, "content": [{"type": "paragraph", "text": "Hamburg often carries Foxy around and tends to help him cheat. Although he seems to respect and admire Foxy, he always laughs cheerfully at his captain's misfortune."}], "images": []}, {"title": "Groggy Monsters", "level": 3, "content": [{"type": "paragraph", "text": "As a member and leader of the Groggy Monsters, Hamburg has a strong camaraderie with his two teammates. The three of them often laughed together over even the dumbest subjects. As a result of this, the three of them work especially well together during the Groggy Ring."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Hamburg is a fearsome fighter, especially during the Groggy Ring events. As the leader of the Groggy Monsters, he has command over them. Due to the strong camaraderie he shares with his fellow teammates, they are able to coordinate their attacks in a seamless flow that often overwhelms their opponents."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/41/The_Groggy_Monsters%27_Weapons.png/revision/latest/scale-to-width-down/210?cb=20121214062859", "caption": "The Groggy Monsters with the weapons to make a Monster Burger."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "As a Foxy Pirate, Hamburg commonly cheats whenever he gets the chance. During Groggy Ring events, whenever the referee \"unfortunately\" looks the other way, he and his fellow Groggy Monsters don illegally concealed weapons. In Hamburg's hidden arsenal, he has a pair of iron gauntlets and a pair of iron clubs, the latter of which he uses primarily to perform the devastating team attack the Groggy Monsters are capable of, Monster Burger."}], "images": []}, {"title": "Techniques", "level": 3, "content": [{"type": "paragraph", "text": "The attacks he uses in the Groggy Ring are as follows:"}, {"type": "list", "elements": [{"text": "Gorilla Throw (ゴリラスロー, Gorira Surō): After Big Pan sends the ballman downfield with his Punk Pass, Hamburg catches the ballman and then throws him to Pickles.", "elements": []}, {"text": "Hamburger Hammer (ハンバーガーハンマー, Hanbāgā Hanmā): This attack is used after Big Pan's Super Roller Coaster and the enemy is in the air. After putting on the iron knuckles, Pickles propels him into the air with a Spinning Tackle. Hamburg than clenches his fist together and slams the opponents towards the ground.", "elements": []}, {"text": "Size Attack S-M-L (サイズアタック S-M-L, Saizu Atakku S-M-L): Combo attack done with Pickles and Big Pan. First Hamburg punches the opponent in midair with his iron gauntlets, knocking them towards Pickles, who then rams the target straight up into the air with his spiked shoulderpads. Finally, Big Pan slaps the unlucky target into the ground with his palm. In the Viz Manga, this is called Size Attack! Small!! Medium!! Large!!.", "elements": []}, {"text": "Monster Burger (モンスターバーガー, Monsutā Bāgā): A combo with Pickles and Big Pan in the Groggy Ring. With the biased referee making sure not to watch, all three of them bring out weapons to use against the other team. Hamburg uses two clubs, Pickles uses two swords, and Big Pan uses two giant metal pans that he claps together to try to crush enemies.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Hamburg and Porche were the first people to join Foxy and form the Foxy Pirates."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [], "images": []}, {"title": "Pre-Groggy Ring Events", "level": 4, "content": [{"type": "paragraph", "text": "After defeating the Fanged Toad Pirates in a previous Davy Back Fight, Hamburg and the rest of the Foxy Pirates decided to challenge the Straw Hats next. Accompanying his captain with Porche, the three of them were able to goad Luffy into accepting the challenge. After some pre-Davy Back formalities, the Foxy Pirates and the Straw Hats were ready for the Davy Back Fight."}, {"type": "paragraph", "text": "During the Donut Race event of the Davy Back Fight, Hamburg helped primarily with his captain in cheating. From being Foxy's steed to helping his captain in set up obstacles to slow the Straw Hats participating in the race, they did so due to the rules of the event which allows the audience to interfere with the racers. Despite their dubious tricks however, Hamburg and his captain constantly failed in slowing down the Straw Hat racers. Fortunately at the very end of the race, Hamburg's captain was able to stop the Straw Hats in time with his Noro Noro no Mi Devil Fruit powers. With that the Foxy Pirates won their first tainted victory against the Straw Hats. After a little aid in explaining Foxy's powers and getting Chopper as a new member per the rules of the Davy Back Fight, Hamburg went off to participate in the second part of the Davy Back Fight, the Groggy Ring."}], "images": []}, {"title": "The Groggy Monsters vs. Zoro and Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Asked specifically by Foxy to participate in the Groggy Ring along with the rest of the Groggy Monsters, Hamburg and his team arrived much to the awe of the rest of the Foxy Pirates and the surprise of the Straw Hats. For this event, Hamburg and his team were to face a team consisting of Zoro, Sanji, and Chopper. Due to Chopper being picked by Foxy earlier, however, the Groggy Monsters were given a better chance at winning the Groggy Ring match. With Big Pan and Sanji being the ball for their respective teams, the match was ready to begin. Though Hamburg and his teammates displayed their usual dumb interactions with one another, they were more than ready to win once more in the Groggy Ring."}, {"type": "paragraph", "text": "As the match began, Hamburg and his teammates' superb teamwork skills immediately overwhelmed both Sanji and Zoro. However just as Hamburg was about to dunk Sanji into the buoy, he was interrupted by Zoro throwing Pickles at him. Having been struck out with his own teammate, not only were both of them knocked out but the entire Groggy Monsters' tactics were countered for the first time by anyone. Though the both of them were knocked out momentarily, their remaining teammate Big Pan was able to hold his own against the two Straw Hats with a little help from the referee. After their momentarily collapse, Hamburg and Pickles got back into the game equipped with a couple of weapons that the referee \"unfortunately\" did not notice."}, {"type": "paragraph", "text": "As the match went on and the Groggy Monsters got more offensive in their tactics, they were suddenly asked for a Monster Burger by Foxy. Seeing how the two Straw Hats continued to go on despite how rough the Groggy Monsters got, their captain asked them to deal with them with their ultimate team combo move. With the referee \"unfortunately\" looking at the other way and their weapons ready, Hamburg and his teammates went forth to finally defeat the Straw Hats. However in the midst of their attack, Hamburg was brutally damaged by Sanji and then sent flying to Big Pan wherein he was accidentally flattened by his own teammate. As this counterattack from the Straw Hats continued, they were able to not only incapacitate Hamburg's teammates as well but also score a victory from them."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Spa Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Thriller Bark Arc of the anime, Hamburg is seen accompanying Foxy with Porche, and are again encountered by the Straw Hats in an anime exclusive place called Spa Island. Working alongside the corrupt owner, Doran, they aim to steal a notebook from two sisters whose father discovered how to make a unique jewel. While Hamburg and his companions are able to initially beat Luffy and most of his crew with a new mecha, their actions are thwarted by Luffy's two newest crew members, Franky and Brook. After the Straw Hats defeat Doran and his goons, their brief alliance with the owner is broken."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Foxy_Pirates_Swimsuits.png/revision/latest/scale-to-width-down/210?cb=20120510200926", "caption": "Foxy along with Porche and Hamburg returning in the Spa Island Arc."}]}, {"title": "Adventure of Nebulandia", "level": 3, "content": [{"type": "paragraph", "text": "The Foxy Pirates continued their adventures into the New World, resuming their Davy Back Fight winning streak, but were always laughed at due to their Jolly Roger. Hamburg was present when Foxy defeated Komei in a Davy Back Fight, and watched as Komei donned his Foxy Pirates mask and shook hands with Foxy."}, {"type": "paragraph", "text": "Hamburg took part in a plot to disguise the Foxy Pirates and lure the Straw Hat Pirates to Mushroom Island, which was successful. Luffy accepted Foxy's challenge to a Davy Back Fight rematch, and the first round, the Eating Contest, began. Hamburg, Porche, and Dojaku competed against Luffy, Zoro, and Sanji to see who could eat a pile of mushrooms the fastest. Hamburg and Porche took off eating. Suddenly, everyone who ate the mushrooms collapsed, only to rise up with no motivation whatsoever. Komei revealed that this was part of his plan to capture the Straw Hats as he and Dojaku turned the arena into a cage, trapping Hamburg, Porche, and the Straw Hats. The cage was then pulled up to the Sexy Foxy, which sailed away under Komei's command."}, {"type": "paragraph", "text": "Hamburg, Porche, Zoro, and Sanji were taken to Nebulandia and thrown into a cell, and Komei plotted to execute the two Foxy Pirates due to them being pirates. The next morning, Foxy arrived and freed Hamburg and Porche, administering an antidote that gave them their motivation back. However, Hamburg and Porche said they needed to get something back before heading out, and their captain and crewmates followed them."}, {"type": "paragraph", "text": "The Foxy Pirates later emerged outside as the Straw Hats beat back the Marines. They then headed back to Mushroom Island, where Foxy ended his cease-fire with Luffy and attacked him. However, Nami tricked him and attacked Foxy, Hamburg, and Porche with a lightning bolt. The Straw Hats then sailed away, and the Foxy Pirates bid them farewell as they prepared to resume their own adventures."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Foxy_Frees_Porche_and_Hamburg.png/revision/latest/scale-to-width-down/210?cb=20151226175808", "caption": "Foxy frees Porche and Hamburg from captivity."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the Long Ring Long Land Arc filler episodes, Hamburg returns to compete in other games."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Hamburg is featured in the One Piece Full Color R Gashapon series."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Dragon Dream!", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirates Carnival", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Like the other Groggy Monsters who are named after culinary names, Hamburg is named after the Japanese culinary dish known as Hamburg.", "elements": []}, {"text": "Hamburg seems to be given a distinct laugh, following this tradition with a \"Pu\" (Pupupupupupu).", "elements": []}]}], "images": []}]}