{"sections": [{"title": "Capote", "level": 1, "content": [{"type": "paragraph", "text": "Capote is a billfish fish-man and a member of the Foxy Pirates."}, {"type": "paragraph", "text": "Due to his actions, he is a major antagonist during the Long Ring Long Land Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Capote is a billfish fish-man with green skin, dark red hair, and a long, sharp nose. He wears a yellow shirt, purple gloves, purple shorts, a yellow belt, and a dark purple mask that all Foxy Pirates wear, along with a light purple hood."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like most fish-men, he is arrogant and sure of himself. Unlike them, however, he shows no prejudice against humans."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a fish-man, Capote possesses strength tenfold that of average humans, and double that in water. Unlike other fish-men, however, he seems to have little to no navigational skills, as he could not figure out which path to take in order to take advantage of the currents, something Nami was able to do with great ease."}], "images": []}, {"title": "Fish-Man Karate", "level": 3, "content": [{"type": "paragraph", "text": "Capote is a Fish-Man Karate practitioner. He is strong enough to use a karate chop to generate a shock wave to slice the ocean itself. He can also place himself in Monda's mouth to create a makeshift engine to quickly navigate their boat through coral reefs and whirlpools."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Kaimen_Wari.png/revision/latest/scale-to-width-down/180?cb=20141206183443", "caption": "Capote using Kaimen Wari."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "At the start of the Davy Back Fight, Capote participated in the Donut Race with Porche aboard the \"Cutie Wagon\" transported by Monda. Thanks to Foxy's Noro Noro no Mi abilities, they managed to win the Donut Race."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Porche%2C_Capote%2C_and_Monda_in_Cutie_Wagon.png/revision/latest/scale-to-width-down/210?cb=20130212053856", "caption": "Porche, Capote and Monda in their boat Cutie Wagon."}]}, {"title": "Adventure of Nebulandia", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Capote took part in luring the Straw Hats to Mushroom Island, where Foxy challenged them to a Davy Back Fight rematch. During the match, it was revealed that new crewmembers and undercover Marines Komei and Dojaku orchestrated it in order to capture the Straw Hats. The two succeeded in drugging and capturing Zoro, Sanji, Porche, and Hamburg, and redirected a Noro Noro beam that Foxy fired at them, immobilizing Capote and everyone on the beach."}, {"type": "paragraph", "text": "Capote and the Foxy Pirates stayed behind as Foxy and Kansho joined the Straw Hats in their mission to rescue their comrades. Capote, Itomimizu, and Chuchun tried helping Brook and Chopper look for the Rebound Mushroom, but they were ambushed by the Marines. However, Capote, Itomimizu, and the Foxy Pirates sacrificed themselves to let Brook, Chopper, and Chuchun escape."}, {"type": "paragraph", "text": "However, Brook, Chopper, and Chuchun befriended a giant snake creature named Kinoconda and freed the Foxy Pirates from the Marines. They then rode in Kinoconda's mouth to Nebulandia, where they freed Foxy and the Straw Hats. Capote and the Foxy Pirates accompanied Foxy in his quest to free Porche and Hamburg."}, {"type": "paragraph", "text": "The Foxy Pirates returned outside in full force as they helped the Straw Hats beat back the Marines. The two crews then returned to Mushroom Island, where they parted ways. Foxy then spoke to his crew, encouraging them to continue their adventure."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Capote appeared in additional games in the anime."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Grand Battle! Rush!", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 46), Capote's birthday is given.", "elements": []}, {"text": "↑ One Piece Manga and Anime - Vol. 33 Chapter 307 and Episode 209, Capote slices the sea open to reach the Barrel Tiger.", "elements": []}, {"text": "↑ One Piece Manga and Anime - Vol. 33 Chapter 308 and Episode 210, Capote and Monda combines to form an engine.", "elements": []}]}], "images": []}]}