{"sections": [{"title": "Ross", "level": 1, "content": [{"type": "paragraph", "text": "Ross is a former member of the Bellamy Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ross is a muscular man with the upper-half of his face always hidden by his light-blue baseball cap, which has the letters \"ALLR\" written on it. He wears a fur-lined dark-brown jacket, a green sash, and spotted green pants."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ross is taciturn and has spoken only a single line of dialogue thus far, this being about Cricket's possible reasons for wanting to find the Golden City. He obeys Bellamy's orders without question, and seems to have a certain confidence in his captain's strength, as he was shown to be shocked after Bellamy's humiliating defeat at Luffy's hand. He also seems to be rather violent, as seen when he smashes Luffy's head into a window, when he could have simply just thrown him out of the bar."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Ross was shown to be of greater than average strength, being able to pick Luffy up by his head and smash him forcefully into a window. Later, when the Bellamy Pirates confront the Saruyama Alliance, he is seen fighting with a sword against Shoujou and Masira, although his skill with it is uncertain, as he was swiftly defeated by the two pirate captains."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "Ross first appears in the hotel where the Bellamy Pirates had stationed themselves, silently standing in the back as his crewmates talk about the Straw Hat Pirates and how they are inferior to Bellamy and Sarquiss. When Bellamy confronts Luffy at the Pub, Ross is present with his other crewmates, standing in the very back near the door. After the crew has had their fill of ridiculing and beating up the obstinate Luffy and Zoro, Bellamy orders Ross and Rivers to throw the \"garbage\" outside, as they are taking up too much of their space. The two comply swiftly, with Rivers kicking Zoro through a table and Ross smashing Luffy's face into one of the pub's windows, severely injuring the both of them. The taciturn man then resumes his vigil as the rest of his crew mock the three Straw Hats, with Sarquiss even offering to \"buy\" Nami."}, {"type": "paragraph", "text": "When Bellamy and the rest of his crew find out that Mont Blanc Cricket is the direct descendant of Mont Blanc Noland, Ross breaks his silence by mentioning how Cricket is probably trying to find gold to clear his family's name, much to Bellamy's amusement. Later, he and the rest of the Bellamy Pirates went to Jaya and confronted the Saruyama Alliance, with Bellamy and Sarquiss swiftly defeating the three pirate captains and taking the gold statue that had taken them ten years to find. With the deed done, Ross and his fellow crewmates went back to Mock Town, where he laughed along with everyone else at their easily achieved victory. When Luffy comes back to the town to reclaim Mont Blanc's property and easily defeats Bellamy with a single punch, Ross is seen staring in shock along with all of the other people present, disbelieving that their captain could be so easily beaten. Realizing that the wanted posters of Luffy and Zoro were indeed accurate, Ross and the rest of Bellamy's crew flee from the dangerous youth."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/89/Ross_Beats_Luffy.png/revision/latest/scale-to-width-down/180?cb=20130929174554", "caption": "Ross smashes Luffy's head into a window."}]}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "Later, as Doflamingo punished Bellamy for tarnishing his symbol, Ross was seen alongside Lily and Rivers, watching this all unfold with a terrified expression on his face."}], "images": []}, {"title": "Later Events", "level": 3, "content": [{"type": "paragraph", "text": "Later, Ross would travel with Bellamy and the other members of the crew to a Sky Island, finding a golden pillar in the process. Although Bellamy managed to bring this back to Doflamingo and regain his trust, it is unknown what became of Ross and the rest of the Bellamy Pirates when their captain forfeited his captaincy to join the Donquixote Pirates."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bellamy Pirates vs. Monkey D. Luffy and Roronoa Zoro", "elements": []}, {"text": "Bellamy Pirates vs. Mont Blanc Cricket, Masira, and Shoujou", "elements": []}]}], "images": []}]}