{"sections": [{"title": "Eddy", "level": 1, "content": [{"type": "paragraph", "text": "Eddy is the former navigator of the Bellamy Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is the bespectacled \"pretty boy\" of the Bellamy Pirates. He is a tall, blond man with a tan complexion. He wears glasses and a has long black and white jacket with a white t-shirt underneath. He also wears a Log Pose, as he needs it since he is the navigator of the Bellamy Pirates."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He has a mean-spirited personality, as shown when he was shown making fun of Luffy and Zoro."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the navigator of the Bellamy Pirates, it can be assumed that Eddy has the knowledge of how to navigate the seas."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was first seen mocking Luffy and Zoro like the rest of the Bellamy Pirates. He determined the location of the Saruyama Alliance base for Bellamy. It was he who reprimanded Sarquiss for taking on Luffy in the anime."}], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "Eddy was later seen when he watched Doflamingo using his powers to force Bellamy and Sarquiss fight against each other as punishment for disgracing themselves under his flag."}], "images": []}, {"title": "Later Events", "level": 3, "content": [{"type": "paragraph", "text": "Later, Eddy would travel with Bellamy and the other members of the crew to a Sky Island, finding a golden pillar in the process. Although Bellamy managed to bring this back to Doflamingo and regain his trust, it is unknown what became of Eddy and the rest of the Bellamy Pirates when their captain forfeited his captaincy to join the Donquixote Pirates."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the manga, it was Rivers who tried to stop Sarquiss from fighting Luffy, while the anime the role was given to Eddy instead.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 223 and Episode 146, Eddy is introduced.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 84), his name and position in the Bellamy Pirates are revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 223 and Episode 146.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 231 and Episode 150.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 32 Chapter 303 and Episode 207.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 706 and Episode 635, Bellamy tells Luffy he went to Sky Island and lost his crew.", "elements": []}]}], "images": []}]}