{"sections": [{"title": "Hewitt", "level": 1, "content": [{"type": "paragraph", "text": "Hewitt is the former chef of the Bellamy Pirates. Not much else is known about him."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He wears a blue coat and has tan skin. His hair is black and has an angry expression. He also has the number \"21\" tattooed on the right side of his forehead."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He seems to be loyal to the Bellamy Pirates, and if so, Doflamingo as well."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Hewitt is seen using a sword during him and his crew's fight with the Saruyama Alliance. As a Cook, he must have some form of culinary skill."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in his life he joined Bellamy, and became his cook."}], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "He later helped Bellamy defeat the Saruyama Alliance. Later, he was there when the Bellamy Pirates were informed of Luffy and Zoro's bounties."}], "images": []}, {"title": "Later Events", "level": 3, "content": [{"type": "paragraph", "text": "After Doflamingo punished Bellamy, Hewitt would travel with the Bellamy Pirates to a Sky Island. It is unknown what became of Hewitt and the rest of the Bellamy Pirates when their captain forfeited his captaincy to join the Donquixote Pirates."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 223 and Episode 146, Hewitt make his debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 84), his name and position in the Bellamy Pirates is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 706 and Episode 635, Bellamy tells Luffy he went to Sky Island and lost his crew.", "elements": []}]}], "images": []}]}