{"sections": [{"title": "Rivers", "level": 1, "content": [{"type": "paragraph", "text": "Rivers is the former sniper of the Bellamy Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rivers is a tall man with a good physique. He wears a white hat with long ear-flaps, a dark-red V-neck shirt with grey trousers and brown boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He seemed to be loyal to the Bellamy Pirates, and did not want Sarquiss to waste his time on Luffy, because he believed Luffy was a weakling."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the sniper of the Bellamy pirates, he must be somewhat proficient in using a gun, or another projectile weapon."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, Rivers joined up with the Bellamy Pirates as their sniper."}], "images": []}, {"title": "Skypiea Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "Rivers first appears in the hotel where the Bellamy Pirates had stationed themselves, silently standing as his crewmates talk about the Straw Hat Pirates and how they are inferior to Bellamy and Sarquiss. When Bellamy confronts Luffy at the Pub, Rivers is present with his other crewmates. After the crew has had their fill of ridiculing and beating up the obstinate Luffy and Zoro, Bellamy orders Rivers and Ross to throw the \"garbage\" outside, as they are taking up too much of their space. The two comply swiftly, kicking Zoro through a table and smashing Luffy's face into one of the pub's windows, severely injuring the both of them."}, {"type": "paragraph", "text": "Rivers was later seen when the Bellamy pirates were informed of Luffy and Roronoa Zoro's wanted posters, and in the manga, it was he who stopped Sarquiss from going after Luffy and not Eddy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Rivers_Beats_Zoro.png/revision/latest/scale-to-width-down/180?cb=20130929174738", "caption": "Rivers kicks Zoro into a table."}]}, {"title": "Later Events", "level": 3, "content": [{"type": "paragraph", "text": "After Bellamy was punished by Doflamingo, Rivers would travel with the Bellamy Pirates to a Sky Island. It is unknown what became of Rivers and the rest of the Bellamy Pirates when their captain forfeited his captaincy to join the Donquixote Pirates."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 223 and Episode 146, Rivers makes his debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 84), his name and position in the Bellamy Pirates is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 706 and Episode 635, Bellamy tells Luffy he went to Sky Island and lost his crew.", "elements": []}]}], "images": []}]}