{"sections": [{"title": "Mani", "level": 1, "content": [{"type": "paragraph", "text": "Mani is a former fighter of the Bellamy Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "She is a curly-haired, dark-skinned woman with thick lips and dark colored eyes. She sports a long sleeve white collar shirt decorated with blue feathers, dark purple pants and sandals."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She has a mocking personality, as she laughed at the Straw Hat Pirates for believing in a Sky Island."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a fighter of the crew, Mani may have some combat skills, but she, like the rest of the crew, simply stand on the sidelines while the two main fighters, Bellamy and Sarquiss, do most of the fighting."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "She was first seen side-by-side with Rivers. When Nami refused Sarquiss's offer to buy her off the Straw Hat Pirates, she and Lily gave each other a surprised glance at her response. Despite being a \"fighter\", she, like the rest of the crew did nothing to stop Luffy right after the Straw Hat walked away with their loot."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f7/Rivers_and_Mani_Together.png/revision/latest/scale-to-width-down/200?cb=20150802033935", "caption": "Rivers and Mani together."}]}, {"title": "Later Events", "level": 3, "content": [{"type": "paragraph", "text": "After Donquixote Doflamingo punished Bellamy, Mani would travel with the Bellamy Pirates to a Sky Island. It is unknown what became of Mani and the rest of the Bellamy Pirates when their captain forfeited his captaincy to join the Donquixote Pirates."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She is drawn as a fair-skinned woman in the manga.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 223 and Episode 146, Mani makes her debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 84), Mani's name and position in the Bellamy Pirates are revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 231 and Episode 150, Much of the Bellamy stood aside while the top two fought against the Saruyama Alliance.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 706 and Episode 635, Bellamy tells Luffy he went to Sky Island and lost his crew.", "elements": []}]}], "images": []}]}