{"sections": [{"title": "Muret", "level": 1, "content": [{"type": "paragraph", "text": "Muret is the former doctor of the Bellamy Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Muret is a young woman with long pink hair tied up in a chignon, with one tuft going down. She is wearing a tight-fitting, cleavage revealing yellow outfit with a zipper running down the middle and boots decorated with crosses. She also seems to have a tiny mole or freckle under her left eye."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of Bellamy's crew, Muret appears to think highly of Bellamy and Sarquiss' strengths. She has almost no interactions with the crew, but when Nami refused Bellamy's offer to buy her off the Straw Hat Pirates, she had been the first to laugh at her response. After Bellamy's defeat, Muret showed her cowardice, refusing to take action against Luffy even when the Straw Hats took all the gold that Bellamy stole."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Muret has not demonstrated much in battle. However, as the Bellamy Pirates' doctor, her talent may lean more on first aid and medical treatment rather than direct confrontation. Also, being the crew's physician, she presumably made the bandage around Bellamy's head that was seen when Doflamingo came to Jaya to punish him. It is unknown how advanced her medical skills are."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "Muret was with the Bellamy Pirates at Mock Town. She and her crew laughed at and insulted Luffy, Zoro, and Nami. When Luffy confronted Bellamy for stealing Cricket's gold, Muret became terrified of the Straw Hat captain after seeing him defeat Bellamy with one punch."}], "images": []}, {"title": "Later Events", "level": 3, "content": [{"type": "paragraph", "text": "After Doflamingo punished Bellamy, Muret would travel with the Bellamy Pirates to a Sky Island. It is unknown what became of Muret and the rest of the Bellamy Pirates when their captain forfeited his captaincy to join the Donquixote Pirates."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 223 and Episode 146, Muret makes her debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 84), her name and position in the Bellamy Pirates are revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 71 Chapter 706 and Episode 635, Bellamy tells Luffy he went to Sky Island and lost his crew.", "elements": []}]}], "images": []}]}