{"sections": [{"title": "Gorilla", "level": 1, "content": [{"type": "paragraph", "text": "Captain Gorilla is a Marine officer who was sent to investigate the Nightmare of Baldimore accidentally caused by Franky."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Captain Gorilla's face remarkably looks like his namesake; a gorilla. He has hairy sideburns and a big, particular nose that resembles those of gorillas. On his head he wears a standard Marine cap. He is dressed in an attire fitting the cold climate of the island he was sent to investigate. He sports a fur-lined cape with the Marine insignia on it and epaulets over what looks like a long coat with pockets on it. On his back he carries a standard flintlock rifle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/05/Gorrilayoung.png/revision/latest?cb=20121205224319", "caption": "Gorilla in his youth as a Marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Despite his rather animal-like appearance, Gorilla seems to be a calm man, willing to carry out his orders as he is told. He is also logical as he refused to immediately jump to the conclusions about Franky during his stay on Karakuri Island. Furthermore, he is somewhat lacking in bravery as he was easily scared when he saw the \"Sacred Burning Beast\" running towards him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Having been sent to Karakuri Island to investigate the incident caused by Franky, it might be assumed that he has some investigation skills. This theory seems to be strengthened by the fact that he refused to immediately jump to the most obvious conclusions after his men reported to him, as he was willing to explore the island and learn more about the facts."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries around a rifle, and being a Marine officer, it can be assumed that he is proficient in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Post-War Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Nightmare of Baldimore happened, Gorilla was sent to the devastated kingdom of Baldimore to investigate what really transpired. From what he and his subordinates could gather, the perpetrator was none other than Cyborg Franky of the Straw Hat Pirates. Gorilla however had his doubts about whether this was true, seeing as the crew was last seen on Sabaody Archipelago and the fact that their captain, Monkey D. Luffy, had participated in the Battle of Marineford. The only way to get to Baldimore as far as Gorilla knew was through the use of a large icebreaker and no sightings of any icebreakers had been reported. Apart from that, Gorilla also figured that it could have been one of the kingdom's many cyborg gorillas whose body shape could be mistaken for Franky's. Despite his doubts, Gorilla decided to accompany a search party that was headed to the mountains."}, {"type": "paragraph", "text": "There, he and his men had the unfortunate luck of encountering a flaming tiger-like being, leading them all to scream in terror, not knowing in reality that it was really Franky running around due to the tiger skin rug he was wearing catching on fire. Unaware of the truth, the incident became a legend known as \"The Legend of the Sacred Burning Beast of Baldimore\" and was passed down through the generations."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/Gorilla_Runs_in_Fear.png/revision/latest/scale-to-width-down/210?cb=20190103100516", "caption": "Gorilla runs from the Burning Beast of Baldimore."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 596 (p. 12) and Episode 514.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 51), His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 596 (p. 15) and Episode 514.", "elements": []}]}], "images": []}]}