{"sections": [{"title": "Carrot", "level": 1, "content": [{"type": "paragraph", "text": "Carrot is a rabbit mink in the Warrior Beast Tribe, a member of the Inuarashi Musketeer Squad, and a ruler's aide."}, {"type": "paragraph", "text": "She is an ally of the Straw Hat Pirates during the Yonko Saga, mainly during the Whole Cake Island Arc, where she joined the Sanji Retrieval Team to rescue Sanji on Whole Cake Island and continued on with the crew to Wano Country."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Carrot is a white-furred, blonde-haired, curvaceous, and well-endowed rabbit mink with brown eyes, rabbit ears, a rabbit-like nose, and a large round fluffy tail. She seems to be short when compared to normal-sized people like Roronoa Zoro,Wanda, Sanji, or even Nami."}, {"type": "paragraph", "text": "In her first appearance, she wore a short orange dress with laced-up open sides with the Guardians' signature green cape, a single rabbit paw-like gauntlet, and brown, high-heeled boots."}, {"type": "paragraph", "text": "Upon sneaking aboard the Thousand Sunny, she changed to a short orange dress with the word \"RABBIT\" at the front with a single white stripe, a black cap, and yellow loafers. She also had a backpack and a canteen."}, {"type": "paragraph", "text": "She later wore another short orange dress with a hood."}, {"type": "paragraph", "text": "After reaching Totto Land, Carrot donned a simple, light-green short-skirt dress decorated with three vertical stripes running down the center and frills at the bottom, neck, and sleeves, and tied up at the front with an orange bow, as well as a pair of orange dress shoes. An additional accessory includes an orange hat. "}, {"type": "paragraph", "text": "At the meeting with the Fire Tank Pirates, she wore a flapper-style outfit of a white cloche hat with a pink rose, a sleeveless white blouse with a frilly collar and pink ribbon, a frilly black skirt, and black pumps. Her outfit had different colors (yellow blouse, red skirt, and orange pumps) in the original \"Hope\" opening."}, {"type": "paragraph", "text": "At the start of the Wano Country Arc, she wore a simple short salmon pink dress with a carrot design and the word \"Ninjin\". After Kin'emon used his powers to disguise her as a kunoichi, Carrot donned a light polka-dotted veil concealing her ears, a light green kimono with orange and green floral prints, and simple straw sandals."}, {"type": "paragraph", "text": "During her training under Shishilian, she wore a red musketeer hat and a light-green dress with thin straps, and her hair was slightly shorter."}, {"type": "paragraph", "text": "When Carrot activates her Sulong form on a full moon, her eyes turn red, her ears grow larger, her hair and tail grow considerably and turn snow white in color, and they both emit Electro sparks. The fur around her neckline turns much thicker, vaguely resembling a lion's mane, and her claws become longer and sharper."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Carrot is very protective of the Mokomo Dukedom and is highly aggressive towards intruders. Like other minks, she refers to humans as \"lesser minks\". After traveling with the Sanji Retrieval Team, she grew out of speaking in the traditional Mink speech pattern. Carrot is also protective of people she cares about. When the Straw Hat Pirates were met by Germa 66, Carrot was willing to fight the evil army in order to protect them. She can also be very emotional; when Monkey D. Luffy ate poisonous fish skin and was left on the verge of death, Carrot begged him not to die and tearfully embraced him once the poison was sucked out of him. After Pedro sacrificed himself in a suicidal explosion, Carrot became devastated and cried profoundly before becoming enraged to where she took it out on Katakuri."}, {"type": "paragraph", "text": "Like a regular rabbit, she likes to gnaw on things, including people such as Luffy. She loves carrots to the point where her provisions for the trip to Whole Cake Island consisted entirely of them, and she ferociously attacked Luffy when she saw him eating her carrot. She also loves chocolate."}, {"type": "paragraph", "text": "Though feral and vicious when attacking someone, Carrot can be quickly calmed down if someone pats her head. Despite her warrior status, she seems to be naive and childish about serious matters and the world beyond Zou, and was easily excited by events new to her; when she heard Luffy planning to crash Big Mom's party and ruin the wedding ceremony, she believed it would be exciting to take part in, not realizing the extreme danger she would be facing in doing so, and she was later surprised to hear that it would take several days to reach Whole Cake Island because of how big the ocean was, having believed that it was small enough to only warrant half a day's worth of provisions. Additionally, she is not familiar with some natural weather phenomena, having mistaken lightning for Electro upon witnessing it at sea. She has always wanted to see the outside world and go on an adventure, and upon her discovery aboard the Thousand Sunny, she begged Pedro not to take her home immediately out of fear of being berated by Wanda. She is apparently scared of ghosts as she was frightened by Brook's soul form."}, {"type": "paragraph", "text": "Despite her naivete, she has also proven that she can be rather clever and deceiving; she quickly devised a plot to use Charlotte Brûlée's mirror based powers against her and successfully fooled several Big Mom Pirates into thinking that they had captured her."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Mink Tribe", "level": 4, "content": [{"type": "paragraph", "text": "Carrot is loyal to her fellow minks and has a close friendship with Wanda. Though Wanda was initially worried when the minks could not find Carrot after the latter snuck onboard the Thousand Sunny, Wanda admitted that she was simply glad to know where she was. Carrot, on the other hand, was afraid that Wanda would berate her if the Sanji Retrieval Team return to Zou, and pleaded Pedro not to send her back. Despite Carrot being a Musketeer and Pedro being a Guardian (groups lead by two leaders who don't get along with each other), the two seem to be very caring for each other's well-being, and Carrot cried when Pedro attempted to take down Charlotte Perospero with a suicide attack."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Like the other minks, Carrot is grateful to the Straw Hats for saving the citizens of Zou after they were devastated by Jack's invasion. Carrot even joined the Sanji Retrieval Team in entering Big Mom's territory to rescue their captive crewmate and though they initially wanted to bring her back to Zou, they nonetheless allowed her to join. Carrot has become close to Chopper giving him the nickname \"Choniki\" and the two worked together in defeating Charlotte Brûlée. Like the others, she was excited to hear Sanji again and was bashful when they received praise from Luffy in completing their assigned tasks. After the Sanji Retrieval Team escaped Totto Land, Carrot was overjoyed at the prospect of eating Sanji's food again."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Jack", "level": 4, "content": [{"type": "paragraph", "text": "When Jack invaded Zou in search of Raizo, Carrot took a stand against his forces alongside the other minks. Like the rest of her tribe, she has sworn to never forgive Jack for destroying their country."}], "images": []}, {"title": "Big Mom Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Carrot became an enemy of Big Mom's family and crew during the mission to retrieve Sanji from Totto Land. At the Seducing Woods, she clashed against Randolph, who was sent to deal with the intruders. Charlotte Brûlée is also very antagonistic towards Carrot, saying that she wants to slice the latter's face because of how pretty it is. After imprisoning Carrot in the Mirro-World, Brûlée planned to put her in boiling soup, although this failed. She further earned the latter's fury by using her power to navigate through Big Mom's territory to find her friends. After Pedro sacrificed himself in a suicidal explosion, Carrot was filled with sorrow and rage to where she took it out on Katakuri. Carrot particularly has a grudge against Perospero, as when Carrot saw that Perospero survived Pedro's suicide attack, she was shocked and furious to see that he resisted her friend's sacrifice, and when Perospero guided Big Mom to walk the sea surface, she remained angry at him. Carrot dealt a critical blow to Charlotte Daifuku when she transformed and disabled his ship to prevent him from chasing the Thousand Sunny."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Carrot possesses a strong will as she was able to withstand a burst of Big Mom's Haoshoku Haki."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a mink, Carrot is a natural-born fighter and can use Electro. As a ruler's aide, she possesses a large amount of stamina, which allows her to be active at all hours of the day. Upon noticing that Monkey D. Luffy was eating her carrot, an enraged Carrot quickly overwhelmed him before being calmed down; this prompted Pedro, an extremely strong mink warrior and captain of the Guardians to vouch for her usefulness in a fight."}, {"type": "paragraph", "text": "Carrot is immensely quick and agile, having effortlessly dodged a slash from Roronoa Zoro. She is also capable of flipping backward multiple times and attacking immediately afterwards. Carrot can levitate and jump in midair as well as jump extremely high. She is highly perceptive and has incredible reflexes, being able to notice Randolph's extremely quick ambush before Nami and Chopper did, and managing to pull them out of harm's way a split second before Randolph attacked them. Her immense speed is further shown when she instantly caught Diesel who is an extremely fast runner, despite him having a running start."}, {"type": "paragraph", "text": "Carrot is also physically very strong, as she is capable of carrying two large weights in her arms while still being able to run at the same time. She has incredible leg strength as she can topple a massive pot of boiling soup towards Brûlée with a kick. She is considerably durable, as she was able to sit back up after being stomped to the ground by Charlotte Katakuri, one of the Sweet Commanders of the Big Mom Pirates."}, {"type": "paragraph", "text": "Carrot is extremely skilled in hand to hand combat, using Electro enhanced clawed fist, bites, and kicks to defeat large numbers of enemies. While enhanced by her Sulong form, she was able to overpower Daifuku's entire fleet within a short period of time."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Carrot_Floats_Over_Zoro.png/revision/latest/scale-to-width-down/210?cb=20181110151256", "caption": "Carrot floats over Zoro's attack."}]}, {"title": "Sulong Form", "level": 4, "content": [{"type": "paragraph", "text": "As a member of the Mink Tribe, Carrot is able to awaken the Sulong (, Sūron, literally meaning \"Moon Lion\") transformation when looking at the full moon. In this form, Carrot's strength, speed, agility, Electro, and fighting abilities are magnified, allowing her to take out multiple members of the Big Mom Pirates in the blink of an eye, and rip out the helm of Charlotte Daifuku's ship. Her gliding abilities have also improved, as she was able to glide from the crow's nest of the Thousand Sunny to Daifuku's ship a great distance away. Using this form has a risk as it can cause severe exhaustion if used for too long. She can revert back to her normal form by blocking her eyes from moonlight."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c8/Carrot%27s_Sulong_Transformation.png/revision/latest/scale-to-width-down/210?cb=20171211211019", "caption": "Carrot transforms into her Sulong form."}]}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Eleclaw (エレ, Erekuro): Carrot uses Electro to charge up her fist with electricity and attacks her opponent by leaping onto them. It was first used to attack Charlotte Brûlée. Eleclaw is a portmanteu of the \"elec\" root several electricity-related words originates from in english and many other languages and \"claw\".", "elements": []}]}, {"type": "list", "elements": [{"text": "Electrical Luna (エレクトリカルルナ, Erekutorikaru Runa, literally meaning \"Electrical Moon\"): Carrot charges up a ball of electricity with both hands and slams it into the ground, causing a wide-range blast capable of electrocuting several foes at once. It was first used to defeat Randolph and several of Brûlée's underlings. At that time, the stew spilled on the floor acted as a conductor that enhanced the power of the attack.Luna means \"moon\" in Latin and is used in several other languages that derived from Latin.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Electrical_Luna.png/revision/latest/scale-to-width-down/210?cb=20171126024007", "caption": "Electrical Luna."}]}, {"title": "Artistic Skill", "level": 3, "content": [{"type": "paragraph", "text": "Carrot is skilled at drawing, but she has a tendency to draw people very effeminately. She is able to draw the faces of the Sanji Retrieval Team from memory. According to herself, she is also very good at drawing maps."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/17/Carrot%27s_Drawings.png/revision/latest/scale-to-width-down/210?cb=20180114134053", "caption": "Carrot presents her artwork."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Carrot wears two clawed gauntlets on her hands that resemble rabbit paws. They were given to her by Pedro when he believed that she could not handle a sword. They are strong enough to clash evenly with Zoro's swords and can have Electro channeled through them. When she encountered Luffy's group back when they first arrived on Zou, she wore a gauntlet only on her right hand."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Youth", "level": 4, "content": [{"type": "paragraph", "text": "At some point in her youth, Carrot joined the Inuarashi Musketeer Squad and was trained in swordsmanship by Shishilian. However, she apparently lacked talent with the weapon, which caused Pedro to interfere and give her a pair of gauntlets instead."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b3/Pedro_Gives_Carrot_Her_Gauntlets.png/revision/latest/scale-to-width-down/210?cb=20180819025333", "caption": "Pedro gives Carrot her gaunlets."}]}, {"title": "Jack's Invasion", "level": 4, "content": [{"type": "paragraph", "text": "When the Beasts Pirates, led by Jack, attacked Zou in search of Raizo, Carrot and the rest of the Inuarashi Musketeer Squad fought against them until 6:00 PM, at which point Inuarashi ordered them to retreat so Nekomamushi and the Guardians could take over the battle."}, {"type": "paragraph", "text": "The battle against the Beast Pirates lasted for five days. On the fifth day of the battle, Jack lost his patience and unleashed Caesar Clown's Koro gas, which left the Mink Tribe poisoned and drastically weakened. The following day, Jack left Zou after hearing about Donquixote Doflamingo's defeat and capture, and the minks were later saved when Sanji and his group came to Zou."}, {"type": "paragraph", "text": "After Capone Bege took Sanji and Caesar, Nekomamushi told Carrot and Wanda to keep quiet about the incident because that was what Nami and her friends wanted."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Inuarashi_Musketeer_Squad_Infobox.png/revision/latest/scale-to-width-down/210?cb=20161002185351", "caption": "Carrot and the Musketeer Squad arrive to battle Jack."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Carrot saw Roronoa Zoro, Franky, Usopp, Nico Robin, and Trafalgar D. Water Law enter the Mokomo Dukedom and, assuming that they had beaten the guard outside, rushed at them. Zoro attempted to attack her, but she evaded his strike before clashing with him. However, Wanda appeared and told Carrot to stop because they needed to deal with the intruder in the Whale Forest."}, {"type": "paragraph", "text": "Shocked by this news, Carrot jumped high into the air to survey the situation and informed Wanda of the ongoing scuffle in the forest before joining her atop Wany and heading to the source of the disturbance. En route, Carrot learned that she had just attacked members of the Straw Hat Pirates and noted that they were in for a shock. Shortly afterward, Carrot reached the Whale Forest with Wanda and calmed down Roddy, who was fighting with Monkey D. Luffy, by giving him a fluttering cloth to attack. As she, Wanda, and Luffy rode on Wany through Zunesha's self-washing deluge of seawater, Carrot explained how the twice-daily washing brought plenty of fish for the minks to eat before revealing that Bepo was under the care of Master Nekomamushi because he was a pirate as she bit on Luffy's ear. However, as they passed the crucifixes that Jack had used to torture some of the minks, Carrot quickly grew somber. After the other Straw Hats appeared, Carrot and the others arrived at Right Belly Fortress."}, {"type": "paragraph", "text": "Later, Carrot took part in a feast with the Straw Hats and several other minks, where she explained to Usopp that they refused to eat any meat from animals with fur. After the Straw Hats visited Inuarashi, Carrot and Wanda traveled with them to the Whale Forest to meet Nekomamushi."}, {"type": "paragraph", "text": "Once they arrived, Carrot and Wanda went with Luffy, Nami, and Pedro to see Pekoms, who was left behind by the Big Mom Pirates. Laughing at Luffy's proclamation that the Big Mom Pirates would become subordinate to him after he confronted Big Mom, Carrot was disturbed by Pekoms's explanation of what would happen if Sanji had refused Big Mom's invitation, only to become excited at the thought of helping Luffy interfere with Sanji's marriage ceremony, which prompted Wanda to reprimand her for taking it so lightly. Later, Carrot partied alongside the Straw Hats and other minks."}, {"type": "paragraph", "text": "The following day, as Bariete rang the bell and spoke of the arrival of samurais, Carrot and the rest of the minks rushed to Kurau City. When Kin'emon and Kanjuro revealed themselves, Carrot and the minks welcomed them and revealed that Raizo was on Zou before standing proudly at having kept his presence a secret. Kin'emon showed Carrot and the other minks the crest of the Kozuki Family on his back to confirm his allegiance. When Inuarashi and Nekomamushi reluctantly called a truce for the sake of Kozuki Momonosuke, whom they recognized as their lord, Carrot and the rest of the minks were overjoyed."}, {"type": "paragraph", "text": "After Inuarashi and Nekomamushi took Law, the Straw Hats, and the samurai to the Whale Tree, the minks discussed the day that the two rulers began hating each other, with Carrot noting that she had not even been born yet at the time. Happy that the two rulers finally made peace with each other, Carrot and the rest of the minks began to prepare a banquet to celebrate the occasion. However, when Inuarashi, Nekomamushi, the samurais, and the pirates returned from the Whale Tree with Raizo, Zou began shaking as Zunesha started crying out, throwing Carrot and the others into a state of panic. Jack had returned and was attempting to destroy Zou by killing Zunesha, who retaliated on Momonosuke's command and sank Jack's fleet with one blow, calming down Carrot and the others in the process."}, {"type": "paragraph", "text": "Wanting to go on an adventure, Carrot later went down to the Thousand Sunny in secret in order to join the Sanji retrieval mission, bribing Bariete with bananas not to tell anyone."}, {"type": "paragraph", "text": "Carrot later revealed herself to the Sanji Retrieval Team after they had sailed far away from Zou, to their great surprise. As Carrot greeted everyone on the ship, Pedro tried to have the ship turned around so she could return to Zou, but Carrot begged them to let her come along and promised not to cause any trouble for the group. Luffy allowed her to come along because she was already on board, but despite her gratitude, Carrot immediately attacked him upon noticing that he was eating one of her carrots, only calming down when Luffy patted her head at Nami's behest."}, {"type": "paragraph", "text": "Carrot and the rest of the Sanji Retrieval Team were surprised to learn of the Blackbeard Pirates' attack on the Revolutionary Army's headquarters on Baltigo. After the team passed through a storm, with Carrot mistaking lightning for Electro, Luffy presented his cooking, which Carrot and the group found to be completely inedible. Luffy then revealed that he had used up all of the food they had, leaving the team in a food shortage crisis."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Wanda_Takes_Luffy_to_Right_Belly_Fortress.png/revision/latest/scale-to-width-down/210?cb=20160626203409", "caption": "Carrot and Wanda take Luffy to the Right Belly Fortress."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Carrot_Excited_at_Luffy%27s_Plan.png/revision/latest/scale-to-width-down/210?cb=20161129124321", "caption": "Carrot expresses excitement at Luffy's plan to infiltrate Big Mom's territory."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Carrot_Joins_Sanji_Retrieval_Team.png/revision/latest/scale-to-width-down/210?cb=20170301191203", "caption": "Carrot unexpectedly joins the Sanji retrieval team."}]}, {"title": "Marine Rookie Arc", "level": 4, "content": [{"type": "paragraph", "text": "Hungry from the lack of food on their voyage, Carrot was excited when the team approached Fron Island, despite finding out it was home to a Marine base. She, Luffy, Nami, Chopper, and Brook infiltrated the island, knocked some Marines unconscious, and stole their clothes. They then plotted to sneak into a food warehouse, but Carrot and Luffy walked into a cafeteria in the main base instead. They feasted on the food served to them, and when Nami and Chopper caught up to them, Carrot greeted them loudly, much to their chagrin. When Luffy's identity was discovered and broadcast by Vice Admiral Prodi, he and Carrot were confronted by the Marines in the cafeteria."}, {"type": "paragraph", "text": "When Luffy noticed that he was surrounded by Marines, Carrot asked him what they should do, but Luffy couldn't care less about the Marines and instead replied that they should eat more, much to Carrot's surprise, but she joined Luffy anyway and ate more curry. After Luffy's brief scuffle with Grount and Bonham, Carrot and Luffy fled the cafeteria. Zappa stopped them in the hallway and, having taken a liking to Carrot, gave the rabbit mink a bouquet of carrots. Carrot then gave Zappa a garchu greeting, making him briefly faint from happiness. When Carrot and Luffy started running again, Zappa quickly got back on his feet and fought Luffy until he was subdued by Carrot's Electro. They then ran into Brook's soul form, which scared Carrot, and led them to the food storage house, defeating some Marine soldiers along the way."}, {"type": "paragraph", "text": "At the food storage house, Carrot and the group gathered as much food as they can carry, but they were once again confronted by Grount, Bonham, and Zappa. After Carrot hit Zappa with another Electro, Zappa declared his love for both Nami and Carrot. In response, Nami used Thunderbreed Tempo on him. After exiting the storehouse with the food, they watched Luffy battling Grount. After Grount was overpowered, Carrot and her group prepared to depart the island. However, before they reached the Thousand Sunny, they were confronted by Vice Admiral Prodi."}, {"type": "paragraph", "text": "The group tried to escape to the Submerge, but Prodi shot his bazooka at it before confronting them. The Sanji retrieval team dodged one of his bazooka blast, and Carrot and Nami attacked the Marines, but found that their electric attacks were unable to work against the Marines' rubber shields. However, they dispatched the Marines with physical attacks, and after Luffy defeated Prodi, Bonham, and Zappa, the team tried to escape to the still-intact Submerge. Luffy was confronted by Grount, and he told the group to go on ahead while he fought. Luffy eventually defeated Grount, and the group sailed away from Fron Island on the Thousand Sunny. However, the food they had stolen was eaten within 10 minutes."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/24/Straw_Hats_Eat_at_Fron_Island.png/revision/latest/scale-to-width-down/210?cb=20170319183415", "caption": "Carrot and Luffy sneak into a Marine base to eat."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d5/Carrot_Shocks_Zappa.png/revision/latest/scale-to-width-down/210?cb=20170327113604", "caption": "Carrot knocks out Zappa with Electro."}]}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "A few days later, Carrot and rest of the group were famished from the lack of food and overheated as they passed through boiling waters, but were saved from starvation when Luffy managed to catch a gigantic fish. After Luffy succumbed to food poisoning due to eating the fish's toxic skin, Carrot and the others enjoyed a meal prepared by Nami using Sanji's recipe. As they entered Big Mom's territory, the group was approached by a ship belonging to Germa 66."}, {"type": "paragraph", "text": "Upon seeing a hooded man aboard the ship, Carrot mistook him for Sanji until he revealed himself to be Sanji's younger brother, Vinsmoke Yonji, which Carrot was shocked at Nami deducing. As Luffy's condition worsened, Yonji refused to provide any aid and taunted the group to try to take the antidote by force, prompting Carrot to tearfully note that he was nowhere near as kind as Sanji was. When Sanji's older sister, Vinsmoke Reiju, appeared aboard the Thousand Sunny, Carrot angrily demanded to know who she was, only to watch in shock as Reiju sucked the poison out of Luffy's body, saving his life. With Carrot and Chopper overjoyed at Luffy's recovery, the Vinsmoke siblings and their men departed without reporting the Sanji Retrieval Team's presence."}, {"type": "paragraph", "text": "The group later docked at Cacao Island, an island close to Whole Cake Island, and Carrot and Nami changed into new outfits. When Carrot noticed people from different races living on the island, Pekoms explained Big Mom's dream of creating a nation where people from all races can live together. Seeing buildings made from chocolate, Carrot asked if the chocolate could be eaten, prompting Pekoms to reveal that it is illegal to consume the roofs because they protect residents against the precipitation the island receives. She and the rest of the Sanji Retrieval Team witnessed Luffy and Chopper getting into trouble for eating a café and subsequently being saved by the arrival of Charlotte Pudding, who came to their defense. After Pudding bailed out Luffy and Chopper, Carrot and the team accompanied her to her home, where she fed them."}, {"type": "paragraph", "text": "Carrot and the rest of the team discovered that Pudding was Sanji's betrothed, and Pudding told them how she met Sanji and became attracted to him, which caused Carrot to quickly warm up to her because of their shared admiration for him. After Pudding gave them a route to Whole Cake Island and promised to bring Sanji to them, the team left Pudding's home in a hurry when guards came for her. Upon returning to the Thousand Sunny, they discovered that Pekoms had gone missing and there was a message in the bathroom telling them to turn back."}, {"type": "paragraph", "text": "After leaving Cacao Island, Carrot and the rest of the team sailed through Pudding's route. Carrot and Chopper were excited when they approached the next island on the route, but Nami decided not to dock at it. After asking to help with lookout duty, Carrot saw a grape-colored part of the ocean, which prompted Pedro to reveal that there were juice rivers coming from the islands. Suddenly, a giant sea centipede attacked the ship, and Carrot began to battle it alongside Luffy, Pedro, and Brook."}, {"type": "paragraph", "text": "Later, Carrot and the team battled a swarm of giant ants as night fell, and consequently got stuck in a frozen sea of syrup. As they worked to melt the syrup, Luffy asked Pedro about his previous experience in Totto Land, which prompted Carrot to reveal that Pedro was once a pirate who sailed with Pekoms. Pedro explained his pirating history and how he met his defeat in Totto Land, which Carrot did not know about. The next morning, the team arrived at Whole Cake Island, which Carrot was excited to see."}, {"type": "paragraph", "text": "Pedro and Brook departed to find Big Mom's Road Poneglyph, and Carrot, Luffy, Nami, and Chopper went ashore to look for Sanji and Pudding. Carrot, Luffy, and Chopper saw what appeared to be Sanji leaning against a tree, but to their surprise he disappeared. They entered the Seducing Woods to look for Sanji, but were frequently distracted by the sweets making up their surroundings. They were nearly eaten by a talking crocodile, but it walked away when it saw that most of them were humans. Suddenly, Luffy confronted a reflection of himself, shocking Carrot, Nami, and Chopper. Carrot thought she saw Sanji lying on a tree branch, but this version of him disappeared as well, and everyone except Luffy chased after a fleeing figure. After running into a large man buried up to his head, they were suddenly attacked by a rabbit riding a bird, and as everyone was thrown into chaos, everything in the forest came to life to trap and kill the pirates."}, {"type": "paragraph", "text": "As Carrot, Chopper, and Nami ran, Randolph continued to pursue them. Carrot informed them that despite Randolph's appearance, he was not a mink. She then clashed with Randolph and used Electro against him, which he was unable to do, confirming her words. Carrot then knocked out the crane he was riding on. Randolph then leaped off the crane and hurled its spear at the pirates, who managed to dodge the projectile, which struck the buried large man instead. They went back to the two Luffys and the fake Luffy went with them while the real Luffy ran in the opposite direction. They tried to escape the Seducing Woods, but they kept running into the buried large man. The Sanji Retrieval Team got lost in the mirrored woods, and the Luffy accompanying them revealed herself to be the reflection, transforming back into her true form, Charlotte Brûlée. She then grabbed Nami and prepared to slice her and Carrot's faces."}, {"type": "paragraph", "text": "After Nami used her Clima-Tact to escape Brûlée's grasp, Carrot attempted to attack Brûlée using her \"Eleclaw\" technique, but Brûlée used her Devil Fruit power to reflect Carrot's attack back at her. Carrot tried to attack again, but Brûlée used her ability to trap Carrot into the Mirro-World. Sometime later, Carrot was joined by Chopper. When Brûlée arrived at the scene where Charlotte Cracker was confronting Luffy and Nami, she smashed the mirror that Carrot and Chopper were trapped in. However, the two prisoners remained unharmed."}, {"type": "paragraph", "text": "Inside the Mirro-World, a shackled Chopper told Carrot, also shackled, that he had a plan, and so she should call him \"Brother Chopper\". Carrot referred to him as \"Choniki\" and asked what the plan was. Chopper explained his realization that the Mirro-World is connected to every mirror on Whole Cake Island. Thus, instead of trying to escape, they should use Brûlée's power against her."}, {"type": "paragraph", "text": "Eleven hours later, Carrot and Chopper were running from Brûlée inside the Mirro-World, but began to grow tired. As they ran, Carrot and Chopper contacted Nami through a mirror shard and told her not to worry. However, their conversation ended abruptly."}, {"type": "paragraph", "text": "Eventually, Brûlée caught them, but Carrot and Chopper managed to acquire a frog that Brûlée had turned into a body double of Carrot with her powers. They tricked Brûlée into believing that the frog was Carrot, and Carrot followed them back to Brûlée's house, hiding in the attic and making cries of distress to continue the act. As Brûlée and her entourage prepared to lower the frog into a giant pot of boiling soup, Carrot threw a rock at Randolph before he could drop the frog into the pot. In the confusion, she then jumped down and kicked the pot at Brûlée, dousing her in the boiling soup and defeating her. Randolph and his comrades raced to help Brûlée, but Carrot cleverly used Electro on the soup, electrocuting all of them. Diesel ran away to report the incident to Big Mom, but Carrot chased him down and put her hands over his eyes, causing him to crash. Carrot and Chopper then celebrated their victory and prepared to use the mirror world to visit their allies."}, {"type": "paragraph", "text": "With Brûlée as their prisoner, Carrot and Chopper raced through the Mirro-World using Diesel to find Luffy and the others. Carrot managed to revive Brûlée by tickling her, and Brûlée revealed that the mirrors could talk to them. Carrot and Chopper asked the mirrors about their teammates, but the mirrors did not know what they looked like, so Carrot prepared to draw portraits of them. Carrot and Chopper located Pedro and made a plan for him to end his battle with Tamago. As Pedro blew up a large amount of explosives inside his jacket, Carrot and Chopper pulled him into the Mirro-World. As they continued traveling in the Mirro-World, Carrot and Chopper were informed of Luffy and Nami's capture but were later told by the mirrors that Nami was with Jinbe. They located Nami and Jinbe and helped them escaped their pursuers by pulling them into the Mirro-World. With Nami and Jinbe in the group, the team went on searching for Luffy, Brook, and Sanji."}, {"type": "paragraph", "text": "Carrot's group located Brook inside Big Mom's bedroom, being held in her hands as she slept. Brûlée tried to alert her mother, causing the team to bind and gag her and Diesel. Upon witnessing Big Mom and her three homies attacking a fly, the team became terrified, wondering how they were supposed to save Brook. The team then made a skeletal lookalike for Brook, which they planned to use to make a stand-in for the real Brook. After Chopper's unsuccessful attempt to retrieve Brook, Carrot tried next, quietly landing on Big Mom before whispering to Brook to wake up. However, she was forced to flee from a sleep bubble coming from Big Mom's nose, and Zeus spotted her. Thinking she was the fly, Zeus shot a lightning bolt at Carrot. After Jinbe and Nami rescued Brook from Big Mom's clutches, the team was surprised to see that Brook successfully copied the poneglyphs and hid the copies inside his skull. The team then celebrated Brook's accomplishment."}, {"type": "paragraph", "text": "The group searched for Sanji and Luffy, but none of the mirrors saw them inside the castle. Nami then theorized where Sanji and Luffy may be at and Carrot was surprised to hear that the two had a fight. Carrot's group later contacted Luffy and Sanji through a mirror shard and were surprised when Luffy decided to ruin the wedding ceremony. Carrot then listened as Jinbe explained more about the situation they were in, about Bege, his backstory, his plot against Big Mom and his suggestion to form an alliance. After Luffy agreed to meet with the Fire Tank Pirates to form an alliance to take down Big Mom, Carrot and her group arrived at Bege's hideout before Luffy and Sanji. After taking a bath with Nami, she accompanied her team inside the meeting room where a argument broke out among Luffy, Caesar, and Bege until Jinbe settled it. As Bege explained his plan to kill Big Mom, Carrot listened attentively. The meeting adjourned once Bege finished going over the plan."}, {"type": "paragraph", "text": "Bege transported the alliance members to the wedding inside his body. Before Bege walked into the wedding venue, Carrot was shown sleeping. After the wedding ceremony began, the team initially encountered a small problem when Jinbe had difficulty waking Luffy up. After they woke Luffy with meat, the team went into the Mirro-World and prepared to charge into the venue. Once they heard the signal, the team unleashed duplicates of Luffy into the venue, causing chaos at the ceremony. After releasing all the duplicates, the team charged in. Carrot, Nami, and Chopper then hid inside the ruined wedding cake, waiting for the photo of Mother Carmel to be destroyed. They then watched in amazement as Jinbe without fear officially declared to Big Mom his intention to leave the Big Mom Pirates in order to join the Straw Hat Pirates and that Luffy would become the Pirate King. Three seconds after Brook destroyed Carmel's portrait, Carrot, Nami, and Chopper were confused as to why Big Mom did not already start screaming. However, they were later told by Bege to put on their earplugs as he initiated his assassination operation."}, {"type": "paragraph", "text": "Once Luffy caused Big Mom to start her strange scream, Carrot's group came out of hiding and assisted Sanji in rescuing the Vinsmoke Family. Carrot then watched as Bege, Vito, and Gotti fired their KX Launchers at Big Mom. However, Big Mom's scream detonated the rockets before they could reach her. With the assassination attempt a failure, Caesar flew into the venue with the escape mirror and Bege signaled the alliance members to retreat. Before they could escape into the mirror, Big Mom's scream shattered it, leaving them trapped in the venue. After Bege transformed into Big Father, he instructed the alliance to retreat inside. Before she could do so, Carrot watched as Nami was caught by Smoothie, before being restrained herself by Daifuku's genie. However, she was released after Yonji attacked the genie. Carrot then retreated successfully into Bege's fortress, along with the rest of the alliance. However, they found themselves in a dire situation as Big Mom began attacking the fortress."}, {"type": "paragraph", "text": "As Bege's fortress continued to suffer damage from Big Mom's attacks, Luffy attempted to fight back only to be reminded they have achieved their goals. Carrot then listened to Bege as he came up with a plan to escape with Caesar's help, and also when Sanji demanded his father to never appear before him and his friends ever again. Just when the Big Mom Pirates routed the Straw Hats, the Fire Tanks, and the Vinsmokes, the Tamatebako dropped to the base of the Whole Cake Chateau and exploded, causing the castle to topple over. As the castle collapsed, Carrot's group, Bege's crew, and the Vinsmoke Family got away. Carrot's group and the Fire Tank Pirates rendezvous at the northwest part of Whole Cake Island, where Bege decided to part ways with the Straw Hats."}, {"type": "paragraph", "text": "After Brook and Chopper separated from the group to retrieve the Shark Submerge III, the rest head for the Thousand Sunny. As they approached the Seducing Woods, they ran into Kingbaum. Nami then used part of Big Mom's Vivre Card to control Kingbaum and forced him to transport the fleeing team. However, before they reached the Seducing Woods, a crazed Big Mom (while riding on Zeus) caught up to them. Using Napoleon in its sword form, Big Mom unleashed an air slash that cut off a part of Kingbaum. As Big Mom prepared to attack again, Nami diverted Zeus' attention by using thunderclouds, causing the cloud homie to veer off-course and drop Big Mom. When Carrot and her group reached the Seducing Woods, Big Mom ordered the tree homies to stop the Straw Hats, but Kingbaum charged through them. Carrot and her group were later forced to jump off Kingbaum when Prometheus attacked and burned Kingbaum for his betrayal."}, {"type": "paragraph", "text": "As the Sanji Retrieval Team continued with their escape, Big Mom resumed her pursuit. Thanks to Big Mom's presence, the Vivre Card in Nami's possession was rendered useless, and the Seducing Woods homies went to work attacking the Straw Hats and changing the landscape to confuse them. Several Big Mom Pirates caught up to their captain and clashed with the Sanji Retrieval Team. Along the way, Luffy stopped Carrot from separating from the group. The team pulled out of the conflict quickly, knowing they could not split up there. When Zeus ate one of Nami's weather eggs and grew massively and became stormy, Nami took the opportunity to summon a massive lightning bolt that struck the Big Mom Pirates pursuing them."}, {"type": "paragraph", "text": "Nami's attack left Big Mom laying at the bottom of a crater. To the Straw Hats' shock, Big Mom was barely affected and continued to move. She ate through the ground as she moved back up, and the team started running again. They were then approached by Pudding and Chiffon. After Chiffon requested Sanji's help in making a cake for Big Mom, Sanji readily agreed to assist them. Big Mom then got back on her feet and unleashed another devastating air slash, and the two groups parted ways with Sanji heading to Cacao Island with Pudding and Chiffon while Carrot and her group continued fleeing to the Thousand Sunny. Pudding used her Devil Fruit powers to send memories flooding into the souls in the homies, allowing the Straw Hats to make it to the coast without trouble."}, {"type": "paragraph", "text": "They ran toward the Sunny, and came into conflict with Perospero and Katakuri, who were already on board. Pedro told Carrot not to be flustered by these events, as he believed that the Straw Hats would bring about the dawn of the world. After Perospero trapped the Sunny in candy, Carrot watched in shock as Pedro attempted to take out Perospero with a massive suicidal explosion. Carrot then cried out and was about to go to the coast to get Pedro. Nami stopped her from leaving the ship, saying that they could not afford to waste the chance that Pedro provided them. Carrot then tried to attack Katakuri, but the Sweet Commander easily subdued her. After Luffy grabbed Katakuri and dragged him into the Mirro-World, Carrot and her group on the Thousand Sunny successfully escaped Whole Cake Island with a Coup de Burst."}, {"type": "paragraph", "text": "As the team mourned Pedro's self sacrifice and lamented on their inability to save him, Jinbe encouraged them to press on and keep their guard up. As the team was spurred into action, Carrot jumped up to the crow's nest and saw not only the Big Mom Pirates' fleet heading toward them, but Big Mom herself, who was walking on water using Perospero's candy road. Upon seeing Perospero standing on top of Big Mom, Carrot gazed at him with a furious expression."}, {"type": "paragraph", "text": "While under siege by the Big Mom Pirates, Carrot informed Nami of another predicament, which was Big Mom creating a massive wave homie to engulf the Thousand Sunny. As the wave homie got closer, Carrot apologized to Pedro how she and her friends would not be able to escape even after his sacrifice, but thanks to Jinbe's skills as a helmsman, the team managed to come out of that situation unharmed. They then contacted Luffy through a mirror shard and told him to find a mirror connecting to Cacao Island so they could meet him there."}, {"type": "paragraph", "text": "On the way to Cacao Island, the group on the Sunny was puzzled when they saw no pursuers. Carrot and Chopper kept a vigilant lookout. As they were getting near Cacao Island, Carrot noted that a full moon was coming."}, {"type": "paragraph", "text": "The group on the Sunny was later surprised to find themselves once again pursued by Big Mom and a fleet of Tarteships. They were initially able to hold their own, but they later discovered another fleet of Tarteships led by Charlotte Daifuku in front of them. As they were about to be surrounded by the Big Mom Pirates, they thought about a counterattack. Carrot told the rest of the team to leave this to her, and she activated her Sulong form by the power of the full moon. She swooped down and glided toward Daifuku's ship, where she rapidly attacked several Big Mom Pirates who could not keep up with her movements. She then went to the helm and destroyed it, preventing Daifuku's crew from piloting it. Enraged at Carrot's actions, Daifuku summoned a genie to attack Carrot. Carrot dodged the genie's strikes, causing it to damage the ships in Daifuku's fleet instead. Carrot continued her attack by destroying the helms of the other ships. Just when she was feeling fatigued from using the Sulong form, Brook arrived and grabbed her. Carrot then blocked her eyes from the moonlight and returned to her original form as Brook carried her back to the Thousand Sunny. Carrot rested inside the Sunny as the rest of the team fought against Big Mom."}, {"type": "paragraph", "text": "As the Sunny was pursued by Smoothie's fleet after the Fire Tank Pirates lured Big Mom away, Carrot recovered from her exhaustion. She then asked the rest of the Sunny group if Luffy had won his battle. As the promised rendezvous time drew near, Nami pointed out that Luffy needed Brûlée in order to leave the Mirro-World, causing the group to become concerned, given Luffy's absent-mindedness. With a few minutes remaining, Cacao Island was in sight."}, {"type": "paragraph", "text": "As the Sunny group sailed past the port of Cacao Island, they were overjoyed to see Sanji and Luffy coming towards them. Luffy and Sanji returned to the Sunny and the group quickly made their retreat from Cacao Island. The group was then besieged by Smoothie's fleet, but Judge came to their rescue. After the Sunny passed by Judge's castle, the group later saw enemy ships approaching them from the front and Daifuku tried to attack Carrot with his genie, but Sanji blocked it. When the situation grew more dire, they were surprised when Wadatsumi appeared and attacked the enemy."}, {"type": "paragraph", "text": "The Sun Pirates cleared a path for the Sunny. However, despite their efforts, the Sunny was intercepted and attacked by the Queen Mama Chanter. Wadatsumi saved the Sunny by switching it with the Sun Pirates' ship and hid the Sunny in his mouth. Wadatsumi tried swimming away, but Oven attacked him with heat waves, forcing him to spit out the Sunny. As the Sun Pirates held back the Big Mom Pirates, Jinbe decided to stay behind to help them and Luffy consented to his decision. After Jinbe joined his former crew in battle, the Sunny group sailed far away from Cacao Island."}, {"type": "paragraph", "text": "After escaping from Totto Land, Sanji learned about Pedro's self sacrifice and expressed some regrets. Carrot tried to cheer Sanji up but ended up crying, prompting Sanji to comfort her. Later, the group on the Sunny happily waited for Sanji's cooking."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Sanji_retrieval_team_goes_to_Pudding%27s_home.png/revision/latest/scale-to-width-down/210?cb=20170430181036", "caption": "The Sanji Retrieval Team as guests in Pudding's home."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c5/Sanji_Retrieval_Team_Battles_a_Centipede.png/revision/latest/scale-to-width-down/210?cb=20160620215707", "caption": "The Sanji Retrieval Team battles a centipede at sea."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Carrot_Attacks_Randolph.png/revision/latest/scale-to-width-down/210?cb=20170611020623", "caption": "Carrot clashes with Randolph."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0c/Br%C3%BBl%C3%A9e_traps_Carrot.png/revision/latest/scale-to-width-down/210?cb=20171117162455", "caption": "Carrot trapped within Brûlée's mirror."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d0/Carrot_Defeats_Br%C3%BBl%C3%A9e.png/revision/latest/scale-to-width-down/210?cb=20171119162951", "caption": "Carrot kicks a pot of soup at Brûlée, defeating her."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/Chopper_and_Carrot_Traverse_the_Mirro-World.png/revision/latest/scale-to-width-down/210?cb=20171203033254", "caption": "Carrot and Chopper look for their teammates in Mirro-World."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Straw_Hat_Pirates_Meet_Fire_Tank_Pirates.png/revision/latest/scale-to-width-down/210?cb=20180304023006", "caption": "The Sanji Retrieval Team forms an alliance with the Fire Tank Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/Nami_and_Carrot_Defend_the_Vinsmokes.png/revision/latest/scale-to-width-down/210?cb=20180506042309", "caption": "Carrot and Nami help Sanji rescue his family."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/22/Straw_Hats_Clash_in_the_Seducing_Woods.png/revision/latest/scale-to-width-down/210?cb=20170821042718", "caption": "The Sanji Retrieval Team clashes with the Big Mom Pirates while escaping."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Katakuri_Subdues_Carrot.png/revision/latest/scale-to-width-down/210?cb=20180822045619", "caption": "Carrot is subdued by Katakuri."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7b/The_Sanji_Retrieval_Team_Plan_to_Meet_at_Cacao_Island.png/revision/latest/scale-to-width-down/210?cb=20180923023004", "caption": "The Sanji Retrieval Team plan their next move."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/97/Carrot_Attacks_Daifuku%27s_Fleet.png/revision/latest/scale-to-width-down/210?cb=20181118035347", "caption": "Carrot activates her Sulong form and attacks the Big Mom Pirates."}]}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Carrot received a new newspaper and showed it to the group. They looked at the new bounty posters for Sanji and Luffy and the group was shocked to learn that Luffy's bounty increased to 1,500,000,000."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Thousand Sunny continued towards Wano Country, the group was informed of the Levely through a newspaper. They later encountered an unusual weather disturbance in their direction, followed by an octopus on their ship as well as a school of huge carp on their side. After a bumpy ride across a river, the ship climbed up a waterfall. Once they reached the top, they came across a whirlpool. Sanji carried Nami, Chopper, Carrot, and Brook away from the ship, but Luffy got dragged into the whirlpool along with the Sunny."}, {"type": "paragraph", "text": "After Luffy got separated, the group searched for him, but they only found his Vivre Card. They later got in touch with Kin'emon and they reunited with Luffy at the ruins of Oden Castle. With Law, Momonosuke, and Kiku also present, Kin'emon explained how he and his group traveled through time to escape Orochi's attack twenty years ago. Carrot then listened as Kin'emon explained more about the past such as the story of Oden, the time of his execution, the rumor about Toki, and what Kin'emon's group did right after arriving at present time. Kin'emon then went over a plan to attack Onigashima, the island where Kaido resided, in two weeks."}, {"type": "paragraph", "text": "Kin'emon explained more about the Fire Festival and how the decisive battle would play out. He then gave the group specific tasks to do. He asked Carrot and Chopper to go with Kiku to Inuarashi's current location. After giving the group new clothes, he introduced them to Shinobu. When Kaido arrived at Kuri, Law alerted the group. The group was surprised to see Kaido and they learned that Luffy, Zoro, and Law were already exposed. Luffy rushed off to protect Okobore Town and Law chased after him and told the rest to remain unseen. After Kin'emon and Kiku left to rescue Tsuru, the rest at Oden Castle noticed Kaido coming to their direction and tried to flee as Kaido destroyed the castle with a fire breath. Sanji carried Carrot and Nami away while Shinobu saved the rest by using her Devil Fruit power to sink them into the ground. Kiku then returned and told them what happened to Luffy."}, {"type": "paragraph", "text": "At Mt. Atamayama, Carrot witnessed Ashura Doji's clash with Inuarashi. After Kin'emon broke up the fight, Carrot was amazed that Ashura was an even match for Inuarashi. Sometime later, Carrot and the Musketeers stole food and weapons from the Beasts Pirates and left a note saying that Ashura and his gang were responsible for the thefts."}, {"type": "paragraph", "text": "At an abandoned village in Kuri, Carrot panicked after hearing that the Beasts Pirates found out about Kin'emon's secret message."}, {"type": "paragraph", "text": "Prior to the raid on Onigashima, Carrot, Wanda, and Shishilian were later at the place where graves for Pedro and Yasuie were placed. In Amigasa Village, Carrot marveled at the new armor Luffy, Brook, and Chopper received. After Robin stated that Onigashima's entrance is in winter, Carrot explained to the group that the seasons are not consistent in Wano and cold climate would give the minks an advantage."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mink Tribe and Heart Pirates vs. Beasts Pirates", "elements": []}, {"text": "Carrot vs. Roronoa Zoro", "elements": []}, {"text": "Carrot vs. Randolph", "elements": []}, {"text": "Carrot vs. Charlotte Brûlée", "elements": []}, {"text": "Carrot and Tony Tony Chopper vs. Brûlée, Randolph, Diesel, Noble Croc, and Brûlée's twelve other henchmen", "elements": []}, {"text": "Sanji Retrieval Team vs. Big Mom Pirates", "elements": [{"text": "Carrot vs. Tablet", "elements": []}, {"text": "Carrot vs. Charlotte Katakuri", "elements": []}, {"text": "Carrot vs. Charlotte Daifuku's ship crew", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Carrot, Wanda, and Straw Hat Pirates (except Sanji) vs. Sutchies", "elements": []}, {"text": "Carrot and Luffy vs. Marine troops", "elements": []}, {"text": "Carrot and Nami vs. Zappa", "elements": []}, {"text": "Carrot, Nami, and Chopper vs. Vice Admiral Prodi's troops", "elements": []}, {"text": "Sanji Retrieval Team vs. Ants", "elements": []}, {"text": "Carrot and Chopper vs. Brûlée and Randolph (Mirro-World)", "elements": []}, {"text": "Carrot vs. Diesel", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "During the escape from Whole Cake Island in the anime, Carrot defeated Tablet in the Seducing Woods. In the manga, the entire pursuit squad was defeated by Nami using Zeus' thunderbolt."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "The nickname that Carrot had given to Chopper \"Choniki\" (a combination of the words Chopper and brother) has been translated as \"Chobro\" in the English version.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece: Pirate Warriors 4", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Carrot's favorite food being the vegetable she's named after follows a popular misconception about rabbits, most famously depicted with Bugs Bunny. In real life, carrots can actually make rabbits sick. They normally eat leafy vegetables such as cabbage, kale, or just grass.", "elements": [{"text": "Additionally, she's also shown to love chocolate, which is just as bad, or if not worse for rabbits in real life.", "elements": []}]}, {"text": "Despite being a member of Inuarashi's Musketeers, Carrot wears a green cape which is a signature item of Nekomamushi's Guardians.", "elements": [{"text": "This is probably due to her training under Pedro, a Guardian, rather than Shishilian, a Musketeer.", "elements": []}]}, {"text": "Carrot was ranked 26th place in the sixth popularity poll, making her the most popular member of the Mink Tribe.", "elements": []}]}], "images": []}]}