{"sections": [{"title": "Mozu and Kiwi", "level": 1, "content": [{"type": "paragraph", "text": "Mozu and Kiwi, also known as the Square Sisters due to their square-like hairstyle, are two girls very loyal to Franky, who went with him everywhere and tend to mimic every pose he does."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Although they are not twins, Mozu and Kiwi are identical in all but hair (Mozu's not as curly as Kiwi's) and eye color (Mozu has a brownish hue while Kiwi's is green). They both have long, pointed noses and get their nickname from having a unique hairstyle shaped in large squares. When they were younger, they wore their hair in afros."}, {"type": "paragraph", "text": "Mozu is the sister with straight-edged hair, a white fur collar, yellow goggles, bikini-top, slacks, and high-heels."}, {"type": "paragraph", "text": "Kiwi is the sister with curly-edged hair, a lilac pearl necklace, pink cropped top, pink bikini-bottom, gloves, and high-heels."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "They have a tendency to mimic Franky's reactions. They often walk sideways in high winds, due to the fact that otherwise their hairstyles would cause them to be blown back. They both also have a tendency to add \"Waina\" to all their sentences, which they have done ever since they were young. They also seem to have a strange habit of doing odd poses when in the background, and generally act like Franky's back up singers, even if he isn't singing."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During battles, they fight with katana swords with square-shaped tsubas. They are accomplished swordswomen, quick with a blade, and skilled enough to take on foes such as the Just Eleven Jurymen and win. However, they are not powerful enough to subdue stronger fighters like Franky and Kalifa."}], "images": []}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Sentei Kaitai Giri (船底解体斬り, Sentei Kaitai Giri \"Ship's Bottom Dismantling Cut\"): Kiwi and Mozu run on either side of their target and coordinate their strikes to make symmetrical cuts along said target. It was seen used on Kashi's left shoe. This is called Hull Dismantler Slash in the Viz manga.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "The earliest appearance of the two girls was when they were seen, at a young age, riding the Puffing Tom on its opening day. They were inspired by this event and tried to be shipwrights, however, they failed the Galley-La company tests and began drinking heavily. They were then found by Franky and started working for him after he encouraged them to stop drinking."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mozu and Kiwi were first shown accompanying Franky, who had just returned home from spending the Straw Hat's money shopping, only to find it destroyed. When Franky decided to seek revenge, the two sisters went with him. Once they found Luffy, Franky engaged him in combat and, later on, the Galley-La workers entered the fight as well. During the whole time, Mozu and Kiwi were seen cheering for their \"big brother\"."}, {"type": "paragraph", "text": "Afterwards, the three entered Blueno's bar, where they had a brief talk with Kokoro. When Usopp was captured and taken to their secret hideout, Mozu and Kiwi remained there with him and Franky and also cried with Franky when they heard Usopp's sad story of him leaving the Straw Hat Pirates."}, {"type": "paragraph", "text": "Later, when the CP9 agents invade their hideout, Mozu and Kiwi got knocked down and out by Kalifa for not letting them in. Later when the Straw Hats decided to chase after the sea train, Puffing Tom, using the Rocketman, Mozu and Kiwi along with the rest of the Franky family, joined them using their gigantic King Bulls, Sodom and Gomorrah, in order to save their boss."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Upon arriving at Enies Lobby, The Franky Family along with the Straw Hats and the Galley-La workers lay down their plan of attack. Franky family are supposed to move in and open the main gate. When they reach the main gate, they are faced against the two giants who guard it, Oimo and Kashi."}, {"type": "paragraph", "text": "After a fierce combat, and with the aid of Galley-La, they manage to bring the giants down, open the gate and lead the way for the upcoming Straw Hat pirates. The team, riding the giant King Bulls, advances towards the inner section of the island defeating foe after foe, until they reach the courthouse. There, they split in two groups in order to lower the bridge to the tower of justice. Each sister takes the lead of their respective team and advance, facing various enemies and traveling up the towers."}, {"type": "paragraph", "text": "Out of nowhere, a few members of the Just Eleven Jurymen attack the twins and their cohorts and engage in a battle. After some struggle and the help of Tilestone and Peepley Lulu, the groups manage to overcome the Jurymen and proceed onward. When the two teams reach the switches and finally start lowering the bridge, the defenses fire a barrage of cannonballs causing the mechanism to malfunction and prevent the bridge from lowering all the way. Eventually, both Mozu and Kiwi, as well as all the other raiders get captured and tied."}, {"type": "paragraph", "text": "When they, finally, manage to escape their bonds with the help of Paulie, they were shown shocked to hear the news about the upcoming Buster Call on Enies Lobby. As the Warships arrive, the Franky Family are desperately trying to escape the island before its destruction begins, hoping that their boss will make it out safe somehow too. Upon reaching the coast, the Franky family come across the warship led by Vice Admiral Strawberry, who orders his men to attack the criminals. The team gets bombed and thrown off a cliff but are all saved at the last minute by Paulie's ropes. When the Straw Hat pirates draw the attention of the marines, the sisters follow their team aboard the sea train, thus escaping the burning island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/34/Kiwi%2C_Tilestone%2C_and_Franky_Family_Defeat_Jurymen.png/revision/latest/scale-to-width-down/210?cb=20130928000247", "caption": "Kiwi, Tilestone, and the Franky Family defeat the Just Eleven Jurymen."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/29/Mozu_and_Kiwi.png/revision/latest/scale-to-width-down/210?cb=20150714060240", "caption": "Mozu and Kiwi fighting at Enies Lobby."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Mozu%2C_Lulu%2C_and_Franky_Family_Defeat_Jurymen.png/revision/latest/scale-to-width-down/210?cb=20130928000549", "caption": "Mozu, Lulu, and the Franky Family defeat one of the Just Eleven Jurymen."}]}, {"title": "Post Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "They appeared again in the Post Enies Lobby arc, where they accompanied Franky to visit the Straw Hats to inform them of their leader's decision to build them a new ship. They then bore witness to the sudden appearance of Vice-Admiral Garp whom they were shocked to learn is Luffy's grandfather and became even more surprised to learn that Luffy's father was Revolutionary Dragon. They are shocked again, to learn that Franky now has a bounty and feared for what will happen if he stayed in Water 7 since everyone knew of him. Later on the two see Franky off, and were horrified when Nico Robin attempted to force him to join by squeezing his testicles, claiming that they would fall off like a piece of fruit from a tree."}, {"type": "paragraph", "text": "After the Straw Hats' departure, the sisters, along with the other members of the Franky Family, were offered jobs by Iceburg, whom they started calling their new \"Big Bro\" as thanks, much to his annoyance."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip they have become bartenders in Water 7 and are seen serving Lola and the Risky Brothers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Rolling_Pirates_Post_Timeskip.png/revision/latest/scale-to-width-down/130?cb=20130422132819", "caption": "Mozu and Kiwi serving the Rolling Pirates."}]}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Franky's new wanted poster reached Water 7, Mozu and Kiwi smiled while looking at it with Iceburg."}], "images": []}, {"title": "Cameos and Crossovers", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Square Sisters appeared as one unit in the game Jump Ultimate Stars for the DS. Though not playable, their character evolution allows a version of Franky to become playable.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Jump Ultimate Stars", "elements": []}, {"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Concept artwork from Color Walk 4 shows that Kiwi's hair was originally spiky and Mozu's hair was wavy, before Oda decided to turn their hair style into a square shape.", "elements": []}, {"text": "Kiwi is named after the Kiwi bird, while Mozu is named after the Bull-headed Shrike, or in Japanese, Mozu. This is part of a long-standing tradition from Oda to name female characters after birds.", "elements": []}, {"text": "In the 4th Japanese Fan Poll, Mozu and Kiwi are both ranked as the 122nd most popular characters.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Water7oharaconcepts.png/revision/latest/scale-to-width-down/130?cb=20120123112909", "caption": "(upper left corner) Mozu and Kiwi to Franky's side"}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 35 Chapter 329 and Episode 233, Mozu and Kiwi make their debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 35 Chapter 334 (p. 14-15) and Episode 237, Mozu and Kiwi are introduced.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0384 & 0385), Information about Mozu and Kiwi is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 49,179), Kiwi's and Mozu's birthdays are given.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 38 (p. 146), Fan Question: Are those girls in the Sea Express in Volume 37 Mozu and Kiwi?!", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 437 and Episode 322, Franky finds Mozu and Kiwi in a small flashback.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 66 Chapter 654, cover story: From the Decks of the World Vol. 36, Mozu and Kiwi are seen after the timeskip.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 81 Chapter 816, cover story: From the Decks of the World: The 500,000,000 Man Arc Vol. 10.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 39 (p. 86), Oda explains that Mozu and Kiwi are named after birds.", "elements": []}]}], "images": []}]}