{"sections": [{"title": "Joke", "level": 1, "content": [{"type": "paragraph", "text": "Captain Joke was the captain of a crew that reached the Ocean's Naval ten years before the current storyline. Due to his actions, he is considered the main antagonist of the first special episode."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Joke was a large man with a beard before being killed. After his revival, he was a skeleton, with bright red pupils. Although he was a skeleton, he still retained his black beard, similar to how Brook still has his afro. He wore a bandana with colorful designs on it, and a red coat with the left sleeve torn off and part of the chest torn off. His coat has large red shoulder pads and long frills tied up at the ends."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Joke, when he was first introduced, was very greedy and desired only treasure. However, his crew mutinied and killed him. He was also quite deceptive, as he tricked the Straw Hats to defeat the Beasts of God and return his limbs to him when he was in his bat form. Though he was like a bad person, he admitted when he was defeated that the only thing he really wanted was a kind, trustworthy crew like the Straw Hat Pirates."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Joke trusted his crew but this resulted to his death since his crew eventually betrayed him and killed him. During his life as a skeleton, he hated his crew and he was proud of being alive while they were dead. When Joke was about to die, he admitted he always wanted friends that he could trust."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Joke_Vs_Crew.png/revision/latest/scale-to-width-down/210?cb=20130604015420", "caption": "Joke's crew betrays him."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Joke seemed to have the ability to project mental images into the minds of others, as shown when he made Hamu witness the death of his mother at Joke's hand."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Joke wielded a revolver with a gatling gun-like barrel that can fire multiple rounds at once. The bullets explode on impact similar to Usopp's Kayaku Boshi."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Joke was a pirate captain who was after a treasure that allowed the holder to wish for anything they wanted. However, as he closed in on the treasure, his crew mutinied and viciously stabbed him in the back several times. However, for some reason he was turned into a bat and stayed in his body's remains, where he waited for ten years."}], "images": []}, {"title": "Ocean's Navel", "level": 3, "content": [{"type": "paragraph", "text": "After this time, the Straw Hat Pirates came along and unknowingly killed all the monsters holding Joke's other bones as he guides them to the treasure. The bones were then returned to his body upon their defeat, allowing him to be revived and continue to look for the treasure. He was stopped by Hamu, the son of a chief elder that Joke killed. The Straw Hats (Luffy, Nami and Usopp) held him down to keep him from shooting Hamu with his multi-barrel pistol, allowing Hamu to deliver the finishing blow."}, {"type": "paragraph", "text": "As Joke crumbled to dust, he commented that he wishes he had a crew like them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Hamu_Vs_Joke.png/revision/latest/scale-to-width-down/210?cb=20130604020832", "caption": "Hamu killing Joke with the help of his friends."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Captain Joke vs. His own crew", "elements": []}, {"text": "Captain Joke vs. Hamu and the Straw Hat Pirates", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Joke was the first character to be revived from the death and become a skeleton, with the second being Brook. While Brook was revived with a Devil Fruit, it is unexplained how Joke was revived, though it may have to do with a curse in the Ocean's Navel.", "elements": []}, {"text": "Joke is voiced by Akio Ōtsuka, who would later do the role of Marshall D. Teach and Baron Omatsuri.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Anime — Episode Special 1.", "elements": []}]}], "images": []}]}