{"sections": [{"title": "Delacuaji", "level": 1, "content": [{"type": "paragraph", "text": "Delacuaji is an infamous New World pirate captain who allied with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Delacuaji is a round and large man with an unusual body shape, mostly hidden by the chartreuse robe he wears, which has ruffled edges on the arms and seems to cover most of his upper body, even his head, leaving only his face and hands visible. He has a round face with dark colored lips and concentric circles around his eyes, a black goatee on his chin, and teeth quite spaced out one from another, similarly to Bluejam's. His attire also includes a light blue scarf held up by a clasp made up of three linked jewels, an indument that looks like a brown vest, and a pirate captain's hat matching his robe, with a little skull represented on it. He carries around a saber."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Delacuaji_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20190420141834", "caption": "Delacuaji's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Delacuaji's personality other than that he is very loyal to Whitebeard since he was willing to risk his own life trying to save Ace from execution."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Delacuaji is a fearsome pirate who has managed to make himself an infamous reputation in the New World, and to become Whitebeard's subordinate. He appears to be a swordsman, though his exact level of swordsmanship is unknown, but is presumed to be quite high."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, he and his crew became Whitebeard's subordinates."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Delacuaji and his crew were first seen, along with a fleet of 42 other infamous pirate crews, attacking Marineford in order to rescue Portgas D. Ace from execution."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Delacuaji and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, Delacuaji cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows Delacuaji alongside the other attendees. Although it can be assumed that Delacuaji was at the funeral, there is no visual evidence of his attendance in the manga to support this assumption and, as such, his attendance can only be considered non-canon."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 551 and Episode 460, Delacuaji makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 109), Delacuaji's birthday is given.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 337), Delacuaji's name is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, Delacuaji attends Whitebeard and Ace's funeral.", "elements": []}]}], "images": []}]}