{"sections": [{"title": "A.O", "level": 1, "content": [{"type": "paragraph", "text": "A.O is an infamous New World pirate and captain of the A.O Pirates. He and his crew were subordinates to Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "A.O is a very tall man with a long, square shaped face, hollow eyes under prominent eyebrows, dark sideburns that go all the way down to his chin, and greenish long wavy hair. On his head, he wears a yellow and brown striped bandanna and over it is a tricorn captain's hat with what appears to be his Jolly Roger on it, a white skull wearing an animal-like hood. He also wears a dark blue, open shirt with the sleeves rolled up and a ruffled collar, and elaborate earrings made up by three little jewels each on both ears."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/49/A.O_full_appearance.png/revision/latest/scale-to-width-down/160?cb=20171105230442", "caption": "A.O's full appearance."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about A.O's personality other than that he is very loyal to Whitebeard since he was willing to risk his own life to save Ace from execution."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Whitebeard Pirates", "level": 3, "content": [], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "Like the rest of Whitebeard's subordinates, he's very loyal to him."}], "images": []}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "A.O was close enough to Ace to call him \"Ace-chan\" and when he found out he was in danger, he voluntarily joined the rescue mission of Whitebeard Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "A.O is a fearsome pirate who has managed to make himself an infamous reputation in the New World, becoming Whitebeard's subordinate."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "A.O carries with him a sword fitting his size, with a long curved blade."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/A.O_with_Sword.png/revision/latest/scale-to-width-down/180?cb=20140531185534", "caption": "A.O charging forth wielding his sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "In the past, he became Whitebeard's subordinate. A.O and his crew were first seen, along with a fleet of 42 other infamous pirate crews subordinate to the Whitebeard Pirates, attacking Marineford to save Portgas D. Ace from his execution. Later, he and the other New World pirates allied with Whitebeard Pirates were attacked by the Pacifista army. After Squard stabbed Whitebeard and claimed that Whitebeard sold out his subordinate crews to save Ace, A.O began to doubt Whitebeard. After Whitebeard proved his loyalty by giving the pirates an escape route, A.O was happy to know the truth and continued fighting the Marines."}, {"type": "paragraph", "text": "After the siege wall was raised and Akainu melted the ice with his magma powers, A.O boarded Whitebeard's hidden ship and entered the plaza with the help of Oars Jr.. Later, he followed Whitebeard's order in supporting Luffy and was rejoiced when Luffy managed to free Ace. However, their excitement was short-lived when Admiral Akainu provoked Ace and took his life. When the admiral aims for Luffy's life, A.O and the other pirates made protecting Luffy their top priority. After Shanks arrived and called for a ceasefire, A.O and the other pirates left the battlefield."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, A.O and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, A.O. and his crew were seen defeated by Edward Weevil for their relationship with Whitebeard, along with 15 other unspecified crews related to the Whitebeard Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/73/Weevil_Defeats_A.O_Pirates.png/revision/latest/scale-to-width-down/210?cb=20160731020956", "caption": "Weevil decimates the A.O Pirates."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}, {"text": "A.O Pirates vs. Edward Weevil", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, A.O cannot be seen among those in attendance. The anime version of the scene in Episode 505 shows him attending."}, {"type": "paragraph", "text": "In the anime, the report of his defeat is alongside those of Elmy, Ramba, Whitey Bay, Bizarre, the Decalvan Brothers, and Palms."}], "images": []}]}