{"sections": [{"title": "Cactus Island", "level": 1, "content": [{"type": "paragraph", "text": "Cactus Island is an island in Paradise. It is the first island in the Grand Line visited by the Straw Hat Pirates and the setting of the Whisky Peak Arc."}], "images": []}, {"title": "Geography", "level": 2, "content": [{"type": "paragraph", "text": "On Cactus Island there are several rock mountains with multiple graves on top. The shape of the mountains along with the graves give the mountains the appearance of giant cacti."}, {"type": "paragraph", "text": "There is a river flowing through the island allowing ships to dock inland."}], "images": []}, {"title": "Notable Places", "level": 2, "content": [], "images": []}, {"title": "Whisky Peak", "level": 3, "content": [{"type": "paragraph", "text": "Whisky Peak is the only town on Cactus Island, and the home of all of its inhabitants."}], "images": []}, {"title": "Cactus Rock", "level": 3, "content": [{"type": "paragraph", "text": "Cactus Rocks are the giant cacti-shaped mountains. On top of them are multiple graves that give the mountains the appearance of spikes. On the tombstones, certain names can be seen. In the manga, only the grave of Mr. Sacrifice can be seen. In the anime names of individuals involved with the One Piece anime, spelled backwards can be seen. For instance, one can catch Mr. Ekusonhok Adu, which is Uda Kohnosuke or Uda Kounosuke, the chief director of the series, Mr. Imusak Aksijut, Mr. Ihsakat EkiihsoY., Mr. Iyu-Manas, Mr. Okohim-Eda"}, {"type": "paragraph", "text": "There is a way to climb the Cactus Rocks, as there are multiple graves on top, and Igarappoi mentions before fighting Roronoa Zoro that another tombstone has to be added."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in the past, a town named Whisky Peak has been built on Cactus Island."}, {"type": "paragraph", "text": "At some point in the past, more than 2 years ago, the secret organization Baroque Works claimed the island and set it up as one of their bases of operation responsible for bounty hunting for money."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Whisky Peak Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Straw Hat Pirates arrived on Cactus Island, and they were greeted cheerfully to a party. After they fell asleep, the Frontier Agents discovered Monkey D. Luffy's Bounty, and decided to take his head.Roronoa Zoro didn't sleep, so he discovered their true intentions. After Zoro fought and defeated the 100 Bounty Hunters, Mr. 5 and Miss Valentine arrived in pursuit of the discovered treator, Miss Wednesday."}, {"type": "paragraph", "text": "Nami made a contract with Mr. 8 to save the Alabasta princess, Vivi. After Monkey D. Luffy woke up, he saw the defeated Bounty Hunters and assumed that Zoro cut them because they didn't make his favorite food, so Luffy started fighting Zoro. The fight was stopped by Nami. Vivi accidentally revealed Mr. 0's name, so the Unluckies drew their faces and put them on their wanted list.Igaram disguised as Vivi, decided to go on ahead as a decoy, while the princess can go with the log route. After he left, his ship exploded, so the Straw Hats hurried up and left.Miss All-Sunday showed up on their ship to talk, but quickly left."}], "images": []}, {"title": "Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "At some point during the last 2 years, Mr. 9 and Miss Monday married and had a kid."}], "images": []}]}