{"sections": [{"title": "Epoida", "level": 1, "content": [{"type": "paragraph", "text": "Epoida is an infamous New World pirate captain who was once a member of the Whitebeard Pirates, before forming his own crew subordinate to Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Epoida is a massive, rotund man with long, curly orange hair reaching down to his waist that constantly covers his eyes. He has a round nose that is orange-pinkish in color. His arms are relatively long and thin in comparison to his build. He wears a white brimmed hat on his head and a green and turquoise striped shirt with an elaborate collar. His body shape also resembles that of a caterpillar, with different sections for each stripe of his shirt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Epoida is a bold pirate who does not lose his bravery when faced with a difficult situation, as seen when he smiled defiantly and charged forward even though he was going up against Marine Headquarters. Furthermore, Epoida highly values loyalty and friendship, since he was willing to answer the call of Whitebeard to put his own life on the line to save Ace. Additionally, he possesses high respect and care for Whitebeard, as he could not hold back his tears when the Yonko was killed by Blackbeard."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Epoida is a fearsome pirate who has managed to make himself an infamous reputation in the New World, becoming a subordinate of Whitebeard. As the captain of his crew, he has authority over his men."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Epoida can transform into a massive caterpillar-like creature, presumably due to the effects of a Zoan-type Devil Fruit. In this form, he can retain his human head and hands, but grows caterpillar-like sections on his chest, with the colored stripes on his shirt seemingly merging with them, and also larger, more rotund forearms."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ad/Epoida_Caterpillar.png/revision/latest/scale-to-width-down/200?cb=20100919132744", "caption": "Epoida in his caterpillar form."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Epoida wields a double sided jousting lance, similar to the one Speed Jiru possesses. It can be assumed that he is proficient at using it since it was his main weapon during the battle against the Marines. He wields it by holding both of his hands on its handle and pointing it onwards with his arms above him and he charges. However, he has not been seen directly wielding it in combat with an opponent."}, {"type": "paragraph", "text": "Additionally, Epoida also possesses a pair of swords that he used when he prepared to descend off of Whitebeard's paddle ship."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Crewmember in the Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "​​​​​Thirty years ago, Epoida was among the Whitebeard Pirates when they arrived for the first time at Wano Country. The crew was shipwrecked and, before going into the island to gather supplies, they encountered Kozuki Oden, who, after a brief clash, asked Whitebeard to let him join their crew."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Oden kept asking to join the crew, but he was turned down. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. After Izo was pulled up onboard, Oden accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, the crew started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Rise to Infamy", "level": 4, "content": [{"type": "paragraph", "text": "Epoida later became a renowned pirate of the New World and allied himself with Whitebeard as a subordinate captain."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Epoida and his crew joined forces with the Whitebeard Pirates in order to save him from execution. While the Marines were bracing for the arrival of the pirates, Epoida and the allied fleet of the 43 subordinate captains caught them by surprise when they suddenly appeared out of nowhere just off the shores of Marineford.Whitebeard then arrived and sent a tsunami crashing down on Marineford, but the ocean is then frozen over by Aokiji. Taking advantage of the frozen sea, Epoida and the other allied captains then charged across the frozen terrain to reach the bay."}, {"type": "paragraph", "text": "Later, Epoida continued to fight alongside Karma and Amadob. When Sengoku revealed that, not only was Monkey D. Luffy the adoptive brother of Portgas D. Ace, but was also the son of the Revolutionary, Monkey D. Dragon, Epoida exclaimed in shock about what he had just heard. Soon after, Whitebeard gave commands to the allied forces and Epoida agreed to attack the right side of the bay."}, {"type": "paragraph", "text": "After the siege wall was raised and Akainu melted the ice with his magma powers, Epoida boarded Whitebeard's hidden ship and entered the plaza with the help of Oars Jr. Epoida then jumped off the paddle ship and prepared to continue the fight to save Ace. During the charge, Whitebeard gave the order for all the pirates to backup Luffy. Hearing this, Epoida and the other captains created a barrier of protection around him and ran alongside him as the latter ran towards the execution platform.  Later, after Ace was freed, Epoida watched as Squard crashed into the paddle ship into the bay and announced that he would take over the battle."}, {"type": "paragraph", "text": "Later, Epoida cried alongside his comrades when Whitebeard was killed by the Blackbeard Pirates. Soon after, the Red Hair Pirates arrived onto the battlefield and a grieving Epoida watched on as Shanks demanded for the war to end. Sengoku then declared that the battle was over and allowed the pirates to leave."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Epoida and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, Epoida cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows Epoida alongside the other attendees. Although it can be assumed that Epoida was at the funeral, there is no visual evidence of his attendance in the manga to support this assumption and, as such, his attendance can only be considered non-canon."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai.", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Epoida's ship was seen among the other vessels of the New World pirates allied with Whitebeard. It is a massive, heavily armed ship with a caterpillar figurehead, mirroring the captain's Devil Fruit power and overall theme. The crew's Jolly Roger, a green and turquoise caterpillar with a skull head and a pair of crossed swords behind it, is represented on the largest sail.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bd/Epoida%27s_Ship.png/revision/latest/scale-to-width-down/80?cb=20190823032455", "caption": "Epoida's ship."}]}]}