{"sections": [{"title": "Kumadori Yamanbako", "level": 1, "content": [{"type": "paragraph", "text": "Kumadori Yamanbako is the mother of Kumadori who was an assassin like him which means Kumadori followed her footsteps. Kumadori made lots of poetry about his mother in heaven, but in reality she is still alive."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yamanbako is an old woman who has long pink hair like her son. She also has similar facial features, such as pale skin, dark lips, a dark crease on her upper lip, and a stubby nose. She wears a dress with frills on the collar and some sort of writing of the front. She also wears dark colored hair clips and makes a peace sign with her hands."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Yamanbako is most likely a loving mother, as Kumadori writes poetry about her and her \"death.\" However, since she is alive and he believes she isn't, then she may have questionable motives for not wanting him to know."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "At one time, Yamanbako was a skilled assassin before her retirement and taught Kumadori everything he knows."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Yamanbako was once a great assassin. Along the way, she had Kumadori and trained him to be an assassin like her. She also had him train to be part of Cipher Pol. Sometime, Kumadori thought she died and wrote poetry for her \"death\", even though she is alive. She also went into retirement at one point."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yamanba means Mountain Hag, and also refers to a particularly extreme subgenre of the \"ganguro\" girl subculture in Japanese.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  SBS One Piece Manga — Vol. 44 (p. 66), Oda is asked about Kumadori's mother.", "elements": []}]}], "images": []}]}