{"sections": [{"title": "DJ Gappa", "level": 1, "content": [{"type": "paragraph", "text": "DJ Gappa was a character that appeared in the sixth movie, Baron Omatsuri and the Secret Island. He was a kappa-like member of the Red Arrows Pirates, as well as the conductor of the shooting contest."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "DJ Gappa was a short, shaggy green haired child with a turtle shell in his back, a turtle-like face, and webbed hands. He wore a chain necklace with a grey skull on it, and a yellow shirt with a white collar. Like the rest of his crew, he had a plant on his head. He also had black headphones with a white hat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Gappa appeared to be happy-go-lucky and carefree, casually asking people to lend things to him. He was very loyal to Baron Omatsuri and trusted his judgement greatly. He was also prone to throwing childish tantrums."}, {"type": "paragraph", "text": "He had a habit of say \"-pu\" at the end of sentences, a fact which he was quite sensitive about as he thought Usopp was making fun of him when he asked Gappa why he does it."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Omatsuri", "level": 3, "content": [{"type": "paragraph", "text": "Gappa held Omatsuri in very high regards and trusted his words completely. When Gappa survived Zoro’s attacks unscathed, Omatsuri told his subordinate he was very strong instead of the truth. After Omatsuri entered the afterlife, DJ Gappa thanked him for remembering his old crew."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Despite the Straw Hat Pirates strength, Gappa was not intimidated by most of them. He easily defeated multiple members and seemed to enjoy doing so."}], "images": []}, {"title": "Usopp", "level": 4, "content": [{"type": "paragraph", "text": "Gappa didn’t like Usopp for waking him up and refusing to give him his hat. When Usopp pointed out Gappa’s strange speech pattern, Gappa became enraged and gave Usopp a terrifying and creepy look. He then said he would get revenge on Usopp, which he did by defeating him and giving him to Omatsuri."}], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Zoro, unlike the rest of the crew, managed to intimidate Gappa when he decided to attack the Red Arrows pirate with full strength. Gappa wasn’t injured by the attack, which surprised Zoro. Gappa then developed the belief that he was stronger than Zoro after Omatsuri told him he was."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Gappa was a highly proficient combatant. He had very high endurance due to his reincarnated state, since he was unscathed by a lethal blow from Zoro. He had an impeccable vertical jump as well, launching himself many feet in the air to attack his opponent."}, {"type": "paragraph", "text": "Gappa uses the shell on his back as a skateboard and can skate around on it. This allows the pirate to move quickly and swiftly to follow and target his opponents with greater accuracy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/DJ_Gappa_Skating.png/revision/latest/scale-to-width-down/100?cb=20131224215945", "caption": "DJ Gappa using his shell like a skateboard."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Gappa used plates which he peels off of his scalp as projectiles that could hone in on their target, explode on impact and hover in mid-air. The plates were explosive, causing more damage. He could throw multiple plates at once, and, when many were concentrated on one opponent, they were deadly and created larger explosions. He could also rub on it to make scratch sounds, hence his name \"DJ\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c0/DJ_Gappa%27s_Plates.png/revision/latest/scale-to-width-down/210?cb=20131224215904", "caption": "DJ Gappa's plates."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Many years ago, Gappa joined the Red Arrows Pirates. They sailed on the Grand Line back when Gol D. Roger was still alive. At some point, there was a terrible storm that killed Gappa and the rest of the crew, leaving Omatsuri alone. Eventually, the lonely captain arrived on Omatsuri Island and met the Lily Carnation, which he used to revive Muchigoro and the rest of the crew. Since then, they have been attracting pirate crews to the island to break them up and feed them to the plant monster."}], "images": []}, {"title": "Baron Omatsuri and the Secret Island", "level": 3, "content": [{"type": "paragraph", "text": "Gappa appeared resting in his shell when he was suddenly awakened by an angered Usopp. Usopp was shocked by Gappa and asked what and who he was, only for pirate to respond by demanding his cap. Usopp refused and commented on Gappa's peculiar habit to add \"-pu\" to the end of words. This enraged Gappa who said he couldn't forgive Usopp while he creepily stared at the pirate. He stole Usopp's hat and gave him to Omatsuri to sacrifice to the Lily Carnation. When Omatsuri announces the next game, the Straw Hat Pirates discovered that Gappa stole Usopp's cap. Sanji takes it off of him and threatens Gappa that if he hurt Usopp, he would have to pay."}, {"type": "paragraph", "text": "Gappa, along with ninety-nine other snipers, began the Shooting Contest against the Straw Hat Pirates. Nami ran into the forest, Sanji ran into an abandoned building, and Zoro ran around, helplessly lost. They were all followed by the snipers and shot at. When the regular snipers failed to harm the three pirates, Gappa used his plates to target and home in on the three and defeated Nami and Sanji when the plates exploded."}, {"type": "paragraph", "text": "Unlike the others, Zoro survived the attacks, greatly angered by the explosion and Gappa's lighthearted attitude. Tired of going easy on the Red Arrows Pirates, Zoro delivered several deathblows that, in most cases, would've left Zoro's opponent unconscious. Gappa, however, managed to survive, which shocked Zoro. Right as he was about to attack again, Zoro was shot in the back by one of Omatsuri's arrows. Omatsuri picked up the swordsman and approached Gappa, who asks how he survived the attacks unscathed. Instead of telling Gappa the truth about Lily Carnation, he said that it was Gappa's strength. He believed his captain and left, saying he was tired. As he said this, Gappa's skin became very shriveled and he soon collapsed dead."}, {"type": "paragraph", "text": "Gappa was later revived, and was seen celebrating with a group of other crew members. After Lily Carnation's death, Gappa and the others were reverted back to plants."}, {"type": "paragraph", "text": "When Omatsuri entered the afterlife, Gappa and the rest of the crew thanked the Baron for remembering his crew from the afterlife."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/80/Zoro_Attacks_DJ_Gappa.png/revision/latest/scale-to-width-down/210?cb=20131224220016", "caption": "Zoro attacks DJ Gappa."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "DJ Gappa vs. Usopp", "elements": []}, {"text": "DJ Gappa and ninety-nine other snipers vs. the Straw Hat Pirates (during the Shooting Contest)", "elements": [{"text": "DJ Gappa vs. Nami and Sanji", "elements": []}, {"text": "DJ Gappa vs. Roronoa Zoro", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Movie 6, DJ Gappa, along with the rest of the Red Arrows Pirates, is introduced.", "elements": []}, {"text": "↑  One Piece Movie 6, DJ Gappa believes Omatsuri when he lies about his physical condition.", "elements": []}, {"text": "↑  One Piece Movie 6, DJ Gappa gets angry at and attacks Usopp when he mentions his speech impediment.", "elements": []}, {"text": "↑  One Piece Movie 6, DJ Gappa and the other Red Arrows Pirates thank Omatsuri from the afterlife.", "elements": []}, {"text": "↑  One Piece Movie 6, DJ Gappa is intimidated and attacked by Zoro.", "elements": []}, {"text": "↑  One Piece Movie 6, DJ Gappa defeats the Straw Hat Pirates in the shooting contest.", "elements": []}, {"text": "↑  One Piece Movie 6, Omatsuri reveals the former fate of his crew.", "elements": []}, {"text": "↑  One Piece Movie 6, Keroshot and the rest of the crew turn into plants.", "elements": []}]}], "images": []}]}