{"sections": [{"title": "Lily Carnation", "level": 1, "content": [{"type": "paragraph", "text": "Lily Carnation was a monstrous plant and the secondary antagonist of the sixth movie."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "While in its default form, it appeared as a harmless little flower creature attached to Omatsuri's left shoulder. It had five yellow petals with red at the joints and two red dots on each petal, an innocently looking smiling face, and a green stem. It also seemed to be wearing a white neckerchief."}, {"type": "paragraph", "text": "However, in its true form, it took the appearance of a gruesome tentacle-like creature with a sharp-teethed mouth spouting from a off-side tentacle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f6/Lily_Carnation_True_Form.png/revision/latest/scale-to-width-down/160?cb=20180226225425", "caption": "Lily's true form, while still possessing Omatsuri."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In its smaller, cute form, Lily seems playful and a bit absent minded, since it cheered on the Straw Hat Pirates and congratulated them repetitively. When it was absorbing Nami and the other pirates, it bit down like it was biting and moved its mouth like it was chewing."}, {"type": "paragraph", "text": "In its true form, Lily is revealed to be quite ruthless and evil, since it was absorbing the Straw Hat Pirates and was using Baron Omatsuri as a host shell. It seems to possess no emotion except for the deliberate desire to harm others."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The Lily Carnation had the ability to control life itself. After its root was destroyed, it emerged as a rain of arrows, and then can transform into a demonic form."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, Omatsuri arrived at Omatsuri Island and met Lily. It allowed him to revive his entire crew in exchange for food, which would be people. Omatsuri then decided to attract pirate crews to the island to feed them to Lily."}], "images": []}, {"title": "Baron Omatsuri and the Secret Island", "level": 3, "content": [{"type": "paragraph", "text": "At the beginning of the movie, Lily took on an innocent and cute personality. It was seen on Omatsuri's shoulder and cheered on the Straw Hat Pirates during the goldfish catching contest."}, {"type": "paragraph", "text": "Later, Lily's true nature was revealed and it attempted to consume the Straw Hat Pirates when they were at Omatsuri Island. After a battle, in which its roots were destroyed, it transformed into a demon plant and harnessed the Straw Hat Pirates' powers. It almost killed Luffy in their subsequent battle. However, it was killed by being shot through the head by Baron Omatsuri's bow and arrow used by Papa of the Teacup Pirates. This turned all the revived members of the Red Arrows Pirates into plants."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Lily Carnation and Omatsuri vs. Monkey D. Luffy and Papa", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Its name has two flowers in it, \"lily\" and \"carnation\"; it somewhat resembles the former but not the latter.", "elements": []}, {"text": "Its name is also possibly a play on the word reincarnation, which is its ability, to reincarnate other people as plants.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Movie 6, Lily Carnation is seen on Omatsuri's shoulder.", "elements": []}, {"text": "↑  One Piece Movie 6, Nico Robin gets Muchigoro to reveal Lily's name.", "elements": []}, {"text": "↑  One Piece Movie 6, Lily's true nature is revealed.", "elements": []}, {"text": "↑  One Piece Movie 6, Lily takes its true form.", "elements": []}, {"text": "↑  One Piece Movie 6, Lily cheers on the Straw Hats during the goldfish catching challenge.", "elements": []}, {"text": "↑  One Piece Movie 6, Omatsuri reveals his crew's former fate and how he met Lily.", "elements": []}, {"text": "↑  One Piece Movie 6, Lily and Omatsuri fight Luffy and Papa and are defeated.", "elements": []}]}], "images": []}]}