{"sections": [{"title": "Kerojii", "level": 1, "content": [{"type": "paragraph", "text": "Kerojii was a member of the Red Arrows Pirates who appeared in the sixth One Piece movie. He was also the leader of the speedboat running group within the crew, the Four Wise Men."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kerojii was a small, old man with a small nose, wrinkled forehead, and small eyes. He also had a long white beard and bushy white eyebrows. He wore a pair of burgundy overalls over a dark peach colored shirt and white gloves. Over top, he wore a burgundy and cream colored coat with a zig-zag design on it. He also wore a yellow and red frog hat that had a plant sprout sticking out of the top. The eyes of his hat looked worried, referencing Kerojii's brutality and desire to destroy relationships."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Keroji was a very traditional thinking kind of person, since he believed that he and his companions were much wiser then the Straw Hat Pirates because of their age. Despite this, he was very cruel and vicious against other pirates like the rest of his crew. He enjoyed watching members of other crews fight and wanted their friendships to end."}, {"type": "paragraph", "text": "Kerojii cared greatly for his crew and was very thankful that Omatsuri remembered his crew members after they died."}, {"type": "paragraph", "text": "Kerojii shared a unique laughter style, \"Kerokerokero\", with the rest of the Wise Men. This style is a play on the similar start to their names."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Four Wise Men", "level": 4, "content": [{"type": "paragraph", "text": "Kerojii seemed to have a deeply strong bond with his fellow Wise Men. He had a strong partnership with Keroko, coordinating attacks with ease. They got along quite well and had similar values, as seen when fighting against Nami and Usopp together. Though he hadn’t been seen interacting much with Kerodeek and Keroshot, they trusted his abilities, as seen when they cheered him on when he faced Zoro and Sanji alone."}], "images": []}, {"title": "Omatsuri", "level": 4, "content": [{"type": "paragraph", "text": "Kerojii, like the other Red Arrows Pirates, is very loyal to Omatsuri. After Omatsuri entered the afterlife, Kerojii thanked him for remembering his old crew."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Kerojii, as the Straw Hat Pirates enemy, disliked them. He also enjoyed watching them argue."}], "images": []}, {"title": "Usopp", "level": 4, "content": [{"type": "paragraph", "text": "Kerojii originally thought Usopp only as a weak pirate who couldn’t protect his friends. Usopp was greatly angered by Kerojii for trying to separate the crew. Usopp got his revenge on Kerojii when he surprised the old pirate and defeated him, disproving Kerojii statement about Usopp."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kerojii, despite his aged appearance, had the physical abilities of someone many years younger. He was fairly strong and was extremely agile, which was seen when he was taunting Zoro and Sanji and jumping around them."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Kerojii used cards that he flings at people to hurt them and get their attention. He also used his geta as projectile weapons when competing in the speedboat race. He flicked them at an opponent with his foot from the air to slightly injure and distract them."}], "images": []}, {"title": "Speedboats", "level": 3, "content": [{"type": "paragraph", "text": "Kerojii was a very skilled speedboat driver, as seen during the race. He worked very well with his speedboat partner, Keroko, and together they usually overpowered their opponents with his driving skills and her other attacks."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/60/Kerojii_and_Keroko%27s_Speedboat.png/revision/latest/scale-to-width-down/210?cb=20190429082207", "caption": "Kerojii and Keroko's speedboat"}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Many years ago, Kerojii joined the Red Arrows Pirates. They sailed on the Grand Line back when Gol D. Roger was still alive. At some point, there was a terrible storm that killed Kerojii and the rest of the crew, leaving Omatsuri alone. Eventually, the lonely captain arrived on Omatsuri Island and met the Lily Carnation, which he used to revive Kerojii and the rest of the crew. Since then, they have been attracting pirate crews to the island to break them up and feed them to the plant monster."}], "images": []}, {"title": "Baron Omatsuri and the Secret Island", "level": 3, "content": [{"type": "paragraph", "text": "When he was introduced, Kerojii and his fellow Wise Men were standing on podiums and Omatsuri announced that they would be the representatives for the speedboat race against the Straw Hat Pirates.Nami laughed at this, since she thought they were weak due to their age and size. Kerojii said he was wiser than the young pirates due to his age, and the rest of the Men insulted her as well, upsetting Nami."}, {"type": "paragraph", "text": "During the race, Kerojii and Keroko were in a speedboat against Nami and Usopp. While he was driving, Keroko used a variety of different things to distract them, such as using smoke from cooking to distract them and throwing coals at their boat to set it on fire. Throughout the match, Kerojii and his partner continuously disrespected the young pirates, even to the point that they ate a meal while Nami was trying to catch them. When Nami and Usopp's boat caught on fire, he and Keroko encouraged them to open their rescue boxes. Usopp's wrapped around him, turning into a pair of wings and carrying the sniper away. Kerojii then convinced Nami that Usopp was betraying her. Later, Zoro and Sanji, after defeating Kerodeek and Keroshot, come across an ensnared Nami and have to fight against Kerojii. Kerojii jumps from one person to the other and taunts them, and, due to the small space of the boat they are fighting on, the two almost hit each other every time. Kerojii manages to capture Sanji and distract Zoro with a flying geta to capture him as well. Just then, Usopp flies down from the sky and slams his 5-ton Hammer on the old man's head, knocking him into the water and ensnaring him. He and his fellow Wise Men snickered at the victors, since their relationships are weakened."}, {"type": "paragraph", "text": "After Lily Carnation was killed, Kerojii turned into a plant. From the afterlife, he thanked his captain for remembering them and tells him that it would've been better to forget after the storm."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Usopp_Defeats_Kerojii.png/revision/latest/scale-to-width-down/210?cb=20131025202157", "caption": "Usopp defeats Kerojii."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Four Wise Men vs. The Straw Hat Pirates", "elements": [{"text": "Kerojii and Keroko vs. Nami and Usopp", "elements": []}, {"text": "Kerojii vs. Zoro and Sanji", "elements": []}, {"text": "Kerojii vs. Usopp", "elements": []}]}]}], "images": []}]}