{"sections": [{"title": "Ramba", "level": 1, "content": [{"type": "paragraph", "text": "Ramba is an infamous New World pirate captain who allied with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ramba is a very tall man, towering over most of his fellow allies, with a slim build. He wears a long, white robe reaching down to his feet, with loose, ruffled-edged sleeves under a dark blue vest and a blue cape with a high collar. He also sports some particular pieces of armor in his attire, these being a pair of golden shoulder pads and his golden yellow, black and white signature crested helm, which has what looks like a Jolly Roger represented on the red part on the front of it and covers the upper part of Ramba's head. He carries around a long sword, fitting his height."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Ramba's personality, other than that he apparently has great respect towards Whitebeard, as he is willing to put his own life on the line to rescue Ace from execution. He also appears to be a completely calm and collected man, never panicking even in the worst situation, as seen when Ace was fatally injured by Sakazuki. He has always been seen with the same dour look on his face."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Ramba is a fearsome pirate who has managed to make himself an infamous reputation in the New World, and to become a subordinate of Whitebeard."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Ramba carries around a long sword fitting his height, with a curved blade and a large hand-guard. His level of swordsmanship is unknown, however it can be assumed that it is quite high."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Ramba became a known pirate in the New World, and he and his crew became Whitebeard's subordinates."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Ramba and his crew joined forces with the Whitebeard Pirates to save him. Some time after Luffy and allies arrived, Ramba followed Whitebeard's orders in attacking Marineford from the side instead from the front."}, {"type": "paragraph", "text": "He and his crew were later attacked by the Pacifista army. After the siege wall was raised and Admiral Akainu melted the ice with his magma powers, Ramba boarded Whitebeard's hidden ship and entered the plaza with the help of Little Oars Jr. After Luffy saved Ace from the second execution attempt with Haoshoku Haki, Ramba and the other New World Pirates support Luffy on Whitebeard's orders. Ramba urged Luffy to take the opportunity to reach Ace while Whitebeard keep the marines busy."}, {"type": "paragraph", "text": "After Luffy freed Ace on the scaffold, the Whitebeard Pirates and their New World allies rejoiced. Just when the pirates were about to leave with Ace, Akainu provoked Ace and dealt a fatal blow to him. Ramba was seen by his side together with other pirates, protecting him from incoming Marines. Unfortunately, Ace soon died from his wounds. When the admiral aimed for Luffy's life, Ramba and the other pirates made protecting Luffy their top priority. When Shanks arrived and called for a ceasefire, Ramba and the other pirates left the battlefield."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Ramba and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Under unknown circumstances, Ramba encountered Edward Weevil and got into an argument. However, this small argument resulted in his defeat at the hands of Weevil. The news of his defeat was seen on Kizaru's desk."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Ramba vs. Edward Weevil (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, Ramba cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows Ramba alongside the other attendees. Although it can be assumed that Ramba was at the funeral, there is no visual evidence of his attendance in the manga to support this assumption and, as such, his attendance can only be considered non-canon."}, {"type": "paragraph", "text": "In the anime, he can be identified through his clothing as being among the news reports of those defeated, alongside the reports of Elmy, Whitey Bay, Bizarre, A.O, the Decalvan Brothers, and Palms."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 551 and Episode 460, Ramba makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 200), Ramba's birthday is given.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 337), Ramba's name is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, Ramba attends Whitebeard and Ace's funeral.", "elements": []}, {"text": "↑  One Piece Anime — Episode 751, Ramba's news report on Kizaru's desk.", "elements": []}]}], "images": []}]}