{"sections": [{"title": "Amadob", "level": 1, "content": [{"type": "paragraph", "text": "Amadob is an infamous New World pirate who allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Amadob is a large, round man with big, dark-colored lips and curly blonde hair reaching down to his shoulders. He sports a somewhat royal attire similar to Mr. 9's, with an elaborate crown on his head and a colorful, polka dotted shirt with ruffled edges."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As an ally, Amadob is allegiant to the Whitebeard Pirates. This was demonstrated when he followed Whitebeard's orders to attack the Marines' battleships to enter the bay at Marineford. His decision to come to the battle in order to save Ace is also a testament to his strong bond with the crew."}, {"type": "paragraph", "text": "He was startled by the fact that Luffy was Dragon's son."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Amadob is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to make an alliance with Whitebeard. It is still unknown what abilities and weapons he possesses."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Amadob became a known pirate in the New World and allied himself with Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Amadob and his crew joined forces with the Whitebeard Pirates to save him. When Sengoku announced that Luffy was Dragon's son, Amadob and the other New World pirates were startled. When Whitebeard gave the orders to attack the Marines' battleships out of the bay, Amadob and Islewan steered their vessels to the port side. The allied forces supporting Whitebeard managed to enter it. Later, Amadob watched as Whitebeard was stabbed and shot by numerous Marines."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Amadob and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, Amadob cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows Amadob alongside the other attendees. Although it can be assumed that Amadob was at the funeral, there is no visual evidence of his attendance in the manga to support this assumption and, as such, his attendance can only be considered non-canon."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 558 (p. 15) and Episode 467, Amadob is startled to learn that Luffy is Dragon's son.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 559 and Episode 467, Amadob is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 23), Amadob's birthday is given.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Amadob's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 569 (p. 8) and Episode 478, Amadob watches Whitebeard get stabbed and shot multiple times by the Marines.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, Amadob attends Whitebeard and Ace's funeral.", "elements": []}]}], "images": []}]}