{"sections": [{"title": "Bizarre", "level": 1, "content": [{"type": "paragraph", "text": "Bizarre is an infamous New World pirate captain who worked for Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bizarre is a massive man with a broad chest and long arms. He has long, grey hair and beard, and over his mouth he has what looks like a pair of golden metal jaws. On his head he wears a black tattered pirate hat with what looks like his Jolly Roger on it, over a purple bandanna. He sports a pair of large, square-shaped shoulder pads, and long, white gloves."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/83/Bizarre_full_appearance.png/revision/latest/scale-to-width-down/130?cb=20171105234908", "caption": "Bizarre's full appearance."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Bizarre's personality other than that he is very loyal to Whitebeard since he was willing to risk his own life to save Ace from his execution. Also, despite his rather aggressive appearance, Bizarre seems to have some common sense, having warned Ace to ignore Akainu's insults in order to get to safety."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Bizarre is a fearsome pirate who has managed to make himself an infamous reputation in the New World, and to become a subordinate captain under the Whitebeard Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Bizarre carries around a massive katana with a square-shaped guard, and was seen charging forth wielding it with both hands. It might be assumed that he's proficient in its use."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fe/Bizarre_Battle.png/revision/latest/scale-to-width-down/210?cb=20130203073630", "caption": "Bizarre with his large sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Bizarre had become a known pirate in the New World, and he and his crew became subordinates of the Whitebeard Pirates."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Bizarre and his crew joined forces with the Whitebeard Pirates to save him. He was seen attacking the Marines out of the bay with his fellow allies, and later managed to enter it. After Squard stabbed Whitebeard and claimed that the Yonko sold out his subordinate crews to save Ace, Bizarre began to doubt Whitebeard. When the Yonko gave the pirates an escape route, he happily understood that the Marine had tricked Squard and rejoiced that all this was a lie. When Akainu started insulting Whitebeard in order to anger Ace, he warned him to ignore the admiral and proceed in the escape, but was unable to stop him and prevent him from clashing with Akainu."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Bizarre and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Under unknown circumstances, Bizarre encountered Edward Weevil and got into an argument. However, this small argument resulted in his defeat at the hands of Weevil. The news of his defeat was seen on Kizaru's desk."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bizarre vs. Edward Weevil (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, Bizarre cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows Bizarre alongside the other attendees. Although it can be assumed that Bizarre was at the funeral, there is no visual evidence of his attendance in the manga to support this assumption and, as such, his attendance can only be considered non-canon."}, {"type": "paragraph", "text": "In the anime, he is among the news reports of those defeated, alongside the reports of Elmy, Ramba, Whitey Bay, A.O, the Decalvan Brothers, and Palms."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bizarre is the third character shown with metal jaws, the first being Axe-Hand Morgan and the second being Wapol.", "elements": []}, {"text": "Oddly enough, in the manga when he is seen charging into battle, he does not have his metal jaws.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3c/Bizarre%27s_Jolly_Roger.png/revision/latest?cb=20141006232532", "caption": "Bizarre's Crew's Jolly Roger."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 468, Bizarre makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 142), Bizarre's birthday is given.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 337), Bizarre's name is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, Bizarre attends Whitebeard and Ace's funeral.", "elements": []}, {"text": "↑  One Piece Anime — Episode 751, Bizarre's news report on Kizaru's desk.", "elements": []}]}], "images": []}]}