{"sections": [{"title": "Islewan", "level": 1, "content": [{"type": "paragraph", "text": "Islewan is an infamous New World pirate captain who allied with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Islewan is a massive man whose face greatly resembles that of a walrus, with massive tusks and a large chin. He has black circles around his eyes and a scar under his right eye. Long blonde hair flows on the back of his neck from under his metal helmet, he wears a black and red captain's coat and long gloves almost reaching to his shoulders. He also sports an armor consisting of a barrel-like breastplate and shoulder pads, with porthole-like openings on them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Islewan_full_appearance.png/revision/latest/scale-to-width-down/170?cb=20171105225358", "caption": "Islewan's full appearance."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Islewan cares deeply for the Whitebeard Pirates, as he came to Marineford in order to save Ace. He also had no fear facing Marine Vice Admirals. He has a strong bond with the crew, as he became teary-eyed at the end of the battle following Ace and Whitebeard's deaths."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Islewan is a fearsome pirate who has managed to make himself an infamous reputation in the New World, becoming a subordinate of the Whitebeard Pirates alongside his crew."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Islewan carries around a katana, and it is assumed that he's proficient in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Islewan became a known pirate in the New World, and he and his crew became subordinates to the Whitebeard Pirates."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Islewan and his crew joined forces with the Whitebeard Pirates to save him."}, {"type": "paragraph", "text": "Immediately after the Vice Admirals entered the battle, Islewan charged into battle alongside several of the other allied captains. He returned to his ship, and after receiving Whitebeard's command, he and Amadob sailed to the port side of the bay to attack the Marines' battleships."}, {"type": "paragraph", "text": "After Shanks and his crew came to stop the battle, Islewan stood next to Epoida with tears in his eyes, saddened by the loss of Ace and Whitebeard."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Islewan and the rest of the allied crew attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga version of Whitebeard and Ace's funeral in Chapter 590, Islewan cannot be seen among those in attendance. However, the anime version of the exact same scene in Episode 505 explicitly shows Islewan alongside the other attendees. Although it can be assumed that Islewan was at the funeral, there is no visual evidence of his attendance in the manga to support this assumption and, as such, his attendance can only be considered non-canon."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 (p. 13) and Episode 462, Islewan and his fellow allied captains charge into the frozen bay at Marineford.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 21), Islewan's birthday is given.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 337), Islewan's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 580 (p. 12) and Episode 489, Islewan becomes teary-eyed after Shanks declares the end of the battle.", "elements": []}, {"text": "↑  One Piece Anime — Episode 468, Islewan and Amadob sail their ships to the port side of the bay to attack the Marines' battleships.", "elements": []}, {"text": "↑  One Piece Anime — Episode 505, Islewan attends Whitebeard and Ace's funeral.", "elements": []}]}], "images": []}]}