{"sections": [{"title": "Blondie", "level": 1, "content": [{"type": "paragraph", "text": "Blondie is an infamous New World pirate who was allied with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Blondie is a large, round man with black circles around his eyes and some stubble around his chin. He has what appears to be a small pet lion on his head, right over his pirate captain's hat (a tricorne), which has a Jolly Roger with a lion-like mane on it. He wears a standard pirate captain's coat draped over his shoulders like a cape, and striped shirt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/10/Blondie_Full_Appearance.png/revision/latest/scale-to-width-down/170?cb=20171105235548", "caption": "Blondie's full appearance."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Blondie always retains a rather playful appearance, smiling and carrying his pet lion on his head even during battle."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Blondie is a fearsome pirate who has managed to make himself an infamous reputation in the New World, becoming a subordinate of Whitebeard."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was seen wielding two bizarre swords both having the shape of a double sickle. Their overall shape resembles that of a khopesh. It is assumed that he's proficient at using them though how skilled he is with his swords is not known."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cb/Blondie_Battle.png/revision/latest/scale-to-width-down/200?cb=20130603200747", "caption": "Blondie with his twin weapons."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline Blondie became a known pirate in the New World, and he and his crew became subordinate to Whitebeard. A lion puppy grew fond of Blondie and since then he always takes him away on his head."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Blondie and his crew joined forces with the Whitebeard Pirates to save him. He was first seen shouting Luffy on. Later he is seen attacking the Marines out of the bay with his fellow allies, and later managed to enter it. After Squard stabbed Whitebeard and claimed that the Yonko sold out his allies to save Ace, Blondie began to doubt Whitebeard."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended Whitebeard's and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 558 and Episode 468, Blondie makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 155), His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 337), Blondie's name is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 155), Information about the pet lion is revealed.", "elements": []}]}], "images": []}]}