{"sections": [{"title": "Seaboar", "level": 1, "content": [{"type": "paragraph", "text": "The Seaboar is a sea creature that debuted in Hatchan's Sea-Floor Stroll."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Seaboar is a large ocean-faring creature, composed of a huge, bulky fish's body with a relatively thin dorsal fin and the head of a boar, complete with tusk, snout, and some hair on top."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "The Seaboar was terrified by the large sea monster that was about to attack it. It was so nervous that it regurgitated Camie and Pappag, suggesting that it has stomach troubles when it is scared."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Hatchan's Sea-Floor Stroll", "level": 3, "content": [{"type": "paragraph", "text": "The Seaboar was attacked by a sea monster that was much larger than it, but Hatchan saved it with a trident that he obtained from the Goldfish Princess. After being rescued, the seaboar regurgitated something that it swallowed earlier, which is revealed to be Camie and Pappag. After that, the seaboar was unconscious as Camie and Pappag thanked Hatchan."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 21 Chapter 192, cover story: Hatchan's Sea-Floor Stroll Vol. 10, The Seaboar is rescued by Hatchan.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 21 Chapter 193, cover story: Hatchan's Sea-Floor Stroll Vol. 11, The Seaboar is about to spit out something.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 21 Chapter 195, cover story: Hatchan's Sea-Floor Stroll Vol. 12, Camie and Pappag comes out of the Seaboar's mouth.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 22 Chapter 196, cover story: Hatchan's Sea-Floor Stroll Vol. 13, The Seaboar is unconscious.", "elements": []}]}], "images": []}]}