{"sections": [{"title": "Mash (Octopus)", "level": 1, "content": [{"type": "paragraph", "text": "Mash is a giant octopus that appeared in Hatchan's Sea-Floor Stroll."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mash is a giant octopus who wears mushroom-shaped hat. Inside his hat, he has a compartment that he can store things in, such as the Takoyaki recipe and sauce."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mash cares greatly about protecting Macro’s treasure, since the fish-man trusted him to keep it. Based off of his facial expression, he also doesn’t like Hatchan."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Despite its appearance, Mash is quite weak since he was easily defeated by Hatchan."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Hatchan's Sea-Floor Stroll", "level": 3, "content": [{"type": "paragraph", "text": "Hatchan followed the map that he was given by the Macro Pirates to find the secret takoyaki recipe. He followed the map and found Mash. After a short fight, Mash was easily defeated, and Hatchan ran to save Camie, angered since he thought the pirates lied to him."}, {"type": "paragraph", "text": "After Hatchan beat Macro and his crew, he learned that there was a secret compartment in Mash's hat. He returned and opened Mash's compartment, revealing the recipe and special takoyaki sauce. Hatchan proceeded to take the defeated octopus and the sauce to make takoyaki for his crush, Octopako."}, {"type": "paragraph", "text": "Hatchan was later seen cooking the takoyaki for the citizens of Headband Catfish Village instead of Octopako. It is unknown what happened to Mash afterwards."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mash vs. Hatchan", "elements": []}]}], "images": []}]}