{"sections": [{"title": "Drip", "level": 1, "content": [{"type": "paragraph", "text": "Drip was a member of the Fake Straw Hat Crew who was posing as the real Sanji."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Drip is a pale, very skinny man with a bags under his eyes and a long pointed chin. His hair is parted similarly to Sanji, only much more messy. He wears a suit like the real Sanji, only loose fitting and not double breasted with black dress shoes. His overall hairstyle is loosely based on the poster of Sanji. Ironically, even though Sanji's wanted poster looks nothing like the original, Drip is the one who most resembles (physically) his character, along with Duval (pre-face rearrangement)."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Unlike the real Sanji and Zoro, he has a good relationship with the Fake Zoro. Out of all the Fake Straw Hats, Drip (along with Fake Zoro) has shown to be among the most perceptive of the Impostors, quickly identifying the real Chopper, deducing that Luffy (in disguise) might have connections with the real Straw Hats (although Luffy's attitude made it clear he knew them, and they did not know he was the real Luffy), and luring him to the Fake Luffy without arousing Luffy's suspicion. Upon the truth coming out, he was discovered to be very cowardly, begging Caribou for mercy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Typical of a fraud, he is very weak as he could not do a thing when he was caught in Caribou's grip and passed out quickly. However, compared to Manjaro who loses stamina quickly, Drip could still run."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Return to the Saboady Archipelago", "level": 3, "content": [{"type": "paragraph", "text": "Drip was first seen with the fake counterparts of Zoro, Robin and Chopper. When the four of them saw the real Chopper, they assumed that he was left behind when the real Straw Hats disappeared two years ago. They then planned to capture him and discard the fake counterpart to make themselves look more realistic. Shortly after that, the fake Robin and fake Chopper were captured by some unknown men, and the fake Zoro and Drip led the real Chopper (who believed they were real at the time) back to their boss."}, {"type": "paragraph", "text": "Black told them to forget about Cocoa (fake Robin), which drove Chopper away. Upon reporting that he was the real Chopper, the fake Luffy ordered the fake Zoro and Drip to capture him. The two fakes, unable to find the real Chopper, encountered the real Luffy, who was disguised with a cloak and fake mustache at the time. Though suspicious of his connections with the real Straw Hats, they failed to recognize him as the real one, but brought him back to their boss, as Luffy believed them to be the real Sanji and Zoro."}, {"type": "paragraph", "text": "Shortly after returning to the gathering, the Marines, along with Sentomaru and two Pacifistas attacked the pirates. Sentomaru easily defeats the fake Luffy and PX-5 reveals to the recruits that their \"boss\" is Demaro Black, a low-level pirate with a bounty of merely 26,000,000."}, {"type": "paragraph", "text": "Seeing the fury of the new recruits, Drip, along with the remaining fake counterparts, ran out of fear of being killed. When Luffy was forced to reveal himself due to the Pacifista's scanning scope, Fake Zoro, Drip, and fake Sogeking all foamed at their mouths in terror and shock."}, {"type": "paragraph", "text": "Drip and the other fake Straw Hats (save Demaro Black, Cocoa, and fake Chopper) somehow escaped the battle but were held captive by Caribou and Coribou. As Coribou prepared to bury them alive, the fakes begged unsuccessfully for their lives, making claims that Black forced them to do the impersonations. Caribou, who refused to listen, grabbed Drip and used his Logia Devil Fruit power to envelop Drip in his element to choke him. Fake Sogeking then attacked Caribou with a bazooka but Caribou absorbed the shot, revealing him to be a Logia Devil Fruit user. Drip struggled pointlessly for a while, and then started twitching and shivering. He soon lost consciousness and stopped moving. Along with Caribou's intention to bury them all alive, Drip's current status is currently unknown."}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "list", "elements": [{"text": "Drip is shown during the One Piece Premier Show 2012 as a member of the Fake Straw Hat Crew.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Sento_Drip_Premiere_Show.png/revision/latest/scale-to-width-down/210?cb=20130128003248", "caption": "Sentomaru and Drip as they appear in the show."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 518, Drip makes his debut as Fake Sanji.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Drip's information is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 600 and Episode 520, Fake Sanji and fake Zoro find Luffy", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 603 and Episode 523, Drip begs for Mercy.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 601 and Episode 521, Demaro Black is revealed to be a fraud.", "elements": []}]}], "images": []}]}