{"sections": [{"title": "Manjaro", "level": 1, "content": [{"type": "paragraph", "text": "Manjaro was a member of the Fake Straw Hat Crew who impersonated Roronoa Zoro."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Manjaro is a man with a beer gut, chubby face, thick eyebrows, and thick lips. His hairstyle, earrings, and plain shirt are similar to those seen worn by the real Zoro, but otherwise, he is nothing like the real Zoro. He also wears a metal-studded belt, shorts with the number \"34\" on it, and white shoes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Manjaro is friendly with fake Sanji, unlike the real Zoro. However he is loyal to fake Luffy, automatically agreeing to forget about fake Robin just after fake Luffy ordered so. So far out of all the fake Straw Hats, fake Zoro (along with fake Sanji) has shown to be one of the most intelligent of the impostors, quickly identifying the real Chopper, discerning that Luffy (in disguise) has a connection with the real Straw Hats, and luring him to the fake Luffy without arousing the Straw Hat's suspicion. Upon the truth coming out, he was discovered to be very cowardly, begging Caribou for mercy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Typical for a fraud, he has no apparent fighting capabilities. He seems to lack stamina since he gets tired easily when running. He is very weak as he was easily brought to his knees by the Caribou Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Like Zoro, Manjaro carries three swords, as though to emulate the Santoryu. However, they appear to be basic sabers rather than katanas, and he was never seen using the swords."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "Manjaro was first seen with the fake counterparts of Sanji, Robin and Chopper. When the four of them saw the real Chopper, they assumed that he was left behind when the real Straw Hats disappeared two years ago. They then planned on capturing him and discarding the fake counterpart to make themselves look more realistic. Shortly after that, the fake Robin and fake Chopper were captured by some unknown men, and Manjaro and fake Sanji led the real Chopper (who believed they were real at the time) back to their boss. Black told them to forget about Cocoa (fake Robin), which drove Chopper away. Upon reporting that he was the real Chopper, the fake Luffy ordered the fake Zoro and fake Sanji to capture him."}, {"type": "paragraph", "text": "The two fakes, unable to find the real Chopper, encountered the real Luffy, who was disguised with a cloak and fake mustache. Though suspicious of his connections with the real Straw Hats, they failed to recognize him as the real one, and brought him back to their boss as Luffy believed them to be the real Zoro and Sanji."}, {"type": "paragraph", "text": "Shortly after returning to the gathering, the Marines, along with Sentomaru and two Pacifistas attacked. Sentomaru easily defeated the fake Luffy and PX-5 revealed to the recruits that their \"boss\" is Demaro Black, a low-level pirate with a bounty of merely 26,000,000. Seeing the fury of the new recruits, Manjaro, along with the remaining fake counterparts, ran out of fear of being killed. When Luffy was forced to reveal himself due to the Pacifista's scanning scope, Manjaro, Drip, and fake Sogeking all foamed at the mouth from terror and shock."}, {"type": "paragraph", "text": "Manjaro and the other Fake Straw Hats (except Black, Cocoa, and fake Chopper) somehow escaped the battle but are being held captive by Caribou and Coribou. The fakes beg for their lives as Coribou prepares to bury them alive."}, {"type": "paragraph", "text": "As Caribou and his crew later disembarked to hunt down the real Straw Hats, Manjaro's current status is unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8e/Fake_Straw_Hats_Begging.png/revision/latest/scale-to-width-down/210?cb=20130726070024", "caption": "Manjaro, along with the remaining Fake Straw Hats, begging for their lives."}]}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "paragraph", "text": "Manjaro is shown during the One Piece Premier Show 2012 as a member of the Fake Straw Hat Crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Manjaro_Mounblutain_Premiere_Show.png/revision/latest/scale-to-width-down/210?cb=20130128003243", "caption": "Manjaro and Mounblutain as they appear in the show."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 518, Manjaro makes his debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Manjaro's information is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 108), His name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 518, Fake Zoro and Drip is shown to be somewhat smarter than their captain and colleagues.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 601 and Episode 521, Sentomaru defeats Black and reveals the crew's fraudulence.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 603 and Episode 523, Fake Zoro and his colleagues' fate revealed.", "elements": []}]}], "images": []}]}