{"sections": [{"title": "Demaro Black", "level": 1, "content": [{"type": "paragraph", "text": "\"Three-Tongued\" Demaro Black was the captain of the Fake Straw Hat Crew. He impersonated Monkey D. Luffy to benefit from his reputation, but was later arrested by Sentomaru."}, {"type": "paragraph", "text": "Due to his actions, he can be considered the main antagonist of the Return to Sabaody Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Black is a large and obese man whose face is very broad, with his forehead jutting prominently forward, almost concealing his eyebrows entirely. He has facial hair that extends from the ends of his mouth to his chin, and his nose comprises of a narrow bridge, sloping outward, like the forehead, and ending in a large, wide, and rounded set of nostrils. His legs are thin and hairy. He is almost always smiling or laughing even after being wounded. He also has an X-shaped scar on his stomach and another scar on his left shoulder. His Flintlock is always in his hand or tucked in his pants."}, {"type": "paragraph", "text": "In his attempt to impersonate Luffy, Black wears similar apparel. He also has an imitation scar beneath his left eye. However, the similarities end there. His scar has three stitches instead of two, his straw hat is frayed and unkempt with a striped band around its circumference, his shirt is open and too tight to close due to his obese figure, and he wears boots rather than sandals like the real Luffy. He also wears blue jeans like Luffy but without the fur lining and the real Luffy wears shorts while Black's jeans go to his shins. Black wore a typical pirate coat when addressing his recruits. All in all, he looks virtually nothing like the real Luffy."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Black's personality is quite similar to that of the World Nobles, albeit somewhat less extreme, believing that impressive heritage and high status will grant him immunity and undeserved rights. The difference is that the World Nobles, and other Royalty, are mostly correct, unfortunately, and do receive such privileges, while Black's ruse is only impressive to other criminals. He is extremely ruthless and egotistical, using the real Luffy's reputation to act with impunity. With Luffy's exceedingly high bounty and known infamy, Black believes he can get away with virtually anything. He treats his reputation as an entitlement, expecting others to accommodate him simply because he is a famous pirate. He seems to have enough common sense to realize that his reputation alone will not protect him from everyone, though he still attempts to use it as leverage in a pinch. Black angers easily when things do not go as planned, or at any perceived slight by anyone he meets. He treats something as simple as being knocked down as an offense to kill someone over. This seems to extend from his stolen reputation, as he believes the act gives him the right to behave as such. Because of his ego, Black, in attempting to exact revenge, seems to be blinded to the dangers his opponents represent. Despite the real Nami, Usopp, and Luffy all dispatching him and his immediate crew with casual ease, his anger drives him to get revenge at any cost, even gathering his entire collection of recruits just to deal with three people. He also attempted to talk down Sentomaru using his reputation, even though Sentomaru clearly did not believe him."}, {"type": "paragraph", "text": "Unlike the real Luffy, who places little importance to a person's background, Black takes every opportunity to brag about his heritage and accomplishments, which he uses to justify his actions; in fact, he uses it as his primary weapon to intimidate his opponents in order to defend himself. He has no qualm with hurting innocent people, apologizing sarcastically after accidentally shooting bystanders he mistook for his enemies. He places no importance on the well-being of his crew, viewing them as a means to an end. By comparison, Fake Sogeking shows more care of his crew mates than him. He also appears to be a coward, using the fake Nami as a sacrificial lamb to escape Usopp's man-eating plant."}, {"type": "paragraph", "text": "Black's arrogance seems to cloud his better judgment. Having met the real Nami, Usopp, Luffy, and Chopper, he failed to recognize any of them. Black had to be told of Chopper's identity by the fake Sanji and Zoro. It was also apparent that Black did not take into the account the consequences of impersonating a notorious pirate such as Luffy, apparently forgetting the fact that he was currently wanted by the World Government, which led to the fake's capture and Sentomaru even stated that Black and his fellow impostors were idiots. This mindset, coupled with his ego, ultimately led to Black's downfall when his empty threats against Sentomaru backfired."}, {"type": "paragraph", "text": "Like many characters in the world of One Piece, he also have an unique Laughter Style, which is \"Dohahahaha\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Unlike the real Luffy, Demaro Black did not have a real bond with his crew and was not concerned about their well-being. Black demanded that his crew call him \"Boss\" (大頭, Ōgashira) at all times, an act due to his demand for respect and obedience, something that the real Luffy would never do. He simply recruited any pirate crews whose captains managed to earn a bounty of at least 70,000,000, instead of handpicking them as the true Luffy would, and was willing to abandon them when they were getting annihilated by the Pacifistas. His crew of fellow impostors seemed loyal, but seemingly only to the extent that he was their captain. They abandoned him as soon as his true identity was exposed, for he no longer held the power to protect them, and even claimed that Black forced them into impersonation. The remaining recruits, who only joined him to further their own fame, were extremely angry at the deception, with Albion even considering Black to be a \"random piece of trash worth a mere 26,000,000\". Because of Black spreading his recruitment flyers all over Sabaody Archipelago, he was inadvertently leaving a trail for the Marines to follow and his carelessness lead to most of the recruits to be arrested."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "While everyone was under the impression that Black is the Straw Hat captain, Black would take his anger out on anyone who offended him, even in the slightest way."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After Nami and Usopp humiliated him in a bar and fled, Black set his sights on finding them and exacting his revenge. During his search, the real Luffy accidentally knocked him over and instantly earned Black's scorn. Black then made an attempt on Luffy's life but it backfired, all the while without knowing any of the offenders' true identities."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "Black's ruse also proved to be his greatest undoing since pretending to be Luffy made him a target of the real Luffy's enemies such as the marines. Sentomaru, having met the real Luffy before and was not at all convinced by the impostor's facade, confronted Black and put an end to his deception."}], "images": []}, {"title": "Caribou Pirates", "level": 4, "content": [{"type": "paragraph", "text": "The Caribou Pirates planned on killing the fakes from the very beginning, under the assumption they were real and joining them only as a ruse, but since Black was already captured by Sentomaru, he was spared from the fate of getting buried alive."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Black appears to survive solely on his ability to manipulate others, having little apparent combat skills to speak of. His skill in deception was quite impressive as every person who did not know Luffy previously actually believed that Black was the Straw Hat captain, although Sentomaru noted that anyone who believed the impostor's lie was considered stupid. Unable to defend himself against more powerful opponents, Black instead relies on his stolen reputation as Straw Hat Luffy to intimidate foes into not fighting back, though he is smart enough to realize that not all of his opponents would be deceived by this. The one thing that can be said in Black's favor is that he is fairly durable, managing to walk away from attacks by Usopp's Pop Greens and Nami's thunderbolt, albeit while somewhat injured. However, Sentomaru knocked him out in a single strike from the broad side of his axe. He has also been shown to have a weak will, as Luffy was easily able to knock him out using Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He has been shown using a flintlock pistol in combat, but his proficiency with it does not seem to extend beyond shooting people who anger him at point blank range."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Straw Hat Pirates had not been seen or heard from for two long years after the Battle of Marineford. Most people, including Black, started to believe that the Straw Hat Pirates were dead. Since there was no official confirmation that the said pirates were actually gone, Black and his crew decided to take advantage of the situation and set up a charade and pass themselves off as the Straw Hat Pirates."}, {"type": "paragraph", "text": "In a bar in the Sabaody Archipelago, Black was posing as Monkey D. Luffy and looking for new recruits for his crew along with Fake Nami, Fake Sogeking, and Fake Franky. After shooting and dismissing a potential recruit for having a low bounty of 55,000,000 (as opposed to the prerequisite of over 70,000,000 that he and his crew imposed), he invited the real Nami to join, failing to recognize her as a member of the real Straw Hats. When she refused, he and his crew tried to force her into joining, which was again met with disinterest. Before they could do anything else, they were attacked by carnivorous plants spawned from one of Usopp's Pop Greens. Black and his crew managed to get free of the plant, only to be struck by a massive thunderbolt left behind by Nami as she and Usopp departed. Although wounded, Black was able to get up and ordered his men to find their attackers."}, {"type": "paragraph", "text": "Black later came upon a woman and a man who looked vaguely similar to his quarry. After shooting the woman, he sarcastically apologized for the misunderstanding and then shot the man in cold blood for objecting. At that moment, the real Luffy came by and inadvertently knocked Black over. Luffy tried to apologize and move on, but Black decided to press the issue, treating the accident as an insult against him. Boasting about his 400,000,000 bounty, he demanded the real Luffy to beg for forgiveness, completely unaware of whom he was picking a fight with. Not wanting to draw too much attention, Luffy simply excused himself. Black attempted to shoot him, but Luffy casually dodged the shot and knocked the entire group unconscious with Haoshoku Haki. Sometime later, Black and the rest of his crew awakened after being found by Fake Zoro and Fake Sanji, confused as to what the real Luffy did to them. Fake Sanji and Fake Zoro report Fake Robin's loss, which Black casually dismissed as bad luck. His concern at the time was exacting revenge on Nami, Usopp, and Luffy. Black then informed his crew that they would gather all of their recruits and teach the people who disrespected him a lesson. His attitude towards Robin's abduction drove Tony Tony Chopper away, who was still under the impression that the fakes were his friends."}, {"type": "paragraph", "text": "After being told that the talking \"raccoon-dog\" is the real Chopper, Black ordered Fake Sanji and Fake Zoro to capture him. Meanwhile, Black gathered his recruits at Grove #46, announcing his plan to go to the New World, where they would fight and die for his sake. His first act of business, however, was for them to capture the ones who humiliated him (Luffy, Nami, and Usopp). At that moment, Fake Zoro and Fake Sanji brought the real Luffy to him."}, {"type": "paragraph", "text": "Black decided to make an example out of the real Luffy, only for the Marines, joined by Sentomaru and two Pacifista, to interrupt. Black ordered Caribou and Coribou to use a captured Marine as a human shield so they could get to safety, but Caribou just killed the Marine and incited a battle. Since his recruits were totally helpless against the Pacifistas, Black and the other fake Straw Hats tried to make a run for it. Unfortunately for them, Sentomaru cut off their escape. Clearly recognizing Black as a fraud due to having fought with the real Luffy before, Sentomaru questioned why he was being called Straw Hat Luffy. All Black could do was attempt to intimidate Sentomaru with Luffy's reputation. Unfazed by Black's empty threats, Sentomaru flattened Black with the broad side of his axe in a single attack. PX-5 then told the assembled pirates of his true identity: \"Three-Tongued\" Demaro Black, bounty 26,000,000. The assembled pirates were furious at the deception and Black's crew scattered as their leader was no longer in a position of power."}, {"type": "paragraph", "text": "After the battle, Black was seen tied up, unconscious on the ground in front of Sentomaru and in the custody of the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Luffy_Knocks_the_Impostor_Straw_Hat_Pirates_Out_With_Haki.png/revision/latest/scale-to-width-down/300?cb=20130525012237", "caption": "Black and his crew knocked out by Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Demaro_Black_Easily_Defeated_by_Sentomaru.png/revision/latest/scale-to-width-down/210?cb=20130829040120", "caption": "The end of Black's charade."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Demaro Black, Chocolat, Mounblutain, and Turco vs. Usopp and Nami", "elements": []}, {"text": "Demaro Black vs. Monkey D. Luffy", "elements": []}, {"text": "Fake Straw Hat Crew vs. Marines", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "Black's epithet, \"Three-Tongued\", refers to an untrustworthy person who often lies to people to be on their side but never truly sides with them. However, in Black's case, he lies to get people to side with him.", "elements": []}, {"text": "Most translators spelled his surname as \"Demalo\". His official name, however, when PX-5 scanned Black's identity, the scanner show his name is spelled \"Demaro Black\".", "elements": []}]}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "paragraph", "text": "Demaro Black is shown during the One Piece Premier Show 2012 as a member of the Fake Straw Hat Crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9c/Demalo_Premiere_Show.png/revision/latest/scale-to-width-down/210?cb=20130128003242", "caption": "Demaro Black as he appears in the show."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Demaro Black's voice actor is Sanji's voice actor. This is due to the Fake Straw Hat Pirates' voice actors being the true Straw Hat Pirates' voice actors, but only mixed up.", "elements": []}, {"text": "Black has the same birthday as Luffy, both being on May 5.", "elements": []}, {"text": "Demaro Black might have been based on Ferdinand Waldo Demara, famous for being able to impersonate many workers unsuspisciously, to the point of posing as a surgeon in a navy ship and just by speedreading a textbook, performed surgeries with flawless success.", "elements": []}]}], "images": []}]}