{"sections": [{"title": "Chocolat", "level": 1, "content": [{"type": "paragraph", "text": "Chocolat is a member of the Fake Straw Hat Crew who masqueraded as Nami."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Chocolat is a potbellied woman who bears little resemblance with the real Nami. She has a wide face (similar to Sandersonia) and short hair with a bun near top of her head (possibly because in the wanted poster Nami was tying up her hair for the picture). She wears a polka-dotted top and a lavender skirt, bearing a rather portly, pot bellied midriff, contrasting Nami's slender figure."}, {"type": "paragraph", "text": "On her left shoulder she has the same tattoo as Nami. She also wears black high heels. In the One Piece premiere 2012, she wore a pink skirt and pink high heels."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As with the rest of her crew, Chocolat uses the reputation of the real Straw Hats to intimidate others. Unlike the real Nami, she brags about \"her\" bounty, despite it being particularly small for a Grand Line pirate, and shown to be very vicious, not hesitating to threaten someone with her flintlock pistol. Upon the truth coming out, she was discovered to be very cowardly, begging Caribou for mercy. Chocolat shows more of a kinder side as she begged Caribou to release Drip and showed concern when he was released."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Like the rest of her crew, Chocolat apparently has no fighting capabilities, which is typical for a fraud. It was obvious that she had a weak will as she easily fainted from Luffy's Haki. Another sign of her weakness was that she was captured and easily brought to her knees by the Caribou Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Chocolat was seen wielding a flintlock pistol. In the anime, it was the same one used by Black."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "She was first seen with her crew in a bar at the Sabaody Archipelago. After Nami turned down her captain's invitation, she unwittingly bragged about being worth 16,000,000 to the bounty owner herself. As her crew advanced, she fell victim to Usopp's Pop Green. Chocolat and the other fakers get struck by a gigantic lightning bolt created by Nami's weapons. She then follows Fake Luffy in his search for Usopp and Nami, but end up encountering the real Luffy. When Fake Luffy tries to attack the real one, Chocolat and the other Fake Straw Hats fainted due to Luffy's Haki."}, {"type": "paragraph", "text": "She is soon woken up by Fake Zoro and Fake Sanji. She shivers from the after-effects of Luffy's Haki. She is then seen in Grove 46 with the other Fake Straw Hats when Fake Luffy makes his speech to their new recruits, and when her captain tried to make an example out of the real Luffy. When Sentomaru brought Pacifista units and Marine soldiers to interrupt their meeting, Chocolat ran with the rest of the impostors out of fear, and she foamed at the mouth with the rest of the crew when the real Luffy revealed himself."}, {"type": "paragraph", "text": "Chocolat and the other Fake Straw Hats (sans Black, Cocoa, and Fake Chopper) somehow escaped the battle but were being held captive by Caribou and Coribou. The fakes beg for their lives as Coribou prepares to bury them alive."}, {"type": "paragraph", "text": "As Caribou and his crew later disembarked to hunt down the real Straw Hats, Chocolat's current status is unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Fake_Nami_Threatens_Real_Nami.png/revision/latest/scale-to-width-down/230?cb=20141206172750", "caption": "Chocolat threatening the real Nami."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8e/Fake_Straw_Hats_Begging.png/revision/latest/scale-to-width-down/210?cb=20130726070024", "caption": "Chocolat, along with the remaining Fake Straw Hats, begging for their lives."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Chocolat, Demaro Black, Mounblutain and Turco vs. Usopp and Nami", "elements": []}]}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "list", "elements": [{"text": "Chocolat is shown during the One Piece Premier Show 2012 as a member of the Fake Straw Hat Crew.", "elements": []}, {"text": "Chocolat and Cocoa appear in chapter two of One Piece Party.", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 517, Chocolat makes her debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Chocolat's information is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 108), Her name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 603 and Episode 523, Chocolat begs Caribou for mercy.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 599 and Episode 518, Chocolat falls to Luffy's Haoshoku Haki.", "elements": []}]}], "images": []}]}