{"sections": [{"title": "Coribou", "level": 1, "content": [{"type": "paragraph", "text": "\"Blood-Splatterer\" Coribou is a captain of the Caribou Pirates, along with his brother Caribou."}, {"type": "paragraph", "text": "He is famous for killing Marines and was at the Sabaody Archipelago around the time of the Straw Hat Pirates' reunion. He, along with Caribou, another infamous rookie, joined the Fake Straw Hat Crew temporarily. He has a bounty of 190,000,000, making him part of the new generation of rookies, following the path of Luffy and the other Supernovas with bounties over 100,000,000."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Coribou is a very large, rotund, egg-shaped man, towering over his brother as well as the rest of their crew. His legs are rather skinny and thin in comparison to the rest of his body. He has dark lips and circles around his eyes, and on his head is what appears to be a type of lizard that acts as his \"hair\", with the tail acting as a tuft, covering the right part of his face."}, {"type": "paragraph", "text": "He dons dark pants and shoes, and a lighter shirt with blood splatters on some parts near and on his neck (hence his nickname), with loose sleeves and ruffled edges, and what appears to be a Cross fleury on the chest. During his brother's cover story, Coribou appears to have changed to a similar shirt without sleeves. Caribou also appears to be constantly sweating. "}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e2/Coribou_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180905175250", "caption": "Coribou's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Coribou appears to be rather oblivious to the location of things around him. Whether this is because he is foolish, has bad eye sight, is too afraid to look at his brother, or just a peculiar habit is unknown. He was facing the wrong way when answering his brother about smearing the plaza with a Marine's blood. He is also rather obedient to Caribou's requests, as he immediately started digging a grave to bury the Marine alive upon his brother's orders without question and showing no signs of compassion or mercy."}, {"type": "paragraph", "text": "He has a habit of calling Caribou \"bro-bro\" (兄助, anisuke). He is also always very nervous, and is constantly stuttering and sweating, which could suggest he is afraid of his brother. In spite of this, he is nevertheless very loyal to Caribou, proven when he and the rest of their crew made the journey to a Marine base in order to rescue him, and even more so when they reunite after Caribou had abandoned his entire crew for his own safety, and Coribou remained affectionate towards him. This is because their Grandmother told them to get along, and it is implied that she punished them for fighting based on the bandages on their heads in Coribou's memory."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Coribou_Looking_the_Wrong_Way.png/revision/latest/scale-to-width-down/210?cb=20130206234201", "caption": "Coribou facing the wrong direction."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Coribou is supposedly a fearsome pirate captain who, along with his brother, managed to reach Sabaody Archipelago, with their fame arising from killing Marines."}, {"type": "paragraph", "text": "He was strong enough to survive 3000 meters below sea level and somehow made it back to the surface alive and well."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries around a shovel, which he apparently uses to dig the graves of the people whose his brother considers \"sinners\" when asked to do so. He also uses it as a melee weapon against the Marines of G-5 and to cut down the stake that Caribou was tied to."}, {"type": "paragraph", "text": "During his attempted attack against the Straw Hat Pirates, Coribou was seen carrying a hand-held Gatling gun. However, as his ship was attacked by the kraken before he had a chance to attack, his proficiency with the weapon and its firepower are not demonstrated. Coribou's gatling gun has a somewhat different design in the manga than in the anime."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Caribou and Coribou were young children, their now deceased grandmother told the two to always stick together and love each other no matter what. Despite his brother not caring, Coribou took these words to heart."}, {"type": "paragraph", "text": "Some time in the past, Coribou and Caribou became pirates and gained a fearsome reputation for killing Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Caribou_and_Coribou%27s_Grandmother.png/revision/latest/scale-to-width-down/210?cb=20150322230301", "caption": "Caribou and Coribou with their grandmother."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "Eventually, the two brothers managed to reach Sabaody Archipelago, were they allied themselves with the Fake Straw Hat Crew. They were first seen in grove 46, the allies' meeting point, along with some fellow pirate captains. After Caribou spotted and injured a Marine who was spying on them, Coribou was ordered by his brother to bury the man alive, and he started digging with his shovel. The two were, however, interrupted by Fake Luffy, who ordered them to stop. After the Marines arrived, he followed his brother's lead and disobeyed Fake Luffy."}, {"type": "paragraph", "text": "As he and the rest of the crew were digging graves for the Fake Straw Hat Crew, Coribou complained that the ground was hard and Caribou pointed out that the island is mainly tree roots. They later followed the Straw Hats under the ocean on a coated ship."}], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "With Momoo, the Caribou Pirates soon caught up with the Straw Hats. Caribou quickly jumped onto the Thousand Sunny. Before Coribou and the others could follow, Mohmoo fled in fear after seeing and recognizing Nami, Sanji, and Luffy, leaving Caribou behind on the Thousand Sunny. Coribou and the others were confused as to why Mohmoo was fleeing. As the Straw Hats encountered a kraken, Coribou and the other Caribou Pirates returned to Caribou's aid. Unfortunately for them, the kraken struck and destroyed their ship and they floated upward in the water. Zoro commented that they resembled a school of jellyfish, much to Caribou's chagrin."}, {"type": "paragraph", "text": "Coribou and his crew somehow survived the encounter with the kraken, and acquired a new coated ship and traveled to the depths of the sea once again. After reaching Fish-Man Island, they called Caribou, informing him that they made it to port."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/Caribou_Pirates_Drowning.png/revision/latest/scale-to-width-down/210?cb=20121112021819", "caption": "Coribou and the rest of the crew (except for Caribou) after their ship was destroyed."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Caribou's Kehihihihi in the New World", "level": 4, "content": [{"type": "paragraph", "text": "As Jinbe was traveling to the surface with Caribou as his prisoner, the Caribou Pirates intercepted them. Before Coribou could retrieve his brother, Jinbe stepped out of his boat and pulled it far away from the Caribou Pirates' ship. Coribou and the others eventually surfaced in the New World and arrived at the G-5 Marine base, where Caribou was about to be burned at the stake by Yarisugi and his men. Coribou battled Yarisugi right after he set the stake on fire. After fending off Yarisugi, he then cut down the burning stake and saved Caribou. Coribou and the crew were later defeated by the G-5 Marines. However, Caribou managed to escape and fled on his pirate ship, leaving his crew behind."}, {"type": "paragraph", "text": "Coribou and the Caribou Pirates apparently escaped the G-5 base and acquired one of their ships. They later arrived at the island where Caribou was. Coribou quickly hugged his brother because of what their grandmother always said, that brothers must always be together."}, {"type": "paragraph", "text": "The Caribou Pirates then followed Caribou as he posed as a revolutionary leader known as Gaburu. They then battled Scotch and his men. After Caribou destroyed the factory, the Caribou Pirates celebrated. The celebration was cut short as they were soon attacked by X Drake. Shortly afterwards, the Caribou Pirates and the revolutionaries were defeated by the Supernova. As Caribou was dragged away by Drake, the Caribou Pirates and the revolutionaries saluted him and Gaburu's grandmother gave him her last meat pie. They then bid Caribou farewell as he sailed away from the island on Drake's ship."}, {"type": "paragraph", "text": "The Caribou Pirates were later shocked when Gaburu's grandmother turned up at Gaburu's gravestone, revealing she knew Gaburu was dead all along."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Caribou_Leaves_G-5.png/revision/latest/scale-to-width-down/180?cb=20130812085850", "caption": "Coribou gets forsaken by his brother."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Caribou Pirates vs. Marines (past battles; numerous times)", "elements": []}, {"text": "Caribou Pirates vs. G-5", "elements": [{"text": "Coribou vs. Yarisugi", "elements": []}]}, {"text": "Caribou Pirates vs. Scotch", "elements": []}, {"text": "Caribou Pirates vs. X. Drake", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "All the other members of his crew (aside from his brother) resemble him in both body shape and hairstyle.", "elements": []}]}], "images": []}, {"title": "Site Navigation", "level": 2, "content": [{"type": "paragraph", "text": " "}], "images": []}]}