{"sections": [{"title": "Caribou", "level": 1, "content": [{"type": "paragraph", "text": "\"Wet-Haired Caribou\" is an infamous rookie pirate who was at the Sabaody Archipelago around the time of the Straw Hat Pirates' reunion. Deranged, sadistic, and prone to acts of brutal violence, he has earned a bounty of 210,000,000, making him part of the new generation of rookie pirates with bounties over 100,000,000."}, {"type": "paragraph", "text": "He is the brother of \"Blood Splatterer\" Coribou, another infamous rookie, with whom is co-captain of the Caribou Pirates. Both brothers gained their reputations for killing Marines. As both of them have bounties over 70,000,000, they both fulfilled the requirement of the Fake Straw Hat Crew, but they eventually left upon discovering the crew's fraudulence."}, {"type": "paragraph", "text": "He is a minor antagonist during the Fish-Man Island Saga, and the central character from Caribou's Kehihihihi in the New World Cover Page Serial. Later, he became an ally of Luffy during the Wano Country Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Caribou is a tall man with dark skin and dark hair reaching down to his shoulders, a distinctive wet-looking tuft giving him his epithet, and a beard in the shape of a whirl going upwards on his chin. He has intimidating eyes with many circles around the pupils (with dark and medium green central heterochromia in the anime), pointed ears, and long limbs. He has a long tongue which is often seen sticking out."}, {"type": "paragraph", "text": "He wears a coat which appears to be made of fur, dark on the outside and lighter and spotted on the inside (similar to a leopard's), draped over his shoulders like a cape, dark pants and shoes, and an extremely long-sleeved shirt (which at Sabaody was covered in blood) with a Cross fleury-like design on the chest. With the way he wears his shirt, concealing his arms under his long sleeves, it resembles an unbuckled straitjacket."}, {"type": "paragraph", "text": "After being found and looked after by an old woman on a winter island in the New World, Caribou is seen wearing a coat, which has a darker color than his previous one and a fluffy collar, draped onto his shoulders. He is also wearing plaid pajamas and thick winter boots. He soon went back to wearing his old long sleeved attire, but now wears a revolutionary uniform jacket draped over his shoulders, along with a beret with a star on it."}, {"type": "paragraph", "text": "After becoming a prisoner in Wano Country, Caribou kept his long sleeve shirt, but acquired standard prisoner striped pants and tattered trousers, as well as handcuffs and sandals."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Caribou is a violent lunatic renowned for killing Marines. He apparently believes strongly in a God, begging Him to forgive the Marine that tried to shoot him, before sadistically ordering his brother to bury the man alive as a punishment for the Marine's \"sins\". This hints at a deeper depraved nature within the man, as he justifies his own acts of brutal violence using religion, and appears to genuinely believe that murdering in cold blood is done in the good faith of this higher power. He later shoots the Marine when additional reinforcements arrive, as the Marine lied to him about calling for backup, without concern for the consequences of his actions."}, {"type": "paragraph", "text": "In spite of his religious zeal, or perhaps because of it, he does seem to have at least some basic understanding of how corrupt the world is, as shown by his comment on how the Marines need to get rid of their \"unspoken rule\" about how it is okay to lie to criminals, as well as his comment about how hypocritical the Marines are. However, the comment may be based more on his anger toward the Marine who lied to him about the reinforcements that he called than anything else. He is very merciless, as he ignored the pleas of the fake Straw Hats as he had graves dug to bury them alive. He planned to profit off the lives of mermaids, seeing them as mere means to an end with no value for the lives of others."}, {"type": "paragraph", "text": "He released the mermaids when he stole the treasures of Ryugu Palace, simply considering selling mermaids to be a hassle compared to getting rich much faster by plundering the treasure. Upon learning about the existence of the Ancient Weapons, and that Princess Shirahoshi is one of the three, he grew an obsession to kidnap her for the dreaded power to destroy the world. All these factors strongly hint at a psychotic and ruthless nature within him, showing no remorse whatsoever and taking glee from the cries of his victims, going so far as to even justify his actions as keeping with the whims of a higher power."}, {"type": "paragraph", "text": "He also appeared to show less-than-innocent deviant ideas when eyeballing Nami and planning an ambush in private, actions which Sanji immediately disapproved of."}, {"type": "paragraph", "text": "Caribou originally shows a complete lack of fear towards the Straw Hat Pirates (both the real and fake ones), completely disregarding the fake Luffy's orders despite knowing Luffy's 400,000,000 bounty, and still opted to go after the real Straw Hats after escaping from Sentomaru (though it is not known whether or not he witnessed the ease at which the Monster Trio dispatched the two Pacifista units that Sentomaru brought with him, or even acknowledged the strength of the real crew). Apparently, he had planned to kill the crew from within after joining, and decided to do the same to the real crew after the fakes were exposed."}, {"type": "paragraph", "text": "However, Caribou is revealed to have some common sense when dealing with them. When he found himself alone in the presence of the entire Straw Hat crew, his own crew having been unable to board their ship with him, he immediately understood that he could not win. Instead, he begged for mercy and pretended to be cannon fodder as a ploy to get them to let their guard down; ironically, his overconfidence of his escape from the ropes that bound him led him to drop his own guard, which led Franky to seal him into a barrel. However, he has the patience and the intelligence to remain silent long enough for some unwitting mermaids to unseal the barrel."}, {"type": "paragraph", "text": "Notably, when encountering the Kraken, he expresses fear of death. He seems to be somewhat perceptive as he was the only one who noticed the Kraken beneath them, though he may have been aware of its presence there beforehand. He also showed some concern when his crew suffered a shipwreck from the Kraken, and was angered when Zoro insulted them by calling them jellyfish. However, this concern was only displayed when they were about to save him. Caribou did not hesitate to abandon his own brother and crew after they saved him from Yarisugi and his men and showed no remorse in leaving them behind."}, {"type": "paragraph", "text": "He is also a hypocrite and a liar, as he buried the fake Straw Hats alive and murdered many Marines, but when captured by Franky, he cried out that human lives are not to be wasted so quickly, molding his beliefs and words to whatever will best benefit only himself. When confined into a barrel, he went as far as to beg to become Franky's slave in exchange for his release. Caribou shows the same trait in Wano when he offers to become Luffy's slave for food. Later on, he was surprised when Luffy agreed to his help with the escape plan."}, {"type": "paragraph", "text": "Despite his cruelty, insanity, and cowardice, he appears to have a something of a soft spot for the elderly, possibly stemming from a childhood of being raised by his grandmother. After he was saved and nursed back to health by an old woman, his first instinct was to steal her valuables and leave. But when her life was endangered by a housefire, he returned out of genuine concern for her well-being and saved her. Moreover, when she allowed herself to be captured by Scotch in order for him to escape, Caribou returned with his crew, saved her life, and defeated Scotch, placing the island under the control of the island's rebels."}, {"type": "paragraph", "text": "Like many other characters, he has a distinct laughter style, starting with \"Kehihihi\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0b/Caribou_Prays.png/revision/latest/scale-to-width-down/210?cb=20111023051439", "caption": "Caribou praying to a god to forgive the Marine that tried to shoot him."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "The Caribou Pirates are very loyal to Caribou. Coribou is too afraid to look at his brother. He was facing the wrong way when answering his brother about smearing the plaza with a Marine's blood. He is also rather obedient to Caribou's requests, as he immediately started digging a grave to bury the Marine alive upon his brother's orders without question and showing no signs of compassion or mercy. He has a habit of calling Caribou \"bro-bro\" (兄助, anisuke). He is also always very nervous, and is constantly stuttering and sweating, which could suggest he is afraid of his brother. In spite of this, he is nevertheless very loyal to Caribou, proven when he and the rest of their crew made the journey to a Marine base in order to rescue him. Even after Caribou abandoned him at the said Marine base, Coribou still remained loyal to his brother."}, {"type": "paragraph", "text": "When Caribou hopped on board of the Sunny, Momoo, the one carrying the Caribou Pirates' ship, fled in terror at the sight of his old enemies: Nami, Luffy, and Sanji. This separated the Caribou Pirates from their captain. Shortly after this, the rest of the Caribou Pirates forced Momoo to bring them back to rescue Caribou."}, {"type": "paragraph", "text": "Unfortunately for his followers, Caribou only appears to value himself. After being freed by his crew, Caribou abandons them at the hands of the G-5 marines and flees to save himself all while showing no regret for leaving them behind, Coribou included. When Coribou reunites again with Caribou, he easily forgives him, despite the latter having left him at the mercy of the G-5 Marines. This is due to the fact that their Grandmother told them to get along no matter what and it is implied by the bandages on their heads that she punished them to do so."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "Caribou is famous for killing marines. When the Marine attempted to draw his gun, Caribou injured him with his weapon and then begged God to forgive the man for trying to kill him. He then ordered Coribou to bury the Marine alive as punishment. The crew followed Jinbe and Caribou to the G-5 Marine base. Before Commodore Yarisugi starts torturing Caribou, Coribou and the Caribou pirates come to save him. The pirates engage in battle with the G-5 Marines."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Caribou, in thinking that he joined in the real Straw Hat crew, planned to kill them from the beginning. The Caribou Pirates attacked the Straw Hats in the depths of the sea only to lose his ship and crew, allowing them to easily capture him. Caribou showed great fear of the crew's strength after he witnessed the monster trio defeat the Kraken, leading him to resort to hiding to figure out his next move."}, {"type": "paragraph", "text": "Even while hidden, Caribou still planned on killing the rest of the Straw Hats until Franky sealed him in a barrel, calling him an idiot but recognizing he would have been dangerous if not captured sooner. After the Sunny charged into Fish-Man Island to escape the New Fish-Man Pirates, Caribou's barrel somehow made its way to the Mermaid Cove where he began kidnapping mermaids, framing the crew for his actions. Later on, in his kidnapping attempt on Shirahoshi, he was found by Luffy, Zoro and Sanji before being quickly defeated."}, {"type": "paragraph", "text": "He later came across the Ryugu Kingdom's treasures and released all of the captive mermaids to take it. However, the Straw Hats were also searching for the treasure, eventually finding and defeating Caribou for it."}, {"type": "paragraph", "text": "Caribou encountered Luffy again in Wano Country, where both were imprisoned by Kaido. He offered a team-up upon learning that Luffy intends to break out but Luffy bluntly denied his request and was annoyed by his begging for help."}, {"type": "paragraph", "text": "After Raizo freed him and they spoke with Luffy, Caribou once more pleaded with him to let him join him. This time, Luffy agreed and Caribou was shocked but hastily accepted Luffy' mercy though stated that he is even more scared of him."}], "images": []}, {"title": "Fake Straw Hat Crew", "level": 4, "content": [{"type": "paragraph", "text": "The Caribou Pirates joined the Fake Straw Hat Crew, but had no intention of truly following them. Instead, Caribou planned to kill them from the inside. After discovering that the crew they joined were fakes, the Caribou Pirates buried the impostors (without Black, Cocoa, and fake Chopper, all of whom were captured) alive and then set sail, using their coated ship to follow behind the Thousand Sunny and the real Straw Hat Pirates."}], "images": []}, {"title": "Fish-Man Island", "level": 4, "content": [{"type": "paragraph", "text": "When Caribou escaped from his barrel, he kidnapped the mermaids. Figuring that he is in a treasure cove, Caribou thought that by capturing the mermaids, he could sell them for a good profit. However, he eventually changed his operation, releasing the mermaids into Ryugu Palace, but he stole all the treasure within instead. Caribou eventually received word that his crew survived and made it to port, as well as overhearing about the Ancient Weapon Poseidon being Shirahoshi. He attempted to kidnap her and meet up with his crew in the New World, but Luffy kicked him out. When Caribou woke up, he attempted again to kidnap mermaids but was defeated and captured by Jinbe. Jinbe takes him into a coated boat up to the surface and eventually turns him over to G-5 Marine Commodore Yarisugi."}], "images": []}, {"title": "Beasts Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Caribou made an enemy out of the Beasts Pirates when he defeated Scotch and destroyed one of their factories. He is later taken by X Drake as a prisoner and forced to work as a slave in Wano Country."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Gaburu's Grandmother", "level": 4, "content": [{"type": "paragraph", "text": "Caribou bears a striking resemblance to the deceased Gaburu, whose grandmother loved very much. Due to this, she initially appears to mistake the pirate for her grandson, and doted on him when she found him exhausted on the island's shore, and even defended him from attackers."}, {"type": "paragraph", "text": "At first, Caribou was true to his nature, taking advantage of the situation and robbed the old lady of her jewelry. However, he later grew fond of her and returned to rescue her from a fire in the house, showing genuine concern. When Scotch attacked, Caribou initially ran away, leaving the old woman to fend off Scotch. However, after Caribou reunited with his crew, he returned to save the old woman when Scotch was about to make an example of her. After X Drake arrived, Caribou stood between him and the old woman. Eventually, when Caribou left, the old lady thanked him for his kindness while praying to Gaburu's grave, revealing that she knew all along that he was not Gaburu."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e0/Gaburu%27s_grandmother.png/revision/latest?cb=20131211223906", "caption": "Gaburu's grandmother."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Caribou is a pirate captain reputed as a fearsome killer of Marines, who has managed to reach Sabaody Archipelago, sailing through the first half of the Grand Line. He was able to defeat several marines at Saboady Archipelago and gain the upper hand in the battle against Scotch and defeat him."}, {"type": "paragraph", "text": "Though he lacks knowledge of Haki and lacked knowledge period that anything could counter his Logia defense he has shown some degree of knowledge in other topics such as the sea creatures like the Kraken and Sea Cows, coating bubbles and the slave trade. He has also shown some degree of forethought as well, noticing when the Strawhats were going to engage in the Kraken he quickly deduced a way that would put him in the least amount of danger by informing them of a way to fight in water, and purposely hid his Logia intangibility when out numbered and escaped when he saw the situation arise."}, {"type": "paragraph", "text": "In his first appearance, he was able to detect the presence of a Marine hiding nearby who was spying on the recruits and reporting their presence to his superiors, and even noticed the Kraken before any of the Strawhats could despite their members consisting of Haki users. However, contrary to this, he later failed to notice Franky was right next to his hiding spot, looking at him; and a mermaid could walk up right behind him without him noticing."}, {"type": "paragraph", "text": "While the Fake Straw Hats saw Caribou to be a valuable asset and a terrible force to get on the wrong side of due to his fearsome reputation and abilities, none of the real Straw Hat Pirates even see him as a threat, but instead as nothing more than an annoyance. Franky stated that the reason why Caribou is no threat is due to him being an idiot but also acknowledges that he may have been a threat if he had not been apprehended quickly."}, {"type": "paragraph", "text": "Indeed, despite his Logia-class abilities, Luffy easily sent him flying out of Ryugu Palace and knocked him unconscious with one punch, showing that Caribou has low endurance, compared to Luffy's strength. He was also easily defeated with a single punch from Pekoms, who went on to claim that Caribou was overconfident just because he is a Logia-class user, which is what led to his defeat."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Caribou ate the Numa Numa no Mi, a Logia-classDevil Fruit which allows him to change his body into, and control, a swamp; he can create swamps of various size, either in his hand, such as the hand sized one he used to drown Drip, or a larger one as he did to capture a trio of mermaids. He can also use this ability to absorb most forms of attack using the swamp mass."}, {"type": "paragraph", "text": "It seems that people who step on his swamp mass can sink in it, even if its outer appearance looks shallow, similar to Blackbeard's Yami Yami no Mi. It also seems that the people who sank into his swamp and were absorbed satisfied his hunger and filled his stomach, which also acts as some form of storage space. Caribou claimed that the swamps he could produce were bottomless, thus giving him the power to store virtually everything inside his body. He uses this ability to store kidnapped mermaids and weapons. When released, the mermaids were said to be a bit groggy."}, {"type": "paragraph", "text": "A major weakness of this fruit is that, if he is in his Logia form, he is confined to his volume, as seen when Franky locked him up in a barrel and he was unable to escape."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d3/Numa_Numa_no_Mi_Infobox.png/revision/latest/scale-to-width-down/240?cb=20130526034225", "caption": "Caribou abducting some mermaids by absorbing them into his swamp."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He used some sort of spear or pole-arm to stab the Marine who was spying at the Fake Straw Hats meeting point. He was also seen wielding a flintlock pistol. During his battle with Pekoms in Fish-Man Island, he used a Gatling gun and a scythe, hiding them within the infinite space of his swamp body."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Caribou and Coribou were young children, their now deceased grandmother told the two to always stick together and love each other no matter what."}, {"type": "paragraph", "text": "At some point, Caribou ate the Numa Numa no Mi and he formed the Caribou Pirates along with his brother. They gained a fearsome reputation for killing Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Caribou_and_Coribou%27s_Grandmother.png/revision/latest/scale-to-width-down/200?cb=20150322230301", "caption": "Caribou and Coribou with their grandmother."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "Eventually, the two brothers managed to reach Sabaody Archipelago, where they allied themselves with the Fake Straw Hat Crew. In Grove 46, a marine spied on the new rookies trying to join the \"Straw Hats\". He confirmed four of them: \"Gashed\" Albion worth 92,000,000, Lip \"Service\" Doughty at 88,000,000, as well as \"Wet-haired\" Caribou and \"Blood-Splatterer\" Coribou, with bounties of 210,000,000 and 190,000,000, respectively. Caribou sneaked up on the Marine as he was making his report on a Den Den Mushi. Caribou threatened the Marine, and when the Marine reached for his gun, Caribou stabbed him with a spear. Coribou started digging a grave in which to bury the Marine alive."}, {"type": "paragraph", "text": "Fake Luffy ordered Caribou stop and then announced that the crew was to go after the real Straw Hat Pirates because of their disrespect. He planned to make an example of one of the culprits, the real Monkey D. Luffy, but the Marines surrounded the pirates and blocked all entrances and exits. Fake Luffy ordered Caribou and Coribou to use the captured Marine as a hostage to open a path for them, but Caribou refused and killed the Marine for lying about calling for reinforcements. Fake Luffy was angered that Caribou did not obey his orders, while the real Luffy was confused as to why everyone was calling him boss. The pirates and the marines then engaged each other in a battle. The pirates' morale quickly declined when the Pacifistas suddenly appeared. "}, {"type": "paragraph", "text": "He and his old crew then launched an attack. In the ensuing battle, fake Luffy was exposed as a fraud and captured, while the real Luffy was revealed to those present."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Caribou_Sees_a_Marine_on_Sabaody.png/revision/latest/scale-to-width-down/210?cb=20141206210557", "caption": "Caribou uncovers a Marine spy."}]}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Despite all the other recruits being captured, Caribou, his brother, and the rest of their crew managed to escape, even capturing the remainder of the Fake Straw Hat counterparts (without Cocoa and Nora Gitsune) along the way. He had his crew dig graves for the fakes to be buried alive in."}, {"type": "paragraph", "text": "Caribou revealed that he never intended to follow the Straw Hats, having planned to first gain their trust and then kill them from the inside. After that, refusing to listen to the fakes' pleas for mercy, Caribou picked up the fake Sanji and started to suffocate him with his Devil Fruit power. Fake Sogeking then tried to shoot him, but his body absorbed the shot. Caribou eagerly ordered his crew to bury the fakes and happily stated that he was able to confirm the real Straw Hat Luffy."}, {"type": "paragraph", "text": "He is seen in the ocean on his coated ship, following the real Straw Hats, commenting that they had better let him join this time."}, {"type": "paragraph", "text": "With their seacow, the Caribou Pirates eventually catch up with the Straw Hats' ship and they prepare for battle. Caribou is the first to set foot on the Thousand Sunny. Before his crew can follow, his sea-cow, which turns out to be Momoo fled in fear after seeing Nami, Sanji, and Luffy taking the rest of the Caribou Pirates and leaving Caribou behind. Once Caribou sees that he is left alone, he begs the Straw Hat crew to have mercy on him. After the Straw Hats tie him up, Caribou decides to bide his time and wait for the right opportunity."}, {"type": "paragraph", "text": "When they travel to the deep currents and encounter a sea monster known as the Kraken, Caribou urged the Straw Hats to turn back, but Luffy decides to tame it much to Caribou's shock. Caribou is nervous and is thinking to himself on how crazy the Straw Hats are for not retreating. As he sees Coribou and the other Caribou pirates come to save him, Caribou rejoices only to be let down when the ship is destroyed by the Kraken. He screams in fear with Nami, Brook, Chopper, and Usopp. He then grieves shortly about his crew and scolds Zoro when he says that his crew resemble jellyfish."}, {"type": "paragraph", "text": "In an effort to stop the Monster Trio from endangering the Sunny, and him, he gives Luffy, Sanji, and Zoro a way to fight the Kraken. He informs the Straw Hats about flutter kick coating, which is coating oneself to make a diving suit. When Usopp questions his method, Caribou states that he warned the Straw Hats to run from the beginning. After Luffy, Zoro, and Sanji defeated the Kraken, Caribou was surprised."}, {"type": "paragraph", "text": "After the crew entered the Deep Sea, Caribou seemingly vanishes. Brook is the first to notice his absence as he noticed the rope used to tie him up laying on the ground with no prisoner. He was hiding in a barrel on the ship and was reformulating his plan to kill the Straw Hats, concluding that the best time to do it would be the instant they arrive at Fish-Man Island."}, {"type": "paragraph", "text": "Franky finds him and promptly starts sealing the barrel with ropes and metal plates so that he could not escape even if he turned into his liquid form. He begs Franky to let him out, agreeing to be his slave and calling him \"Master Bikini Pants.\" Caribou is still trapped in the barrel as the Straw Hats escaped the eruption of an undersea volcano and arrived at Fish-Man Island."}, {"type": "paragraph", "text": "After the ship flew through the bubble surrounding Fish-Man Island, it fell into a current and the crew gets separated. Caribou's barrel floats in with Luffy, Sanji, Chopper, and Usopp. The barrel eventually makes its way to Mermaid Cove where the four Straw Hats relax and have fun with the mermaids. Two mermaids observe the barrel, noticing that it has been sealed tight, and wonders what was inside. Out of curiosity, they suggest opening it while Caribou remains silent. After Sanji suffered a near-fatal nosebleed and was taken away by the Straw Hats, Ishilly, Fillonce, and another mermaid start opening the barrel. Ishilly is prying off the metal holds off of Caribou's barrel with a crowbar, wondering what is inside it."}, {"type": "paragraph", "text": "She thinks the barrel is sealed so tightly because it contains high-end expensive alcohol. She gets some of the holds off, which is enough to allow Caribou to break out. As Caribou breaks out, he thanks the mermaids. The terrified mermaids scream and Caribou tells them not to go anywhere. Ishilly yells for everyone to get into the water, but Caribou says that it is too late and turns his midsection into his Logia form, thanking Ishilly for freeing him once more. One mermaid yells out that her body is sinking, while another one realizes it is a swamp and asks why there is a swamp in the middle of the rocks."}, {"type": "paragraph", "text": "Caribou says that they are in a bottomless bog that is impossible to escape from. He tells them he is a \"swamp man\" who ate the Numa Numa no Mi. He then tells them that struggling will cause them to sink more and that they shouldn't scream or worry as he will not kill them. Ishilly tries to call for help but Caribou covers her mouth with one of his hands in swamp form, calling her naughty for not doing as she was told. Another mermaid calls out for Ishilly, but Caribou does the same to her, telling her she has to \"go sleepy-bye\" for a bit. The last things seen above the swamp are the sinking hands of one of the mermaids."}, {"type": "paragraph", "text": "Caribou then reverts back to his human form, talking about how his body is infinite and forgetting how much mermaids cost. He remembers that at the Human Auctioning House, they would sell for about 70,000,000 each and gets excited when he realizes how much he could get with three of them. He then realizes that he owes all of this to the Straw Hat Pirates. Their illegal entry made it so that he would not have to be subjected to any kind of immigration examination. He is now free to hunt as many mermaids as he wants, calling it a \"treasure island\", and then laughs happily."}, {"type": "paragraph", "text": "His actions indirectly led the citizens of Fish-Man Island to turn against the Straw Hats, who are the likely suspects, since the fish-men and merfolk are completely unaware of Caribou's presence. While the Straw Hats are taking the heat of the accusations, Caribou kidnaps two more mermaids from the south beach."}, {"type": "paragraph", "text": "Caribou is later seen at Coral Hill hiding in the shadows when Princess Shirahoshi was shown out in the open. After gazing at the princess and seeing her size will bring a much bigger profit than the normal-sized mermaids, Caribou sets his sights on kidnapping her."}, {"type": "paragraph", "text": "By the time Hody Jones and Vander Decken IX were defeated, Caribou snuck into the Ryugu Palace and released the mermaids he kidnapped. He stole all the treasures in the palace including the national treasure, the Tamatebako."}, {"type": "paragraph", "text": "Caribou remained hidden in the palace while the royal family and the Straw Hats were having a feast. He is later seen eavesdropping on Neptune and Robin. By listening in on their conversation, he learns of Shirahoshi's value as the Poseidon of her generation, further escalating his desire to ensnare her. The monster trio finds Caribou in the process of kidnapping Shirahoshi and Luffy proceeds to kick him from the tower. After hearing from Neptune that Caribou stole the treasure, he tells Nami that he will give it to them as a reward for saving his country if they can get it back. After Nami finds out that Luffy had kicked Caribou out of the tower, she sends Luffy, Zoro, and Sanji after him so she can have the treasure."}, {"type": "paragraph", "text": "The group finds Caribou, and Zoro is disappointed that Luffy's punch was all that was needed to defeat him. The three of them are excited to see how much treasure spilled out of Caribou's body."}, {"type": "paragraph", "text": "Caribou wakes up and realizes that all the treasure he stole is gone. He says that if he brings back the princess and the treasure, then he could get on a certain person's good side. He then sees a crowd of people by Tamago and Pekoms, who are carrying three large bags. Caribou realizes they must have the treasure. He charges at them, demanding the treasure back. Pekoms recognizes him and looks him up in a book. A gatling gun extends from Caribou's stomach and he shoots at Pekoms. Pekoms is knocked over but when the dust clears, he is seen hidden inside a tortoise shell. Caribou realizes he must be a Zoan. He charges at Pekoms with a scythe. Pekoms strikes Caribou with a single Haki-imbued punch, shattering the scythe and sending Caribou flying. Pekoms afterwards, mentions that the downfall of a Logia is its own pride of invincibility. Pekoms and Tamago then leave."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/Caribou_Smothers_Drip.png/revision/latest/scale-to-width-down/250?cb=20141206220905", "caption": "Caribou smothers Drip (fake Sanji)."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4b/Peek-Caribou.png/revision/latest/scale-to-width-down/230?cb=20130901185543", "caption": "Franky finds Caribou inside a barrel."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Caribou_Abducts_Ishilly.png/revision/latest/scale-to-width-down/260?cb=20130918122116", "caption": "Caribou abducting Ishilly in his liquid form."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dd/Caribou_Attempts_to_Capture_Shirahoshi.png/revision/latest/scale-to-width-down/250?cb=20130521161247", "caption": "Caribou tries to abduct Shirahoshi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/08/Pekoms_Hits_Caribou.png/revision/latest/scale-to-width-down/240?cb=20171109160746", "caption": "Pekoms strikes Caribou with Haki."}]}, {"title": "Caribou's Kehihihihi in the New World", "level": 3, "content": [{"type": "paragraph", "text": "Sometime after the Straw Hats leave, Caribou regains consciousness and goes on another mermaid kidnapping spree.Jinbe later puts a stop to him by punching him in the face. Jinbe then places Caribou into a barrel and takes him away from Fish-Man Island while riding a coated boat to the surface. En route to the surface with Jinbe, Coribou appears with a newly built ship to pick up his brother. Jinbe then steps out of the boat and pulls it far away from the Caribou Pirates' ship. Jinbe and Caribou later arrive at the G-5 Marine Base. Jinbe departs, leaving Caribou at the mercy of the G-5 Marines and Commodore Yarisugi, who are already plotting how to torture him."}, {"type": "paragraph", "text": "When the Marines are about to burn Caribou at the stake, Coribou and the crew arrive at the base and Caribou calls out to them to save him. After the stake starts to burn, Caribou is seen screaming while his crew battles the G-5 Marines. Coribou then cuts down the burning stake and saves Caribou. After his crew are defeated by the G-5 Marines, Caribou abandons them and flees on the Caribou Pirates' ship, showing no remorse in doing so."}, {"type": "paragraph", "text": "The ship later on gets caught up in huge waves, so he is forced to escape on a life boat. Having barely escaped with his life from the sea, he arrives on an unknown island, the same island where X Drake encountered Kaido's cyborg subordinates. Having passed out upon arriving, after he woke up there was an old lady beside him. While the old lady was sleeping, Caribou starts stealing her possessions."}, {"type": "paragraph", "text": "The old lady who nursed Caribou back to health gives him a box of meat pies, and tells him the way to the harbor. On the way to the harbor, some men call out, \"Commander Gaburu\". These men are later chased away by the old lady that looked after him, much to Caribou's surprise. She then sends Caribou off to the port, but instead of leaving the island, he returns only to find the same men looking for him. Later, in Logia form, he sneaks into a weapons factory. Going out again, he find out that \"Commander Gaburu\" is a Revolutionist and his men are trying to put on a rebellion on the island. Caribou then witnessed one of Kaido's subordinates, Scotch, attack the revolutionaries."}, {"type": "paragraph", "text": "After the revolutionaries were wiped out, Caribou returned to the old woman's house, which was in flames. Caribou found the old woman lying on the floor with a photo beside her. He then took a look at the photo and discovered that Gaburu is the old lady's grandson. The old lady then regains consciousness and tells Caribou to run away while thinking that the man is Gaburu. Caribou then encounters Scotch as he attacks the house and knocks the old woman away. As the old woman prepares to fight Scotch, Caribou flees."}, {"type": "paragraph", "text": "Once Caribou reached the port, he saw that his crew, who had apparently escaped the G-5 base, arrived on a G-5 ship. Coribou quickly hugged his brother because of what his grandmother used to say, that no matter what happens, the family must always be united."}, {"type": "paragraph", "text": "When Scotch is about to make an example out of Gaburu's grandmother, Caribou (while posing as Gaburu) and his crew arrive on the scene on the Marine ship. The Caribou Pirates attack Scotch to free the old woman and the defeated revolutionaries. Caribou gets the upper hand in his fight against Scotch using his swamp body to choke him."}, {"type": "paragraph", "text": "Caribou later uses his swamp powers to destroy the factory. After the factory's destruction, his crew and the revolutionaries celebrated as Caribou was hailed as a hero. The celebration was cut short as X Drake appeared and attacked Caribou. After defeating him, his crew, and the revolutionaries, he dragged Caribou away as the commander of the opposition. As Caribou was being dragged away, Gaburu's grandmother gave him her last meat pie. Holding it in hand, he tearfully waved from Drake's ship to his brother, his crew, and the revolutionaries, as it sailed away from the island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/04/Jinbe_Punches_Caribou.png/revision/latest/scale-to-width-down/200?cb=20130622184922", "caption": "Caribou got punched by Jinbe."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Caribou_Leaves_G-5.png/revision/latest/scale-to-width-down/180?cb=20130812085850", "caption": "Caribou escapes Yarisugi, who caught Coribou."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c6/Caribou_Defeats_Scotch.png/revision/latest/scale-to-width-down/182?cb=20150322022803", "caption": "Caribou defeats Scotch."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/X_Drake_Drags_Caribou_Away.png/revision/latest/scale-to-width-down/182?cb=20140605114326", "caption": "X. Drake drags away Caribou"}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Caribou was later imprisoned in the Udon region of Wano Country. There, he witnessed Luffy and Kid's confrontation with the deputy warden."}, {"type": "paragraph", "text": "After that event, he tried to talk to Luffy with the intention of allying and escaping from the prison, but Luffy rejected him, telling Caribou to go ally with Kid. Caribou began to tell Luffy about the rumors of how Kid lost an arm, until Kid appeared and interrupted him. Caribou got scared on the spot as Luffy and Kid argued over who would defeat Kaido."}, {"type": "paragraph", "text": "Later, he was released from his cuffs by Raizo. Caribou hid Raizo inside his body and went up to the ring where Luffy and Hyogoro were. Caribou told Luffy that he wanted to become his subordinate, promising that he had changed and would be good with him. When Luffy quickly accepted his help, he was surprised."}, {"type": "paragraph", "text": "During the night, Caribou and Raizo stole Queen's o-shiruko supply and fed it to Luffy and Hyogoro. The next day, Caribou and Raizo hid in the shadows and noted that Luffy and Hyogoro were obviously going to stand out after eating too much food."}, {"type": "paragraph", "text": "Caribou later told Raizo how Wano Country's communication network operates and helped him disable Udon's communications. After the prison takeover, Caribou commented on how well it went and expressed eagerness for the day of the decisive battle against Kaido."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/Caribou_presses_Luffy.png/revision/latest/scale-to-width-down/200?cb=20181224020042", "caption": "Caribou presses Luffy to ally with him."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Caribou Pirates vs. Marines (past battles; numerous times)", "elements": []}, {"text": "Fake Straw Hat Crew and new recruits vs. Marines ", "elements": []}, {"text": "Caribou vs. Fake Straw Hat Crew", "elements": []}, {"text": "Caribou vs. Monkey D. Luffy", "elements": []}, {"text": "Caribou vs. Pekoms", "elements": []}, {"text": "Caribou vs. Jinbe", "elements": []}, {"text": "Caribou Pirates vs. Scotch", "elements": []}, {"text": "Caribou vs. X Drake", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Caribou\" is another word for reindeer (which is referenced on his ship's figurehead).", "elements": []}, {"text": "Caribou is the first new Devil Fruit user and first Logia type user to be revealed after the timeskip, as well as the second known Super Rookie with the powers of a Logia Devil Fruit, the first being Ace.", "elements": [{"text": "He is also the first Logia user Luffy defeats using Busoshoku Haki, whereas he to defeat previous ones using a specefic element that counteracts the Logia's power (Ex: Crocodile through liquid and Enel through rubber).", "elements": []}]}]}], "images": []}]}