{"sections": [{"title": "Take", "level": 1, "content": [{"type": "paragraph", "text": "Take is a carp Fish-Man and is a member of the Arlong Pirates. He is the commander of parties."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Take is a Carp fish-man with light blue skin, long black hair, red lips, bags under his eyes, and a pink fin on the back of his head. He also has a hooked nose and sharp teeth. The tattoo on his forehead is the kanji for \"love\" (恋, koi). This is a pun since love pronounced in Japanese is \"koi\" and so is the word for \"carp\". He also has another tattoo on his chest of an arrow with two swirls. He wears a blueish-purple shirt with yellow wavy lines and green on the end of the sleeves, and a blue sash around his waist."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Take does not respect the Marines and laughed their attempt to stop Arlong."}, {"type": "paragraph", "text": "In the anime, Take has a distinct style of laughing: “Gahohoho”."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being a Fish-Man, Take has incredible mobility underwater as well as the ability to stay submerged for as long as he desires. Like his entire race, he is also much stronger than an average human being. Despite these advantages, he is actually quite weak in comparison to strong adversaries such as the Straw Hat Pirates, especially when he and his crewmates were swept aside easily when Monkey D. Luffy swung Momoo around."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Eight years ago, Take came along with the rest of the Arlong Pirates to take over Conomi Islands."}], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Pudding Pudding and his subordinates arrived at the Conomi Islands to arrest Arlong, Hatchan, Chew and Kuroobi offered to take care of them. Take and Shioyaki commented that the Marines would be surprised and overwhelmed by the three Officers. Their prediction was correct; the Officers quickly defeated the Marines and sunk their ship."}, {"type": "paragraph", "text": "Later, when the Straw Hat Pirates attacked Arlong Park, Take and his comrades were taken out early when Luffy swung Momoo around, thrashing everyone around the area. He and his crew was eventually arrested by the Marines."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Arlong Pirates vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Take appears in Episode 33 while Arlong is interrogating Usopp. However, this is before the scene that corresponds with his first canon appearance. In Episode 34, he and Shioyaki witness Arlong catch and destroy a cannonball with his teeth. Both were impressed by the display."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 75 (p. 12) and Episode 34, Take makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 75 and Episode 33, Take watches as Arlong interrogates Usopp.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Take's name and occupation is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Take's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 34, In the anime, Take and Shioyaki react to Arlong catching a cannonball in his jaws.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 10 Chapter 82 (p. 16-17), Luffy defeats Momoo and most of the Arlong Pirates.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 492 (p. 13) and Episode 387, Hatchan mentions Arlong and the crew's fate.", "elements": []}, {"text": "↑  One Piece Anime — Episode 33, In the anime, Take appears when Arlong interrogates Usopp.", "elements": []}]}], "images": []}]}