{"sections": [{"title": "Kaneshiro", "level": 1, "content": [{"type": "paragraph", "text": "Kaneshiro is the shipwright of the Arlong Pirates and a goldfish fish-man. He was previously a member of the Sun Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kaneshiro is a Goldfish fish-man, with light pink skin, and two big blue fins on the side of his head. The tattoos on his head and his chest is the kanji for \"gold\" (金, kin), but this may simply be referring to goldfish . He has a sun mark on his left arm signifying he was a member of the Sun Pirates. He sports an orange, open shirt, with circles on it, and white pants, with a light purple sash. He also has a tiny yellow hat on the top of his head."}, {"type": "paragraph", "text": "When he and his crew first invaded the Conomi Islands, he wore a dark-colored hat, a short-sleeved shirt covered in the kanji for \"gold\" (金, kin), sandals and a small, dark-colored cape. He also wore striped pants that only extended a little bit past his knees with frills around the waist and cuffs. These shorter pants reveal another tattoo on the side of his left leg that says “THE GOLD FISH.”"}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1d/Kaneshiro_10_Years_Ago.png/revision/latest/scale-to-width-down/130?cb=20190201134349", "caption": "Kaneshiro when his crew invaded the Conomi Islands 10 years ago."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kaneshiro was confused after Usopp shot Arlong and announced himself to the fish-man crew."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kaneshiro, as a shipwright, is capable of fixing and building ships. As a fish-man, Kaneshiro is several times stronger than an average human. However, while he is strong, Kaneshiro is a lackey when compared to the stronger members of Arlong's crew."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "When Kanshiro charged at the Straw Hat Pirates, he wielded a short knife. However, he was defeated before he could use it."}, {"type": "paragraph", "text": "When his crew invaded the Conomi Islands, Kaneshiro carried a long sabre on his left hip, though he has never been seen using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Kaneshiro was once part of the Sun Pirates, but, after Tiger died and the crew split up, he joined Arlong and several other fish-men on his quest to set up a Fish-Man Empire in East Blue."}, {"type": "paragraph", "text": "When the Arlong Pirates invaded the Conomi Islands, Kaneshiro joined his crew to stand guard while Arlong on the crew’s Officers collected from the villagers of Cocoyasi Village. The crew built Arlong Park and ruled over the islands’ villagers."}], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Arlong Pirates’ eight years of rule over the island, Kaneshiro, while accompanying Arlong on one of his excursions, witnessed Usopp shoot Arlong. Kaneshiro was confused when Usopp announced himself, mishearing the sniper’s name."}, {"type": "paragraph", "text": "After this little incident, several events happened leading up to a battle at Arlong Park between the Arlong Pirates and the Straw Hat Pirates. After Hatchan called Momoo to confront the pirates, Kaneshiro, Shioyaki, and their fellow crewmates charged at the Straw Hat crew. They were all were taken out by Luffy when the captain grabbed Momoo by the horns and used him to club them."}, {"type": "paragraph", "text": "Though Kaneshiro's captain and three other of his crew mates were able to avoid the attack, they were eventually defeated by the Straw Hats. With his fellow crew mates defeated, Kaneshiro and the rest of them were delivered to the Marines and sent to prison."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Arlong_Pirates_Charge_the_Straw_Hat_Pirates.png/revision/latest/scale-to-width-down/250?cb=20190201135020", "caption": "Kaneshiro, Shioyaki, and the other Arlong Pirates charge at the Straw Hat Pirates."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Arlong Pirates vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In Episode 33, members of the Arlong Pirates carry Arlong through the forest back to Arlong Park. However, Arlong breaks free from their grip with rage, recalling his hatred toward Usopp. Kaneshiro and Pisaro, having both been knocked on the ground, cower in fear of Arlong’s anger. After Arlong collects himself, the group returns to Arlong Park. This scene occurs between Arlong’s encounter with Usopp in Gosa Village and when he finds his crew defeated by Zoro at Arlong Park."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kaneshiro (金城, kaneshiro) means \"gold city\"; the 'gold' part may be referring to his goldfish species.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 72 and Episode 31, Kaneshiro makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 78 (p. 2) and Episode 35, Kaneshiro's sun mark can be seen while he is standing guard.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Kaneshiro's name and occupation is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Kaneshiro's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 10 Chapter 82 (p. 13-17), Kaneshiro and the other subordinate members of the Arlong Pirates are defeated by Monkey D. Luffy.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 492 (p. 13) and Episode 387, Hatchan mentions Arlong and the crew's fate.", "elements": []}, {"text": "↑  One Piece Anime — Episode 33, An extra scene of Kaneshiro and Pisaro cowering in fear of Arlong is added in the anime.", "elements": []}]}], "images": []}]}