{"sections": [{"title": "Turco", "level": 1, "content": [{"type": "paragraph", "text": "Turco was a member of the Fake Straw Hat Crew who masqueraded as Franky."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Turco is a tall, skinny man with a long neck, thick lips and no visible chin. He wears a flowered shirt and a blue haircut similar to the real Franky of two years before the present, but has no resemblance to the pirate after he remodeled himself. He wears sunglasses similar to Franky's, and is seen smoking a cigarette. While the real Franky always wears a swim briefs and keeps his shirt open, Turco is seen wearing regular pants and has his shirt buttoned up and brown shoes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Turco, as a member of the Fake Straw Hats, uses the reputation of the real crew to intimidate others. He was oddly dismissive of Usopp despite being hit by one of his attacks at the time. Upon the truth coming out, he was discovered to be very cowardly, begging Caribou for mercy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "It seemed that his task within the Fake Straw Hat Crew was to keep track of information, such as who they have recruited. Turco was never seen fighting or wielding a weapon, though he seems to have at least some endurance as he was able to stand up after being attacked by Usopp's carnivorous plants and being struck by Nami's massive lightning bolt attack, albeit wounded. He has a weak will as he easily fainted from Luffy's Haki. Typical for a fraud, he is very weak as he was easily brought to his knees by the Caribou Pirates. Despite being weak, he also has some knowledge of Devil Fruits as shown as when he quickly recognized that Caribou has a Logia Devil Fruit, when he absorbed a cannonball."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Sometime in the past, he was recruited by Demaro Black to join the Fake Straw Hat Crew, due to his physical similarities to the real Franky."}], "images": []}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "Turco was first seen in charge of taking down the names of the pirate crews who wanted to join the Fake Straw Hat's ranks. When his crew advanced on Nami for rejecting their invitation, they were attacked by a large carnivorous plant created by Usopp's Pop Greens. He was then seen being surprised that Usopp was the man Nami was waiting for, just before their crew was struck by a massive lighting bolt created by Nami."}, {"type": "paragraph", "text": "Turco is later seen watching his captain, Demaro Black (the fake Luffy), accidentally shoot a couple he mistook for Usopp and Nami and then being knocked over by the real Monkey D. Luffy. When Fake Luffy tries to shoot the real Luffy, Turco and the other imposter Straw Hats present with him are subdued by the real Luffy's Haki."}, {"type": "paragraph", "text": "He is soon woken up by Manjaro (the fake Zoro) and Drip (the fake Sanji). He shivers from the after-effects of Luffy's Haki. He is then seen in Grove 46 with the other Imposter Straw Hats as Fake Luffy gives his speech to their new recruits."}, {"type": "paragraph", "text": "When Demaro Black was found out to be a fake he was seen running away with the rest of the crew out of fear of being beaten up by the recruits. When the real Luffy is revealed he starts foaming at the mouth due to shock."}, {"type": "paragraph", "text": "Turco and the other Fake Straw Hats (save Black, Cocoa, and Gitsune) somehow escaped the battle but are being held captive by Caribou and Coribou. The fakes beg for their lives as Coribou prepares to bury them alive."}, {"type": "paragraph", "text": "As Caribou and his crew later disembarked to hunt down the real Straw Hats, Turco's current status is unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8e/Fake_Straw_Hats_Begging.png/revision/latest/scale-to-width-down/210?cb=20130726070024", "caption": "Turco, along with the remaining Fake Straw Hats, begging for their lives."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Turco, Mounblutain, Chocolat and Demaro Black vs. Usopp and Nami", "elements": []}, {"text": "Turco, Mounblutain, Chocolat and Demaro Black vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 517, Turco makes his debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Turco's information is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 108), His name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 603 and Episode 523, Fake Franky begs for mercy upon being busted.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 599 and Episode 518, Luffy's Haki easily knocked out the fake Franky.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 598 and Episode 517, Fake Franky is shown for the first time.", "elements": []}]}], "images": []}]}