{"sections": [{"title": "Mounblutain", "level": 1, "content": [{"type": "paragraph", "text": "Mounblutain was a member of the Fake Straw Hat Crew who masqueraded as Sogeking."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mounblutain is a very large man, much taller and rounder than the real Sogeking. He wears a mask which resembles that of the real Sogeking but larger and more exaggerated, and does not completely cover his face, as the real one should. The long nose is also part of the mask and the horns are straighter and rounder than the original mask (which was wavy and flat)."}, {"type": "paragraph", "text": "He wears striped pants and a dark red cape, similar to Sogeking's, and a plain shirt. He also wears brown boots and a yellow sash for a belt. He has large, curly hair similar to Sogeking's, as well as a thick beard. Underneath the mask reveals his real face to be wide, with thick lips, a relatively flat nose, and round teeth."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1b/Mounblutain_with_Sogeking_Mask_On.png/revision/latest/scale-to-width-down/220?cb=20130208151129", "caption": "Mounblutain wearing his Sogeking mask."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mounblutain is almost always laughing or smiling. Like the other members of the Fake Straw Hats, he uses the name of the real Straw Hats to instill fear in those around him. Upon the truth coming out, he was discovered to be very cowardly, begging Caribou for mercy. He is surprisingly noble, as he was the only one who attacked Caribou in order to save Drip (Fake Sanji), even with the knowledge that he was a Devil Fruit user with a 210,000,000 bounty on his head."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Mounblutain seems to have at least some endurance, as he was able to stand up after being attacked by carnivorous plants and a massive lighting bolt, although visibly wounded. He also has some strength as was strong enough to pick up Chocolat after passing out in the bar and could lift a large bazooka without much strain. He has a weak will as he easily fainted from Luffy's Haki. Typical for a fraud, he is very weak as he was easily brought to his knees by the Caribou Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He has been seen using a flintlock pistol, and later a bazooka. Unlike Sogeking, he does not appear to have much skill as a marksman, as he missed the targets he was aiming for at close range (though the closing door blocked his shot)"}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was first seen with Fake Luffy, Fake Franky and Fake Nami in a bar, trying to recruit new members. When Nami spurned his captains invitation to the crew, he commented that the man Nami was waiting for would cry and apologize once he saw Fake Luffy. As his crew advanced on Nami, he was caught in the plants that sprouted from Usopp's Pop Greens. He was then hit by the lightning strike from Nami's thunder clouds."}, {"type": "paragraph", "text": "Later he is shown watching as Fake Luffy sarcastically apologizes for accidentally shooting the wrong people, and later as his captain is accidentally knocked down by the real Luffy. When Fake Luffy attempts to shoot the real Luffy, Fake Sogeking and the other fake Straw Hats are quickly subdued by the real Luffy's Haki."}, {"type": "paragraph", "text": "He is soon woken up by Fake Zoro and Fake Sanji. He shivers from the after-effects of Luffy's Haki. He is then seen in Grove 46 with the other Fake Straw Hats as Fake Luffy gives a speech to their new recruits."}, {"type": "paragraph", "text": "When Demaro Black was found out to be a fake he was seen running away with the rest of the crew out of fear of being beaten up by the recruits. When the real Luffy is revealed he, Fake Sanji, Fake Nami, Fake Franky and Fake Zoro start foaming at the mouth due to shock."}, {"type": "paragraph", "text": "Mounblutain and the other Fake Straw Hats (sans Black, Cocoa, and Fake Chopper) somehow escaped the battle but are being held captive by Caribou and Coribou. The fakes beg for their lives as Coribou prepares to bury them alive. Caribou starts to suffocate Fake Sanji with his Devil Fruit powers. Fake Sogeking tries to stop Caribou with a bazooka but fails, and one of Caribou's men struck him on the back of his head for this attempt knocking him out."}, {"type": "paragraph", "text": "As Caribou and his crew later disembarked to hunt down the real Straw Hats, Mounblutain's status is unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8e/Fake_Straw_Hats_Begging.png/revision/latest/scale-to-width-down/210?cb=20130726070024", "caption": "Mounblutain, along with the remaining Fake Straw Hats, begging for their lives."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mounblutain, Chocolat, Demaro Black and Turco vs. Usopp and Nami", "elements": []}]}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "list", "elements": [{"text": "Mounblutain is shown during the One Piece Premier Show 2012 as a member of the Fake Straw Hat Crew.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Manjaro_Mounblutain_Premiere_Show.png/revision/latest/scale-to-width-down/210?cb=20130128003243", "caption": "Manjaro and Mounblutain as they appear in the show."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 517, Fake Sogeking is shown for the first time.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Mounblutain's information is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 108), His name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 603 and Episode 523, Fake Sogeking's real face is seen as he is begging for mercy.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 599 and Episode 518, Fake Sogeking falls to Luffy's Haoshoku Haki.", "elements": []}]}], "images": []}]}