{"sections": [{"title": "Nora Gitsune", "level": 1, "content": [{"type": "paragraph", "text": "Nora Gitsune is a fox who filled the role of the \"pet\" for the Fake Straw Hat Crew, who did not know that the real Chopper is the crew's doctor and is given human-traits by the Hito Hito no Mi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Nora Gitsune is a light brown fox with black legs. He has a curled mustache and a chain-leash around his neck. He also wears a hat similar to Chopper's, but without the 'X' mark on the front."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "While the real Chopper is sweet and gentle, Gitsune seems to be very aggressive, as he bit Cocoa after she kicked him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Gitsune bit Cocoa's head, and was able to hang on with its teeth, so it presumably has a strong bite with the strength of a normal fox."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was seen being led around by the fake Robin. After seeing the real Chopper, the false counterparts of Sanji and Zoro planned to capture him and discard the fake one, in hope of looking more credible as the real crew. Upon being kicked away by the Fake Robin, Nora Gitsune furiously bit her head in retaliation, and sternly refused to let go, even after being taken along with her as she was captured by some unknown men."}], "images": []}, {"title": "Other Appearance", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "paragraph", "text": "Nora Gitsune is shown during the One Piece Premier Show 2012 as a member of the Fake Straw Hat Crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/37/Fake_Robin_Premiere.png/revision/latest/scale-to-width-down/210?cb=20140916102921", "caption": "Cocoa and Nora Gitsune as they appear in the show."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Nora Gitsune is similar in appearance with the fox that appeared on the cover page of Chapter 232.", "elements": []}, {"text": "His name means \"Stray Fox\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 518, Fake Chopper makes his debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Nora Gitsune's information is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 108), Its name is revealed.", "elements": []}]}], "images": []}]}