{"sections": [{"title": "Shioyaki", "level": 1, "content": [{"type": "paragraph", "text": "Shioyaki is a salmon Fish-Man and a member of the Arlong Pirates and the head of banquets."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Shioyaki is a salmon Fish-Man. He has pink skin, and a fin on the top of his head along with wavy brown hair. He has a black wave tattoo on his forehead. He wears a dark green shirt with a red flower design on it, a blue wrap around his lower body, tan pants, and brown sandals. He also has hair on his forearms."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shioyaki does not think much of the Marines compared to his high opinion of his crewmates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being a Fish-Man, he has incredible mobility underwater as well as the ability to stay submerged for as long as he desires. Like all of his race, he is also much stronger than an average human being. Despite these advantages, he is weak in comparison to strong adversaries such as the Straw Hat Pirates, especially when he was swept aside easily when Luffy swung Momoo around."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Arlong left the Sun Pirates to build his own crew, Shioyaki joined in on the reign of terror that ruled Conomi Islands for eight years."}], "images": []}, {"title": "Arlong Park Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Pudding Pudding and his subordinates arrived at the Conomi Islands to arrest Arlong, Hatchan, Chew and Kuroobi offered to take care of them. Shioyaki and Take commented that the Marines would be surprised and overwhelmed by the three Officers. Their prediction was correct; the Officers quickly defeated the Marines and sunk their ship."}, {"type": "paragraph", "text": "When Momoo arrived to fight to the Straw Hat Pirates per Hatchan’s command, Shioyaki, Kaneshiro and their fellow fish-man followed the sea cow’s lead, rushing to attack the pirates. They were defeated when Luffy grabbed and swung Momoo around by his horns, knocking them all out. After the battle, Shioyaki and the rest of the defeated fish-men were apprehended by the Marines to be imprisoned."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Arlong_Pirates_Charge_the_Straw_Hat_Pirates.png/revision/latest/scale-to-width-down/250?cb=20190201135020", "caption": "Shioyaki, Kaneshiro, and the other Arlong Pirates charge at the Straw Hat Pirates."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Arlong Pirates vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Diffferences", "level": 2, "content": [{"type": "paragraph", "text": "Shioyaki appeared in Episode 33 alongside Arlong when the Fish-Man captain discovered that Zoro defeated his subordinates. Later, when Hatchan realized that Zoro was the person who defeated his peers, Shioyaki was shocked at Hatchan’s absentmindedness. In Episode 34, he and Take witnessed Arlong catch and destroy a cannonball with his teeth. Both were impressed by the display."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Shioyaki (塩焼き, Shioyaki) means \"broiled with salt\", a common method of preparing salmon in Japan.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 75 (p. 12) and Episode 33, Shioyaki makes his debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Shioyaki's name and occupation is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Shioyaki's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 10 Chapter 82 (p. 9-18) and Episode 38, Luffy defeats Momoo and Arlong's subordinates at the same time.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 492 (p. 13) and Episode 387, Hatchan mentions Arlong and the crew's fate.", "elements": []}, {"text": "↑  One Piece Anime — Episode 33, In the anime, Shioyaki appears when Arlong interrogates Usopp.", "elements": []}, {"text": "↑  One Piece Anime — Episode 34, In the anime, Shioyaki and Take react to Arlong catching a cannonball in his jaws.", "elements": []}]}], "images": []}]}