{"sections": [{"title": "Ryu", "level": 1, "content": [{"type": "paragraph", "text": "Grandpa Ryu was the name of the Sennenryu that traveled with the Straw Hat Pirates (along with Apis) during the Warship Island Arc."}, {"type": "paragraph", "text": "Ryu was a very old and weakened dragon; so much so that he could no longer fly. He was sometimes somewhat senile and tried to eat both Luffy and Usopp thinking they were food."}, {"type": "paragraph", "text": "For some strange reason, Luffy was able to understand what Ryu was saying and relayed his last message to Apis."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ryu is an old gray dragon with green feathers on his back and wings."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He was friendly to others around him, as displayed when Apis tried to look out for him. He was also caring as he showed concern as Eric threw Apis off him and injured her."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a dragon Ryu could fly free anywhere he desired, however due to his age, he was no longer able to fly."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time in the past, Ryu was stranded on Warship Island and had forgotten where the nesting grounds of the Sennenryu where."}, {"type": "paragraph", "text": "He eventually met Apis, who was able to communicate with him through the power she received by eating the Hiso Hiso no Mi. She would go on to keep his existence a secret, even after getting captured by the Marines under Commodore Nelson Royale."}], "images": []}, {"title": "Warship Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Luffy discovered that Ryu wanted to return to the nesting grounds of the dragons, he promised to take him back to Lost Island."}, {"type": "paragraph", "text": "Around the same time, Eric and Lieutenant Commander Hardy had made it onto the island in search of Apis. Upon seeing him, they swiftly attack; however, Ryu was able to escape Warship Island with the help of the Straw Hats."}, {"type": "paragraph", "text": "While on the sea, Ryu remembers that \"Lost Island\" was to the east of Warship Island thanks to Luffy dropping a steaming hot pot of food on his head. Once they make it onto the island, they discover a mural at the ruins at the top of the island. Upon seeing this mural, Ryu quickly recalls that the dragon's nest was actually back on Warship Island."}, {"type": "paragraph", "text": "On their way back, they are pursued by Eric and are confronted by Nelson's fleet. At one point, Eric held Apis hostage, but after Apis bit him, he threw her off, injuring her. Seeing as how Apis was injured, Ryu finally got up and knocked Eric into the ocean. He then recalled his happy memories with Apis and roared to the sky, giving out a sound so loud that he rumbled the eardrums of the Marines around them. Immediately after, Ryu flew into the air and, upon being fired at by Nelson, flew straight at his flagship. He was, however, met with even heavier fire, and collapsed onto the ocean surface as a result."}, {"type": "paragraph", "text": "Shortly, the island below them began to rise and Ryu called out to the Sennenryu that it was \"time\". Hearing the call, the dragons all fly towards him, but Ryu passes away soon afterwards. Before he dies, he gives Luffy a final message for Apis. At the time of his death, he told Luffy that he had fulfilled his \"wish\"."}, {"type": "paragraph", "text": "His body ended up on the Lost Island when it rose out of the ocean, and Apis tearfully mourned the loss of her dragon friend. However, Luffy told Apis that Ryu had been lost and lonely until he met her, and this last year of his life was the happiest one he had enjoyed after he met her."}, {"type": "paragraph", "text": "Though Ryu was gone, Apis discovered a dragon egg nearby, which hatched into a newborn dragon. The newborn appeared to be Ryu, reincarnated, sharing the same eyes as him. Apis sobbed heavily with relief when she saw the memory of her beloved Grandpa Ryu live on."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/db/Baby_ryu.png/revision/latest/scale-to-width-down/190?cb=20120625190204", "caption": "Ryu after being reborn."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Belly", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Anime — Episode 55, Ryu makes his debut.", "elements": []}, {"text": "↑  One Piece Anime — Episode 57, Ryu remembers that the nesting ground are back at Warship Island.", "elements": []}, {"text": "↑  One Piece Anime — Episode 59, Ryu falls into the ocean.", "elements": []}, {"text": "↑  One Piece Anime — Episode 60, Ryu calls out the Sennenryu.", "elements": []}]}], "images": []}]}