{"sections": [{"title": "Cocoa", "level": 1, "content": [{"type": "paragraph", "text": "Cocoa was a member of the Fake Straw Hat Crew who impersonated Nico Robin."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Unlike the real Robin, Cocoa is a very short and plain woman. She has a similar hairstyle to Robin's (before the timeskip). Her nose is flat, similar to Robin's, but wider between the eyes, and longer. Cocoa wears a plain dark purple dress, carries a purse and bright red high heels. Fake Luffy has asserted her to be the closest in appearance to her duplicate out of the crew; in spite of this, Cocoa has virtually no resemblance to Robin."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Compared to the real Robin, Cocoa is not very bright as she apparently did not take into account the dangers of impersonating someone who has many enemies. However, she is more intelligent than Black, as she quickly identified Chopper. She also appears to be a very cruel woman as shown when she brutally kicked Nora Gitsune away after deciding to discard him. She did show a kinder side by offering Chopper food and offering to take him in. Although it is unclear how loyal she was, she supported Black and his dream of becoming Pirate King despite knowing she was just being used as an asset."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "She is responsible for taking care of Nora Gitsune and temporarily Chopper. Her purse appears to be full of vegetables such as cucumbers. Cocoa seems to have a certain degree of pain tolerance, as she didn't even flinch when Nora Gitsune bit her, though it might have been a sign of obliviousness."}, {"type": "paragraph", "text": "Being a terrible fraud, she was easily captured."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "Cocoa is first seen on Sabaody Archipelago with Fake Zoro, Fake Sanji, and Fake Chopper. When they spot the real Chopper, she kicks away the Fake Chopper and offers him a cucumber, while the angry Fake Chopper bites her head. Suddenly, men in black suits, mistaking her for the real Robin, throw her in a bag along with Fake Chopper and kidnap them."}, {"type": "paragraph", "text": "Fake Zoro and Sanji report this to Fake Luffy, who uses her real name, Cocoa, only to quickly correct himself, just dismisses her loss as bad luck. This drives away the real Chopper, who had advocated her rescue. Cocoa's capture indirectly helps the real Robin elude her pursuers. Chopper was on his way to rescue her, but abandons the quest when he ran into the real Usopp and Nami and learns that the kidnapped \"Robin\" is a fake."}, {"type": "paragraph", "text": "It is currently unknown what the men in black suits have done with her at this time, or if they have even realized she is a fake."}, {"type": "paragraph", "text": "During the Zou Arc, it is revealed that the Revolutionary Army had heard the rumors of Robin's capture on Sabaody Archipelago, initially unaware that it was Cocoa who was captured while she was impersonating her. Dragon and the Revolutionaries were worried if these rumors were true, but after returning to Baltigo following Doflamingo's defeat, Koala reported to Dragon that the rumors were false and the real Robin is safe."}], "images": []}, {"title": "Other Appearance", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "list", "elements": [{"text": "Cocoa is shown during the One Piece Premier Show 2012 as a member of the Fake Straw Hat Crew.", "elements": []}, {"text": "Cocoa and Chocolat appear in chapter two of One Piece Party.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/37/Fake_Robin_Premiere.png/revision/latest/scale-to-width-down/210?cb=20140916102921", "caption": "Cocoa and Nora Gitsune as they appear in the show."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 518, Cocoa makes her debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Cocoa's information is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 599 and Episode 518, Cocoa appears.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 599 and Episode 518, Demaro Black gives fake Robin's real name.", "elements": []}]}], "images": []}]}