{"sections": [{"title": "Palms", "level": 1, "content": [{"type": "paragraph", "text": "Palms is an infamous New World pirate who worked under the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Palms is a slim man with curly black hair and black circles around his eyes, which make him resemble a panda, his overall animal theme. On his head and shoulders he has an indument apparently made of panda fur, with the animal's head on his own as a head-covering. He wears a pair of shoulder pads secured by straps that run diagonally across his bare muscular chest, and dons long, striped gloves, almost reaching to his shoulders. Around his waist he seems to have yet another indument made of fur, but this one is spotted similarly to a leopard's."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Palms_full_appearance.png/revision/latest/scale-to-width-down/120?cb=20171105234355", "caption": "Palms' full appearance."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Palms' personality. However, since like his fellow subordinate captains he refers to Whitebeard as \"Father\", and came to Marineford in order to save Ace, it might be assumed that he has a strong bond with the Whitebeard Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Palms is a fearsome pirate who has managed to make an infamous reputation in the New World, eventually becoming a subordinate of the Whitebeard Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Palms_Battle.png/revision/latest/scale-to-width-down/120?cb=20130118223011", "caption": "Palms charging at Marines with his sword drawn."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Palms carries around a long, curved sword whose hilt looks exactly like three bamboo shoots, a design which also appears on his ship. It might be assumed that he is proficient in its use."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Palms became an infamous pirate in the New World, becoming a subordinate of Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Palms and his crew joined forces with the Whitebeard Pirates to save him. He was seen attacking the Marines out of the bay with his fellow allies, and later when the Pacifistas appeared on the battlefield, he wondered what kind of things they really were. He managed to enter the plaza on Whitebeard's secret ship thanks to Little Oars Jr. and was seen jumping from the boat to join the Whitebeard Commanders."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Palms%27s_Ship.png/revision/latest/scale-to-width-down/100?cb=20190121171339", "caption": "Palms' ship."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended Whitebeard's and Ace's funeral on an undisclosed island somewhere in the New World."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Under unknown circumstances, Palms encountered Edward Weevil and got into an argument. However, this small argument resulted in his defeat at the hands of Weevil. The news of his defeat was seen on Kizaru's desk."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Palms vs. Edward Weevil (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, he is among the news reports of those defeated, alongside the reports of Elmy, Ramba, Whitey Bay, Bizarre, A.O, and the Decalvan Brothers."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He is the third panda-themed character seen in One Piece.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 470, Palms makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 133), Palms' birthday is given.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 363), Palms's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 553, Palms charges at the Marines while carrying a sword.", "elements": []}, {"text": "↑  One Piece Anime — Episode 751, Palms's news report on Kizaru's desk.", "elements": []}]}], "images": []}]}