{"sections": [{"title": "Brook", "level": 1, "content": [{"type": "paragraph", "text": "\"Soul King\" Brook is the musician of the Straw Hat Pirates."}, {"type": "paragraph", "text": "He is a skeleton that the Straw Hats found on board of a ghost ship after drifting into the Florian Triangle for 50 years. He is a Devil Fruit user who ate the Yomi Yomi no Mi, and is undead, having been brought back into a pseudo-immortal state because of its powers. His dream is to, after sailing around the world, reunite with his old friend, Laboon, at Reverse Mountain, where he resides with Crocus."}, {"type": "paragraph", "text": "He is the ninth member of the Straw Hat crew, and the eighth to join Luffy's crew, as well as being the oldest member of the crew and the second tallest member on board after Jinbe. He is also one of the two swordsmen onboard their current ship, with the other being Roronoa Zoro. He fills the role of the long-awaited musician that Luffy had wanted for his crew ever since his journey began."}, {"type": "paragraph", "text": "He currently has a bounty of 83,000,000."}], "images": []}, {"title": "Appearance", "level": 2, "content": [], "images": []}, {"title": "Before Death", "level": 3, "content": [{"type": "paragraph", "text": "Before his death, Brook was a tall, tan, skinny man who had a rather distinctive face. He had a slight goatee on his chin and some side burns. He typically wore shades never revealing his eyes. On his forehead was a scar that slightly resembles a diagonal omega sign (Ω). This scar was retained in his skeletal state as a distinctive crack across his skull. Brook's facial appearance, accompanied with his style of clothing, resembles a type of appearance and style that is commonly associated with various music artists such as Ozzy Osbourne, Jimi Hendrix, Slash, and other musical celebrities with similar features."}], "images": []}, {"title": "Before the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Brook is an extremely tall skeleton dressed in formal attire complete with top hat and cane. Standing at 266 cm (8'8½\") in height, he is the second tallest member of the Straw Hat crew, having been edged out by Jinbe. Despite having no skin, he still has an afro which he says is because his hair has very strong roots. Brook's style was that of a gentleman consisting of a coat, top hat, trousers and afro, which were black, while the inner linings of his coat were yellow-orange. The cravat that was tied in between his coat and around his neck was blue. The outer covering of Brook's cane sword which he carries was purple. Also, due to his many years of seclusion his clothes were somewhat tattered."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "He has now changed to more colorful and high-end clothes, as though to represent a rock star. He has heart-shaped sunglasses, a yellow feather boa, a top hat with a giant crown on the brim and orange red trousers with a floral design. Despite being a skeleton, he grew to 277 cm (9'1\")."}, {"type": "paragraph", "text": "During the Punk Hazard Arc, he wore a flashy striped coat, after taking it from a member of Brownbeard's Centaur Patrol Unit."}, {"type": "paragraph", "text": "During the Dressrosa Arc, he wore a dark magenta long-coat with an upturned collar in addition to yellow pants. While shown on Zou during this arc, his second outfit consisted of a pink shirt with a white polka dot pattern (which resemble the circles on the SMILE fruits), orange and yellow striped trousers, and pointed dark colored shoes. He also donned his original pre-timeskip top hat, a blue bead necklace, and he swapped his heart shaped sunglasses for a more traditional black pair."}, {"type": "paragraph", "text": "During the Zou Arc, he added a dark colored coat with a fluffy lining to his second Dressrosa outfit along with a larger top hat embellished with beads. Due to being chased and chewed on by his canine Mink admirers, his coat had become somewhat tattered by the time he met up with Luffy's group."}, {"type": "paragraph", "text": "During the Whole Cake Island Arc, he wore a long, fancy overcoat with puffy sleeves and tall black boots. He also wrapped a decorative scarf around his head and donned a pair of plain black shades. Later on, after the Big Mom pirates stripped him of his clothes, he wore a simple sleeveless cloak with a rope tied around the neck to fasten it. When meeting with the Fire Tank Pirates, he dons a large fedora, a black and red striped vest along with a dark shirt, yellow ascot, and brown trousers. When he took part in the operation to ruin Big Mom's Tea Party, Brook disguised himself among the Luffy clones created by Charlotte Brûlée's powers by wearing a over sized Luffy mask and hat tied with a string, which got him close enough to destroy Carmel's photo.  "}, {"type": "paragraph", "text": "During the Wano Country Arc, Kin'emon used his ability to change Brook's appearance so he could blend in with the country. Brook now wears a pure white kimono, with triangle-shaped headband and two arrows stuck in his body - an appearance befitting of a ghost, as Kurozumi Orochi's Oniwabanshu members mistake him as a gosho-dokuro."}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Shikomizue — Wikipedia article about the type of sword Brook uses.", "elements": []}, {"text": "Skeleton — Wikipedia article about skeletons in general.", "elements": []}, {"text": "Human Skeleton — Wikipedia article about the human skeleton.", "elements": []}, {"text": "Skeleton (undead) — Wikipedia article about animated skeletons.", "elements": []}, {"text": "Skeleton — Monstropedia article about animated skeletons.", "elements": []}, {"text": "Gentleman — Wikipedia article about the gentleman concept.", "elements": []}, {"text": "Slash — Wikipedia article about the real-life musician Brook resembles.", "elements": []}]}], "images": []}]}