{"sections": [{"title": "Kirin Lion", "level": 1, "content": [{"type": "paragraph", "text": "Kirin Lion was the former Animal King on the Crown Island who appeared in the third One Piece movie."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kirin Lion was a giant Lion-Qilin hybrid animal with large, golden gilded horns on his forehead and an orangish fur."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kirin Lion seemed to be a kind and caring ruler, as he rescued the human child Mobambi and raised him as one of his own."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kirin Lion was the former king of Crown Island, and had control over the entire kingdom. His gilded horns were part of a legend that whoever ate them would become powerful. They practically become beast like with the same horns reproduced on their head."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Chopper’s Kingdom on the Island of Strange Animals", "level": 3, "content": [{"type": "paragraph", "text": "When Mobambi washed ashore to the island, Kirin Lion took him in and raised Mobambi as one of his own. He personally nursed Mobambi back to health and he licked the boy's wounds. Mobambi regards Kirin Lion as a father figure. He died prior to the beginning of the third movie."}, {"type": "paragraph", "text": "Near the end of the movie, Battler found and ate the horns, becoming a powerful monster. However, Battler was quickly defeated by Chopper and Luffy when the latter broke his horns, depriving him of the powers gained by eating the horns. Kirin Lion's position as ruler of Crown Island was then succeeded by Mobambi."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A Kirin is the Japanese word for \"Qilin\", a mythological chimerical creature. It is also the Japanese word for \"giraffe\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Movie 3, Kirin Lion is introduced.", "elements": []}]}], "images": []}]}