{"sections": [{"title": "Albion", "level": 1, "content": [{"type": "paragraph", "text": "\"Gashed\" Albion is one of the rookie pirates who joined the Fake Straw Hat Crew. He has a bounty of 92,000,000."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Albion is a pale man with a large, ovular head that is wrapped in bandages, like most of his body, from his forehead to his scalp, with his face only occupying the lowest part of his head. He has a long black ponytail on the back of his head, growing out from under the bandages, and wears a captain's coat. Around his neck is what appears to be a shirt collar with two buttons that have \"A\" on them, along with a red and maroon striped tie around his neck. He also has a dark yellow sash around his waist."}, {"type": "paragraph", "text": "He has three thin daggers on his right hip and is also seen carrying a sword in his left hand."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9a/Albion_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20181002015122", "caption": "Albion's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Albion seemed calm when Caribou attacked the Marines but appeared annoyed by his attitude. Albion appears to be among the many others who were easily fooled by Fake Straw Hats' charade. Still, his desire to have his name known throughout the seas may have contributed to his decision to join Demaro Black's crew, as he did not question the dubious credibility of the fake Straw Hats. He quickly became angered upon realizing that his \"boss\" was a fake weakling, accusing the latter of taking advantage of the real Luffy, whom everyone thought to be dead, all the while considering Black to be a \"random piece of trash worth a mere 26 million\". As Sentomaru put it, Albion and the rest of the recruits were stupid for being so easily duped by the frauds."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about his abilities. It can be assumed that he is rather strong since he was able to make it all the way to Sabaody Archipelago. He was also able to escape Sentomaru's platoon, when most of the other recruits were apprehended."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Albion%27s_Weapons.png/revision/latest/scale-to-width-down/210?cb=20141206082721", "caption": "Albion's weapons during the reunion with the Fake Straw Hats."}]}, {"title": "Weapons", "level": 4, "content": [{"type": "paragraph", "text": "He has at least four bladed weapons, so it might be assumed that he is a swordsman. He is seen holding three daggers between the fingers on his right hand and using them like claws, similar to Buggy's knife-combat style. He uses a curved sword in his left hand."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "He arrived at Sabaody Archipelago around the same time as the Straw Hats' reunion. While there, he joined the Fake Straw Hat Crew. He was seen at Grove 46 with the rest of the pirates who had joined the Fake Straw Hat Crew."}, {"type": "paragraph", "text": "When Sentomaru came with two Pacifistas to the gathering place of the fake Straw Hats, he noticed them and commented with an \"Oh boy\" after Caribou instigated a fight by killing a Marine. When Sentomaru revealed that Demaro Black had impersonated the real Luffy and deceived the pirates, Albion became angry, saying that he and his crew were about to be used by some faker."}, {"type": "paragraph", "text": "It was stated by Sentomaru that all the recruits of the Fake Straw Hat Crew except for the Caribou Pirates were captured. However, Albion somehow avoided being captured."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 600 and Episode 519, Albion makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 23), Albion's birthday is given.", "elements": []}, {"text": "↑  Eternal Log, Albion's wanted poster is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 601 and Episode 521, Albion angry at Black's deception.", "elements": []}, {"text": "↑  Eternal Log, Lip Doughty's poster is marked as captured while Albion's is not.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 601 and Episode 521, Albion notices Sentomaru and the Pacifistas, and later becomes angry at Black's deception.", "elements": []}]}], "images": []}]}