{"sections": [{"title": "Elmy", "level": 1, "content": [{"type": "paragraph", "text": "Elmy is an infamous New World pirate captain who allied with the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Elmy is an elderly woman. She has a large mass of long, curly red hair with a small hat on top of it. She wears large amounts of dark purple eyeliner around her eyes. She has pinkish-red lipstick around her mouth, which has several teeth missing. She wears an elaborate pearl necklace just below several folds in her neck. She also wears long bejeweled earrings and a ring on each finger of at least her right hand. She wears a purple blouse."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Elmy's personality other than that she is very loyal to Whitebeard since she was willing to risk her own life to save Ace from execution."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Her abilities have yet to be seen. It can be assumed that she is considerably strong since she was able to make a name for herself in the New World and become a subordinate of Whitebeard."}, {"type": "paragraph", "text": "She appears to be a swordswoman, wielding at least one cutlass."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "She is an old pirate lady who sailed and fought a lot of battles in the New World for years. At some point during her life, she was able to become Whitebeard's subordinate."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, she and forty two other captains joined the Whitebeard Pirates in fighting against the Marines in order to rescue Ace from execution."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "She, along with the rest of the crew, attended Whitebeard's and Ace's funeral on an undisclosed island somewhere in the New World."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Under unknown circumstances, Elmy encountered Edward Weevil and got into an argument. However, this small argument resulted in her defeat at the hands of Weevil. The news of her defeat was seen on Kizaru's desk."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Elmy vs. Edward Weevil (unseen)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "In Chapter 561, Elmy can be seen fighting against Admiral Kizaru alongside some kind of large earth golem. It is unknown if it is part of her powers, or if somebody else was responsible for it. However, in the anime counterpart of the chapter, it was depicted as a very tall man with bandages wrapped around the body, similar to a mummy.", "elements": []}, {"text": "In the anime, she is among the news reports of those defeated by Edward Weevil, alongside the reports of Ramba, Whitey Bay, Bizarre, A.O, the Decalvan Brothers, and Palms.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 56 Chapter 551 and Episode 460, Elmy makes her debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 38), Elmy's birthday is given.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 337), Elmy's name is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World, Elmy's past is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 590 and Episode 505, Elmy attends Whitebeard and Ace's funeral in the New World.", "elements": []}, {"text": "↑  One Piece Anime — Episode 751, Elmy's news report on Kizaru's desk.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 561 and Episode 470, Elmy standing next to a giant humanoid.", "elements": []}]}], "images": []}]}