{"sections": [{"title": "Andre", "level": 1, "content": [{"type": "paragraph", "text": "Andre is an infamous New World pirate captain who was once a member of the Whitebeard Pirates, but then formed his own subordinate crew under Whitebeard. He is the twin brother of the Marine officer Candre."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Andre is a large man, roughly three times bigger than a normal human. He has a big body and small legs, which are relatively thin in comparison to his arms and torso. He has black curly hair and fat lips with a strong jaw."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Andre's personality, other than that he apparently has great respect towards Whitebeard, as he was willing to put his own life on the line to rescue Ace from execution."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Andre was seen fighting with his bare fists during most of the Battle of Marineford. It's only after Whitebeard ordered the pirates to go back to New World that he was seen wielding a sword fitting his size."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Crewmember in the Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "​​​​​Thirty years ago, Andre was with the Whitebeard Pirates when they arrived for the first time at Wano Country. The crew was shipwrecked and, before going into the island to get supplies, they encountered Kozuki Oden, whom after a brief clash, asked Whitebeard to let him join their crew."}, {"type": "paragraph", "text": "The Whitebeard Pirates later had a feast with Oden and his retainers. Oden kept asking to join the crew, but he was turned down. Two weeks later, the Whitebeard Pirates tried to leave Wano without Oden. As they were leaving, the crew was surprised when Oden wrapped a chain around the Moby Dick's mast and got dragged with the ship. As Oden held onto the chain, Izo was also holding on to Oden and got dragged with him. After Izo was pulled up onboard, Oden accepted Whitebeard's challenge of holding onto the chain for three days before he could be accepted into the crew. For the next three days, the crew watched how Oden withstood his ordeal. When Oden had an hour left to complete the challenge, the crew started cheering for him. After Oden was accepted into the crew, the Whitebeard Pirates had adventures with him as well as Toki, whom Oden helped, and Inuarashi and Nekomamushi, who had stowed away on the Moby Dick."}], "images": []}, {"title": "Rise to Infamy", "level": 4, "content": [{"type": "paragraph", "text": "Andre later formed his own crew and became a known pirate in the New World, but still allied himself with the Whitebeard Pirates."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Andre and his crew joined forces with the Whitebeard Pirates to save him. After Portgas D. Ace told Monkey D. Luffy to go back home, he was seen fighting Marines to advance in the plaza. When Ace was freed, he rejoiced with the others. After Ace died and Whitebeard gave his last order, he told pirates to hurry up and to leave the battlefield. He was seen confronting Admiral Akainu with Crocodile and some of the Whitebeard Commanders. He seen with another captain after Shanks arrived at Marineford, concerned with Luffy's safety on board of the Heart Pirates' submarine when Kizaru shot at it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Whitebeard%27s_Subordinates_at_Marineford.png/revision/latest/scale-to-width-down/250?cb=20130703222535", "caption": "Andre in Marineford"}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended Whitebeard's and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and allies vs. Marines and Shichibukai", "elements": [{"text": "Andre, Crocodile, and Whitebeard commanders (minus Ace, Thatch, and Jozu) vs. Admiral Akainu", "elements": []}]}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In an SBS, a fan asked if Andre's and his twin brother Candre's names were a reference to Yōsui Inoue, a musician who debuted under the stage name Andre Candre and wore an afro at the time. Oda confirmed it and also says that he gave him the name Andre because he thought the character looked like the famous pro wrestler André the Giant and that there wasn't much thought behind it.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 558 and Episode 479, Andre makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 963 (p. 14-15), Andre is shown as a member in the Whitebeard Pirates thirty years ago.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 24), Andre's birthday is given.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 337), Andre's name is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 70, Andre is revealed to have a twin brother named Candre.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 964.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 575 and Episode 484.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 580 and Episode 489, Andre confronts Akainu with Crocodile and the Whitebeard commanders.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 590 and Episode 505, Andre attends Whitebeard and Ace's funeral.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 71, Is this referencing Inoue Yousui-san from around his debut over 40 years ago?", "elements": []}]}], "images": []}]}