{"sections": [{"title": "Wallem", "level": 1, "content": [{"type": "paragraph", "text": "Wallem is an infamous New World pirate who allied himself with the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Wallem is a man with a hat and a red pirate captain coat. He has long dark hair and a mustache with a goatee. He is seen wielding a sword."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Wallem_full.png/revision/latest/scale-to-width-down/150?cb=20130224135059", "caption": "A sketch of Wallem."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Wallem put his own life on the line to rescue Ace from execution and was concerned when the Marines tried to execute him ahead of schedule. He was overjoyed when Luffy saved Ace, cheering with his fellow allies."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Wallem is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to make an alliance with the Whitebeard Pirates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Wallem wielded a sword and a gun during the war."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Wallem became a known pirate in the New World, and allied himself with the Whitebeard Pirates."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Wallem and his crew joined forces with the Whitebeard Pirates to save him. Wallem and Brew noticed that the Marines were preparing to execute Ace ahead of schedule and became concerned."}, {"type": "paragraph", "text": "Later, Wallem and his fellow allies cheered for Luffy, as he successfully saved Ace from being executed. After Akainu killed Ace and Jinbe rescued Luffy, Wallem watched in surprise as Crocodile assisted them and ordered Whitebeard's men to catch them."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Wallem, along with the rest of the Whitebeard Pirates' allies, attended Whitebeard's and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their allies vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Wallem may have been named after the Norwegian Olympic sailor Nordahl Wallem.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 561 (p. 14) and Episode 470, Wallem and Brew watch the Marines prepare Ace's execution.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 362), Wallem's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 572 (p. 2) and Episode 481, Wallem and his allies cheer for Luffy after he freed Ace.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 578 (p. 13) and Episode 487, Wallem watches Crocodile help Jinbe and Luffy flee from Akainu.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 590 (p. 8-9) and Episode 505, The Whitebeard Pirates and their allies attend Whitebeard and Ace's funeral in the New World.", "elements": []}]}], "images": []}]}