{"sections": [{"title": "Rush", "level": 1, "content": [{"type": "paragraph", "text": "Rush is an infamous New World pirate who allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rush is a man with long blonde hair that wears a horned hat. He wears a jacket that has white spirals on the jacket's yellow sleeves. He is also seen smoking a cigarette."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Rush's personality, other than that he apparently has great respect towards Whitebeard, as he was willing to risk his own life trying to rescue Ace from execution."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Rush is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to make an alliance with Whitebeard. He also wields a sword and has shown that he could destroy a Pacifista with the help of other pirate captains."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time in the past, Rush became an infamous pirate in the New World and allied himself with Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Rush and his crew joined forces with the Whitebeard Pirates to save him."}, {"type": "paragraph", "text": "While Ace was shouting at Luffy, Rush, Andre and Ninth charged into the bay to save Ace.."}, {"type": "paragraph", "text": "Later, after Squard had stabbed Whitebeard, Rush listened on as Squard claimed that the forty-three subordinate captains had been betrayed and sold out to the Marines."}, {"type": "paragraph", "text": "Afterwards, when Monkey D. Garp joined the battle, Rush teamed up with Elmy, Pavlik, Arthur and another pirate to take down a Pacifista."}, {"type": "paragraph", "text": "Eventually, Ace was freed and the Whitebeard allied forces prepared to retreat under the orders of Whitebeard. However, before they could escape, Ace was struck by Akainu's attack. Rush and other subordinate captains then encircled Ace and Luffy as Ace said his dying words."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/38/Whitebeard_Allies_vs._Pacifistas.png/revision/latest/scale-to-width-down/180?cb=20140801114005", "caption": "Rush with Elmy, Choi and Pavlik facing a Pacifista."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, alongside the rest of the crew, attended Whitebeard's and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their allies vs. the Marines and Shichibukai", "elements": [{"text": "Rush, Pavlik, Elmy, Arthur and an unknown pirate vs. Pacifistas", "elements": []}]}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Although Rush makes multiple appearances in the manga, he does not appear at all in the anime. This is most likely due to an oversight by the anime creators."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 57 Chapter 558, Rush makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 362), Rush's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 58 Chapter 563, Rush listens to Squard's explanation.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 58 Chapter 568, Rush and other captains attack a Pacifista.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 574, Rush and other captains protect the dying Ace.", "elements": []}]}], "images": []}]}