{"sections": [{"title": "Hangan", "level": 1, "content": [{"type": "paragraph", "text": "Hangan is an infamous New World pirate who allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hangan is a man with an abnormally long neck, and blue-grey hair. His cheekbones are square, along with parts of his forehead. He sports a dark coat with a white fur lined hood. He also has a black cowboy hat, and a spotted shirt under his coat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ef/Hangan_full.png/revision/latest/scale-to-width-down/150?cb=20130305144626", "caption": "Sketch of Hangan."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "His personality is not known, but he seems to care about Ace as he was willing to risk his life to save him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Hangan is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to make an alliance with Whitebeard. It is still unknown what abilities and weapons he possess."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Hangan became an infamous pirate in the New World and allied himself with Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Hangan and his crew joined forces with the Whitebeard Pirates to save him."}, {"type": "paragraph", "text": "After Little Oars Jr. opened up a path, he stood alongside Reforte and Arthur as he ordered the allied forces to charge into the bay."}, {"type": "paragraph", "text": "Later in the battle when Akainu killed Portgas D. Ace, he was standing around Monkey D. Luffy and Ace with Ramba and Choi."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their allies vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 556 and Episode 465, Hangan makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 361), Hangan's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 556, Hangan orders the pirates to charge into the bay.", "elements": []}]}], "images": []}]}