{"sections": [{"title": "Hogback", "level": 1, "content": [{"type": "paragraph", "text": "Dr. Hogback is a world-renowned surgeon who entered the employment of Gecko Moria and assisted him in creating his undead army. He was one of the Mysterious Four and one of the major antagonists of the Thriller Bark Saga."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Despite his round torso, Hogback has very thin arms and legs. His somewhat long nose resembles a beak or knife, and he has notably sharp and long canine teeth and ears. His face has a scar in the shape of a semi-circle that goes above his eyes and connects both corners of his mouth, which is usually grinning widely, and he keeps his black hair slicked back. On the left side of his neck is a black tattoo consisting of two slashes connected to two swirls lying side-by-side on his shoulder. Hogback wears a fishnet vest, purple leather pants, a thick black tie, and a pair of purple gloves, which cover his long, claw-like fingers. He also wears a white surgical mask under his chin, a pair of very small black gold-rimmed sunglasses, a violet feathery cape that is black on the inside, and a pair of purple high-heeled boots."}, {"type": "paragraph", "text": "At the time when he first met Victoria Cindry ten years prior to his encounter with the Straw Hat Pirates, Hogback wore a white double-breasted suit over an indigo shirt, gray pants, and a dark blond feathery cape; he also wore his hair with a small swirl sticking out of the front, as well as a golden bangle and pearl bracelet on his right wrist, a silver bangle and ruby-chain bracelet on his left wrist, and rings with large jewels on each index finger and his left thumb, as well as gold rings on his other fingers."}, {"type": "paragraph", "text": "When Brook confronted him five years prior to the Straw Hats' arrival on Thriller Bark, Hogback wore his present-day outfit, but had his hair arranged in a chonmage style."}, {"type": "paragraph", "text": "As a child, Hogback wore his hair in a bowl cut, with his bangs framing his face. He had round eyes and a small, normally-shaped nose and mouth. Hogback wore a simple white sweater with the word \"genius\" (天才, tensai) printed on it as well as black gloves, pants, and shoes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hogback is immensely arrogant and extremely proud of his reputation as a genius. However, despite saving the lives of numerous people with his medical knowledge and abilities, Hogback considered his patients an annoyance that he had to put up with for the sake of the money they provided, and viewed the doctors who could not help his patients themselves as morons. His views on being a doctor contrast sharply with those of Tony Tony Chopper, who believes that a true doctor must save all patients no matter what, which led to conflict between the two; Hogback even ridiculed Chopper for admiring him and his medical prowess, believing the young doctor was looking up to skills that only brought irritation in the form of an unending lineup of patients."}, {"type": "paragraph", "text": "Hogback believes that, with the help of Moria's power to animate corpses with shadows, he has finally managed to overcome death by bringing corpses to life, dismissing the fact that the personality of a zombie is vastly different from the one they held in life and that their wills are bound to Moria. He does not care about the fate of his undead creations and the people whose shadows were stolen to create them. Despite insisting that they are alive, Hogback has no respect for his creations, viciously abusing and humiliating the reanimated Victoria Cindry during his fight with Chopper and Nico Robin just to prove a point."}, {"type": "paragraph", "text": "Despite frequently ending up in humorous situations due to the actions of Cindry, Hogback can be serious at times and can plan ahead when necessary, such as when he requested control of two zombies, Jigoro and Inuppe, from Moria to use as his personal bodyguards in case he encountered the Straw Hats; however, though he used them to great effect against both Chopper and Robin, he displayed a degree of gullibility when Robin tricked him into ordering both zombies to jump out of a nearby window."}, {"type": "paragraph", "text": "Like many others, he has a unique laugh: \"Fosfosfosfos\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Thriller Bark Pirates", "level": 3, "content": [], "images": []}, {"title": "Gecko Moria", "level": 4, "content": [{"type": "paragraph", "text": "When the then-Shichibukai Gecko Moria requested Hogback's assistance in creating an army of the undead to conquer the New World, Hogback agreed on the condition that Moria would resurrect the deceased target of his infatuation, Victoria Cindry. Ever since, Hogback has considered Moria his master and helped him create his zombie army and improve the physical power of Absalom; Hogback holds Moria in high regard, having described his power as \"miraculous\", and Chopper noted that Hogback seemed to prefer committing blasphemous experiments as a pirate's scientist over saving the lives of others as a world-famous surgeon."}], "images": []}, {"title": "Victoria Cindry", "level": 4, "content": [{"type": "paragraph", "text": "Hogback was an obsessive fan of the famous actress Victoria Cindry. She was a patient to him while she was still alive, and the two shared an amicable relationship, with Cindry having happily helped sew a button back onto Hogback's shirt. After acquiring all the wealth and fame that he could as a doctor, Hogback proposed to her, only for Cindy to reject him due to already having a fiance, which broke the doctor's heart. Upon hearing that Cindry died in an accident, Hogback became so depressed that he abandoned his medical career."}, {"type": "paragraph", "text": "After allying himself with Moria, Hogback dug up Cindry's corpse and had Moria reanimate it with a shadow. However, when her revived corpse was given a different personality from when she was alive, Hogback revealed that he shallowly cared only for her physical beauty and had no use of the personality that rejected him. Despite the zombie Cindry becoming Hogback's personal servant since then, the two usually have a comedic relationship, with Cindry humiliating Hogback by serving the doctor food directly onto the table without a plate or making negative comments about his love life."}, {"type": "paragraph", "text": "However, at more serious times, Hogback still retains secondary command over her, right under Moria's, and she obeys his every whim. Despite his \"love\" for her, Hogback was not above abusing her and brutally treats her like a slave, demonstrated when he kicked her down and made her lick the floor simply to prove a point. He also ordered her to sacrifice herself to buy him time to escape and claimed that he would simply give her another shadow afterward, proving how little he cared for her even as a servant. It was only when Chopper's words about what it means to be human finally got through to Cindry that her former will returned to her and she defied Hogback's order to rescue him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Hogback%27s_Room.png/revision/latest/scale-to-width-down/210?cb=20130809023553", "caption": "Hogback's room is filled with pictures of Cindry, showing his obsession with her."}]}, {"title": "Other Zombies", "level": 4, "content": [{"type": "paragraph", "text": "Hogback views the zombies he created alongside Moria's ability as a breakthrough of medical science and a truly successful product of resurrection. Despite this, he has no respect for them, disregarding their vastly different personalities from when they were alive and their lack of free will, and treats them as slaves and disposable pawns. Additionally, he does not care about the people whom he left in misery by taking their shadows to animate his zombies."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Medical Community", "level": 4, "content": [{"type": "paragraph", "text": "Despite being a world-famous surgeon and highly respected figure in the medical community, Hogback saw his patients as nothing more than a nuisance that he had to put up with in order to earn money and fame; he did not enjoy saving their lives for their sake, especially when doing so resulted in even more patients coming to him, going as far as to mockingly mimic their pleas when explaining his past to Chopper, and viewed the other doctors who did not possess his medical prowess as incompetent and contemptuous. However, in spite of his true reasons for saving lives and misanthropic outlook on medical science, Hogback had been given all kinds of awards and statuses available to doctors, and when he disappeared, the medical community arose in a major uproar and he became legendary."}], "images": []}, {"title": "Tony Tony Chopper", "level": 4, "content": [{"type": "paragraph", "text": "Tony Tony Chopper once admired Hogback due to his legendary status of having saved countless people through \"miraculous\" operations. Despite barely knowing the man outside of reputation, Chopper defended his idol against the suspicions and doubts of Usopp and Nami, and believed Hogback's claim that his study of zombies was for healing the broken hearts of those who lost their loved ones. However, after discovering that Hogback was using his expertise for his own selfish ends and had utterly no respect for the living or dead, along with Hogback ridiculing his beliefs of what it means to be a true doctor, Chopper lost all respect for the genius surgeon, refusing to accept him as a doctor altogether, and eventually tried to smash his head in, believing that what was inside was more rotten than Hogback's zombies."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Of the Mysterious Four, Hogback is the only one with no Devil Fruit or notable combat abilities, and thus relies on the zombies he has created to fight for him. However, he does not have absolute command over them; Gecko Moria is their true master, so Hogback only has command over them if Moria permits it."}, {"type": "paragraph", "text": "When the Straw Hats began their counterattack on Thriller Bark, Hogback displayed a degree of strategic aptitude by asking Moria for control over Jigoro and Inuppe, using both to briefly overpower Nico Robin and Tony Tony Chopper; however, he was easily tricked by Robin into accidentally commanding the two zombies to jump out of the window."}], "images": []}, {"title": "Medical Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Despite his disregard for human life, Hogback is world renowned as a genius master surgeon who can perform unique operations that are described as miraculous by nature; while working as a doctor, he treated and saved the lives of the countless patients who ever came to him, bringing him incredible fame and fortune, and his skills and disappearance were never forgotten by the medical community."}, {"type": "paragraph", "text": "His tremendous surgical skills was sought out by Gecko Moria who tasked him to create the countless zombified creatures on Thriller Bark and even merge some beasts and inanimate objects together to strengthen them. He is also responsible for increasing the physical power of Absalom and Victoria Cindry, as well as modifying Oars's body with a cockpit system in the stomach for Moria to assist Oars in battle from and creating the highly durable webbing of the Spider Mice. His skills allowed him to preserve the hundreds of corpses making up the zombies serving Moria for many years in their pristine state, as Cindry and the many other zombies did not decompose despite working for Moria on Thriller Bark for up to a decade."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Genius Surgeon and the Tragic Actress", "level": 4, "content": [{"type": "paragraph", "text": "Hogback was once a genius surgeon renowned for saving countless lives through his miracle operations, given many accolades and titles available to his profession. Many patients flooded in from all over the world, pleading the genius surgeon for his services, which he only agreed for the wealth and fame; he did not perform medical practices out of charity, and found the endless lineup as a nuisance."}, {"type": "paragraph", "text": "He was also a fan of Victoria Cindry, a famous actress, for many years; however, his love for her was unrequited, as she rejected his marriage proposal due to already having a fiance. One day, ten years before Hogback encountered the Straw Hat Pirates, Cindry died in an accident, leaving Hogback so distraught that he left his profession."}, {"type": "paragraph", "text": "Shortly after this, Hogback met Gecko Moria, who promised to help him bring Cindry back to life in return for Hogback's assistance in creating his undead army. After Hogback stole Cindry's corpse, Moria used his powers to implant a shadow into it, thus creating a zombie Cindry. Since then, Hogback has worked for Moria by stitching up more bodies to be turned into zombies."}, {"type": "paragraph", "text": "With the world ignorant to the true reason behind it, Hogback's disappearance generated many rumors, such as Hogback having been kidnapped, and left the medical community in an uproar while his name became legendary."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f2/Hogback_and_Living_Cindry.png/revision/latest/scale-to-width-down/210?cb=20141206174112", "caption": "Hogback with the still-living Cindry."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Hogback_Meets_Moria%2C_Absalom_and_Perona.png/revision/latest/scale-to-width-down/210?cb=20150526221934", "caption": "Moria recruits Hogback."}]}, {"title": "A Dead Man Comes to the Island of the Dead", "level": 4, "content": [{"type": "paragraph", "text": "Five years ago, Brook was captured by Thriller Bark's trap, and Hogback used his shadow to revive the corpse of the Samurai Ryuma. Later, Brook came back and interrogated Hogback about the location of his shadow, leading Hogback to accidentally confirm that the zombies' weakness was salt."}], "images": []}, {"title": "Thriller Bark Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Nami, Usopp, and Tony Tony Chopper arrived at his mansion, Hogback greeted them and tried to stop Victoria Cindry from throwing plates at Usopp, only to fail and become exasperated. After Hogback permitted all three of them to come inside, Cindry led the Straw Hats inside and shut the door, leaving Hogback himself outside. Soon afterward, Hogback sat down for dinner with the Straw Hats, where he claimed that he was on Thriller Bark to study the zombies for the sake of one day being able to resurrect the dead himself in order to mend the broken hearts of those who have lost their loved ones. Chopper was elated by this idea and agreed to help Hogback in his research, but Hogback warned him to never enter his laboratory. As Cindry served them pudding directly onto the tablecloth, Usopp asked Hogback if he had seen a talking skeleton come through before them, prompting a nervous Hogback to confirm that he had not while mentally noting that such a thing could not be possible."}, {"type": "paragraph", "text": "Shortly afterward, Hogback met up with Absalom and Perona outside the mansion, where he asked Absalom if he was the cause of the commotion earlier before noting that tonight was going to be a big job after learning of the Straw Hats' bounties."}, {"type": "paragraph", "text": "Later, Hogback, having nearly completed his work on Zombie 741, proclaimed that it was a masterpiece before being horrified by Cindry hoping that it would fail at the last step and pouring spaghetti soup on the table. However, he was shocked when Nami, Usopp, and Chopper, who had been spying on him up until that point, were sent flying through the door by a slash from Ryuma. Angrily demanding to know what they had seen, Hogback admitted that it did not matter because the night attack meant to hunt guests on Thriller Bark was about to begin."}, {"type": "paragraph", "text": "When Nami claimed that Hogback was reviving the deceased on Thriller Bark, Hogback wondered what basis she had for this, only to be shocked when Nami revealed that they had found Cindry's obituary notice. Demanding to know how they had gotten into that room, Hogback ordered Ryuma and Cindry to drag the Straw Hats down into the shadow world before explaining Ryuma's reputation as a legendary samurai who killed a dragon. As Ryuma knocked out the Straw Hats with Hanauta Sancho: Yahazu Giri, Hogback marveled at the power of the technique while explaining its workings."}, {"type": "paragraph", "text": "After Monkey D. Luffy was captured by the Spider Mice and sent to Moria, Hogback met up with the other three members of the Mysterious Four to witness his shadow being extracted, where he commented on Luffy's power before asking Perona about the status of Nami, Usopp, and Chopper, since he had last seen them being transferred by the Risky Brothers. When Absalom demanded to know if Hogback had harmed Nami, Cindry claimed the bride would not come for him before taking advantage of Hogback's surprised reaction to say the same thing to him, shocking Hogback further. Upon noticing Luffy escaping after chewing through the steel bars of his cage, Hogback noted his reliability before watching as Luffy was captured once more and had his shadow extracted by Moria."}, {"type": "paragraph", "text": "When Moria claimed that he was now one step closer to becoming the Pirate King, Hogback noted that he had worked on Zombie 900 ever since he started working for Moria ten years ago before proclaiming that putting Luffy's shadow inside of it would create the strongest zombie in history and a great power for them to use. However, when one Spider Mouse reported the defeat of Tararan via shadow extraction, Hogback nervously pointed out to Absalom that only \"Humming\" could do this before claiming that there would only be more sacrifices while they remained in the dark. Theorizing that the situation would soon devolve into the nightmare from five years ago, Hogback wondered how the zombies' weakness had been exposed and how \"Humming\" had returned before asking Cindry why she was in front of him. Soon afterward, Hogback walked down the hall leading to Zombie 900's freezer while explaining the legendary reputation of the zombie as a powerful leader of a country of villains while alive. Claiming that this was the greatest zombie he had ever created, Hogback entered the freezer containing the corpse of Oars."}, {"type": "paragraph", "text": "After witnessing Moria make a contract with Luffy's shadow, Hogback admitted that he wished they had done the same with the shadow in Cindry so that he could eat meals on plates, only to be mortified when Cindry threatened to break his kneecaps. Watching Moria implant Luffy's shadow into Oars and Oars's subsequent awakening, Hogback ignored the appearance of Nami, Usopp, and Chopper from Kumashi while noting that Oars was a masterpiece that gave him a coercive feeling."}, {"type": "paragraph", "text": "Shortly after Oars escaped from the freezer and began exploring Thriller Bark, Moria informed Hogback that they would need better marios since they could now extract the shadows of even stronger people with Oars on their side, prompting Hogback to tell Moria to leave it to him. However, Hogback was shocked by the news that the Straw Hats who had lost their shadows had woken up and learned how to purify zombies, who were now unable to fight back. When Hogback ordered Hildon to get the General Zombies to fight them, Hildon revealed that they were attending Absalom's wedding and informed Hogback of Absalom's request for him to perform his belly dance at the party an hour from now, only for Hogback to angrily retort that he does not have time for this before demanding that Hildon stop the wedding. Hogback was interrupted by Perona, who declared that she would simply weaken the Straw Hats with her Negative Hollows so the Soldier Zombies could capture them. After assuring Moria that everything was fine after all, Hogback requested control of two zombies for protection due to Absalom being otherwise occupied."}, {"type": "paragraph", "text": "A few minutes later, Hogback and Cindry were confronted by Luffy, Chopper, and Robin, who were searching for Moria. As Hogback failed to recognize Chopper, who was in his full reindeer form at the time, Luffy began to move toward the freezer after Chopper requested that he leave Hogback to him, which prompted Hogback to have Cindry attack Luffy with plates. Shocked when Robin restrained Cindry with her powers, Hogback was further surprised to see Chopper transform into his normal form while declaring that he would no longer recognize Hogback as a doctor, but quickly regained his composure and noted that Chopper was a Zoan user before asking him to become a mario as he summoned Jigoro and Inuppe."}, {"type": "paragraph", "text": "After Jigoro and Inuppe managed to overwhelm Chopper and Robin, Hogback gloated over his victory, noting that this was proof of the zombies no longer having memories of being their crewmates and that commands are absolute for zombies, before ordering Cindry to finish off the two Straw Hats. When Chopper admitted that he had admired Hogback for his claim about researching the resurrection of the deceased for the sake of others, Hogback proclaimed that he would never go so far for others and lamented his status as a prodigy because it brought him endless annoying patients before demanding to know if Chopper intended to tell him how to be a doctor. However, Chopper denied this and pointed out how the zombies were only moving instead of being truly alive, prompting Hogback to claim that the fact that they are moving means they are alive before kicking Cindry to the ground and ordering her to lick the floor. Explaining his past with Cindry as having his marriage proposal rejected by her and resurrecting her with the help of Moria after she died, Hogback admitted that he only desired her beauty and proclaimed that she must be happy because she could live in this world again. When Chopper declared that he could not allow him to keep leaving humans in misery in order to make zombies, Hogback ordered Cindry to kill him and told Chopper and Robin that he would make them into mario. As Chopper engaged Cindry and tried to restrain her, a laughing Hogback revealed that he had increased her physical strength for combat purposes before proclaiming that this was evidence of humanity's eternal dream of resurrecting the deceased being achievable. Surprised by Chopper's declaration that humans have more freedom, Hogback ordered Jigoro and Inuppe to help Cindry by getting rid of anyone who interfered, only to be confused when they began fighting each other. After closing his mouth with her hands, Robin tricked Hogback into ordering the two zombies to jump off the tower, greatly angering him. When Chopper made clear his intent to defeat him, Hogback ordered Cindry to buy time for him to escape, only to be surprised when a tearful Cindry revealed she could not move."}, {"type": "paragraph", "text": "Berating Cindry for not obeying his command despite the fact that he is responsible for her having a soul and being able to move, Hogback was pleased when she started moving toward Chopper and Robin and began running away, only to be tackled by Chopper, whom he berated for trying to be human despite being a beast. After rebutting that Luffy did not need to make quiet corpses his subordinates like Hogback and his allies did, Chopper had Robin use Pierna Fleur to lift himself and Hogback high into the air, where Hogback began panicking about his head being hurt in a fall as Chopper prepare to suplex him. However, Chopper was prevented from doing so by Oars, who broke through the nearby mansion walls, causing Chopper to abandon his attack as Hogback and Cindry fell to the floor below. Trapped underneath a piece of rubble, Hogback ordered Cindry to rescue him and, angrily insulting her when she found herself unable to move once more, was stepped on by Oars, who did not see or hear him."}, {"type": "paragraph", "text": "After Moria's defeat, Hogback found and woke up Absalom, whom he explained the situation to, before claiming that he would not die as a loser and asking Absalom what he wanted to do."}, {"type": "paragraph", "text": "Later, the two of them left Thriller Bark on a smaller escape boat with the defeated Moria onboard. Noting that they could not find Perona, a heavily bandaged Hogback revealed that Bartholomew Kuma had come to Thriller Bark in order to inform them of Crocodile's position in the Shichibukai being filled by a man called Blackbeard, who had captured Portgas D. Ace. Hogback proclaimed that this would produce a great turnover to test and develop the age of pirates before agreeing to make a bride out of a corpse for Absalom, who insisted that he wanted a human one."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Oars_Destroys_Hogback%27s_Mansion.png/revision/latest/scale-to-width-down/210?cb=20141206182303", "caption": "Oars saves Hogback by interrupting Chopper's attack."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war ended, Hogback and Absalom rescued Moria from Doflamingo after the latter was ordered to kill him."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hogback, Victoria Cindry, Inuppe, and Jigoro vs. Tony Tony Chopper and Nico Robin", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Game Appearances", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hogback is possibly a homage to Victor Frankenstein, a famous fictional mad scientist who was also obsessed with bringing the dead back to life.", "elements": []}, {"text": "In the flashback of five years ago, Hogback wore a \"chonmage\" hairstyle.", "elements": []}, {"text": "Hogback is the only member of the Mysterious Four that does not possess a Devil Fruit power.", "elements": []}, {"text": "He is one of the few people that keep their unique laugh in the FUNimation dub.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mad Scientist – Wikipedia article about the character type.", "elements": []}, {"text": "Victor Frankenstein – Wikipedia article about the famous fictional scientist.", "elements": []}]}], "images": []}]}