{"sections": [{"title": "Brocca", "level": 1, "content": [{"type": "paragraph", "text": "Brocca is an infamous New World pirate captain who allied herself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Brocca is an overweight woman with long flowing auburn hair and a dark brown hat with white fur lining. She wears a large circular earring on her right ear and a necklace on her neck. Furthermore, she wears a shirt that is tied into a ribbon in the front, which covers her breasts, but shows off her stomach."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "From her willingness to risk her life to save Portgas D. Ace from execution, it can be deduced that Brocca highly values friendship and loyalty. Furthermore, this also highlights that Brocca is a brave and daring pirate as she was willing to lead her entire crew into battle against Marine Headquarters to save her comrade."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Brocca is a fearsome pirate who has managed to achieve an infamous reputation in the New World such that she was able to ally herself with Whitebeard."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Brocca became a renowned pirate in the New World and allied herself with Whitebeard as a subordinate captain."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Brocca and her crew joined forces with the Whitebeard Pirates in order to save him from execution. While the Marines were bracing for the arrival of the pirates, Brocca and the allied fleet of the 43 subordinate captains caught them by surprise when the fleet suddenly appeared out of nowhere just off the shores of Marineford."}, {"type": "paragraph", "text": "Some time into the battle, the Pacifistas began encircling and moving towards the pirates within the bay. In response to the unknown force behind them, Brocca questioned alongside Palms what exactly the enemy force approaching them was."}, {"type": "paragraph", "text": "At the end of the war, the Red Hair Pirates arrived and Sengoku allowed the surviving pirates to leave."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 561 (p. 15) and Episode 470, Brocca makes her debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 363), Brocca's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 56 Chapter 551 (p. 12-13), The allied fleet appears off the shores of Marineford.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 561 (p. 15) and Episode 470, Brocca and Palms watch as the Pacifistas approach.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 580 (p. 15), Sengoku calls an end to the war.", "elements": []}]}], "images": []}]}