{"sections": [{"title": "Kechatch", "level": 1, "content": [{"type": "paragraph", "text": "Kechatch is an infamous New World pirate captain who allied himself with the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kechatch is a man with long yellow hair and a pointed nose that wears a black pirate hat with a Jolly Roger on it. He also wears a black pirate coat with yellow cuffs and a yellow garment with black holes underneath."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kechatch is very loyal to Whitebeard, as he was willing to risk, not only his own life, but also the lives of his entire crew, to rescue Portgas D. Ace. Likewise, this highlights that Kechatch highly treasures friendship because he charged straight into battle upon orders to save their comrade. Furthermore, his willingness to challenge Marine Headquarters shows that he is a fearless pirate that will not back down even in the toughest of situations."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kechatch is a fearsome pirate who has managed to achieve an infamous reputation in the New World such that he was able to ally himself with Whitebeard. He was seen riding on a large dog-like creature, but it is unknown whether this beast serves as an asset in battle or if it is simply a mode of transportation."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Kechatch became a renowned pirate in the New World and allied himself with Whitebeard as a subordinate captain."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Kechatch and his crew joined forces with the Whitebeard Pirates in order to save him from execution. While the Marines were bracing for the arrival of the pirates, Kechatch and the allied fleet of the 43 subordinate captains caught them by surprise when the fleet suddenly appeared out of nowhere just off the shores of Marineford. A few moments later, the pirates received the orders to attack and, immediately following the vice admirals' entrance into battle, Kechatch charged into battle on his beast alongside several of the other subordinate captains."}, {"type": "paragraph", "text": "At the end of the war, the Red Hair Pirates arrived and Sengoku allowed the surviving pirates to leave."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name may have come from the word \"ketch\", a sailing craft with two masts.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 57 Chapter 553 (p. 13), Kechatch makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Kechatch's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 56 Chapter 551 (p. 12-13), The allied fleet appears off the shores of Marineford.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 553 (p. 13), Kechatch charges into battle with the other allied captains", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 580 (p. 15), Sengoku calls an end to the war.", "elements": []}]}], "images": []}]}