{"sections": [{"title": "Agsilly", "level": 1, "content": [{"type": "paragraph", "text": "Agsilly is a New World pirate who allied himself with the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Agsilly is a large man with tanned skin. He wears a black tricorne hat, with what seems to be a white bird on it. He also wears a grey coat, a light colored shirt, and pants that tuck into his tiny shoes."}, {"type": "paragraph", "text": "In his original sketch, he wore similar clothes, but had a much rounder head, and forearms similar to Franky's. He also had a long thick beard in his original sketch as well as the anime."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/31/Agsilly_Sketch.png/revision/latest/scale-to-width-down/130?cb=20131126101810", "caption": "A sketch of Agsilly."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He seems to be loyal to his alliance with the Whitebeard Pirates, as he was willing to fight in the war at Marineford in order to rescue Ace from execution."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He was seen fighting Marines, but his full power has not yet been shown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was present during the Whitebeard War at Marineford and, sometime in the past, allied himself with Whitebeard."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Somewhere in the New World on an unknown island, Agsilly is present along with the other pirates attending Whitebeard and Ace's funeral."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 578 and Episode 487, Agsilly makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Agsilly's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 578 and Episode 487, Agsilly is present at the war.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 590 and Episode 505, Agsilly attends Whitebeard and Ace's funeral.", "elements": []}]}], "images": []}]}