{"sections": [{"title": "Vitan", "level": 1, "content": [{"type": "paragraph", "text": "Vitan is an infamous New World pirate who allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Vitan is a cyborg with a body that appears to be made of iron or some other type of metal from the waist up. As such, his head, body, and arms are composed of metal parts, with his hands being a set of metal claws. On the other hand, the digitally colored manga shows that his neck and face also appear to be made from metal, but are skin-colored, as opposed to the metal color of his body. Furthermore, Vitan also wears a gray, possibly metal, hat and a pair of gray pants with a green sash around it."}, {"type": "paragraph", "text": "In his original sketch, Vitan had less of a robotic look, but instead appeared to be wearing some sort of garment with frills in the center."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Vitan is very loyal to Whitebeard since he was willing to risk his own life to follow the orders of the Yonko to rescue Portgas D. Ace. Likewise, this highlights that Vitan highly treasures friendship because he charged straight into battle alongside other captains to save their comrade. Furthermore, his willingness to challenge Marine Headquarters shows that he is a bold pirate that refuses to back down no matter the situation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Vitan is a fearsome pirate who has managed to achieve an infamous reputation in the New World such that he was able to ally himself with Whitebeard."}, {"type": "paragraph", "text": "Although not much is known about Vitan's combat abilities, it can be deduced from him being a cyborg that his cyborg body is capable of serving as a form of stronger defense than the average human skin. Furthermore, his robotic hands may also be an asset during combat since he was not seen charging into battle with any sort of weapon."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Vitan became a renowned pirate in the New World and allied himself with Whitebeard as a subordinate captain."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Vitan and his crew joined forces with the Whitebeard Pirates in order to save him from execution. While the Marines were bracing for the arrival of the pirates, Vitan and the allied fleet of the 43 subordinate captains caught them by surprise when the fleet suddenly appeared out of nowhere just off the shores of Marineford. A few moments later, the pirates received the orders to attack and, immediately following the vice admirals' entrance into battle, Vitan charged into battle alongside several of the other subordinate captains."}, {"type": "paragraph", "text": "At the end of the war, the Red Hair Pirates arrived and Sengoku allowed the surviving pirates to leave."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the Digitally Colored Manga, he does not have a metal colored face, but in the Vivre Card - One Piece Visual Dictionary, he is shown with a completely metal upper body.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 57 Chapter 553 (p. 13), Vitan makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Vitan's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 56 Chapter 551 (p. 12-13), The allied fleet appears off the shores of Marineford.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 553 (p. 13), Vitan charges into battle alongside the allied captains.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 580 (p. 15), Sengoku calls an end to the war.", "elements": []}]}], "images": []}]}