{"sections": [{"title": "Arthur", "level": 1, "content": [{"type": "paragraph", "text": "Arthur is an infamous New World pirate captain who allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Arthur is a man with a curly brown beard that wears a light purple turban over his hair. He wears a blue vest over a brown garment that bears a kanji character (this appears to be 長 in the manga, but seems to be 角 in his concept art.) At the bottom of his brown garment, there appear to be some sort of circular ornaments or designs. He also seems to have fairly sharp claws."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "It can be deduced from his willingness to put his life on the line to save Ace that Arthur is a person that values loyalty and friendship. Furthermore, since he was willing to take up arms against Marine Headquarters, it can be concluded that Arthur does not lack in bravery."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Arthur is a fearsome pirate who has managed to achieve an infamous reputation in the New World, so much so that he became a subordinate to Whitebeard."}, {"type": "paragraph", "text": "During the Battle of Marineford, Arthur was seen wielding a sword. Although he has not been seen wielding it in direct combat, it can be presumed that his swordsmanship is befitting of his reputation as an infamous pirate captain."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Arthurs%27_Sword.png/revision/latest/scale-to-width-down/80?cb=20130719103654", "caption": "Arthur wielding a sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Arthur became a renowned pirate in the New World and allied himself with Whitebeard as a subordinate captain."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Arthur and his crew joined forces with the Whitebeard Pirates in order to save him from execution. While the Marines were bracing for the arrival of the pirates, Arthur and the allied fleet of the 43 subordinate captains caught them by surprise when the fleet suddenly appeared out of nowhere just off the shores of Marineford."}, {"type": "paragraph", "text": "Some time into the battle, just before Whitey Bay broke down the siege wall, Arthur charged alongside Hangan and Reforte into the opening made by Little Oars Jr.. Later, after Whitebeard was injured by Squard, Arthur and Doma cheered on the Yonko as the latter revealed the Marines' scheme and ordered those that were willing to stand by him to attack."}, {"type": "paragraph", "text": "Later in the battle, Ace was fatally wounded by Akainu. While Ace and Monkey D. Luffy exchanged their last words, Arthur stood by the two and protected them from any continued attacks."}, {"type": "paragraph", "text": "Afterwards, the Red Hair Pirates arrived and Sengoku ended the war, allowing the surviving pirates to leave."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In Chapter 574, Arthur has a different design on his shirt. This design is, however, found on Kinga's shirt in his concept art. It remains unknown why the design was changed from the 長 (chō, meaning \"leader\") symbol found in Chapter 563 to the design that belongs to Kinga. However, it is possible that this was simply a mistake on Oda's part.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 556 and Episode 472, Arthur makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Arthur's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 574 (p. 9) and Episode 484, Arthur defends Luffy from Akainu.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 56 Chapter 551 (p. 12-13), The allied fleet appears off the shores of Marineford.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 563 (p. 13) and Episode 472, Arthur is seen alongside Doma when Whitebeard begins charging the Marines.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 580 (p. 15), Sengoku calls an end to the war.", "elements": []}]}], "images": []}]}