{"sections": [{"title": "Kinga", "level": 1, "content": [{"type": "paragraph", "text": "Kinga is an infamous New World pirate who was once a member of the Whitebeard Pirates before forming his own crew subordinate to Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a rather tall man with brown hair. His hair sticks up into the air. His clothes are Japanese styled and he is seen wielding a sword. He is also seen to have a mustache."}, {"type": "paragraph", "text": "In the anime, he is seen with a white coat draped over his shoulders, over his green kimono."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known of Kinga's personality, other than that he was willing to fight to save Ace."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kinga is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to make an alliance with the Whitebeard Pirates. He is seen wielding a sword, though it is not currently known how skilled he is with it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Crewmember of the Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "As early as 30 years ago, Kinga was a member of the Whitebeard Pirates. When Momonosuke was born, Kinga cheered alongside his crewmates."}], "images": []}, {"title": "Rise to Infamy", "level": 4, "content": [{"type": "paragraph", "text": "Kinga later established his own crew and became an infamous pirate himself, while remaining subordinate to Whitebeard."}], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Kinga and his crew joined forces with the Whitebeard Pirates to save him."}, {"type": "paragraph", "text": "He was first seen when Monkey D. Luffy crossed the bridge made by Inazuma to rescue Ace. He encouraged Luffy to save Ace along with Delacuaji, Hangan and Agsilly. He was later seen after Admiral Akainu burned the insides of Ace, standing behind the doctor of Whitebeard Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Fossa_Stops_Kinga.png/revision/latest/scale-to-width-down/240?cb=20110123190412", "caption": "Fossa stops Kinga from trying to help Whitebeard, knowing it was pointless."}]}, {"title": "Post War Arc", "level": 3, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended Whitebeard's and Ace's funeral on a undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their allies vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 570 and Episode 484, Kinga makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Kinga's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 965, Kinga is shown as a member of the Whitebeard Pirates decades ago.", "elements": []}]}], "images": []}]}