{"sections": [{"title": "Brew", "level": 1, "content": [{"type": "paragraph", "text": "Brew is an infamous New World pirate who allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Brew is a tall man with long flowing black hair and beard. His hair is adjusted with two arrow-like horns pointing out, and a third arrow pointing down on his forehead. His long beard is divided into five separate parts along his square jaw. He wears a blue bandanna, a shirt with a cloth on his collar, a pirate sash with pants, and a pirate coat with epaulets. Overall, Brew has a bull-like appearance, matching that of his jolly roger."}, {"type": "paragraph", "text": "Alternatively, however, there appears to be another figure that could be Brew, but with a slightly different design."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much is known about Brew's personality; however, it can be deduced from his willingness to put his life on the line to save Ace that Brew is a person that values loyalty and friendship. Furthermore, since he was willing to take up arms against Marine Headquarters, it can be concluded that Brew is both brave and bold."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Brew is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to make an alliance with Whitebeard."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Brew was seen wielding a sword during the Battle of Marineford, in which he used his sword to attack and defend against a Marine."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Brew became an infamous pirate in the New World and allied himself with Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Brew and his crew joined forces with the Whitebeard Pirates to save him."}, {"type": "paragraph", "text": "During the battle, the Marines suddenly decided to execute Ace ahead of schedule. Seeing as the Marines had finished their preparations, Brew, Wallem, and Baggaley stood in shock at the Marines plan to proceed with the execution ahead of time."}, {"type": "paragraph", "text": "Afterwards, Brew fended off an attack from a Marine while Cands was behind him preparing to attack."}, {"type": "paragraph", "text": "Later, when Jinbe was escaping with Monkey D. Luffy, telling Jinbe to jump onto his ship. However, Aokiji had frozen the water preventing any possible escape."}], "images": []}, {"title": "Post War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of his crew, attended Whitebeard's and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their allies vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Brew's ship was seen amongst the other vessels of the New World pirates allied with Whitebeard. It is a massive ship with a bull figurehead. The crew's Jolly Roger is represented on the largest sail: a bull skull with the horns pointed down, a pair of crossed bones, and fire around the sides of the head.", "elements": []}, {"text": "A character that is highly similar to Brew's concept art can be seen in both the manga and anime taking command of Brew's ship. In both, the character has Brew's signature hairstyle and similarly has black hair and a long black beard. However, at the same time, another character that possesses the same hairstyle appears in the manga and anime as well. This second \"Brew\" has neither the black hair nor the long black beard seen in the concept art, but he does have the black arrow nose that is shown in the concept art. This, however, is omitted in the anime, but clearly seen in the manga. Therefore, there are two characters that match different aspects of Brew's concept art, and as such, it was initially not possible to distinguish which of the two was the real \"Brew\". It was also likely that both may have been Brew and the different designs may have been a mistake. However, with the release of the Vivre Card - One Piece Visual Dictionary, the first design is considered the legitimate Brew and it remains unknown who the second figure is, aside from the fact that he is part of Brew's crew.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/70/Brew%27s_Ship.png/revision/latest/scale-to-width-down/230?cb=20170819132940", "caption": "Brew's ship."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 561 and Episode 470, Brew is seen next to Wallem.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Brew's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 58 Chapter 569, Brew defends himself against a Marine.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 577 and Episode 486, Brew tried to help Jinbe escape.", "elements": []}]}], "images": []}]}