{"sections": [{"title": "Julius", "level": 1, "content": [{"type": "paragraph", "text": "Julius is an infamous New World pirate who allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Julius is a short chubby man, with a round face. He wears a small tricorne with the sides flopped over, and a small Jolly Roger on it. He wears a blue shirt, with dark yellow lining."}, {"type": "paragraph", "text": "In the manga, he is a lot older and wrinkled, with a mustache, and hair."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Having only appeared on a small number of occasions, there is little of his personality that can be ascertained as of late."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Julius is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to make an alliance with Whitebeard. He is seen with two cannons on his shoulders, however he has not been seen using them in battle."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Julius became a well known pirate in the New World, and allied himself with Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Julius and his crew joined forces with the Whitebeard Pirates to save him."}, {"type": "paragraph", "text": "His first appearance is after Whitebeard's death, when Blackbeard had stolen the Gura Gura no Mi's powers. He is later seen when Law and his crew escape from Marineford with Luffy and Jinbe suffering the combined Admiral's attack, hoping they survived."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Whitebeard%27s_Subordinates_at_Marineford.png/revision/latest/scale-to-width-down/250?cb=20130703222535", "caption": "Julius and some other Captains."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended Whitebeard's and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their allies vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Two characters that are highly similar to Julius' concept art can be seen in the manga. The first to appear possesses Julius' distinctive double cannons on his shoulders, his outfit, and his bushy mustache, as evident from the concept art. The second appears in both the manga and anime; and likewise, also possesses the shoulder cannons and the outfit, but lacks the mustache. In terms of similarity to the concept art, the first appearance of Julius is almost exactly the same. Therefore, there is a possibility that the second Julius may be a design error. However, as there is no way to determine with certainty, it is impossible to distinguish which is the real \"Julius.\"", "elements": []}, {"text": "His name is a possible reference to Julius Caesar from Ancient Rome, like Caesar Clown.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 578 and Episode 489, Julius makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, A sketch of Julius is shown.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 578, Julius's first design.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 580 and Episode 489, Julius's second design.", "elements": []}]}], "images": []}]}