{"sections": [{"title": "Cands", "level": 1, "content": [{"type": "paragraph", "text": "Cands is an infamous New World pirate who allied himself with Whitebeard. He only appears in the manga."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cands is a man with an abnormally long neck, and wears a giraffe styled hood around his neck. He wears a black coat with the sleeves rolled up, and light colored pants with boots. He also has a light colored long sleeved shirt under his coat, with the sleeves rolled up above the elbows. He was seen carrying a spear, and wearing a tricorne in the manga. In his original sketch, he wore a normal cap instead of a tricorne. He strongly resembles a giraffe."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Having only appeared on a small number of occasions, there is little of his personality that can be ascertained."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Cands is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to ally himself with Whitebeard."}, {"type": "paragraph", "text": "Cands is seen with a naginata but is not shown fighting, though it can be assumed that he is quite proficient in the use of it due to his reputation."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Cands became a known pirate in the New World, and allied himself with Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Cands and his crew joined forces with the Whitebeard Pirates in order to rescue him from execution. He was later seen when Admiral Aokiji froze Jozu and again when Koby intervened between Akainu and the Whitebeard Pirates. However, just his back was shown for the moment."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended Whitebeard's and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "paragraph", "text": "Whitebeard Pirates and their allies vs. the Marines and Shichibukai"}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Like Kaku, he has a giraffe theme.", "elements": []}, {"text": "It is unknown if he can be a member of the Snakeneck Tribe.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 58 Chapter 569, Cands makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, The names and sketches of Whitebeard's Allies are revealed.", "elements": []}]}], "images": []}]}