{"sections": [{"title": "Colscon", "level": 1, "content": [{"type": "paragraph", "text": "Colscon is an infamous New World pirate captain who allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Colscon is a chubby man, with curly brown hair and a thin black mustache. His clothes are similar to that of a mafia boss, with a black coat, a yellow tie, and a moss green button up shirt with vertical lines on it. He also sports a dark brown hat with a feather on it."}, {"type": "paragraph", "text": "In his original sketch, he had a large parrot on his shoulder."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Colscon is very loyal to Whitebeard, as he was willing to risk his own life to save Ace's. Furthermore, it can be deduced that he highly values friendship since he was willing to brave the dangers of challenging Marine Headquarters just to save his friend."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Colscon is a fearsome pirate who has managed to achieve an infamous reputation in the New World such that he was able to ally himself with Whitebeard."}, {"type": "paragraph", "text": "During the Battle of Marineford, he was seen with a gun, but it is unknown how proficient he is at using it. Furthermore, he also owns a parrot, but it is unknown if the bird assists him during battle."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Colscon became a renowned pirate in the New World and allied himself with Whitebeard as a subordinate captain."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Colscon and his crew joined forces with the Whitebeard Pirates in order to save him from execution. While the Marines were bracing for the arrival of the pirates, Colscon and the allied fleet of the 43 subordinate captains caught them by surprise when the fleet suddenly appeared out of nowhere just off the shores of Marineford."}, {"type": "paragraph", "text": "Just after Ace was fatally injured by Admiral Akainu, Colscon screamed out Ace's name in shock and watched in horror as his comrade passed away."}, {"type": "paragraph", "text": "Afterwards, the Red Hair Pirates arrived and Sengoku ended the war, allowing the surviving pirates to leave."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 59 Chapter 574 (p. 8), Colscon makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces (p. 363), Colscon's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 56 Chapter 551 (p. 12-13), The allied fleet appears off the shores of Marineford.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 580 (p. 15), Sengoku calls an end to the war.", "elements": []}]}], "images": []}]}