{"sections": [{"title": "Baggaley", "level": 1, "content": [{"type": "paragraph", "text": "Baggaley is an infamous New World pirate who allied himself with the Whitebeard Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Baggaley has long black hair and a rather rectangular head. He has a tattoo covering a majority of his cheek and he wears a green hat on his head. He wears a large green cloak showing off a bit of his chest."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Having only appeared on a small number of occasions, there is little of his personality that can be ascertained."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Baggaley is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to make an alliance with Whitebeard. He was seen carrying a gun when Ace was hit by Akainu."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Baggaley became a known pirate in the New World, and allied himself with Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Baggaley and his crew joined forces with the Whitebeard Pirates to save him."}, {"type": "paragraph", "text": "He appeared with Wallem when the Marines announced that they had advanced the hour of Ace's execution."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their allies vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 561 and Episode 489, Baggaley makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Baggaley's name is revealed.", "elements": []}]}], "images": []}]}