{"sections": [{"title": "Great Michael", "level": 1, "content": [{"type": "paragraph", "text": "Great Michael is an infamous New World pirate who allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Great Micheal is an average sized man, with curly hair and a beard. He wears a tricorne with a black jolly roger, that could possibly be his. He wears a black captain's coat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Great_Michael_Portrait.png/revision/latest?cb=20191208101057", "caption": "A portrait of Great Michael."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Having only appeared on a small number of occasions, there is little of his personality that can be ascertained as of late,other than that he has apparently a great respect for Whitebeard as he is willing to risk his life in order to save Ace from being executed. He also appears to have a confident stance and a somewhat laid-back demeanor."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Great Michael is a fearsome pirate who has managed to achieve an infamous reputation in the New World, and to make an alliance with Whitebeard. In One Piece Green: Secret Pieces, he's seen with a sword."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time prior to the current storyline, Great Michael became a known pirate in the New World, and allied himself with Whitebeard."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Great Michael and his crew joined forces with the Whitebeard Pirates to save him."}, {"type": "paragraph", "text": "He was only seen alongside Rush when Squard said that Whitebeard had sold his allies to the Marines."}], "images": []}, {"title": "Post War Arc", "level": 4, "content": [{"type": "paragraph", "text": "He, along with the rest of the crew, attended Whitebeard and Ace's funeral on an undisclosed island somewhere in the New World."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and their allies vs. the Marines and Shichibukai", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He may be named after the carrack of the Royal Scottish Navy, \"Great Michael\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 58 Chapter 563, Great Michael makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Great Michael's name is revealed.", "elements": []}]}], "images": []}]}