{"sections": [{"title": "Kibin", "level": 1, "content": [{"type": "paragraph", "text": "Commodore Kibin is a Marine officer that debuted during the Marineford Arc. His canon name and rank are unknown. However, in the anime, he was given the name Kibin and the rank of Commodore."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kibin is a tall man with a muscular chest, and has his dark-blonde hair tied in a ponytail, revealing his forehead. He has a prominent chin with a x-shaped scar on the left side, and a sharp nose pointing downwards."}, {"type": "paragraph", "text": "Like most high-ranking Marine officers, Kibin wears a business suit with a Marine jacket draped over his shoulders like a cape. His suit is dark red, with a lighter red shirt underneath and a black tie."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2a/Kibin_Portrait.png/revision/latest/scale-to-width-down/150?cb=20191007063612", "caption": "Kibin's face closeup."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Kibin has a strong sense of justice. It is unknown whether he believes in moral justice or absolute justice."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Kibin wields a jutte, which he is skilled in using. He was seen using it in his fight against Zephyr until he was defeated."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Kibin demonstrated several Rokushiki techniques: Soru, Geppo and Tekkai. Though none of them are offensive, he used them in a clever combination to attack his opponent, recreating the Tekkai: Sai used by Blueno, capable of creating a crater in the ground by smashing against it. His Tekkai seems to be average at best, strong enough to shatter the ground with enough momentum added but not enough to take a point blank normal attack from Luffy."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Monkey D. Luffy got over the siege wall and tried to rush to Ace's execution scaffold, Kibin stood in front of Luffy, trying to stop him with several Rokushiki techniques, but Luffy ultimately knocked him out with a hard strike to the stomach."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kibin was seen attending the meeting at the Conference Hall to discuss Monkey D. Luffy's action of infiltrating Marine Headquarters."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Z", "level": 3, "content": [{"type": "paragraph", "text": "Due to Fleet Admiral Sakazuki's orders, Kibin was reassigned to Secon Island in order to protect the Endpoint. When Z attacked the island, Kibin had a short fight with him and was defeated by a Busoshoku Haki imbued punch."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kibin vs. Monkey D. Luffy", "elements": []}, {"text": "Kibin vs. Z", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 and Episode 475, Kibin debuts.", "elements": []}, {"text": "↑  One Piece Anime — Episode 475, Kibin's name is listed in the captions.", "elements": []}]}], "images": []}]}