{"sections": [{"title": "Victoria Cindry", "level": 1, "content": [{"type": "paragraph", "text": "Victoria Cindry was once a famous stage actress who died after falling off the stage twelve years ago. Having been infatuated with her, Dr. Hogback stole her corpse in order to make her his own personal zombie servant with the aid of Gecko Moria's powers."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "In life, Cindry was tall and slim, with short, straight cut blonde hair and an ever-present smile on her face. She wore different outfits depending on the situation: formal for performances, while casual for everyday events like doctor visits."}, {"type": "paragraph", "text": "After being resurrected as a zombie, Cindry retains her beautiful appearance, but now has various stitches across her body and pale blue skin. Her eyes appear flat and dull, and she no longer smiles, save for when she successfully resisted Hogback's orders for the first time. Her left leg has a web pattern across the inside of her thigh and the number 400 tattooed on her calf. She wears a short black evening gown and black high-heeled boots, with a red-orange fur boa wrapped around her neck."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In life, despite her fame and popularity, Cindry was a compassionate woman who was kind to everyone."}, {"type": "paragraph", "text": "After she died, Cindry's corpse was implanted with a shadow, causing it to gain a different personality. As a zombie, Cindry despises plates and wishes all those existing in the world would vanish; her sheer hatred of plates will occasionally cause her to outright disobey Hogback's commands in order to destroy more of them. Her hatred for plates causes her to serve food without them, forcing Hogback and others to eat their food off of the table. She is described by Hogback as a depressing person whose violent words manage to horrify him every time. However, despite her rebellious nature, Cindry retains a zombie's obedience and will do whatever Hogback pleases as long as Gecko Moria orders her to, going as far as to accept his physical abuse and orders to lick the floor in a degrading manner."}, {"type": "paragraph", "text": "However, even as a zombie, Cindry's body retained some of her original \"will\" from when she was alive; this allowed her to make the choice to not only disobey Hogback's orders to rescue him, but to also smile like she had only done in life."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Hogback", "level": 3, "content": [{"type": "paragraph", "text": "Hogback was an obsessive fan of Cindry while she was living as an actress. She was a patient to him while she was still alive, and the two shared an amicable relationship, with Cindry having happily helped sew a button back onto Hogback's shirt. After acquiring all the wealth and fame that he could as a doctor, Hogback proposed to her, only for Cindy to reject him due to already having a fiance, which broke the doctor's heart. Upon hearing that Cindry died in an accident, Hogback became so depressed that he abandoned his medical career."}, {"type": "paragraph", "text": "After allying himself with Moria, Hogback dug up Cindry's corpse and had Moria reanimate it with a shadow. However, when her revived corpse was given a different personality from when she was alive, Hogback revealed that he shallowly cared only for her physical beauty and had no use of the personality that rejected him. Despite the zombie Cindry becoming Hogback's personal servant since then, the two usually have a comedic relationship, with Cindry humiliating Hogback by serving the doctor food directly onto the table without a plate or making negative comments about his love life."}, {"type": "paragraph", "text": "However, at more serious times, Hogback still retains secondary command over her, right under Moria's, and she obeys his every whim. Despite his \"love\" for her, Hogback was not above abusing her and brutally treats her like a slave, demonstrated when he kicked her down and made her lick the floor simply to prove a point. He also ordered her to sacrifice herself to buy him time to escape and claimed that he would simply give her another shadow afterward, proving how little he cared for her even as a servant. It was only when Chopper's words about what it means to be human finally got through to Cindry that her former will returned to her and she defied Hogback's order to rescue him."}], "images": []}, {"title": "Tony Tony Chopper", "level": 3, "content": [{"type": "paragraph", "text": "When Tony Tony Chopper found out that Hogback was insulting Cindry's memory as a living person with his blasphemous practices, he felt pity for her because of how her relatives would feel if they knew and desperately tried to persuade her to regain her humanity despite the blows she landed on him, eventually having Robin try to feed her salt so she could rest in peace once more. Chopper was only further enraged when Hogback ordered Cindry to degrade herself as a means to prove her obedience."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "While still alive, Cindry was a great actress and dancer."}, {"type": "paragraph", "text": "After obtaining her corpse, Hogback modified her body to increase her physical strength, allowing her to fight on equal grounds with Tony Tony Chopper's physically powerful humanoid form. As a zombie, she cannot feel pain."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Since her implanted personality despises plates, Cindry uses them as projectile weapons; when attacking Usopp with them, Cindry displayed considerable marksmanship by hitting Usopp with ten plates in rapid succession from several meters away."}, {"type": "list", "elements": [{"text": "Kaku Zara To (角皿刀, Kaku Zara Tō, literally meaning \"Square Dishes Swords\"): Taking a huge pile of square plates, Cindry throws them one by one at her opponent; due to their shape and her enhanced strength, they can cut or pierce a body like a sword. This was first used against Chopper.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Life and Death", "level": 4, "content": [{"type": "paragraph", "text": "Cindry was once a famous stage actress who was acquainted with Dr. Hogback. When Hogback asked her to marry him, Cindry revealed that she already had a fiance. Shortly afterward, she died after falling off the stage. This led Hogback to steal her corpse and, with the aid of Gecko Moria's powers, turn it into a zombie. Since then, she had worked as the surgeon's personal servant."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f2/Hogback_and_Living_Cindry.png/revision/latest/scale-to-width-down/210?cb=20141206174112", "caption": "Cindry fixes up Hogback's coat while still alive."}]}, {"title": "Thriller Bark Arc", "level": 3, "content": [], "images": []}, {"title": "Greeting New Arrivals", "level": 4, "content": [{"type": "paragraph", "text": "After Nami, Usopp, and Tony Tony Chopper made their way to the mansion on Thriller Bark, Cindry rose from a well in front of them and greeted the shocked Straw Hats before throwing several dishes at Usopp, who demanded to know why she was only targeting him. Claiming that Usopp was not invited into the mansion and that only Nami and Chopper could enter, Cindry hit Usopp with two more dishes before being ordered to stop by Hogback, who proceeded to lie to the Straw Hats about Cindry having formerly been engaged to a rich man before she broke ten of his dishes to test his love and was consequently abandoned. After Hogback introduced himself to the Straw Hats, Cindry hit Usopp with one more dish and responded to Hogback's protest by voicing her desire to rid the entire world of dishes. Cindry led Nami, Usopp, and Chopper inside the mansion while noting that three people would be allowed to enter today as an exception, only to leave Hogback outside in the process. Soon afterward, Cindry served pudding to Hogback and his guests without plates before informing Nami that her bath was ready."}, {"type": "paragraph", "text": "Later that night, Cindry watched Hogback working on Zombie 741 while remarking that she hoped it would fail at the last step. When asked what she was serving for dinner, Cindry poured spaghetti soup directly onto the table, shocking Hogback, before watching as Nami, Usopp, and Chopper, who had been spying on them from the doorway, were sent flying into the room by Ryuma."}, {"type": "paragraph", "text": "When Nami told her that she had been dead for ten years, Cindry did not react and was ordered by Hogback to defeat the Straw Hats alongside Ryuma. However, before Cindry could act, Ryuma knocked them out with Hanauta Sancho: Yahazu Giri before asking Cindry to open a nearby pathway and prepare his night meal."}, {"type": "paragraph", "text": "After Monkey D. Luffy was captured, Cindry accompanied Hogback to a meeting with the other members of the Mysterious Four, where she responded to Absalom's anger at the possibility of Hogback hurting Nami by claiming that his bride would not come for him before insulting Hogback in the same manner. Afterward, Cindry watched silently as Luffy escaped from his steel cage, only to be caught and restrained before having his shadow cut off by Gecko Moria."}, {"type": "paragraph", "text": "Soon after this, Cindry accompanied Hogback and the rest of the Mysterious Four to the enormous freezer containing the corpse of Oars."}, {"type": "paragraph", "text": "When Moria formed a \"past erasure\" contract with Luffy's shadow to make it become obedient and lose its memories of its former life, Hogback wished aloud that they had done the same with the shadow animating Cindry so that he could eat meals on plates, which prompted Cindry to threaten to break his kneecaps as well before watching as Oars, now animated by Luffy's shadow, came to life."}, {"type": "paragraph", "text": "After Oars broke out of the freezer and began exploring Thriller Bark, Cindry stayed behind with Hogback and listened to the report that the Straw Hat Pirates were currently rampaging through the mansion before telling Hogback that he should stew Kumashi's nails and drink them after Perona declared she would subdue the pirates."}], "images": []}, {"title": "Fighting the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "A few minutes later, Cindry and Hogback were confronted by Luffy, Chopper, and Nico Robin, who were searching for Moria. When Luffy attempted to head toward the freezer that formerly contained Oars's corpse, Hogback ordered Cindry to attack him, which prompted her to throw dishes at Luffy until Robin restrained her with two arms."}, {"type": "paragraph", "text": "After Jigoro and Inuppe overpowered Chopper and Robin, Hogback ordered Cindry to finish them off, which she prepared to do before stopping as Chopper began speaking with Hogback about his ethics as a doctor. In order to prove the loyalty of the zombies, Hogback suddenly kicked Cindry to the ground and ordered her to lick the floor, which she did as he explained her past to Chopper and Robin. When an outraged Chopper demanded that he make Cindry stop, Hogback ordered Cindry to kill him and Robin, which prompted her to begin using Kaku Zara To. However, Chopper pushed through the barrage of plates and grabbed Cindry to restrain her, only for Cindry to smash the remaining plates over his head before kicking him repeatedly while demanding that he let her go. Explaining how he pitied Cindry because her real self was long dead and her body was controlled by the words of another man, Chopper proclaimed that real humans have more freedom than this, stunning Cindry long enough for Robin to try and feed her salt. Though Jigoro and Inuppe interfered, Cindry found herself unable to move her body as she began crying."}, {"type": "paragraph", "text": "As Hogback angrily berated her for seemingly not listening to him, Cindry continued to cry as Chopper and Robin wondered if this was proof of her former will still being present in her body. However, Cindry quickly began moving again and proclaimed that she would kill the Straw Hats, prompting Robin to restrain her with Doce Fleur before being interrupted by the arrival of Oars, who smashed through the nearby walls, forcing Robin to release her hold on Cindry as the latter and Hogback fell to the floor below. Trapped by a piece of rubble, Hogback ordered Cindry to help him, but Cindry found herself unable to move once more before looking up to Chopper and Robin and smiling at them, to their surprise, as Oars stepped on Hogback."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Chopper_Restrains_Cindry.png/revision/latest/scale-to-width-down/210?cb=20141206172855", "caption": "Chopper restrains Cindry."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/57/Cindry_Smiles.png/revision/latest/scale-to-width-down/190?cb=20141206092533", "caption": "Cindry smiles as her humanity shines through."}]}, {"title": "The Fall of Oars", "level": 4, "content": [{"type": "paragraph", "text": "Cindry watched from the mansion as the Straw Hats finally defeated Oars. Shortly afterward, however, Moria used Shadow's Asgard in an attempt to finish off the Straw Hat Pirates himself, leading to Cindry losing the shadow that had been animating her corpse until that point."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Cindry_Loses_Her_Shadow.png/revision/latest/scale-to-width-down/210?cb=20160326195146", "caption": "Cindry loses the shadow animating her to Moria."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cindry and Hogback vs. Nico Robin and Tony Tony Chopper", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Her name is also occasionally translated as \"Thin Dolly\"; when her name is broken up, \"シン\" (, Shin) is romanized to \"Thin\" and \"ドリー\" (, Dori) is romanized to \"Dolly\". It is unknown whether or not this is a play on words by Oda, but her skinny appearance, emotionless face and doll-like eyes seem to correlate with this translation."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cindry being an undead servant girl obsessed with plates is similar to Okiku from the Japanese ghost story, \"Banchō Sarayashiki\" (番町皿屋敷, The Dish Mansion at Banchō). She also first appears out of a well like Okiku's ghost, and both count plates.", "elements": []}, {"text": "Cindry is currently the only one of Moria's Zombies to disobey orders long after the shadow has been implanted into the corpse. This differs from freshly activated zombies, such as Oars and Inuppe, who rebelled at first due to their respective shadows having been disconnected for a short amount of time and still retaining vestiges of their old personalities at the time.", "elements": []}]}], "images": []}]}