{"sections": [{"title": "Dalmatian", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Dalmatian is one of the many Marine vice admirals to have participated in the Battle of Marineford."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "With his Devil Fruit powers active, Dalmatian takes the form of a muscular, bipedal dalmatian-human hybrid. The top part of his head from his nose up and his arms and legs are that of a dalmatian: a white dog with black spots all over the body. He also has a long tail. However, the bottom half of his face is human just like most of Zoan users, and he has a blonde-white beard on a wide chin. His torso and neck also seem to remain human. He has yet to be seen in his default human or full dalmatian forms."}, {"type": "paragraph", "text": "As a marine recruit, he had a standard marine cap and his face only had stubble on his chin with his Devil Fruit powers active."}, {"type": "paragraph", "text": "Like all other vice admirals and other high ranking officers, he wears a double breasted suit, dress shirt, and a tie, with a Marine jacket draped loosely over his shoulders like a cape. His suit, in particular, is dark green in color. He wears a light red shirt underneath, with a darker red tie."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Dalmatian has a strong sense of justice. It is unknown whether he believes in moral justice or absolute justice."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Dalmatian is capable of commanding a Buster Call alongside four other vice admirals. He also has command over lower-ranking subordinates."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Dalmatian has eaten an unnamed Zoan-type Devil Fruit that allows him to transform into a dalmatian. Using this, he can increase his fighting abilities and physical strength greatly, and can combine it with his Rokushiki style."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Dalmatian has access to the Rokushiki martial arts style and he has demonstrated the techniques Soru and Shigan, allowing him to move at incredible speed and pierce his opponents with his finger, respectively. The powers of his physical techniques are further enhanced by his Devil Fruit transformation. His Shigan has also been enhanced by the sharp nail point added to his finger, allowing him to pierce Luffy's rubber body."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1b/Dalmatian_shigan.png/revision/latest/scale-to-width-down/230?cb=20101215121632", "caption": "Dalmatian stabs Luffy using Shigan."}]}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Dalmatian can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Dalmatian, along with the other vice admirals, were called to Marineford to battle against the Whitebeard Pirates and their allies. After Monkey D. Luffy and the Impel Down escapees arrived, Luffy eventually made his way to the plaza. Dalmatian and Momonga attacked him with Dalmatian piercing Luffy with Shigan."}, {"type": "paragraph", "text": "After the death of Whitebeard and Fleet Admiral Sengoku calling the war off, he stood down with the rest of the vice admirals."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Marines and Shichibukai vs. Whitebeard Pirates and Allies.", "elements": [{"text": "Dalmatian and Momonga vs. Monkey D. Luffy", "elements": []}]}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Dalmatian vs. Decalvan Brothers", "elements": []}]}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [{"type": "paragraph", "text": "In Episode 476, he made an additional comment absent from the manga that Luffy being a mere rookie was the main reason why he could not defeat the vice admirals."}, {"type": "paragraph", "text": "Also in the anime version of the Marineford Arc, he is seen fighting the Decalvan Brothers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/13/Dalmatian_vs_Decalvan_Brother.png/revision/latest/scale-to-width-down/210?cb=20121207002901", "caption": "Dalmatian vs. the Decalvan Brothers."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name first appeared in the opening credits, and was later confirmed when the fifth databook came out.", "elements": []}, {"text": "\"Dalmatian\" can refer to a variety of things, usually things from the region of Dalmatia, particularly the famous breed of spotted dogs.", "elements": []}, {"text": "Based on Chapter 691's cover, Dalmatian ate his Devil Fruit before (or shortly after) joining the Marines.", "elements": []}, {"text": "Dalmatian is the second known person who keeps his Devil Fruit powers always active, after Tony Tony Chopper, and followed by Caesar Clown and Morgans.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 57 Chapter 553 and Episode 462, Dalmatian is seen behind Onigumo.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 103), Dalmatian's name and birthday are given.", "elements": []}, {"text": "↑  One Piece Anime — Episode 479, Dalmatian's name is revealed in the opening credits.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 58 Chapter 567 (p. 7-9) and Episode 476.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 7) and Episode 511, Doctor Fishbonen states Haki is a power all the vice admirals use.", "elements": []}, {"text": "↑  One Piece Anime — Episode 489.", "elements": []}]}], "images": []}]}