{"sections": [{"title": "Reforte", "level": 1, "content": [{"type": "paragraph", "text": "Reforte is an infamous New World Pirate Captain that allied himself with Whitebeard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Reforte is a man with long yellow-blonde hair and a small stubble on his chin. He wears a white shirt that shows most of his chest in a V shape and also wears a black cape over it that is draped across his shoulders. He also wears a sash and a pair of pants with some sort of design on the sides. Furthermore, he wears a black pork pie hat and a pair of black sunglasses or goggles."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "It can be deduced from his willingness to put his life on the line to save Ace that Reforte is a person that values loyalty and friendship. Furthermore, since he was willing to take up arms against Marine Headquarters, it can be concluded that Reforte is a brave and bold pirate captain."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Reforte is a fearsome pirate who has managed to achieve an infamous reputation in the New World such that he was able to ally himself with Whitebeard. Nothing is known about his combat abilities, but it can be assumed that it is befitting of his status as an infamous pirate."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In the past, Reforte became a renowned pirate in the New World and allied himself with Whitebeard as a subordinate captain."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Portgas D. Ace was to be executed at Marineford, Reforte and his crew joined forces with the Whitebeard Pirates in order to save him from execution. While the Marines were bracing for the arrival of the pirates, Reforte and the allied fleet of the 43 subordinate captains caught them by surprise when the fleet suddenly appeared out of nowhere just off the shores of Marineford."}, {"type": "paragraph", "text": "After Little Oars Jr. collapsed, he charged alongside Arthur and Hangan when the latter ordered the allied pirates to charge into the bay."}, {"type": "paragraph", "text": "At the end of the war, the Red Hair Pirates arrived and Sengoku allowed the surviving pirates to leave."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Whitebeard Pirates and subordinate crews vs. Marines and the Shichibukai", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 57 Chapter 556 (p. 12), Reforte makes his debut.", "elements": []}, {"text": "↑  One Piece Green: Secret Pieces, Reforte's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 56 Chapter 551 (p. 12-13), The allied fleet appears off the shores of Marineford.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 57 Chapter 556, Reforte charges into the bay.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 580 (p. 15), Sengoku calls an end to the war.", "elements": []}]}], "images": []}]}