{"sections": [{"title": "Gecko Moria", "level": 1, "content": [{"type": "paragraph", "text": "Gecko Moria is the captain of the Thriller Bark Pirates and a former Shichibukai who resides on the largest ship in the world, Thriller Bark. His bounty is 320,000,000, which was frozen until he lost his Shichibukai position."}, {"type": "paragraph", "text": "He is the primary antagonist of the Thriller Bark Saga who stole the shadows of Brook and various other beings with the power of the Kage Kage no Mi. He is also a major antagonist in the Marineford Arc where he took part in the Battle of Marineford and sided with the Marines, along with most of the other Shichibukai."}, {"type": "paragraph", "text": "After the war's end, he was stripped of his title and was to be eliminated by Donquixote Doflamingo, but he managed to escape."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Moria is an abnormally large person with very distinct, devil-like features. Standing at 692 cm (22'8½\") in height, he was the tallest among the Shichibukai."}, {"type": "paragraph", "text": "He has two horns protruding from the sides of his forehead and stitches running vertically from the top of his face and down his neck, which is rather long and thick in comparison to his body. His ears and teeth are both pointed, while his lower body is relatively fat and stubby in comparison."}, {"type": "paragraph", "text": "Moria's hair is red and his skin is a pale blue, matching his lips, armbands and the edges of his gloves. His coat and gloves are black, while his pants are bright orange with pale window shapes imprinted on them. He wears a fishnet shirt underneath a cravat, a necklace, and a blue crucifix-like ornament with claw-like appendages sprouting out from three of the cross's points. During the meeting of the Shichibukai at the Marine Headquarters and later on during/after the war, Moria added a fur-laced cape to his attire."}, {"type": "paragraph", "text": "During Gol D. Roger's execution twenty-two years before Monkey D. Luffy set out on his adventure, Moria looked much thinner, had a pointed chin, and a little longer hair."}, {"type": "paragraph", "text": "In SBS Volume 63, Oda drew the Shichibukai as children, Moria is shown gleefully pulling off the leg of a hapless ghost doll. His horns and hair were shorter, and he was missing the cross stitches running down the middle of his face. He wore a baggy, long-sleeved white shirt with suspenders and dark, knee-high pants. He also wore his usual long black gloves with cowboy boots with spurs and a jewel-encrusted dagger on his belt. He was also much thinner, and had a chin and longer legs."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Moria has a relaxed, laid-back, and even lazy personality, seemingly appearing to believe he cannot lose. He also believes that a true pirate should fear nothing, not even death."}, {"type": "paragraph", "text": "In most situations similar to fellow Shichibukai, Donquixote Doflamingo, Moria is constantly grinning maniacally, and only seems to change expression when something bad happens to him or when he believes his power is being ridiculed. Like many others, Moria has a distinct style of laughing: \"Kishishishi\"."}, {"type": "paragraph", "text": "In general, he prefers to avoid fighting altogether, or at least fighting his enemy directly, either making his shadow fight or ordering one of his subordinates to do so. His proclivity to delegate tasks to his minions is also a weakness in and of itself, along with making exceptions to act out himself should his personal pride or power be questioned; Jinbe noted that Moria had grown weak from his lack of training."}, {"type": "paragraph", "text": "Moria desires to become the new Pirate King, and believes that this is possible to achieve if he has powerful subordinates. Though he once claimed that he would rely on his own powers to achieve his goals, he is incredibly lazy; his motto is \"relying upon others for one's own objective\" (他力本願, tarikihongan) and his favorite phrase is \"You do it!!\" (お前がやれ, Omae ga yare). This also extends to his fighting style, as he prefers to lay back and let his shadow battle with the powers of the Kage Kage no Mi."}, {"type": "paragraph", "text": "He also appears to have considerable knowledge of the New World and how terrifying it is. At Thriller Bark, he told Luffy that with his current strength, he would lose his crew; his prediction came true before the Straw Hats went to the New World, at the Sabaody Archipelago."}, {"type": "paragraph", "text": "Moria has a lot of experience, having fought many opponents in the past, including a Yonko. He is a good battle tactician, being able to outsmart even Nico Robin. However, his overconfidence and laziness made him underestimate his opponents, and ultimately led to his defeat at the hands of the Straw Hat Pirates."}, {"type": "paragraph", "text": "In the past, Moria had many powerful crewmates whom he considered to be valuable comrades, and by his own admission was overconfident and headstrong. He also deeply cared for his crewmates, which was a point of tragedy when his last encounter with the Yonko known as Kaido ended with Moria being the sole survivor of his crew. Shell-shocked and traumatized by the horrific event, Moria immediately departed from the New World (having yet to return since), and decided that the only way he would not have to face such pain ever again would be to make his comrades unable to suffer by turning them into mindless zombies that serve only his desires. The loss of his crew to Kaido changed Moria's outlook on life substantially, making him believe that subordinates are better off as zombies because, due to their undead status, they cannot be harmed by any physical damage - they can only be \"purified\" by the sea or elements of the sea and even if they were purified, he could easily find other shadows to reanimate them. In addition, creating a zombie powerful enough to defeat Kaido became one of Moria's driving motivations."}, {"type": "paragraph", "text": "Despite his cruelty and twisted outlook on life, he is capable of showing true care towards those close to him. When Absalom was kidnapped by Blackbeard, Moria did not hesitate to go and rescue him despite the risks of entering a Yonko's territory, especially given how the Blackbeard Pirates are hunting powerful Devil Fruits. He was also shown to be loving towards Perona when she was growing up, as Perona herself viewed Moria as a father figure, suggesting he is capable of displaying affection to others."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cb/Luffy_Confronts_Moria.png/revision/latest/scale-to-width-down/210?cb=20131018153802", "caption": "Moria relaxes as Luffy confronts him."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crews", "level": 3, "content": [], "images": []}, {"title": "Moria's Old Crew", "level": 4, "content": [{"type": "paragraph", "text": "Moria appears to care deeply for his old crew, who were famous throughout the world. Upon losing them all in the New World to Kaido, now one of the Yonko, Moria became bitter and his ideals of a crew changed drastically, desiring a crew of zombies that would never result in another irreplaceable loss. Despite his twisted perceptions, Moria still seems to mourn their loss and even reacts quite heavily when thinking about them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Moriah_Snaps.png/revision/latest/scale-to-width-down/180?cb=20140916081920", "caption": "Remembering the fate of his old crew causes Moria to snap."}]}, {"title": "Thriller Bark Pirates", "level": 4, "content": [{"type": "paragraph", "text": "The Thriller Bark Pirates were very loyal and very respectful to Moria, and always seemed to care about his well being; however, their loyalties towards Moria seemed to be due to a myriad of reasons. For the zombies, their servitude was mainly fueled by Moria's hold on their very being, granted to him by his Kage Kage no Mi powers. As for the humans in his crew, they continued to serve him either due to the deals that Moria seemed to have made with them in the past or their goals coinciding with his at the time (i.e. Perona's desire to be granted servants of her own, Doctor Hogback's eagerness to breathe life into corpses, and Absalom's wish to become the \"Graveyard King\")."}, {"type": "paragraph", "text": "Among the Mysterious Four, Absalom was easily the most dutiful crewmate under Moria, having actively worked for Moria's best interests, such as when he awakened the General Zombies to fight the Straw Hats. During the Wano Country Arc, it is revealed that Moria also cared about Absalom when he forced his way on to Blackbeard's island in order to rescue Absalom and was beyond relieved when Absalom was supposedly fine but was extremely angered when it was revealed that \"Absalom\" was actually Catarina Devon who used her Devil Fruit abilities to trick him and informed him that Absalom was killed by them so Shiryu could have Absalom's Devil Fruit."}, {"type": "paragraph", "text": "When Moria came to Hogback requesting his assistance in creating an army of the undead to conquer the New World, Hogback agreed on the condition that he would have his late love, Victoria Cindry, resurrected. Ever since then, Hogback saw Moria as his master, and helped him to create his zombie army and improve Moria's subordinate Absalom's physical strength. Hogback greatly preferred his position as a pirate's scientist committing blasphemous experiments over being a world-famous surgeon saving people's lives."}, {"type": "paragraph", "text": "After Moria's defeat, Hogback and Absalom proved their loyalty by escaping Thriller Bark with an unconscious Moria after he was defeated.Perona has been with Moria since she was a child, having been adopted by the latter and raising her as a daughter. While Perona is very close and loving to Moria, Perona's loyalty was somewhat questionable, as she not only attempted to flee when she felt her life was endangered, but took all the rations and treasure on board with her. However, after receiving news of Moria's supposed death, she appeared to be distraught and lamented his demise. When she learned that Moria is alive two years later, Perona was overjoyed and quickly departed Mihawk's castle to go find him."}, {"type": "paragraph", "text": "Buhichuck was loyal to Moria as well, having tricked some of the Straw Hats into being trapped in a room full of General Zombies."}, {"type": "paragraph", "text": "Gyoro, Nin and Bao seemed to be very scared of Moria, but they were still loyal to him, as they told him when the other members of the Mysterious Four arrived."}, {"type": "paragraph", "text": "Originally, Oars was very defiant against Moria's will, possessing a strong sense of individuality. However, as is the fate of all zombies, Oars eventually became obedient to Moria. Despite this, Oars still had his own way of doing things, preferring to fight his battles by himself. While Oars allowed Moria to aid him in the execution of his stretching techniques, he was against his master interrupting his battles or fighting them for him."}, {"type": "paragraph", "text": "Moria, on the other hand, cared very little about most of the zombies of Thriller Bark; when Absalom informed him that Brook had returned and was slaying zombies, Moria simply insulted him and turned toward another objective with no apparent concern. However, he held his human crew in a much higher regard, and was left in shock and despair by their deaths."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "Before Monkey D. Luffy, Moria had already made countless enemies in his search to find powerful underlings, scouring the world for corpses of powerful fighters and shadows to reanimate them, making Moria an enemy of every victim whose shadow he extracted."}, {"type": "paragraph", "text": "Nevertheless, in his quest to acquire powerful warriors to support him in his cause, Moria would either steal their shadows or kill them, but preserve their bodies enough to be converted into suitable zombie warriors.Lola has sworn a grudge against Moria for stealing her and everyone else's shadows, and has remained on Thriller Bark fighting back by purifying zombies and stealing shadows. She even mustered the courage to threaten Moria when he was weakened."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Moria is an enemy of Monkey D. Luffy, who played a pivotal role in defeating him and destroying his army of zombies. That feeling is mutual, and they also seem to see each other as rivals, as they both aim to become the Pirate King. Moria does acknowledge Luffy's strength as he chose to use his shadow to empower Oars in Thriller Bark."}, {"type": "paragraph", "text": "At Thriller Bark, he told Luffy that with his current strength, he would lose his crew. Not long after that, the Straw Hats did indeed suffer a crushing defeat and separation at the Sabaody Archipelago, thus beginning a training period of two years to prepare themselves for the New World. At Marineford, he was angry to see Luffy once again but took an interest in stealing his shadow again, but Jinbe intervened on Luffy's behalf. Moria was also the only Shichibukai to be shocked at the revelation of Revolutionary Dragon being Luffy's father."}], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "Moria's apparent biggest enemy is Kaido, who was responsible for the death of his old crew. Moria spent ten years creating his zombie army to get his revenge against Kaido, while expressing how much he hated Kaido for the defeat he suffered back then."}], "images": []}, {"title": "World Government and Marines", "level": 4, "content": [{"type": "paragraph", "text": "Despite being allied with the government, Moria does not care about them. During his time as a Shichibukai, Moria had no problem in stealing Marines, pirates, and even civilians' shadows to increase his army of zombies. Moria was furious to learn that the government sent Kuma personally, fearing of Moria's defeat at the hand of the Straw Hats, a fear that would come true. Fearing what would happen if word got out of another Shichibukai falling, the World Government attempted to cover up his defeat by having Kuma kill all of the survivors of Thriller Bark before word got out. Moria's defeat at Thriller Bark was met with annoyance and disappointment by the World Government, as they had only just replaced Crocodile after the latter's own defeat and ejection from the Shichibukai. Even though Kuma chose to disregard the order of the Five Elders, Moria was able to retain his status for a time, later answering the call to arms against the Whitebeard Pirates."}, {"type": "paragraph", "text": "During the war at Marineford, Moria did not care whether the Whitebeard Pirates and their allies or the Marines won the Battle of Marineford, but only thought that Whitebeard's death would be amusing."}, {"type": "paragraph", "text": "However, after the war, the World Government finally deemed Moria to be far too weak to continue as a Shichibukai and decided to annul his pact and eliminate him, under the pretense of Moria dying in the war to preserve the Shichibukai's reputation of strength. However, Moria was able to escape."}, {"type": "paragraph", "text": "Moria seems to view the Marines as no different from the pirates and civilians whom he usually extracts shadows from, displaying no qualms about forcibly taking the shadows of nearby Marines to empower himself against Jinbe. When Doflamingo informed him that he had received orders for Moria's eradication, Moria immediately suspected Sengoku was responsible but was told to think higher up the ranks."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Moria seems to have had a hostile encounter with Jinbe in the past, since the latter knows the weakness of Moria's zombie soldiers. The two engaged in combat during the Marineford War, with Moria claiming that he would steal Jinbe's shadow. However, the fish-man landed a powerful hit on him before he could do so and berated Moria for growing weak because of his refusal to train."}], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Moria was also quite negative toward Donquixote Doflamingo, as Doflamingo damaged Little Oars Jr. despite Moria wanting the giant's corpse intact. After the war, he got attacked by Doflamingo, who received orders to kill him. As Moria laid bleeding on the ground, a laughing Doflamingo claimed that he was far too weak to be a Shichibukai and that it would be better for it to look like he died honorably in the war. Even though Moria managed to escape Doflamingo's clutches, Doflamingo was unconcerned, certain that he would die from the wounds he received."}], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "They had no interaction when Blackbeard was a Shichibukai, though he was amused to hear that the latter filled the vacant spot left by Crocodile. After the timeskip, Moria showed hostility towards Blackbeard by invading his personal island to rescue Absalom while yelling for Blackbeard to show himself despite him having become a Yonko. Even after Moria attacked his underlings, Teach still gave Moria the option to join him though did so in a mocking tone."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Bartholomew Kuma", "level": 4, "content": [{"type": "paragraph", "text": "Moria's interactions with Bartholomew Kuma have been brief, but display an understanding between the two of them. While Moria chastises Kuma for being so loyal to the World Government and not having his own agenda, Kuma showed much patience around Moria, offering to assist him in fighting the Straw Hats despite his disrespect towards him. However, Moria was gravely insulted at his offer and showed no qualms about attacking him, despite Kuma not being affected by his intimidation tactics. Moria also knows about Kuma's Nikyu Nikyu no Mi abilities and his habit of asking other people where they would like to go for a vacation before sending the person flying away."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Moria is smart and strategic, demonstrating keen planning on multiple occasions. He often plans ahead with his zombies, placing certain shadows in certain bodies and altering the bodies to suit whatever his purpose would be under the circumstances. He apparently knows of the mechanics behind Bartholomew Kuma's ability to transport people elsewhere instantly, something that most people are not even aware of."}, {"type": "paragraph", "text": "Moria is a former Shichibukai, as well as one of the most experienced pirates in the entire Grand Line. At his prime, he was referred to as being a \"rival\" to Kaido, one of the Yonko (though eventually he lost his entire crew to the man). In Marineford, he was strong enough to battle Curiel, one of the division commanders in the Whitebeard Pirates, while sustaining no injuries aside from a strike he suffered from Jinbe (a fellow Shichibukai). He also managed to fell Little Oars Jr. in one move, though others had already injured the mighty giant beforehand."}, {"type": "paragraph", "text": "Unfortunately, his tendency to heavily rely on underlings (or his own shadow) to fight for him in the battlefield may have contributed to his diminished prowess in single combat; often, Moria would run away from or ignore an adversary if he deemed the battle as \"pointless\", as seen when he dismissed Luffy's challenge on Thriller Bark because he had already extracted the Straw Hat's shadow from him. Jinbe claimed that Moria's dependence on absorbing the shadows of other people has weakened him."}, {"type": "paragraph", "text": "After the Battle of Marineford ended, Donquixote Doflamingo claimed that the government had deemed Moria to be far too weak to continue to bear the title of Shichibukai and that he was better off eliminated; despite this, Mihawk recalls that Moria was perfectly fine at the end of the war, it still took Doflamingo and a group of Pacifistas to corner him, and Moria still managed to escape."}, {"type": "paragraph", "text": "As further testament to his potential, Blackbeard, who is known for refusing to recruit weaklings into his crew, asked Moria to become his subordinate."}, {"type": "paragraph", "text": "Moria possesses a strong will as he was able to resist Luffy's Haoshoku Haki during the Battle of Marineford."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Moria possesses considerable endurance, having gotten up immediately after attacks by Nightmare Luffy that toppled Oars and quickly recovered from a powerful strike from Jinbe to battle a commander of the Whitebeard Pirates. He is also fairly durable, as he did not take any damage when Nami's Thunderbolt Tempo struck Oars. Also, even though he was crushed under the main tower of Thriller Bark, only a small injury to his head remained after his recovery, as evidenced by his appearance at Marineford."}, {"type": "paragraph", "text": "True to his larger size and mass, Moria is also proportionately stronger than normal-sized humans, being capable of single-handedly lifting a grown man in the air without any visible effort. In such instance, the former Shichibukai seemingly managed to just as casually snap the blade of the saber the man was wielding with his bare hand alone; at the same time squeezing his victim hard enough to have him cough up blood. In spite of this very same size, however, Moria is incredibly fast: able to outrun Luffy, who is both much smaller and more accustomed to physical feats, for a considerable amount of time."}, {"type": "paragraph", "text": "In addition to his considerable (though often overlooked) physical attributes, Moria possesses impressive willpower. Using Shadow's Asgard, he managed to sustain 1000 shadows within his body, though it did exert him greatly."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Moria ate the Kage Kage no Mi, a Paramecia-type Devil Fruit that allows him to manifest and control shadows as physical beings. It is this fruit that allowed him to build his zombie army by depriving living beings of their shadows and implanting them in dead bodies. Moria can have his own shadow, which he calls Doppelman, fight for him; in addition to being mostly solid and easily changing its form into things like tiny bats, Doppelman cannot be destroyed and will continue to reform. Moria can switch locations with his shadow instantaneously, which he uses to dodge attacks."}, {"type": "paragraph", "text": "Even if he has no zombies to do his fighting for him or shadows to increase his own strength, Moria is a fairly strong fighter with just his own shadow, having used it to impale Little Oars Jr. through the chest."}, {"type": "paragraph", "text": "The Kage Kage no Mi allows Moria to steal the shadows of others. The theft of another person's shadow causes them to be vaporized if they come in contact with direct sunlight. Moria can create a zombie by implanting a stolen shadow into a lifeless corpse. People who have their shadow stolen are left in a coma for two days and do not have reflections. If they die, the zombie with their shadow loses the shadow."}, {"type": "paragraph", "text": "Moria can place someone's shadow inside of someone's living body, increasing physical power and possibly granting them a fighting technique. Moria can also grab multiple shadows and insert them into his own body for a power and size increase; the culmination of this is his last resort technique Shadow's Asgard, where Moria absorbs the shadows from all of his zombies at once. On Thriller Bark, Moria absorbed 1000 shadows at once, giving him a monstrous increase in both size and strength that allowed him to split his ship in half with one punch."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a7/Moria%27s_Doppelman.png/revision/latest/scale-to-width-down/210?cb=20191213133724", "caption": "Doppelman, Moria's shadow clone, formed by his Kage Kage no Mi powers."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Moria wields a giant pair of scissors, which he uses in conjuncture with his Kage Kage no Mi to sever people's shadows. He carries these with him all the time so he can steal shadows even during battle, such as when he took Robin's shadow."}, {"type": "paragraph", "text": "The scissor blades can be disconnected at the joint, becoming two inverted swords for Moria. With shadows of capable swordsmen implanted into himself, Moria can become a swordsman with dual swords."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early Years", "level": 4, "content": [{"type": "paragraph", "text": "Moria was present at the execution of Gol D. Roger and witnessed his famous speech, which likely contributed to Moria's old dream of becoming the new Pirate King. After the execution he, like many others, raised his flag and started to make a name for himself in the New World."}, {"type": "paragraph", "text": "At an unknown point, Moria found a young Perona, choosing to take her in and raise her as his own, and she eventually began to see him as a father figure."}], "images": []}, {"title": "Life as a Pirate", "level": 4, "content": [{"type": "paragraph", "text": "Moria then became a pirate and obtained a bounty of 320,000,000 and was said to be a pirate that could rival the likes of the Yonko Kaido. However, during his time in the New World, Moria clashed with Kaido's forces in Wano and his entire crew was killed in battle. Their deaths affected his entire outlook about his crewmates, such that from that day on, he sought to create an undead crew. After the loss of his crew, Moria set about trying to gain enough power to defeat Kaido. Afterwards, Moria turned the island of Thriller Bark into his personal ship. Some time after this, he was inducted into the Shichibukai."}, {"type": "paragraph", "text": "Ten years before the Straw Hats came to Thriller Bark, Moria, along with Absalom and Perona (with her having joined Moria's crew simply for fun), sought out a man named Hogback. Upon meeting the doctor, Moria offered him a way to bring his deceased love, Victoria Cindry, back to life. Through the use of his Devil Fruit powers, Moria implanted a stolen shadow into the corpse and gained the doctor's allegiance in return."}, {"type": "paragraph", "text": "Together with Hogback, Absalom, and Perona, Moria set up his ship, Thriller Bark, and traveled to the Florian Triangle. There they began to ambush anyone who entered, looking for those with strong shadows, such as pirates with high bounties, and Moria started making zombie minions with shadows stolen from his victims and creations supplied by Hogback."}, {"type": "paragraph", "text": "Five years ago, a skeleton named Brook came to Thriller Bark in hopes of fixing the rudder to his ship. He was captured and Moria implanted his shadow into the corpse of Ryuma. However, Brook returned to Thriller Bark shortly afterward and purified several of Moria's zombie minions in an attempt to retrieve his shadow. Though Brook was defeated by Ryuma, Moria was forced to rebuild his army from the mess he left behind."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Hogback_Meets_Moria%2C_Absalom_and_Perona.png/revision/latest/scale-to-width-down/210?cb=20150526221934", "caption": "Moria meets Hogback."}]}, {"title": "Thriller Bark Saga", "level": 3, "content": [], "images": []}, {"title": "Thriller Bark Arc", "level": 4, "content": [{"type": "paragraph", "text": "After four days of sleep and some nightmares, Moria was awoken by his servants and told of the night attack to be commenced on the Straw Hat Pirates, which he then prepared for."}, {"type": "paragraph", "text": "As the attack commenced, Moria took Sanji and Roronoa Zoro's shadows as they were brought before him, implanting them in the zombies Inuppe and Jigoro, respectively. Later, Luffy was brought to Moria, who expressed his desire to become the Pirate King. After noting that they had only caught Zoro and Sanji prior to obtaining Luffy, Moria berated his subordinates for bickering among themselves over the other Straw Hats escaping and reminded them that he had brought them here to witness the birth of an exceptionally powerful zombie. Luffy attempted to escape, but was incapacitated by Perona's Horo Horo no Mi, allowing Moria to cut off his shadow."}, {"type": "paragraph", "text": "Noting that obtaining Luffy's shadow had put him one step closer to becoming the Pirate King, Moria proclaimed that he would not have lost to Kaido in the New World if he had possessed such a powerful underling before ordering Gyoro, Nin, and Bao to open the door to the special freezer. When Absalom informed him that Brook had returned and was purifying the zombies once more, Moria merely told him to do something about it himself. Soon afterward, Moria, Hogback, Absalom, Perona, and Kumashi walked down the hall to the special freezer, with Moria listening to Hogback explaining the legend of the being whose corpse he found in the ice country before stating that they would revive that legend as the group reached the corpse of Oars."}, {"type": "paragraph", "text": "Moria approached Oars's corpse before informing Luffy's shadow that he was its new master. When Moria explained how he would give it a body and ordered it to forget its past and become his soldier, the shadow nodded its head, prompting Moria to note that the contract was complete before shoving the shadow into Oars's corpse. After a few seconds, Oars began moving and roared, prompting Nami, Usopp, and Tony Tony Chopper to fall out of Kumashi, which Moria noticed and was confused by. However, Moria quickly turned his attention back to Oars, whom he noted with delight was easily ripping off his large chains."}, {"type": "paragraph", "text": "While his zombie minions brought in large amounts of food to satisfy Oars's hunger, Moria explained to Oars how he was a legendary villain from five hundred years ago who was revived to become Moria's underling. However, Oars refused to serve Moria and broke out of the freezer as a grinning Moria watched."}, {"type": "paragraph", "text": "After being informed of Oars climbing up Thriller Bark's mast, Moria noted that they will be able to obtain the shadows of even stronger people and create more special zombies before informing Hogback that they would be needing more marios. When Hildon arrived and informed Hogback of Luffy, Zoro, and Sanji waking up and learning how to purify zombies, Moria listened with interest, but was left disappointed when Hogback told him that everything was fine after Perona claimed that she would deal with them herself. Sitting down, Moria told Hogback that he would stay there and play with Oars for a bit."}, {"type": "paragraph", "text": "Soon afterward, Moria was confronted by Luffy. When Luffy demanded that Moria give back the shadows he had taken and threatened to beat him up in order to make him do so, Moria explained that the shadows would only to return to their owners if he commanded them to do so and that he would need to be severely weakened in order to do this, though he did not believe that Luffy would even be able to touch him at his current level of power. Having Doppelman block Luffy's subsequent attack, Moria admitted that he once aspired to become stronger before claiming that he would become the Pirate King through the strength of others. When Luffy proclaimed that he would be the one to become the Pirate King, Moria noted that Oars said the same thing and that Luffy's will was strong in him before revealing that Oars would eventually lose his memories of being Luffy and become completely obedient toward him. Moria proceeded to attack Luffy with Brick Bat while claiming that an inexperienced brat who underestimates others will only be embarrassed in the end. However, Luffy suddenly jumped off the observation deck and kicked Moria from below, angering him."}, {"type": "paragraph", "text": "Eventually, Oars returned, and Moria confirmed that he had become obedient to him before ordering him to mercilessly attack the Straw Hats and transport the survivors to their ship. After telling Oars to displays all of his power, Moria ran away, prompting Luffy to pursue him. While continuing to run, Moria taunted Luffy by proclaiming that his crewmates would be falling victim to his fighting prowess while Luffy was chasing him. Eventually, Luffy seemingly caught up with Moria and tackled him, only to discover that it was actually Doppelman, which quickly returned to Moria himself."}, {"type": "paragraph", "text": "When Thriller Bark began moving out of the Florian Triangle due to Oars fooling around with the rudder, Gyoro, Nin, and Bao informed Moria, who merely claimed that he did not care as long as they remained on the ocean before turning his attention to his newly-arrived guest, Bartholomew Kuma. Identifying Kuma as being the only Shichibukai who followed the World Government's every order without question, Moria claimed that he was very ominous because his intentions were mysterious before interpreting Kuma's inquiry of where he would like to go on a trip as a challenge to battle. Kuma revealed that he had come to inform Moria of the appointment of Crocodile's successor in the Shichibukai, Marshall D. Teach, otherwise known as Blackbeard. Upon learning that Blackbeard's former bounty was 0, Moria noted that he had done well for the World Government to recognize him before stating that this would restore the world's balance. However, Kuma disagreed and revealed that the World Government was afraid that another Shichibukai would be defeated by the Straw Hats, greatly angering Moria, who was only further enraged when Kuma offered to help him fight the Straw Hats. Demanding to know if Kuma believed he would be defeated by this rookie crew, Moria told him to inform the World Government that the pirate crew that outwitted them were easily made into loyal zombies."}, {"type": "paragraph", "text": "Soon afterward, Moria entered the cockpit within Oars's stomach and noted that the night air was refreshing before asking the shocked Straw Hats if they could really afford to waste time with the dawn approaching. Offering the Straw Hats a chance to fight him, Moria explained that they would be able to free all the shadows if they beat him before pointing out that they would not be able to reach him if they did not beat Oars first. When Usopp attempted to enter the ship's kitchen in order to find more salt, Moria had Oars smash his fist into Usopp and the entrance of the mansion, only for Usopp to be rescued by Brook, who had brought a large bag of salt."}, {"type": "paragraph", "text": "As Moria promised that he was not a mere passenger and that he would show the Straw Hats their worst nightmare, Oars cried out in pain from being burned, which prompted Moria to remind him that the pain he felt was merely a lingering reaction from when he was human before ordering him to put out the fire. When Franky attempted to attack Moria directly with his mortar, Oars moved himself and Moria out of the way before smashing Franky into a nearby building, prompting Moria to gleefully order him to finish Franky off. When Nami arrived, Oars managed to stretch his arm while attacking her, leading Roronoa Zoro to realize that Moria did something upon noticing him laughing."}, {"type": "paragraph", "text": "After making Oars's limbs stretch when he used Gomu Gomu no Kane and Gomu Gomu no Spear, Moria revealed that he was using Kage Kakumei to change the shape of Oars's shadow and thus his body, which is what allowed his body to stretch. When Moria demonstrated that Oars was not limited to simply stretching like rubber by turning his body into a sphere for Oars Ball, Oars asked him to not interfere with his fight, which prompted Moria to apologize and explain that he only wanted to help before ordering Oars to crush the Straw Hats one by one. However, after the Straw Hats managed to inflict a severe injury on Oars's right arm, Moria was prevented from allowing him to stretch by Nico Robin, who physically restrained him with Ochenta Fleur: Cuatro Manos: Hold."}, {"type": "paragraph", "text": "Admitting that Robin's restraints hurt, Moria asked her if she really thought this would stop him before having Doppelman rise from Oars's shadow and using Brick Bat, which injured Robin and knocked her down. When Moria had Doppelman appear behind Robin in preparation for a long-range battle, Robin attempted to break his neck with Cuatro Mano: Clutch, only for Moria to evade the attack by switching places with Doppelman before cutting off Robin's shadow with his scissors. As Moria noted that he did not have a zombie to put Robin's shadow into and that he would simply have to hold onto her for the time being, Sanji attacked him with Diable Jambe: Extra Hachis, but Moria switched places with Doppelman once more to return to Oars's cockpit and apologized for leaving to have a little fun. After Oars pummeled Sanji and Chopper with Gomu Gomu no Gatling, Moria gleefully noted that there were only three targets left."}, {"type": "paragraph", "text": "Moria ordered Oars to crush the remaining three targets. When Usopp shot a large bag of salt into Oars's mouth in an attempt to purify him, Moria had Doppelman catch the bag and throw it back at Usopp, whom he asked if he did not think Moria would be prepared to counter his zombies' weaknesses. As Oars began stomping on Usopp and Nami, Moria enthusiastically encouraged him while proclaiming that he did not want to be able to identify the Straw Hats as human anymore when Oars was done. However, he was interrupted when Nightmare Luffy appeared, having rescued Nami and Usopp. Wondering if Luffy had the power to transform or if he had absorbed shadows, Moria ordered Oars to destroy him, but was shocked when Luffy stopped Oars's Gomu Gomu no Rifle before proceeding to punch Oars back and slam him into the ground with Moria still inside."}, {"type": "paragraph", "text": "As Luffy continued to toss Oars around, a battered Moria wondered what was going on and called Oars pathetic for being beaten up by a lone pirate before wondering if he should leave the cockpit again. However, he was interrupted by Luffy, who punched him in the face with Gomu Gomu no Pistol before unleashing a barrage of punches on both him and Oars with Gomu Gomu no Storm, causing Oars to crash into the mansion and seemingly knocking out Moria."}, {"type": "paragraph", "text": "After Luffy defeated Oars by shattering his spine, Moria emerged from the cockpit and, upon seeing the Rolling Pirates, noted that he now understood how the now-normal Luffy obtained his powerup while refusing to back down from the fight. Noting that Luffy and his crew were not yet strong enough for the New World, Moria proclaimed that Luffy would lose his entire crew like he did and that he only lost his subordinates because they were alive as black tendrils spread out from him across the ground to the zombies nearby. Activating Shadow's Asgard, Moria proceeded to remove the shadows of one thousand zombies and place them in his own body, resulting in him growing to an enormous and misshapen form, before splitting Thriller Bark in half with a single punch. Seeing this, the Straw Hats got up to confront Moria one last time."}, {"type": "paragraph", "text": "Moria struck at Luffy several times, but the latter managed to evade him due to the speed of Gear Second. When Luffy hit him with Gomu Gomu no Jet Rocket and Gomu Gomu no Jet Bazooka, Moria spit up dozens of shadows due to being unable to fully control all of them, prompting him to trap Luffy with Black Box before smashing the box into a wall. When the crumpled box fell on the ground, Moria stomped on it while claiming that this was Luffy's baptism for not knowing his place by defying a Shichibukai. However, Luffy merely broke out of the box and claimed that he would not be crushed by the world because he was made of rubber, angering Moria, before inflating his body with Gear Third in order to hit Moria with Gomu Gomu no Jet Shell, causing him to spit up even more shadows. Refusing to let his soldiers go, Moria clasped his hands over his mouth in an attempt to keep the shadows in, but Luffy hit him with Gomu Gomu no Jet Shell once more, forcing Moria back into the main mast with such force that it toppled over and fell on him. Finally defeated, Moria told Luffy to go forth and see the real terror of the New World before losing consciousness as the rest of the shadows left his body."}, {"type": "paragraph", "text": "Later, Hogback and Absalom rescued the still unconscious Moria and left Thriller Bark with him on a separate ship."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Moria_Cuts_Luffy%27s_Shadow.png/revision/latest/scale-to-width-down/210?cb=20150226040807", "caption": "Moria cuts Luffy's shadow."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Kuma_and_Moria_Meet.png/revision/latest/scale-to-width-down/210?cb=20140916083309", "caption": "Kuma informs Moria of Crocodile's new replacement, Marshall D. Teach."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c0/Moria_Shadow_Asgard.png/revision/latest/scale-to-width-down/210?cb=20140916083514", "caption": "Moria uses Shadow's Asgard."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the World Government called upon the Shichibukai to help them battle Whitebeard and his allies, Moria answered the call and dined alongside all of his fellow Shichibukai save Jinbe and Boa Hancock."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Moria was present at Marineford alongside Bartholomew Kuma, Donquixote Doflamingo, Dracule Mihawk and Boa Hancock, ready for the battle ahead. He was surprised to learn that Portgas D. Ace was Roger's son."}, {"type": "paragraph", "text": "Upon discovering that Little Oars Jr. is under the command of Whitebeard, Moria expressed an interest in taking the giant's corpse. When Doflamingo cut off Little Oars Jr.'s right leg, an angered Moria decided to demonstrate how to finish him off properly by impaling the giant with Tsuno-Tokage."}, {"type": "paragraph", "text": "When Luffy and his fellow Impel Down escapees fell from the sky and onto the battlefield, an enraged Moria screamed Luffy's title. Wanting to use Luffy's shadow to reanimate Little Oars Jr., Moria attempted to have his zombies fight Luffy, only for Jinbe to splash them with saltwater and reduce them to lifeless bodies. Immediately afterward, Moria was shocked to learn that Luffy was the son of Revolutionary Dragon."}, {"type": "paragraph", "text": "Moria decided to fight Jinbe head-on and absorbed several shadows in order to empower himself, but Jinbe took him down with a single strike. Later, Moria provoked the Whitebeard Pirates' 10th Division Captain Curiel into a fight on the battlefield by stating that he would enjoy seeing Whitebeard die during the war. When Whitebeard was stabbed by Squard, Moria reacted with visible joy."}, {"type": "paragraph", "text": "In the plaza, Moria fought the Whitebeard Pirates and their allies until Whitebeard created a fissure to separate the pirates and the marines. When Whitebeard met his end at the hands of the Blackbeard Pirates, Moria merely smiled while watching."}, {"type": "paragraph", "text": "After Shanks arrived with the purpose of bringing the war to an end, Moria continued to grin. When Sengoku called the war off, Moria stood down along with the rest of the Shichibukai and Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/73/Marineford_Zombies.png/revision/latest/scale-to-width-down/210?cb=20130217151935", "caption": "Moria summons his army of Marine zombies."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d7/Jinbe_Punches_Moria.png/revision/latest/scale-to-width-down/210?cb=20141206162450", "caption": "Jinbe lands a powerful blow on Moria."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Moria was brutally attacked by Doflamingo and a group of Pacifista in the backstreets of Marineford because, according to Doflamingo, Moria was deemed to be far too weak to continue serving as a Shichibukai and was to be eliminated there with the world believing him to have died in the war. When Moria asked him if the order was from Sengoku, Doflamingo merely grinned and revealed that it came from even higher up."}, {"type": "paragraph", "text": "Both Absalom and Hogback rescued Moria from Doflamingo's attack at some point."}, {"type": "paragraph", "text": "Perona later read a newspaper article claiming that he died in the war, though Mihawk questioned the validity of this due to recalling that Moria was alive at the end of the battle. Later, while discussing the incident with a mysterious member of the World Government, Doflamingo revealed that Moria disappeared before he could deliver the killing blow and wondered if Moria's Devil Fruit ability could be the cause of his disappearance, though his mysterious interlocutor had doubts about this. Nonetheless, Doflamingo affirmed that Moria was critically injured and would die no matter what he did."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Moria_Attacked_by_Doflamingo_and_Pacifistas.png/revision/latest/scale-to-width-down/210?cb=20141206164554", "caption": "Doflamingo and a squad of Pacifistas attempting to kill Moria."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Despite Doflamingo's assertions, several people have reported they have seen Moria alive, and he was in hiding somewhere in the New World."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Moria and his zombie army went on a rampage on Blackbeard's island Hachinosu with Moria demanding for Blackbeard while also searching for Absalom. Moria was relieved when he thought he saw Absalom (actually Catarina Devon in disguise) safe and sound, but he was then struck from behind by an invisible Shiryu, and Moria was shocked that Shiryu used Absalom's power. Moria was then furious when Devon revealed herself and stated that Absalom was killed. Moria then heard Blackbeard's voice on a loudspeaker, inviting him to join his crew while also mentioning the morning newspaper."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/62/Moria_Invades_Hachinosu.png/revision/latest/scale-to-width-down/210?cb=20181126180612", "caption": "Moria rampaging on Hachinosu."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Gecko Moria vs. Kaido (past battle, unseen)", "elements": []}, {"text": "Moria and Doppelman vs. Monkey D. Luffy", "elements": []}, {"text": "Moria and Oars vs. Straw Hat Pirates (minus Luffy) and Brook", "elements": []}, {"text": "Moria and Oars vs. Nightmare Luffy", "elements": []}, {"text": "Moria vs. Straw Hat Pirates", "elements": []}, {"text": "Moria (Shadow Asgard form) vs. Monkey D. Luffy", "elements": []}, {"text": "Shichibukai and the Marines vs. Whitebeard Pirates and their allies", "elements": [{"text": "Moria, Bartholomew Kuma and Donquixote Doflamingo vs. Little Oars Jr.", "elements": []}, {"text": "Moria vs. Jinbe", "elements": []}, {"text": "Moria vs. Curiel", "elements": []}]}, {"text": "Moria vs. Donquixote Doflamingo and the Pacifista army", "elements": []}, {"text": "Moria and his zombie army vs. Blackbeard Pirates", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "One Piece Green: Secret Pieces revealed early concepts of Moria, showing how he underwent many transformations before becoming his official appearance. One picture shows an early concept of Moria that looks nothing like his current look, with him wearing a strange mask and a hood. The other shows how first, Moria was supposed to be a pastor who had a split personality, and even after his appearance became closer to that of what he is now, his setting was a schemer that sets traps."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "In the characters description and summary of Volume 47 (page 5) Moria is stated as 元七武海 \"moto Shichibukai\", which can be translated to \"former Shichibukai\" which is inaccurate. However this never appeared in the actual chapters."}, {"type": "paragraph", "text": "Another common mistake is that his nickname is believed to be King of the Depths. In reality, the full name for the Shichibukai is \"Below King Seven Armed Seas\". It was the \"Below King\" part that caused confusion to many people, thus giving the impression that \"Below King\", or \"King of the Depths\", is his nickname."}], "images": []}, {"title": "Anime and Manga Difference", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Moria's hair is red, while in the anime in the Thriller Bark Arc, it is purple."}, {"type": "paragraph", "text": "In the anime, Jinbe claimed that Moria's dependence on absorbing other people's shadow does not actually make him stronger."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "As a prominent character, he has been featured in the fan merchandise. Moria has been featured with the Shichibukai in the series of One Piece Shichibukai Cellphone Strap and twice in the One Piece Super Deformed Figures. He was recently released in theOne Piece DX Figure models. He was released in the One Piece World Collectable Figure series in July 2010 along with the rest of the Shichibukai."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/DXMoria.png/revision/latest/scale-to-width-down/210?cb=20130217150853", "caption": "One Piece DX Gecko Moria figure."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "At Thriller Bark, he told Luffy that with his current strength, he would lose his crew. Not long after that, the Straw Hats did indeed suffer a crushing defeat and separation at the Sabaody Archipelago, thus beginning a training period of two years to prepare themselves for the New World.", "elements": []}, {"text": "In the 5th Japanese Fan Poll, Gecko Moria is ranked the 72nd most popular character in One Piece.", "elements": []}, {"text": "Moria is currently the only known Shichibukai (current or former) without a known epithet.", "elements": []}, {"text": "At 48 years-old, he is the oldest individual known to ever hold a position as one of the Shichibukai.", "elements": []}, {"text": "Based on his name, his animal theme is a gecko.", "elements": [{"text": "Both parts of his name may support his theme: Gecko, in Japanese means \"moonlight\" (which suits his horror theme as well), and may also come from the English word gecko, a type of lizard, and \"Moria\" may come from 蠑螈 which can be read as \"imori\", meaning \"newt\". And the bolded letters of Gecko Moria, which makes Komori, means \"bat\" in Japanese.", "elements": []}, {"text": "It is also possible that the character's name makes reference to the novel \"The Island of Dr Moreau\", by H. G. Wells, in which a scientist by the name of Doctor Moreau gets stranded on an island and makes experiments, creating monsters by mixing the body parts of animals and men. The similarities between the plot of the novel and the elements of the Thriller Bark arc, along with the similar sounding names of the masters of the islands, seem to confirm the idea that Moria's name is, at least in part, a reference to Moreau.", "elements": []}]}, {"text": "He is one of the few characters that keep their unique laugh in the FUNimation dub.", "elements": []}, {"text": "Gecko Moria is the first character who was able to imitate the usage of the Gomu Gomu no Mi using a different Devil Fruit, the Kage Kage no Mi. The second and third being Charlotte Brûlée and Charlotte Katakuri using the Mira Mira no Mi and Mochi Mochi no Mi respectively.", "elements": [{"text": "While Brûlée and Katakuri used the techniques themselves, Moria used Kage Kakumei to manipulate Oars' shadow to perform the attacks.", "elements": []}, {"text": "Bentham tried to fool Magellan by using Gomu Gomu no Okama Pistol, Okama Gatling, and Okama Giant Scythe, though he only copied the naming pattern and not the attacks themselves.", "elements": []}]}, {"text": "Moria's favorite food is marinated caviar.", "elements": []}]}], "images": []}]}