{"sections": [{"title": "Wadatsumi", "level": 1, "content": [{"type": "paragraph", "text": "\"Large Monk\" Wadatsumi is a giant tiger blowfish fish-man and a member of the Sun Pirates. He was formerly a member of the Flying Pirates under captain Vander Decken IX before they were defeated."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Wadatsumi is an enormous fish-man, equal in size to the head of the kraken, Surume. He is large enough to make the giant-sized Shirahoshi and Megalo look like a regular-sized mermaid and shark. His round head and chest are quite big in comparison to his arms and legs. His hands are webbed. He has a big, round face, with a large mouth full of massive, round teeth quite distant from one another, and child-like eyes. He has some stubble on his chin and dark hair surrounding his head, taking the shape of a protrusion pointing upward at the top, which also covers a part of his shoulders. His whole body is also quite hairy."}, {"type": "paragraph", "text": "He apparently wears a pair of extremely loose pants paired with a dark indument tied around his waist, and has been seen walking barefoot."}, {"type": "paragraph", "text": "His overall shape, size, and eyes strongly resemble that of Sanjuan Wolf's. Due to his appearance, Wadatsumi was incorrectly called an Umibozu by Usopp. Members of the New Fish-Man Pirates also refer to him as such."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is loyal and obedient, following Decken's every command without question. Despite his huge size, his personality appears to be childlike, mirrored by his extremely childlike voice in the anime. Believing Decken has abandoned him, Wadatsumi cried and complained, but recovered when he was deceived into thinking he misheard, showing that Wadatsumi is naïve and gullible."}, {"type": "paragraph", "text": "Contrary to the nasty reputation and behavior of his crew and captain, Wadatsumi seems to be more of a gentle and kind nature, as he destroyed two towns only due to sheer carelessness, which he apologized for in a genuinely remorseful manner, and cheerfully celebrated with the citizens upon resolving the situation. Another example was at Whole Cake Island, where after he reunited with some of the Straw Hat crew, Wadatsumi apologized for the trouble he gave them before at Fish-Man Island."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Vander Decken IX", "level": 4, "content": [{"type": "paragraph", "text": "Wadatsumi was once loyal to Decken until the latter abandoned him when he was trying to kill Shirahoshi."}], "images": []}, {"title": "Sun Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Wadatsumi became a member of the Sun Pirates after following Jinbe. Wadatsumi stated he had fun hanging around with the Sun Pirates."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Though initially enemies, Wadatsumi has become close friends with Jinbe, helping the latter to transport a Poneglyph to Totto Land. Later, Wadatsumi destroyed several of the Big Mom Pirates' ships to assist Jinbe."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Due to his great size, and the fact that he is a fish-man, he is extremely powerful. He hurt Ankoro, a fish several times the size of the Thousand Sunny, with a single punch despite not meaning to. He is also capable of picking up, carrying, and throwing entire buildings. He helped Jinbe transport an enormous and heavy poneglyph. Because of his size, he can easily create disturbances in the water; simply bursting out of the sea in the middle of the Big Mom Pirates' fleet was enough to send several ships flying into the distance. As a fish-man, he is capable of breathing underwater as well as surviving the crushing pressure of 10,000 meters below sea level. Being a tiger blowfish fish-man, he is also capable of inflating himself, thus increasing his already enormous size. "}, {"type": "paragraph", "text": "After taking an Energy Steroid, his great strength increases further by being able to defeat Surume with one blow. He also has high stamina, taking powerful strikes from Jinbe and Sanji respectively and only slightly complaining about the pain."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/18/Inflation.png/revision/latest/scale-to-width-down/240?cb=20141127202023", "caption": "Wadatsumi puffing himself up."}]}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Mega Nyudo (メガ入道, Mega Nyūdō, literally meaning \"Mega Monk\"): Wadatsumi inhales a large amount of air, and expands his stomach to enormous proportions, crushing anything in his vicinity. If needed, he can expand even more, furthering his size. However, he must hold his mouth to prevent the air from leaking out, and if he wishes to talk, he must speak in a fast pace to prevent air leakage. As he says, in this form he attacks by rolling into the battlefield, crushing all enemies in his way. This was first seen used against Sanji, though he indiscriminately crushed his New Fish-Man Pirates allies. This is called Mega Monk in the Viz manga and FUNimation sub.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "While the Straw Hat Pirates were sailing through the Underworld of the Sea, Wadatsumi suddenly appeared from the rocks beneath the sea. He beat an angler fish with one blow to prevent it from eating the Thousand Sunny because the captain of the Flying Dutchman, Vander Decken IX, wanted their treasure. On Vander Decken's orders, Wadatsumi attempted to punch the Thousand Sunny, but the kraken (which had been tamed by Luffy, Zoro, and Sanji) intervened and knocked out Wadatsumi."}, {"type": "paragraph", "text": "When the volcano erupted, Vander Decken ordered Wadatsumi and Ankoro to pull the ship away from the magma. As the water temperature rose, he and the Flying Dutchman were thrown forward."}, {"type": "paragraph", "text": "Later while Wadatsumi walked on the sea floor and pulled the Flying Dutchman, Vander Decken IX asked how many years it had been that the Mermaid Princess had not replied to his letters. Wadatsumi answered that it had been ten years and the princess still had not replied, enraging Decken. In Noah in the Fish-Man District, Wadatsumi watched as Vander Decken IX and Hody Jones formed an alliance."}, {"type": "paragraph", "text": "After Luffy took down Decken at Coral Hill, Decken called out to Wadatsumi to prevent Princess Shirahoshi from escaping. Before Wadatsumi attacked, Luffy beat him back with a Jet Pistol, breaking off one of his teeth. Wadatsumi cried out in pain as Shirahoshi, Luffy, and their friends escaped."}, {"type": "paragraph", "text": "Back in the Fish-Man District, Wadatsumi ran away, deeply shocked that his captain \"threw\" Noah toward Shirahoshi."}, {"type": "paragraph", "text": "When Noah and the Flying Pirates arrived in Gyoncorde Plaza, Wadatsumi fell into the plaza and begged for his life. Decken replied that he cannot stop the boat anymore and that he would become a necessary sacrifice for the end of Fish-Man Island. Fortunately, the boat went after Shirahoshi, who had left the island to sacrifice herself."}, {"type": "paragraph", "text": "Wadatsumi was then beaten up by Surume. Saddened by Decken's betrayal, the giant had no will to fight back. Zeo talked Wadatsumi into fighting and gave him an Energy Steroid. Now stronger than before, Wadatsumi defeated Surume. He then tried to attack Jinbe, who managed to deflect the attack, causing Wadatsumi to fall to the ground. Sanji then kicked him in the head, forcing the giant to stand up. Wadatsumi fought against Jinbe and Sanji. Regardless of his size, Wadatsumi felt pain from their attacks."}, {"type": "paragraph", "text": "Having a difficult time, Wadatsumi started inflating himself, growing to a size that doubled his normal one. Sanji, standing on Wadatsumi's cheek, was not at all afraid of Wadatsumi's new form and started mocking him, telling him that Surume is still bigger than him. Wadatsumi fell for it and sucked in even more air, growing and crushing many New Fish-Man Pirates in the process, with Sanji still standing firm with his previous statement."}, {"type": "paragraph", "text": "As Luffy pummeled Hody and Noah, Sanji stood on an almost-spherical Wadatsumi, who kept asking if the chef was surprised yet. While obviously neither him nor Jinbe were, they decided to execute their unseen plan."}, {"type": "paragraph", "text": "Jinbe surrounded his right hand in water and hit Wadatsumi with Buraikan, which entered the giant on one side and exploded out of the other side. Wadatsumi began rolling away, but as he could not hold his breath any longer, he released the air he took in and blasted himself away. Sanji followed Wadatsumi into the sky and unleashed his rage by thinking back to the torture he had to go through during the last two years. His whole body engulfed by flames, Sanji kicked Wadatsumi with Hell Memories, a fire-attack so powerful it completely scorched Wadatsumi. With that, Wadatsumi was finally defeated. The unconscious Wadatsumi then fell on his unfortunate comrades who did not flee the plaza in time."}, {"type": "paragraph", "text": "After the battle, a still unconscious Wadatsumi was banished from Fish-Man Island (because he was too big to fit in any prison they have), and was carried away by Surume to the far reaches of the ocean."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Surume_Knocks_out_Wadatsumi.png/revision/latest/scale-to-width-down/250?cb=20130512041011", "caption": "The Kraken knocks out Wadatsumi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0d/Wadatsumi_Knocks_out_Surume.png/revision/latest/scale-to-width-down/210?cb=20130512040810", "caption": "Wadatsumi knocks out Surume."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/df/Hell_Memories.png/revision/latest/scale-to-width-down/250?cb=20130925204413", "caption": "Wadatsumi is burned up by Sanji."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/Surume_takes_care_of_Wadatsumi.png/revision/latest/scale-to-width-down/250?cb=20130121230013", "caption": "Wadatsumi being carried away by Surume."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Solo Journey of Jinbe, Knight of the Sea", "level": 4, "content": [{"type": "paragraph", "text": "Some time later, Wadatsumi traveled to a port town and posed as a sea god. In return for the offerings given to him, Wadatsumi raised up the homes at the bottom of the sea. He encountered Jinbe again while the former Shichibukai was investigating the disappearance of a Sea Kitten's home. Having destroyed two towns due to his carelessness, Wadatsumi earned himself a scolding from Jinbe. Wadatsumi and the Sea Beasts later apologized to the townspeople for the trouble they caused. After they made peace with each other, Wadatsumi, Jinbe, the locals, and the Sea Beasts decided to have a feast together. On the next day, Wadatsumi asked Jinbe if he could come along with him. After bidding the townspeople and the Sea Beasts farewell, Wadatsumi left with Jinbe."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Wadatsumi was with the Sun Pirates while Jinbe was discussing with them about his intention to leave the Big Mom Pirates and join Luffy's crew. Jinbe apologized to him for coming such a long way but Wadatsumi stated that it was alright. Later on, Wadatsumi and the Sun Pirates were instructed by Jinbe to leave Totto Land during the wedding ceremony due to security being busier with the events than focusing on them."}, {"type": "paragraph", "text": "Hours later, Wadatsumi and the Sun Pirates arrived at Cacao Island to aid Jinbe and the Straw Hats in their escape. The Sun Pirates cleared a path for the Thousand Sunny, but Charlotte Oven attacked them by boiling the sea. Before the Queen Mama Chanter destroyed the Sunny, Wadatsumi switched it with the Sun Pirates' ship and hid the Sunny in his mouth. Wadatsumi then tried swimming far away from the Big Mom Pirates, but Oven attacked him with heat waves, forcing him to spit out the Sunny. Wadatsumi apologized to the Straw Hats for the trouble at Fish-Man Island before he was incapacitated. He then joined the rest of the Sun Pirates in holding off the Big Mom Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/29/Wadatsumi_Saves_the_Thousand_Sunny.png/revision/latest/scale-to-width-down/210?cb=20190317032328", "caption": "Wadatsumi saves the Sunny."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Wadatsumi vs. Surume", "elements": []}, {"text": "Wadatsumi vs. Monkey D. Luffy", "elements": []}, {"text": "Wadatsumi vs. Surume (Gyoncorde Plaza)", "elements": []}, {"text": "Wadatsumi vs. Sanji and Jinbe", "elements": []}, {"text": "Sun Pirates and Jinbe vs. Big Mom Pirates", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "\"Onyudo\" (大入道, Ōnyūdō), Wadatsumi's nickname, literally means \"large, bald-headed monster\" or \"giant\"; the FUNimation subs use the term \"Giant Monk\". \"Umibōzu\", which is what Usopp incorrectly refers Wadatsumi as, means \"sea bonze\", a Japanese mythological spirit. Wadatsumi's name itself is derived from \"Watatsumi\", the name of the Japanese sea god and dragon of Shinto religion."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He is the largest fish-man to date and the only one so far to have no obvious fish-man appearance to him, aside from a dorsal fin and webbed hands.", "elements": []}, {"text": "Wadatsumi has his own unique laugh that goes \"Fugufugufugu\". Fugu is the Japanese word for blowfish.", "elements": []}, {"text": "Similar to Fukurou, in the anime Wadatsumi is given a childish voice that does not match his physical appearance at all, but matches his childish personality.", "elements": []}, {"text": "Wadatsumi is the only major character who ate an Energy Steroid without showing signs of age or weakness from the drug's side-effects, though he only ate a single one, as opposed to the other New Fish-Man Pirates who ate several at once.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Umibōzu – Wikipedia article about the legendary sea monster Usopp mistakes him for.", "elements": []}, {"text": "Watatsumi – Wikipedia article about the Japanese sea god/dragon he is named after.", "elements": []}, {"text": "Takifugu rubripes – Wikipedia article about the species of fish he is.", "elements": []}]}], "images": []}]}