{"sections": [{"title": "Vander Decken", "level": 1, "content": [{"type": "paragraph", "text": "Vander Decken was the first captain of the Flying Dutchman."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "According to legend, Vander Decken went deranged one night and murdered his own crew, defying even heaven itself, and incurring the wrath of God. Though legends do have their inaccuracies, it was only clear that he was mad."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "According to legend, Vander Decken was powerful enough to throw his entire crew overboard. However, Pappag did state that legends tend to exaggerate so the legend of Vander Decken is not entirely credible."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "In the flashbacks involving Vander Decken, he is seen wielding a sword."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Cursed History", "level": 3, "content": [{"type": "paragraph", "text": "According to legend, on a stormy day hundreds of years ago, Vander Decken suddenly became deranged and began killing off his crew mates by throwing them off the ship. He then invoked the wrath of God by defying him. As a punishment, he and his ship were forced to wander the seas forever. However, though it was clear that Decken was mad, as legends tend to exaggerate, several points are debatable."}], "images": []}, {"title": "Death and Legacy", "level": 3, "content": [{"type": "paragraph", "text": "Vander Decken came to the ocean floor to search for the legendary Mermaid Princess who possesses the power to command Sea Kings. Unfortunately, he never achieved his goal. He ultimately died on Fish-Man Island and the knowledge of the mermaid princess of legend was passed down to his descendants, who have been piloting the Flying Dutchman ever since. The current captain is his eighth generation grandson, Vander Decken IX, who found the princess of legend, but failed to marry her as he was arrested."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The captain of the Flying Dutchman was unnamed in the original legend. The first version of the legend as a story was printed in \"Blackwood's Edinburgh Magazine\", which names the captain 'Van der Decken'. The name means \"of the deck\" and was also used in the Gothic novel \"The Phantom Ship\" by Frederick Marryat.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 606 and Episode 525, Brook speaks of the legend of Vander Decken.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 610 and Episode 529, Pappag explains that Decken's legend is exaggerated.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 625 and Episode 545, Decken IX speaks of his ancestor's goal of finding the Mermaid Princess.", "elements": []}]}], "images": []}]}