{"sections": [{"title": "Hammond", "level": 1, "content": [{"type": "paragraph", "text": "Hammond is a member of the New Fish-Man Pirates. He is a Daggertooth pike conger Fish-Man."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hammond is a slim-looking bright yellow skinned Fish-Man with medium-length, puffy orange hair and a long and squarish neck with a small beard. His facial features are quite sinister: they include a long and sharp beak-like muzzle, razor-like teeth, and dark, glaring eyes. On his neck he has the tattoo of the Arlong Pirates symbol near his left shoulder, in honor of Arlong and his ideals. He also wears the New Fish-Man Pirates tattoo on the right side of his abdominals."}, {"type": "paragraph", "text": "Hammond wears a long-sleeved black coat with a striped undershirt, both of which he keeps open to display his tattoos. Hammond wears shin-high, frayed white pants with a mint-green sash and black sandals. On his head he has a black fedora and earrings on both ears."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hammond is a Fish-Man who, like Arlong, views humans as an inferior race. He is a very proud Fish-Man and extends this to other sea creatures, such as Surume, whom Hammond criticized for allowing Luffy to order him around. When meeting the Straw Hat Pirates he gives them the ultimatum to either enlist under the banner of the New Fish-Man Pirates or die. Even in his arrogance, though, he is surprisingly thoughtful, as he carefully thought out the Straw Hats' list of offenses and appeasements to the Fish-Men, and was considerate enough to view pirates as enemies of humanity (despite most of them being humans themselves) that he gives them the choice of siding with them or being destroyed. It also seems that he fears, or at least deeply respects his captain, since he was visibly nervous in his captain's presence. Like many other characters, Hammond has his own Laughter Style: \"Hamo hamo hamo\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Fish-Man, he is capable of breathing and surviving deep underwater, as was seen when he appeared to the Straw Hats 10,000 meters under the sea without being in a bubble. Hammond's strength and fighting style were never fully revealed, but as a Fish-Man, he is born with the strength that is tenfold of average humans, and even more so underwater. He was seen riding huge sea-animals that can probably aid him in battle."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "list", "elements": [{"text": "Utase Ami (打瀬網, Utase Ami, literally meaning \"Sailing Trawl Net\"): Hammond was first seen in battle when he used a rifle equipped with trawl nets, trying to capture the Straw Hats. Failing to do so, he was defeated by Luffy in one hit. In the Viz manga, this is called Bay-o-net and in the FUNimation subs and dub, this is called Trawl Net.", "elements": []}]}, {"type": "list", "elements": [{"text": "Dorei Tank (奴隷タンク, Dorei Tanku, literally meaning \"Slave Tank\"): Hammond rides on a platform with two cannons mounted on the front and one on the back. The platform is carried by enslaved human pirates in place of wheels, with four at the front and four at the back; if any of them fall from fatigue, Hammond simply finds a replacement, with the fallen one still being dragged on the ground by the chain around his neck. Upon Nico Robin freeing the humans, they threw the platform, alongside Hammond, away.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Utase_Ami.png/revision/latest/scale-to-width-down/230?cb=20130201034541", "caption": "Utase Ami."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the Straw Hats escape the eruption of the undersea volcano they are confronted by Hammond, Hyouzou and Kasagoba, who are all riding on sea creatures larger than the Kraken. He weighs Luffy's crimes against the Arlong Pirates but also took into account the Straw Hats protecting Hatchan and assaulting one of the World Nobles. He gives the Straw Hats a choice between joining the New Fish-Man Pirates or dying. Luffy, without a care in the world, rejects the offer. The Straw Hats then use Coup de Burst to escape from the New Fish-Man Pirates and fly directly into Fish-Man Island. When asked what to do by a subordinate, Hammond says that they will go after them in case the Straw Hats are still alive, adding that it would be quite troublesome for their cause if the Neptune Army were to discover the pirates' presence within the island before they do. But first, he and the other fish-men will have to go to Noah, and tell their boss about the Straw Hat Pirates."}, {"type": "paragraph", "text": "Later, he is seen in Noah, telling his boss about the Straw Hat Pirates. His boss told Hammond to bring the pirates to him."}, {"type": "paragraph", "text": "Hammond is next seen hiding behind coral reefs when the Neptune Brothers paid a visit to the Mermaid Cove in search for the Straw Hats."}, {"type": "paragraph", "text": "When Luffy, Usopp, and Chopper are asking for a blood donation for Sanji, who had an extremely massive nosebleed, Hammond appears and tells the Straw Hats about how Fisher Tiger died. After a gruesome battle, Fisher Tiger suffered critical blood loss and could have been saved with a blood transfusion, but humans refused to help him. Hammond goes on to say that because of the humans who left Fisher Tiger to die, there is a law that prevents Fish-Men and merfolk from sharing blood with humans."}, {"type": "paragraph", "text": "He also states that Hody Jones, the New Fish-Man Pirates' captain, wants to see them. Hammond and his comrades attempt to capture the four Straw Hats by shooting a net at them, but Luffy repels the New Fish-Man Pirates. One of their sea monsters tries to attack Luffy, but the Straw Hat captain subdues it with Haki. "}, {"type": "paragraph", "text": "After the four Straw Hats left to find a blood donor for Sanji, Hammond is seen being carried away by his octopus merman companion, Hyouzou."}, {"type": "paragraph", "text": "Later, Hammond is seen again amidst the battle in Gyoncorde Plaza, still clearly recovering from Luffy's attack as he has a neck-brace and bandages. He is riding on what he calls the \"Slave Tank\" which is pulled by Hody's human pirate slaves. When one of the slaves passes out from exhaustion, Hammond tells the others to leave him as they will get another. Jinbe asks Robin to free the slaves, showing his disgust that the New Fish-Man Pirates are acting like the World Nobles, and she agrees to do so."}, {"type": "paragraph", "text": "Robin manages to get the key to the slaves' shackles and frees them as requested. Once freed, the slaves throw Hammond to the ground. He recovers and tries to capture Robin with a trawl net but it only caught a clone made from her Devil Fruit powers. Robin then makes a clone on Hammond's back where she grabs Hammond's legs with multiple arms and performs a Double Clutch move, breaking Hammond's back. He wasn't seen again after the battle ended, but it is likely he was put on probationary work with the rest of the lower members."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fa/Hammond_Easily_Defeated_by_Luffy.png/revision/latest/scale-to-width-down/235?cb=20130404172602", "caption": "Hammond is easily defeated by Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b8/Hammond%27s_Slave_Tank.png/revision/latest/scale-to-width-down/210?cb=20131128040130", "caption": "Hammond and his \"Slave Tank\"."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hammond, Hyouzou, and Kasagoba vs. Monkey D. Luffy", "elements": []}, {"text": "Hammond vs. Nico Robin", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Hammond's name and laughing style are a reference to his fish species. In Japanese, the daggertooth pike conger is called Hamo."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hammond appeared beardless in Chapter 608; this was later fixed in the following chapter.", "elements": [{"text": "Similarly, in his anime debut, he is seen without his beard in some frames, possibly due to the manga's mistake.", "elements": []}]}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Daggertooth pike conger – Wikipedia article about the type of Fish-Man that Hammond is.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 607 (p. 16) and Episode 526, Hammond is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 139), Hammond's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 607 (p. 15-16) and Episode 526, Hammond first appears.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 65 Chapter 642 and Episode 563, Hammond rides on the Slave Tank.", "elements": []}]}], "images": []}]}