{"sections": [{"title": "Perona", "level": 1, "content": [{"type": "paragraph", "text": "\"Ghost Princess\" Perona was the commander of the Wild Zombies and Surprise Zombies of Thriller Bark prior to its collapse. She was one of the Mysterious Four and one of the major antagonists of the Thriller Bark Saga."}, {"type": "paragraph", "text": "After the defeat of Gecko Moria's army and during the timeskip, she begrudgingly helped and cooperated with Roronoa Zoro while in Dracule Mihawk's home on Kuraigana Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Perona is a short young woman with unusually big, round eyes, and she has long, light pink hair that she keeps tied into two pigtails with black and white flower hairpins. She wears a red crown with a black cross on her head, as well as red lipstick and a thick layer of black eyeliner. Her white long-sleeved three different black heart shapes shirt was short enough to expose her belly.  She wears a red mini cape with a pink ribbon on front. Her black and white striped tights completely cover her legs, and she wears a mini-skirt and a red and gold belt with a heart belt buckle, as well as red buckled boots. She usually keeps her toes pointing inwards in a pigeon-toed manner, and carried around a red parasol shaped like a cute version of a mini devil prior to her battle with Usopp."}, {"type": "paragraph", "text": "As a child, Perona carried the same parasol and wore the same crown and hairpins, but wore her hair in much thicker pigtails and wore a simple, knee-length red dress with a white wave pattern and dots around its center, as well as smaller red boots. She also carried a ghost doll around on a leash, and was accompanied by a bear named Kumae."}, {"type": "paragraph", "text": "When first meeting Hogback ten years prior to her encounter with the Straw Hat Pirates, Perona wore the same crown, but the rest of her outfit was not clearly visible, though she seemed to be wearing a similar dress."}, {"type": "paragraph", "text": "After the two year timeskip, Perona has a more mature look than before, wearing a long black strapless dress with lavender frills, red high heeled boots and a big black top hat with white floral decor. She has a pink bat tattoo on her left bicep and a watch on her left wrist, and wears pink nail polish on her fingernails. She still has her signature parasol, and also carries a stuffed animal resembling Kumashi with her. Additionally, she now wears her hair in multiple spiral braids on the back of her head."}, {"type": "paragraph", "text": "While reading about the Straw Hats' actions on Dressrosa and resulting new bounties, she wore a collared shirt with short ruffled sleeves and a short dark tie hung loosely around her neck. She wore short frilly skirt with a line of crosses. She had short boots with bows on the front. She also had a large straw hat with a bow and large crown on top of it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Perona is very childish and immature, frequently acting on her own whims. She dislikes people telling her what to do and disobeying her will. Despite this, she is normally loyal to Gecko Moria and apparently sees him as a way of protection, as she was crying to rejoin him after being sent to Kuraigana Island. After Zoro appeared on Kuraigana as well, she tended to his wounds, displaying a willingness to befriend even those she formerly knew as a foe and demonstrating that she can be kind to others, despite her normally cruel demeanor."}, {"type": "paragraph", "text": "She is very fond of cute things, and will only allow someone to work for her if they are cute. Her dream is to create a kingdom where all the cute things in the world have been turned into zombie animals that obey only her. She dislikes Kumashi because, although he is cute in appearance, his voice is not, and thus she prefers him to just be quiet. Her desire for cute things gives her a slightly childish outlook on some issues. She is somewhat playful during combat, threatening to crush Usopp's heart when she was in her ghost form, which nearly caused Usopp to die from fear, and shortly afterward merely laughing it off when revealing that she could not do so."}, {"type": "paragraph", "text": "Perona has katsaridaphobia, a fear of cockroaches, to the point of screaming and crying when Usopp covered her with fake ones. She is also somewhat naive, having watched Usopp seemingly lift a 10-ton hammer without questioning whether or not his feat was genuine, and shortly afterward passing out from fear when he attacked her with it, despite not actually being harmed."}, {"type": "paragraph", "text": "She is very confident in her Devil Fruit powers being able to defeat anyone. Even when confronted by the powerful and dreaded Shichibukai Bartholomew Kuma, after initially being frozen with fear, Perona quickly regained her confidence and proclaimed that she would defeat him. She is also quite stubborn about using them in combat, having continued to use her Negative Hollows against Usopp even after they proved useless due to his negativity because she believed that his immunity was a fluke."}, {"type": "paragraph", "text": "After the timeskip, she has become more mature, although she still carries a teddy bear around, indicating that she is still obsessed with cuteness to some degree. She displayed a grateful side, as she tearfully thanked Dracule Mihawk for letting her stay on his island."}, {"type": "paragraph", "text": "Like many others, Perona has her own unique laugh, which uses the word Horo (e.g. \"Horo-horo-horo-horo-horo!\"); this is based on the name of her Devil Fruit, the Horo Horo no Mi."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Perona%27s_Shocked_Face.png/revision/latest/scale-to-width-down/210?cb=20141019091315", "caption": "Perona's face when she is shocked."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a0/Perona_Screaming_In_Fear.png/revision/latest/scale-to-width-down/210?cb=20131027182107", "caption": "Perona screams in fear at being covered in cockroaches."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Thriller Bark Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Perona followed her master, Gecko Moria, for at least ten years. Her loyalty to him is somewhat complex: when she sensed defeat, she attempted to leave and abandon him while noting that she had only stayed with him for fun, but tried to take Bartholomew Kuma down as a final gift for Moria. Despite not clearly showing it, she is said to love Moria like a father since he found her and raised her as a child, and when the newspaper falsely reported that Moria died in the Whitebeard War, Perona was deeply saddened. When she learned that Moria is alive two years later, Perona is overjoyed and she quickly departed Mihawk's castle to go find him."}, {"type": "paragraph", "text": "Perona had a mixed relationship with her teddy bear servant, Kumashi. While she considered him to be cute in appearance, she forbade him from speaking because his voice is not cute. However, she was devastated when Usopp purified Kumashi."}], "images": []}, {"title": "Straw Hat Pirates", "level": 3, "content": [{"type": "paragraph", "text": "While on Thriller Bark, Perona became enemies with one particular member of the Straw Hat Pirates, Usopp, due to the latter becoming the first person to ever resist the effects of her Negative Hollows and later defeating her in a humiliating manner. She looked down on Nami when the latter confronted her later, claiming that she could easily defeat Nami with her Mini Hollows because Usopp was her only natural enemy."}, {"type": "paragraph", "text": "After encountering Zoro on Kuraigana Island, she was shocked to see him but decided to treat his wounds as he was the only other person there at the time. Despite their initial quarrels, the two developed a relationship of mutual trust by living on the island for two years alongside Dracule Mihawk. She also willingly brought Zoro back to Sabaody Archipelago and later held back the Marines in order to allow the Straw Hats to escape."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/Perona_Scolds_Zoro.png/revision/latest/scale-to-width-down/210?cb=20130209201427", "caption": "Perona scolds Zoro."}]}, {"title": "Dracule Mihawk", "level": 3, "content": [{"type": "paragraph", "text": "After being sent to Kuraigana Island by Kuma's abilities, Perona decided to take residence in the castle where the Shichibukai lives. Mihawk seemingly agreed or simply did not mind letting her stay with him, though he did not display any hospitality toward her beyond that."}, {"type": "paragraph", "text": "It was shown in From the Decks of the World: The 500,000,000 Man Arc that even after going back to Thriller Bark to retrieve Kumashi, she returned to Kuraigana Island and was seen helping him with his work in tilling the land, suggesting a good status between them. When she learned of her old master's survival, she was upset that Mihawk didn't tell her and nearly left as he told her to be safe while she tearfully thanked him for letting her stay with him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being formerly one of the Mysterious Four, Perona had a number of zombies under her command prior to her defection from Thriller Bark. Her ex-crewmate, Doctor Hogback, acknowledges her value under Moria's employment."}], "images": []}, {"title": "Medical Expertise", "level": 3, "content": [{"type": "paragraph", "text": "While she seems to recognize that bandages can help a person who is wounded, she seems to lack expertise in medicine. During the process of treating Zoro's wounds, she covered him from head to toe in an overabundance of bandages the first time she found him. However, despite this fault, she has common sense or enough knowledge of medical skills, as Zoro recovered from his injuries."}], "images": []}, {"title": "Navigation Expertise", "level": 3, "content": [{"type": "paragraph", "text": "She  has at least some knowledge of navigation, demonstrated when she brought Zoro to Sabaody Archipelago all the way from Kuraigana Island."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Perona ate the Horo Horo no Mi, a Paramecia-type Devil Fruit that allows her to conjure ghosts with the power to drain the morale and self-esteem of anyone they touch; they can also be used to form a \"Ghost Network\" for surveillance. She either conjures up one or more ghosts or projects her own spirit and splits it into many ghosts, able to re-enter her body whenever she pleases. Using this ability to form her ghost network, Perona can see and hear whatever the ghosts can and uses this ability for espionage. Once formed, the ghosts can split up into even more ghosts."}, {"type": "paragraph", "text": "When a person has a ghost pass through them, they are drained of all their will to live, leaving them slumped on the ground while regretting even being born, which renders them an easy target. However, when her Horo Horo no Mi powers failed to stop Usopp, Perona herself became negative."}, {"type": "paragraph", "text": "Perona can also create smaller ghosts known as Mini Hollows that explode with enough force to damage stone walls and a giant ghost that produces an even more powerful blast, She can also create an astral projection of herself, which cannot be hurt through any means. She can pass through solid objects in this form, although she cannot damage them, and change the size of her body. However, while she is doing this, her true body remains unconscious and vulnerable; to negate this, she usually hides before resorting to astral projection."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/70/Giant_Perona.png/revision/latest/scale-to-width-down/210?cb=20141206164659", "caption": "Perona's astral projection."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When she was a child, Perona owned a pet bear named Kumae. At some point in her childhood, she met the pirate Gecko Moria who took her in and raised her and she eventually saw him as a father figure."}, {"type": "paragraph", "text": "Over 10 years ago, she joined Moria's crew merely for fun. She and Absalom were present when Moria met and recruited the genius doctor, Hogback."}, {"type": "paragraph", "text": "Five years ago, she was sleeping while Brook was causing trouble in Thriller Bark, which would later cause her to not know what he looked like when he returned. When Kumashi tried to wake her up, she simply told him to shut up and went back to sleep."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Hogback_Meets_Moria%2C_Absalom_and_Perona.png/revision/latest/scale-to-width-down/210?cb=20150526221934", "caption": "Perona witnesses the meeting between Moria and Hogback."}]}, {"title": "Thriller Bark Saga", "level": 3, "content": [], "images": []}, {"title": "Thriller Bark Arc", "level": 4, "content": [{"type": "paragraph", "text": "Perona used her Ghost Network to scout out the Thousand Sunny and later reported the crew's bounties to Hogback and Absalom."}, {"type": "paragraph", "text": "In the Dead Forest, a group of Negative Hollows encountered some of the Straw Hats and, after evading capture, demoralized Monkey D. Luffy, Franky, and Roronoa Zoro. As the Night Attack began, Perona recalled her ghosts and rallied her Wild Zombies and Surprise Zombies. When she left to oversee the looting of the Thousand Sunny, she ordered Kumashi to meet the Risky Brothers, who were carrying Nami, Usopp, and Tony Tony Chopper in coffins, and take them to the Dance Hall."}, {"type": "paragraph", "text": "On the Thousand Sunny, Perona was frustrated at the lack of treasure and had the food taken from the ship. Hildon reported to Perona that Moria was gathering the other members of the Mysterious Four because he had captured Luffy and would be debuting Zombie 900, much to her surprise. Soon afterward, Perona returned to her room, where she found Absalom speaking with Kumashi about the escape of Nami, Usopp, and Chopper. After scolding Kumashi for trying to speak, Perona informed Absalom that Moria was calling them together and explained why he was doing so. In the Mast Mansion, the Mysterious Four discussed Luffy and the Straw Hats, and Perona reported that Nami, Usopp, and Chopper had escaped before yelling at Kumashi when he tried to correct her. When Luffy broke free from his cage, Perona quickly stopped him with her Negative Hollow before watching on as Moria removed Luffy's shadow. After hearing Nami, Usopp, and Chopper talking inside Kumashi and believing that it was Kumashi himself doing so, Perona proclaimed that her dream of creating a kingdom full of cute subordinates was closer to fruition with Luffy's shadow extracted. When two Spider Mice appeared and reported that Tararan's shadow had been extracted, Hogback noted that it could only have been the \"Humming Swordsman\", a name which Perona did not recognize. Soon afterward, Perona accompanied the rest of the Mysterious Four to the enormous freezer containing the corpse of Oars. Perona watched as Moria used Luffy's shadow to revive Oars's corpse. When Oars awoke, Nami, Usopp, and Chopper screamed and fell from Kumashi's back, prompting Perona to yell at Kumashi for hiding the pirates. Perona continued to chastise Kumashi for hiding the pirates without letting him respond."}, {"type": "paragraph", "text": "After reporting Oars's current activities to Moria, Perona learned that the Straw Hats had learned of the zombies' weakness to salt and were approaching them, with the General Zombies preoccupied with attending Absalom's wedding, but dismissed Hogback's worry over the zombies' weakness being known and retired to her room before attacking the Straw Hats with her ghosts, planning to weaken them enough to be taken by Soldier Zombies. However, Perona's attack was interrupted by Oars crashing down through the mansion. After Franky rebuilt the destroyed bridge, he, Zoro, Sanji, and Usopp charged into Perona's room, where Perona confronted them. After explaining the powers granted by her Devil Fruit, Perona sent a Negative Hollow through each of the Straw Hats, but Usopp was unaffected and purified several of her zombies before declaring that he was always negative, shocking Perona, who tried to cheer him up alongside her zombies before preparing to battle him."}, {"type": "paragraph", "text": "Believing Usopp's immunity to have been a fluke, Perona sent four Negative Hollows through him, but instead became depressed herself alongside her ghosts, to the shock of her zombies. Soon afterward, Perona fled from Usopp while noting that she could defeat the other Straw Hats if it were not for him. After Kumashi distracted Usopp by attacking him, Perona projected her spirit from her body after hiding and tricked Usopp into believing she was flying while proclaiming that she had come up with a plan to defeat him. Declaring that she had simply been caught up in the moment before, Perona attempted to cheer Usopp up once more before appearing behind him in a giant form. After dodging Usopp's Ageha Ryusei, Perona reverted to her normal size before placing her hands inside of Usopp's chest and pretending that she was going to crush his heart, only to reveal that she could not do such a thing. Usopp attacked her with Rokuren Mamushi Boshi, but Perona demonstrated her intangibility by letting the attack go through her and moving through the floor. When Usopp pointed out that she could not touch him either and demanded to know how she could attack him, Perona summoned some Mini Hollows and demonstrated their explosive power on a nearby wall before attacking Usopp with one as well. After tricking Usopp into running into a pillar, Perona covered his body with Mini Hollows and detonated all of them before gleefully watching Kumashi brutalize Usopp. However, Perona was shocked to see Usopp, who had donned his Sogeking mask, purify Kumashi with a salt ball before fleeing once more. Wounding Usopp with a barrage of Mini Hollow blasts once more, Perona decided to hand him over to Moria, but was surprised when Usopp figured out her trick and used Atlas Suisei to expose the room containing her true body."}, {"type": "paragraph", "text": "After Usopp deduced how she left her body by becoming a ghost in order to fight him, Perona revealed that she was a fully conscious Hollow instead of merely being a ghost controlled by her body, prompting Usopp to seemingly attack her body in an attempt to destroy it. After the attack apparently missed, a panicked Perona engulfed his body with a Toku Hollow before returning to her own body. Perona detonated the Toku Hollow, but was surprised to see the explosion had disappeared as Usopp revealed he had absorbed it with an Impact Dial. After learning that Usopp had actually shot a Torimochi Boshi at her bed in order to trap her body in one place, Perona witnessed Usopp defeat Hippo Gentleman with a blast from his Impact Dial before covering Perona herself in fake cockroaches with Kurobikari Boshi. Crying and screaming hysterically at the sight of cockroaches, a shocked Perona saw Usopp seemingly lifting a ten-ton hammer and begged him to spare her before passing out in fright as the fake hammer burst apart on impact with her. Usopp celebrated his victory over her as Perona collapsed while foaming at the mouth."}, {"type": "paragraph", "text": "Later, Perona's zombies found Perona still unconscious but mostly unharmed as Oars rampaged through Thriller Bark. Soon afterward, Perona regained consciousness and had to be calmed down by her zombies when she acted like Usopp was still attacking her. Upon seeing the damage done to the mansion by Oars, Perona wondered if the Straw Hats had done this and was shocked to learn that Oars had completely wiped out the General Zombies as well, which caused her to question if they could control him at all. However, the zombies' explanation of what was happening was interrupted by Oars punching them through one of the nearby walls while searching for Nami; witnessing this, Perona was convinced that Oars and the Straw Hats were going to completely destroy Thriller Bark and ordered her remaining subordinates to gather all the treasure and some supplies so they could leave on the Thousand Sunny."}, {"type": "paragraph", "text": "Observing the battle between the Straw Hats and Oars from the Thousand Sunny, Perona admitted that she only joined Moria for fun and would not stay with him if her life were in danger before telling her subordinates that they would be leaving without delay. When Nami confronted her over her taking the treasure and the Thousand Sunny, Perona declared that she was planning to leave Thriller Bark on the Thousand Sunny and prepared to battle while proclaiming that her Mini Hollows should be enough to defeat Nami. However, she was interrupted by the appearance of Bartholomew Kuma, whom Perona was terrified at the sight of due to knowing his reputation as a cruel pirate and a Shichibukai. When Kuma asked her where she would like to go on a trip, Perona described a dark, damp island with an old castle filled with malice before realizing that she had gotten caught up in his pace. Resolving to take down Kuma as a parting gift for Moria due to his shadow likely being strong, Perona prepared to attack him with a combination of Negative Hollows and a Toku Hollow, but Kuma suddenly made her disappear before her attack could connect, to the confusion of those watching."}, {"type": "paragraph", "text": "When Hogback and Absalom escaped Thriller Bark later, they left without Perona while noting they could not find her anywhere."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bf/Perona_vs._Usopp.png/revision/latest/scale-to-width-down/210?cb=20150510170415", "caption": "Perona vs. Usopp."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/60/Usopp_Defeats_Perona.png/revision/latest/scale-to-width-down/220?cb=20141206170504", "caption": "Usopp defeats Perona."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e9/Perona_Encounters_Kuma.png/revision/latest/scale-to-width-down/210?cb=20140921211053", "caption": "Perona meets Kuma."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kuma honored Perona's request, having sent her to Kuraigana Island, an island filled with dark and spooky ruins, in addition to the malicious castle. Although she had taken up residence in the castle, Perona was not happy because she had no servants or cute animals. As she lamented her situation while wishing she was back on Thriller Bark, Perona noticed a disturbance in the forest and discovered that Zoro had been sent to the island as well. Initially terrified by the sight of one of the Straw Hats, Perona eventually decided to save him since he was the only other person there at the time and brought him to the castle, where she treated his wounds by heavily bandaging him. When Zoro regained consciousness, he found out that she had taken his swords away to prevent him from attacking her."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Perona_Finds_Zoro.png/revision/latest/scale-to-width-down/210?cb=20130209005835", "caption": "Perona encounters Zoro."}]}, {"title": "Straw Hat's Separation Serial", "level": 4, "content": [{"type": "paragraph", "text": "Eventually, Perona returned Zoro's swords and followed him through the ruins of the island, indicating that they had developed some level of trust by then."}], "images": []}, {"title": "Post War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Battle of Marineford, the owner of the castle that Perona was inhabiting, Dracule Mihawk, returned to Kuraigana Island, and Perona began sobbing at the news of Moria's death in the newspaper. When Mihawk told her to cry elsewhere, Perona berated him for his lack of hospitality before listening with surprise as Mihawk revealed that he had actually seen Moria alive and well at the end of the war, though he could not definitively say whether or not he still lived."}, {"type": "paragraph", "text": "Later, she helped an injured Zoro read the article about Luffy going to Marineford again by holding it up for him to read, though she complained about him taking a long time and her hands getting tired."}, {"type": "paragraph", "text": "After accepting Zoro's request for training, Mihawk told Perona to tend to Zoro's wounds, prompting her to tell Mihawk to not order her around. Later, Perona asked Zoro about Luffy's message, so Zoro explained what it meant."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5e/Mihawk_at_Home.png/revision/latest/scale-to-width-down/210?cb=20141206163646", "caption": "Perona and Mihawk discuss Moria's fate."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "When Mihawk was teaching Zoro how to use Haki, he forbade him from having any alcohol until he had mastered it, prompting Perona to laugh at him."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "3D2Y", "level": 4, "content": [{"type": "paragraph", "text": "While Luffy and Boa Hancock were fighting the World Pirates, Perona traveled to their location with Dracule Mihawk, where she helped them by inducing despair into Sebastian with her Negative Hollows, defeating him. She blushed when Luffy thanked her for the help before she lost sight of the pair."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Zoro's two year-long training, Perona took him back to Sabaody Archipelago. As Luffy, Zoro, and Sanji made their way to the Thousand Sunny, Perona aided them by fending off the Marines with her Negative Hollows before demanding to know why they were still waiting around when they should be preparing to leave. After scolding Zoro for his ungrateful attitude and brushing off Sanji's infatuation with her, Perona informed the trio that battleships were surrounding the island. Later, she assisted in the Straw Hats Pirates' escape by holding back the second Marine platoon with her Negative Hollows."}], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Much later, she left Sabaody Archipelago and returned to the wandering Thriller Bark, where she discovered Kumashi's lifeless body, much to her joy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9a/Perona_Finds_Kumashi.png/revision/latest/scale-to-width-down/210?cb=20120921125138", "caption": "Perona reunites with Kumashi."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "Perona later returned to Kuraigana Island. After the events at Dressrosa, Mihawk and Perona read the news of the Straw Hats' new bounties while tilling the land of Kuraigana Island with the humandrills."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "From reading a newspaper, Perona learned that Moria was alive and was annoyed that Mihawk did not inform her about it sooner. She then prepared to leave to go find him but not before thanking Mihawk for letting her stay with him."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Perona vs. Usopp", "elements": []}, {"text": "Perona vs. Bartholomew Kuma", "elements": []}, {"text": "Perona vs. Sebastian (non-canon)", "elements": []}, {"text": "Perona vs. Marines", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Thriller Bark Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the manga, when Usopp knocked her out, foam was coming out of her mouth; this aspect of the scene was removed in the anime for unknown reasons."}], "images": []}, {"title": "Straw Hat Separation Serial", "level": 3, "content": [{"type": "paragraph", "text": "In the anime version of Zoro's cover story, Perona displays more of a lonely childlike personality, mostly due to living by herself with no servants. She even tries to force Zoro to be her servant by using her Negative Hollows to make him swear to be her servant and dresses him up as Kumashi."}, {"type": "paragraph", "text": "During the filler scenes on Kuraigana, although Perona was clearly in her ghost form, she had some interactions with physical objects despite supposedly being completely intangible."}, {"type": "paragraph", "text": "In the anime, after Luffy's message is revealed, Perona went outside the castle with Mihawk and Zoro, where she scolded Zoro for not holding off on his training until his wounds were healed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7a/Zoro_as_Kumashi.png/revision/latest/scale-to-width-down/210?cb=20130208055913", "caption": "Perona dresses Zoro up as Kumashi."}]}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Perona is scolding Zoro at Sabaody, her hat bent in contact with the swordsman. This suggests that she was in her physical form rather than her ghost form; however, this does not occur in the manga."}, {"type": "paragraph", "text": "In the anime, Perona's interaction with Sanji is extended, where Sanji is beaten up and inflicted with depression by a Negative Hollow for freaking her out. Also, as she uses her ghosts to fend off the marines, Perona looks out to the sea and notes that she will have to find somebody else to play with, seemingly disappointed at Zoro's departure."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "An early concept of Perona from One Piece Green: Secret Pieces reveals that she was originally going to be a silent, princess-like girl."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "Perona features in the Portrait of Pirates series of figurines in her pre-timeskip attire."}], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Perona has a personal Jolly Roger, which consists of a skull with swords and a cross on either side of the grinning mouth, yellow hair on the sides with a flaming pattern, and the crown that Perona wears. Nami was seen wearing a top with Perona's own personal Jolly Roger on it when she rejoined the other Straw Hats, presumably having stolen them from Perona's room after disposing of the wedding dress Absalom forced her into.", "elements": []}, {"text": "In the 6th Popularity Poll, Perona ranked at 23th place.", "elements": []}, {"text": "Perona's outfits appear to be inspired by the Gothic Lolita style, with black, white and bright red.", "elements": []}, {"text": "Perona's name is usually written as \"Perhona\" in Japanese merchandising.", "elements": []}, {"text": "Perona and Galdino are the only two people known to have been affiliated with two different Shichibukai. Galdino served under both Crocodile and Buggy. Perona served under Gecko Moria and lived with Dracule Mihawk.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Nami_4th_Thriller_Bark_Outfit.png/revision/latest/scale-to-width-down/210?cb=20140917050117", "caption": "Perona's personal Jolly Roger on Nami's blouse."}]}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Gothic Lolita – Wikipedia article about the fashion style Perona's outfits adhere to.", "elements": []}]}], "images": []}]}