{"sections": [{"title": "Stainless", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Stainless is a Marine officer who participated in the Battle of Marineford. In the anime, his name was said to be Kaizeruhige (カイゼルヒゲ, Kaizeruhige)."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Stainless is of average height and well built. His most distinctive feature is his handlebar mustache. His hair is black and combed back with a scalp lock, but by the time at the meeting in Mary Geoise, it was more straightly combed."}, {"type": "paragraph", "text": "He dresses in the typical garb of many high-ranking Marines: when discussing about Luffy and later Crocodile's replacement, he wore a purple suit (which was striped during the first meeting, but not during the second), but during Marineford, he changes to a yellow and black striped suit over a dark red shirt with an orange tie. He wears a marine coat hanging from his shoulders like a cape."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ea/Stainless_Youth.png/revision/latest?cb=20121205234045", "caption": "Stainless in his youth as a marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Stainless has a strong sense of justice. He does not like Doflamingo and his actions, as the pirate manipulated his associate to attack him, causing both vice admirals to become panicked and confused. It is unknown whether he believes in moral justice or absolute justice."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Stainless is capable of commanding a Buster Call alongside four other vice admirals. He also has command over lower-ranking subordinates."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is seen carrying a katana during the battle of Marineford, like most of the vice admirals. His exact level of swordsmanship remains unknown; however it is presumably quite high, with him being a vice admiral."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Stainless can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "Stainless first appeared sitting next to Cancer when the Marines were having a meeting in Marineford in regards to Monkey D. Luffy's rise in the East Blue after he defeated Arlong."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Stainless_Beside_Cancer.png/revision/latest?cb=20120307195350", "caption": "Stainless next to Cancer."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "He appeared later when the Marines were having a meeting in Mary Geoise to determine a new Shichibukai after Crocodile's dismissal. Vice Admiral Mozambia was then manipulated by Donquixote Doflamingo to attempt to strangle Stainless. He struggled against the officer, not knowing that it was Doflamingo's doing."}, {"type": "paragraph", "text": "He also drew out a sword later on to prevent another officer (who was also manipulated by Doflamingo) from attacking him. The quarrel was stopped by Sengoku's arrival."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e0/Stainless_Being_Strangled.png/revision/latest/scale-to-width-down/175?cb=20130420054301", "caption": "Stainless struggling against Doflamingo's puppetry."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the execution of Portgas D. Ace was announced, Stainless reported to the summoning of the Marines to reinforce Marineford."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Later, he was seen with his fellow vice admirals lined up and ready to fight the Whitebeard Pirates. When the Whitebeard Pirates advanced into the plaza, he ordered his underlings to attack Edward Newgate. When Luffy is trying to get to the execution platform, he ordered Marines to stop him. Upon Shanks' arrival and truce was declared, he stood down under Sengoku's orders."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Shichibukai system had been abolished, Stainless and his fleet confronted Buggy's Delivery."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Stainless vs. Vice Admiral Mozambia (Controlled by Donquixote Doflamingo)", "elements": []}, {"text": "The Marines and Shichibukai vs. Whitebeard Pirates and Allies", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kaizeruhige is Japanese for \"kaiser mustache\", which in turn means \"handlebar mustache\", which made him the fourth character nicknamed after his facial hair.", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name in the anime was said to be Kaizeruhige, but in One Piece Blue Deep Databook his official name was stated to be Stainless.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 234 and Episode 151, Stainless is seen in Crocodile's replacement meeting.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 212), His name is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 479, the opening credits reveals Kaizeruhige's name.", "elements": []}, {"text": "↑ One Piece Manga - Vol. 60 Chapter 594, a doctor states Haki is a power all the vice admirals use.", "elements": []}, {"text": "↑ One Piece Manga - Vol. 11 Chapter 96, Stainless in the meeting in Marineford.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956.", "elements": []}]}], "images": []}]}