{"sections": [{"title": "Medaka Mermaid Quintuplets", "level": 1, "content": [{"type": "paragraph", "text": "The Medaka Mermaid Quintuplets (Guppy Mermaid Quintuplets in the Viz manga) are five tiny young mermaids who are friends with Camie. Their names are Ichika, Nika, Sanka, Yonka, and Yonka Two."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Medaka Mermaid Quintuplets are five tiny identical-looking mermaids. They all have curly hair and tails with white stripes. They also all wear cowboy hats, crop-tops, and bubble swim rings. The bubble rings apparently allow them to fly in mid-air. They are physically identical except for their colors and the designs of their hats."}, {"type": "paragraph", "text": "Ichika is a redhead with a green-striped tail, her top is white and her hat is green with white polka-dots."}, {"type": "paragraph", "text": "Nika is blond with a red-striped tail, her top is red and her hat matches her tail."}, {"type": "paragraph", "text": "Sanka has orange hair and a blue striped tail, both her top and hat are solid blue."}, {"type": "paragraph", "text": "Yonka has pink hair and a brown-striped tail, her top is brown and her hat is white."}, {"type": "paragraph", "text": "Yonka Two has dark brown hair and a yellow-striped tail, her top is black and her hat has jaguar-prints."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/af/Camie_Anime_Post_Timeskip_Infobox.png/revision/latest/scale-to-width-down/230?cb=20130912213617", "caption": "The Quintuplets' size in comparison to Camie."}]}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "The five sisters tend to talk in a unique speech pattern. Ichika starts off first by saying a regular statement. Nika then states an exclamatory version of Ichika's statement. Sanka then states the opposite of the original statement. Yonka then questions the original statement. Lastly, Yonka Two then questions whether the original statement matters or not."}, {"type": "paragraph", "text": "Other than that, they are cheerful, friendly and they usually stay close together."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As mermaids, they are supposedly faster than any type of fish e.g flying fish. Since they're smaller than usual mermaids and have bubble swim rings, it is unknown if this is true."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fishman Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "They were first seen in Camie's house when Luffy awakened after he and his crew flew through the bubble surrounding Fish-Man Island, fell into a current, and got separated. As Luffy, Sanji, Usopp, and Chopper get reacquainted with Camie, the quintuplets gave them their dried clothes. They were next seen in the Mermaid Cove, telling Camie about the arrival of the royal gondola, and whether or not royalty was on board. They were then seen in Coral Hill when the residents started suspecting the Straw Hats for kidnapping mermaids. Later on, they heard the news of the Straw Hats \"taking over\" the Ryugu Palace."}, {"type": "paragraph", "text": "After the battle for Fish-Man Island, the quintuplets were seen dancing at the banquet in the Ryugu Palace. When the Straw Hats finally departed Fish-Man Island, the quintuplets were there to bid them farewell."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The quintuplets names are based on Japanese numbers. Ichika comes from Ichi meaning 1. Nika comes from Ni meaning 2. Sanka comes from San meaning 3. Lastly, Yonka comes from Yon meaning 4. The last sister's name, Yonka Two is just as is. This forms a joke as based on the first four sisters' names, there is a numerical pattern. Based on the pattern, Yonka Two's name would naturally be expected to be Goka from \"Go\" meaning \"5\", as Usopp points out at their introduction. Instead however, her name breaks the pattern."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 and Episode 527, Camie introduces the Medaka Mermaid Quintuplets to the Straw Hats.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Medaka (Japanese killifish) – Wikipedia article about the type of fish that the quintuplets are.", "elements": []}]}], "images": []}]}