{"sections": [{"title": "Super Spot-Billed Duck Troops", "level": 1, "content": [{"type": "paragraph", "text": "The Super Spot-Billed Duck Troops are a family of seven Super Spot-Billed Ducks (and later one camel) who serve the kingdom of Alabasta. They are led by their captain Karoo, and are reputed to be the fastest troop in the kingdom of Alabasta. All of the ducks have the strange theme of wearing different types of hats and various other jewelry and clothing. Also strange was that the last member to join the squad, Matsuge, is a camel who helped the Straw Hats confront Baroque Works."}], "images": []}, {"title": "Overview", "level": 2, "content": [{"type": "paragraph", "text": "They are a specialized group of Spot-Billed Ducks who are considered the fastest in Alabasta, and as such have been given special treatment by the Royal Family, the Royal guards and the rest of Alabasta as a special independent transport group. Since their leader, Karoo, is the royal pet of the princess of Alabasta; Nefertari Vivi and has always lived and been by her side, it can be assumed that the other members are given similar, if not equal treatment, and live in the palace alongside Karoo. With the addition of Matsuge as a member, it can also be assumed that he has now been given this same treatment as well."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Vivi sent Karoo to Alubarna with a message to warn the king. After Karoo reached the palace and successfully delivered the message, he and the rest of the super spot-billed duck troops left the palace to assist her and the straw hats. As Vivi and the Straw Hats (minus Luffy) make their way to Alubarna, Karoo and the spot-billed duck troops came to their aid, giving each of them, as well as their new camel companion, Matsuge, a ride as they traveled to the capital, with the camel being disguised as Vivi. Once they reach the capital, the spot-billed duck troops stayed on standby for most of the conflict while the Straw Hats, Karoo and Matsuge helped lure the Baroque Works officer agents away from Vivi. Later, after Karoo gets shot helping Vivi get to the palace, the squad take Karoo to safety while Vivi continues heading towards the castle."}, {"type": "paragraph", "text": "After Crocodile's defeat and the complete end of the rebellion and civil war that he had started, the squad later assisted the straw hats in safely leaving the capital and returning to the Going Merry undetected. Afterwards they returned with Vivi and Karoo to the capital, and later welcomed Matsuge, who was given special treatment for it's actions, as the newest member of the super spot-billed duck troops (even though he is a camel)."}], "images": []}, {"title": "Gedatsu's Accidental Blue-Sea Life", "level": 3, "content": [{"type": "paragraph", "text": "Karoo, Matsuge and the rest of the Spot-Billed Duck Troops were later seen enjoying the geothermal baths of Ukkari Hot Spring, owned and operated by Goro (Toto's brother and Koza's uncle)."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Grand Battle! 2", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 20 Chapter 180 and Episode 111.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, The group's name is romanized.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, The Super Spot-Billed Duck Troops' information is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 36 Chapter 344, cover story: Gedatsu's Accidental Blue-Sea Life Vol. 28.", "elements": []}]}], "images": []}]}