{"sections": [{"title": "Sharinguru", "level": 1, "content": [{"type": "paragraph", "text": "Captain Sharinguru is a Marine captain who helped in the Buster Call on Enies Lobby."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sharinguru is a normal-sized Marine with a large nose and a chin that sticks out. He has black, curly hair under a hat with points on the sides, and goggles that cover his eyes. Like most of his fellow captain-ranked subordinates he also wears a marine coat, with a dark green button up shirt under it."}, {"type": "paragraph", "text": "In his youth, he had the same goggles, but wore a Marines' cap instead, which reveals his shorter hair and pointed ears."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/da/Sharinguru_as_a_Young_Marine.png/revision/latest?cb=20140805201421", "caption": "Sharinguru in his youth as a Marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Sharinguru has a strong sense of justice. It is unknown whether he believes in moral justice or absolute justice."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Sharinguru ate the Shari Shari no Mi, a Paramecia-class Devil Fruit that allows him to transform his arms and legs into wheels and rotate them at very high speed. He can use these rotating wheels as formidable weapons to drive against his opponents to inflict scraping damage. However, targets with a higher defense, such as Franky's metallic body, are resistant to this, thus proving the fruit's rotating velocity or overall piercing powers to be rather low. This power was shown only in the manga."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e4/Shari_Shari_no_Mi_Infobox.png/revision/latest/scale-to-width-down/200?cb=20140319144341", "caption": "Sharinguru attacking Franky."}]}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "In the anime, Sharinguru used a sword against Franky in lieu of his Devil Fruit powers."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the Buster Call that was called onto the Enies Lobby, Sharinguru attacked Franky on the Bridge of Hesitation. Franky managed to defeat him in a brief battle."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sharinguru vs. Franky", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Sharinguru is the only Devil Fruit user to not use his Devil Fruit powers. He instead attacks Franky with a sword. He also has a slightly different appearance."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sharinguru's name is a pun corresponding to his Devil Fruit powers.", "elements": []}, {"text": "Sharinguru is currently the only Devil Fruit user to be introduced who did not get their Devil Fruit powers adapted into the anime when they were first revealed.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 44 Chapter 428 (p. 7) and Episode 310, Sharinguru is seen during the Buster Call on Enies Lobby and fights Franky.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements, Sharinguru's and his fruit's names are revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 47, Fan Question: What are the names of the Devil Fruits the Marine Headquarters captains and commanders, that fought the Straw Hats in Volume 44, had?", "elements": []}, {"text": "↑  One Piece Anime — Episode 310, Sharinguru is seen using a sword to attack Franky instead of his Devil Fruit powers.", "elements": []}]}], "images": []}]}