{"sections": [{"title": "Ryuma", "level": 1, "content": [{"type": "paragraph", "text": "This character's name is sometimes romanized as Ryouma."}, {"type": "paragraph", "text": "Ryuma, also known as Shimotsuki Ryuma (霜月リューマ, Shimotsuki Ryūma), was a legendary samurai from Wano Country who was turned into a General Zombie by Gecko Moria hundreds of years after his death. He is the same Ryuma from Oda's previous one-shot manga, Monsters. His corpse previously possessed Brook's shadow to animate him while on Thriller Bark."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "When he was alive, he possessed black hair which was tied in the end with a topknot. He also wore a simple khaki samurai gi and simple zōri sandals."}, {"type": "paragraph", "text": "As a zombie, Ryuma is noticeably shorter than Brook. He has several bandages covering part of his skull face, which has no eyes and no nose, and wears a samurai gi with intricate designs more detailed than his original garb. He also wears geta instead of the zōri sandals of his past life, as well as a blue stomach band with a swirling design. Ryuma's mouth is partially covered by the blue scarf he wears, his black hair has turned white, and he keeps Shusui strapped to his right hip."}], "images": []}, {"title": "Personality", "level": 2, "content": [], "images": []}, {"title": "In Life", "level": 3, "content": [{"type": "paragraph", "text": "In life, Ryuma followed a strict personal philosophy centered around justice and honor. Ryuma strongly believed that saving a life was a debt that must be repaid by those with virtue, and that repaying this debt was the way of a true swordsman. To this end, Ryuma would occasionally follow the request of someone he owed almost blindly, even when it contradicted his other beliefs. He also believed that a battle should be measured by what was protected instead of how much fame was gained."}, {"type": "paragraph", "text": "As a swordsman, Ryuma had a peculiar habit: whenever someone touched their sword sheath with his, even by accident, Ryuma would immediately take this action as a form of challenge for a duel to the death. This behavior stems from Ryuma's belief that the sword is the swordsman. Despite his honorable intentions, this habit would get him into needless and bloody confrontations."}, {"type": "paragraph", "text": "Ryuma, having heard the reputation of \"King\", hoped to one day fight against him. He believed that this King must hold a great \"Warrior's Soul\" and would make a worthy adversary. The irony however, is that he himself was \"King\"; because the name, \"King\", was given to him by the people he saved, he unfortunately did not know it himself."}, {"type": "paragraph", "text": "Ryuma also had poor money management skills. Because of this, Ryuma would often unfortunately find himself penniless and hungry for days."}], "images": []}, {"title": "Post-Mortem", "level": 3, "content": [{"type": "paragraph", "text": "As a zombie, Ryuma has mannerisms similar to those of Brook, such as his perverted nature and his distinct \"Yohohohoho\" laugh. These similarities exist because he has Brook's shadow animating his corpse."}, {"type": "paragraph", "text": "Though Ryuma has Brook's core personality, he possesses a slightly different outlook on things. He has abandoned his past as a part of Brook, and every memory connected with it; because of this, while Brook cherishes his afro, Ryuma sees it only as an eyesore. Ryuma also sees it as a weakness of Brook's to be exploited in their duel. He also has a decidedly sadistic streak, behaving quite cruelly towards his \"former master\" Brook; when fighting him, Ryuma seems to enjoy inflicting both physical and psychological pain as well as toying with him when he could have won quickly and easily, being the far more powerful of the two. He seems to retain a fondness for battle that is more in line with his body's samurai origins. He felt deep shame about himself after being defeated by Zoro."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "In Life", "level": 3, "content": [], "images": []}, {"title": "Physical Abilities", "level": 4, "content": [{"type": "paragraph", "text": "Ryuma possessed immense physical strength, as the force he applied in his swordsmanship allowed him to decapitate an enormous dragon with a single slash. He also cut a copper statue in half. Ryuma was also a extremely fast runner with high endurance, as he could sprint great distances, and could jump to and land safely from great heights. His physical prowess supplemented with his sword skills allowed him to sustain no injuries during his battle in Monsters."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1e/Slash_Bronze.PNG/revision/latest/scale-to-width-down/230?cb=20111009053903", "caption": "Ryuma cuts through a copper statue."}]}, {"title": "Swordsmanship", "level": 4, "content": [{"type": "paragraph", "text": "Ryuma was legendary in the Wano Country for his immense mastery in swordsmanship. He is a powerful Strong Blade (豪剣, Gōken) type swordsman. His skills resembled a mix of Kenjutsu and Battojutsu. He could slice through copper, kill Cyrano, a first-rate swordsman, and an enormous dragon with little effort. He was renowned as the strongest swordsman of his time. Due to this, as well as his strong belief in protecting others, Ryuma was also called \"King,\" the swordsman who carries the world's greatest \"Warrior's Soul\"."}, {"type": "paragraph", "text": "At some point in time after his death, he came to be known as the Sword God (刀神様, Tōjin-sama) in Wano Country and his skills continue to be regarded as legendary."}], "images": []}, {"title": "Postmortem", "level": 3, "content": [], "images": []}, {"title": "Fighting Style", "level": 4, "content": [{"type": "paragraph", "text": "As a zombie that possesses Brook's shadow, Ryuma can perform all of Brook's sword techniques. However, because Ryuma has a much stronger body than Brook does, the power of the techniques is amplified to a much higher level. The difference between the two is large enough that Ryuma could defeat Brook with only a fraction of his full strength. In addition to Brook's sword skills, Ryuma possessed immense strength that allowed him to knock out Nami, Usopp and Chopper in one attack, using the blunt edge of his blade; if he had used the sharp edge, he would have killed them. Because of this immense power, he can pierce through walls at a distance with the air pressure from his stab, completely cut through the spire roof of a tower with a single slash, and destroy an enemy's sword after just a few clashes, all things that Brook cannot do. As Brook noted, a battle between two users of the Power of Destruction (破壊力, Hakairyoku) such as Zoro and Ryuma will always end quickly."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "At some point in time of his life, Ryuma came to possess a sword called Shusui, one of the 21 Great Swords. It is distinguished by its black blade and flower-shaped guard. The sword remained with him even after he died. After Zoro defeated him, Ryuma gave the sword to him in hopes of satisfying the sword."}, {"type": "paragraph", "text": "Due to its association with Ryuma, Shusui is considered the national treasure of Wano Country."}, {"type": "paragraph", "text": "Before obtaining Shusui, Ryuma wielded a sword with a guard similar to that of Yubashiri that he used during his famous fight against the dragon."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Hundreds of years ago, during the Wano Country's \"Country of Gold\" era, Ryuma was a famous samurai. He was renowned for killing a dragon."}], "images": []}, {"title": "Monsters", "level": 4, "content": [{"type": "paragraph", "text": "On one particular day, Ryuma was kicked out of a restaurant for being unable to pay for his meal. In another restaurant, a waitress, Flare, recognized the famous swordsman Cyrano, whom she claimed to have encountered before, but their conversation was interrupted by Ryuma staring through the window at Cyrano's meal with his stomach rumbling audibly. After Flare gave him something to eat, Ryuma explained that this had been his first meal in five days and offered his gratitude to the young waitress. When Cyrano left the restaurant, the sheath of his sword accidentally touched Ryuma's, which the samurai interpreted as a challenge for a duel due to his code of honor. After informing Cyrano of this and attacking him, Ryuma was surprised when Cyrano outmaneuvered him and declared that Ryuma had lost. Ryuma attempted to finish the duel regardless, but Flare told him to stop, which he complied with, to the shock of those watching."}, {"type": "paragraph", "text": "Later on, Ryuma sat at the bar as the bartender recounted the story of Flare's hometown, which was burned down by a dragon, leaving Flare as the only survivor due to being rescued by Cyrano. After listening to her story, Ryuma stated that he had gained much respect for Flare and thought of her as a very brave girl. Ryuma also chatted with the bartender about \"King\", who was supposed to be the greatest swordsman alive, Ryuma expressed his intention of fighting \"King\" one day, since he believed \"King\" had the soul of a real fighter. After finishing his meal, Ryuma decided to continue traveling."}, {"type": "paragraph", "text": "As he was walking down the street, Ryuma's sheath knocked against that of D.R. As Ryuma called the man out for touching his sword, D.R. cried out and and accused Ryuma of stabbing him. Ryuma denied this, but the crowd turned against him, and D.R. further accused him of wanting the Dragon Horn in his possession. When D.R. blew the horn in order to summon a dragon and destroy the whole town, the surrounding crowd blamed Ryuma for their misfortune and was turning violent when Flare appeared. Much to Ryuma's surprise, she slapped him in the face and called him a murderer for causing the situation. While Ryuma still did not appear to comprehend the situation at all and refused to take responsibility, Cyrano appeared on the scene and confirmed that the horn was real before expressing his intention to fight the dragon on his own, despite Flare begging him not to."}, {"type": "paragraph", "text": "After most of the town's inhabitants had fled, only Flare and Ryuma remained behind and talked in the restaurant. Ryuma did not understand why Flare was so frightened, since Cyrano was supposed to be a first-class swordsman, but Flare, haunted by her memories, stormed off in order to stop Cyrano, and Ryuma followed her outside. As he caught up with her and they began arguing again, Ryuma suddenly froze in shock and tried to prevent Flare from turning around. However, she ignored him, and turned to see Cyrano and D.R. looting the town."}, {"type": "paragraph", "text": "As Ryuma and Flare listened from behind a building, they learned that Cyrano and D.R. were partners from the start and tricked Ryuma into taking the blame for the dragon, as well as being responsible for the attack that destroyed Flare's village seven years ago. Flare told Ryuma that staying any longer would be suicide, as a dragon had been summoned regardless and would still destroy the town, and begged him to immediately leave the town before returning to her house, where she broke down in tears. Ryuma, who followed her and witnessed her tears and screams from outside, ran off to confront Cyrano and D.R."}, {"type": "paragraph", "text": "When he faced the two criminals, Ryuma explained that he knew someone who would knock his sheath against that of another warrior so thoughtlessly could not have a true fighter's soul. After mocking Ryuma, Cyrano attempted to attack him, only for Ryuma to kill him with one strike. D.R., frightened by this turn of events, pleaded for his life by offering Ryuma the Dragon Horn, which could stop the dragon from destroying the town, but Ryuma merely told him that he was not an inhabitant of this town before killing D.R. as well. As the dragon arrived, Ryuma jumped on top of a building to confront it, where he leaped into the air before decapitating the dragon with one powerful slash."}, {"type": "paragraph", "text": "As Ryuma was leaving the town after the battle, he encountered Flare, whom he told to stop thinking about dying because he believed dying was not fun at all. When Flare asked him why she had never heard of him despite his strength, Ryuma merely stated that battles are measured by what one protects instead of how famous one becomes. Later on, as the inhabitants of the town returned to their houses, Flare learned from the bartender that Ryuma was actually the swordsman called \"King\", a name which was given to him by those he had saved, and that was believed to be the world's best swordsman."}, {"type": "paragraph", "text": "It is not known what happened to Ryuma afterwards aside from him dying from an unspecified sickness at the age of 47."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b4/Ryuuma_Hungry.PNG/revision/latest/scale-to-width-down/210?cb=20070912113139", "caption": "Ryuma gazes hungrily at the food being served to Cyrano."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/25/Dragon_Slayer.PNG/revision/latest/scale-to-width-down/210?cb=20070502101305", "caption": "Ryuma slays the dragon."}]}, {"title": "Legacy", "level": 4, "content": [{"type": "paragraph", "text": "The tale of his fight against the dragon became legendary and was passed down the generations. This tale also led to the whole world becoming aware of the power of Wano Country and their samurai, as Ryuma supposedly led the country's samurai in defending it from many threats from the outside world due to the country's resources, causing both himself and his sword Shusui to be declared national treasures. After his many battles, his sword Shusui eventually turned into a \"Black Blade\", and around the time of his death, Ryuma was bestowed the title of \"Sword God\", with his corpse still retaining its status as one of Wano's national treasures. Even up to the present, people still remember him as \"The Greatest Hero of Wano Country.\""}, {"type": "paragraph", "text": "Ryuma's corpse was laid to rest along with Shusui at the Northern Cemetery in Ringo. Due to Ringo's freezing cold climate, the corpse was perfectly preserved without rotting. Hundreds of years after Ryuma's death, Moria profaned his grave, stealing both his corpse and Shusui, which brought the entire Wano Country to its knees."}], "images": []}, {"title": "Life as a Zombie", "level": 4, "content": [{"type": "paragraph", "text": "Five years before the beginning of the main storyline, a skeleton named Brook came to Thriller Bark. He was captured, and with the use of Moria's Devil Fruit powers, his shadow was stolen and implanted into Ryuma's corpse. After Brook was set adrift at sea, Ryuma became a General Zombie under the command of Absalom, but foremost Moria. When Brook returned to the island in search of his shadow and purified many zombies, he came across Ryuma and fought him for possession of his shadow. However, while they shared the same techniques, Ryuma had the stronger body and easily bested Brook at his own fighting style. Knowing that he could not kill Brook because that would destroy the shadow and leave himself lifeless, Ryuma let Brook go with a broken skull. Ryuma then continued his duties as a General Zombie for the next five years. While Brook trained himself during that time in order to defeat him, Ryuma grew in strength as well because they thought alike."}], "images": []}, {"title": "Thriller Bark Saga", "level": 3, "content": [], "images": []}, {"title": "Thriller Bark Arc", "level": 4, "content": [{"type": "paragraph", "text": "While doing his rounds on the night the Straw Hats came to Thriller Bark, Ryuma decided to chase after Usopp, Nami, and Chopper after they were chased out of Hogback's room by a Jack in a box. He caught up to them while they were peeking on Hogback making his latest creation in his lab, where he knocked them inside with a slash."}, {"type": "paragraph", "text": "After being ordered by Hogback to do away with the three Straw Hats, Ryuma attacked them with Hanauta Sancho: Yahazu Giri. As Ryuma walked past the trio and asked Cindry to prepare his night meal, the technique took effect, though Nami, Chopper, and Usopp were only knocked out due to being hit with the back of Shusui."}, {"type": "paragraph", "text": "Later, while sitting down and drinking tea in Hogback's lab, Ryuma was confronted by Brook, who challenged him to a duel. After several bone-shattering strikes, during which he claimed that Brook's afro was just a weakness to be exploited, Ryuma easily defeated Brook with his own style before grabbing Brook's afro, which he decided to cut off as a final blow to the skeleton. However, just before Ryuma could cut off the afro, the entire island began shaking, which made Ryuma lose his grip and balance. When Franky arrived in the lab and began tending to Brook, Ryuma attacked both of them, but had his attack blocked by Zoro, who challenged him to a fight in Brook's stead."}, {"type": "paragraph", "text": "After proclaiming that he would be taking Shusui from Ryuma's corpse, Zoro attacked Ryuma, who blocked before responding with Aubade Coup Droit, blowing a hole in the wall behind Zoro. However, Ryuma observed that he had almost been cut in return as Zoro's counterattack slashed through the wall behind him. As the battle intensified, with both Zoro and Ryuma using powerful techniques that damaged the floor and walls, Hogback's laboratory could not take the damage and the entire room caved in."}, {"type": "paragraph", "text": "Escaping from the wreckage before the structure gave way, Ryuma and Zoro continued their battle on the roof. As Ryuma and Zoro continued battling, the two found themselves facing each other on top of two ledges with only the top of the roof between them. With a mighty slash, Ryuma cut through the entire roof with his blade, but Zoro dodged the attack and, using the slashed-off part of the roof as a ramp, launched an attack from above at Ryuma. As he jumped towards Zoro and prepared to use Hanauta Sancho: Yahazu Giri once more, Ryuma was slashed in mid-air by Zoro's Hiryu Kaen, which caused blue flames to spread from the wound. Ryuma landed on top of the roof while Zoro landed further down."}, {"type": "paragraph", "text": "Accepting defeat, Ryuma decided to give Zoro his sword, believing that the soul of the sword would be most satisfied to serve under the man who defeated its preceding owner. After admitting that it felt sorrow at letting Ryuma's body be defeated, Brook's shadow left the corpse and returned to its rightful owner as the corpse was burned to ashes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Ryuma_vs._Brook.png/revision/latest/scale-to-width-down/210?cb=20130927025426", "caption": "Ryuma vs. Brook."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Zoro_Defeats_Ryuma.png/revision/latest/scale-to-width-down/230?cb=20130209003312", "caption": "Ryuma is defeated by Zoro."}]}, {"title": "Major Battles", "level": 2, "content": [], "images": []}, {"title": "As Human", "level": 3, "content": [{"type": "list", "elements": [{"text": "Ryuma vs. Cyrano (1st battle)", "elements": []}, {"text": "Ryuma vs. Cyrano (2nd battle)", "elements": []}, {"text": "Ryuma vs. D.R.", "elements": []}, {"text": "Ryuma vs. The Dragon", "elements": []}]}], "images": []}, {"title": "As Zombie", "level": 3, "content": [{"type": "list", "elements": [{"text": "Ryuma vs. Brook (1st battle)", "elements": []}, {"text": "Ryuma vs. Brook (2nd battle)", "elements": []}, {"text": "Ryuma vs. Roronoa Zoro", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His samurai gi has the kanji ryū (龍, ryū literally meaning \"dragon\") on its sleeves, most likely a reference to the dragon he killed in the past.", "elements": []}, {"text": "There is a notable family in Wano known as the Shimotsuki Family, but it is unknown if Ryuma is their ancestor or what other connection he may have to them.", "elements": [{"text": "\"Shimotsuki\" is the Japanese name for the month of November, which is when Ryuma was born.", "elements": []}]}, {"text": "Ryuma's zombie is the only one of Gecko Moria's zombies that is defeated in a way other than being purified with salt. Instead, he is set on fire, causing his body to be cremated, thus freeing Brook's shadow.", "elements": []}]}], "images": []}]}