{"sections": [{"title": "Doberman", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Doberman is a Marine officer and one of the five vice admirals who led the Buster Call against Enies Lobby."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Doberman has four X-shaped scars on his face and two on his neck, a split, curling mustache and brown flowing hair, reaching down to his shoulders. He has no pupil in his left eye."}, {"type": "paragraph", "text": "His Marine coat, draped on his shoulders like a cape, is more elaborate than the ones worn by other high-ranking officers, and the stripes across his cap are in a zig-zag pattern. Underneath his coat he sports an outfit reminiscent of those worn by naval officers in the 1600's, composed of a loose shirt with rope-like ornaments on it and suit pants."}, {"type": "paragraph", "text": "From Doberman's first introduction, he wore a red marine coat until the Whitebeard War, after that it was white."}, {"type": "paragraph", "text": "When Doberman first joined the marines, his jaw was less angular and his hair was shorter. He also still had both pupils, and only had a single X-shaped scar, under his left eye."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Doberman firmly believes in Absolute Justice: he ordered the Marines to abandon injured soldiers and was willing to show Whitebeard's and Ace's heads as trophies to the world. He also claimed that Luffy was not to leave Marineford alive, for being Dragon's son. He was perceptive enough to see through Spandam's lie about Robin, but Doberman did nothing to stop the attack on her. "}, {"type": "paragraph", "text": "He did, however, showed affection for those he respected as shown when he shed a tear when he and his fellow Marines were forced to kill their former instructor, Zephyr."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Doberman is capable of commanding a Buster Call alongside four other vice admirals. He also has command over lower-ranking subordinates."}, {"type": "paragraph", "text": "Doberman survived the entire Battle of Marineford without receiving any visible injuries."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During the Marineford Arc, he was seen carrying around a katana, wielding it in his left hand, which may suggest that he's left-handed or ambidextrous. He was seen fighting on par with McGuy, one of Whitebeard's allies, in the anime."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Doberman can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Vice Admiral Doberman was present at the Enies Lobby Buster Call. There he told his men about Rob Lucci's past. He possessed a firm belief that as long as Lucci was there to assist in the escorting of Nico Robin, there was no need for the Marines to act."}, {"type": "paragraph", "text": "He also apparently saw through Spandam's deceit, that Admiral Aokiji ordered him to attack Nico Robin, but did nothing against it."}], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "He is later seen slicing up cannon fire and preparing to battle against the division commanders of the Whitebeard Pirates. Doberman was still standing alongside Momonga and other vice admirals when Whitebeard attacked the Marines after reaching the plaza. He is later seen surprised at the arrival of Little Oars Jr. stating that the giant is quite a bit bigger than an average giant."}, {"type": "paragraph", "text": "When Luffy unknowingly uses Haki, Doberman warns his subordinates to treat him as a real menace, not just as a rookie. Doberman knows Luffy is Dragon's son, and sees him as a sure threat for the future. In the anime, he duels \"Thunder Lord\" McGuy to a stalemate when he tries to attack Luffy. When he sees a fellow Marine helping out an injured comrade after Trafalgar Law's arrival, he immediately orders the Marine to forget the wounded and continue on with the battle against the retreating pirates, showing no pity or remorse."}, {"type": "paragraph", "text": "Later Shanks arrived and the fighting comes to a halt. When Shanks announced that he would be taking the bodies of Ace and Whitebeard, Doberman protested saying that the Marines' victory will not be complete until they hold their heads high for the world to see. However, Doberman was shocked to see that Sengoku agreed with Shanks. He stood down when the war ended."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Z", "level": 3, "content": [{"type": "paragraph", "text": "After Sakazuki learnt about Z's return, he sent Borsalino along several vice admirals including Doberman to stop him on Piriodo island. During their fight against the former instructor, Doberman is seen shedding a tear for him."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Doberman_Shedding_a_Tear.png/revision/latest/scale-to-width-down/180?cb=20130420212438", "caption": "Doberman cries for his former instructor."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Doberman was present at New Marineford when the Marines intercepted a communication between Big Mom and Kaido."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Marines and Shichibukai vs. Whitebeard Pirates and Allies", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Doberman vs. McGuy", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, he is seen arguing with one of his subordinates over the fact that Rob Lucci killed all 500 hostages on the spot and even went so far to point to the Japanese symbol for \"justice\" on the back of his coat, saying that \"justice is not child's play\"."}, {"type": "paragraph", "text": "In his first anime appearance, his cap shadows his left eye, making it appear that this eye socket was empty; however, in One Piece Blue Deep, and in many other places, it is clear Doberman does indeed have two eyes, but doesn't have the left pupil. In the anime during the Marineford Arc, however, he is depicted as having both pupils."}, {"type": "paragraph", "text": "During the Battle of Marineford, when Whitebeard ordered his allies to backup Luffy, Doberman was given an additional scene of fighting against McGuy, which was not present in the manga."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/McGuy_vs._Doberman.png/revision/latest/scale-to-width-down/210?cb=20130224135405", "caption": "Doberman vs. McGuy."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Doberman is the name of a breed of dog.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 109), Doberman's birthday is given.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements (p. 153), Doberman's and the other Buster Call vice admirals' names are revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 59 Chapter 579, At the war's end, Doberman is shown without any visible injuries.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 60 Chapter 594, A doctor states Haki is a power all the vice admirals use.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 907 (p. 4) and Episode 887.", "elements": []}]}], "images": []}]}