{"sections": [{"title": "Hody Jones", "level": 1, "content": [{"type": "paragraph", "text": "Hody Jones is a great white shark fish-man, the captain of the New Fish-Man Pirates before their downfall, and a former soldier of the Neptune Army. He is an admirer and militant believer of Arlong's ideals, and the primary antagonist of the Fish-Man Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hody is a grey-skinned great white shark fish-man. He had a large belly, with a tattoo of the New Fish-Man Pirates design on the right side as well as a long scar on the left, and muscular arms and legs. His facial features include glaring eyes, with long and distinctive eyelashes, a mouth full of sharp, triangular teeth, and a stub nose. He had long black curly hair, with a long tuft hanging on the left part of his face. His left arm is intricately tattooed, with the Arlong Pirates' Jolly Roger near the wrist and several circular designs above it ending with two skulls on the upper arm; he also has some spikes protruding from his bare wrist and circling it all, possibly decorative piercings. His brief fight with Zoro left him with a new scar that appears to start below his left shoulder and goes down his chest diagonally to the right, similar to the one Dracule Mihawk gave Zoro."}, {"type": "paragraph", "text": "He sported a pink newsboy cap, with a little trident represented on the left side, bearing a resemblance to the same weapon he was sometimes seen carrying around, and a massive scarf seemingly made from a dog-like animal around his neck, with the animal’s head hanging on the left side of his chest. Hody was seen wearing a red open shirt with short sleeves, a wide collar and dark-red spots on the lower part, short blue trousers with a similar pattern but with light-blue spots, a pink sash tied around the waist, and sandals."}, {"type": "paragraph", "text": "After overdosing himself on Energy Steroids, Hody underwent a drastic change in appearance: he no longer had a large belly, being far more muscular than before, with his muscles bulging in size with thick veins appearing, particularly on his arms, and his size greatly increased, being in equal in size to Ikaros Much, the largest of the New Fish-Man Pirates, while sitting down. His dark hair had lightened exponentially. He no longer wore any headgear, and donned a shirt with the colors reversed from the one he originally wore, with the dark background having turned light and the light spots along the bottom having turned dark. He also carried his trident on his back."}, {"type": "paragraph", "text": "As Noah continued to descend on Fish-Man Island and Hody's hatred grew stronger, the sclera turned red and he was seen with an enlarged jaw about the size of Luffy (though in the anime it was because he consumed more Energy Steroids). He also appears to have grown so much muscle mass that his shirt ripped apart as a result. It is later shown after he is defeated that during his last fight with Luffy that he gained enough muscle mass that he is now the size of the royal princes. By the time of his defeat and capture, the crew noted that Hody looked like a monster."}, {"type": "paragraph", "text": "After being defeated and imprisoned, another side effect of the Energy Steroid kicked in- the shortening of the user's lifespan relative to the number of steroids consumed. Unfortunately for Hody, his (and his fellow officers') Energy Steroid abuse has resulted in all of them becoming old and frail- and Hody's appearance has changed into that of an old man's, considerably more aged than his subordinates due to taking an especially large quantity of the steroids. His hair remained white, and nearly all the hair on his upper scalp fell out, causing him to become bald, except for the curled hair that hangs below his neck, which remained intact. He grew a mustache, as well as a goatee several inches long, and his skin wrinkled. He also became incredibly skinny, losing all of his muscle and some of his teeth with the remaining teeth now square instead of sharp, and has become hunched over on bent knees now having to walk with a cane."}, {"type": "paragraph", "text": "As a teenager, he had less sharp facial features, shorter hair, and a leaner build. He wore a newsboy cap with the word \"CHECK\" imprinted on it and a simple scarf paired with an open dark vest decorated by two sword-like motifs on the front."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hody is a racist, overly hypocritical, prideful, brutal and a vicious natured fish-man who, like many of his kind, hates humans for leaving Fisher Tiger to die when he could have been saved (which was not true, as Tiger refused human blood due to being betrayed). He proves this by attacking humans within his reach. He, like Arlong, believes that fish-men are the supreme race, demonstrating his arrogance by attacking Gyro's crew with his hands cuffed, showing them that they could easily be destroyed even with the handicap. He then deliberately released the crew, injured but alive, setting them as examples, telling them to spread the word of the New Fish-Man Pirates."}, {"type": "paragraph", "text": "Despite the fact that they both looked down on humans, his treatment of humans is even more brutal than Arlong's. He considers his human captives to be expendable and sees them as nothing more than pawns, while Arlong had left humans alone so long as they paid him the \"tribute\" money periodically. Arlong mainly killed humans to make examples of them when they did not pay up and was content with leaving them be, aside from odd acts to make sure the humans knew who was boss, but Hody will go out of his way to attack humans, such as using them as part of his plan that will almost ensure their deaths, and threatening to kill them outright if they refuse, giving them very little chance to live altogether."}, {"type": "paragraph", "text": "Hody basically grew up basking in the hatred of fish-men towards humanity. He and his crew would hate and fear the day when the animosity between humans and fish-men would fade. This leads Hody and his crew to become bloodthirsty radicals who do not care for the peace of Fish-Man Island. Hody himself believes that heaven has selected him and his crew to hand judgement down to humanity, in spite of the fact that humans did utterly nothing against Hody personally. From his point of view, hatred towards humans is his definition of pride. Hody despises anyone who wants peace with humans especially Otohime, claiming that her preaching was aggravating and he did everything in his power to keep her hopes and dreams from becoming real. Hody's belief of fish-men superiority is so fierce, he fanatically believes that heaven itself has granted him power."}, {"type": "paragraph", "text": "Despite Hody seeing Arlong as a role model, there are several factors that greatly distinguish the two, besides the difference in their levels of cruelty. While Arlong was tight with his wallet and could not pay for Hyouzou for his services as well as failing to get Vander Decken IX as his subordinate, Hody managed to make accommodations for these two by being more open with financial compensation and was willing to treat powerful allies as equals instead of being a dominating leader. While Arlong valued and considered his crew as his brothers and was extremely angry when one of his crewmen was used as a shield by Luffy, Hody, on the other hand, does not hold camaraderie in any regard even though he has been close to his officers since they were kids. In fact, Hody had no problem using one of his own subordinates as a shield to protect himself and also taunted Neptune for using himself as a shield to protect his own soldiers from harm, deeming him unworthy to be king because of that. Furthermore, according to Hatchan, while Arlong would not harm his fellow fish-men, Hody will kill any fish-man who has shown sympathy towards humans, even referring to the people who gave their signatures to support the migration as a list of traitors. Also unlike the Arlong Pirates, who demonstrate their pride as Fish-Men by utilizing on their natural strength, Hody and his crew did not care what methods they use to show off their superiority, which was best shown by their heavy abuse of Energy Steroids (as Hody calls Arlong's methods to be barbaric, which the New Fish-Man Pirates believed to a mistake to be learned from). He has gotten so arrogant that he now does not seem to care about anyone but himself and his goal, to the point he is willing to sacrifice 100,000 of his own subordinates without a second thought."}, {"type": "paragraph", "text": "Hody is also completely fearless (if not insane and delusional), using Energy Steroids, a potent drug that increases his strength, knowing the effect also shortens his life (though he apparently did not realize it simply accelerates one's age instead of simply reducing the lifespan). He appears to have developed an addiction to the drug as he continuously ate it throughout the day and even swallowed a giant handful of steroids at once, whether as to gain an upper hand against his enemies or as painkillers. He also threatened his crewmates for preventing him from overdosing, and his violent nature may have been intensified from the side-effects of the Energy Steroids. This arrogant stubbornness led him to overdose heavily and, in turn, destroyed his body, which even then, did not deter him from hating humanity irrationally. His arrogance also made him extremely shortsighted, as he did not even consider the consequences of allowing the Candy Factory to be destroyed, thereby angering Big Mom, whose own power and crew vastly outmatched anything Hody or his crew were capable of combating."}, {"type": "paragraph", "text": "Hody considers King Neptune to be a coward and shows a desire of taking Fish-Man Island from him. He will do whatever is needed to achieve his goals as he joined Neptune's army solely for sheer military knowledge and experience and has no qualms about betraying his former comrades. Hody's cruelty, recklessness, hatred, superiority complex and biased goals led Neptune to refer him as quite selfish. He claims that he is fully willing to give his own life to destroy humanity."}, {"type": "paragraph", "text": "Hody has shown a great deal of cunning as he deceived the citizens of Fish-Man Island into believing a human murdered Queen Otohime, stole the Energy Steroids from the royal palace without Neptune suspecting him, and later allied with Vander Decken IX (even though Hody does not really see him as an equal) so as to carry out his plan on infiltrating the near impenetrable Ryugu Palace and in an effort to kill Shirahoshi. Hody is also extremely arrogant and boastful (to the point of being insane), showing that he not only thinks himself above all humans, but also above all his fellow fish-men, and went as far as to call the Straw Hat Pirates and a former Shichibukai weak, despite their fearsome reputations and high bounties."}, {"type": "paragraph", "text": "Like many other characters, he has a distinctive laugh: \"Jahahahaha!\""}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Hody seems to be someone who would rather handle things himself, evident when he instructed Ikaros Much to stay back after the latter volunteered to go after Crab-Hand Gyro's crew and opted to hunt them down himself."}, {"type": "paragraph", "text": "He also seems devoted to their cause to the point where he was willing to resort to the use of the Energy Steroids without any fear of the side effects. Hody has been close to his officers since they were kids. Even though the rest of his crew was shocked at the news that he killed Otohime, the officers themselves already knew. However, Hody does not have any care for his crewmates as shown when he used one of them as a shield. Dosun even admits that Hody will not hesitate to throw his comrades away. Hody's utter disregard for loyalty is demonstrated when he attempted to sacrifice all 100,000 comrades simply to kill the Straw Hats and the Fish-Man Island civilians just for the sake of his revenge. His officers, being just as fanatically prejudiced as he is, are willing to die for their cause if Hody insisted."}, {"type": "paragraph", "text": "Regardless of that, Hody's subordinates still follow, respect, and support him. They do seem to care about him since they did show concern for him after Zoro had dealt him a grievous wound and when he had an overdose of Energy Steroids. However, when the lower-rank subordinates were begging for mercy from Jinbe after Hody's defeat, they claimed that they followed Hody because they feared him."}], "images": []}, {"title": "Other Fish-Men", "level": 3, "content": [], "images": []}, {"title": "Arlong", "level": 4, "content": [{"type": "paragraph", "text": "Hody deeply respected Arlong and wished to continue his legacy of conquering humans, though he did think Arlong was barbaric and unsophisticated, a mistake that Hody claimed to have learned from and was more prepared as a result. He originally planned to become Arlong's right hand man when he became of age and trained hard to achieve that goal. However, after Arlong's defeat, he decided that the Arlong Pirates were nothing more than an empty symbol for human-hating fish-men to gather under, showing no more respect for Arlong as a person, but only caring for his philosophies. He sought to defeat Luffy not for defeating Arlong, but for ending Arlong's ambitions of conquering humans. Nonetheless, Arlong was one of the most influential people in Hody's childhood."}], "images": []}, {"title": "Fisher Tiger", "level": 4, "content": [{"type": "paragraph", "text": "Hody respects Fisher Tiger, the hero of the fish-man race, and despises the humans for refusing to donate blood to Tiger in his greatest hour of need (though in truth Tiger refused the blood transfusion due to it being tainted by humanity's hatred for fish-men, a fact Tiger asked his crew not to reveal). However, upon Jinbe's return to Ryugu Kingdom as a Shichibukai, Hody learned that Tiger wished to be at peace with humans, which did not stand well with Hody's beliefs. Regardless of this revelation, Tiger's death had made Hody and his officers realize that Tiger was not the \"hero\" they thought he was."}], "images": []}, {"title": "Hatchan", "level": 4, "content": [{"type": "paragraph", "text": "Even as a child, Hody despised Hatchan for speaking highly of humans such as Silvers Rayleigh, and felt the urge to vomit in disgust whenever Hatchan spoke positively about this friendship. Upon Arlong's defeat and Hatchan's return to Fish-Man Island, Hody lost the little (if there was any to begin with) respect he had left for Hatchan for befriending humans. Hody refused to listen to Hatchan's opinions  and had no qualms with allowing Decken to attack him."}], "images": []}, {"title": "Fish-Man Island Civilians", "level": 4, "content": [{"type": "paragraph", "text": "Hody deeply loathes the citizens of Fish-Man Island for not sharing his perspective. Not only did he terrorize the citizens with violence during his uprising, he psychologically tormented them by forcing them to step on the fumi-e of their beloved queen. Hody deems them worthless and claims that they are the reason why humans scorn fish-men and also expressed a desire to execute those who gave their signatures for migration, deeming them as traitors and their signatures as a list to track on. During his final battle with Luffy, Hody attempted to kill the citizens by having Noah fall down on Fish-Man Island, wanting them dead rather than seeing them coexist with humans."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Humans", "level": 4, "content": [{"type": "paragraph", "text": "Like the rest of his crew, Hody despises humans, looking down on them with the full intent of conquering them. He believes humans are as worthless as slaves, and was willing to use them as disposable pawns for his invasion plan. Despite this, he was willing to grant freedom to those who completed the task he gave them, although the task he gave them had a very low survival chance. He only spared Gyro and his crew so that they could tell the terrors of the fish-man race to the rest of the world. According to Fukaboshi, Hody hates humans more than anyone else, even though he had no reason to other than being raised to hate them emptily."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Amongst humans, Hody bears a deep grudge against the Straw Hat Pirates, particularly Monkey D. Luffy, for crushing Arlong's ambitions. He made the extra effort to kill them during his coup d'etat on Ryugu Kingdom, and intended to show Luffy's head as a way to incite fear to the surface world. In the end, however, this proved to be his downfall; Luffy showed complete dominance over Hody whether on land or underwater, which caused Hody to recklessly chew down handfuls of Energy Steroids, enhancing his hatred on a slippery slope. Even after suffering a complete defeat and his body broke down to the point of no repair, Hody continuously demanded for Luffy to be brought to him for a rematch."}], "images": []}, {"title": "Otohime", "level": 4, "content": [{"type": "paragraph", "text": "Hody despises Otohime for her philosophy of interspecies cooperation between humans, fish-men and merfolks, which clashes against his hatred against humanity. To this end, he personally killed her and destroyed the signatures she worked so hard to gather and then ultimately put her hard work to waste by framing a human for the murder. While celebrating Otohime's death with his comrades, Hody calls it heaven's judgement. During the coup against the Ryugu Kingdom, Hody forced the citizens of fish-man Island to step on her portrait, squashing her supporters and insulting her even after her death. He later bragged about killing her in front of everyone and openly ridiculed her ideals. However, even though Otohime died without knowing who shot her, she did not hate her assailant and pleaded for her children to do the same, a wish that Princess Shirahoshi went to great lengths to honor. Hody would go on to further ridicule this mercy and kindness when he was informed about it."}], "images": []}, {"title": "Neptune", "level": 4, "content": [{"type": "paragraph", "text": "Hody believes that Neptune is a worthless king because he (from Hody's perspective) lacks pride. He did not enjoy enlisting in the Neptune Army and only sought to gain battle experience for his own self interest. Hody was determined to take King Neptune's reign away from him so he can create a world where humanity is completely enslaved. After Hody successfully captured the king, he attempted to execute him in front of his people. Unfortunately for him, Hody failed due to Luffy's interference. Hody also earned Neptune's hatred when he revealed that he was the one behind his wife's assassination. After Hody was defeated, Neptune did not show any rage towards Hody and just have him imprisoned. When Hody has become a frail, old man, Neptune expresses his pity towards him."}], "images": []}, {"title": "Vander Decken IX", "level": 4, "content": [{"type": "paragraph", "text": "Hody made an alliance with Vander Decken IX, and stated it was a pleasure to be working together, and that they were equals instead of leader and underling. However, the reason Hody worked with Decken was because he considered Shirahoshi a threat and thought Decken would be the perfect person to kill her, and that he never really saw Decken as an equal, but instead put up with it simply to use him. After he failed to kill the princess, Hody considered Decken useless. When Decken had betrayed him by going against the plan by throwing Noah towards Fish-Man Island, endangering everyone on it including the New Fish-Man Pirates, Hody saw Decken as a traitor. To get revenge and to destroy Fish-Man Island, Hody stabbed Decken so Noah (which was right above Fish-Man Island) would fall down and destroy the island."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Hody also notes that Jinbe and the faction of the Sun Pirates that follow him are an annoyance. Even though Jinbe had no idea that Hody was the one who actually murdered Otohime (until Hody reveals it), he seems to be the only one outside the Fish-Man District to be aware of Hody's dark nature since he had been keeping tabs on Hody while he was plotting something in the Fish-Man District. During the confrontation at Gyoncorde Plaza, Hody stated that he hates Jinbe the most for not being an enemy of humans especially after the death of Fisher Tiger. By cooperating with the very humans who defeated Arlong, the Straw Hat Pirates, Hody considers Jinbe to be lower than Neptune."}], "images": []}, {"title": "Shirahoshi", "level": 4, "content": [{"type": "paragraph", "text": "Because of Shirahoshi's ability to summon Sea Kings, Hody Jones considers her as a threat to his plans. Therefore, she is one of the people that he wants to kill the most. On the contrary, despite knowing that Hody was the one who killed her mother, Shirahoshi did not bear a grudge against him, nor report his crime to anyone, due to the princess following her mother's final wish of not hating the person who committed the murder. Hody, in return, ridiculed Shirahoshi for her kindness and mercy."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the captain of the New Fish-Man Pirates, Hody had complete authority over the crew. He was stripped of this power when he and his crew were arrested by the Neptune Army."}, {"type": "paragraph", "text": "Usopp noted that Arlong was nothing compared to Hody. Camie mentions to Nami that Hody's mind is more dangerous than his strength, with his deep hatred being his drive beyond his physical limits. He also possesses enormous willpower as he was completely unaffected by Luffy's Haoshoku Haki (though the anime depicted his hand trembling slightly). During his time in the Neptune Army, he was recognized as a particularly talented soldier. As such, he gained knowledge and experience of combat techniques on the battlefield."}, {"type": "paragraph", "text": "Hody was shown to be an extensive planner and shrewd captain, carefully managing the core group of the \"New Fish-Man Pirates\" so that all its members would share his extremist ideals and intense prejudice towards humanity. He shot Queen Otohime of Fish-Man Island and then framed a nearby human smuggler as his scapegoat, to increase support from the wider island community in persecuting humans. He was also more financially supportive of his members, freely willing to spend money to recruit the services of Hyouzou (something which Arlong was unwilling to do), and was also able to recognize the value of an alliance with Vander Decken IX as an equal partner to kill the potential threat of Princess Shirahoshi."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Prior to his body becoming old and frail, as a fish-man, he was ten times stronger than the average human, and twice that in water. His strength was monstrous even by fish-man standards: he was able to completely destroy a massive wall of stone by simply gripping it. After overdosing on Energy Steroids (and before they made him weak), Hody Jones' physical appearance drastically changed, resulting in a more muscular body and bleached-white hair. Also, Hody's strength had increased tremendously. However, after his body became weak and old due to his overdosing, he lost both the boost he got and his natural strength to the point where he needed a stick just to walk, and when he tried to pull apart iron bars, his wrists broke."}, {"type": "paragraph", "text": "Like Arlong, Hody is also able to grow his teeth back immediately after they are broken. His removed set of teeth are replaced by a new set in mere moments. Also, Hody is capable of entering a kind of berserker mode when he gets angry. His eyes take on an appearance similar to those of sea kings. In this state, Hody seems to have gone mad to which Shirahoshi commented that he became far more terrifying than he usually is."}], "images": []}, {"title": "Weapons", "level": 3, "content": [], "images": []}, {"title": "Tridents", "level": 4, "content": [{"type": "paragraph", "text": "During his raid on the Ryugu Palace, Hody was seen holding a long, thin red trident, possibly something he has kept from his old days as a soldier. He managed to defeat Decken with it by stabbing him and then lifting him to block one of Decken's flying axes. In the anime, Hody also threw the trident like a projectile against Zoro."}, {"type": "paragraph", "text": "In the manga, Hody was seen holding a different trident after being struck a grievous wound by Zoro and then revitalizing himself with an Energy Steroid. It was a light-colored one with elaborate design underneath the spikes, similar to the one used by Neptune himself, but much smaller. In the anime, he continued using the plain red one. Later in the manga, he returned to using his original trident."}], "images": []}, {"title": "Kirisame", "level": 4, "content": [{"type": "paragraph", "text": "The Kirisame is a curved blade that Hody puts on his dorsal fin to cut people while swimming at high speed, being sharp enough to slice through a large oarfish and underwater mountains. This further enhances his shark features. The blade was broken by Luffy during their clash in the ocean."}], "images": []}, {"title": "Other Weapons", "level": 4, "content": [{"type": "paragraph", "text": "During his assassination of Otohime, he used a rifle to kill her. He showed enough accuracy to shoot her while she was in the middle of a crowd without detection. In the anime, he wielded a long sword in an attempt to execute Neptune."}], "images": []}, {"title": "Energy Steroids", "level": 3, "content": [{"type": "paragraph", "text": "By taking the deadly Energy Steroids, which doubled his strength each time he consumes a pill, Hody became far more dangerous than he already was, taking further advantage of his amazing physical strength. The pills had become Hody's main source of power for his campaign of terror."}, {"type": "paragraph", "text": "Each pill he took doubled his physical strength. During his attack against Crab-Hand Gyro's escaping ship he had taken at least four and while being underwater, granting him strength at least three-hundred-twenty times that of an average human. His jaws were also very powerful as they were all he needed to single-handedly defeat Crab-Hand Gyro, a pirate with a bounty of 73,000,000, and his entire crew. Swimming with blinding speed, he punched holes in their ship and even ripped the mast off using his jaws. He took multiple gunshots to the back and was completely unharmed."}, {"type": "paragraph", "text": "These pills also seemed to regenerate the users' wounds to some extent and take strain off them, as seen when a wounded and seemingly unconscious Hody, given one more pill, managed to stand up in mere seconds and to use his strength to its full extent, stopping the gigantic Neptune with just one hand. This led him to abuse the pills as though they were painkillers."}, {"type": "paragraph", "text": "After overdosing on the drug to ease the pain of the scar Zoro gave him, Hody underwent a painful transformation into a much more massive form. In this new form, his strength was greater than ever, allowing him to fire a drop of water like a bullet a great distance across the island, piercing through people, buildings and rock alike. Thanks to the Energy Steroids, he was also able to withstand a lot of damage from Luffy's Haki-enforced attacks. Also, Hody was able to swim faster than a mermaid as he managed to catch Shirahoshi while she was fleeing."}, {"type": "paragraph", "text": "However, the Energy Steroids came back to do more harm than good as it made his body weak and old after his arrest. When he tried to bust through the prison cell, he screamed in pain as his joints snapped where he tried to draw his strength from."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Hody_Attacking_Gyro_Pirates.png/revision/latest/scale-to-width-down/210?cb=20140807015655", "caption": "Hody attacking Gyro's crew while boosted by Energy Steroids."}]}, {"title": "Fish-Man Karate", "level": 3, "content": [{"type": "paragraph", "text": "Hody was a practitioner of Fish-Man Karate and he showcased it by his manipulation of water. He could hurl simple droplets of water and turn them into deadly bullets with extreme kinetic force. He could also punch the water to send a shockwave through the water and the victims body."}, {"type": "paragraph", "text": "After overdosing on Energy Steroids, Hody appeared to drip with water even though he wasn't soaked, suggesting that he'd been secreting it. However, according to Jinbe, Hody's Fish-Man Karate was at an amateur level despite his great strength as shown when fighting Luffy, for while Jinbe could do noticeable damage to the rubber man, Hody's attacks were ineffective. After his body became old and frail, his Fish-Man Karate ability most likely decreased significantly."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Childhood", "level": 4, "content": [{"type": "paragraph", "text": "As Hody and his future officers were growing up in the Fish-Man District, they only learned one thing: hate humans. With Arlong as their role-model, they were indoctrinated into believing that fish-men were heaven-sent to rule the world and they grew to despise humans based on the belief that they are destined to be superior. Hody and his crew looked up to Arlong and his dream. Hody dreamed that one day, he would grow up to be Arlong's right-hand man."}, {"type": "paragraph", "text": "Sometime later, in the Fish-Man District, a fish-man was preaching in the street about how humans are an inferior species that are running rampant and threatening fish-mankind. Hody Jones listened to this and seemed to take it to heart. Another fish-man was talking about someone who blew up a slave shop on the surface. A memorial wreath was in front of a large picture of the fish-man in question. People were standing around it, saying that he died, but took eight humans with him and caused widespread disaster on the surface. Hody was pleased that humans died while Ikaros Much was praising the man, saying he wants to be a \"hero\" too. At another point, Hody and some other children were listening to Hatchan's story about his friendship with a human named Rayleigh. Before Hatchan finished, Hody left in utter disgust."}, {"type": "paragraph", "text": "While they were teenagers, Hody and his companions read about Fisher Tiger's exploits at Mary Geoise. They cheered the Sun Pirates on thinking that their goal was to destroy humans, not knowing that Fisher Tiger had non-lethal methods."}], "images": []}, {"title": "Neptune Army Days", "level": 4, "content": [{"type": "paragraph", "text": "At some point, he joined the Neptune Army only to gain battle experience and not out of loyalty  while his future crew became a group of anarchists that attacked fish-men that dealt with blood transfers with humans. During his time as a soldier, he was present in the throne room when Jinbe, the captain of the Sun Pirates after Fisher Tiger, spoke with Neptune. Hody seemed displeased upon hearing that Jinbe accepted the position of Shichibukai and that Tiger actually wanted peace with the humans."}, {"type": "paragraph", "text": "When a World Noble, Saint Mjosgard, arrived on the island, Hody was in favor of killing him, considering him to be \"the worst trash in the world\". He then looked stunned upon witnessing Shirahoshi's ability to summon Sea Kings."}, {"type": "paragraph", "text": "When Otohime was nearly successful in her campaign for peace with humans, Hody paid a human pirate to set fire to the signature box. Amidst the chaos, Hody assassinated Otohime with a rifle. After successfully murdering Otohime, Hody then shot the pirate. When Jinbe and the royal guards found him, Hody deceived them into thinking that the human was the criminal. Jinbe, not suspecting Hody at all, advised him to hide the pirate. Hody ignored Jinbe and declared to everyone that Otohime was assassinated by the human. Every citizen believed Hody as they grieved over Otohime's death and so, Hody successfully demoralized the citizens as well as giving them another reason to hate humans."}, {"type": "paragraph", "text": "Before leaving the Neptune Army, Hody stole Energy Steroids from the Tamatebako. Back at the Fish-Man District, Hody and his companions celebrated Otohime's death. Hody then presented the Energy Steroids and asked Zeo to mass-produce them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e7/Hody_%26_Assassin.png/revision/latest/scale-to-width-down/210?cb=20130513211746", "caption": "Hody framing a human for Otohime's assassination."}]}, {"title": "After Arlong's Defeat", "level": 4, "content": [{"type": "paragraph", "text": "After the Arlong Pirates had been defeated by Straw Hat Pirates, Hody decided to step up to continue where Arlong left off. He formed the New Fish-Man Pirates and declared the beginning of their quest for vengeance. At some time, he also captured and enslaved a Kraken from the North Pole."}], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [], "images": []}, {"title": "The Alliance", "level": 4, "content": [{"type": "paragraph", "text": "Learning from the Arlong Pirates' mistakes, Hody and his crew made thorough preparations to carry on Arlong's will. While preparing for his plan to take Fish-Man Island, Hody had his henchmen intercept human pirate crews coming to Fish-Man Island and force them to join the New Fish-Man Pirates, making their experience on Fish-Man Island miserable. Occasionally, some of the human captives attempted to flee only to be made examples by Hody."}, {"type": "paragraph", "text": "When Hammond reported that the Straw Hat Pirates had arrived on Fish-Man Island, Hody expressed his desire to see the captain, Monkey D. Luffy, and ordered Hammond to bring Luffy to him."}, {"type": "paragraph", "text": "When he learned that Gyro's pirate crew (a pirate crew that swore loyalty to the New Fish-Man Pirates upon entering Fish-Man Island) was fleeing Fish-Man Island to escape the clutches of the New Fish-Man Pirates, Hody decided to deal with them himself. He took some Energy Steroids and confronted the pirates after putting his hands in handcuffs. With his jaws alone, he gave the pirates a complete and utter defeat. Hody decided to spare their lives in order to allow them to float to the surface, so that they can spread word of the terror of the New Fish-Man Pirates. He then declared that the New Fish-Man Pirates will overthrow king Neptune, take Fish-Man Island by force, and show the world that fish-men are the supreme race."}, {"type": "paragraph", "text": "Later in Noah, he was joined by Vander Decken IX. After Decken put on a glove, they shook hands, forming an alliance. They agreed to take down Neptune, crush the Neptune Army, and cause the kingdom to crumble."}, {"type": "paragraph", "text": "As they set their plan into motion, Hatchan appeared and tried to talk the New Fish-Man Pirates out of going through with the operation. Hody expressed his disappointment towards Hatchan, saying that he has gotten soft and allowed him to become a target of Vander Decken IX. Once Hatchan had been dealt with, Hody then told a group of captive pirates about how will they take part in the operation. He explained to them that Decken will throw them at Hard-Shell Tower in the Ryugu Palace. Once they are inside, they will open the connection corridor to the palace which will allow the New Fish-Man Pirates to invade. Hody went on saying that he was not concerned about whether they live or die and that they were nothing more than pawns for them to use."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Hody_and_Decken_Alliance.png/revision/latest/scale-to-width-down/210?cb=20140925235316", "caption": "Hody's alliance with Vander Decken IX."}]}, {"title": "The Coup d'État", "level": 4, "content": [{"type": "paragraph", "text": "Hody was then seen heading to Ryugu Palace while riding on top of the sea monsters with his crew and Vander Decken IX. Once they entered the palace, they met the Straw Hats and the already subdued and tied-up King Neptune and the Ryugu Palace guards. Hody commented that this seemed way too convenient. King Neptune quickly accused Decken of kidnapping Shirahoshi which made Decken realize that the Mermaid Princess was no longer in the palace. Hody calmed Decken saying that he could find her location using his ability. Decken went after Shirahoshi leaving Hody to take care of things in the palace."}, {"type": "paragraph", "text": "After seeing that Hody has an Arlong tattoo, Nami went to an unknown location. When the Minister of the Right cursed Hody, a former soldier of the Neptune Army, for causing chaos on Fish-Man Island, Hody revealed that he only joined the army to gain experience. Hody then crushed a palace wall, flooding the palace in the process. He launched his Archer Shark attack, injuring Neptune and some of his soldiers. Hody laughed at Neptune for getting in the way of the attack, saying that a king should not protect his subjects. Zoro counterattacked by sending a sword wave at the fish-man. Hody blocked the attack by using one of his own comrades as a shield."}, {"type": "paragraph", "text": "Hody then ordered his crew to attack, but Usopp held them back by launching a Pop Green that spawns a flower the gives off a bad odor. Hody, however, remained unfazed, commenting on the childishness of the attack. Usopp and Brook untied the guards and Zoro cut Neptune's chains. When completely underwater, Hody prepared to face off against Zoro. However, even though he had an advantage being underwater, he appeared to be no match for the swordsman, who seemed to have dealt him a grievous deep wound."}, {"type": "paragraph", "text": "Neptune took Zoro, Usopp, and Brook and created an escape route, which the ministers and the palace guards used to escape. A New Fish-Man Pirate gave Hody an Energy Steroid, reviving him in the process. Before Neptune and the three Straw Hats with him could escape with Hoe, Hody seized Neptune with one hand. The New Fish-Man Pirates then captured Neptune, Zoro, Usopp, and Brook."}, {"type": "paragraph", "text": "Hody was later seen addressing Fish-Man Island through a visual broadcast. He explained his plan to take over and rebuild the Ryugu Kingdom with himself as the ruler. He told the citizens that those who wish peace with the humans should be banished. He showed the chained-up King Neptune and explained his plan to execute him in Gyoncorde Plaza in three hours. He went on saying that he found the letter from the World Noble and the box holding the signatures. Since stepping on Otohime's fumi-e would not be enough, he decided to use the signatures to determine who is against him. He would also dispose of anyone who gave their signatures. He then addressed the Straw Hats and showed the imprisoned Zoro, Usopp, and Brook. Hody planned to drown them in a room with rising water after executing Neptune and intended on making an example out of Luffy to the surface world."}, {"type": "paragraph", "text": "After he finished his speech, he decided to leave the palace with most of his subordinates since the palace is impenetrable. He was also confident that no one could save the three Straw Hats imprisoned in the palace and commented that the wound he got from Zoro still ached. He then received a status report on the island's new residents from the Fish-Man District. Hody told his subordinates to use the homes of those who left and those who would die."}, {"type": "paragraph", "text": "As he was taking the king to Gyoncorde Plaza, he suddenly suffered from intense pain due to taking so many Energy Steroids as painkillers, collapsing and twitching in agony, to the point of having difficulty in breathing. Neptune chastised him for being too reliant on the steroids and was now reaping the consequences. Shortly after thrashing around on the sea monster's back that he was riding on, Hody managed to get up, with an apparent change in his body that was enough to frighten a sea bear that was a certain distance away."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d4/Zoro_Defeats_Hody.png/revision/latest/scale-to-width-down/210?cb=20141206185948", "caption": "Hody slashed by Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/36/Hody_on_TV.png/revision/latest/scale-to-width-down/210?cb=20130712092748", "caption": "Hody making his broadcast."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Energy_Steroid_Side_Effects.png/revision/latest/scale-to-width-down/210?cb=20130512000834", "caption": "Hody succumbing to the Energy Steroid's side effects."}]}, {"title": "Battle for Fish-Man Island", "level": 4, "content": [{"type": "paragraph", "text": "Hody arrived at the execution ground as a changed being. After taking his seat, he then stared quizzically at an Energy Steroid. His crew also gathered at the plaza and the Neptune Army's attempts to save the king were thwarted by the Sea Beasts. When a soldier tried to kill one of the officers with dynamite, Hody stopped him with Uchimizu. With his new found strength, not only was the shot able to go through the soldier, but it also crashed through several rock and coral formations before landing in the water at Mermaid Cove. He then marveled at his own strength saying that he felt incredible. When the princes arrived, Hody listened to Fukaboshi's speech about how the people want to walk with humans and Hody was preventing that. After the princes defeated the Sea Beasts, Hody simply replied that in the end, the kingdom would belong to the victor."}, {"type": "paragraph", "text": "The princes were then defeated and captured. Jinbe, Shirahoshi, and Megalo had fallen into one of Hody's traps and got captured as well. Hody was overjoyed that his plan was going smoothly and all of his subordinates gathered in the plaza. Madam Shyarly appeared and told Hody that he would not be the one to destroy Fish-Man Island and the island would be destroyed by Straw Hat Luffy. Out of annoyance, Hody hit her with a water shot and loudly declared on how different he is from her older brother, Arlong. He then revealed to everyone that he was the one who truly assassinated Otohime, stunning the king, the princes, the citzens, Jinbe, and even his lower-rank subordinates. After Hody explained that the human pirate he caught was a scapegoat, Neptune was furious, and Hody responded by injuring him with a water shot. When Hody gloated about killing Otohime right in Shirahoshi's face, the princess said that she knew all along."}, {"type": "paragraph", "text": "Surprised, Hody then demanded Shirahoshi to explain how she knew. Shirahoshi explained that Megalo saw Hody committed the crime and told her about it. The reason that Shirahoshi did not tell anyone was because she was honoring her mother's last wish of not holding any hatred towards the killer. Hody then laughed, much to Jinbe's anger, and mocked Megalo for only telling the story to Shirahoshi, saying that if he had told anyone else, his plan would have been ruined. He then ridiculed Shirahoshi, calling her kindness stupidity. He further stated that by hiding the truth, she would lead to the deaths of her father and brothers. When Jinbe tried to reassure Shirahoshi that she did nothing wrong, Hody then tried to prove his point by torturing Neptune and the princes with his water attacks. The citizens could not stand to watch Hody's cruelty any longer and started calling out for Luffy to destroy the island based on Shyarly's prophecy. Hody remained in denial, stating his belief that Shyarly's prediction was a lie. Angry with the citizens, Hody prepared to decapitate Neptune, but Luffy (who had been hiding inside Megalo) appeared and kicked Hody back a great distance."}, {"type": "paragraph", "text": "After Hody got back up, he stated on how much he hated fish-men like Jinbe that side with humans. He then revealed his plan to go to the Levely and kill all the kings there. He also stated his goal on becoming Pirate King. Hody ordered his subordinates to attack the Straw Hats, but Luffy easily defeated half of them with Haki. As Hody was stunned, Luffy told him that he was going to fight him."}, {"type": "paragraph", "text": "Hody declared that the Straw Hats could not protect one huge mermaid and proceeded to attack Shirahoshi with a water shot, but his attack was nullified by Jinbe's water shot. Jinbe stated that Hody's level of Fish-Man Karate pales in comparison to Jinbe's. As the Straw Hats took on and begin defeating divisions of the New Fish-Man Pirates one by one, Hody became irritated. He commanded the Kraken to attack, but the Kraken betrayed him for Luffy which angered Hody even more. As the battle continued, Hody threatened to Surume that he would go to the North Pole and kill his brothers if he continued to disobey him. Luffy however overheard this and promised Surume he would protect his brothers before walking toward Hody. Despite Hody's crew trying to stop Luffy, he managed to slip past them and landed a kick on Hody's face."}, {"type": "paragraph", "text": "Hody quickly got back up and punched Luffy in the face. The attack had no effect on Luffy since he's rubber. Luffy counterattacked using a headbutt which hit a member of the iron shell division. Luffy then hit Hody again in the stomach, which sent Hody crashing into a wall."}], "images": []}, {"title": "Noah and Ultimate Defeat", "level": 4, "content": [{"type": "paragraph", "text": "Hody saw that Noah arrived and he cursed Vander Decken IX for trying to destroy Fish-Man Island with him in it. He then climbed up on the chains connecting to Noah while saying this was a good situation. With Sanji's assistance, Luffy managed to reach on one of the chains attaching to the ship while Hody was somewhere below Luffy. Meanwhile, some of the citizens tried to slow down the boat by pulling on the chains. Hody remarked that their efforts were useless and attacked them with water bullets. The ship continued to rise up after Shirahoshi while Luffy and Hody reached the sea. Hody swam behind Luffy and threatened to kill him but Luffy was saved by Fukaboshi. Hody then took out a new weapon, Kirisame, and attacked both Luffy and Fukaboshi, but he missed and arrived on Noah."}, {"type": "paragraph", "text": "Decken welcomed Hody, but Hody pierced his trident into Decken without warning while questioning Decken about what would happen to Noah if Decken dies. However, Decken managed to touch Hody with his left hand. Hody stated that if Decken dies, the effects of his ability will disappear. He went on to say that he would let Noah fall on Fish-Man Island. Decken stepped away from Hody and threw an axe at him. Hody easily dodged it and Decken attacked him with his knives installed in his sandals. Hody dodged and bit Decken in the leg. When the axe was coming back, Hody used Decken as a shield and the axe hit Decken instead. After Decken fell, Hody tried to attack Shirahoshi. He repelled Ryuboshi and Manboshi and prepared to kill the Mermaid Princess. Luffy, while riding on Fukaboshi's back, grabbed Hody and swinged him away in the nick of time."}, {"type": "paragraph", "text": "Hody was undeterred and was still confident that Fish-Man Island would be destroyed. When Shirahoshi changed her course, Hody attempted to stop her, but was once again grabbed by Luffy. When Decken passed out, the ship no longer followed Shirahoshi and began to fall, making Hody pleased by this turn of events."}, {"type": "paragraph", "text": "As Luffy and the princes fought against Hody, he kept interfering with their attempts to stop Noah, causing Manboshi to be severely wounded. Luffy punched Hody into the ship, and Hody sliced a hole in the air bubble in retaliation, preventing Luffy from boarding it. Fukaboshi then charged at Hody, questioning what humans had ever done to Hody. Hody's answer was \"Nothing\" and that he was just passing judgement on the humans, letting the eldest prince know Hody's \"true form\", which is that of a person born out of hatred and resentment. Hody then tried to stop Luffy and Shirahoshi again, but Luffy broke his Kirisame and sent Hody flying back, and Hody once again got back up. Annoyed, Hody took out a handful of Energy Steroids and consumed them all at once. He started to scream in agony as he underwent another monstrous transformation. Hody was then seen laughing maniacally as Fukaboshi revealed what he learned to Luffy and Fish-Man Island."}, {"type": "paragraph", "text": "As Hody moved in, he remembered his past about how Arlong and many other human-hating fish-men taught him and his friends to hate humans, and how he and his crew plotted to overthrow humanity over the years. As he snapped out of memory lane, he was intercepted by Luffy, who declared the end. Hody, accepting the challenge, was prepared to bite off Luffy's arm, but Luffy hit Hody with Gomu Gomu no Red Hawk."}, {"type": "paragraph", "text": "After the attack, Hody was sent flying towards Noah and crashed onto the deck of the ship. Wounded so badly, he started attempting to shovel down more Energy Steroids. As he desperately tried to put them back into his mouth, he saw Luffy coming his way. Hody used a new attack called 'Murasame' via the water leaking out of the spot he crashed into. Luffy dodged Hody's attack and counterattacked using Elephant Gun which finally defeated Hody Jones. With his last conscious thought, Hody told Noah to fall on Fish-Man Island to destroy all the fish-men who lost their pride for siding with humanity."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Hody_Stabs_Decken.png/revision/latest/scale-to-width-down/210?cb=20151110011022", "caption": "Hody stabs Decken with his trident."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Gomu_Gomu_no_Red_Hawk.png/revision/latest/scale-to-width-down/210?cb=20140925235550", "caption": "Hody struck by Luffy's \"Gomu Gomu no Red Hawk\"."}]}, {"title": "Imprisonment", "level": 4, "content": [{"type": "paragraph", "text": "After the Sea Kings stopped Noah from crashing into the island, the princes brought the unconscious Hody and Decken to the plaza and put them in chains, with Fukaboshi declaring that these two would be incarcerated forever. Hody, even though unconscious, still had a frightening appearance to him, as his crew said he looked like a monster. Hody, his officers, and Decken were later locked up in the palace prison."}, {"type": "paragraph", "text": "Later on, it is revealed that while in prison, Hody and his officers had aged into old, frail men. The Energy Steroids that they all had been compulsively taking as a way to boost their strength were actually the contents of the Tamatebako. They were locked up by the Royal Palace due to their dangerous side effects. When the Minister of the Right pointed out an incident in which the Energy Steroids were stolen, Hody confirmed that he was the thief. Despite being frail, Hody swore revenge on Luffy and Fish-Man Island and called Fukaboshi a disgrace to their race. He was promptly told by Neptune that he would no longer be any threat to the island and that he was truly pitiful, so much so that Neptune said he would reconsider the pirates' punishment. Fukaboshi stated that he does not hate Hody for murdering Otohime, but told him to remain silent as he did not want the children to hear him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Hody_and_Decken_Arrested.png/revision/latest/scale-to-width-down/210?cb=20141206205557", "caption": "Hody and Decken defeated and arrested."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hody Jones vs. Gyro and his crew", "elements": []}, {"text": "Hody Jones vs. Roronoa Zoro", "elements": []}, {"text": "Hody Jones vs. Monkey D. Luffy (at Gyoncorde Plaza)", "elements": []}, {"text": "Hody Jones vs. Vander Decken IX", "elements": []}, {"text": "Hody Jones vs. Ryuboshi and Manboshi", "elements": []}, {"text": "Hody Jones vs. Monkey D. Luffy (outside Fish-Man Island)", "elements": []}, {"text": "Hody Jones vs. Fukaboshi", "elements": []}, {"text": "Hody Jones vs. Monkey D. Luffy (on board of Noah)", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "His family name comes from hōjiro-zame (ホオジロザメ, hōjiro-zame), the Japanese name for great white shark."}, {"type": "paragraph", "text": "His family name, \"Hody\", has been translated as \"Hodi\", \"Hordy\", and \"Hordi\" before being spelt by Oda as \"Hody\". The FUNimation subs have gone with the translation \"Hordy\"."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "list", "elements": [{"text": "During his fight against the Gyro Pirates, Hody smashed through the bottom of the ship. In the manga, he caught one of Gyro's men in his mouth while in the anime, the man was simply bashed away when Hody shot out of the floor.", "elements": []}, {"text": "In the anime, when Hody enters the palace, there is a flashback not shown in the manga. It shows that Dosun, as a child, was getting kidnapped by pirates and Hody and the other future officers of the New Fish-Man Pirates tried to save him only to get beaten down. The pirates prepared to kidnap them as well, but Arlong came and subdued the pirates, saving Hody and his friends.", "elements": [{"text": "This also conflicts with a statement Hody later states where he admits to Fukaboshi that they have never had any personal interaction with the cruelty of humans that justify their actions. However, this doesn't seem to be the driving force behind his actions against humans, as Hody appears to haven chosen to persecute humans just for the sake of doing so, even before this event took place, as he was a young child upon embracing his malice, and had started attacking humans on purpose by the time Dosun was kidnapped.", "elements": []}]}, {"text": "Hody's battle with Zoro is expanded in the anime.", "elements": []}, {"text": "When Hody reveals to all fish-men and merfolk gathered at the Gyoncorde Plaza that he is the one who killed Otohime in the anime, he explains how he did it and it's seen in a flashback but it's more seen than explained. In the manga, it's the opposite with Hody's story more explained than seen. The flashback in the anime is clearer than in the manga.", "elements": []}]}, {"type": "list", "elements": [{"text": "His fight with Luffy aboard Noah is expanded in the anime with Hody attacking Luffy several times instead of just using Murasame.", "elements": [{"text": "This includes the part where Luffy used several Jet Pistols against him that he was able to evade and Luffy using yet another Red Hawk. The finale of the battle is also changed, where in the manga Luffy hits Hody with with a Busoshoku Haki Gear Third punch after avoiding his Murasame attack. In the anime, Hody uses Murasame to try and push the attack back. It holds for a bit, but ultimately, Luffy's attack gets through and slams into Hody, defeating him.", "elements": []}]}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1b/Energy_Steroid_Speed_in_the_Anime.gif/revision/latest?cb=20120930102139", "caption": "Hody's speed after overdosing on the energy drug."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited World Red", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His given name may come from \"Davy Jones\", a nickname for what would be the devil or god of the seas.", "elements": []}, {"text": "It is also possible that his name comes from \"Jaws\", as the Japanese pronunciation for \"Jones\" Jōnzu (ジョーンズ) and \"jaws\" Jōzu (ジョーズ) are near-homophones. This is supported by the fact that the titular shark from Jaws was, like Hody, a great white.", "elements": []}, {"text": "In an SBS, a fan asked Oda if Hody had two penises because sharks have them, and Oda responded that yes, Hody has two penises.", "elements": []}, {"text": "Otohime's assassination due to objecting to the migration between humans and fish-men by Hody is like the assassination of Yitzhak Rabin by Yigal Amir, who objected to Oslo Accords, which included peace steps between Jews and Arabs.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Great White Shark – Wikipedia article on the type of fish-man Hody is.", "elements": []}]}], "images": []}]}