{"sections": [{"title": "Manboshi", "level": 1, "content": [{"type": "paragraph", "text": "Manboshi is an opah merman and the third son of the royal Neptune Family on Fish-Man Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Manboshi is a rotund, stocky and large merman (shown when he spoke with Madame Shyarly). Like his brothers, he has a polka dot tail, with a black variation along with white polka dots and red scales. He also has brown hair and red fins on his head."}, {"type": "paragraph", "text": "He wears a blue hat with a dirty white stripe going across the middle of it. The stripe is serrated on the bottom side and there is a dot pattern inside the stripe. He also wears a yellow sash, like his two older brothers."}, {"type": "paragraph", "text": "When he and his family arrived at the Red Port for the Levely, he wore a dark shirt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Manboshi is perhaps the most energetic among his brothers. He talks in song, and has a habit of saying \"Akkamanbo\". It appears he can be rather unpredictable, as he asked Ryuboshi to dance with him in the middle of looking for the Straw Hat Pirates. Like Ryuboshi, he sings when he talks, except he does not sing in scale. His habit of singing came from his effort to cheer his sister up to protect the Fish-Man Island from her powers."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a prince, he has some royal authority granted to him. Along with Fukaboshi and Ryuboshi, Manboshi is one of the three most powerful warriors of the Neptune Army. The Minister of the Right claimed that the Straw Hats would be in trouble if they were confronted by Manboshi and his brothers. Further testament to his strength is when he, along with his brothers, took down the sea beasts that easily defeated the rest of the Neptune Army including the two ministers. The New Fish-Man Pirate officers also had to take at least two Energy Steroids to defeat him and his brothers."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He has been seen wielding a massive, Medieval-style longsword, and possesses great skill in wielding it, dispatching a large group of drug-enhanced sea monsters with his brothers in mere seconds. In the anime, the sword was destroyed by Daruma."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e4/Manboshi_With_His_Sword.png/revision/latest/scale-to-width-down/200?cb=20130408222849", "caption": "Manboshi wielding his sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "As a child, he and his brothers would look after their then baby sister, Shirahoshi whenever their mother, Otohime, was away preaching to the people of Fish-Man Island."}, {"type": "paragraph", "text": "When Shirahoshi was six-years-old, a World Noble arrived on the island in a wrecked ship. Otohime quickly dashed off to where the ship was docked. The four children of the royal family soon followed her."}, {"type": "paragraph", "text": "When Otohime was threatened by the noble she was protecting, Shirahoshi cried and unknowingly called out Sea Kings. The World Noble passed out from a big shock and Manboshi and his brothers tried to calm Shirahoshi."}, {"type": "paragraph", "text": "When Otohime decided to accompany the noble to the surface, Manboshi and his siblings looked worried. For one week, they anxiously waited in the castle for her return. After Otohime returned safe and sound, she finally reached out to the citizens and collected their signatures. Manboshi, his siblings, and Neptune were overjoyed by Otohime's success."}, {"type": "paragraph", "text": "Otohime later explained to Manboshi and his brothers about Shirahoshi's ability to call Sea Kings, which is connected to a legend. She went on saying that Shirahoshi's ability could be dangerous since she could not control it yet. Otohime then asked the three brothers to become strong warriors and protect Shirahoshi."}, {"type": "paragraph", "text": "One day in Gyoncorde Plaza, the box containing all of the signatures suddenly caught fire. In the confusion, Otohime was shot. Manboshi and his brothers immediately came to their mother's side. The three brothers tearfully listened to their mother's last words, telling them not to be angry for her sake and to look after Shirahoshi. They then noticed that Shirahoshi was about to scream. Manboshi and Ryuboshi remembered what their mother said about what could happen if Shirahoshi calls Sea Kings again and how an emotional shock could trigger it. The two brothers then started singing and dancing in a desperate attempt to raise Shirahoshi's spirits and keep her from crying out, much to everyone's confusion and annoyance. As their mother passed away, Manboshi and his siblings touched pinky fingers with her for the last time."}, {"type": "paragraph", "text": "Before Otohime's funeral, the four children of the royal family told their father about the love letters that kept flying to Shirahoshi. Neptune told Manboshi and his siblings to not to go out to the funeral since danger still lurked around. During Otohime's funeral, Manboshi and his siblings were seen on a visual broadcast as Fukaboshi gave his speech."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Ryugu_Royal_Family.png/revision/latest/scale-to-width-down/225?cb=20120403020751", "caption": "Manboshi and his siblings after their mother returned home from preaching."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/42/Manboshi_and_Ryuboshi_Try_to_Cheer_Shirahoshi_Up.png/revision/latest/scale-to-width-down/240?cb=20130514045632", "caption": "Manboshi and Ryuboshi try to cheer up Shirahoshi after Otohime's death."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "He and his two older brothers went to Mermaid Cove, investigating the illegal entry. At one point, he yelled for everyone to start dancing, wishing to join in with the mermaids frolicking. He was stranded at Mermaid Cove after the Straw Hat Pirates took the royal gondola. He and his brothers talked to the mermaids about why they were looking for the Straw Hats. The reason was that they had to deliver a message from Jinbe. Later, he and his brothers were concerned about Madame Shyarly's prediction."}, {"type": "paragraph", "text": "At the entrance gate to Ryugu Palace, Manboshi was concerned for his sister and father's safety after hearing about the Straw Hats taking over the palace."}, {"type": "paragraph", "text": "Some time later, he and his brothers watched Hody's speech to Fish-Man Island through a visual broadcast. He was furious to hear Hody's plan to take over and rebuild the Ryugu Kingdom with himself as the ruler. He was shocked and worried when Hody showed the chained up king. Hody announced that he would execute the king at Gyoncorde Plaza."}, {"type": "paragraph", "text": "After Hody finished his speech, Manboshi and his brothers rode on their gondola and headed for the plaza to save their father even though it might be a trap. On the way there, Manboshi stated that he understood why Jinbe was always keeping on eye on Hody and why pirates were not visiting the island recently. He and Fukaboshi then discussed the Straw Hat Pirates. Fukaboshi said that he was worried about Madame Shyarly's prediction, but he did not feel any ill-intent from them at all. Manboshi commented on how he felt the same way since the mermaids form Mermaid Cove, who already met the Straw Hats personally, did not speak ill of them at all and that the mermaids' eyes are capable of seeing through anyone."}, {"type": "paragraph", "text": "Manboshi soon arrived at Gyoncorde Plaza with his brothers and wondered why the soldiers started fighting without them. He and his brothers then attacked and easily defeated the drugged Sea Beasts. Manboshi then declared that they choose a future of love with mankind and would defeat the New Fish-Man Pirates. Manboshi and his brothers then charged at the officers."}, {"type": "paragraph", "text": "Initially, the princes had the upper hand, but the officers turned the odds against them by taking Energy Steroids. The princes were then defeated and captured. When Hody wondered about the current status of Princess Shirahoshi, Manboshi yelled at Hody not to lay a finger on Shirahohsi, saying that she was no threat to him. Hody then stated that he knew about the Mermaid Princess of legend. After Shirahoshi, Megalo, and Jinbe were captured and brought to the plaza, Hody revealed to everyone that he was the one who truly killed Otohime. Manboshi was stunned at this revelation. Shirahoshi said that she already knew about it thanks to Megalo and she did not tell anyone because she was honoring her mother's last wish of holding no hatred for the killer. As Hody mocked Shirahoshi for allowing him to go free, he attacked the royal brothers and Neptune with Yabu Same. Shortly afterward, Manboshi, his father, and his brothers were rescued by Hoe during the Straw Hats' unexpected arrival."}, {"type": "paragraph", "text": "When Shirahoshi tried to swim away from Fish-Man Island as Vander Decken IX had thrown Noah towards her, Manboshi went after her together with his brothers. They came to Shirahoshi's aid at the instant when Decken threw knives at her. Manboshi and Ryuboshi blocked the knives and then tried to lead Shirahoshi to safety. After Hody impaled Decken and took him out of the fight, he went after the princess using Fish-Man Karate and Manboshi blocked the attack, leaving him heavily wounded."}, {"type": "paragraph", "text": "Decken was still alive, but fell unconscious and the ship started falling towards Fish-Man Island. Luffy later defeated Hody and the Sea Kings stopped Noah from falling. Manboshi and his brothers then took Hody and Decken to the plaza and put them in chains. While the officers and Decken were imprisoned, the royal family and the Straw Hats had a feast at Ryugu Palace as a celebration. Later, after being informed about a strange occurrence in the dungeon, Manboshi went with his father, brothers, the ministers, and Jinbe down to the dungeon to see that the imprisoned officers had become frail, old men."}, {"type": "paragraph", "text": "Afterwards, Manboshi and the people of Fish-Man Island bid the Straw Hats farewell as they set sail for the New World. Manboshi thanked them for everything while stating that their army would become more stronger than before. Manboshi and his brother promised their father that they would not forget the debt they owe to the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ab/Merman_Gujutsu_Infobox.png/revision/latest/scale-to-width-down/245?cb=20130429035206", "caption": "The brothers take down the sea beasts."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/10/Gyoncorde_Plaza_Execution.png/revision/latest/scale-to-width-down/250?cb=20120626062558", "caption": "Manboshi with his father and brothers, all chained up and on display for execution."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Neptune Family prepared to go to Mary Geoise for the Levely, Manboshi commented that they received enough signatures for Otohime's petition."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Neptune Family prepared to depart Fish-Man Island, they received the news of the events that occurred at Totto Land."}, {"type": "paragraph", "text": "The Neptune Family later arrived at the Red Port, and Monkey D. Garp escorted them to the bondola. As he and his family rode it to Mary Geoise, Manboshi was happy that Shirahoshi marveled at the sun and sky. Manboshi and his family later reached the top of the Red Line and they made their way to the Mary Geoise castle. At the socializing plaza, Manboshi conversed with other royals."}, {"type": "paragraph", "text": "Manboshi and his brothers later witnessed Charlos' attempt to enslave Shirahoshi. After Mjosgard stopped Charlos, Manboshi stood beside his father as Mjosgard promised Neptune that he would protect Shirahoshi during the Levely."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, Manboshi returned to Fish-man Island with his family."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Manboshi, Fukaboshi, and Ryuboshi vs. New Fish-Man Pirates Sea Beasts", "elements": []}, {"text": "Manboshi, Fukaboshi, and Ryuboshi vs. New Fish-Man Pirates' Officers (unseen in the manga)", "elements": []}, {"text": "Manboshi and Ryuboshi vs. Hody Jones", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Manboshi and Ryuboshi vs. New Fish-Man Pirates", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is a pun on Akamanbō (moonfish) and mambo.", "elements": []}]}], "images": []}]}