{"sections": [{"title": "Ryuboshi", "level": 1, "content": [{"type": "paragraph", "text": "Ryuboshi is an oarfish merman and the second son of the royal Neptune Family on Fish-Man Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is an extremely tall and thin merman (shown when he spoke with Madam Shyarly), and is the second tallest of his brothers. He has wide eyes, long wavy dark pink  hair, and beaverlike teeth."}, {"type": "paragraph", "text": "The only one of the princes to be clothed in the upper body, he wears a fancy robelike garment with sleeves that are puffed at the shoulders and wrists. He carries two swords behind him, held in place by an orange sash. He also has a long purple tail with white polka dots and a red fin."}, {"type": "paragraph", "text": "When he and his family arrived at the Red Port for the Levely, he wore a light colored shirt."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ryuboshi is very upbeat and jovial. He has a habit of ending his sentences by singing part of a musical scale, such as \"so-la-ti-do\". He and his younger brother Manboshi apparently like to dance, as he suggested it to him while Fukaboshi was asking the mermaids about the Straw Hat Pirates. His habit of dancing came from his effort to cheer his sister up to protect Fish-Man Island from her powers."}, {"type": "paragraph", "text": "However, he can be serious if the situation calls for it, such as when Luffy was beating up the New Fish-Man Pirates, he started to draw his sword, should his involvement have become necessary."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a prince, he has some royal authority over Fish-Man Island. Alongside Fukaboshi and Manboshi, Ryuboshi is one of the three most powerful warriors in the Neptune army. The Minister of the Right claimed that the Straw Hats would be in trouble if they were confronted by the brothers. Further testament to his strength is when he, along with his brothers, took down the sea beasts that easily felled the rest of the Neptune Army, including the two ministers. The New Fish-Man Pirate Officers also had to take at least two Energy Steroids to defeat him and his brothers."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries two long rapiers, with katana-wrappings around their hilts and prominent handguards. Their plain sheaths are crossed behind his lower back. He has proven himself to be a master swordsman, dispatching a group of gigantic sea monsters enhanced by drugs in mere seconds, with the aid of his two brothers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Ryuboshi_With_His_Swords.png/revision/latest/scale-to-width-down/230?cb=20130408223901", "caption": "Ryuboshi weilding his two swords."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "As a child, Fukaboshi, Ryuboshi, and Manboshi would look after their sister, Shirahoshi, whenever their mother, Otohime, was away preaching to the kingdom's citizens."}, {"type": "paragraph", "text": "When Shirahoshi was six years old, a World Noble arrived on Fish-Man Island in a wrecked ship. Otohime quickly dashed off to where the ship was docked. The four children of the royal family soon followed her."}, {"type": "paragraph", "text": "When Otohime was threatened by Mjosgard, Shirahoshi cried and unknowingly called out Sea Kings. Mjosgard passed out from a big shock, and Ryuboshi and his brothers tried to calm Shirahoshi."}, {"type": "paragraph", "text": "Ryuboshi and his siblings seemed worried when Otohime decided to accompany the noble to the surface. For one week, they anxiously waited in the castle for her return. After Otohime returned safe and sound, she finally reached out to the citizens and collected their signatures. Ryuboshi, his siblings, and Neptune were overjoyed by Otohime's success."}, {"type": "paragraph", "text": "Otohime later explained to her sons about Shirahoshi's ability to call Sea Kings which is connected to a legend. She went on saying that Shirahoshi's ability could be dangerous since she could not control it yet. Otohime then asked the three brothers to become strong warriors and protect Shirahoshi."}, {"type": "paragraph", "text": "One day in Gyoncorde Plaza, the box containing all of the signatures suddenly caught fire. In the confusion, Otohime was shot. Ryuboshi and his brothers immediately came to their mother's side. The three brothers tearfully listened to their mother's last words, telling them not to be angry for her sake and to look after Shirahoshi. They then noticed that Shirahoshi was about to scream. Ryuboshi and Manboshi remembered what their mother said about what could happen if Shirahoshi calls Sea Kings again and how an emotional shock could trigger it. The two brothers then started singing and dancing in a desperate attempt to raise Shirahoshi's spirits and keep her from crying out, much to everyone's confusion and annoyance. As their mother passed away, Ryuboshi and his siblings touched pinky fingers with her for the last time."}, {"type": "paragraph", "text": "Before Otohime's funeral, the four children of the royal family told their father about the love letters that kept flying to Shirahoshi. Neptune told his children not to go out to the funeral since danger still lurked around. During Otohime's funeral, Ryuboshi and his siblings were seen on a visual broadcast as Fukaboshi gave his speech."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/07/Ryugu_Royal_Family.png/revision/latest/scale-to-width-down/230?cb=20120403020751", "caption": "Ryuboshi and his siblings after their mother returned home from preaching."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/42/Manboshi_and_Ryuboshi_Try_to_Cheer_Shirahoshi_Up.png/revision/latest/scale-to-width-down/210?cb=20130514045632", "caption": "Ryuboshi dancing and singing with Manboshi in spite of their mother's death."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Ryuboshi and his brothers searched for Monkey D. Luffy in Mermaid Cove supposedly because of Luffy's illegal entry. The mermaids hid the crew, but Sanji had a massive nosebleed and blew their cover. After Camie, Luffy, Usopp, Sanji, and Chopper escaped on the royal gondola that the three princes were riding on, Ryuboshi and Fukaboshi explained that they were looking for the Straw Hat Pirates for a reason other than their illegal entry. They had to give them a message from Jinbe."}, {"type": "paragraph", "text": "Later in Coral Hill, Ryuboshi and his brothers expressed concerned about Madam Shyarly's prediction."}, {"type": "paragraph", "text": "Outside the palace bubble, they were waiting to be let in, and Ryuboshi was shocked when he realized that the Straw Hat Pirates had caused some kind of incident in the palace. Sometime later, he and his brothers watched Hody's speech to Fish-Man Island, where he explained his plan to recreate the Ryugu Kingdom with himself as the ruler. Ryuboshi was shocked and worried when Hody showed the chained-up king."}, {"type": "paragraph", "text": "After Hody finished his speech, Ryuboshi and his brothers all rode on their gondola and headed for Gyoncorde Plaza to save their father, who was scheduled to be executed by Hody himself. While traveling, Ryuboshi wondered if Shirahoshi was safe."}, {"type": "paragraph", "text": "He soon arrived at Gyoncorde Plaza with his brothers and declared that the Neptune Army would not be defeated so easily. He then told Neptune to wait a little longer. As the three princes were fighting the Sea Beasts, Ryuboshi told Hody that if he won, Fish-Men would never be able to walk beside humans even if a century came and went. After defeating the sea beasts, Ryuboshi and his brothers then charged at Hody and the officers."}, {"type": "paragraph", "text": "Initially, the princes had the upper hand, but the officers turned the odds against them by taking Energy Steroids. The princes were then defeated and captured. After Shirahoshi, Megalo, and Jinbe were captured and brought to the plaza, Hody revealed to everyone that he was the one who truly killed Otohime. Ryuboshi was stunned at this revelation. Shirahoshi said that she already knew about it thanks to Megalo and she did not tell anyone because she was honoring her mother's last wish of holding no hatred for the killer. As Hody mocked Shirahoshi for allowing him to go free, he attacked the royal brothers and Neptune with Yabusame. Ryuboshi, along with his father and brothers, were then rescued by Hoe during the Straw Hats' unexpected arrival."}, {"type": "paragraph", "text": "Ryuboshi and his brothers later recovered when Noah (thrown by Decken towards Shirahoshi) arrived at Fish-Man Island. When Shirahoshi swam away from Fish-Man Island, Ryuboshi and his brothers went after her. Ryuboshi and Manboshi came to their sister's aid at the moment Decken threw some knives at her. After saving Shirahoshi from death, they tried to lead Shirahoshi to safety."}, {"type": "paragraph", "text": "Hody then went to Decken and stabbed him with his trident. Ryuboshi and Manboshi were confused since Hody and Decken were supposed to be allies. Hody then went after Shirahoshi and repelled both Ryuboshi and Manboshi. Luckily, Fukaboshi and Luffy arrived just in time to stop Hody. Hody later explained what would happen if Decken died while the ship Noah was directly above Fish-Man Island. Once Decken's power lost its effects, the ship would fall on the island. Understanding the situation, Ryuboshi told Shirahoshi to change her course to the side."}, {"type": "paragraph", "text": "Unfortunately, Decken fell unconscious and the ship started falling towards Fish-Man Island. Luffy later defeated Hody and the Sea Kings stopped Noah from falling."}, {"type": "paragraph", "text": "Now that the island was saved from destruction, Ryuboshi and his brothers then took the unconscious Hody and Decken to the plaza and put them in chains. While the officers and Vander Decken IX were imprisoned, the royal family and the Straw Hats had a feast at Ryugu Palace as a celebration. Later, when the New Fish-Man Pirates officers turned old due to the Energy Steroids, Ryuboshi went down to the dungeon with his father, brothers, Jinbe, and the ministers and saw that the imprisoned officers had become old men."}, {"type": "paragraph", "text": "Afterwards, Ryuboshi and the people of Fish-Man Island bid the Straw Hats farewell as they set sail for the New World. Ryuboshi and his brothers expressed their gratitude and promised their father that they would not forget the debt they owe to the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ab/Merman_Gujutsu_Infobox.png/revision/latest/scale-to-width-down/250?cb=20130429035206", "caption": "The brothers take down the sea beasts."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/10/Gyoncorde_Plaza_Execution.png/revision/latest/scale-to-width-down/210?cb=20120626062558", "caption": "Ryuboshi with his father and brothers, all chained up and on display for execution."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, the Neptune Family prepared to go to the surface. When Shirahoshi was too scared to leave, Ryuboshi asked Neptune if they could leave without her."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Neptune Family prepared to depart Fish-Man Island, they received the news of the events that occurred at Totto Land."}, {"type": "paragraph", "text": "The Neptune Family later arrived at the Red Port, and Monkey D. Garp escorted them to the bondola. As he and his family rode it to Mariejois, Ryuboshi was happy that Shirahoshi marveled at the sun and sky. Ryuboshi and his family later reached the top of the Red Line and arrived at the Mary Geoise castle. At the socializing plaza, Ryuboshi and Fukaboshi were worried about Shirahoshi's inability at proper communication. As Shirahoshi conversed with Vivi and Rebecca, Ryuboshi warned her about saying Luffy's name out loud."}, {"type": "paragraph", "text": "Ryuboshi and his brothers later witnessed Charlos' attempt to enslave Shirahoshi. After Mjosgard stopped Charlos, Ryuboshi stood beside his father as Mjosgard promised Neptune that he would protect Shirahoshi during the Levely."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, Ryuboshi returned to Fish-man Island with his family."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Ryuboshi, Manboshi, and Fukaboshi vs. New Fish-Man Pirates' Sea Beasts", "elements": []}, {"text": "Ryuboshi, Manboshi and Fukaboshi vs. New Fish-Man Pirates' Officers (unseen in the manga)", "elements": []}, {"text": "Ryuboshi and Manboshi vs. Hody Jones", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Ryuboshi and Manboshi vs. New Fish-Man Pirates", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name comes from ryūgū-no-tsukai (リュウグウノツカイ, ryūgū-no-tsukai), which is Japanese for \"oarfish.\"", "elements": []}]}], "images": []}]}