{"sections": [{"title": "Gally", "level": 1, "content": [{"type": "paragraph", "text": "Crescent-Moon Gally is the captain of the Gally Pirates, and the main antagonist of the very first version of Romance Dawn, which was later reimagined for Romance Dawn Story. He appeared briefly in the filler portions of the Loguetown Arc. In Chapter 902, he makes a cameo at the Baratie upon the conclusion of the Whole Cake Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gally is a middle aged pirate whose distinguishing aspect is his crescent moon shaped mustache. He wears a typical pirate captain's attire. Though of average height, he is slightly stocky in physique."}, {"type": "paragraph", "text": "In the filler portions of the Loguetown Arc, Gally is a tall lanky pirate with silver hair who wears a unique looking tricorne. The middle corner of the hat is curved downward in a way that it resembles the top half of a crescent moon when seen in conjunction with Gally's beard."}, {"type": "paragraph", "text": "In Romance Dawn Story, Gally has orange hair, a black crescent-shaped mustache, and also sports a crescent moon shaped beard. He wears a typical pirate captain's attire."}, {"type": "paragraph", "text": "In Whole Cake Island Arc, his anime color scheme is the same as his Loguetown appearance while his design now matches that of the manga."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Gally is rude and impatient, as he and his crew continuously demand the chefs of Baratie to bring food to them instead of waiting like any regular customer."}, {"type": "paragraph", "text": "In Romance Dawn Story, Gally is extremely cruel and prideful, since he was willing to kill Luffy, Silk, and everyone in the town for his own personal gain. He also swore revenge on Luffy for defeating him and said he will kill him someday."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Gally is fairly weak, since he and his entire crew were easily defeated by Smoker. In Romance Dawn Story, Gally is a crafty man who acknowledges the powers and weaknesses of Devil Fruit users, as he tactically lured Luffy into the ocean to swiftly defeat him. Otherwise, he is a typical pirate found scattered across East Blue, as his bounty is a mere 5,000,000, compared to Luffy's 300,000,000, and after getting Luffy regained his focus, he easily rent asunder Gally's ship and sent him flying."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wields a saber."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "Gally and his crew were raiding buildings at Loguetown right as Marine Captain Smoker was out looking for the pirate, Monkey D. Luffy. He proclaimed that the food supplies that he had looted would aid him in his path to become King of the Pirates. Unfortunately for him, he was easily captured by Smoker, who became disappointed that Gally was not Luffy. He was last seen beaten and tied up alongside his crew by Smoker."}], "images": []}, {"title": "Romance Dawn Story", "level": 3, "content": [{"type": "paragraph", "text": "Gally, who was tied up on his ship by Luffy, has threatened Silk's town and Luffy promises Silk that he will help her defeat him. After a short fight, Luffy makes short work of the Crescent-Moon Gally, while explaining to Silk about his abilities. After Gally runs off, Luffy remembers he left the Mini-Merry tied to Gally's ship. On his way back, the Mayor and various townspeople, mistake Luffy for Gally. They proceed to subdue him and tie him up. As he tries to explain himself, Gally interferes and attacks Silk. Gally, Silk and Luffy trade words about the meaning of treasure. Gally proceeds to throw Luffy's straw hat into the nearby ocean. Luffy stretches to get, with his head extending, but falls short and into the water. Silk dives in, rescues him, and curses Gally for sailing away. As they leave, Gally orders an attack on the island, destroying several buildings. Luffy slingshots himself towards Gally's ship, only to by shot out of the air by a cannonball."}, {"type": "paragraph", "text": "Falling towards the water, Luffy is saved by the Thousand Sunny and the other Straw Hats. Usopp, Sanji, Nami, and Zoro berate Luffy on his being lost, while a fight breaks out on Gally's ship. After some fighting, Gally is given a wanted poster of Luffy, comparing Luffy's 300,000,000 to his small 5,000,000. Luffy proceeds to wreck Gally's ship with his Gear 3rd, Gigant Axe (oddly he does not shrink afterwards like he usually does after using Gear Third). Luffy then grabs Gally and lands on a piece of his wreaked ship while his crew sail away with the Crescent Moon's provisions and treasure. Gally swears he will kill Luffy someday, who ignores him and hits him with his pistol move sending Gally flying into the distance."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/63/Straw_Hats_vs._Gally.png/revision/latest/scale-to-width-down/180?cb=20180729152859", "caption": "Gally's crew fighting the Straw Hat Pirates."}]}, {"title": "Whole Cake Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Gally and his crew went to the Baratie, where they impatiently demanded their food, much to the chagrin of the cooks there except for Zeff."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5a/Gally_Pirates_at_the_Baratie.png/revision/latest/scale-to-width-down/190?cb=20190324110619", "caption": "Gally and his crew at the Baratie."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Gally Pirates vs. Smoker (non-canon))", "elements": []}, {"text": "Gally Pirates vs. Monkey D. Luffy (non-canon)", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [], "images": []}, {"title": "Romance Dawn V.1", "level": 3, "content": [{"type": "paragraph", "text": "Luffy first spotted Gally's ship and decided to take it over so he would not have to sail in his dinghy. He defeated Gally's crew with ease and tied them up. The ship then landed at Silk's hometown and Gally and his men escaped and tried to take revenge on Luffy. Luffy frightened them when they learned he is a rubber man and they ran away afterwards. Luffy was then tied up by the townspeople, who thought he was Gally. Gally then took Luffy hostage and stole the town's treasure. He then enraged Luffy by smashing his hat, and got Luffy thrown into the ocean. Luffy was then saved by Silk and used Gomu Gomu no Axe to destroy Gally's ship. A livid Gally swore revenge."}, {"type": "paragraph", "text": "Gally was seen years later as a crew-member aboard Luffy's pirate ship, and told him that land had been spotted. It seemed that his encounter with Luffy changed him from a Morganeer pirate to a Peace Maine since Luffy said he wanted a crew made up of only Peace Maines, thus turning over a new leaf."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is sometimes translated as Crescent-Moon Gary. He was known as Gally the Crescent in the FUNimation dub.", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the original Romance Dawn one-shot, Gally is aiming to become one of the \"Best 3\" (ベスト, Besuto Surī). This term and concept of a group of famous individual pirate captains, appears to be a prototype for the Yonko that appears in the manga and anime proper. In the Romance Dawn Story OVA retelling, Gally's line about the \"Best 3\" has been dropped.", "elements": []}, {"text": "His Crescent Moon mustache is shared by Whitebeard in the final storyline.", "elements": []}, {"text": "A pirate that looks like Poppoko from the Alvida Pirates appears as one of Gally's crew members in the first version of Romance Dawn.", "elements": []}, {"text": "In the Romance Dawn story, Luffy was mistaken for Gally. In the anime, Gally is mistaken for Luffy.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Anime — Episode 48, Gally is defeated by Smoker.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 902, Gally appears on the Baratie.", "elements": []}, {"text": "↑  One Piece OVA — Romance Dawn Story, Gally is re-imagined for an anime special.", "elements": []}, {"text": "↑  One Piece Movie 9, Gally's wanted poster is shown alongside many others.", "elements": []}, {"text": "↑  One Piece Manga — Romance Dawn, Version 1, Gally is the main antagonist.", "elements": []}]}], "images": []}]}