{"sections": [{"title": "Very Good", "level": 1, "content": [{"type": "paragraph", "text": "Captain Very Good was one of the Marines who helped to attack the Straw Hats during the Buster Call at Enies Lobby. His name and the name of his fruit were revealed in Yellow Databook as well as in SBS Volume 47 of the manga."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Very Good is a large Marine with a black afro. He has the word 'Marine' tattooed across his chin and an x-shaped scar on the right side of his forehead. He wears the usual Marine clothes and he is relatively round in shape."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/db/Very_Good_Youth.png/revision/latest?cb=20121205221929", "caption": "Very Good in his youth as a marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Very Good has a strong sense of justice. It is unknown whether he believes in moral justice or absolute justice."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a marine officer, he has command over lower-ranking marines. Since he is a marine captain and a Devil Fruit user, it could be assumed that he is quite strong."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Very Good has the power of the Beri Beri no Mi, a Paramecia-class Devil Fruit that allows him to separate his body into several berry-shaped orb parts. It is shown that the ability is immune to blunt physical attacks such as punches."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "When a Buster Call attack was accidentally ordered on Enies Lobby by Spandam, Very Good joined the Marine forces sent to bombard the judiciary island. During the operation, Very Good, along with all of those of the rank Marine captains and above, were sent to attack the Straw Hats on the Bridge of Hesitation. Very Good faced off against Franky and was shattered by Franky's Strong Hammer. Despite their best efforts however, Very Good and his fellow Marines weren't able to stop the Straw Hats from escaping. Having an important World Government island completely destroyed without stopping even one of the invaders, Very Good and his fellow Marines suffered a humiliating defeat."}], "images": []}, {"title": "CP9's Independent Report", "level": 3, "content": [{"type": "paragraph", "text": "After some time passed since the incident in Enies Lobby, Very Good was seen leading a group of Marines and Government agents onto the homeland of CP9 in order to capture the failed government unit, CP9. His forces soon found the group. However, the force was utterly defeated and Very Good himself was left literally in pieces. After defeating him, CP9 abandoned him (though still split apart) in their homeland, and his current condition remains unknown."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Very Good vs. Franky", "elements": []}, {"text": "Very Good and Marines vs. CP9 members", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Very Good antagonized Franky much longer, pinning him down with his rapid-bouncing until Zoro batted the segments of Very Good's body into the distance, leaving Franky free to grab his head and blast him into the side of a battleship."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "His name is a pun on the Japanese pronunciation of \"very\" being the same as \"berry\" (for his Devil Fruit power)."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 44 Chapter 426 and Episode 309, Very Good makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 157), Very Good's birthday is given.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements, Very Good's and his fruit's names are revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 47, Fan Question: What are the names of the Devil Fruits the Marine Headquarters captains and commanders, that fought the Straw Hats in Volume 44, had?", "elements": []}, {"text": "↑  One Piece Manga — Vol. 44 Chapter 426.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 44 Chapter 429.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 53 Chapter 521, cover story: CP9's Independent Report Vol. 27, Very Good leads a group of Marines and Agents to capture CP9.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 53 Chapter 522, cover story: CP9's Independent Report Vol. 28, Very Good's forces encounter the CP9.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 54 Chapter 528, cover story: CP9's Independent Report Vol. 33, Pieces of Very Good remain on island.", "elements": []}]}], "images": []}]}