{"sections": [{"title": "Shyarly", "level": 1, "content": [{"type": "paragraph", "text": "Madam Shyarly is a shortfin mako shark mermaid living on Fish-Man Island. She is the proprietor of the Mermaid Cafe and Arlong's younger half-sister. She used to be a fortune teller until she decided to discard her crystal ball."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Madam Shyarly is a large mermaid with purple nail polish, red lipstick, and blue eyes with slanted pupils that resemble shark eyes. When angry, her eyes take on an ominous appearance and she shows sharp teeth. She has short black hair that covers over the right side of her face. Her tail is dark blue with a dorsal fin on her lower back where her human and fish halves meet, a white patch below the dorsal fin, smaller fins on the lower front and back, and a lunate caudal fin."}, {"type": "paragraph", "text": "She wears a hooded purple blouse that is only buttoned in the middle, revealing her cleavage and stomach and has a belly-chain around her waist. She is often seen smoking a pipe."}, {"type": "paragraph", "text": "As a child, she wore a light-colored hooded dress with a stripe down the side. However, the anime showed that her dress is the same color as her current outfit."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Madam Shyarly is a very kind woman, as she lent the Straw Hat Pirates a room in which they could take care of Sanji, even though said crew defeated her brother. She also gave Camie the rest of the day off so that she could spend time with her friends. She apparently does not like rudeness or vulgarity as she became very angry when Luffy asked if mermaids poop. However, her anger seems to be shortlived, as she calmed down and returned to her normal self almost instantly after Luffy apologized."}, {"type": "paragraph", "text": "Even though she is a fortune teller, Madam Shyarly regards her gift as a burden, since most of her visions are of bad things. As a consequence, she thinks that the future is better left unknown. However, even though she said that she quit fortune telling, she was still curious enough to look into Luffy's future. When she had a vision of a man in a straw hat who will be responsible for the destruction of Fish-Man Island, she went into a state of panic screaming that Luffy should be banished from Fish-Man Island, which showed how terrified she was. However, this changed when the New Fish-Man Pirates started taking over the island and Shyarly calmly told their captain, Hody Jones, that Monkey D. Luffy will be the one to destroy Fish-Man Island and not Hody himself, showing that she is willing to believe her own fortune telling over any other apparent predicaments. After the civil war ended, she destroyed her crystal ball, claiming that she will never look into the future again and that she would be very happy if her last prediction did not become true."}, {"type": "paragraph", "text": "Unlike her brother, Arlong, Shyarly is not prejudiced against all humans as she even encouraged the Fish-Man Island children to see with their own eyes instead of just listening to the opinions of others."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1c/Angry_Shyarly.png/revision/latest/scale-to-width-down/230?cb=20130821090904", "caption": "Shyarly angered by Luffy's vulgarity."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the proprietor of the Mermaid Cafe, she has complete control of the restaurant."}, {"type": "paragraph", "text": "Being a mermaid, she has several abilities unique to her race. It is not yet shown but she may have the ability to talk to fish and call out to them using sonar waves, which is one of basic ability found in all mermaids. Apart from the ability to breathe underwater, as a mermaid she also has the ability to swim very quickly at speeds much faster than the flying fish used by the Flying Fish Riders. However, like any mermaid, she is vulnerable on land."}], "images": []}, {"title": "Scrying", "level": 3, "content": [{"type": "paragraph", "text": "As a fortune teller, she has the ability to see the future. She uses a crystal ball as a medium to look into the future. Since it was seen on a giant clam, it is unknown if it is an actual crystal ball or a giant pearl used as one. The one drawback to her power is that she cannot predict the exact time period when her predictions will happen, but only that they will happen."}, {"type": "paragraph", "text": "She is also very accurate in her predictions as she predicted the dawning of the Great Age of Pirates, as well as the outcome of the Battle of Marineford and Whitebeard's death. She recently made a prediction that a man in a straw hat, who she presumes to be Luffy, will destroy Fish-Man Island. However, Luffy left Fish-Man Island without destroying it so that prediction has not come to pass. But since events that Shyarly foresaw can happen anytime from a day to a year later, there is still a possibility that Shyarly's prediction is not wrong yet. By breaking her own crystal ball, Shyarly has given up on her scrying abilities."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "In her younger years, she was abandoned by her father and left with a 15 year old Arlong in the Fish-Man District. At the age of four she made a prediction about the coming of the Great Age of Pirates and many pirates indeed came to the island one year later. At some point, she listened to Hatchan's story about Silvers Rayleigh. Before the Whitebeard War, Shyarly predicted Whitebeard's death and he indeed met his end."}], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [], "images": []}, {"title": "The Straw Hats and a Grave Prediction", "level": 4, "content": [{"type": "paragraph", "text": "She is first seen when the Straw Hat Pirates are in the back of the Mermaid Cafe, taking care of Sanji. She was the one who allowed them to use the back room. She asked Camie about Sanji's recovery status. After Camie's report, Camie asked her not to go back and check on Sanji, as her beauty could be harmful to him, and to not let him know they are in the back of the Mermaid Cafe for the same reason."}, {"type": "paragraph", "text": "When Luffy and Usopp found her crystal ball, Shyarly told them not to touch it. She went on to say that she had quit fortune telling, as the future was best left unknown. When Luffy asked if mermaids pooped, Shyarly became furious at him, but was immediately quelled when Luffy apologized at the urging of Camie. She then said that Camie could take the rest of the day off, saying the cafe had enough staff so that it would not be a problem. After Camie remembered she had to bring a clam to Pappag, Shyarly told her that he was in the cafe, making quite a ruckus with an old friend of his."}, {"type": "paragraph", "text": "Later, she is seen shouting in the streets of Coral Hill about an impending doom. She had looked into the future after she felt something about Luffy. She goes on to say that Luffy must leave, as she saw a man wearing a straw hat destroying Fish-Man Island in her prediction. The three princes of the Neptune Family soon come to visit her. Having calmed down, Shyarly tells Prince Fukaboshi about her prediction."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Shyarly_Predicts_the_Destruction_of_Fish-Man_Island.png/revision/latest/scale-to-width-down/230?cb=20150309003344", "caption": "Shyarly envisions the destruction of Fish-Man Island by a man with a straw hat."}]}, {"title": "The Battle for Fish-Man Island", "level": 4, "content": [{"type": "paragraph", "text": "Shyarly appears again after the New Fish-Man Pirates defeated and captured the three princes and placed them beside Neptune in Gyoncorde Plaza. Shyarly interrupts Hody Jones as all of his subordinates assemble in the plaza. She calmly and boldly tells him that he will not be the one destroying Fish-Man Island, and the one to destroy the island would be Straw Hat Luffy, implying to Hody that all of his efforts would be pointless. Out of anger, Hody strikes her with a water shot and knocks her to the ground. He then exclaims that he is not like her brother, Arlong. He says that the name Arlong Pirates is nothing more than an empty symbol to unite under and that the New Fish-Man Pirates have obtained power. Shyarly gets assisted by a nearby mermaid."}, {"type": "paragraph", "text": "Later, while being helped by a doctor, she is approached by some children who ask her when Luffy is supposed to destroy the island. She tells them that she does not know since she cannot tell exact dates from her predictions and tells them it could be anytime between a day or a year from then. Much to everyone's surprise, the Straw Hat Pirates arrived, saved Neptune and the princes, and started fighting the New Fish-Man Pirates. She was then seen looking up into the sky as Luffy and Hody took the battle outside Fish-Man Island."}, {"type": "paragraph", "text": "While Luffy attempts to stop Noah from falling down upon Fish-Man Island, the rest of the New Fish-Man Pirates and the Straw Hats continue fighting, with Hody's crew attempting to martyr themselves in the name of spreading their grudge. Shyarly convinces a group of children to judge based upon only what they see (forming their own opinions), rather than what they hear, upon the nature of humans."}, {"type": "paragraph", "text": "After the Straw Hats defeat all the leaders of the New Fish-Man Pirates, Shyarly and the other citizens look up into the sky as Luffy tries to destroy Noah. When the Sea Kings appear and stop Noah from falling, saving the ship and the island at the same time, everyone on Fish-Man Island celebrates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Shyarly_Shot.png/revision/latest/scale-to-width-down/245?cb=20140802084839", "caption": "Shyarly gets struck down by Hody."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2c/Shyarly_Telling_Young_Fish-Men_to_Make_Their_Own_Decisions.png/revision/latest/scale-to-width-down/210?cb=20130907201614", "caption": "Shyarly telling the children to make their own opinions, instead of listening to others'."}]}, {"title": "The Departure of the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "The Mermaids working at the Mermaid Cafe tells Shyarly that the Straw Hats are leaving the island. Shyarly tells them to bid the Straw Hats farewell and the mermaids happily obliged. Now that her usual customers will return, Shyarly asks her employees to do their best. Camie then notices Shyarly's broken crystal ball. Shyarly reveals to Camie that she did not want to predict the future again and that she would be happy if her prediction about Luffy would be wrong. She then asks for forgiveness from Camie for suspecting her friends and asks if she can trust them. She is then responded with a yes."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "While the manga shows the silhouette of a man in a straw hat in Shyarly's vision of the future concerning Fish-Man Island's destruction, it does not show Luffy's image. This led some fans to speculate that Luffy might not be the one who actually would destroy the island. In the anime, the clear image of Luffy is seen in her vision."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Madam Shyarly's name was first thought out to be Shirley, but this has been changed. In Chapter 610, the romanization Shyarly can be fully seen on her house in the background, but this was initially not noticed. It is shown more clearly in Episode 529."}, {"type": "paragraph", "text": "In the Viz Manga and FUNimation subs, her name is translated as Sharley."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Shirley_to_Shyarley.png/revision/latest/scale-to-width-down/200?cb=20130907204641", "caption": "\"Shyarly's\" name in the anime."}]}, {"title": "Errors and Corrections", "level": 2, "content": [{"type": "paragraph", "text": "Shyarly was originally depicted as a young woman during the flashback of Hody's childhood, which suggested that she was older than him. However, Hody and Shyarly's present ages are 30 and 29 respectively. This was retconned in Volume 65's release of the chapter, where she was depicted as a prepubescent girl in the flashback."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "As noted, the events of the Fish-Man Island Arc draw many elements from \"The Little Mermaid\", Shyarly can be considered a parallel with the sea witch in the storyline, whose magic had been responsible for the events within the storyline just as it is Shyarly's prediction that is responsible for elements of the events of the arc. In some cultures, fortune telling is seen as a part of witchcraft and black magic.", "elements": []}, {"text": "Shyarly's prophetic ability also has a precedent in Japanese folklore. The Amabie is a mermaid who could prophesize both good and bad fortune, though it seems that she thinks that she is capable of foretelling only bad events.", "elements": []}, {"text": "While \"madam\" is a polite way to address a woman in English meaning \"Ms.\" or \"Mrs.\", it also can refer to the female owner of a brothel. While Mermaid Cafe is never declared a brothel nor her female staff members ever called \"prostitutes\", the cafe mimics certain aspects of the brothel style; set up within, young and attractive women bring men to the establishment for their charm and beauty like a hostess club. It can also be noted that in English, Madam(e) is a common title of the stereotypical fortune teller.", "elements": []}, {"text": "Her birthday is on September 9, which is known as \"Fortune-telling Day\" in Japan (占いの日 Uranai no Hi). Coincidentally, she shares the same birthday as Basil Hawkins, who is also capable of fortune telling.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Shortfin mako shark – Wikipedia article on what mermaid Shyarly is.", "elements": []}]}], "images": []}]}