{"sections": [{"title": "Neptune", "level": 1, "content": [{"type": "paragraph", "text": "King Neptune is a coelacanth merman and the king of the Ryugu Kingdom on Fish-Man Island. He is the father of Fukaboshi, Ryuboshi, Manboshi, and Shirahoshi, and the husband of the late Queen Otohime."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Neptune is a giant-sized and muscular coelacanth merman. He has a red nose, small eyes, and long thick orange (despite his age of seventy)curly hair and beard. Both his chest and arms are covered with hair. He is bare-chested and has matching black tattoos on both arms, which looks like a spiral with wavy protrusion designs around it."}, {"type": "paragraph", "text": "He wears a gold crown that resembles a tulip with jewels embedded, a golden bracelet on each wrist, and carries a gold trident with an elaborate design."}, {"type": "paragraph", "text": "At Otohime's funeral, he wore a large suit. When he and his family arrived at the Red Port for the Levely, he wore a dark-colored coat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Neptune seems to be very blunt, as he simply invited the \"Straw Hat humans\" to the Ryugu Palace, instead of being more cordial. He also tends to shout his words out for no reason, including a habit of shouting his own name at random times, being followed by his whale shouting \"Hoe\". Neptune sometimes mispronounces people's names, as he refers to Zoro as \"Zori\". He appears to be easy-going, absent minded, and carefree as he was scolded by his ministers for leaving the castle on a whim on more than one occasion. He has a tendency to finish most of his his sentences with the word \"jamon\"."}, {"type": "paragraph", "text": "However, he can be serious when the situation demands it, as he intended to capture the Straw Hat Pirates when they were wrongly accused of kidnapping mermaids, though Neptune did not think it was fair to arrest them based on a prediction made by Madam Shyarly, and merely wanted to capture the crew rather than arrest them for a precaution. In addition to being fair, while in his youth he would kill others for revenge, in the present he has shown to be very merciful, as he allowed the human slaves of the New Fish-Man Pirates to leave and let the lower Fish-Man subordinates to do penal work under the watch of the army."}, {"type": "paragraph", "text": "He dotes on his only daughter Shirahoshi, and worries about her immensely. He provided several extreme but necessary security measures to protect her from Vander Decken IX, and even attempted to beg the Straw Hats to rush to her aid when he thought that his daughter is in danger. Neptune apparently acknowledges the value of sacrifice, as he decided that he would rather risk his daughter's safety in the hands of strangers than in Decken's captivity. He gets quite upset when he hears that Shirahoshi is upset and gets very emotional when she is in danger as shown when he burst into tears when Shirahoshi was supposedly kidnapped and when Decken went after her."}, {"type": "paragraph", "text": "Neptune is also partially perceptive as he correctly guessed that Luffy snuck Shirahoshi out of Hard-Shell Tower by stuffing her inside Megalo, even though everyone else thought this was a bizarre idea. However, he can jump to conclusions when he stopped suspecting Luffy only after Vander Decken IX appeared in the palace and quickly accused Decken of kidnapping Shirahoshi."}, {"type": "paragraph", "text": "He stated when his wife died, that even if the person who killed his wife was unarmed he would have torn them apart. However, moments later he noted Otohime would not approve of a revenge attack and though he would only have listened to those words because it came from her, he still could not understand why he could not bring himself to tear that person apart. He did not understand how the events led to the people of Fish-Man Island and humans hating each other. He however, wanted to end the cycle of hate between humans, he noted due to his past as a soldier he could not be a candidate for causing such a thing as he would only cause the opposite of his intentions to happen. He understood how the circle continued though, that children who witness darkness only continue the dark path that has caused their problems, but time could heal those scars and pain."}, {"type": "paragraph", "text": "Neptune is well aware of the Void Century and poneglyphs, as well as the dangerous potential they pose to the world. Despite doting on his daughter, he knew she is the incarnation of the deadly ancient weapon, Poseidon, and fears of her power having fully awakened. He was also shocked and seemingly slightly frightened that Nico Robin is able to read about Joy Boy in the Sea Forest's poneglyph, but trusted her enough to tell her about the history in detail when she asked."}, {"type": "paragraph", "text": "Like many other characters in the series, he appears to have a unique laugh: Hoh hoh hoh hoh."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Neptune appears to be very protective of his family, as he had his sons form an army solely to track down Vander Decken IX so that the pirate would stop harassing his daughter. He also has a beloved whale named Hoe. While Otohime was alive, Neptune supported her actions in promoting peace. Even ten years after her death, Neptune said he still loved Otohime and still considers himself married to her."}, {"type": "paragraph", "text": "When he was tied up after his failed attempt to capture the Straw Hats, Neptune begged the pirates to ensure Shirahoshi's safety when he suspected that she might be in danger, showing great concern for his daughter, and warned the crew that if anything happened to Shirahoshi, he would hunt them down to the ends of the sea. Neptune considers Shirahoshi to be very precious to him. After Decken went after her, he begs the Straw Hats to stop Decken, going as far as to offer the crew anything. Neptune was even surprised his daughter knew who killed her mother and never told anyone, but he was proud she honored her mother's wish to not hate the one responsible. When Charlos attempted to enslave Shirahoshi, Neptune nearly gave up on Otohime's dream as he prepared to attack the World Noble and CP-0 until the noble that his wife saved protected her."}], "images": []}, {"title": "Ryugu Kingdom", "level": 3, "content": [{"type": "paragraph", "text": "The Ministers of the Left and Right tend to yell at Neptune for his lack of responsibility as the king of Ryugu Kingdom, and he does not seem to have any resentment to that."}, {"type": "paragraph", "text": "As he is with his family, he also cares deeply about his subjects, going so far as to block an attack made by Hody Jones against his soldiers while they were tied up, despite being wounded as a result. Ironically, Neptune said earlier that he was willing to trade his soldiers' lives for Shirahoshi's safety. His affection is reciprocated by the civilians, who were even willing to see their kingdom destroyed (by Luffy in Shyarly's prediction) than allow Neptune to die in front of them."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Edward Newgate", "level": 4, "content": [{"type": "paragraph", "text": "He was a personal friend of the Yonko, Whitebeard, as first shown when the Minister of the Left referred to him as Neptune's friend. Their friendship was the reason why the Yonko protected the island. Though it is unknown how they became friends, but it is known that they had been friends for quite a long time as Neptune was said to have helped Whitebeard out a lot during his younger days; the two even shared a drink in the past."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "He respected the Straw Hats for saving his daughter's pet, Megalo, and invited them to a banquet as gratitude. However, Shyarly's prediction caused a conflict between him and the pirates. Neptune and his guards attempted to capture the pirates for the island's safety. The Straw Hats, in turn, resisted and ended up capturing Ryugu Palace instead, causing even more mistrust between them. They quickly put aside their differences after Hody Jones started his coup d'état. After the Straw Hats saved Neptune, his family, and his kingdom from Hody, he has come to befriend them and cleared them of all crimes. He even allowed them to have all the treasures that were in the treasure room due to being indebted to them. Neptune remarked that he wishes to borrow their flag for the safety of Fish-Man Island in case it loses Big Mom's protection."}, {"type": "paragraph", "text": "Neptune had felt contrite for not notifying the Straw Hats that the Tamatebako contained a bomb and had hoped that the bomb would not detonate if Big Mom should open the chest. Ironically, this had helped the Straw Hats greatly when they were cornered by the Big Mom Pirates, allowing them to escape from the Whole Cake Chateau."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Neptune is a close friend of Jinbe as he's known him since when he was part of his army. Neptune was grateful towards Jinbe for joining the Shichibukai in an effort to support Otohime's quest for peace with humans. Even though Jinbe forfeited his title, Neptune still respects him and allows him to visit the island anytime he wishes. Neptune even encouraged Jinbe to consider joining Luffy's crew."}], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "Neptune and Garp became acquaintances as Garp escorted the Neptune Family to the Levely. Due to Garp being Luffy's grandfather, Neptune and Garp are able to get along."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Vander Decken IX", "level": 4, "content": [{"type": "paragraph", "text": "Since Vander Decken IX kept harassing Shirahoshi with threatening marriage proposals, he has earned Neptune's wrath. Neptune had his sons form an army against the pirate. After Shirahoshi was believed to be kidnapped from the palace, Neptune quickly threw accusations at Decken after seeing him enter the palace just because he was after his daughter for ten years."}, {"type": "paragraph", "text": "After Decken and Hody were defeated, Neptune wasted no time in imprisoning the pirate, which released his daughter from being pursued by him any further."}], "images": []}, {"title": "Hody Jones", "level": 4, "content": [{"type": "paragraph", "text": "Neptune's other main enemy is Hody Jones, a Fish-Man who strongly believes in vengeance against humanity. Hody believes that Neptune is unfit to rule Fish-Man Island because he (from Hody's perspective) lacks pride. Wanting to create a world where humankind is completely enslaved, Hody intended to overthrow him, going as far as to join Neptune's army only to gain battle experience, and then discarding his allegiance and disloyally launching a coup d'etat. Neptune berated Hody for overdosing on Energy Steroids, expressed disdain about his selfishness as the new king, and ultimately turned to a violent hatred after the former soldier revealed that he was the one who killed Otohime ten years ago. It appears that after Shirahoshi explained why she never told everyone the truth even though she knew about it, Neptune let go of that hatred and decided to just imprison Hody after his defeat rather than have him executed for his crimes."}, {"type": "paragraph", "text": "After seeing Hody turn into an old man due to the side effects of the Energy Steroids, Neptune took pity on him when seeing that he can no longer hurt anyone and decided to possibly change his penal sentence."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the king, he has royal authority over the entire Ryugu Kingdom. His lone presence outside the palace is enough to cause a panic."}, {"type": "paragraph", "text": "He seems to have an uncommon ability for a merman as he is able to communicate with whales; normally, they can only do so with regular fish. He uses that ability to call his pet whale, Hoe, when he needs him."}, {"type": "paragraph", "text": "He has a strong sense of danger. In the anime, he could quickly understand Zoro's strength and refrained his men from taking Zoro head on. He immediately took caution right after the New Fish-Man Pirates took Energy Steroids. He's also fully aware of the existence of Haki as he commented on Otohime's Kenbunshoku Haki skills."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a former veteran soldier himself, Neptune is an extremely powerful warrior, being respected as the \"Great Knight of the Sea\". Even Brook and many Fish-Men acknowledged his strength. However, his strength have declined due to his old age, as he ended up straining his back due to excessive exertion which gave Zoro the upper hand. Neptune's sprained back also rendered him defenseless against the New Fish-Man Pirates when the pain incapacitated him after using one of his more powerful attacks. Neptune has massive strength befitting his size. He could carry around and wield a gigantic trident. It also required that the Strawhat to use metal chains instead of rope to restrain him.He has vast durability as he withstood a relentless Yabusame attack from Hody to defend his helpless men. Later at the Gyoncorde Plaza, he could survive brutal assaults of Uchimizu and Yabusame from Hody, who had gained a monstrous enhancement of physical strength via overdosing on Energy Steroids."}], "images": []}, {"title": "Merman Combat", "level": 3, "content": [{"type": "paragraph", "text": "He is shown using a technique called \"Merman Combat\". With it, he is capable of manipulating water, grabbing it with his hands as if it were something solid and launching water-based projectile attacks."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries around a gigantic trident fitting his size, and is presumably proficient in using it, as Brook and many Fish-Men acknowledged his strength. Zoro, however, seemingly stopped one of his attacks with ease, and soon after managed to subdue Neptune and lock him in chains without receiving any visible injuries, although, according to Neptune, he was taken by surprise."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early life", "level": 4, "content": [{"type": "paragraph", "text": "In his early years, Neptune was a soldier who avenged the life of his fallen comrades and in the process killed and took prisoner many humans. At some point, Neptune became a close friend of Whitebeard when they both were in their prime."}], "images": []}, {"title": "The Time of Otohime and Fisher Tiger", "level": 4, "content": [{"type": "paragraph", "text": "While his wife, Otohime, was alive and preaching to the people of Fish-Man Island to unite with humans, Neptune told the Minister of the Left that he would not stop her from doing what she must and ordered the minister to protect her anyway he can."}, {"type": "paragraph", "text": "When Fisher Tiger had a meeting with Neptune and Otohime after what seemed to be an adventure, Neptune asked Tiger about what he saw during his adventures. Tiger answered with one word, \"humans\". After news of Fisher Tiger's rampage in Mary Geoise reached the palace, Otohime told Neptune about the voice she heard from his heart, a voice raising a battle cry."}, {"type": "paragraph", "text": "After Fisher Tiger's death, Neptune received a letter from Jinbe that explained the true story. Neptune comments that Tiger had lived the only way he could. Otohime tells him that she understood what his heart was saying the last time he visited the palace. Later, Jinbe visited the palace and spoke with Neptune about his invitation to join the Shichibukai. Jinbe told Neptune that accepting the position would help strengthen the bond between species and in some way, support Otohime's cause. Neptune agreed, saying it would cheer her up."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/41/Fisher_Tiger_Talks_to_Neptune_and_Otohime.png/revision/latest/scale-to-width-down/230?cb=20120401081100", "caption": "Tiger's meeting with the royal family."}]}, {"title": "The Hope of Fish-Man Island", "level": 4, "content": [{"type": "paragraph", "text": "One day, an uproar occurred on Fish-Man Island when a World Noble named Mjosgard arrived on the island in a wrecked ship. The noble was spared from the Fish-Men's wrath and his wounds were treated. When Otohime wanted to travel to the surface with Mjosgard, Neptune objected, saying he would go in her place. Otohime told him that a weak person like her has to go with the noble in order to prove that the surface is safe for everyone. He let her go and waited for one week, trying to keep his children's spirits up."}, {"type": "paragraph", "text": "Otohime returned safe and sound and she finally reached out to the citizens of Fish-Man Island and collected their signatures. Neptune and his children were overjoyed with her success. However, that excitement was short-lived as Otohime was later assassinated in broad daylight by Hody Jones."}, {"type": "paragraph", "text": "Hody got away with the crime by placing the blame on a human pirate, leaving everyone on Fish-Man Island to believe that the human was the culprit. Neptune, feeling rage towards the human, locked himself in Hard-Shell Tower to keep his anger under control. As the Minister of the Left stood outside the tower, Neptune grieved over his wife's death. He was torn between love and duty. As a king, he wanted to honor Otohime's ambition and make peace with the humans. But as a husband, he wanted to tear apart the person who killed his wife."}, {"type": "paragraph", "text": "Before Otohime's funeral, Neptune's children told him about the letters that kept flying to Shirahoshi. Neptune read one of the letters, which was a marriage proposal by Vander Decken IX. Neptune told his children not to go out to the funeral since threats still lurk around. Neptune attends Otohime's funeral in the Sea Forest and watched Fukaboshi's speech through a visual broadcast."}, {"type": "paragraph", "text": "When Vander Decken IX started threatening Shirahoshi's life, Neptune became so enraged that he had his three sons form an army to capture him."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Shirahoshi's pet shark, Megalo, went missing (having been captured by the Kraken), Shirahoshi kept crying and crying and Neptune did not know what to do. Eventually, the shark returned to the palace."}, {"type": "paragraph", "text": "When Megalo told him about being freed by the Straw Hat Pirates, he looked forward to meeting them. When he learned that Straw Hat Luffy was in Pappag's mansion, he personally traveled there to meet him. After making contact with Luffy, King Neptune invited him and his crew to his palace."}, {"type": "paragraph", "text": "The Straw Hats, Camie, and Pappag rode on Megalo while Neptune rode on Hoe as he called to them not to fall off. Neptune explained that Megalo is his daughter's beloved pet. She could not stop crying over how Megalo had not come home that Neptune did not know what to do with her. He thought about how dangerous fighting the Kraken must have been and thanked them for their great work. Luffy told him that it was just a coincidence but he was glad to help. Neptune told them that he had sent his sons out to get them, but when they did not come back, he went out himself."}, {"type": "paragraph", "text": "He said that he was excited for the banquet's menu and wanted to start as soon as possible. He then remembered that one of the Straw Hats was already at the palace. He had already started drinking and would not listen when Neptune suggested it would be more fun for everyone to drink together. King Neptune said that he thought his name was Zori, and got corrected with the right name. Neptune went on to tell them that his soldiers would find all of the other Straw Hats and bring them to the castle."}, {"type": "paragraph", "text": "Nami then asked Neptune a question about why Fish-Man Island was so bright despite being 10,000 meters below the surface. Neptune told her that Fish-Man Island came to be when Fish-Men began living on the sea floor where there was light. He explained that the roots from a tree called Sunlight Tree Eve reach down to the sea floor and transfer light to Fish-Man Island."}, {"type": "paragraph", "text": "They approached the entrance of the palace. Neptune rang a doorbell, saying it was him, and a stammering voice said that they would open the gate at once. Once they were in the corridor beyond the gate, Neptune said \"let's go\", in excitement, shouting his own name as a battle cry. Luffy said that it looked like a cool palace with a lot of stuff. Neptune answered him bluntly saying of course it would as it is his castle. He then told everyone to enjoy themselves."}, {"type": "paragraph", "text": "Once inside the castle, two men instantly started berating Neptune for going out on his own. He told them he would be sure to be more careful in the future. Everyone but Luffy watched this scene, realizing the king was getting yelled at and told off like a child. Neptune told the men that he brought the people who saved Megalo from the Kraken. He also asked where his daughter, Princess Shirahoshi, was. The men told him that \"it\" happened again just a moment ago. Neptune got angry, telling the men they did not set her up with the proper guarding to keep her from getting upset. One of the men retorted that the king disappearing during such a critical time would get the whole castle upset. He then lowered his head, apologizing and promising to take better care next time. The Straw Hats realized he was getting yelled at again. The two men who were berating the king are the Minister of the Right, a seahorse merman, and the Minister of the Left, a catfish merman. The Minister of the Right apologized for berating the king in front of his guests, but they had something important to discuss with him. The Minister of the Left told them they received a message from Fukaboshi."}, {"type": "paragraph", "text": "After receiving word of the mysterious disappearances of the mermaids from Mermaid Cove and of Madam Shyarly's ominous prediction, the palace guards and personnel took action against the Straw Hats. After some of the guards were overwhelmed by Nami, Usopp, and Brook, The Minister of the Left begged Neptune to use his power against the pirates. Neptune did not wish to go against them just because of a prediction. He attempted to subdue the pirates, attacking with his large trident. Zoro intercepted him, blocking his attack with ease."}, {"type": "paragraph", "text": "He was next seen chained up along with his ministers and the castle guards. He commented on how he had not been able to fight all that well after straining his back. He admitted that he had gotten old and apologized for being unprepared. Neptune's sons returned, but they were stuck outside since the only way in the caste is the palace entrance. Zoro then spoke with Fukaboshi through Den Den Mushi while making some demands. Neptune informed Fukaboshi that he was speaking to the pirate who was worth 120,000,000. After Fukaboshi revealed Jinbe's message for Luffy and left to find the rest of the Straw Hats on Zoro's request, Neptune heard sounds coming from Shirahoshi's tower."}, {"type": "paragraph", "text": "He realized his daughter was in danger and asked if there were guards posted by her room. He was then told that they were all tied up with him. He then ordered the Straw Hat Pirates to go and make sure Shirahoshi was safe. When the guards protested, Neptune told them that dire situations call for sacrifices. He then angrily told the Straw Hats to go to the northeast part of the palace where the tower is located. When Zoro asked why they should take orders from a hostage, Neptune became even more angry, telling them that if anything happened to his daughter while he was incapacitated, he would chase the pirates to the ends of the ocean."}, {"type": "paragraph", "text": "Brook and the Minister of the Right then went straight to Shirahoshi's room and found her missing, having already left with Luffy and Megalo. When they informed Neptune about this, the king looked stunned. He then started crying out and demanded that the Straw Hats return Shirahoshi. Usopp yelled back saying that they did not kidnap the princess. Brook pointed out that he only saw Luffy and Megalo left Shirahoshi's room. Neptune correctly guessed that Shirahoshi had been stuffed into Megalo, even though everyone else thought his idea was preposterous. The palace guards laughed at this statement saying that it is way too bizarre."}, {"type": "paragraph", "text": "When Hody Jones and Vander Decken IX arrived at the palace, King Neptune quickly accused Decken of kidnapping the princess. This made Decken realized that Shirahoshi had left the palace and he quickly went after her. Neptune then tearfully begged the Straw Hats to stop Decken, going as far as to offer them anything. Hody Jones then crushed a palace wall, flooding the palace in the process. Jones then launched his Archer Shark attack. Neptune protected some of his soldiers by taking some of the hits. Zoro then cut his chains, saying that their deal with the hostages was void since they got hurt. Before everyone was completely submerged under water, Usopp and Brook untied the palace guards and Zoro told Neptune to take his crew mates to safety."}, {"type": "paragraph", "text": "Neptune then told his guards to allow Hody Jones to take the palace. Neptune said that they needed to regroup with Fukaboshi, so they could prepare for another battle with the New Fish-Man Pirates. After Zoro staggered Hody with one slash, Neptune took Zoro, Usopp, and Brook and prepared an escape route. Neptune created a vortex and cleared a path. The ministers and the palace guards escaped. However, Neptune's back gave in putting him, Zoro, Usopp, and Brook in a dangerous situation. Hoe arrived to save them, but Hody, energized by an Energy Steroid, stopped Neptune with one hand. Neptune and the three Straw Hats with him were then captured by the New Fish-Man Pirates."}, {"type": "paragraph", "text": "Neptune was later seen chained once again as Hody Jones gave a speech to the Fish-Man Island citizens through a visual broadcast, explaining about his plan to create a kingdom with himself as the ruler. Hody also announced that he was planning to execute Neptune at Gyoncorde Plaza in three hours time."}, {"type": "paragraph", "text": "As Hody took the king to Gyoncorde Plaza while riding on top of Sea Beasts, the Fish-Man Island citizens cried out to Neptune, but the king, helpless as he is, could not do a thing. When Hody suddenly suffered from an overdose of Energy Steroids, Neptune pointed out the consequences for relying on the drug too much."}, {"type": "paragraph", "text": "He was then seen tied up at the execution site in Gyoncorde Plaza, saddened that all his soldiers there were defeated. When his sons arrived to save him, he warned them to be careful, saying all the pirates took Energy Steroids."}, {"type": "paragraph", "text": "The princes defeated the sea beasts and fought valiantly against the officers. Unfortunately, the officers turned the tables against them by taking Energy Steroids. The princes were then defeated and chained next to the king. Fukaboshi apologized for losing, but Neptune assured him that the New Fish-Man Pirates' strengths were lies. After Jinbe, Shirahoshi, and Megalo were captured and brought to the plaza, Hody assembled all of his subordinates. Hody was interrupted by Madam Shyarly, who told Hody that Straw Hat Luffy would be the one to destroy Fish-Man Island and not Hody himself."}, {"type": "paragraph", "text": "After striking Shyarly out of anger and bragging about his power, Hody revealed to everyone that he was the one who truly assassinated Otohime. Neptune, his sons, Jinbe, the citizens, and the lower-rank subordinates were all stunned by this revelation. When Hody explained that the human pirate was a scapegoat, Neptune was furious, but Hody responded by injuring him with a Water Shot to the chest. Hody then started gloating about killing Otohime right in Shirahoshi's face, but the princess said that she knew all along, which deeply shocked Neptune and Jinbe. Shirahoshi explained that Megalo witnessed the truth and told her about it in secret. Shirahoshi did not reveal the truth to anyone because she was honoring her mother's last wish of holding no hatred for the killer. Hody then ridiculed Shirahoshi for allowing him to go free, calling her kindness stupidity."}, {"type": "paragraph", "text": "He then tried to prove his point by torturing Neptune and the royal brothers with Yabu Same, critically injuring them. Hody was just about to take Neptune's head when Luffy (who has been hiding inside Megalo) suddenly appeared and kicked Hody away. Hoe then arrived and carried away the king and princes as the rest of the Straw Hats made their unexpected appearance in the plaza."}, {"type": "paragraph", "text": "He was later seen with his sons and Hoe when Noah was seen approaching the island. He panicked, saying Noah could never be moved until a certain day arrives. Neptune then explained the significance of Noah and that it must not be damaged."}, {"type": "paragraph", "text": "He was later found by the Minister of the Left and some of the soldiers. When Neptune was asked to evacuate, he looked at the sky and said that he wished to wait for the princes to return. After the Straw Hats defeated all the leaders of the New Fish-Man Pirates, everyone looked into the sky as Luffy tried to destroy Noah. Neptune apologized to Joy Boy for not being able to keep the promise. However, the promise was saved when the Sea Kings appeared and stopped Noah from falling."}, {"type": "paragraph", "text": "He was later shown heading towards Gyoncorde Plaza with the Minister of the Left. He was informed by the soldiers that the kidnapped mermaids were found inside the Ryugu Palace. Neptune was also informed that all the treasures in treasure room were gone. Neptune decided to ignore the treasure thieves and had his men inform the people of Fish-Man Island about the discovery of the kidnapped mermaids as well as dropping the charges against the Straw Hat Pirates. He then went to the plaza where he reunited with the princes and Shirahoshi. As Jinbe offered to donate his blood to Luffy to save him, Neptune did not stop him and stated that the law prohibiting it was just another \"curse\"."}, {"type": "paragraph", "text": "He then decided to let the human pirates that were enslaved by Hody go free, saying there was no reason to keep them there. He also declared that the remaining New Fish-Man Pirates were to live under the surveillance of his army, doing penal servitude, and that the Fish-Man District would be closed off. He then asked Fukaboshi of where the Straw Hats went, and was surprised when he answered that they ran away. He called them with a Baby Den Den Mushi, and invited them to a banquet in the palace."}, {"type": "paragraph", "text": "After enjoying the banquet party, Nico Robin asked him to go outside so that they could have a talk. When Robin revealed to him that she read the Poneglyph in the Sea Forest and asked him who Joy Boy was, Neptune looked surprised and decided to tell her because he trusted her. Neptune told Robin that Joy Boy was a man who lived during the Void Century, and that the apology message from the poneglyph was intended to be for the Mermaid Princess of that time. He was apologizing for breaking his side of a promise he made with Fish-Man Island. Even though Neptune himself does not know of the details, he does know that one day, someone is supposed to come and carry out the promise for Joy Boy. Robin then asked Neptune if Joy Boy, who tried to use Noah, had the ability to control Sea Kings. He answered that he could not, and that it was the Mermaid Princess from that time who had this ability. He also said that the fact that Shirahoshi had awakened that same ability was not a good thing."}, {"type": "paragraph", "text": "Robin told the king of the Poneglyph she found in Skypiea two years ago, and asked if the Mermaid Princess of Joy Boy's time went by a certain name because Shirahoshi has the same ability and also has the same name. Neptune looked grim and surprised when he realized that his daughter's other name is none other than Poseidon, one of the ancient weapon. Neptune was also concerned of what would happen if information about her daughter were to get out since forces around the world would desire her power."}, {"type": "paragraph", "text": "After the treasure thief, Caribou, was discovered and sent flying out of the palace by Luffy, Nami asked Neptune why he was not going after him. Neptune did not consider the treasures valuable especially after the lives of Fish-Man Island were saved and allowed the Straw Hats to take the treasures if they could catch the thief. Neptune, his sons, Jinbe, the ministers, and some of the royal soldiers then checked up on the former leaders of the New Fish-Man Pirates in the prison tower. They found that Hody and his companions have turned into aged and frail men. Everyone then realized that before Hody left the Neptune Army, he stole the contents of the Tamatebako. Neptune then commented on how Hody had become delusional and expressed his pity towards him and even said he would have to reconsider Hody's punishment,"}, {"type": "paragraph", "text": "Afterwards, Neptune had a private talk with Jinbe over the status of the Sun Pirates under Big Mom's jurisdiction. Jinbe stated that they had been pretty much able to do as they pleased for now and admitted that serving under a Yonko became a great protection for his crew. Neptune noted it was because of Jinbe doing this that the island was safe after Whitebeard's death through the name of Big Mom, despite Jinbe stating that he and his crew should be doing the protection. Jinbe stated that he was thinking of cutting ties with Big Mom due to Luffy's invitation to join the Straw Hat Pirates, but he worried that her anger would spill to Fish-Man Island. Neptune stated Jinbe took on too much responsibility and because they just gained 70,000 soldiers from the Fish-Man District, Neptune stated he found another flag to replace Big Mom's should they lose her protection, that being the Straw Hats', to which Jinbe happily agreed. The Minister of the Right later informed Neptune that the Tamatebako treasure box had been loaded with a bomb that would explode when somebody opened the box. This was supposed to be a security measure after the contents of the Tamatebako were stolen ten years prior. Once they found out that Luffy gave all of the treasures to Big Mom, including the Tamatebako, Neptune and the Minister of the Right feared the possibility of Big Mom opening the box."}, {"type": "paragraph", "text": "Afterwards, Neptune, his family, and all of Fish-Man Island said farewell to the Straw Hat crew. In all hopes, he and the Minister of the Right hoped that the bomb would turn out to be a dud from the damp environment for an extended period of time. During the Straw Hats' departure, Neptune told his sons to not forget the debt they owe them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Neptune_Invites_Straw_Hats_to_Ryugu_Palace.png/revision/latest/scale-to-width-down/285?cb=20141206212154", "caption": "Neptune personally inviting the Straw Hats to a banquet at the Ryugu Palace for helping Megalo."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b2/Zoro_Intercepts_Neptune.png/revision/latest/scale-to-width-down/250?cb=20141124075126", "caption": "Zoro intercepting Neptune's attack."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4c/Neptune_and_His_Soldiers_Detained.png/revision/latest/scale-to-width-down/260?cb=20130401013925", "caption": "Neptune and his soldiers defeated by Zoro, Nami, Usopp, and Brook."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Brook%2C_Neptune%2C_Usopp%2C_and_Zoro_Captured_by_the_New_Fish-Man_Pirates.png/revision/latest/scale-to-width-down/250?cb=20141206185943", "caption": "Neptune and three of the Straw Hats captured by the New Fish-Man Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/10/Gyoncorde_Plaza_Execution.png/revision/latest/scale-to-width-down/250?cb=20120626062558", "caption": "Neptune and his sons all chained up and on display for execution."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Neptune_Speaks_to_Robin.png/revision/latest/scale-to-width-down/260?cb=20180530220240", "caption": "Neptune tells Robin about Joy Boy."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Neptune and his sons tried to convince Shirahoshi to accompany them."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of Luffy's exploits at Totto Land spread across the world, Neptune read about it on the newspaper and learned that Jinbe joined Luffy's crew. Given Jinbe's actions against Big Mom, Neptune planned to declare Fish-Man Island under the Straw Hats' protection. As Shirahoshi decided to accompany her family, they were ready to depart for the Levely."}, {"type": "paragraph", "text": "Later, he and his family arrived at the Red Port, where they made acquaintances with Monkey D. Garp as he escorted them to the bondola. Along the way, Neptune interrupted a quarrel between Garp and Sterry. Neptune and Garp then parted at the bondola, and as he and his family rode it to Mary Geoise, Neptune was happy that Shirahoshi marveled at the sun and sky."}, {"type": "paragraph", "text": "Neptune and his family later arrived at the top of the Red Line and they made their way to the Mary Geoise castle. At the socializing plaza, Neptune conversed with other royals."}, {"type": "paragraph", "text": "Later, Charlos tried to take Shirahoshi by force. After thanking Vivi for protesting against the World Noble's actions, Neptune prepared to attack Charlos and CP-0 even if it meant giving up on Otohime's dream. Before the situation escalated any further, Mjosgard intervened on Shirahoshi's behalf and struck Charlos in the face with a spiked club and ordered for the Mermaid Princess to be set free."}, {"type": "paragraph", "text": "After Charlos was taken away, Neptune acknowledged that there are good humans and that Mjosgard's actions had saved Otohime's dream. Neptune later went to the conference room with the other kings and queens to begin the Levely."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, Neptune returned to Fish-man Island with his family and Garp. Garp told Neptune about an incident involving Alabasta that occured after they left Mary Geoise."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Neptune and Ryugu Palace guards vs. Roronoa Zoro, Nami, Usopp, and Brook", "elements": []}, {"text": "Neptune vs. New Fish-Man Pirates", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He shares his name with Neptune, the Roman god of the sea, especially the waves of the sea.", "elements": []}, {"text": "His appearance (wild hair and beard, broad build, trident, etc.) is a common depiction of mermen in popular culture, particularly sea gods and rulers such as King Triton from Disney's The Little Mermaid.", "elements": []}, {"text": "The coelacanth in Indonesia (where some of them are discovered) is referred locally as \"Raja Laut\", meaning \"King of the Sea\", fitting Neptune's title as the king of Fish-Man Island.", "elements": []}, {"text": "He appears as a support character in One Piece: Gigant Battle! 2 New World. Like Shirahoshi, he can be acquired with a downloadable mission.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Coelacanth – Wikipedia article about the type of merman Neptune is.", "elements": []}]}], "images": []}]}