{"sections": [{"title": "Vander Decken IX", "level": 1, "content": [{"type": "paragraph", "text": "Vander Decken IX is the captain of the Flying Pirates on their ship, the Flying Dutchman, and the eighth descendant of the original Vander Decken of legend. He is a Japanese bullhead shark fish-man and the secondary antagonist of the Fish-Man Island Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Decken is a tall individual with beige-colored skin (mid-dark brown in manga), slim build, and lanky limbs. His most distinguishing feature is his four legs. He has a short, scraggly goatee, a long, wavy mustache with spiky edges, and similarly, long, wavy and spiky black hair. After being rejected by Shirahoshi, he shaves the top of his head in depression. He also has sharp teeth, with bigger webs between his fingers than most fish-men, a very thin, pointy nose and a prominent hunch that puts his head on equal level with his shoulders."}, {"type": "paragraph", "text": "He wears three golden bands on each of his ankles, and two pairs of sandals. He sports green overalls reaching just below his knees, with ruffled edges and decorative buttons on both the straps, over a light green-colored (white in the anime) shirt with ruffled edges. He sports a yellow cape, also complete with ruffled edges, draped over his shoulders, and two massive beaded necklaces hanging on his chest. He wears a yellow fedora with a purple band on his head which he seems to have had for at least ten years. In order to maintain his power's lock onto Princess Shirahoshi, he wore a red glove on his right hand at most times."}, {"type": "paragraph", "text": "While masquerading as his supposed cursed ancestor during his first appearance, he wore a dark colored cloak that covered up his body."}, {"type": "paragraph", "text": "In the past, he wore a broadly horizontal-striped shirt under light overalls with a gun strapped to his hip. He had cat-like whiskers instead of a mustache and did not have a goatee. His hair was shorter and was straight and rounded like dreadlocks."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Decken often has his arms crossed over his chest with each of his hands holding two fingers in a 'victory' sign."}, {"type": "paragraph", "text": "He is very formal, as shown when he introduced himself to Hody Jones. He often adds \"I think\" (のハズだ, no hazuda) to the end of his sentences. He also does not want to become a subordinate to anyone which is the reason why he did not join the Arlong Pirates, but is willing to get into a partnership with anyone who shares a similar goal with him, as long as he is treated as no less than an equal."}, {"type": "paragraph", "text": "He seems to be somewhat of a poet, reciting a haiku after Shirahoshi rejected him. He was also reciting a poem when the Straw Hats first encountered him."}, {"type": "paragraph", "text": "Decken is completely obsessed with Princess Shirahoshi, which leads him to act without thinking straight and usually acts one step ahead of the situation, such as writing wedding invitations before even proposing or realizing that he has no friends to invite, or calling Neptune \"father\" before the wedding that Neptune disapproves of anyways. He is also a madman when it comes to Shirahoshi, as he is willing to go to extreme measures such as throwing Noah just to kill one person. However, unlike many fish-men and despite joining forces with the New Fish-Men Pirates, Decken himself never showed any sympathy for or against the centuries of prejudice against humanity."}, {"type": "paragraph", "text": "He has been described as a bandit of the sea floor, and the residents of Fish-Man Island feared him for years. Typical of a pirate, he believes violence is the answer for everything, which is most evident by how he displays his affection for Shirahoshi by throwing large weapons at her. He has a desire for treasure as he does not approve of his giant angler fish, Ankoro, eating ships before he can collect the ships' treasure. In the anime, Decken is quite arrogant, believing Jinbe to be weaker than him despite his Shichibukai status."}, {"type": "paragraph", "text": "He tends to overreact to certain situations that surprise him, such as reacting shocked and depressed when Shirahoshi turned him down for \"not being her type\" and decided to cry endlessly, recite a haiku, and shave the top of his head in depression. This was shown again when she rejected him a second time despite her life being on the line at the time and when her brothers showed up. This makes him one of the more comedic villains shown (like Buggy or Spandam)."}, {"type": "paragraph", "text": "Like many characters in the series, Decken has a distinct laugh, starting his with \"Ba\" (i.e Bahohohoho!)."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Decken has a loyal crew. Wadatsumi is very obedient and follows Decken's every command, while the rest of his crew cheers him on. They are also aware of the Decken family's ambitions about getting the legendary mermaid who can communicate with Sea Kings, a legend that only a few know about. Unlike most cruel pirate captains who dominate over their subordinates, Decken has a casual relationship with his crew. However, Decken is not above abandoning them. When Noah collides with the bubble surrounding Fish-Man Island, Wadatsumi falls off the ship and Decken ignores his pleas for help and calls him a sacrifice."}], "images": []}, {"title": "Shirahoshi", "level": 3, "content": [{"type": "paragraph", "text": "He is attracted to the Mermaid Princess, sending her letters, packages, and even threatening marriage proposals. He decided that he must marry Shirahoshi after he saw her ability to communicate with Sea Kings, a trait belonging to the mermaid princess of legend that the Decken family has been seeking for centuries. He is rather obsessive about getting the princess to marry him, and he believes the princess is in love with him, going so far as to say she can either marry him or die. His obsession led to him reserving his right hand for Shirahoshi alone, targeting her since she was only six years old, and going as far as to write wedding invitations before even proposing to her. He has been threatening her for ten years by sending her \"love notes\" in the form of weapons with his ability."}, {"type": "paragraph", "text": "After ten years, he enters the palace and refers to Neptune as his \"father\" despite not taking Shirahoshi as his wife, believing both him and Shirahoshi have spent the last decade dreaming of each other when in reality Shirahoshi is revolted at Decken. When Decken finally proposes to Shirahoshi in person during her first time outside in ten years, the Mermaid Princess politely rejects him by saying that he is not her type. Seeing that Shirahoshi truly has no feelings for him, he decides to forget about marriage and aims to kill her. Since every weapon he throws get blocked by Luffy, Decken goes as far as to throw a massive ship that will destroy Fish-Man Island and everyone on it."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Ryugu Kingdom", "level": 4, "content": [{"type": "paragraph", "text": "Decken has a dislike for the king, as he believed Neptune was keeping Shirahoshi from him to use her marriage for political reasons. King Neptune is angered at Decken for threatening Shirahoshi, whom he considers to be his treasure. The king had his sons form an army to find Decken. To get to Shirahoshi, Decken allied with Hody in his ambition to overthrow Neptune."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Luffy has earned Decken's hatred by standing between him and Shirahoshi. After getting rejected by Shirahoshi, Decken tried to kill her but Luffy slammed him into the ground during a confrontation. Afterwards, Luffy kept blocking every weapon that Decken threw at the Mermaid Princess. Decken decided to throw the giant ship, Noah, because of Luffy thwarting his attempts to kill Shirahoshi."}], "images": []}, {"title": "Hody Jones", "level": 4, "content": [{"type": "paragraph", "text": "Decken formed an alliance with Hody Jones, with the understanding that they are equals, not leader or subordinates. However, Decken has no interest in the goals of the New Fish-Man Pirates and only used this alliance to get closer to Shirahoshi. After Shirahoshi rejected him, he is willing to see Fish-Man Island destroyed as revenge which clashes with Hody's goal of becoming King. Likewise, Hody used Decken in the hopes of eliminating Shirahoshi, but upon his failure, Hody considers Decken to be useless. Once Hody sees Decken's treachery, which is attempting to destroy Fish-Man Island and everyone on it including Hody himself, the alliance is void and Hody becomes an enemy. Therefore, when Hody reaches Noah, he stabs Decken in revenge. Decken, in return, declared that he will kill Hody at all cost for that attack."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "No direct interaction is seen between the two but the Knight of the Sea is aware of his obsession with Shirahoshi and his ingestion of a Devil Fruit. He assists Luffy by giving him Bubble Coral to battle Decken on Noah and defeating his underling Wadatsumi."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Vander Decken IX is the eighth descendant of the legendary wicked pirate Vander Decken and the captain of the Flying Pirates: as such, he has authority over his crew and controls the legendary, enormous ship Flying Dutchman. He also has at least two gigantic sea creatures at his command, these being the fish-man Wadatsumi and the giant anglerfish Ankoro. When Decken joined forces with Hody Jones, it was stated that these two pirate captains working together would be unstoppable, although their relationship was fragile, which hampered, and ultimately broke off, their alliance."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "In terms of physical prowess, Decken has extraordinary strength as demonstrated when he was able to carry and throw a battle axe that is larger than himself. With a single kick, he easily break a giant coral. By dual wielding two axes, Decken easily defeated multiple fish-men when they attempted to stop him from going after Shirahoshi."}, {"type": "paragraph", "text": "He also seems to hold a great deal of endurance, as he was able to recover just moments after Luffy pummeled him into the ground with a Jet Hammer attack. He was also able to survive getting stabbed by Hody's trident, slashed by his own axe, and falling from considerable heights. He was also capable of surviving Luffy's assault on Noah despite being hit by the attack. However, it is shown that he has limits, as he was knocked out just by hitting his head on a step after slipping."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Decken ate the Mato Mato no Mi, a Paramecia type Devil Fruit which allows him to throw any projectile, including people, at targets he has designated. By touching people with his bare hands, he can \"lock on\" to them and make them his targets. From there on, any projectile he throws with that respective hand will automatically seek out a targeted person of his choice like a homing missile, and will not stop until it reaches it or is hindered by an obstacle. It is revealed that he does not necessarily have to throw the object in order for it to fly at his target, but merely touch it with the hand that marks his target, as demonstrated when he touches the Noah to send it flying towards Shirahoshi. His homing ability can be used to moved immensely heavy objects such as a large coral and even Noah, a gigantic ship. He can also only remember as many people as he has palms (i.e. two), which is why he wears a red glove on one of them. Also, if Decken dies or falls unconscious, the effects of his ability will disappear."}, {"type": "paragraph", "text": "Decken used his power to threaten Shirahoshi by sending weapons to both woo and try to kill her, which is why the princess is locked up in her room, as evidenced by the many weapons that are stuck in the tower's door. He also used this power to throw people so they could arrive at Shirahoshi's door and infiltrate the palace. He can also use his powers as a means of locating one of his targets and can even ride on some of the objects he throws, as shown when he threw and jumped on a large piece of coral to find Shirahoshi. He uses his right hand to lock onto Shirahoshi and wanting her as a permanent target, Decken only uses his left hand to switch his secondary targets such as Hatchan and Hody."}, {"type": "paragraph", "text": "In addition, the loss of the ability to swim affects Decken more than a human Devil Fruit user since, as a fish-man, he would have a huge advantage underwater, an advantage he can no longer use due to the side-effects, but still can survive underwater. Also, as a Devil Fruit user, he is powerless in the sea, as he requires a flutter kick coating."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3b/Mato_Mato_no_Mi_in_Use.gif/revision/latest?cb=20120723110413", "caption": "Decken's Devil Fruit ability sends his projectiles to his target even when he aims in another direction."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Despite not being visible anywhere on his body, Decken has a great array of weapons at his disposal, which have mostly been seen used in conjunction with his Devil Fruit powers."}, {"type": "paragraph", "text": "He seems to have a penchant for large battle-axes with a rose design on the sides and knives. He throws giant double-bladed ones at Shirahoshi from afar during several occasions, and tried to kill her with single-edged smaller (but still rather large) ones, which he also employed proficiently in melee when fending off some inhabitants of Ryugu Kingdom who were trying to stop him. However, judging from the exterior of the Hard-Shell Tower he has a large variety, including swords and maces."}, {"type": "paragraph", "text": "He also has knives installed in his front sandals, so he can raise his front legs to fight with them while being supported by his hind legs."}, {"type": "paragraph", "text": "Aside from the large amount of weapons he currently carries on his body, he has other weapons alongside him. Ten years prior to his introduction, he was seen carrying a rifle on a hip holster."}, {"type": "paragraph", "text": "In the New Fish-Man Pirates' hideout, after making Hatchan his target, he showed off his Devil Fruit powers by hitting the fish-man with a thrown knife and then threw a volley of arrows at Hatchan, forcing him to flee."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Vander Decken IX became captain of the Flying Dutchman and formed a crew which included Wadatsumi and Ankoro, hunting down coated ships that tried to descend to Fish-Man Island for their treasure."}, {"type": "paragraph", "text": "Arlong once offered Decken a place in the Arlong Pirates, but Decken declined, citing that he does not work under anyone."}, {"type": "paragraph", "text": "Ten years ago during an uproar with a World Noble, Decken witnessed Princess Shirahoshi's legendary ability to call upon Sea Kings. He was overjoyed, as encountering the mermaid with this power was the dream of his ancestors. He declared to his ancestors that he had succeeded in accomplishing their goal. Decken then set his sights on marrying her. Seeing as she was too young at the time, Decken came up with a plan to use the Tamatebako to age Shirahoshi into a woman. The problem was that the Tamatebako was in the Ryugu Palace and Decken could not enter the palace unless he marries Shirahoshi. Since Decken does not have a problem with big women, he decided to give Shirahoshi ten or twenty years first. He started writing wedding invitations even though he had not propose to Shirahoshi yet, and then realizing that he did not have any friends to begin with."}, {"type": "paragraph", "text": "During the confusion when Queen Otohime was shot by Hody Jones, he managed to \"mark\" Shirahoshi with his acquired Devil Fruit power using his right hand before getting chased away by a soldier. Before Otohime's funeral, he started sending letters to Shirahoshi, which the princess never replied to. Decken relentlessly sent more letters, then packages and eventually, threatening marriage proposals. His actions terrified the princess and angered her father, King Neptune. The Ryugu Kingdom responded to Decken's threats by raising an army against him and his crew. Decken then became a wanted man on Fish-Man Island. Thanks to the Mato Mato no Mi, Decken was able to remain a stalker while the Neptune Army was unable to find him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/80/Vander_Decken_IX_Marks_Shirahoshi.png/revision/latest/scale-to-width-down/200?cb=20110812133338", "caption": "Decken marking Shirahoshi."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Ten years later, he encountered the Straw Hat Pirates when Wadatsumi stopped Ankoro, the angler fish, from eating the Thousand Sunny. Decken then ordered Wadatsumi to attack the Thousand Sunny so he could take their treasure. Unfortunately for him, the kraken, Surume, having been tamed by Luffy, intervened and defeated Wadatsumi. Decken then yelled at Wadatsumi to get up and retaliate, but was informed by one of his crew that the undersea volcano was about to erupt."}, {"type": "paragraph", "text": "With the volcano starting to erupt, he ordered Ankoro and Wadatsumi to pull the Flying Dutchman away from the approaching magma and said that his business with the Straw Hat Pirates was not finished."}, {"type": "paragraph", "text": "He was later seen with Wadatsumi and Ankoro, asking Wadatsumi how long it was since he had started proposing to Princess Shirahoshi. Wadatsumi replied that it had been ten years. He blamed Neptune, saying that he thought the king had a politically motivated wedding planned for her. He commented on how painful it was, as he thought that they were both in love (though really it was just him). He then brandished a large axe with a rose painted on it, saying that he would present her with it. He then threw it, but the axe doubled back and took out the mast of his ship, causing one of his crew members to tell him that he missed. Decken then crossed his arms, saying he never missed. He then declared his love for Shirahoshi by saying that he would never find another woman like her. He said it was good if her love united them, but that she cannot live her life with another man, as he would kill her if she does. He declared that she must pledge her love to him or die, saying her fate was either marriage or death."}, {"type": "paragraph", "text": "Later, he and his crew arrived at Noah, where the New Fish-Man Pirates were waiting for him. He was told where to go, and he apologized for being late, citing his earlier trouble with the volcanic eruption. He then greeted Hody Jones and after putting on a glove, he shook hands with him. As their crews cheered them on, the two then cemented their intent: the complete collapse of the Ryugu Kingdom."}, {"type": "paragraph", "text": "As Decken set the plan into motion, Hatchan appeared and tried to talk Hody and Decken out of going through with the operation. When Hatchan asked Decken about why he was helping the New Fish-Man Pirates when he did not help Arlong, Decken stated that he was not the kind of person who followed under anyone and his relationship with Hody was nothing more than a partnership. Hatchan was unable to sway Hody and Decken proceeded to use Hatchan as a demonstration for his powers while saying that violence is the way to express opinions. Decken then touched Hatchan, making him a target. Decken threw a knife in the air behind Hatchan, and it flew back towards Hatchan, stabbing him in the back. Decken explained that after a person becomes his target, he can hit that target from anywhere. He then sent Hatchan running when he threw a volley of arrows. With that settled, Decken then used his ability to throw a group of captive pirates and send them flying into Shirahoshi's tower, thus infiltrating the palace."}, {"type": "paragraph", "text": "He was later seen heading for the Ryugu Palace with Hody Jones and his crew while riding on top of sea monsters. Decken was eager to have his marriage with Princess Shirahoshi. Once they entered the palace, they found King Neptune and the palace guards already subdued, courtesy of the Straw Hats. Decken was immediately met with accusations by Neptune, who assumed that Decken was behind his daughter's inexplicable disappearance. Decken denied these convictions, saying that he had yet to be properly engaged to Shirahoshi, and demanding her be returned at once would be too egotistical even for Neptune. Ignoring his statement, Neptune pressed on and angrily asked where was his daughter taken, which informed Decken that Shirahoshi was no longer in the palace."}, {"type": "paragraph", "text": "He then went into a frothing rage, but was promptly assured by Hody that she might still be somewhere nearby, since the human pirates that Decken sent flying landed directly within the Ryugu Palace and even if she wasn't, Decken would still be able to track where Shirahoshi was. This calmed Decken and he proceeded to once again enter a bubble as he embarked outside, where he used a giant coral as a medium for his power to discern Shirahoshi's location. The coral flew away from the palace, confirming Decken's suspicions that the princess was not in Hard-Shell Tower anymore. He was then seen riding on top of the coral, stating that only \"death\" could keep him and Shirahoshi apart."}, {"type": "paragraph", "text": "He soon arrived at Coral Hill and demanded Shirahoshi to marry him. She bluntly rejected him, claiming he was not her type. Enraged, Decken prepared to kill her, but Luffy got in the way. Luffy smashed the flying coral and pummeled Decken into the ground. He recovered just moments later and said to Luffy and Shirahoshi that they were not getting away as they prepared to leave on Megalo. He called out to Wadatsumi to attack them, but Wadatsumi got hit in his front tooth by Luffy's Jet Pistol. As Wadatsumi cried out in pain, Shirahoshi escaped Decken's clutches, much to the latter's anger. After Decken got away from the locals, he threw weapons at Shirahoshi several times only for them to get deflected by Luffy."}, {"type": "paragraph", "text": "He later went back to Noah, lamenting his lost love. He was so crushed by Shirahoshi's rejection that he even shaved the top of his head. His crew tried to console him, but he did not want them to. He reminded them that even when Shirahoshi was still a child, he decided to marry her for the sake of his ancestors. He then recited a haiku to himself about his rejection, and was frustrated by Luffy saving her every time he tried to kill her. He then got an idea that he said would make everything break apart."}, {"type": "paragraph", "text": "He touched the giant ship, Noah, with his right hand, making it fly to Shirahoshi. As Decken's crew was shocked, he stated that both Shirahoshi and Fish-Man Island would be destroyed. When Noah was above Gyoncorde Plaza in Fish-Man Island, Wadatsumi fell into the plaza. Wadatsumi begged Decken to help him, but Decken told him that he would have to be a sacrifice for the cause because he cannot stop the ship anymore once it had been launched. He then noticed that Shirahoshi disappeared from the plaza and appeared in front of Noah. When she told him that he should only kill her and not the people on the island, he showed glee at her bravery and noted her beauty knows no ends, and then threw a knife at her that hit her in the shoulder."}, {"type": "paragraph", "text": "While Hody and Luffy climbed up to Noah, Decken threw some knives towards Shirahoshi, asking her whether she would die from her blood being spilled or Noah crashing into her. The thrown knives were blocked by Manboshi and Ryuboshi. Hody reached the deck of Noah and Decken welcomed him. Hody then pierced Decken with his trident. However, Decken managed to touch Hody with his left hand."}, {"type": "paragraph", "text": "Decken stepped back and cursed Hody for his betrayal. He threw one of his axes towards Hody but he easily evaded it. Decken then tried to hit him once more with the knives in his sandals but missed him. Hody then bit Decken in the leg. When the axe returned for Hody, he used Decken as a shield and the axe hit Decken instead which caused him to fall in the boat."}, {"type": "paragraph", "text": "Decken survived and started plotting to kill Hody for what he had done to him. However, when Noah shook, Decken slipped and hit his head. Decken passed out and the ship started falling towards Fish-Man Island."}, {"type": "paragraph", "text": "After the Sea Kings stopped Noah from crashing into the island, the princes brought the unconscious Decken and Hody to the plaza and put them in chains, with Fukaboshi declaring that both pirate captains would be incarcerated forever. Decken was then locked up in the palace prison along with the officers of the New Fish-Man Pirates. He apparently remained unconscious and out of the picture when the officers woke up and critically aged by their Energy Steroids abuse."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/43/Hody_and_Decken_Alliance.png/revision/latest/scale-to-width-down/280?cb=20140925235316", "caption": "Decken's alliance with Hody Jones."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e6/New_Fish-Man_Pirates_and_Flying_Pirates_on_Way_to_Invade_Ryugu_Palace.png/revision/latest/scale-to-width-down/250?cb=20141206210115", "caption": "Hody, Decken, and their crews prepare to invade Ryugu Palace."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/Gomu_Gomu_no_Jet_Hammer.png/revision/latest/scale-to-width-down/210?cb=20130525220423", "caption": "Luffy pummels Decken."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/Hody_Stabs_Decken.png/revision/latest/scale-to-width-down/210?cb=20151110011022", "caption": "Hody stabs Decken with his trident."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/00/Hody_and_Decken_Arrested.png/revision/latest/scale-to-width-down/255?cb=20141206205557", "caption": "Decken and Hody defeated and arrested."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Vander Decken IX vs. Monkey D. Luffy", "elements": []}, {"text": "Vander Decken IX vs. Hody Jones", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His Devil Fruit only allows him to target as many people as he has hands. Ironically, while he has four legs, he only has two hands.", "elements": []}, {"text": "Because of his Devil Fruit, he is also a fish-man that is unable to swim. This is a reversal of most adaptations of the Flying Dutchman legend: the captain is a human spirit who cannot step onto land.", "elements": []}, {"text": "Decken being the \"cursed\" captain of the Flying Dutchman and his pursuit of Shirahoshi somewhat follows a motif used in Richard Wagner's opera: the captain can be freed from his curse if he can find a faithful woman.", "elements": []}, {"text": "Decken is the first new Paramecia Devil Fruit user to appear after the time skip.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Japanese bullhead shark – Wikipedia article about the type of fish the fish-man Vander Decken IX is.", "elements": []}]}], "images": []}]}