{"sections": [{"title": "Splash and Splatter", "level": 1, "content": [{"type": "paragraph", "text": "Splash and Splatter are two okama pirate twins who are found on Fish-Man Island. They both willingly donated blood to Sanji, who was dying of severe blood loss."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "They are both muscular and have exaggerated male facial features, which are covered with excessive make-up. They have spiked eyebrows and long spiked hair. They wear the Criminal brand and are almost always flexing."}, {"type": "paragraph", "text": "Splash has brown hair and wears a pink shirt, with light pink edges and a yellow star on the chest, and black tights. Splatter has blond hair and wears a white shirt, with blue edges and a red star on the chest, and black tights. In Gigant Battle 2, they wear purple and yellow."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Splash and Splatter both act very effeminate, as any okama would. They also seem to brag constantly about their physique by showing off their muscles. They seem to be nice individuals as they willingly gave large amounts of their blood to save a fellow human life. They end all of their sentences with the word \"silly\", followed by a heart, showing the \"feminine tone\" being used in speech."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "They have apparently been on Fish-Man Island for a long time, way before the Straw Hats arrive since Camie stated that Luffy and his crew are the first visitors in a while. Another hint to their long stay on island is that Splash and Splatter are not under the clutches of the New Fish-Man Pirates, while Gyro and his crew were not so lucky."}, {"type": "paragraph", "text": "When Sanji suffers critical blood loss, Splash and Splatter volunteer to donate blood to him. When Sanji regains consciousness, the two okamas reveal themselves to him, much to Sanji's horror."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, they are shown again during a scene when Sanji starts fantasizing about Nami and Robin and is about to lose more blood. Chopper calls Splash and Splatter who appear in pink nurse mini dresses and attempt to treat him. Sanji freaks out upon seeing them which naturally makes him snap out of his perverted dreams and prevents another nose bleed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4c/Splash_and_Splatter_as_Nurses.png/revision/latest/scale-to-width-down/225?cb=20190403133832", "caption": "Splash and Splatter dressed as nurses in an extra scene in the anime."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "They both have S RH- type blood.", "elements": []}, {"text": "They make a cameo in Mermaid Cove stage of the game Gigant Battle! 2.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 610 (p. 3) and Episode 529, Splash and Splatter donate their blood to Sanji.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 95), Their birthday is revealed.", "elements": []}]}], "images": []}, {"title": "External References", "level": 2, "content": [{"type": "list", "elements": [{"text": "Transvestism — Wikipedia article about Transvestism in general", "elements": []}, {"text": "Twins — Wikipedia article about twins", "elements": []}]}], "images": []}]}