{"sections": [{"title": "Ishilly", "level": 1, "content": [{"type": "paragraph", "text": "Ishilly is a striped beakfish mermaid who lives on Fish-Man Island and was first seen in Mermaid Cove. She is an employee at Mermaid Cafe."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ishilly is a mermaid with freckles and a black and white striped tail. Her black wavy hair is arranged in two pigtails with flowery ribbons and her bangs are gathered mostly to the left."}, {"type": "paragraph", "text": "She wears a star-fish shaped pendant around her neck and a black-white striped bikini top with a flower in the middle."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ishilly is friendly and playful. She welcomes Luffy's group with a warm smile and happily swims with Sanji; enjoying his company. She seems to have taken a liking to the Straw Hat chef as she shows her concern for him after he suffered critical blood loss from a massive nosebleed."}, {"type": "paragraph", "text": "She is also curious since she volunteered to open the barrel that Caribou was in. That was a careless mistake as she did not consider that the barrel was meant to keep something in and this led to her and her friends' kidnapping."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being a mermaid, Ishilly has several abilities unique to her race. It is not yet shown but she has the ability to talk to fish, and call out to them using sonar waves which is one of the basic abilities found in all mermaids and some Fish-Men. Apart from the ability to breathe underwater, as a mermaid she also has the ability to swim very quickly at speeds much faster than the flying fish used by the Flying Fish Riders. However, like any mermaid, she is vulnerable on land."}, {"type": "paragraph", "text": "She also appears to be a skilled dancer, as she is dancing during the banquet for the Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Ishilly_Dances.png/revision/latest/scale-to-width-down/190?cb=20121029013121", "caption": "Ishilly dancing at the banquet."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [], "images": []}, {"title": "Meeting the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "Ishilly was first seen in the Mermaid Cove welcoming four of Camie's friends: Luffy, Sanji, Chopper, and Usopp. After Sanji was invited for a swim, Ishilly was seen enjoying his company and said that Sanji was fun."}, {"type": "paragraph", "text": "When the three princes of the appeared searching for the Straw Hats, Ishilly hid Sanji by holding him close to her, unconsciously pressing his head against her chest (much to Sanji's delight). The mermaids denied seeing any intruders and just as the princes were leaving, Sanji, having gotten over stimulated with his face half buried in Ishilly's bosom, suffered a massive nosebleed, causing her to panic."}, {"type": "paragraph", "text": "After Luffy, Usopp, Chopper, and Camie took Sanji to the town port for emergency treatment, the mermaids apologized to the princes for concealing the pirates while Ishilly showed concern for Sanji."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Ishilly_with_an_injured_Sanji.png/revision/latest/scale-to-width-down/210?cb=20141028004222", "caption": "Ishilly panicking over a dying Sanji."}]}, {"title": "An Unpleasant Surprise", "level": 4, "content": [{"type": "paragraph", "text": "Once the princes left, Ishilly, Fillonce, and another mermaid discovered a tightly-sealed barrel in the Mermaid Cove. The mermaids decided to open the barrel, curious to see what was inside."}, {"type": "paragraph", "text": "After Ishilly loosened some of the bolts, Caribou popped out and terrified the unwitting mermaids. Caribou proceeded to capture them with the power of the Numa Numa no Mi as they tried to flee and scream for help. Therefore, Ishilly and her two friends became the first victims in Caribou's mermaid kidnapping scheme. The other mermaids at the cove had no clue that the barrel they found had something to do with Ishilly's disappearance and the citizens of Fish-Man Island blamed the Straw Hats for the kidnappings."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Caribou_Abducts_Ishilly.png/revision/latest/scale-to-width-down/210?cb=20130918122116", "caption": "Ishilly being abducted by Caribou."}]}, {"title": "Celebration", "level": 4, "content": [{"type": "paragraph", "text": "After the battle against the New Fish-Man Pirates ended, Ishilly and the other kidnapped mermaids were found in the Ryugu Palace. Later that evening, she was seen among the Mermaid Cafe dancers, performing at the banquet held for the Straw Hat Pirates."}, {"type": "paragraph", "text": "Later at the Mermaid Cafe, Ishilly and the other mermaids told Shyarly that the Straw Hats were leaving the island. Shyarly told them to bid farewell to the Straw Hats and the mermaids happily obliged. Ishilly and the other Mermaid Cafe employees then went to the coast to see the Straw Hats depart."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Mermaids_Say_Goodbye.png/revision/latest/scale-to-width-down/210?cb=20130112080756", "caption": "Ishilly and her friends bidding the Straw Hat Pirates goodbye."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name comes from ishidai (イシダイ, ishidai), the Japanese name for striped beakfish.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 608 (p. 14-15) and Episode 527, Ishilly makes her debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 25), Ishilly's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 609 and Episode 528, Ishilly plays with and is afraid for Sanji after he loses blood.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 612 and Episode 531, Ishilly and two other mermaids are kidnapped by Caribou.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 (p. 13) and Episode 569, Ishilly is dancing during the banquet.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 648 and Episode 568, Ishilly and the others are found in the palace.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 653 and Episode 573, Ishilly says goodbye to the Straw Hat Pirates.", "elements": []}]}], "images": []}]}