{"sections": [{"title": "Zeo", "level": 1, "content": [{"type": "paragraph", "text": "Zeo was an officer of the New Fish-Man Pirates. He is a Japanese wobbegong fish-man and the self-proclaimed \"Noble of the Fish-Man District\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As a Wobbegong shark, Zeo is a tall and thin fish-man with a strange body, covered in wavy light blue and indigo stripes, and \"02\" tattooed on his chest. Tentacle-like whiskers hang from his face, and unlike other fish-men, Zeo does not seem to have ears nor a nose, nor does he have a visible mouth. However, as he is able to speak, listen, and consume Energy Steroids, it is obvious that he has them. He sports a dorsal fin, and gills on his long neck."}, {"type": "paragraph", "text": "His legs are covered by what appears to be some sort of long inducement, with a pattern identical to his body's and the New Fish-Man Pirates' Jolly Roger in correspondence of his right knee. Around his waist is a belt with a round buckle, and his feet seem to be covered by dark boots."}, {"type": "paragraph", "text": "As a teenager, he looked almost identical, with the only differences being the smaller size, the lack of the number tattoo on his chest, not having the gill marks on the side of his neck yet, the simpler belt around his waist and the pair of loose pants he wore back then."}, {"type": "paragraph", "text": "Due to the negative effects of the Energy Steroids, his body became old and weak. He now sports a white beard resembling his tentacles, bushy eyebrows, a skinnier crooked neck, and something of a pot belly."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Zeo has a calm and serious demeanor and appears to be one of the most intellectual members of Hody's crew, as he was responsible for the mass-production of the Energy Steroids, and also behind swaying Wadatsumi to their cause. Like his colleagues, he believes humans are cowardly creatures. Zeo also despises humans and Otohime's ideals as much as Hody Jones and the other officers. Zeo appears vicious using threats to force the Fish-Man Island citizens to comply with the New Fish-Man Pirates and accept that they can never co-exist peacefully with humans. His hatred is intense, and he believed that even if they died in failure, they can leave a grudge against humanity for the next generation of fish-men to pick up, and stood by his beliefs by forcing the lower echelons to remain behind to die, even using deadly force to achieve this."}, {"type": "paragraph", "text": "Naming himself the Noble of the Fish-Man District, he seems to be overly committed to the morals of the Fish-Man District. Even after being beaten by his subordinates (unintentionally) he still kept preaching about how their views of Otohime were wrong. He also expressed great happiness and pride when he thought that he defeated Brook."}, {"type": "paragraph", "text": "Zeo's arrogance is so deep to where he stubbornly makes excuses whenever he's made a fool of, such as when Brook accidentally stepped on his face due to his camouflage, and gets angered easily when corrected on his mistakes. Zeo claimed he was \"headbutting\" Brook's foot. Later, after getting stabbed, he claims it was his plan to dull the blade. He showed it again after he (along with the other officers) grew old from the effects of the Energy Steroid, claiming that he grew old on purpose."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the New Fish-Man Pirates, Zeo has command over lower ranking subordinates."}, {"type": "paragraph", "text": "Zeo appears to be a skilled chemist (in making medicine at least), as Hody put him in charge of replicating and mass-producing the Energy Steroids."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a fish-man, he is born with the strength ten times that of an average human, and even more underwater; in fact, as an officer of the crew, his strength may be even higher."}, {"type": "paragraph", "text": "As a wobbegong fish-man, he also has the power to perfectly camouflage himself to blend in with the environment. This allows him to carry out sneak attacks on unaware opponents; he tends to approach his targets while laying flat on his back upon the ground close to where his targets are. Pinpointing his location through the sound of his voice also seems rather difficult, as neither the citizens of the island nor his own underlings managed to discern his position while he was speaking loudly. Only Brook was seen being able to determine where he was in this manner. In the anime, his camouflage is depicted as turning invisible, in a manner similar to Absalom's invisibility."}, {"type": "paragraph", "text": "He also seems quite resilient, since he was (unintentionally) pummeled by his own henchmen while being invisible, due to the fact a cockroach was on his head, and despite that he still remained conscious and was willing to proceed to Gyoncorde Plaza without losing time, still voicing out the crew's ideals loudly. He was also able to stand up without too much of an effort after Brook impaled him."}, {"type": "paragraph", "text": "However, after the negative effects of the Energy Steroids took effect, he became weak and old, stripping him of all his strength."}], "images": []}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Camouflage Carpet (カムフラージュ・カーペット, Kamufurāju Kāpetto): Zeo camouflages himself and then slides towards his opponent, attempting to catch them by surprise. However, since he tends to announce the attack's name out loud, his opponent usually can discern his location and even attack him. The pun is that, by sliding across the ground, Zeo is basically acting as a carpet, as well as the fact that another name for his breed of shark is \"carpet shark\".", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Zeo's weapons of choice seems to be two large weighted chains he apparently employs like a pair of bolas, as seen in the Marine Shopping Mall on Fish-Man Island, where he accurately threw one of them to wrap around a citizen's throat, causing his target to be choked, all the while remaining completely unseen due to his camouflage abilities."}, {"type": "paragraph", "text": "In the anime, Zeo used five spears to puncture Fukaboshi's resin inner tube, delivered at such speed due to his Energy Steroid abuse."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Brook_vs._Zeo.png/revision/latest/scale-to-width-down/210?cb=20130415215409", "caption": "Zeo using his fighting chains."}]}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Kamigakure Flail: 66 Kubi (神隠れフレイル 66首, Kamigakure Fureiru: Rokuroku Kubi, literally meaning \"Mysterious Disappearing Flail: 66 Neck\"): Zeo, while camouflaged, wraps one of his chains around his opponent's neck, and then loads the full weight of his body in the opposite direction, attempting to decapitate or break his opponent's neck. He uses this on Brook, only to be proven ineffective because he is a skeleton. This is called Hidden Flail 66 Head Lock in the Viz manga and Hidden Flail 66 Neck in the FUNimation sub. Rokuro-kubi is a long-necked yokai.", "elements": []}]}], "images": []}, {"title": "Energy Steroids", "level": 3, "content": [{"type": "paragraph", "text": "Like the rest of the crew, Zeo has taken the Energy Steroids during the battle against the three princes of Ryugu Kingdom, who are crowned the strongest soldiers in the entire island, and was able to overpower them due to this. The drug doubles his strength per pill, but shaves off a portion of his lifespan. He is also able to mass produce them through unknown means. This also had another side effect of making him old and weak after he was arrested, which lost him the strength he naturally had."}], "images": []}, {"title": "Excuse Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Super Sole Head-butt (超足裏頭突き (スーパーソールヘッドバット), Sūpā Sōru Heddobatto): Not a real attack, when Brook accidentally stepped on his face due to his camouflage, Zeo claimed he was \"headbutting\" Brook's foot.", "elements": []}, {"text": "Body De Sword Crush (ボディDEソードクラッシュ, Bodi De Sōdo Kurasshu, literally meaning \"Sword Crush by Body\"): Another excuse \"attack\", when he was impaled by Brook's sword, he claimed that he was \"destroying\" the sword's tip with his body. This is called Body Sword Crush in the FUNimation sub.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Zeo and the future officers were children, they witnessed human oppression against fish-men. While they were growing up in the Fish-Man District, they only learn one thing: hate humans. When they were teens, they read about Fisher Tiger's exploits at Mary Geoise. They cheered the Sun Pirates on thinking that their goal was to destroy humans."}, {"type": "paragraph", "text": "After Hody Jones joined the Neptune Army, the officers became a terrorist group that would kill any fish-men who sympathize with humans, especially those who willingly donate blood to them. After the assassination of Otohime, the officers celebrated. Hody then presented the Energy Steroids to the group and asked Zeo to mass-produce them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b8/DarumaDosunZeo.png/revision/latest/scale-to-width-down/210?cb=20130724105649", "caption": "Zeo, Dosun, and Daruma as kids listening to grown-ups celebrate human bloodshed."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "In Noah with the other New Fish-Man Pirates, Zeo commented on how humans escape so often after Gyro and his crew attempted to flee from the clutches of the New Fish-Man Pirates. When Hody Jones and Vander Decken IX formed their alliance, Zeo commented on how strong they became on the ocean floor. Later on when the New Fish-Man Pirates and Flying Pirates headed for Ryugu Palace, Zeo and Ikaros Much listed off King Neptune and the three princes as the strongest of the palace's forces."}, {"type": "paragraph", "text": "The New Fish-Man Pirates split up to go to different places. Zeo went to the Marine Shopping Mall at the west side of Fish-Man Island. As the invasion commenced, Zeo told the citizens that coexistence with humans was impossible and forced them to step on a fumi-e of Queen Otohime. While using his camouflage ability to blend in with his surroundings, Zeo told the citizens that they had no hope."}, {"type": "paragraph", "text": "While he was laying on the ground and invisible, a bug crawled beneath him. Some of the New Fish-Man Pirates tried to smash the bug but unintentionally smashed Zeo as well. After Zeo became visible again, the New Fish-Man Pirates were shocked at their mistake. Zeo then got back up and told his comrades to go to Gyoncorde Plaza, where King Neptune would be executed."}, {"type": "paragraph", "text": "The New Fish-Man Pirates gathered at the plaza, where the Neptune Army's attempts to save the king were thwarted by the Sea Beasts. Zeo pointed out a defeated guard who was trying to light some dynamite, but Hody stopped the soldier with Water Shot. Afterword, Zeo listed the physical changes that his captain had undergone and asked him how he felt. Hody replied that he felt incredible. After the three princes arrived and defeated the Sea Beasts, Zeo and the other officers prepared for battle."}, {"type": "paragraph", "text": "Initially, the princes had the upper hand, but the officers turned the odds against them by taking Energy Steroids. They then defeated the princes and captured them. The New Fish-Man Pirates celebrated as the princes were placed next to their father. After Jinbe and Shirahoshi were captured as well, Hody revealed to everyone that he was the one who truly killed Otohime. The officers already knew the truth, and Zeo laughed while the royal family, the citizens, and the lower-rank subordinates were stunned."}, {"type": "paragraph", "text": "When the Fish-Man Island citizens could not stand watching Hody's cruelty any longer, they started crying out for Monkey D. Luffy to destroy the island. Zeo commented on how desperate they were. When Hody prepared to kill Neptune, Luffy (who had been hiding inside Megalo) suddenly appeared and kicked Hody away. Zeo was shocked at Luffy's unexpected appearance."}, {"type": "paragraph", "text": "As the citizens cheered for Luffy, Zeo commented on how popular he had become. He tried to tell the Straw Hat Pirates not to get carried away, but they ignored him. After Luffy took out half of the New Fish-Man Pirates' army, Zeo rallied the rest of the crew by saying that there were still 50,000 of them and only ten enemies (Straw Hats and Jinbe)."}, {"type": "paragraph", "text": "Zeo later convinced Wadatsumi into fighting the Straw Hats and gives him an Energy Steroid. After Nami used Black Ball: Raiun Rod, Ikaros became enraged. Zeo calmed him down and pointed out how Sanji reacted when she lost her footing after Wadatsumi fell to the ground. Zeo figured that Nami is the crew's weakness. He camouflaged himself and grabbed her legs, setting her up to be speared by Ikaros's Dried Squid Spears, but Brook stepped in between her and Ikaros, taking the hit from the spear instead. However, the spear had no effect on Brook. After Franky punched away Ikaros, Brook accidentally stepped on Zeo's head. After revealing himself, he berated Brook and prepared to fight him."}, {"type": "paragraph", "text": "Zeo used his camouflage in an attempt to catch Brook by surprise, but by yelling out his attack name, Zeo revealed his location and was stabbed by the skeleton swordsman. Zeo then managed to catch Brook off-guard again and to decapitate him with one of the chains. However, to Zeo's shock, Brook used his newly trained powers to bring himself back together, and then launched an icy blade against the fish-man."}, {"type": "paragraph", "text": "After Hody's defeat was announced, some of the fish-man pirates started running away. Zeo responded by attacking them and telling them that if they do not fight, they can die in the name of their grudge. Brook stopped and chastised Zeo as he did not really know what dying is like. Brook said that he hates people who waste lives. Zeo retorted that even though the Straw Hats have remained calm with the threat of Noah, he still believed that they would die. Brook countered that they believe that Luffy will become the Pirate King and in that belief, there is nothing to be afraid of."}, {"type": "paragraph", "text": "Zeo drew a circle on the ground around himself, declaring it as his \"space\", and stated that Brook's bones were going to be crushed to bits if he entered it. Undeterred, Brook started humming a song and passed the circle and Zeo in an instant. As Zeo wondered how Brook got past him, he was then cut down by Brook's \"Kasuriuta: Fubuki Giri\". As the cold of the attack froze Zeo's blood solid, the fish-man fell to the ground, defeated. After the battle for Fish-Man Island ended, the officers of the New Fish-Man Pirates were locked up in the palace prison."}, {"type": "paragraph", "text": "Sometime later, he became conscious along with the other New Fish-Man leaders, and his body was old and weak like the others due to the Energy Steroids. He stated he grew old on purpose."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e2/Zeo_Stomped_On.png/revision/latest/scale-to-width-down/210?cb=20130724104431", "caption": "Zeo revealing himself after he was accidentally pummeled while invisible."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0e/Brook_Stands_on_Zeo.png/revision/latest/scale-to-width-down/210?cb=20130724105156", "caption": "Zeo holding Nami down while being stood on by Brook."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/Kasuriuta_Fubukigiri.png/revision/latest/scale-to-width-down/210?cb=20130925203713", "caption": "Zeo is defeated."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "New Fish-Man Pirates' Officers vs. Fukaboshi, Ryuboshi and Manboshi (unseen)", "elements": []}, {"text": "Zeo vs. Brook", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga when fighting Brook, Zeo uses two chains, but in the same scene in the anime, he uses only one chain."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name may be derived from ōse (オオセ, ōse), the Japanese name for the Japanese wobbegong.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Japanese Wobbegong – Wikipedia article about the type of fish-man Zeo is.", "elements": []}, {"text": "Chain weapon – Wikipedia article about weapons made of chains.", "elements": []}, {"text": "Kusari-fundo – Wikipedia article about a Japanese weighted chain weapon.", "elements": []}]}], "images": []}]}