{"sections": [{"title": "Gyro", "level": 1, "content": [{"type": "paragraph", "text": "Crab-Hand Gyro is the captain of the Gyro Pirates from South Blue that was on its way to the New World before an unfortunate meeting with the New Fish-Man Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Gyro is a skinny man of average height with a child-like, oval face, and a square nose. He has two red distinctive spots on his cheeks, dark hair, beard and mustache, he's missing a tooth and has what appears to be a massive four leaf clover on top of his head. He also has well-developed pectorals and abdominal muscles."}, {"type": "paragraph", "text": "He sports a bicorne adorned with his Jolly Roger, tied around his neck with a string, much like Luffy with his straw hat. He wears a partially unbuttoned black vest underneath a light blue captain's coat worn with the arms in the sleeves, with the left sleeve being cut right below his elbow, and has a large buckled belt hanging on his chest from his right shoulder. He wears striped pants reaching down to his calves, with many purple and white stripes at the ends, and sandals. He carries around a katana with him."}, {"type": "paragraph", "text": "His most distinctive feature, as well as the source of his epithet, is the giant crab claw where his left hand should be. It is orange and made of metal with spikes coming out of the arm. This is a weapon attachment, as his human arm is seen bitten off and floating next to him after being defeated by Hody Jones."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is a very logical man, as he knew he had to join the New Fish-Man Pirates, as he could not fight them underwater, and that it was better to flee when he and his crew had the chance, rather than to stay for Mermaid Cafe (as they all originally hoped) or fight against the Fish-Men. However, his past experience of fighting against Fish-Men gave him a sense of confidence against Hody when they were forced to fight him, and thought he could defeat the New Fish-Man Pirates captain, which led to his utter defeat instead."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the captain, he has command over his crew. Gyro stated that Hody Jones is not the first Fish-Man who he fought against, and that he overcame many dangers of Paradise, something proven by his presence on Fish-Man Island, which indicates some level of competence and experience."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is armed with a katana and as a pirate captain, he is presumably skilled in using it. His crab claw is assumed to be a weapon as well, as he was seen readying it to fend off Jones when the Fish-Man attacked his ship."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "At some point, he and his crew left South Blue and traveled through Paradise and eventually made it to Fish-Man Island. After escaping the Kraken, who was asleep at the time, he and his crew were forced to join the New Fish-Man Pirates under the same threat that Hammond gave to the Straw Hats: being servants or sinking before entering the island. He and his crew eventually found an opportunity to escape and took it. Gyro told one of his complaining subordinates to forget about the Mermaid Cafe and that they are never returning to Fish-Man Island."}, {"type": "paragraph", "text": "Before they can get very far, they were confronted by Hody Jones. With just his jaws, the Fish-Man gave the pirates a complete and utter defeat. Jones allowed them to live and sent them up to the surface in a bubble, telling them that when they resurface in the New World, they will tell the people on the surface about the Fish-Men."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/65/Hody_Attacking_Gyro_Pirates.png/revision/latest/scale-to-width-down/180?cb=20140807015655", "caption": "Hody attacks Gyro Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/16/Gyro%27s_Coated_Ship.png/revision/latest/scale-to-width-down/180?cb=20110121134939", "caption": "Gyro's crew left alive as an example."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 62 Chapter 611 (p. 3) and Episode 530, Gyro is introduced, his name's romanization on ship's sail.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 76), Gyro's birthday and crew name are introduced.", "elements": []}, {"text": "↑  One Piece Movie 14, Gyro's wanted poster is shown.", "elements": []}]}], "images": []}]}