{"sections": [{"title": "Ikaros Much", "level": 1, "content": [{"type": "paragraph", "text": "Ikaros Much is a giant squid fish-man and an officer of the New Fish-Man Pirates before their downfall and disbandment."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As a giant squid fish-man, Ikaros is extremely tall, towering over every other member of his crew, and possesses eight arms. Each pair of arms seems to have a corresponding pair of pectorals, as eight of them are visible on his chest. He has a long beard complete with a mustache, white skin, and a bulbous nose. On both his topmost forearms and on his belly he bears swirl-like tattoos, and on his right shoulder is tattooed the New Fish-Man Pirates' Jolly Roger. Underneath his helmet is his hair that is in the shape of a spear that he will use as a last resort."}, {"type": "paragraph", "text": "He wears a round helmet with goggles, with a dark stripe on top of it, and a large loop earring on each ear. He's bare-chested, but has a pair of suspenders-like belts reaching down from both of his shoulders to his waist. These are attached to a pair of rings, supporting some sort of light apron around his waist; he also dons dark pants reaching down below his knees and sandals. Each of his arms has a bolted wristband and holding a long spear with a tassel right below the head."}, {"type": "paragraph", "text": "As a teenager, he did not have a beard, his lips appeared larger and his eyes rounder, he wore a different, more elaborate round helmet, with a crest on its top and no goggles, paired with a simple vest. He also carried around a single pole-arm, instead of eight."}, {"type": "paragraph", "text": "Due to the negative effects of the Energy Steroids, his body became old and weak with his hair turning grey which now reaches the back of his neck and his beard becoming even longer as well. He also became very skinny."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He has a habit of saying \"Much\" at the end of sentences. Like Hody Jones and the other officers, he follows Arlong's ideals and despises humans as well as Queen Otohime's ideals. He was shown to be brutal as he used threats to force the Fish-Man Island citizens to step on the fumi-e of Otohime."}, {"type": "paragraph", "text": "Like Hody, Ikaros does not have any care for his comrades as he did not think twice about using his spears on one of them for accidentally using fire in his vicinity. However, that seems to apply only to the lower-rank subordinates since Ikaros showed concern for Hody as he was suffering from an overdose of Energy Steroids."}, {"type": "paragraph", "text": "Because of a traumatizing event, when his giant squid friend Daidalos died from dehydration by being too close to the sun, Ikaros has developed severe pyrophobia, and would instinctively curl up backwards when exposed to flames, in reference to dried squids. In related matter, Ikaros would also curl over like this when something else shocking appears in front of him, such as Nami deactivating her invisibility, and he seemingly despises the mentioning of dried squids, as he was annoyed when Luffy called the kraken \"Surume\" (dried squid)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Ikaros%27s_Fear_of_Fire.png/revision/latest/scale-to-width-down/210?cb=20141206190042", "caption": "Ikaros curled up from his pyrophobia (fear of fire)."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an officer of the New Fish-Man Pirates, Ikaros has command over lower-ranking crew members."}, {"type": "paragraph", "text": "Ikaros possesses tremendous willpower, being completely unfazed by Luffy's Haoshoku Haki burst."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Being a fish-man, he is born ten times stronger than an average human, and double that underwater. However, being an officer, as well as a massive kind of fish-man, he may be stronger than that. It was also implied by the citizens of Fish-Man Island that even his species alone was enough to be feared."}, {"type": "paragraph", "text": "His multiple arms allow him to rapidly strike his targets with sheer numerous strikes. Being a squid fish-man, Ikaros is also able to generate and manipulate ink, using it to create ink-clones."}, {"type": "paragraph", "text": "However, after the negative effects of the Energy Steroids took effect, he became weak and old, stripping him of all his strength."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Ikaros_Striking.png/revision/latest/scale-to-width-down/210?cb=20141206185919", "caption": "Ikaros striking an 'offender'."}]}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Ikaros no Tsubasa (イカロスの翼, Ikarosu no Tsubasa, literally meaning \"Wings of Ikaros\"): Ikaros spits at his opponent rapidly. The pun is \"tsuba\" within the technique's name, which is Japanese for \"spit\". This technique was first seen used against Franky. In the Viz manga and FUNimation subs, it is called The Wings of Ikaros.", "elements": []}]}, {"type": "list", "elements": [{"text": "Ikasumi Bunshin (イカスミ分身, Ikasumi Bunshin, literally meaning \"Squid Ink Clone\"): Ikaros creates a clone made of his own squid ink to trick his opponents. This technique was first seen used against Franky. In the FUNimation subs, Ikaros calls it his \"alter ego made from squid ink\" and Ink Double in the Viz manga.", "elements": []}]}, {"type": "list", "elements": [{"text": "Usubon no Yari (臼梵の槍, Usubon no Yari, literally meaning \"Mortar Vatican Spear\"): Ikaros takes off his helmet to reveal his hair is arranged in a spear formation. This spear then glows with a light via unknown means, and he impales his opponent with it. Ikaros claimed that it is his secret weapon, and it can pierce even undersea mountains. It was first used against Franky, though the attack never landed.Usu-bonyari (薄ぼんやり, Usu-bonyari) means misty or vague. This is called Light Bright Spear in the Viz manga and FUNimation sub.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Usubon_no_Yari.png/revision/latest/scale-to-width-down/210?cb=20130925203441", "caption": "Usubon no Yari"}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He is seen wielding eight spears, known as the Dried Squid Spears (スルメイカの槍, Surume Ika no Yari), one in each hand. He has yet to use them in extended combat, but may be proficient at using them; even their sheer number, however, might seemingly grant him the upper hand against most enemies. The heads of the spears are actually dried squids that suck the water out of anyone they pierce and turn back into normal squids in the process, as demonstrated when Ikaros stabs an offender. The weakness of these spears is that they utilize their function against enemies who do not have any bodily moisture content to absorb, such as the skeletal Brook or Franky when he was inside his exoskeleton."}], "images": []}, {"title": "Energy Steroids", "level": 3, "content": [{"type": "paragraph", "text": "Like the rest of the crew, Ikaros has taken the Energy Steroids during the battle against the three princes of Ryugu Kingdom, who are crowned the strongest soldiers in the entire island, and was able to overpower them due to this. The drug doubles his strength per pill, but shaves off a portion of his lifespan. This also had another side effect of making him old and weak after he was arrested, which made him lose the strength he naturally had."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Ikaros and the future officers were children, they witnessed human oppression against fish-men. While they were growing up in the Fish-Man District, they only learn one thing: hate humans. When they were teens, they read about Fisher Tiger's exploits at Mary Geoise. They cheered on the Sun Pirates, thinking that their goal was to destroy humans."}, {"type": "paragraph", "text": "After Hody joined the Neptune Army, the officers became a terrorist group that would kill any fish-men who sympathize with humans, especially those who willingly donate blood to them. After the assassination of Otohime, the officers celebrated."}, {"type": "paragraph", "text": "Ikaros once had a giant squid friend named Daidalos who got too close to the sun, dried up, and died. The incident severely traumatized Ikaros and made him pyrophobic to the point of throwing a fit when a torch is held near him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/Ikaros_and_Daidalos.png/revision/latest?cb=20130512012957", "caption": "Ikaros and Daidalos listening to grown-ups celebrate human bloodshed."}]}, {"title": "Fish-Man Island Arc", "level": 3, "content": [], "images": []}, {"title": "The New Fish-Man Pirates' Coup d'État", "level": 4, "content": [{"type": "paragraph", "text": "When Gyro and his crew escaped from the New Fish-Man Pirates' clutches, Ikaros offered to go after them, but Hody went instead. After Hody left, Ikaros was seen huddled together with the rest of the crew, commenting that they were lucky to get their hands on the Energy Steroids, which they considered to be a valuable treasure. He was later seen when Hody and Vander Decken IX formed their alliance."}, {"type": "paragraph", "text": "As Hody Jones and Vander Decken IX went to the palace, the officers spread terror at other locations. Ikaros went to Gyoverly Hills. As the invasion commenced, Ikaros forced the citizens of Fish-Man Island to step on a fumi-e of Queen Otohime."}, {"type": "paragraph", "text": "While a sea bear overwhelmed the ministers and the soldiers who escaped from the palace, Ikaros simply watched on the sidelines. Even after the ministers and the soldiers were utterly defeated, the sea bear kept attacking. One of the fish-man pirates remembered sea bears are afraid of fire and lighted a stick he was holding. The fire stopped the bear, but it also caused Ikaros to react to it."}, {"type": "paragraph", "text": "He yelled at the pirate to put out the fire as he bent over backwards, explaining that fire dries him out. Ikaros threatened to kill the pirate if he ever brought fire that close to him again. Another fish-man told a story about Much's friend, Daidalos, who went too close to the sun and got dried up. Ikaros was thinking about his friend while the story was being explained. He then took one of his spears and stabbed the offending fish-man. The dried squid that made up the head of the spear sucked the moisture out of the offender. Ikaros then pummeled the pirate with palm thrusts until he was completely flat."}, {"type": "paragraph", "text": "When Hody and Neptune passed by overhead on Sea Beasts, Ikaros saw that there was something wrong with his captain. He realized his captain was suffering from an Energy Steroid overdose and admitted that the pills were truly dangerous."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fa/Ikaros_Threatening_Citizens.png/revision/latest/scale-to-width-down/210?cb=20130515101407", "caption": "Ikaros forcing the citizens to either step on Otohime's fumi-e, be exiled, or be killed."}]}, {"title": "Battle for Fish-Man Island", "level": 4, "content": [{"type": "paragraph", "text": "After Hody's transformation, the New Fish-Man Pirates gathered at the plaza and the Neptune Army's attempts to save the king were thwarted by the Sea Beasts. When Zeo pointed out that a soldier was trying to blow them up, Ikaros was briefly worried. Hody stopped the soldier's attempt with Water Shot. After the three princes arrived and defeated the Sea Beasts, Ikaros and the other officers prepared for battle."}, {"type": "paragraph", "text": "Initially, the princes had the upper hand, but the officers turned the odds against them by taking Energy Steroids. They then defeated the princess and captured them. The New Fish-Man Pirates celebrated as the princes were placed right next to their father. After Jinbe and Shirahoshi were captured as well, Hody revealed to everyone that he was the one who truly killed Otohime. The officers already knew about the truth and Ikaros remained unfazed while the royal family, the citizens, and the lowering rank subordinates were stunned."}, {"type": "paragraph", "text": "When Hody was prepared to kill Neptune, Luffy (who had been hiding inside Megalo) suddenly appeared and kicked Hody away. When Jinbe was telling some people to hurry, Ikaros wondered who Jinbe was talking to. He was then shocked to see Nami suddenly appeared out of thin air."}, {"type": "paragraph", "text": "Once Ikaros saw Luffy approach his captain, he immediately jumped in front of him along with Dosun to stop him. Before Ikaros struck Luffy, Sanji jumped in and kicked him in the face and knocked him to the ground."}, {"type": "paragraph", "text": "He recovered and saw Nami electrocuting some of the fish-man pirates with her new weather staff. The heat from her attack triggered his \"dried squid\" reflex. Ikaros got enraged, but Zeo calmed him down. Zeo surmised that she was the Straw Hats' weak point due to Sanji's reaction to Watdatsumi almost falling on her. Zeo camouflaged himself and held down Nami's legs while Ikaros moved in to stab her with a squid spear. However, Brook intercepted the attack. Since Brook's a skeleton, his spears could not suck up any moisture from his body. Ikaros reeled in shock that such a person exists but was blindsided by Franky's \"General Franky\" mecha."}, {"type": "paragraph", "text": "Ikaros spit \"wings\" at Franky, who blocked with his metal arms and countered with a punch, though he only hit the Squid Ink Clone, which Ikaros began gloating about. However, Franky launched a fireball mid-sentence, forcing Ikaros to begin curling up again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/Zoro_and_Sanji_Block_Dosun_and_Ikaros_Much.png/revision/latest/scale-to-width-down/210?cb=20130525174932", "caption": "Ikaros and Dosun are blocked by Sanji and Zoro from attacking Luffy."}]}, {"title": "Defeat and Imprisonment", "level": 4, "content": [{"type": "paragraph", "text": "Ikaros then removed his helmet and revealed a spear at the tip of his head, which he planned to use to defeat Franky. After Franky exited the Iron Pirate robot, Ikaros charged at Franky. The cyborg fired a laser beam and defeated Ikaros. After the battle for Fish-Man Island ended, the officers of the New Fish-Man Pirates were locked up in the palace prison."}, {"type": "paragraph", "text": "Sometime later, he regained consciousness along with Hody and the other officers of the New Fish-Man Pirates and discovered his body was old and weak like the others due to the Energy Steroids. He commented that they would still pass their judgment on humans."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Franky_Radical_Beam.png/revision/latest/scale-to-width-down/200?cb=20140802120936", "caption": "Ikaros is defeated by Franky's new laser blast."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "New Fish-Man Pirates' Officers vs. Fukaboshi, Ryuboshi and Manboshi (unseen)", "elements": []}, {"text": "Ikaros Much vs. Sanji", "elements": []}, {"text": "Ikaros Much vs. Franky", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name comes from ika (イカ、烏賊), the Japanese word for \"squid\". It is also a reference to the Greek mythological figure Ikaros (more commonly known by the Latin spelling of his name, \"Icarus\").", "elements": []}, {"text": "His giant squid friend, Daidalos, dying from getting too close to the sun is also similar to the story of Icarus, who died after his wax wings melted when he flew too close to the sun, causing him to drown in the sea. This comparison is made further by the giant squid's name, the greek form of Icarus' father, Daedalus' name.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Giant squid – Wikipedia article on the type of fish-man Ikaros is.", "elements": []}]}], "images": []}]}