{"sections": [{"title": "Charlotte Lola", "level": 1, "content": [{"type": "paragraph", "text": "Charlotte Lola is the captain of the Rolling Pirates and the 23rd daughter and 53rd child of the Charlotte Family. Her mother is the Yonko Charlotte Linlin and her father is Linlin's 25th husband, Pound. She is the younger twin sister of Chiffon."}, {"type": "paragraph", "text": "She was Totto Land's Minister of Chocolate (チョコレート大臣, Chokorēto Daijin) before she ran away after being arranged to marry Prince Loki of Elbaf. Wanting to marry for love, she proposed so many times to the point of being called \"Marriage Proposal Lola\". She was a member of the Thriller Bark Victim's Association after her shadow was stolen by Gecko Moria and placed into a warthog zombie also named Lola."}, {"type": "paragraph", "text": "She is an ally of the Straw Hat Pirates during the Thriller Bark Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lola is a tall, corpulent woman with short and thin legs. She has small eyes and a pronounced nose above her large, shiny red lips, one missing tooth and a large head. Under a small black bowler hat, her pink hair is braided into two pigtails. After the timeskip, her pigtails are shown to be longer."}, {"type": "paragraph", "text": "She also bears a striking resemblance to her older twin sister, Charlotte Chiffon."}, {"type": "paragraph", "text": "In her younger years, Lola was fatter than she is currently, was not missing a tooth, and had her hair styled into a bob. She wore an orange bow in her hair and a peach colored dress with puffy sleeves."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Lola is a woman trying to find love though she rejected a proposal from Loki. She fled from an arranged marriage with him in order to find her own true love. As of the Thriller Bark Arc, she has proposed 4452 times, but she has been turned down each time. Prior to meeting the Straw Hats, she had proposed 4443 times. Upon seeing Luffy, she makes it 4444 times. She then later proposed to Sanji, Chopper, Usopp, Zoro (twice), Franky (twice), and Brook. Luckily, she takes rejection in stride and is not distraught by this."}, {"type": "paragraph", "text": "She is also rather honorable. This is seen when she refused to abandon the Straw Hats, her crew's shining star of hope, even when she was being vaporized by the rising sun. Lola also initially said that she would never dream of taking treasure from her saviors until Nami revealed her friendship with the former's shadow zombie."}, {"type": "paragraph", "text": "According to Chiffon, Lola has a happy-go-lucky personality, making her very optimistic and naive due to her carefree nature, as she believed that despite her mother's immense ruthlessness, Big Mom would still care for her. This led her to give a piece of Linlin's Vivre Card to Nami, under the belief that her mother would help the Straw Hats for her sake, not knowing that Big Mom holds a grudge on her for ruining a possible alliance with the giants."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Lola showed good skills as a captain by keeping her crew away from the sunlight when light was hitting Thriller Bark. Since her pirate crew has suffered much in the last 3 years together, they are very close with each other."}], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Pound", "level": 4, "content": [{"type": "paragraph", "text": "Pound is Lola's father. Even though Lola ran away from the Charlotte Family, he still considers her very dear to him. However, because Linlin cast Pound away after her birth, Lola never got the chance to meet her father."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "Lola's mother is one of the Yonko, Charlotte Linlin, also known as \"Big Mom\". When Lola ran away from Totto Land to escape a political marriage with Prince Loki of Elbaf, Lola was certain that her mother, despite her ruthless reputation, would not punish her because they were family. When she gave the Straw Hats her mother's vivre card, Lola showed concern and fondness for her mother and assured the Straw Hats that she would help them if they ran into trouble."}, {"type": "paragraph", "text": "Contrary to what Lola believed, Linlin lost all affection for her estranged daughter for running away from the arranged marriage with Loki, which ruined Linlin's chance to make peace with the giants and gain the means to become Pirate King. Linlin labelled Lola as a criminal of Totto Land and would have her executed if she returns. When Nami spoke of her friendship with Lola to Big Mom, Linlin expressed utter hatred for her daughter and stated that she would never forgive her, even preparing to send an assassin to kill Lola once finding out of her whereabouts. Big Mom was furious to hear that Lola even still considered her family, saying that Lola truly did not understand how her mother feels. In fact, Big Mom's hatred for Lola is so immense that she would go into a berserker like rage just from seeing Lola's image in her identical twin sister Chiffon whenever she sees her, and brutally abused Chiffon to vent her anger towards Lola."}], "images": []}, {"title": "Charlotte Chiffon", "level": 4, "content": [{"type": "paragraph", "text": "Lola is Chiffon's only full sister, and one of the few people that Chiffon considers to be true family. One of the reasons that Chiffon is participating in the plot against Big Mom is because she knows Lola is in danger from their mother. She is also aware of Lola's personality and correctly guessed that her twin sister is completely ignorant of their mother's murderous rage towards her. Despite being mistreated due to Lola's actions, Chiffon never blamed her sister for it, instead expressed happiness that Lola was doing fine."}], "images": []}, {"title": "Charlotte Pudding", "level": 4, "content": [{"type": "paragraph", "text": "Pudding talked admirably about how Lola left the family to find her own groom, and wished to be able to follow this path. When Lola left, the two seemed to part amiably. Pudding does think highly of Lola as she refused to take her place as Minister of Chocolate, believing that Lola was fit for the role."}], "images": []}, {"title": "Other Siblings", "level": 4, "content": [{"type": "paragraph", "text": "The extent of Lola's relationship with her siblings is unknown, but the ones who were listening to Big Mom's conversation with Luffy and Nami did not express any concern when Big Mom revealed her hatred for Lola. Charlotte Opera was even prepared to torture Nami for Lola's location, knowing what Big Mom planned to do after acquiring that information."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Monkey D. Luffy is on good terms with Lola, who assisted him in his fight against Gecko Moria by empowering him with shadows. Lola, along with every one of her comrades and allies, refused to hand over Luffy to Bartholomew Kuma when he offered to spare everyone else in exchange."}, {"type": "paragraph", "text": "When Big Mom expressed her hatred for Lola, Luffy defended the latter by saying that Lola made her own decision and that it was Big Mom's own fault for not becoming Pirate King."}], "images": []}, {"title": "Nami", "level": 4, "content": [{"type": "paragraph", "text": "Lola formed a sisterly bond with Nami during the events of the Thriller Bark Arc, mostly because of Nami's interaction with her zombie. Through her zombie's actions, the two are very close and when they finally met up, Nami instantly recognized Lola. Lola likewise, acknowledged that there was something about Nami she recognized, but could not explain why that was. Lola also called Nami \"Namizo\" upon her exit from Thriller Bark, despite the fact that Nami had told her zombie, not her, this fake name. The two have since become good friends with one another, with Nami even sharing her treasure with her in appreciation for her help. Nami later became horrified for Lola's life when Big Mom reveals her intent to kill her. When Opera demanded Lola's location from Nami, she refused to reveal it even when he was going to torture her."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Gecko Moria", "level": 4, "content": [{"type": "paragraph", "text": "Lola had a grudge against Moria for stealing her crew's shadows. She remained on Thriller Bark, fighting back by purifying zombies and stealing shadows. She even mustered the courage to threaten Moria when he was weakened."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Loki", "level": 4, "content": [{"type": "paragraph", "text": "Even though Lola is a daughter of Charlotte Linlin, the giants' mortal enemy, Loki fell in love with her at first sight. Disregarding his people's long-time hatred for Linlin, Loki swiftly proposed to Lola, and a political marriage was arranged. However, Lola did not reciprocate the prince's feelings and ran away in order to find her own true love."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Although outmatched by Gecko Moria, Lola is crafty enough to research his abilities to fight back. Lola possessed her mother's Vivre Card containing her powerful soul energy and is capable of influencing the homies. It is unknown how Lola got it into her possession since all of Charlotte Linlin's children are not allowed to have it."}, {"type": "paragraph", "text": "Before she ran away from Totto Land, she had authority over Cacao Island as the Minister of Chocolate. She was a famous chocolatier, and Pudding, who is a highly talented chocolatier herself, held utmost respect for Lola's skills."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Lola carries two katanas on her back at all times, and her zombie is proficient with swords, showing she has skill as a swordswoman."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "26 years ago, Lola was born to Charlotte Linlin and Pound alongside Chiffon as a set of twins, being the younger sister, although neither Lola nor Chiffon met their father due to Linlin expelling him right after the twins were born. She grew up to become a chocolatier and the Minister of Chocolate, overseeing Cacao Island. When Prince Loki of Elbaf proposed to Lola, her mother arranged a marriage between him and Lola. Not wanting to go through with this wedding, Lola left so she could find a husband of her own choosing. Before leaving, Lola told her sister, Charlotte Pudding, not to worry about her, certain that their mother would not kill her. Lola and her crew traveled over into the first half of the Grand Line. During their adventures, they passed through Fish-Man Island."}, {"type": "paragraph", "text": "Lola then came to Thriller Bark five years ago with her crew. Upon entry to Thriller Bark, her shadow and those of her crew were promptly stolen. After having lost their shadows, the crew took to wandering the forest along with the many other members of the Thriller Bark Victim's Association. While trying to find a way to get their shadows back, Lola and the other victims discovered a major weakness in Moria's Devil Fruit abilities that they could exploit."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/db/Young_Lola.png/revision/latest/scale-to-width-down/200?cb=20171112035442", "caption": "Lola talking to Pudding about her leaving to find a husband on her own."}]}, {"title": "Thriller Bark Saga", "level": 3, "content": [], "images": []}, {"title": "Thriller Bark Arc", "level": 4, "content": [{"type": "paragraph", "text": "After three years of waiting in eternal darkness, the prayers of Lola and the other victims were finally answered when Luffy and his crew came to Thriller Bark. After Luffy accepted the request of the chairman of the victim's association, Spoil, to get back their shadows, Lola and the other victims were given hope as Luffy and his crew wrecked havoc across Thriller Bark and purified several zombies."}, {"type": "paragraph", "text": "While all this was going on, the Thriller Bark Victim's Association had been collecting purified shadows. After several events, Luffy was misled into the forest by Moria. Lola's crew members, the Risky Brothers, luckily found Luffy and lead him to Lola. Meeting Luffy, Lola tried to ask for his hand in marriage but was unfortunately rejected again for 4444th time. Putting aside her marriage plans, Lola, as well as the other victims, thanked Luffy for all that he and his crew had done so far on the island as nothing like it had ever happened before in the past. They then, however, told Luffy that things were not over and had just gotten worse as Moria was now aiding his Special Ranked Zombie, Oars, in his fight against the rest of the Straw Hats. For this, Lola and the other victims decided to give Luffy some help in order to defeat Moria. Lola then demonstrated and explained how Moria's powers could be used against him by inserting the shadow of sword-proficient Marine into Luffy. Lola and the other victims then give Luffy all of the shadows they had captured. Surprised by the result of their action of implanting one hundred shadows into Luffy, Lola and the other victims wished Luffy luck in giving Moria a \"real nightmare\"."}, {"type": "paragraph", "text": "With Luffy battling Oars and Moria, Lola and the majority of the Thriller Bark Victim's Association decided to help Brook and the Straw Hats who were knocked out by Oars and Moria. With Nami and Usopp who had then joined them, Lola and the other victims witnessed Luffy pummel Oars and Moria with Gomu Gomu no Storm. Overjoyed by this, they decided to come to the aid of the wiped out Luffy. Lola and the other victims' joy however was short lived as Oars decided to rise back up again. Fortunately however, the Straw Hats and Brook were able to muster up their strength and finally defeat Oars by shattering his spine with their combined teamwork."}, {"type": "paragraph", "text": "With Oars completely unable to move any further, Lola then threatened Moria to give back all of their shadows or else he would be further pummeled by Luffy and company. Moria however was not intimidated and decided to absorb all of his zombies' shadows into himself, including Lola's own shadow. With these, Lola and the rest witness Moria transform into a gigantic lizard-like form with immense power. As the other victims saw this monstrosity and realized that there was no more time before morning finally dawned on Thriller Bark, they decided to hide in whatever shade was left. Lola however decided to not seek shelter with the rest of them. Seeing the Straw Hats face off against Moria despite the odds, she decided to stay there and watch them or else she would feel ashamed for dragging them into her and the other victims' problem. With some last words to her crew telling them that she will watch in their place, and some sunlight burning across her face, Lola stayed where she was to witness the battle."}, {"type": "paragraph", "text": "Despite the pleas of the other victims and her crew, Lola stood firm as she watched Luffy battle against the monstrosity that was now Moria. She stated to them that whether she disintegrates or not, she will not return to hiding in the shade. As Luffy delivered some powerful blows onto Moria and made him spew out some Shadows, Lola called out to her shadow to come back to her. Luffy also followed Lola's example and called out to his shadow as he delivered one last attack onto Moria. With one last powerful attack from Luffy, Moria spewed out all the shadows he had stolen including Lola's. Just as dawn finally arrived and sunlight engulfed all of Thriller Bark, Lola's and everybody's shadows fortunately returned back to them just in time."}, {"type": "paragraph", "text": "With her and the rest of the Thriller Bark Victim's Association's shadows returned to normal, Lola, along with Spoil and the rest of the association, thanked the Straw Hats. In thanks, Lola offered herself to be the bride of any of the male Straw Hats. She was fortunately and expectedly turned down. Despite Moria being defeated, Lola and everybody's celebrations were cut short. She and everybody else noticed the Shichibukai, Bartholomew Kuma, standing nearby and receiving orders to eradicate everybody on Thriller Bark. Lola had heard of Kuma's past reputation and strength, and thus tried to tell everyone to stay back. Her efforts were in vain and some of the association's members were defeated by Kuma's Devil Fruit powers."}, {"type": "paragraph", "text": "Despite the foe before them, Lola and the rest of the Thriller Bark Victim's Association decided to fight against Kuma for their freedom. Zoro however told them to stay back and started fighting against Kuma. As Lola and the rest of the association witnessed Kuma fight with the Straw Hats with more of his powers, they were given an offer by the Shichibukai. He offered that if they and the rest of the Straw Hats surrendered Luffy to him and the World Government, he would allow all of them to live. Lola and everybody else however did not agree to this offer and responded to Kuma with a loud simultaneous no. In response, Kuma let lose a massive pressurized air attack on all of Thriller Bark."}, {"type": "paragraph", "text": "Kuma's attack devastated the entire island and left almost everyone knocked out by the blast. After some moments of unconsciousness, Lola and those knocked out recovered from the attack. Seeing that Kuma wasn't around, Lola and most of the others figured that Kuma must have mistakenly thought that they were all killed in the blast and left."}, {"type": "paragraph", "text": "After one day of recuperating from all of the excitement, Lola went to the Thousand Sunny to see how her saviors were doing. There she saw that their ship was loaded up with food and treasure. As she was talking with them, she slightly recognized Nami despite not knowing her personally. Lola recognized her from some faint memories experienced from her shadow. Upon Nami realizing who Lola was, Lola was embraced by her and given some treasure from the pirate. Lola then went along with the Straw Hats to where the rest of the Thriller Bark Victim's Association was sunbathing, and to where Zoro was being treated by Chopper. Within the sunlit ruins of Thriller Bark's Mast Mansion, Lola and everyone within celebrated with a feast that was accompanied by Brook playing the piano."}, {"type": "paragraph", "text": "After two more days of partying, Lola was told by Franky that he had fixed Brook's ship and that she and the rest of the Thriller Bark Victim's Association can use it to get off Thriller Bark. Happy about how much more the Straw Hats helped them with this kind gesture, she asked Franky to marry her. He however turned her down saying that since she was a fine gem and he was too super, the match would not be good. As preparations for the Straw Hats next voyage were going underhand and the discussion of Fish-Man Island was brought up, Lola was then asked by Nami why she and the rest knew so much about the place. Lola explained that before she and her crew landed on Thriller Bark, they had come from the New World through Fish-Man Island. Seeing that Nami was going to New World, Lola tore a piece of her mother's Vivre Card and gave it to Nami. She explained how the piece of paper worked and how it would help Nami in the New World by pointing to where Lola's mother, a famous pirate, was. As Lola explained this to Nami, Luffy took out the Vivre Card that Ace gave him and showed it to Lola and the rest. Upon seeing the burnt state that it was in however, Lola and the rest were shocked and were worried by the sight."}, {"type": "paragraph", "text": "Despite seeing the shriveled up Vivre Card, this did not deter Lola and the rest of the Thriller Bark Victim's Association from bidding a happy farewell to their saviors. As the Straw Hats sailed off, Lola thought she saw something move within the fog of the Florian Triangle that was behind Thriller Bark. Despite this phenomenon, Lola decided that it did not matter, as she and her companions decided then that they would never return to such a dark place ever again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c2/Lola_and_Risky_Brothers_Shocked.png/revision/latest/scale-to-width-down/200?cb=20140916082452", "caption": "Lola and the Risky Brothers are shocked with the result of their plan."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Lola_Disappearing.png/revision/latest/scale-to-width-down/200?cb=20140915114153", "caption": "Lola calls for her shadow."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Lola_Gives_Nami_Her_Mother%27s_Vivre_Card.png/revision/latest/scale-to-width-down/200?cb=20140610190552", "caption": "Lola gives Nami a piece of her mother's vivre card."}]}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Two years after leaving the Florian Triangle, Lola and the Risky Brothers visited Mozu and Kiwi at their bar in Water 7."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Rolling_Pirates_Post_Timeskip.png/revision/latest/scale-to-width-down/200?cb=20130422132819", "caption": "Lola and the Risky Brothers at the bar."}]}, {"title": "\"Gang\" Bege's Oh My Family", "level": 3, "content": [{"type": "paragraph", "text": "According to a citizen of Dressrosa, Lola was at Dressrosa a few days before Chiffon and the Fire Tank Pirates arrived."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Even though she is the second person to give a member of the Straw Hat Pirates a Vivre Card, she is the first to give them an explanation about what they are.", "elements": []}, {"text": "She is the first of Big Mom's children to appear in the series.", "elements": []}, {"text": "In SBS Volume 69, a fan asked Oda what would happen if Lola ate the Sube Sube no Mi.", "elements": []}, {"text": "She shares the same voice actress as her twin sister Chiffon.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/80/SBS69_Sube_Sube_Lola.png/revision/latest/scale-to-width-down/200?cb=20140304154619", "caption": "Lola's appearance if she ate the Sube Sube no Mi."}]}]}