{"sections": [{"title": "Momonga", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Momonga is a Marine officer and the Base Commander of the G-1 Marine Base. He was one of the five vice admirals who had led the Buster Call on Enies Lobby."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Momonga is a man with a black mohawk and a mustache (dark red in the anime). He wears the standard marine uniform, consisting of a purple and white pinstripe suit with a coat draped over his shoulders, like Kizaru. Underneath his coat lies a dark blue shirt and a light blue tie. He is of average height and very well-built. He carries around his weapon of choice, a katana, either attached to his right hip or on his shoulder. In his youth, he was wearing a marine cap and lacked his mustache."}, {"type": "paragraph", "text": "Twenty-seven years ago Momonga looked the same, except his mustache was much longer and thinner, and his mohawk was arranged in a different style, pointing forward."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Momonga is very serious. He is stern and dead set on completing all of his missions. As of yet, it is uncertain what type of \"Justice\" he follows, although he appears to be sincerely concerned on the welfare of his subordinates. However, he is sometimes easily annoyed by their incompetence, as seen when they quickly fell for Hancock's charms."}, {"type": "paragraph", "text": "He is apparently instinctive, being that he figured out a way to block the effects of Boa Hancock's Mero Mero Mellow beam in mere seconds. Although he is not completely immune to her beauty, he is at least resilient enough to not be completely captivated by her charms."}, {"type": "paragraph", "text": "Momonga also appears to value etiquette and civility, as he was quickly disgusted by the atrocious behavior of many despicable Level 6 inmates in Impel Down when a large number of them began hooting and hollering at the sight of Boa Hancock and said disgusting things to Magellan, which he found highly undignified and vulgar."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral within the marines, Momonga has respectable abilities in both mind and body. When he waits to \"collect\" Hancock, he kills a Sea King from the inside. Similarly, he is able to block Hancock's Devil Fruit abilities by stabbing his hand with a knife, using pain to block the lust that consumed the rest of his crew and turned them into stone. Hancock stated that it was his experience that prevented him from being affected by her power. Momonga also leaves Hancock with a warning that even without his men he is still dangerous."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Momonga has incredible strength as he was able to easily kill a Sea King which is tough enough to resist gunfire and cannonballs without taking any damage. Momonga is also extremely agile, as shortly after he dived inside the Sea King's stomach through the mouth, he swiftly killed it. He has a strong tolerance to pain as he readily stabbed his own hand to resist the effects of Hancock's petrification powers."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "Momonga can use at least two of the Rokushiki techniques. During the Battle of Marineford, he is seen using Soru and Geppo against Monkey D. Luffy."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Momonga is a highly proficient and powerful swordsman, as seen when he could kill a Sea King with his sword from the inside of its belly. He is seen employing swordsmanship with his Rokushiki techniques. In the anime, he could cleanly slice Panz Fry's gigantic soup ladle made of metal and also take down the giant in a single slash."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Momonga carries around a katana with a flower-shaped tsuba and a brown hilt-wrapping, attached to his right hip, which may suggest that he's either left-handed or ambidextrous."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It is stated that all vice admirals possess Haki, so Momonga can also use the ability."}, {"type": "paragraph", "text": "Momonga possesses the ability to use Busoshoku and Kenbunshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "After a Buster Call attack has been ordered on Enies Lobby, Momonga and fellow vice admirals Onigumo, Doberman, Strawberry, and Yamakaji are suddenly summoned by John Giant to lead the attack as they were the closest to the location during that time, not knowing that the order was an accident caused by CP9 Director Spandam, who accidentally pressed the golden Den Den Mushi, \"given\" to him by Aokiji, while retreating from the Straw Hat Pirates and their allies. Thus, Momonga and his fellow Marines set the entire judiciary island on fire with their cannons. Though the Buster Call attack is able to practically destroy almost everything on the island, Momonga and his fellow Marines aren't able to annihilate a single one of the Straw Hats and their allies. Having destroyed an important World Government base and not dealt any significant damage to the invaders that were causing the disturbance there, Momonga and his fellow Marines are faced with a devastating defeat."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Receiving orders to retrieve the Shichibukai Boa Hancock, and take her to the compulsory Shichibukai summoning to prepare for an attack from Whitebeard should he attempt to rescue the captured Portgas D. Ace from being executed, Momonga and his men take a battleship to the Calm Belt where Hancock's home, Amazon Lily, is. Knowing the treaty the World Government has with the Kuja of the island stating that they weren't allowed within three kilometers near the island, Momonga and his men anchor in the middle of the Calm Belt and wait for Hancock. Although their presence is masked by the Seastone that lined the bottom of their battleship, they are still attacked by a Sea King that not even their guns nor cannons could defeat. Fortunately, Momonga is able to slice the monster up from within and save his men."}, {"type": "paragraph", "text": "Eventually, they are able to meet with the Kuja Pirates. Tired of waiting for Hancock, Momonga demands the Pirate Empress to come out, to which she complied alongside her sisters. Telling her that Ace would be executed at Marineford in a week, he gives her an order from the Marines to come with him since she had complied with the summons. Learning that she had simply lied about supporting the World Government during this critical moment, Momonga threatens to have her Shichibukai status revoked unless she complies. Instead of a compliance, Momonga and his men receive her continued refusal and a taste of her powers. Momonga is able to guard himself from her powers by stabbing himself, but his men aren't as fortunate and are turned into stone. With only himself left, Momonga tells Hancock that he will wait for her to come with him as long as he can. With a determination to not return empty-handed, he tells her that after two days, if she does not comply by then, the treaty with the Kuja would be broken."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6c/Momonga_Stabbing_his_Hand.png/revision/latest/scale-to-width-down/210?cb=20180628010403", "caption": "Momonga as the only \"survivor\" of the Mero Mero Mellow."}]}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "After waiting diligently and fighting off another Sea King, Momonga's vigilance pays off; Hancock decides to travel with him to Marineford, with the condition that they visit Impel Down on the way (her given reason being that she wants to see the one responsible for the war). Momonga complies after Hancock returns his crew back to normal, and having completed his mission, Momonga and his crew head to Impel Down, not knowing that someone else was tagging along. Arriving at Impel Down, some members of his crew tell him that they saw pirates that they remembered seeing before. But because they could not remember the crew's name, he says that it is not important. So, they keep moving forward. Arriving at Impel Down, the Marines stationed there see him and his crew and let them in as he, Hancock, and the unknown stowaway who is in her cloak get off the boat, and walk towards the gate. Momonga tells Hancock that because she is still a pirate, she must wear seastone handcuffs and undergo a full body-check before they could go in. She agrees and they enter Impel Down."}, {"type": "paragraph", "text": "Inside, they meet Vice Warden Hannyabal, who takes him and Hancock to a lift to meet the prison warden on the fourth floor. After meeting Ace, Momonga leaves with Hancock, and is told by Zott that Kaido had attempted to attack Whitebeard, only to be intercepted by Shanks. They then head for Marineford."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Momonga_and_Hancock_in_Impel_Down.png/revision/latest/scale-to-width-down/230?cb=20100822223807", "caption": "Momonga and Hancock arrive at Impel Down."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Three hours before Ace's execution, he was seen listening to Sengoku's speech about Ace's past. He was later seen slashing cannon balls fired by the Whitebeard Pirates and preparing to fight them. Momonga was still standing alongside Doberman and other vice admirals when Whitebeard attacked the Marines after reaching the plaza. When Monkey D. Luffy managed to pass the wall and almost reach Ace, Momonga was among the Marines that stopped and nearly killed him. He hit Luffy with his sword, demonstrating a great ability in semi-aerial sword fights. In the anime, Doma fought him when he tried attacking Luffy again. He was visibly-shocked when Garp was defeated by Luffy."}, {"type": "paragraph", "text": "When Luffy managed to free his brother, Momonga was seen opposing Donquixote Doflamingo, who wanted to let the two of them escape in order to have more fun, while Momonga clearly wanted to stop them."}, {"type": "paragraph", "text": "After Shanks arrived and called for a ceasefire, Momonga is seen standing down along with the other Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d0/Momonga_Slashes_Luffy.png/revision/latest/scale-to-width-down/210?cb=20130627060004", "caption": "Momonga slices Luffy with his sword."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "Momonga was seen at the G-1 base in Marineford when a Marine officer reported to him that the \"Straw Hat Pirates\" were recruiting new crew members at the Sabaody Archipelago. Having heard the news, Momonga ordered his subordinates to contact Headquarters and assemble forces immediately."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e5/Momonga_at_G-1.png/revision/latest/scale-to-width-down/210?cb=20150315160423", "caption": "Momonga at G-1."}]}, {"title": "Z's Ambition Arc", "level": 3, "content": [{"type": "paragraph", "text": "Momonga is tasked with transporting Panz Fry across the Maubeugemour Sea to Impel Down. He is first seen asking the giant why he was on board the government's cargo ship, and Panz Fry replies saying that he was just trying to provide for the people who the Marines had stolen food from to supply the World Nobles' nightly feasts, and that he had to do that because the New World had been in chaos since Whitebeard's death. Momonga counters by saying that the pirates were the ones responsible for the world's imbalance, not the Marines, and the two agree that they have irreconcilable views."}, {"type": "paragraph", "text": "Zoro defends against Momonga. Shortly after this, the Straw Hat Pirates emerge and attempt to free Panz Fry. Momonga attacks Luffy and then gets in intercepted by Zoro, who is able to put up a good fight against him. Suddenly Shuzo appears and Momonga comments on how he knows him. Shuzo says he wasn't aware he was on board, and asks him if he is a vice admiral now. Momonga asks Shuzo if he has been the one responsible behind the pirate raids to which Shuzo proudly confesses and announces he intends to cut off Panz Fry's head. Momonga asks why he is doing this if he used to be a former Marine, to which Shuzo replies that he is doing it for the sake of Z, which surprises Momonga. Shuzo says he will kill all of them right then and there and tells Alpacacino to kill Panz Fry."}, {"type": "paragraph", "text": "Right before Alpacachino's cannonballs reach Panz Fry, Momonga cuts the cannonballs in half, saving Panz Fry. He then tells Shuzo that he will not allow the Neo Marines to have their way as long as he is commanding that ship. Sanji chimes in finding him very sensible for a Marine soldier, earning disgust from Shuzo calling the Marines shameful. Momonga angrily tells him to shut up. As the two are about to fight, Luffy approaches them both announcing he doesn't care about their dispute and will stop at nothing to rescue Lily's father, challenging them both."}, {"type": "paragraph", "text": "When Shuzo and Luffy begin battling, Momonga charges them both announcing he will not let them do as they wish on his ship. Zoro then intercepts him again, pushing him back. The two begin a fierce fight, as Zoro uses 360 Pound Phoenix technique, managing to overwhelm him but pushes the force of the slice away, destroying one of the warships. Shuzo and Momonga then combine their efforts against the Straw Hats together to try and defeat them."}, {"type": "paragraph", "text": "A Thrust Up Stream charges beneath the raft and blows it apart, ending the fight between the three as the Straw Hats escape with the prisoner. Afterwards, Momonga is seen with his remaining crew on a capsized warship. Shuzo returns from his sub to finish their fight as the two battle one last time, destroying the capsized ship. The outcome of the fight is unknown. Still afterwards Shuzo is seen to have returned to his ship, indicating that he had beaten Momonga."}, {"type": "paragraph", "text": "Momonga catches up to Shuzo and his remaining soldiers and captures him after they are defeated by the Straw Hat Pirates. Shuzo is surprised he survived their fight and asks how he found him. Momonga tells him he used the same trick he used on the Straw Hats. He put a Vivre Card on Panz Fry to track him, a method of tracking pirates he learned from a teacher a long time ago. He berates Shuzo for dragging the Marines into their personal vendetta against pirates and announces he is being sent to Impel Down. Shuzo tells him he'll never talk no matter how much he is tortured and demands he kill him now while they are still in the New World. Momonga tells him that's up to the law to decide, and that is how the Marine's Justice works."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/93/Momonga_Clashes_with_Zoro.png/revision/latest/scale-to-width-down/210?cb=20131214220956", "caption": "Momonga vs. Zoro"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ca/Shuzo_Clashes_with_Momonga.png/revision/latest/scale-to-width-down/210?cb=20130628210017", "caption": "Shuzo vs Momonga."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Momonga_Captures_Shuzo_and_his_Crew.png/revision/latest/scale-to-width-down/210?cb=20131203225746", "caption": "Momonga captures Shuzo and his crew."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Momonga was present at New Marineford when the Marines intercepted a communication between Big Mom and Kaido."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Momonga vs. Boa Hancock", "elements": []}, {"text": "Marines and Shichibukai vs. Whitebeard Pirates and their Allies", "elements": []}, {"text": "Momonga and Dalmatian vs. Monkey D. Luffy", "elements": []}]}], "images": []}, {"title": "Non-Canon Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Momonga vs. Doma", "elements": []}, {"text": "Momonga vs. Panz Fry", "elements": []}, {"text": "Momonga vs. Monkey D. Luffy and Roronoa Zoro", "elements": []}, {"text": "Momonga vs. Shuzo", "elements": []}]}], "images": []}, {"title": "Manga and Anime Differences", "level": 2, "content": [], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "In the anime version of the Marineford Arc, Momonga is seen fighting Doma."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b1/Momonga_Clashes_with_Doma.png/revision/latest/scale-to-width-down/230?cb=20101214143104", "caption": "Momonga vs. Doma."}]}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "In manga version of the Return to Sabaody arc, Momonga was seen commanding troops at G-1. In the anime version, he was replaced with a somewhat similar looking unnamed Marine officer."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d6/G-1_commander.png/revision/latest/scale-to-width-down/210?cb=20150308230045", "caption": "The unnamed Marine officer in the anime."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His Marine code is G-1 00660.", "elements": []}, {"text": "His entire crew temporarily had mohawk hairstyles like Momonga after being surprised by Hancock's behavior.", "elements": []}]}], "images": []}]}