{"sections": [{"title": "Strawberry", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Strawberry is a Marine officer, and one of the five vice admirals who led the Buster Call assault on Enies Lobby."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Strawberry is a relatively straight shaped person with a long beard. He is usually seen with his eyes closed, or at least half-closed. He wears a very long bearskin version of the standard Marine uniform cap due to his head being abnormally long. Like many high-ranking Marines, he has a standard Marine's coat draped on his shoulders like a cape. Under it, and over a shirt left unbuttoned near the neck, he wears a water-green jacket, with pale yellow rope-like ornaments on the chest, and matching pants."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is somewhat scrupulous, doing what is morally right by saving everyone trapped on Enies Lobby before attacking. Therefore, he presumably follows moral justice, or at least a more lenient version of Absolute Justice, like most Marines. Nonetheless, 13 years ago, he saw the slaves of the World Nobles as their property with his duty to bring them back, and did not show any sympathy that said slave was a young girl."}, {"type": "paragraph", "text": "He is also usually seen with a calm expression."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine vice admiral, Strawberry is capable of commanding a Buster Call alongside other vice admirals. He also has authority over lower-ranking subordinates."}, {"type": "paragraph", "text": "Due to the large size of his head, he has very strong headbutts."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Strawberry was shown holding two identical swords with Japanese-looking hilts wrapped in a pink material. They have elongated hand-guards decorated by red gems, just like the rounded pommels, and blades with more of a curve than those of katanas. He wields both of them in reverse, similar to Doma."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Strawberry can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "While the Sun Pirates were wreaking havoc in the seas, Rear Admiral Strawberry reported to Vice Admiral Borsalino that Rear Admiral Kadar's ship had been sunk."}, {"type": "paragraph", "text": "Later, after the Marines received a tip regarding the arrival of the Sun Pirates to return a girl on board, he led an army of soldiers to ambush Fisher Tiger on Foolshout Island which ultimately delivered the fatal blow that would lead to the end of his life. Jinbe appeared right after and did battle with him. In the anime their battle is briefly extended showing the two trading blows, hitting both with Haki power scattering nearby Marines aside. In the end Jinbe defeated him and left him with his wounds as he tended to his captain's body. Sometime after Jinbe became the new captain of the Sun Pirates, Strawberry, now covered in head bandages after his battle with Jinbe, went to Marineford and informed his superiors about Jinbe and his strength."}], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Strawberry, along with four other vice admirals, were summoned to Enies Lobby from the Buster Call signal. His main act, during the Buster Call, was to order three ships to open fire on Oimo, Kashi, the Galley-La Company shipwrights and the Franky Family. However, the attack proved to be useless, as they were saved by clinging on the side of the island using a net made by Paulie. He, along with the other vice admirals attempted to corner the Straw Hats at the Bridge of Hesitation, but their attempts to recapture Nico Robin and kill Monkey D. Luffy were in vain, leaving Enies Lobby in ruin."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b4/Strawberry_VA.png/revision/latest/scale-to-width-down/240?cb=20121109132141", "caption": "Strawberry at Enies Lobby."}]}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "He is later seen heeding the call for troops at Marineford and standing along with the other vice admirals against the incoming attack by Whitebeard's division commanders, wielding two katana in a similar stance to Kaku's way of wielding swords. When the pirates in the bay lost their ships, Strawberry ordered the troops to open fire on them, claiming them to be perfect targets. Later, when Luffy attempted to free Ace from his handcuffs, Strawberry gave another order to open fire on the two pirates."}, {"type": "paragraph", "text": "When the Blackbeard Pirates arrived, he is shocked to see Marshall D. Teach's new crewmates, the strongest prisoners from Level 6 of Impel Down. He recognizes Sanjuan Wolf because of his immense size."}], "images": []}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the Levely, Strawberry was present at Red Port eating alongside his fellow vice admirals after the Marines intercepted a communication between Kaido and Big Mom concerning Monkey D. Luffy while Gion scolded Garp over his lack of concern."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Strawberry and Marines vs. Fisher Tiger", "elements": []}, {"text": "Marines and Shichibukai vs. Whitebeard Pirates and their allies", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Strawberry vs. Jinbe", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Like Chinjao, Strawberry's elongated head is similar to Fukuroukuju, one of the Seven Gods of Good Fortune in Japanese folklore who is often depicted with an abnormally high forehead.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 44 Chapter 420 and Episode 302, Strawberry makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 622 (p. 10) and Episode 541, Kizaru was addressed by Strawberry by his rank when giving the report.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 93), His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements (p. 153), Strawberry's and the other Buster Call vice admirals' names are revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 64, Oda describes Strawberry's head.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 7) and Episode 511, A doctor states Haki is a power all the vice admirals use.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 59 Chapter 576 (p. 2) and Episode 485, Strawberry comments on the level 6 of Impel Down prisoners.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 907.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bearskin – Wikipedia article about the cap Strawberry's cap resembles.", "elements": []}]}], "images": []}]}