{"sections": [{"title": "Onigumo", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Onigumo is a Marine officer, and one of the five vice admirals who led the Buster Call on Enies Lobby. His name was revealed in the third databook."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Onigumo is a tall man with a cold face and eyes that are always semi-closed. He is usually seen smoking a cigarette, has long brown hair, and wears an ancient war helmet with a small, traditional Japanese dragon on it, and a long red plume hanging from it. Under his Marine coat he wears a double-breasted gray suit over a dark green shirt with a silver tie. He also has a golden loop earring on his left ear."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Onigumo is a firm believer of the Absolute Justice philosophy, and is willing to sacrifice anything to defeat what is defined as \"evil\". This was shown when a soldier questioned Onigumo's order of destroying a fellow Buster Call ship and one thousand comrades just to kill Monkey D. Luffy, which led Onigumo to shoot him in cold blood. In the anime, his dedication to Absolute Justice is further shown at Marineford, when he gave a charismatic speech to other Marines telling them that their victory in the pursuit for justice must be absolute."}, {"type": "paragraph", "text": "Despite his calm exterior at such moments, he is capable of rage and shock, as when the Buster Call failed, and when Monkey D. Garp was seemingly defeated by his grandson, respectively."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Onigumo_Shoots_Marine.png/revision/latest/scale-to-width-down/210?cb=20160731104427", "caption": "Onigumo shoots a Marine for questioning orders."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine vice admiral, Onigumo is capable of commanding a Buster Call alongside four other vice admirals"}, {"type": "paragraph", "text": "He had enough stealth and speed to pin down Marco and clasp a Seastone-cuff onto his wrist."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Unlike most other vice admirals, Onigumo seems to prefer sabers, rather than katanas. Using both of his hands and with the aid of his six spider-like appendages, he's capable of wielding eight sabers at the same time with extreme skill and deadly precision. He was also seen wielding a pistol to shoot one of his subordinates for questioning the doctrine of \"Absolute Justice\"."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Onigumo can also use the ability."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Onigumo possesses a currently unknown Devil Fruit. Using this power he is able to grow three pairs of spider-like black arms from his hair, as well as a spider-like abdomen. With these spider-like appendages and his own two human arms, he is capable of wielding a total of eight sabers in a similar fashion to Hatchan's Six Sword Style and Hyouzou's Eight Sword Style. These spider-like arms seem to be produced from his elongated hair."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Onigumo, along with four other vice admirals were, summoned to Enies Lobby at the command of the Buster Call. He was the one who commanded three ships to attack a fellow Marine ship with all its one thousand fellow sailors on board just to target Monkey D. Luffy, who was fighting on it with Rob Lucci, though he had confidence that Lucci would survive. Onigumo also shot one of his own soldiers who spoke out against the idea of sacrificing a thousand comrades to take down Luffy, enforcing his views on \"Absolute Justice\"."}, {"type": "paragraph", "text": "When the Straw Hats escaped through the Gates of Justice he was seen shouting insults at the personnel of the gates for closing it down (though in reality it was closed up by Sanji)."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8d/Onigumo_at_Enies_Lobby.png/revision/latest/scale-to-width-down/250?cb=20121109131804", "caption": "Onigumo at Enies Lobby."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was later seen again during the Impel Down Arc waiting to transfer Ace to Marineford, and told his squad not to let their guard down for a second during the procedure, then he told Ace to take a final look at the sky since he would no longer be able to do so once he arrived in Marineford for his execution."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was seen holding eight swords along with his fellow vice admirals preparing to battle the Whitebeard Pirates and their allies. When the battle began, he was shown cutting down the Whitebeard Pirates with little effort. During the war he attacked First Division Captain Marco, slapping Seastone handcuffs around one of his wrists, in order to disable Marco's Devil Fruit-based regenerative abilities giving Admiral Kizaru an opening to shoot him."}, {"type": "paragraph", "text": "Onigumo was later seen shocked when Monkey D. Garp fell to his grandson, Monkey D. Luffy. In the anime, he rallied the morale of the Marines around him to pick up their swords and to bring justice through fear to the retreating Whitebeard Pirates. After the death of Whitebeard and the arrival of Shanks, he stood down upon order from Fleet Admiral Sengoku."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4b/Onigumo_Detains_Marco.png/revision/latest/scale-to-width-down/250?cb=20130916165851", "caption": "Onigumo detains Marco."}]}, {"title": "One Piece Film: Z", "level": 3, "content": [{"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Marines and Shichibukai vs. Whitebeard Pirates and allies", "elements": []}, {"text": "Onigumo and other vice admirals vs. Oars Jr.", "elements": []}, {"text": "Onigumo and Admiral Kizaru vs. Marco", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime during the Battle of Marineford, after the death of Ace and Whitebeard, Onigumo was seen giving a speech to lower ranking soldiers on how they should seize this momentum they are gaining by pursuing the escaping pirates, to show the world \"justice\" and to ensure that no more pirates will dare rise after this victory if the Marines can show how merciless they can be towards evil. In an ironic sense, this made said marines that followed this speech appear evil."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Onigumo\" (鬼蜘蛛, Onigumo) is the Japanese name for a genus of orb-weaving spiders (Araneus ventricosus). However, based on the kanji directly, it can also mean \"demon spider\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 44 Chapter 420 (p. 18-19) and Episode 302, Onigumo, along with the other four vice admirals, is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 41), His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements (p. 153), Onigumo's and the other Buster Call vice admirals' names are revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 44 Chapter 422 (p. 18-19) and Episode 305, Onigumo orders the destruction of Buster Call ship 4 and shoots a soldier dead for questioning his order.", "elements": []}, {"text": "↑  One Piece Anime — Episode 487.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 594 (p. 7) and Episode 511, Dr. Fishbonen states Haki is a power all the vice admirals use.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 57 Chapters 553–554 and Episodes 462–463, Onigumo is seen with spider-like appendages.", "elements": []}]}], "images": []}]}