{"sections": [{"title": "Minister of the Right", "level": 1, "content": [{"type": "paragraph", "text": "The Minister of the Right is a seahorse merman in service to King Neptune. While it is not clear exactly what his job entails, he appears to have some administrative and military duties. He also appears to be a guard or commander as he and the other guards hurried to the princess when she needed help. His actual name is unknown."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is a seahorse merman, having ridges along his back and the sides of his face, as well as a curly orange tail like a seahorse rather than a standard merman's fishtail. His mouth also protrudes forwards like a seahorse's."}, {"type": "paragraph", "text": "He wears a jacket with two circles and a band on each sleeve. His jacket's sleeves are very large on the end. He carries a katana on his left hip and a trishula-like trident."}, {"type": "paragraph", "text": "In the past, his hair was scruffier and he did not have a beard."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He takes his job very seriously, and believes others should also too with theirs, as seen when he chastised King Neptune for leaving the palace on a whim. He also seems to be punctual, as when he was done talking to Shirahoshi, he noted that five minutes had passed."}, {"type": "paragraph", "text": "While he was Otohime's escort, the Minister of the Right was supportive of her campaign. He was very concerned for the queen's well-being and was greatly depressed when seeing her meet with little to no success."}, {"type": "paragraph", "text": "His failure at safeguarding the contents of the Tamatebako ten years ago was what led him to personally install a bomb within the chest and rigged it to explode the moment anyone tries to open it again. He also appears to have a sense of secrecy, having withheld all information concerning what he had done even to Neptune (until after Luffy, Zoro, and Sanji retrieved the stolen treasures from Caribou)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He seems to be one of the king's two council, along with the Minister of the Left, and seemingly tries to keep the king in line. He seems to have some command over the Neptune Army, as he was seen leading several soldiers to Shirahoshi's room."}, {"type": "paragraph", "text": "He has considerable skill in setting traps, having taken it upon himself to plant bombs inside the Tamatebako, which still remain functional even after ten years."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wields a bladed trident based on a trishula. The Minster's trident is different from the ones used by the other soldiers of the Neptune Army, as his is more like a cross between a crescent blade with a spear."}, {"type": "paragraph", "text": "He also has a katana that has a four-petal patterned guard strapped to his waist."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/30/Minister_of_the_Right_Trident.png/revision/latest/scale-to-width-down/190?cb=20130515234707", "caption": "Minister of the Right's trishula."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He was a bodyguard of Queen Otohime during her time. When Otohime was subduing a thief, the Minister of the Right warned her that her body was frail, but Otohime disregarded his warning."}, {"type": "paragraph", "text": "For years, the Minister of the Right would accompany Otohime on her daily routine: rescuing lives from shipwrecks, giving speeches in the streets, and trying to get signatures. As the citizens who already signed canceled their signatures, the Minister of the Right was saddened that the queen was meeting with little to no success. One day, a wrecked ship arrived at the Fish-Man Island main entrance. At the palace, the Minister of the Right was informed that the ship had a World Noble on it."}, {"type": "paragraph", "text": "After the noble's wounds were healed, Otohime accompanied him to the surface. One week later, Otohime returned to Fish-Man Island safe and sound with a piece of paper that could make a big difference. Otohime finally reached out to the citizens and they start giving their signatures. When Otohime's original box was full, the Minister of the Right brought a bigger box and told Otohime not to hold back her tears of joy. The minister then announced to the citizens to put their signatures into the larger box."}, {"type": "paragraph", "text": "Some days later, the box containing the signatures suddenly caught fire and Otohime was shot. The ministers were seen crying as Otohime spoke her last words to her children. Hody then deceived everyone on Fish-Man Island, including the ministers, into thinking that the queen was murdered by a human, shattering all of their hopes and dreams in the process. The ministers later attended Otohime's funeral and watched Fukaboshi's speech through a visual broadcast."}, {"type": "paragraph", "text": "Prior to Hody leaving the Neptune Army, the contents of the Tamatebako were mysteriously stolen. Unable to discover who the thief was, the kingdom decided to put the incident behind them. However, as a security measure, the Minister of the Right planted bombs in the Tamatebako and rigged them to explode when the box opens."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Ministers_at_Otohime%27s_Funeral.png/revision/latest/scale-to-width-down/300?cb=20130505032827", "caption": "The ministers attending Otohime's funeral."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was first seen when the Straw Hats arrived at the palace, along with the Minister of the Left, chastising the king for leaving the castle so suddenly and unguarded. After Neptune apologized for his irresponsibility, the ministers informed him that they received a message from Prince Fukaboshi and there was a pressing matter that required his attention."}, {"type": "paragraph", "text": "Later, he was seen leading several guards to Shirahoshi's room after hearing her scream. Once the Mermaid Princess confirmed that it was a false alarm, the Minister of the Right left after explaining to Shirahoshi that the Straw Hats would be taken into custody due to false accusations of mermaid kidnappings and Madam Shyarly's prediction."}, {"type": "paragraph", "text": "He was later seen tied up along with the king, the Minister of the Left, and the royal guards after they tried and failed to capture the Straw Hats. He went on to say that he could not believe that Neptune was defeated and yelled at the pirates, saying that they would be in trouble when the three princes returned. The three princes returned to the palace only to find it under the control of the Straw Hats. Since the princes were unable to enter, Fukaboshi spoke with Zoro through a Den Den Mushi. The Minister of the Right listened as Zoro made his demands and Fukaboshi told them Jinbe's message."}, {"type": "paragraph", "text": "After hearing noises coming from Shirahoshi's room, Neptune begged the Straw Hats to go check up on her to ensure her safety. Brook instantly dashed towards her location while carrying the Minister of the Right since the latter demanded it. They soon arrived at Hard-Shell Tower and found a group of battered pirates thrown there. They were then surprised to see Luffy, Megalo, and Shirahoshi leaving the tower with the princess inside the shark's mouth (unknown to both the minister and Brook)."}, {"type": "paragraph", "text": "Brook called out to Luffy while the Minister of the Right called out to Megalo asking why he was leaving the door wide open. The minister then urged Brook to check the room and they found the princess missing. They were then attacked by pirates , who were pawns of Hody Jones. They demanded to know where the switch was that opens the connection corridor to the palace. The minister then urged Brook to run back to the king. Once they returned to the palace hall, the minister informed King Neptune about Shirahoshi's disappearance."}, {"type": "paragraph", "text": "Zoro defeated the invading pirates, but one of them managed to open the connection corridor. The Minister of the Right and the others were surprised to see Hody Jones and Vander Decken IX arrive at the palace."}, {"type": "paragraph", "text": "After Decken left to go after Shirahoshi (who disappeared from the palace earlier), the Minister of the Right cursed Hody, a former soldier of the Neptune Army, for causing chaos on Fish-Man Island. Hody revealed that he only joined the army to gain experience. The minister then panicked as Hody Jones began flooding the palace by breaking a wall. He then got angry at Hody for injuring Neptune and some the palace guards with his Archer Shark attack. Usopp and Brook then untied everyone before the room was completely filled with water."}, {"type": "paragraph", "text": "Neptune then told the ministers and the guards to allow Hody Jones to take the palace. Neptune said that they needed to regroup with Fukaboshi, so they could prepare for another battle with the New Fish-Man Pirates. After Zoro staggered Hody with one slash, Neptune took Zoro, Usopp, and Brook and prepared an escape route. Neptune created a vortex and cleared a path. The ministers and the palace guards escaped. However, Neptune's back gave in putting him, Zoro, Usopp, and Brook in a dangerous situation. Hoe arrived to save them, but Hody, energized by an Energy Steroid, stopped Neptune with one hand. As Neptune and the three Straw Hats with him were getting captured by the New Fish-Man Pirates, the king urged the ministers and the guards to flee. The Minister of the Right then told the guards to obey the king."}, {"type": "paragraph", "text": "Outside of the palace, as the other minister expressed his disbelief that they left the king behind at the palace, the Minister of the Right told him not to linger at the idea since it was the king's direct order."}, {"type": "paragraph", "text": "At Gyoverly Hills, the ministers and the soldiers battled a sea bear under the command of Ikaros Much, but they were overwhelmed. They then saw Hody Jones riding on top of Sea Beasts and heading to Gyoncorde Plaza with King Neptune in tow. The Minister of the Right was then seen laying on the ground, bruised and battered."}, {"type": "paragraph", "text": "Later, he and his men recovered and they arrived at Gyoncorde Plaza. After learning of the situation from the citizens, the Neptune soldiers joined the battle against the New Fish-Man Pirates. After all of the officers had been defeated by the Straw Hats, the minister was amazed at their strength. Everyone then looked up into the sky as Noah continued falling towards Fish-Man Island. Everyone cheered for Luffy as he tried to destroy the ship. When the Sea Kings appeared and stopped Noah from falling, saving the ship and the island at the same time, everyone on Fish-Man Island celebrated."}, {"type": "paragraph", "text": "After the battle, the Minister of the Right was watching the human slaves rejoicing in their freedom. He then asked what would happen if Hody's grudge shifted to the other pirates. He was later seen at Ryugu Palace enjoying the celebration and was seen drinking with Usopp, Luffy, Neptune, and Shirahoshi. After the Straw Hats foiled Caribou's kidnapping attempt on Shirahoshi, the Minister of the Right apologized profusely for letting someone bypass palace security. He then looked across to the other tower and saw that someone cut it in half. He began to think that the thief who took treasure was responsible, but Pappug tried to tell him that Zoro did it when escaping the dungeon. Shortly after, a guard informed them that something strange was happening in the cell where the New Fish-Man Pirates and Vander Decken IX were being held. The two ministers, along with the princes, Neptune, and Jinbe went to the holding cell to find that the former leaders of the New Fish-Man Pirates had all become aged old men. The Minister of the Right informed them that the Energy Steroids were actually the legendary round pills found in the Tamatebako. He remembered that the pills went missing around the same time Hody quit the royal guard."}, {"type": "paragraph", "text": "While Luffy, Zoro, and Sanji were retrieving the treasures stolen from the palace, the Minister of the Right urgently asked Neptune for the return of the Tamatebako and informed him about the bombs he placed in the Tamatebako which would explode when the box opens. While first relieved they did not open it, the Minister of the Right and Neptune were horrified that Luffy gave the treasure and the Tamatebako to Big Mom's men and the thought of the explosion would sound like a declaration of war from Luffy when she opens it. They decided to refrain from telling the Straw Hats about the rigged bomb, sympathizing for Usopp and Chopper after seeing them in despair over Luffy challenging Big Mom. Neptune and the Minister of the Right then discussed over the bomb if the box were to be opened, with Neptune asking if there was a possibility of the bomb failing to go off (since it has been hidden for 10 years) which the Minister praised him for his suggestion. The Minister theorized that since the box had been laying in the palace for a decade, and since Ryugu Palace is very humid, there is a likelihood that the bomb had become a dud. Afterwards, the Minister of the Right said his goodbyes with everyone else on the island to the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/83/King_%26_Ministers.png/revision/latest/scale-to-width-down/230?cb=20120206164908", "caption": "The ministers scolding Neptune."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2f/Brook_Carrying_Minister_of_the_Right.png/revision/latest/scale-to-width-down/210?cb=20130514050039", "caption": "Brook carrying the Minister of the Right to check up on the Mermaid Princess."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ea/Minister_of_the_Right_Defeated.png/revision/latest/scale-to-width-down/190?cb=20161230051334", "caption": "Minister of the Right defeated."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, the ministers tried to convince Shirahoshi to accompany her family."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, both ministers were present in the Ryugu Palace throne room with the Neptune Family while Neptune was speaking with Garp."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Minister of the Right was an actual administrative position during Japan's Nara and Heian periods.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Vivre Card - One Piece Visual Dictionary, Information about the Minister of the Right is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 32), Minister on the Right's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 823.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956 (p. 4).", "elements": []}]}], "images": []}]}