{"sections": [{"title": "Minister of the Left", "level": 1, "content": [{"type": "paragraph", "text": "The Minister of the Left is a catfish merman in service of King Neptune. While it is not clear what his job entails, it appears to involve some sort of administrative and military duties. His actual name is currently unknown."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Minister of the Left is a short, rather rotund merman with light blond waist-length hair. He has a long beard and, like a catfish, two large whiskers for a mustache."}, {"type": "paragraph", "text": "In the past, his beard was dark and scruffier."}, {"type": "paragraph", "text": "He wears a monocle on his left eye and an over-sized top hat. He uses a wooden cane that has horned design on the top to get around."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/Past_MotL.png/revision/latest/scale-to-width-down/230?cb=20120401100628", "caption": "Minister of the Left at age 46."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like the Minister of the Right, he is always serious. He takes his work seriously and believes the king should as well, as seen when he chastised the king for leaving the castle so suddenly and unguarded. He is also somewhat diplomatic in behavior; as shown when he agreed with Zoro's sardonic remarks that he should have brought the humans invading Ryugu Palace tea and engaged them in dialogue instead of assaulting them."}, {"type": "paragraph", "text": "Despite this refined appearance, he is also quick to judge, as he maintained a belligerent stance against the Straw Hat Pirates after having received word that they were probable dangers to Fish-Man Island, perceiving their resistance to capture as a 'prologue' of the prediction, and accusing them of plotting with Hody Jones and Vander Decken IX after the Fish-Men aggressors had invaded the Ryugu Palace. However, the Minister of the Left changed his view on the Straw Hats after seeing how honorable Zoro is. After the Straw Hats saved Fish-Man Island from the New Fish-Man Pirates and Luffy declaring war on Big Mom for the island's sake, the minister became respectful towards the crew and kindly provided them a Log Pose that will help them navigate through the New World."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of the members of the king's council, he has some influence in decisions. He also has some command over the army. He has yet to display any weapons or fighting ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "While Queen Otohime was alive, the Minister of the Left suggested to Neptune that Otohime should record her speeches instead of preaching directly to the people. Neptune chose to support Otohime's actions and ordered the minister to protect her anyway he can."}, {"type": "paragraph", "text": "After five years failing to sway the Fish-Man Island citizens, Otohime became deeply depressed. The Minister of the Left found her intoxicated while she was giving a speech through a radio broadcast. The minister showed his concern but the queen went on with her speech."}, {"type": "paragraph", "text": "After Otohime went to the surface to negotiate with the World Nobles, she returned to Fish-Man Island safe and sound one week later. She brought with her a piece of paper that could make a big difference. Otohime finally reached out to the citizens and they started giving their signatures. The Minister of the Left was with the queen when she cried out tears of joy. However, Otohime's success was short-lived. One day in Gyoncorde Plaza, the box containing the signatures caught fire and Otohime was shot. The ministers were seen crying as Otohime spoke her last words with her children."}, {"type": "paragraph", "text": "Hody then deceived everyone on Fish-Man Island, including the ministers, into thinking that the queen was murdered by a human, shattering all of their hopes and dreams in the process. The Minister of the Left later stood outside of Hard-Shell Tower after Neptune locked himself into that tower. He kept Neptune company as the king grieved over his wife's death."}, {"type": "paragraph", "text": "The two ministers later attended Otohime's funeral and watched Fukaboshi's speech through a visual broadcast."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Ministers_at_Otohime%27s_Funeral.png/revision/latest/scale-to-width-down/210?cb=20130505032827", "caption": "The ministers attending Otohime's funeral."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was first seen when the Straw Hats arrived at Ryugu Palace. He was chastising the king for leaving the castle suddenly and unguarded. He was later seen commanding the guards to apprehend Nami, Brook, and Usopp, who were refusing to be put in jail."}, {"type": "paragraph", "text": "After getting tied up by the Straw Hat Pirates, he told Nami that a conventional Log Pose would not work in the New World. When she inquired further, he said he would tell her more if she untied him. The three princes of the Neptune House returned to the palace only to find it under the control of the Straw Hats. Since the princes were unable to enter, Fukaboshi spoke with Zoro through Den Den Mushi. The Minister of the Left listened as Zoro made his demands and Fukaboshi revealed Jinbe's message."}, {"type": "paragraph", "text": "After hearing noises coming from Shirahoshi's room, Neptune begged the Straw Hats to check up on the princess to ensure her safety. Brook dashed on to Shirahoshi's location hoping to see her panties. The Minister of the Left stated that the skeleton had perverted intentions and that Shirahoshi was in even more danger. As Brook left with the Minister of the Right, thinking that he was also a \"fan\", the Minister of the Left yelled out about how indecent the skeleton was."}, {"type": "paragraph", "text": "Vander Decken IX then threw a group of captive human pirates into the Ryugu Palace so they could open the connection corridor from the inside. Zoro defeated them and the Minister of the Left stated that Zoro enjoyed beating them. However, one of the pirates managed to open the corridor. Everyone in the palace hall then encountered Hody Jones and Vander Decken IX. The Minister of the Left then accused the Straw Hats of plotting with the enemy."}, {"type": "paragraph", "text": "The minister then panicked as Hody Jones began flooding the palace by breaking a wall. He then cried out in horror when Hody injured Neptune and some the palace guards with his Yabusame attack. When Zoro admitted that the negotiation with the kingdom was void since they were unable to keep the hostages unharmed and ordered for them to be freed, the minister noted Zoro's great integrity. Usopp and Brook then untied everyone before the room was completely filled with water. He was then freed and launched outside by the king's efforts."}, {"type": "paragraph", "text": "Outside of the palace, he exclaimed his disbelief that they left the king back at the palace. At Gyoverly Hills, the ministers and the soldiers battled a sea bear under the command of Ikaros Much, but they were overwhelmed. They then saw Hody Jones riding on top of Sea Beasts and heading to Gyoncorde Plaza with King Neptune in tow. As he was laying on the ground bruised and battered with the defeated Neptune soldiers, the Minister of the Left lamented on how the kingdom was crumbling when Otohime's hopes and dreams were about to be realized."}, {"type": "paragraph", "text": "Later, he and his men recovered and the minister gave the order to evacuate after Shirahoshi led Noah away from Fish-Man Island. He then found Neptune outside of Gyoncorde Plaza. He deeply apologized to the king for failing to protect him. The minister then asked the king to evacuate, but Neptune said that he would wait for the princes to return. When the leaders of the New Fish-Man Pirates had been defeated and the Sea Kings stopped Noah, everyone on Fish-Man Island celebrated."}, {"type": "paragraph", "text": "While returning to the plaza with the king, the Minister of the Left had been informed that the kidnapped mermaids had been found in the Ryugu Palace and that all of the treasures had been stolen. The minister then relayed the information to the king. At the plaza, the minister was surprised that Jinbe volunteered to be Luffy's blood donor."}, {"type": "paragraph", "text": "The Minister of the Left remained in the plaza with the Minister of the Right and Neptune as the king allowed the human slaves to go free while sentencing the non-officer Fish-Man pirates to working sentences. He was later seen at Ryugu Palace enjoying the banquet in the Straw Hats' honor. Some time after the party, a guard informed everyone that something strange was happening in the cell where the New Fish-Man Pirates and Vander Decken IX were being held. The two ministers, along with the princes, Neptune, and Jinbe went to the holding cell to find that the former leaders of the New Fish-Man Pirates had all become aged old men. After the visit to the prison tower was finished, the Minister of the Left was informed that two of Big Mom's messengers had arrived at Fish-Man Island. The bad news was that they did not have enough candy for the month's payment and the minister feared Big Mom's wrath."}, {"type": "paragraph", "text": "The minister then went to the candy factory and talked with Pekoms, one of Big Mom's messengers. The minister explained about the incident with the New Fish-Man Pirates and tried to reason with Pekoms. Pekoms disregarded what the minister had to say and continued demanding the candy payment until Luffy, Zoro, and Sanji arrived."}, {"type": "paragraph", "text": "Later, when the Straw Hats were departing Fish-Man Island, the Minister of the Left gave Nami a new Log Pose that would help them navigate in the New World and explained its properties to her."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/83/King_%26_Ministers.png/revision/latest/scale-to-width-down/220?cb=20120206164908", "caption": "The ministers scolding Neptune."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/02/MotL_Lament.png/revision/latest/scale-to-width-down/185?cb=20130416001422", "caption": "Minister of the Left lamenting their defeat."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, the ministers tried to convince Shirahoshi to accompany her family."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, both ministers were present in the Ryugu Palace throne room with the Neptune Family while Neptune was speaking with Garp."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Minister of the Left was an actual administrative position during Japan's Nara and Heian periods.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Vivre Card - One Piece Visual Dictionary, Information about the Minister of the Left is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 67), His birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 823.", "elements": []}, {"text": "↑  One Piece Manga — Chapter 956 (p. 4).", "elements": []}]}], "images": []}]}