{"sections": [{"title": "Yamakaji", "level": 1, "content": [{"type": "paragraph", "text": "Vice Admiral Yamakaji is a Marine officer, and one of the five vice admirals who led the Buster Call on Enies Lobby."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yamakaji is seen smiling almost all of the time, even during a Buster Call. He is also a smoker of cigars, just as Onigumo smokes cigarettes. His eyes are always closed and he has a thick brown beard that covers his large chin. At Enies Lobby, he was seen wearing a double-breasted orange suit with a dark red tie underneath, all over a yellow shirt with purple polka dots. From Opening 13, his suit's color was changed to dark brown, his tie was changed to black and the polka dots on his shirt to red. Like most high-ranking Marine officers, he drapes his standard Marine coat over his shoulders like a cape."}, {"type": "paragraph", "text": "Twenty years ago, he looked exactly the same, except that he did not have the beard, but only some shaved hair on his chin. He wore an orange suit over a white shirt with a red tie, and already had his Marine cape and hat at that time."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Yamakaji has a strong sense of justice. He holds high respect toward his elders and was shocked when Garp was defeated by Luffy. It is unknown whether he believes in moral justice or absolute justice. He likes to smoke so much he even smokes during battle."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a vice admiral, Yamakaji is capable of commanding a Buster Call alongside four other vice admirals, and has the authority over the lower-ranking soldiers of the Marines."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Yamakaji was seen carrying a katana during the Battle of Marineford. However, he has not yet been seen using it."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "It was stated that all vice admirals possess Haki, so Yamakaji can also use the ability."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Yamakaji was only seen in two panels during the attack and was not given any speaking lines. In the anime, he appeared in one additional slide show scene, however he still did not speak at all."}], "images": []}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "Yamakaji was next seen at the Marine Headquarters during the fight against the Whitebeard Pirates, telling Vice Admiral Tsuru to stay back. He is seen later witnessing Luffy attempt to fight the three admirals. He was shocked when Vice Admiral Garp was defeated by Luffy."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Marines and Shichibukai vs. Whitebeard Pirates and Allies", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Yamakaji\" (山火事) means \"Forest Fire\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 44 Chapter 420 and Episode 302, Yamakaji makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 194), Yamakaji's birthday is given.", "elements": []}, {"text": "↑  One Piece Yellow: Grand Elements (p. 153), Yamakaji's and the other Buster Call vice admirals' names are revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 194), Why Yamakaji smokes all the time.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 60 Chapter 594, A doctor states that Haki is a power all the vice admirals use.", "elements": []}]}], "images": []}]}