{"sections": [{"title": "Oars", "level": 1, "content": [{"type": "paragraph", "text": "Oars was labeled as the 900th Zombie of Gecko Moria's zombie army and was the only one classified as a Special Zombie. He is the zombie that Moria animated with the stolen shadow of Monkey D. Luffy in Thriller Bark and the ancestor of Little Oars Jr."}, {"type": "paragraph", "text": "Due to his actions, he is a major antagonist of the Thriller Bark Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Oars is an extremely large, red-skinned, skull-faced zombie who is more than four times the size of an average giant; his sheer size caused Roronoa Zoro and Franky to mistake his body for a large wall upon encountering it up close. Oars has two large horns and long yellow hair that flows from his head to his back. His upper jaw consists mostly of straight-edged molars, while his lower jaw consists of several sharp fangs and two large tusks. He is missing his right eye, and his left arm has \"SZ-900\" tattooed on it, \"SZ\" representing \"Special Zombie\" and \"900\" being his zombie classification number."}, {"type": "paragraph", "text": "Like other zombies, he is completely stitched up, save for a small portion of his upper right pectoral area that has decayed to reveal ribs and a moldering section of his right deltoid. Oars's right arm has been replaced entirely by Hogback, but the joint where his original arm had been connected was not and retains severe signs of frostbite. A blue cloth is stitched across the middle of his stomach; this is actually a curtain that opens up and leads to a compartment located where his digestive system should be. This is a cockpit where Oars's master, Gecko Moria, can sit and watch Oars battle or aid him with his own powers. Apart from the various bandages covering his limbs, Oars wears only a large black loin cloth adorned by three gigantic skulls and a large cross pattern in front strapped onto a rope holding it up."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Oars's personality in life is largely unknown, though Hogback implies that he was a ferocious beast hailing from a clan of giants who were especially evil; Oars, in particular, was well known and feared. However, Oars was also very dense, given Chopper's assessment that he ended up dying not from old age or injuries sustained in battle, but by walking around in an extremely cold environment wearing only his loincloth."}, {"type": "paragraph", "text": "Due to being implanted with Luffy's shadow, Oars inherited several of Luffy's character traits, including Luffy's desire to become the Pirate King. Oars is also unable to tell that Usopp and Sogeking are actually one and the same, but thinks Sanji and his badly-drawn bounty poster look exactly alike. He also retains Luffy's excitability, becoming shocked when he learned that the Straw Hats could not complete Pirate Docking Six due to Robin refusing to take part in it, and shares Luffy's carnivorous nature, having been distracted by being told that there was a large pile of meat to his right. Oars also remembered certain things about Luffy's abilities; he found that it was weird that he did not stretch when using Gomu Gomu no Pistol and found stretching to feel familiar when Moria later helped him do so."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8a/Oars%27s_Excitability.png/revision/latest/scale-to-width-down/210?cb=20160405193133", "caption": "Oars demonstrates Luffy's excitability while watching Pirate Docking 6."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Gecko Moria", "level": 3, "content": [{"type": "paragraph", "text": "After being revived as a zombie, Oars was originally very defiant against Gecko Moria's will, possessing a strong sense of individuality. However, as is the fate of all zombies, Oars eventually became obedient to Moria. Despite this, Oars still had his own way of doing things, preferring to fight his battles by himself. While Oars allowed Moria to aid him in the execution of his stretching techniques, he was against his master interrupting his battles or fighting them for him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "In life, Oars was an extremely strong beast, having been given the epithet \"Continent Puller\" due to his sheer power; with Luffy's shadow animating him as a zombie, he retains his enormous strength, allowing him to perform feats of incredible strength like destroying enormous chains restraining his body simple by standing up, shattering a large portion of a thick steel freezer with a single punch, easily moving the massive rudder of Thriller Bark by himself, defeating all the General Zombies at once with a barrage of punches, and breaking a tower off its foundation to use as a weapon, while his sheer size and weight grant his attacks enough power to effortlessly destroy large buildings. Despite his massive size, Oars is surprisingly fast, having launched a surprise attack on the General Zombies by quickly leaping into the air before they could restrain him and later avoided several attacks from the Straw Hat Pirates with his speed and reflexes. In addition, his body is incredibly durable; simply disabling his already damaged right arm required multiple powerful and concentrated attacks from the Straw Hat Pirates. However, according to Chopper, even Oars was not resilient enough to withstand the extreme cold without proper clothing, which was the cause of his death."}, {"type": "paragraph", "text": "Due to having Luffy's shadow within him, Oars can perform some of Luffy's Devil Fruit-based techniques, namely Gomu Gomu no Pistol, Gomu Gomu no Gatling, Gomu Gomu no Kane,, Gomu Gomu no Kama (notably, Oars simply sweeps a single arm at his opponent instead of clotheslining them when using this technique due to his size and inability to stretch), Gomu Gomu no Kazan, Gomu Gomu no Muchi, Gomu Gomu no Yari, Gomu Gomu no Ono, Gomu Gomu no Bazooka, Gomu Gomu no Stamp, Gomu Gomu no Rifle, and Gomu Gomu no Bullet; he also has his own technique called Gomu Gomu no Shirimochi (ゴムゴムの尻モチ, Gomu Gomu no Shirimochi, literally meaning \"Rubber Rubber Butt Stomp\"), where he leaps into the air before crushing his opponents with his large rear end. However, Oars cannot stretch his limbs like Luffy does due to not actually possessing the powers of the Gomu Gomu no Mi, though this usually does not matter due to the tremendous reach of his arms. With the aid of Gecko Moria's Kage Kakumei, Oars can stretch his limbs like Luffy does, increasing both the power and range of his attacks, as well as contort his body in ways that Luffy cannot, such as becoming a sphere for the attack Oars Ball (オーズ・ボール, Ōzu Bōru); despite this, Oars's body still does not possess the other attributes of Luffy's rubber - most notably, he is still susceptible to attacks that Luffy can normally withstand without injury, such as blunt-force blows (lacking Busoshoku Haki) and lightning."}, {"type": "paragraph", "text": "Since Oars is a zombie, he is immune to pain; this allowed him to withstand and get up from the Straw Hat Pirates' attacks time after time with seemingly no limit to his stamina or how much damage he could endure, eventually requiring Luffy to completely shatter his spine. However, he still instinctively flinched when he was harmed until he fully comprehended his immunity to pain. Chopper also points out that since Oars cannot feel pain, he will not know which parts of his body are damaged. Like any living being, if his bones and nerves are badly damaged or destroyed, Oars cannot move."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Oars_Destroys_A_Building.png/revision/latest/scale-to-width-down/210?cb=20160405193231", "caption": "Oars's speed, strength, and size allow him to destroy entire buildings with ease."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/94/Oars_Uses_Gomu_Gomu_no_Rifle.png/revision/latest/scale-to-width-down/210?cb=20160405193353", "caption": "Being animated by Luffy's shadow allows Oars to replicate many of his Devil Fruit-based techniques, such as Gomu Gomu no Rifle, with the aid of Gecko Moria."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Oars was an evil giant called the Continent-Puller. Legend has it that he amassed countries and islands under his control and his band of villains. He also had a family, as Little Oars Jr. is his descendant."}, {"type": "paragraph", "text": "Five hundred years ago, Oars died in the Land of Ice. After examining Oars's corpse, Tony Tony Chopper theorized that he died due to exposure to the elements or frostbite upon finding that the giant had been unprepared for the frozen climate, having worn only a loincloth. On top of this, Oars had sustained a serious injury to his right arm, which Hogback later repaired."}], "images": []}, {"title": "Legacy", "level": 3, "content": [{"type": "paragraph", "text": "His fame as a terrible villain and his status as the \"Continent-Puller\" did not disappear over time. Ten years before encountering the Straw Hat Pirates, Gecko Moria and Hogback obtained his corpse in order to transform it into a zombie."}, {"type": "paragraph", "text": "Even five hundred years after his death, Oars is known widely enough that high-ranking Marines like Tsuru and Doberman recognized his descendant, Little Oars Jr., on sight and were visibly intimidated by the similar power he displayed."}], "images": []}, {"title": "Thriller Bark Arc", "level": 3, "content": [], "images": []}, {"title": "Reawakening", "level": 4, "content": [{"type": "paragraph", "text": "After finding Oars's corpse in the Land of Ice, Gecko Moria and Hogback began working on restoring it so it could be used as a zombie, which involved replacing his right arm entirely due to the damage it had suffered from frostbite and installing a cockpit in Oars's stomach. Oars's corpse was kept in a giant freezer on Thriller Bark until a suitable shadow was found. Eventually, Moria obtained Monkey D. Luffy's shadow and implanted it into Oars's corpse, causing Oars to awaken once more. Due to Luffy's shadow passing its former owner's personality onto him, Oars broke the chains restraining him and immediately began yelling for Sanji to make him food, only to question who Sanji was."}, {"type": "paragraph", "text": "As the other zombies brought him piles of food, Oars thanked Moria for letting him eat so much despite not knowing who he was before admitting that he still had not eaten enough. After silencing the zombies who berated him for speaking to Moria in such a way with a glare, Oars dismissed Moria's claim that he had been revived to become the Shichibukai's underling and decided to leave for the sea before punching through the freezer containing him. Leaping outside, Oars noted that his arm should have stretched before proclaiming that he would become the Pirate King."}, {"type": "paragraph", "text": "Soon after, Oars climbed up the main mast of Thriller Bark and was amazed to discover that it was actually a ship, which he decided to become the Pirate King with. Moments later, Oars leaped down in preparation for setting sail, only to land on top of a stone stairway that the Straw Hat Pirates were passing through, which was destroyed by the impact, before landing on the ground below, where Roronoa Zoro, Franky, Usopp, and Sanji encountered him."}, {"type": "paragraph", "text": "As the Straw Hats expressed shock at his sheer size, Oars picked up a large piece of rubble and placed it on his head to simulate a pirate hat before stating that he was ready to go on his adventure now as he walked away."}, {"type": "paragraph", "text": "Soon afterward, Oars found the chain controlling Thriller Bark's rudder and began pulling on it to see if it would move, causing the massive ship to begin tilting and shaking as its course changed. When Absalom sent the General Zombies to stop him, Oars decimated them with Gomu Gomu no Gatling before angrily telling them to not interrupt his adventure."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Oars_Awakens.png/revision/latest/scale-to-width-down/210?cb=20160405193625", "caption": "Oars awakens after Moria animates him with Luffy's shadow."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/60/Oars_Escapes_From_His_Freezer.png/revision/latest/scale-to-width-down/210?cb=20160405193735", "caption": "Oars breaks out of his freezer."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Oars_Explores_Thriller_Bark.png/revision/latest/scale-to-width-down/210?cb=20160405193833", "caption": "Oars explores Thriller Bark."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Oars_Defeats_the_General_Zombies.png/revision/latest/scale-to-width-down/210?cb=20160405194040", "caption": "Oars defeats the General Zombies."}]}, {"title": "Fighting the Straw Hats", "level": 4, "content": [{"type": "paragraph", "text": "Later, a completely obedient Oars returned to the freezer upon being summoned by Moria, whom he declared was his master. After being ordered to defeat the Straw Hats and return them to their ship, Oars noticed Luffy and attacked him with Gomu Gomu no Kane, causing his head to smash through the mansion into the room where Nico Robin and Tony Tony Chopper were facing off against Hogback and Victoria Cindry, both of whom fell to the floor below. Not noticing Hogback below or hearing his demands to look down, Oars stepped on him before continuing to carve a path of destruction through the mansion until he reached the courtyard outside, where he demanded that the Straw Hat Pirates show themselves."}, {"type": "paragraph", "text": "Upon being addressed as Luffy by Sanji, who stood before him, Oars stated that Luffy was his enemy and introduced himself before identifying Sanji as being one of his targets despite his badly drawn wanted poster. Oars attacked Sanji with Gomu Gomu no Kama, but Sanji evaded and attempted to attack his forehead with Collier Frit, only for Oars to leap back before smacking Sanji into a building. As Oars grabbed the wounded Sanji, he was distracted when Usopp lit the top of his head on fire with Hi no Tori Boshi, prompting him to throw Sanji to the ground and put out the fire before destroying the building that Zoro, Franky, and Brook were standing on with a flying kick. Zoro attacked Oars with Nigori-Zake and managed to slice off one of his protruding fangs, but Oars moved his head back to avoid the rest of the slash before kicking Zoro high into the air with Gomu Gomu no Kazan. Dodging the barrage of bullets from Franky's Weapons Left, Oars grabbed a tower and slammed it into the roof where Franky and Brook were standing, sending them falling to the ground below, before noticing Robin catching Zoro with Spider Net. Usopp attempted to purify Oars with a bag of salt, but quickly realized it was too small a quantity to affect such a large zombie as Oars slammed the remnants of the tower into the bridge where Usopp, Chopper, and Robin were standing. As a wounded Usopp cursed him while lying on the ground below alongside his teammates, Oars stood over the seemingly defeated Straw Hats while proclaiming that he was the servant of Moria."}, {"type": "paragraph", "text": "Oars noted that this only left Luffy, Nami, and Sogeking and wondered where they were before punching through a nearby section of the mansion to search for them, accidentally hitting some of Perona's Wild Zombies in the process. As Oars continues searching for the remaining Straw Hats, he was surprised to see Zoro, Sanji, Usopp, Chopper, Franky, and Robin get back to their feet and prepare to fight him once more."}, {"type": "paragraph", "text": "Commending the Straw Hats for their strength despite being so small, Oars leaped down from the building he was lying on to confront them before attacking with Gomu Gomu no Shirimochi, which prompted Franky to initiate Pirates Docking 6: Big Emperor. When Robin refused to join the maneuver out of embarrassment, a shocked Oars demanded to know why they stopped before swatting Franky, Chopper, and Usopp away out of irritation. After Sanji kicked a chunk of rubble at his head, Oars turned to face him, only to suddenly lose his balance when Usopp made his hand slip on a puddle of oil. As Oars struggled to regain his balance, Zoro knocked his left arm back with Franky's pillar nunchuks, prompting Robin to restrain it behind Oars's back as Franky and Chopper delivered a powerful blow to Oars's jaw with Super Frapper Gong. With Oars standing on only one leg and his balance shaken due to his brain being rattled, Sanji knocked him completely off his feet with Anti-Manners Kick Course, sending Oars crashing through part of the mansion while upside-down as he angrily promised to send the Straw Hats flying."}, {"type": "paragraph", "text": "An outraged Oars declared that he would flatten the Straw Hats without leaving even their bones behind before realizing his horns were stuck in the ground. Hearing this, the Straw Hats proceeded to attack him while he lay defenseless and screaming in terror before Oars managed to get to his feet. Angrily telling the Straw Hats to stop, Oars noted that they were like demons before being distracted by Usopp and Chopper pretending that there was a large amount of meat to his right, allowing Zoro and Franky to topple him by attacking his knees from behind. Annoyed that there was no meat and that his legs hurt, Oars prepared to attack the Straw Hats once more."}, {"type": "paragraph", "text": "As Oars's fist approached him, Zoro pushed his punch aside before firing a powerful air slash at him with Hyakuhachi Pound Ho, prompting Oars to dodge it before admitting that it might have cut him had he took it upon witnessing the destruction it caused. After attacking the Straw Hats with multiple stomps, Oars was surprised to feel Thriller Bark moving out of the Florian Triangle due to his prior shifting of the rudder. Moments later, Oars was shocked to learn Moria had entered a cockpit in his stomach and excitedly claimed that the tension was rising. Upon noticing Usopp running toward the mansion to find salt in its kitchen, Moria had Oars smash the entrance and Usopp with his fist, though Usopp was saved by Brook."}, {"type": "paragraph", "text": "Struck by a large Hi no Tori Boshi from Usopp and Franky, Oars panicked as part of his arm was set on fire before being hit in the side by a large segment of a tower kicked at him by Sanji, who kicked more tower segments at him with Jenga Cannon. Angrily punching the tower segments back at the Straw Hats as the flames covering his body dissipated, Oars dodged a launched Franky's Mortar while kicking him into a building. As Oars prepared to finish Franky off at Moria's behest, he was struck by Nami's Thunderbolt Tempo, which briefly brought him down. However, Oars got to his feet and managed to destroy the bridge that Nami was standing on with a Gomu Gomu no Pistol that stretched, to the shock of the Straw Hats watching. Noting that stretching felt familiar, Oars attacked the Straw Hats with Gomu Gomu no Muchi as well."}, {"type": "paragraph", "text": "Attacking the Straw Hats with Gomu Gomu no Kane, Oars proclaimed that stretching his body felt great before unleashing Gomu Gomu no Yari on them as well. When the Straw Hats wondered how Oars was stretching, Moria revealed that he was using Kage Kakumei to manipulate Oars's body before transforming Oars's body into a sphere to attack the Straw Hats with Oars Ball, prompting Oars to ask Moria to not interfere with his fight. Shortly afterward, Oars was attacked by Brook, who used being electrocuted by Nami and spun by Robin to pierce Oars's right shoulder with Rai Kotsu Ken: Gavotte Bond Avant. Zoro followed up on this by slashing Oars with Nigiri Toro, but Oars decided to deal with Brook first and attacked him with Gomu Gomu no Ono before blocking Usopp's Atlas Suisei attack with his right arm. Declaring that Usopp was next, Oars attempted to attack him with Gomu Gomu no Bazooka, but was surprised when his arms did not stretch before discovering that Robin was restraining Moria within the cockpit."}, {"type": "paragraph", "text": "Wondering why he could no longer stretch, Oars watched as Moria outmaneuvered Robin and stole her shadow before returning to the cockpit, which prompted him to angrily remind Moria that he promised to stay out of the fight before attempting to attack Robin with Gomu Gomu no Bazooka, only for Sanji to deflect the attack with Frites Assorties. However, Oars was surprised to find Chopper on his shoulder and listened as the latter revealed Oars's right arm had been replaced and could be disabled with enough damage done to it. When Oars punched his shoulder in an attempt to hit him, Chopper moved into the space within his fist and teamed up with Sanji to hit Oars's right arm with Armée de L'Air Kokutei Roseo Shoot, only for an irritated Oars to pummel them both with Gomu Gomu no Gatling after proclaiming that it would not work."}, {"type": "paragraph", "text": "As Oars declared that this only left three people, he had his right arm slashed in multiple places by Zoro's Yashagarasu, which prompted him to angrily smash Zoro into a building with his knee. However, he was surprised when Usopp managed to shoot a large bag of salt into his mouth, only for Moria's Doppelman to emerge from his mouth carrying the bag before throwing it at Usopp as Moria revealed that he had been protecting the inside of Oars's body for this very reason. Attacking Usopp with Gomu Gomu no Stamp, Oars continued to stomp on the same area multiple times and did the same to Nami at Moria's behest before turning around in shock upon hearing Nightmare Luffy calling him out. Seeing Nightmare Luffy had rescued Nami and Usopp, Oars attacked him with Gomu Gomu no Rifle, but Nightmare Luffy easily blocked his attack before punching him in the jaw, which sent Oars flying back, and flipping him over onto his head."}, {"type": "paragraph", "text": "Luffy grabbed Oars by the hair and slammed him on the ground multiple times before throwing him into the mansion. As Oars angrily tried to attack him with Gomu Gomu no Bullet, Luffy slashed him across the chest before hitting him with a Gomu Gomu no Pistol that also struck Moria. Oars attempted to smash Luffy into the ground with Gomu Gomu no Ono, but was instantly overwhelmed by a barrage of punches from Luffy's Gomu Gomu no Storm, causing him to be violently thrown back into the mansion in apparent defeat."}, {"type": "paragraph", "text": "However, Oars stood up a few moments later and claimed that none of Luffy's attacks had hurt at all. Seeing Brook taking Luffy to the top of the main mast, Oars demanded to know where they were going before being drenched in water by Nami's Rain Tempo, which allowed his legs to be frozen by Franky and Usopp's low-temperature air cannon. After Sanji wrapped the rudder's chain around Oars's body, Zoro made Oars pull in his stomach with Santoryu Ogi: Sanzen Sekai as the chain pulled his torso back further, which caused Oars's spine to be straightened out. Seeing Luffy hurtling toward him, Oars attempted to hit him with a Gomu Gomu no Bazooka, but found that he could not move his right arm at all as Luffy smashed his skull with Gomu Gomu no Gigant Bazooka, completely shattering Oars's spine as he fell over."}, {"type": "paragraph", "text": "As he lay on the ground, Oars noted that he could not move even though his body did not hurt. Soon after, Moria used Shadow's Asgard to empower himself, leading to him taking Luffy's shadow from Oars's corpse and leaving it lifeless once more."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Oars_Destroys_Hogback%27s_Mansion.png/revision/latest/scale-to-width-down/210?cb=20141206182303", "caption": "Oars smashes through Hogback's mansion."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Oars_Overwhelms_the_Straw_Hat_Pirates.png/revision/latest/scale-to-width-down/210?cb=20160405194207", "caption": "Oars overwhelms the Straw Hat Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1c/Oars_is_Toppled.png/revision/latest/scale-to-width-down/210?cb=20160405194333", "caption": "The Straw Hats manage to topple Oars."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/11/Moria_Enters_Oars%27s_Cockpit.png/revision/latest/scale-to-width-down/210?cb=20160405194457", "caption": "Moria joins the battle by entering the cockpit within Oars."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Oars_Stretches_While_Using_Gomu_Gomu_no_Pistol.png/revision/latest/scale-to-width-down/210?cb=20160405194645", "caption": "Oars stretches his arm while using Gomu Gomu no Pistol, to his surprise."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Raikotsuken.png/revision/latest/scale-to-width-down/210?cb=20120722131338", "caption": "Oar's right shoulder is pierced by Rai Kotsu Ken: Gavotte Bond Avant."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4b/Oars_Pummels_Sanji_and_Chopper.png/revision/latest/scale-to-width-down/210?cb=20160405194831", "caption": "Oars pummels Sanji and Chopper after they further injure his right arm."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/66/Nightmare_Luffy_Confronts_Oars.png/revision/latest/scale-to-width-down/210?cb=20160405194926", "caption": "Oars is confronted by Nightmare Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Luffy_Defeats_Oars.png/revision/latest/scale-to-width-down/210?cb=20160326193244", "caption": "Luffy defeats Oars by shattering his spine."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Oars_Loses_His_Shadow.png/revision/latest/scale-to-width-down/210?cb=20160326194910", "caption": "Oars loses his shadow to Moria."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oars vs. General Zombies", "elements": []}, {"text": "Oars vs. Sanji", "elements": []}, {"text": "Oars vs. Roronoa Zoro", "elements": []}, {"text": "Oars vs. Straw Hat Pirates (minus Nami and Luffy)", "elements": []}, {"text": "Oars and Moria vs. Straw Hat Pirates (minus Luffy)", "elements": []}, {"text": "Oars and Moria vs. Nightmare Luffy", "elements": []}, {"text": "Oars vs. Straw Hat Pirates and Brook", "elements": []}]}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "In early drafts, Oda had Oars wear an afro."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "While it is not specified happening in the manga, the anime expands on Oars' color scheme by having it appear differently before and after he escapes the freezer. Within the freezer, he appears grayer than his canonical coloring, similar to how he appears in the eighth anime opening, while outside the freezer, he appears as he does on Vol. 48 of the manga due to his body defrosting and reacting to the outside air."}, {"type": "paragraph", "text": "While nothing noteworthy happened to Oars between his defeat of the General Zombies and his return to Moria originally in the manga, the anime adds a scene where he journeys to the edge of the island and swims in the moat between the island and the walls surrounding it; notably, he does so without accidentally purifying himself by swallowing too much sea water."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "The Japanese characters used for Oars's name (オーズ) are the same as those used for the Japanese rendition of the Norse God, Óðr. However, due to the inability to translate the name to an understandable English equivalent, Óðr was generally not used in most early fan translations. The two most popularly used names that were used for the giant's name, prior the official romanization, were Oz and Odz. Though either can be used, both were slightly inaccurate."}, {"type": "paragraph", "text": "Though initially unknown, the official romanization of the giant's name was later revealed to be Oars as written on a sail of a gigantic ship commanded by Oars' descendant, Little Oars Jr."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Little_Pirates%27_Jolly_Roger.png/revision/latest/scale-to-width-down/210?cb=20151024051739", "caption": "Little Oars Jr.'s ship with the \"Oars\" name on the sail."}]}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "As a major arc character, he is present in the official merchandise. Oars has been featured in the Ichiban Kuji One Piece with Nightmare Luffy, and was recently released in the One Piece World Collectable Figure series."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Oars_Ichiban_Kuji_Figure.png/revision/latest/scale-to-width-down/210?cb=20130219135723", "caption": "Oars Ichiban Kuji Figure"}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece Romance Dawn: The Dawn of the Adventure", "elements": []}, {"text": "One Piece Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In a response to a fan who asked if Oars was a giant from Elbaf, Oda responded that Oars is a giant, but he is unusually large even by giant standards and not of Elbaf origin. Oda explained that Oars is similar to people in real life who are notably larger than others, and that he came from one of the many islands around the One Piece world that have giants inhabiting them.", "elements": []}, {"text": "When Oars briefly believes he is a robot after finding his stomach is a cockpit, not only does he call himself Oars Bomber, but in the world of Chopperman, Luffy is called Luffy Bomber (this is referenced in the anime, when Chopper, donning his Chopperman cape, utters Oars Bomber in shock).", "elements": []}, {"text": "Oars makes a cameo in One Piece: Gigant Battle and its sequel in the Enies Lobby stage, where, if the player hit the Sea God Offers barrel several times, he appears and attacks the stage.", "elements": []}, {"text": "Oars' height in One Piece Magazine Vol.3 was given as 39 meters.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Óðr – Wikipedia article about the Norse God which Oars' name in Japanese, (オーズ, Oozu), is apparently based on.", "elements": []}, {"text": "Devil – Wikipedia article about Oars' horror theme.", "elements": []}, {"text": "Giant (mythology) – Wikipedia article about giants in mythology.", "elements": []}, {"text": "Ötzi the Iceman Wikipedia article about Ötzi the Iceman.", "elements": []}]}], "images": []}]}