{"sections": [{"title": "John", "level": 1, "content": [{"type": "paragraph", "text": "Captain John was a famous pirate captain who was once a member of the infamous Rocks Pirates prior to forming his own crew. He was notable for collecting one of the most significant treasures in the world; his fabled treasure cave and the riches within are notably long sought after by Buggy. After his death, his corpse was found by Dr. Hogback and modified into one of the General Zombies of Gecko Moria."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As a zombie, John is typically seen drinking alcohol due to the personality of the shadow animating him. He has grey-brown skin with long light pink hair, and wears a white shirt with bandages. He wears a red coat, with yellow shoulder pads, and pink on the end of the sleeves. His pants have vertical white and black stripes, and he has two swords stuck in his stomach from when he died. His face looks roughly like Dr. Kureha, especially because of his ever-present bottle."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In life, John was such a greedy and loathsome person that his own crew declared mutiny and betrayed him due to his ways."}, {"type": "paragraph", "text": "As a zombie, John has the personality of a drunkard due to the shadow animating him. He is an incredibly lazy bum who most of the time has a hard time following orders. Because of his drunken personality and constant drinking, he is thus called \"Sluggish Captain John\". In retrospect, his personality as a zombie is a stark contrast to that of when he was alive."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "During life, John was a member of the very powerful pirate crew, the Rocks Pirates, and eventually made a name for himself when he left and formed his own crew."}, {"type": "paragraph", "text": "As a zombie, he was nearly invincible, his only weakness being salt. With his corpse being used by Hogback to create a General Zombie, he probably was a very powerful and feared pirate."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Before Death", "level": 3, "content": [{"type": "paragraph", "text": "In his lifetime, John was once a member of the violent pirate crew known as Rocks Pirates."}, {"type": "paragraph", "text": "At some point John later became a pirate captain with a large amount of treasure. When he decided to keep the treasure for himself rather than share it with his crew, they turned on him and he died via multiple stab wounds to the chest. However, his treasure was never found and became the subject of one of the great myths. Among those who decided to look for his lost treasure was Buggy."}], "images": []}, {"title": "Zombie John", "level": 3, "content": [{"type": "paragraph", "text": "After he died, John's corpse eventually came into the possession of Dr. Hogback. With Hogback's surgical skills and Moria's Devil Fruit powers, the corpse of John was modified into a zombie with a shadow of a drunkard animating him. As he was modified, a glass armband of his was added to Moria's riches."}, {"type": "paragraph", "text": "Later on, he was sent with the other General Zombies to capture the Straw Hat Pirates, but they eluded them. Afterwards, he, along with all the others, attended Absalom's \"wedding\". Soon after, Oars changed the course of the ship and the zombie generals were sent to deal with him and were crushed. Later as he layed crushed alongside the other generals, the shadow animating him was recalled by Moria and implanted into himself along with the other shadows he stole."}], "images": []}, {"title": "John's Glass Armband", "level": 3, "content": [{"type": "paragraph", "text": "With Moria recalling the shadow out of him, John's corpse returned to being motionless. Though the fate of his corpse had ended, his armband had not. Found amidst Moria's riches, Luffy took it not knowing that it was in reality a map to John's loot."}, {"type": "paragraph", "text": "While its significance was not noticed as Luffy wore it, Buggy however recognized the fabled T-mark during their time together in Impel Down. After some slight assistance from the clown pirate in exchange for the armband, the fabled map was given to the eager pirate."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Treasure_Mark.png/revision/latest/scale-to-width-down/210?cb=20130303105346", "caption": "Captain John's armband."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Chapter 957 (p. 6), Sengoku talks about the Rocks Pirates.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 233 and Episode 145, Buggy tries looking for Captain John's treasure on a skull shaped island.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 49, Fan question: what is the history of Captain John?", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 47 Chapter 451 and Episode 344, John first appears.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 49 Chapter 481, Moria gathers all of the shadows animating his zombies and implants them in himself.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 50 Chapter 486 (p. 5) and Episode 378, Luffy takes the armband from the treasure trove on Thriller Bark, and Nami lets him have it because it doesn't have any gems on it.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 54 Chapter 527 and Episode 424, The truth about John's armband is revealed.", "elements": []}]}], "images": []}]}