{"sections": [{"title": "Muchigoro", "level": 1, "content": [{"type": "paragraph", "text": "Muchigoro is a member of the Red Arrows Pirates who appeared in the sixth One Piece movie."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Muchigoro's appearance is the same as when he was alive except now, like all the revived Red Arrows Pirates, he sports a sprout on his head due to Lily's powers. He has very large lips like Usopp, with a pudgy body and stubby legs similar to Foxy. He wears an unbuttoned black coat with no shirt and shorts. While physically he appears weak, he was able to withstand a giant wave made by Rosario like nothing happened."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Muchigoro is not the smartest member of his crew, as shown quite early in the movie. He is really easy to fool, as he believed all of Usopp's lies to the point of crying. He is also short-tempered when the Straw Hats fail to pronounce his name properly and has a temper tantrum, only to be calmed down when his captain told him to stop messing around. He cares deeply for his crew and his pet, Rosario, and got mad when Zoro tried to use his swords on her. He also began to cry when Sanji kicked Rosario."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [], "images": []}, {"title": "Omatsuri", "level": 4, "content": [{"type": "paragraph", "text": "Muchigoro was extremely loyal to Omatsuri and would’ve done anything to please him, telling his captain that he would win the first Trial of Hell. He also trusted his captain’s word greatly, believing that his reincarnation was due to his strength and returning to the resort by order without question."}], "images": []}, {"title": "Rosario", "level": 4, "content": [{"type": "paragraph", "text": "Muchigoro cared greatly for his pet, Rosario, and didn’t want her to be hurt at all. This was shown when Zoro and Sanji were brutally knocking her back and forth to get her in the Straw Hat Pirates’ bucket, causing Muchigoro to become furious and cry excessively for his beloved pet."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Muchigoro, as the Straw Hat Pirates opponent in the first Trial of Hell, had a competitive distaste for the crew. Due to his gullibility, he easily fell for Usopp’s lies about his strength and was intimidated by the sniper. He grew angry with Usopp after learning that he had been lied to. He also disliked Zoro and Sanji for being quite rough with Rosario."}, {"type": "paragraph", "text": "Muchigoro seemed quite weak against Robin and Nami’s intelligence, since he was convinced to drink excessively by both of them. Since he had to follow the orders of the victors of the Trials of Hell, he had to follow Robin commands, including to drink with her. Nami, however, flirted with the pirate, causing him to listen to her. Both of them manipulated him into revealing information about his crew, yet Muchigoro never realized that he was being manipulated and didn’t form any dislike towards either woman."}], "images": []}, {"title": "Tearoom Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Muchigoro, having defeated the Tearoom Pirates in the first Trial of Hell, had little respect for the crew."}], "images": []}, {"title": "Gol D. Roger", "level": 4, "content": [{"type": "paragraph", "text": "Muchigoro, despite being enemies with Gol D. Roger, had great respect for the King of the Pirates. When speaking to Nami, he said that Omatsuri's strength rivaled Roger's, showing that the two crews had some sort of rivalry."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Muchigoro seems to be a strong pirate for the most part. His combat skills are largely unknown, as he did not fight throughout the movie and only participated in the Goldfish Catching Game. He is, however, able to use his giant paper fishnet to catch Rosario with little effort. He is also able remain standing when the wave made for Rosario knocked the Straw Hats down."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Muchigoro%27s_Fish_Net.png/revision/latest/scale-to-width-down/180?cb=20131013155041", "caption": "Muchigoro carrying his giant fish net."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Many years ago, Muchigoro joined the Red Arrows Pirates. They sailed on the Grand Line back when Gol D. Roger was still alive. At some point, there was a terrible storm that killed Muchigoro and the rest of the crew, leaving Omatsuri alone. Eventually, the lonely captain arrived on Omatsuri Island and met the Lily Carnation, which he used to revive Muchigoro and the rest of the crew. Since then, they have been attracting pirate crews to the island to break them up and feed them to the plant monster."}], "images": []}, {"title": "Baron Omatsuri and the Secret Island", "level": 3, "content": [{"type": "paragraph", "text": "He participated in the first Trial of Hell issued by Baron Omatsuri against the Straw Hats, in which they had to catch his giant goldfish Rosario. The Straw Hats tried multiple times to catch the giant goldfish but had no success. Muchigoro pulled out a giant fish net and called his pet over. He almost managed to get Rosario in his bucket, but Robin used her abilities to prevent the fish from going in. The Straw Hats roughly knocked the fish around, causing Muchigoro great distress. Chopper eventually managed to knock the giant goldfish into their bucket with his guard point, defeating Muchigoro."}, {"type": "paragraph", "text": "After being defeated, he approached Robin and served her as a waiter. He said that following all orders of the victors was a rule on the island. Robin took advantage of this new found ability and made him toast the resort. After a few drinks, the devious pirate managed to get him to reveal the name of Omatsuri's flower, Lily Carnation, by getting him drunk."}, {"type": "paragraph", "text": "That night, Nami sat with Muchigoro during the cooking competition after Usopp bothered her. He panicked at first, but they eventually got talking. Nami also tried to get information out of him by getting him drunk again, getting him to reveal that they were around during the time of Gol D. Roger and that there was a \"horrible storm\". Suddenly, Muchigoro withered and died."}, {"type": "paragraph", "text": "After Lily was fed again, he came back to life, but he turned back into a plant root after Lily's death along with the rest of the Red Arrows."}, {"type": "paragraph", "text": "When Omatsuri was dying, Muchigoro told him from the afterlife that he should have found new crewmates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e0/Muchigoro_Catches_Rosario.png/revision/latest/scale-to-width-down/180?cb=20131013155334", "caption": "Muchigoro catches Rosario."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Muchigoro_Shrivels_in_Front_of_Nami.png/revision/latest/scale-to-width-down/180?cb=20190428205413", "caption": "Muchigoro shrivels in front of Nami."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Muchigoro vs. the Straw Hat Pirates (in the Goldfish Catching Game)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Despite all the revived Red Arrows Pirates having sprouts on their heads, his pet goldfish, Rosario, does not. Since Baron Omasturi states that all of his crew were killed before he used Lily to revive them, Rosario was probably not used by Muchigoro when he was alive.", "elements": []}, {"text": "Muchigoro said that Baron Omasturi and his crew have met Gol D. Roger.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Movie 6, Muchigoro is introduced.", "elements": []}]}], "images": []}]}