{"sections": [{"title": "Kotetsu (Non-Canon)", "level": 1, "content": [{"type": "paragraph", "text": "Kotetsu was a large, ape-like member of the Red Arrows Pirates, who appeared in the sixth One Piece movie."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kotetsu was a large tan man, with shaggy black hair in the back of his head, and one curl in his forehead. He also had a goatee split in two. He had big, pink lips, a large lower jaw and chin. His arms were similar to Franky's, with his upper arms being thin while his forearms and wrists were large. He also had a large stomach and short, almost stubby legs."}, {"type": "paragraph", "text": "Normally, Kotetsu wore baggy pink and yellow pants with a dark brown sash and didn't wear a shirt. He also wore a white turban-like hat with a red dot on it, a dark pink sash with gold dots and a golden flower broach on it, black shoes, and gold jewelry on his neck, wrists, and biceps. When cooking, he sported a tall chefs hat, with a white and brown short sleeved shirt. He had giant spatulas on his back."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kotetsu seemed to be loyal to the Red Arrows Pirates, willing to fight a Straw Hat Pirate for them. He also seemed to be an honorable person, admitting defeat at the hands of Sanji."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Omatsuri", "level": 3, "content": [{"type": "paragraph", "text": "Kotetsu held Omatsuri, his captain, in the highest regards. When Omatsuri entered the afterlife, Kotetsu thanked him for remembering his old crew and said he should’ve found new crew mates."}], "images": []}, {"title": "Sanji", "level": 3, "content": [{"type": "paragraph", "text": "When Sanji challenged Kotetsu in the cooking competition, Kotetsu said he would defeat Sanji easily. However, Sanji stole Kotetsu’s dish and created a better, more elegant meal. Kotetsu admitted defeat and, from then on, respected the pirate for his cooking expertise."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kotetsu was the chef of the group and cooked an enormous meal on a gigantic skillet. He used oil-soaked sponges for skates and giant metal spatulas. So far, only one of his dishes has been named."}, {"type": "list", "elements": [{"text": "Omatsuri Island Yakisoba: A concoction of varying sea creatures and vegetables grilled with noodles and topped with oyster sauce, seaweed flakes, and a dash of red, pickled ginger", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/78/Kotetsu%27s_Dish.png/revision/latest/scale-to-width-down/180?cb=20131013173455", "caption": "Kerojii puts the finishing touches in his Omatsuri Island Yakisoba."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Many years ago, Kotetsu joined the Red Arrows Pirates. They sailed on the Grand Line back when Gol D. Roger was still alive. At some point, there was a terrible storm that killed Kotetsu and the rest of the crew, leaving Omatsuri alone. Eventually, the lonely captain arrived on Omatsuri Island and met the Lily Carnation, which he used to revive Kotetsu and the rest of the crew. Since then, they have been attracting pirate crews to the island to break them up and feed them to the plant monster."}], "images": []}, {"title": "Baron Omatsuri and the Secret Island", "level": 3, "content": [{"type": "paragraph", "text": "In the movie, Kotetsu was usually seen standing next to Omatsuri. During the goldfish challenge, he carried an umbrella over Omatsuri's head to prevent himself and his captain from getting wet."}, {"type": "paragraph", "text": "Later, he and Sanji engaged in a cooking battle. They used the sponges and spatulas to take food from each other to make their own creations. When Kotetsu was adding the finishing touches to his Omatsuri Island Yakisoba, Sanji stole his entire dish and incorporated it into his own. The giant, grand creation was enough for Kotetsu to admit defeat and forfeit."}, {"type": "paragraph", "text": "Later, Kotetsu turned into a plant when Lily Carnation died. From the afterlife, he thanked his captain for remembering his crew and told him that he should've found new crewmates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/87/Sanji_Defeats_Kotetsu.png/revision/latest/scale-to-width-down/180?cb=20131013225031", "caption": "Kotetsu is defeated by Sanji."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kotetsu vs. Sanji (in a cooking battle)", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name, Kotetsu (鋼鉄, Kōtetsu), means \"steel\" and possibly is a reference to his skillets.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Movie 6, Kotetsu is seen next to Omatsuri.", "elements": []}, {"text": "↑  One Piece Movie 6, Kotetsu is revealed to be the crew's chef.", "elements": []}, {"text": "↑  One Piece Movie 6, Kotetsu accepts Sanji's cooking challenge.", "elements": []}, {"text": "↑  One Piece Movie 6, Kotetsu's cooking abilities are bested by Sanji's skill.", "elements": []}, {"text": "↑  One Piece Movie 6, Kotetsu speaks to Omatsuri from the afterlife.", "elements": []}, {"text": "↑  One Piece Movie 6, Omatsuri reveals the former fate of his crew.", "elements": []}]}], "images": []}]}