{"sections": [{"title": "Utan Divers", "level": 1, "content": [{"type": "paragraph", "text": "The Utan Divers (ウータン・ダイバーズ, Ūtan Daibāzu) are a group of divers who composes the Shoujou Pirates on Shoujou's ship, the Utan Sonar. They each have a specific Diver Number. The Straw Hat Pirates met them in Jaya."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Like their captain, the Utan Divers look like monkeys. They also wear wetsuits that only have openings for their faces and ears, exaggerating their monkey-like-appearance, and they all have antennae at the top that can attach together during dives. The suits have the letters “SJ” on them, signifying that they are members of the Shoujou Pirates. They also wear mittens on their hands and flasks on each side of their hips that are held up by harnesses they wear across their chests."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "The Utan Divers are rather serious, reporting to their captain in a terse, regimented style. When reporting to their captain, they often stand at attention."}, {"type": "paragraph", "text": "Like their captain, the Divers are not always the brightest, as they were unaware of the Straw Hat Pirates’ ship until it was almost right in front of them."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Shoujou", "level": 3, "content": [{"type": "paragraph", "text": "The Divers deeply respect their captain and are quick to defend him when he is insulted. He usually tells them not to worry but always admits to being hurt by the insults he receives, showing how well the Divers understand him."}], "images": []}, {"title": "Monkey D. Luffy", "level": 3, "content": [{"type": "paragraph", "text": "Luffy gave the Utan Divers a Hercules beetle he found in the forest, and the Divers were very thankful to receive it. They kept the beetle as a pet and have it in a small cage."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b9/Utan_Divers_and_Their_Pet_Hercules_Beetle.png/revision/latest/scale-to-width-down/180?cb=20190531030052", "caption": "The Divers and the Hercules beetle Luffy gave them."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The Utan Divers are experts at underwater locating, and as such, wear wetsuits most of the time. These locating skills are the product of their impeccable hearing. When they work together, they are able to locate schools of fish, identify the kind of fish, and measure their rate of travel. They can also determine the size and location of enemy ships, as well as ocean current patterns."}], "images": []}, {"title": "Techniques", "level": 3, "content": [{"type": "list", "elements": [{"text": "Search Sonar (, Sāchi Sonā), a technique where their captain, Shoujou, releases sound waves through a microphone and speaker while the Divers, forming a circle underneath the sea, use their hearing and cupped hands held up to their ears to scan the area around them.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/40/Search_Sonar.png/revision/latest/scale-to-width-down/180?cb=20190531024118", "caption": "Search Sonar"}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, the Utan Divers joined the Shoujou Pirates. After Shoujou joined the Saruyama Alliance, he and the Utan Divers found a bell-shaped gold ingot and showed it to Cricket."}], "images": []}, {"title": "Jaya Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Utan Divers prepared the Search Sonar with their captain and dove under the sea on his command. Listening to their surroundings, Utan Diver Number 27 located and reported to Shoujou about a school of saurels for them to eat. Utan Diver Number 4 located and reported on a small sailing vessel, but when asked where it was, Shoujou threw a barrel at him, annoyed that he had not located the ship sooner. The Divers returned to the ship, and they confronted the Straw Hat Pirates with their captain. They defended their captain when Luffy called him stupid, but when their captain started using his sonar attack while on their ship and damaged it, the Divers were unable to shout loud enough to get him to stop."}, {"type": "paragraph", "text": "When Luffy came back from defeating Bellamy, he shouted that he found something, and the Utan Divers watched intently. It was only a Hercules beetle, but when Luffy offered it to them as he was preparing to leave for Skypiea, they gladly accepted it. They posed and shouted when Cricket gave them the order to help the Straw Hat crew. Sailing towards the Knock Up Stream, the Utan Divers warned Luffy and the others to calm down their antics, as they were making Shoujou nervous. A storm began approaching, so Shoujou and the Divers used Search Sonar to scan the area. The Divers located a giant current, a large sea creature, and a wave moving against the current, indicating a possible whirlpool and the location of the Stream."}], "images": []}, {"title": "Skypiea Arc", "level": 3, "content": [{"type": "paragraph", "text": "As Luffy destroyed the Golden Belfry, the bell rang down to the sea below. The Utan Divers and the rest of the Saruyama Alliance were shocked and pleased to hear it, as it confirmed that El Dorado was real."}], "images": []}, {"title": "Long Ring Long Land Arc", "level": 3, "content": [{"type": "paragraph", "text": "With El Dorado’s existence confirmed, Cricket called off the search to the Saruyama Alliance. The Utan Divers and the others were worried that it meant the end of the Alliance, but they were pleased when Cricket asked what legend they wanted to chase next."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, an Utan Diver is seen with Shoujou, Cricket and Masira, looking for the island of dreams, Nakrowa."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f0/The_Saruyama_Alliance_Reads_About_the_Straw_Hats%27_Return.png/revision/latest/scale-to-width-down/210?cb=20170319012832", "caption": "The Utan Divers and the rest of the Saruyama Alliance reading about the Straw Hats' return."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Divers name may be based off uta (歌, uta meaning \"song\"), which related to their use of sounds and their captain’s musical theme.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 24 Chapter 226 (p. 8-11, 13-17) and Episode 147, The Utan Divers make their debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 235 (p. 3, 6-7, 12-14) and Episode 152, The Utan Divers locate the Knock Up Stream.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 32 Chapter 299 (p. 10, 13-14) and Episode 193, The Saruyama Alliance learns that El Dorado was real.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 25 Chapter 231 (p. 13) and Episode 150, Shoujou and the Utan Divers find a bell-shaped gold ingot.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 32 Chapter 303 (p. 2-3) and Episode 195, The Saruyama Alliance decides to start chasing their next legend.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 65 Chapter 643, cover story: From the Decks of the World Vol. 26, The Saruyama Alliance searches for Nakrowa, the island of dreams.", "elements": []}]}], "images": []}]}