{"sections": [{"title": "Hyouzou", "level": 1, "content": [{"type": "paragraph", "text": "Hyouzou is a poisonous blue-ringed octopus merman. Prior to his imprisonment, he was a mercenary and working as the New Fish-Man Pirates' assassin, and later became one of the officers. Hyouzou was also known as the best swordsman on Fish-Man Island."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Being an octopus merman, Hyouzou has six massive orange octopus tentacles in place of legs with large motifs vaguely reminiscent of eyes on them, making eight limbs with his two arms. He has a standard, slim pink upper body and two human arms. He has black medium-length hair in dreadlocks. He's usually seen with a sleepy look on his face and an unusually large mouth that protrudes out from his face."}, {"type": "paragraph", "text": "He usually has a toothpick in his mouth, wears a blue unbuttoned shirt with the sleeves rolled up, an untied tie hanging around his neck over his chest, and a jacket which is draped over his shoulders like a cape. His left arm is usually pulled through from his shirt and is seen holding a katana that lacks a guard and is kept in a sheath covered in elongated spot motifs. Hyouzou also carries around a gourd that he often drinks his alcohol from."}, {"type": "paragraph", "text": "After overdosing on Energy Steroids, his appearance changes (like Hody) with his hair turning white and slicked back. After the negative effects of the Energy Steroids appeared, his body became old and weak with his hair now unkempt and shaggy and he grew a new beard."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hyouzou has a laid-back and calm demeanor. He seems to be annoyed by noisy people, as is evident by his distaste toward the ruckus made by the Mermaids of the cove. He likes to drink and when he gets drunk, he will blindly attack anyone around him, whether enemies or allies."}, {"type": "paragraph", "text": "He has an evident interest in money, being a mercenary for hire who ends up only working for those of the highest bidder, to the point that he would not even help Arlong invade East Blue because the Fish-Man was tight with his money and would not pay his fee. Apparently, he's not interested in the goals of the faction he's working for, as long as he receives payment. However, although he has no interest in the goals of the New Fish-Man Pirates, he is shown to be very efficient when he does have a client as shown when he forced the Fish-Man Island citizens to comply with the New Fish-Man Pirates. Since he was hired help, he himself did not share as much of the same views as others working for Hody, but was no better due to his role in life. Despite priding himself as the best swordsman of Fish-Man Island, he does not seem to have the honor of one, as he tried to kill Zoro with a sneak attack from behind, which has often been referred as a shame for a swordsman. He can be angered when he is insulted, as shown during his fight with Zoro when his opponent called him a \"frog\"."}, {"type": "paragraph", "text": "He is well acquainted with Hatchan, and seems to look down on him for the Fish-Man's skills in swordsmanship and says Arlong would have taken him if it was not for his money problems. He apparently has developed a sense of intrigue with Luffy, as he stated he thought it would be a shame if Luffy died from his poison. He can be sarcastic since he claimed that he felt bad for Arlong for recruiting Hatchan."}, {"type": "paragraph", "text": "After his transformation from Energy Steroids overdose, his personality changes: even when drunk, bystanders note that he has seemingly developed a lust to cut anything - even his own allies - as opposed to simply attacking blindingly. Despite his lack of interest in the New Fish-Man Pirates' goals of extreme misanthropy, he was willing to use large amounts of Energy Steroids to accomplish his goals, knowing that it would shorten his lifespan; he showed the dangerous move of mixing alcohol (depressant) with drugs (stimulant) together."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Prior to his defeat and rapid aging, Hyouzou was a mercenary, the strongest swordsman on Fish-Man Island, and the assassin of the New Fish-Man Pirates. He claimed he was not assisting them for common goals, but simply because he was hired for it: the fact that the crew resorted to hire a merman mercenary tells a lot about Hyouzou's abilities. Even though he is a freelancer assassin for the crew, he still appeared to be an officer of his crew as. Just like the other officers, he led a squad of their crew during their takeover of the island, and when the other officers were arrested and imprisoned, Hyouzou was alongside them instead of the lower-ranking members, who were merely sentenced to work off their debt to society. He also has a very strong-will, as he was completely unaffected by Luffy's Haoshoku Haki blast."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Hyouzou was one of the strongest members of the New Fish-Man Pirates. He could block Luffy's punch (even though he was still greatly pushed back by the attack's sheer force), showing off incredible speed, given that Luffy was in Gear Second mode at the time, and stamina, as he was able to walk away without any visible injuries while his two companions were out-cold and bleeding, yet carrying them both who were very large Fish-Men with his tentacles while in a slightly drunken state. He could apply extreme force in his swordsmanship, easily taking down several Fish-Men who were noted to have superior physical strength ten times that of regular humans. While Luffy himself acknowledged Hyouzou as a strong individual, Zoro on the other hand did not consider Hyouzou as a worthy opponent, effortlessly defeating Hyouzou even though the mercenary was powered by Energy Steroids and had his swords coated in his own poison."}, {"type": "paragraph", "text": "Hyouzou is capable of secreting venom from his tentacles and poisoning his opponents through a mere, short-lasting physical touch, as Luffy was poisoned by rapidly punching him. His venom is dark green in the anime. Hyouzou was subsequently concerned that his poison might have killed the Straw Hats' captain (Chopper confirmed it was deadly poison when testing Luffy's blood); Luffy, however, easily fought it off, due to being exposed to a variety of intense poisons during his fight with Magellan two years earlier. Also, as a merman, he is a fast swimmer."}, {"type": "paragraph", "text": "However, after the negative effects of the Energy Steroids took effect, he became weak and old, stripping him of all strength, save for his poison which is natural to the type of merman he is."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c8/Hyouzou_Generating_Poison.png/revision/latest/scale-to-width-down/210?cb=20130317172951", "caption": "Hyouzou creating venom to use against Zoro."}]}, {"title": "Alcohol", "level": 3, "content": [{"type": "paragraph", "text": "Hyouzou can become stronger by drinking alcohol, being referred to as a drunken assassin. While in a heavily drunken state, his physical strength and speed significantly increased to the point he can easily take down multiple Fish-Men at once with little effort."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Hyouzou was the strongest swordsman on Fish-Man Island and a master of Hattoryu. Hyouzou showed fearsome versatility and power in his swordsmanship greatly surpassing Hatchan, a highly skilled octopus swordsman, swinging three swords to easily take down members of the New Fish-Man Pirates, and in the anime cut apart and demolished an entire building with his sword skills. His last resort appears to be coating his ten swords with his deadly venom. However, after his defeat and his body became weak, it is unlikely he is capable of any swordsmanship close to the level he could do when he was younger."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Hattoryu_Infobox.png/revision/latest/scale-to-width-down/210?cb=20141206184746", "caption": "Hyouzou's swordsmanship (while drunk)."}]}, {"title": "Energy Steroids", "level": 3, "content": [{"type": "paragraph", "text": "Like the rest of the crew, Hyouzou had taken the Energy Steroids during the battle against the three princes of Ryugu Kingdom, who are crowned the strongest soldiers in the entire island, and was able to overpower them due to this. The drug doubles his strength per pill, but shaves off a portion of his lifespan. After he overdosed on Energy Steroids, he underwent a transformation similar to Hody, in which his hair turned white, and was afterwards able to cut iron with ease. The pills, however, had another side effect of making him old and weak after he was arrested, which causes him to lose all the strength he naturally had."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Hyouzou uses a katana and seven sabers for combat."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He was offered a position by Arlong to join his crew, but Hyouzou denied him since Hyouzou only cared about money. Since Arlong had a tight wallet, he could not compensate him."}, {"type": "paragraph", "text": "Some time prior to the current storyline, he was employed by the New Fish-Man Pirates as an assassin since Hody Jones was more willing to pay for his services than Arlong."}], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [], "images": []}, {"title": "The New Fish-Man Pirates' Coup d'État", "level": 4, "content": [{"type": "paragraph", "text": "Hyouzou, Hammond, and Kasagoba approached the Straw Hat Pirates when they arrived just outside of Fish-Man Island. The Straw Hats refused to become the Fish-Men's subordinates and escaped the Sea Beasts using Coup de Burst. After the Thousand Sunny crashed through the bubble surrounding Fish-Man Island, Hyouzou wondered if the Straw Hats were still alive."}, {"type": "paragraph", "text": "After receiving orders from Hody Jones to bring Straw Hat Luffy to him, Hyouzou, Hammond, and Kasagoba found Monkey D. Luffy, Usopp, Chopper, and Sanji at Mermaid Cove. After Sanji suffered a massive nosebleed, the Fish-Men pirates attempted to capture the four Straw Hats but Luffy was able to repel them. Hyouzou managed to avoid the full force of Luffy's attack by blocking him. He also inadvertently poisoned Luffy when the latter struck him."}, {"type": "paragraph", "text": "After the fight, he carried his unconscious crew mates away and commented that it would be bad if Luffy died, unaware that Luffy had developed an immunity to poison."}, {"type": "paragraph", "text": "Later, when Hatchan showed up in the Fish-Man District and warned all the people there not to take Neptune lightly, and to quit the rebellion, Hyouzou watched as Hody opposed Hatchan's views. When asked by Hatchan why he did not answer to the call of Arlong in the past, while now he was assisting Hody, someone younger than him, Hyouzou replied that he was only hired by the New Fish-Man Pirates and that Arlong could not afford him and could only manage to appoint a swordsman of Hatchan's caliber."}, {"type": "paragraph", "text": "Once Hody and Vander Decken IX commenced their attack on Ryugu Palace, Hyouzou rode with the New Fish-Man Pirates on top of sea beasts. Hyouzou said that he would cut if he was told to do so. The New Fish-Man Pirates split up to spread terror at other locations. Hyouzou went to the Fish-Man's Meeting Hall at the southwest side of Fish-Man Island. As the invasion commenced, Hyouzou forced the Fish-Man Island citizens to step on the fumi-e of Queen Otohime. He told them that they either step on the fumi-e or get off the island. Otherwise, he would cut them."}, {"type": "paragraph", "text": "Hyouzou then got seriously drunk. One of the New Fish-Man Pirates tried to snap him out of it, but Hyouzou thoughtlessly attacked anyone around him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9d/Hyouzou_Carrying_Hammond_and_Kasagoba.png/revision/latest/scale-to-width-down/210?cb=20141206221115", "caption": "Hyouzou carrying Hammond and Kasagoba away after a fight with Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/03/Step-on_Or_Step-out.png/revision/latest/scale-to-width-down/210?cb=20130226145746", "caption": "Hyouzou terrorizing the island's citizens."}]}, {"title": "Battle for Fish-Man Island", "level": 4, "content": [{"type": "paragraph", "text": "The New Fish-Man Pirates soon gathered at Gyoncorde Plaza, and Neptune's army attempted to save the king but were thwarted by the Sea Beasts. Hyouzou and the other officers noticed a soldier trying to attack them with dynamite and drunkenly mumbled something about it. Hody stopped the soldier's attempt with Water Shot. After the three princes arrived and defeated the Sea Beasts, Hyouzou and the other officers prepared for battle by taking Energy Steroids. When the princes were defeated and tied up, Hyouzou fell asleep against a rock."}, {"type": "paragraph", "text": "After Luffy and Hody left to confront Decken on Noah, Hyouzou consumed a large number of energy steroids and more booze. He then underwent a transformation much like Hody. In a drunken frenzy, he attacked anyone near him, regardless of whose side they were on. He set his sights on Nico Robin and charged at her. Roronoa Zoro blocked the merman's attack, and the two started to fight. Despite Zoro paying so little attention to the fight that he was able to talk to Chopper, Hyouzou was not able to hurt Zoro. When he tired of the fight, Zoro cut the merman's swords to pieces with one attack and commented that Hyouzou was not strong enough to kill his boredom."}, {"type": "paragraph", "text": "When Zoro seemingly lowered his guard and insulted his opponent by calling him a frog, an angered Hyouzou drew new swords, coated them with his own poison, and attempted a sneak attack while yelling that he is the best swordsman on Fish-Man Island. Zoro effortlessly cut down Hyouzou, defeating him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7a/ZorovsHyouzouV2.png/revision/latest/scale-to-width-down/210?cb=20141206214458", "caption": "Hyouzou's attack intercepted by Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f5/Rengoku_Onigiri.png/revision/latest/scale-to-width-down/210?cb=20140801003555", "caption": "Hyouzou is defeated."}]}, {"title": "Imprisonment", "level": 4, "content": [{"type": "paragraph", "text": "After the battle was over, Neptune sentenced him to prison, along with Hody, the other officers of the New Fish-Man Pirates, and Decken. Sometime later, he became conscious along with the other New Fish-Man leaders, and their bodies were old and weak due to the Energy Steroids. Hyouzou was still drunk and complained that his joints were hurting."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Hyouzou, Hammond, and Kasagoba vs. Monkey D. Luffy", "elements": []}, {"text": "Hyouzou and the New Fish-Man Pirates' Officers vs. Fukaboshi, Ryuboshi and Manboshi (unseen)", "elements": []}, {"text": "Hyouzou vs. Roronoa Zoro", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name comes from hyōmon-dako (ヒョウモンダコ, hyōmon-dako), the Japanese name for blue-ringed octopus.", "elements": [{"text": "The blue-ringed octopus is considered one the most venomous marine animals.", "elements": []}]}, {"text": "He was called the \"Drunken Manslayer\" (人斬り上戸, Hitokiri Jōgo) by the New Fish-Man Pirates members, but this was more of a description of his personality and profession rather than a true moniker.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Blue-Ringed Octopus – Wikipedia article about the type of Merman Hyouzou is.", "elements": []}]}], "images": []}]}