{"sections": [{"title": "Tightrope Walking Funan Bros", "level": 1, "content": [{"type": "paragraph", "text": "The Tightrope Walking Funan Bros is a trio of pirates within the Buggy Pirates."}, {"type": "paragraph", "text": "The leader of the three wears a beanie hat with their crew's jolly roger on it, while the other two are a dark-skinned pirate and an orange-haired pirate."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The first member of the trio is a pale-skinned man that has strongly defined cheekbones and jawline. He wears a black beanie hat with a light green pompom and the Buggy Pirates' jolly roger, a deep-V orange shirt with purple around the openings, a green sash around his waist, and maroon shorts."}, {"type": "paragraph", "text": "The second member of the trio is a chubby, dark-skinned man with a round face with shaved, brown hair. He wears an open black vest, an army green sash, and white baggy pants. He also has a crescent-shaped unibrow and beard that curve upwards. Around his neck, he wears a necklace with a pendant in the shape of an anchor."}, {"type": "paragraph", "text": "The third member of the trio is a man with lightly tanned skin that has orange sideburns and orange, puffy hair that creates an oblong shape. He wears a yellow and purple-striped sleeveless shirt, a turquoise sash, and dark gray baggy pants. He also has thick lips and a set of baggy eyes."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "All three members of the trio are greedy as they only wanted to help Nami for her supposed treasure chest. Furthermore, they are also an ungrateful bunch because they tried to attack Zoro even though he had just saved them after they were shipwrecked. However, they are also very cowardly in the face of powerful individuals in that they immediately apologized to Zoro after learning who he was and were worried about what Buggy would do to them if they returned empty-handed."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Buggy", "level": 3, "content": [{"type": "paragraph", "text": "The Tightrope Funan Bros are somewhat scared of their captain, as shown when they were afraid to tell him that Nami stole their treasure. Furthermore, they also think that he is a very powerful and dangerous man, as shown when they told Zoro."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "In the anime, it is shown that the Tightrope Walking Funan Bros have great respect for their captain. They cried when Buggy disappeared following his defeat at the hands of Luffy and rejoiced when he returned. Likewise, they cried tears of joy after Buggy escaped Impel Down and reunited with them. Furthermore, they also have great trust and high hopes in their captain, even when Buggy is doing stuff on a whim and, in reality, is only thinking about himself. Like their other crewmates, they have displayed great admiration for Buggy."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Tightrope_Walking_Funan_Bros_Cry.png/revision/latest/scale-to-width-down/180?cb=20190118034836", "caption": "The Tightrope Funan Bros cried when Buggy returned to them."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Overall, the trio is extremely weak, at least, in comparison to Zoro, as he easily beat them up even though the leader of the three was wielding a sword. However, the three of them were more than enough to rob a small ship of civilians."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Orange Town Arc", "level": 4, "content": [{"type": "paragraph", "text": "While returning with a treasure chest filled with loot after robbing a ship, the Tightrope Walking Funan Bros encountered a small boat and sailed up to it. When they got close, they saw Nami keeled over on the side of the boat and went up to check on her. Nami pretended to be nauseous and asked them for water and bread in exchange for a treasure chest. Easily deceived, the three rushed onto her boat to check out the treasure, only for Nami to steal their ship and treasure in the process. Before they could properly respond, the storm that Nami had predicted arrived and sank the boat they were on."}, {"type": "paragraph", "text": "After some time, the stranded trio encountered Zoro while he was rowing towards them. They screamed out for help and Zoro told them to jump on while the boat was still in motion. When they got on, the leader of the three took out a sword and demanded that Zoro hand the boat over to them. However, Zoro easily beat them up, causing them to end up with swollen faces. They then apologized to Zoro and started to row the boat for him after learning that he was the famed Pirate Hunter. Zoro then asked them why they were stranded in the middle of the ocean, to which they told him about their encounter with Nami. Afterwards, the dark-skinned Funan Bro asked the other two what they should tell Buggy, leading to Zoro asking who Buggy was. The trio then told him about their captain with a Devil Fruit ability and took him to the town they were occupying. They then saw Zoro off while they pondered how to break the bad news to Buggy."}, {"type": "paragraph", "text": "After Buggy is defeated, Luffy, Nami, and Zoro walked back to the ship docked at the harbor that Nami had stolen from the Funan Bros. From on board the ship, the Funan Bros leapt out and told Nami that they had been waiting for her. The leader of the three than noticed that Nami was accompanied by two others and decided that they all needed to be taught a lesson. He then walked up to Nami's exhausted green-haired companion who had his head down, rudely patted him on the head multiple times, and demanded that he raise his head. To his and his comrades' shock, the man turned out to be Zoro and so, when they saw his face, the three immediately jumped into the water in fear and swam away as fast as they could."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5f/Tightrope_Walking_Funan_Bros_Bruised.png/revision/latest/scale-to-width-down/200?cb=20190117031847", "caption": "The Funan Bros are beaten by Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Tightrope_Walking_Funan_Bro_Pats_Zoro.png/revision/latest/scale-to-width-down/180?cb=20190117033904", "caption": "The Funan Bros unexpectedly see Zoro again."}]}, {"title": "Buggy's Crew Adventure Chronicles", "level": 4, "content": [{"type": "paragraph", "text": "After the crew was chased out of Orange Town by the villagers, they escaped back onto their ship, with Cabaji and Mohji calling roll to make sure that everyone had made it on board. In response, the dark-skinned Funan Bro and the orange-haired Funan Bro made sure that Mohji knew that they had gotten on. The two then cried when one of their crew members pointed out that their captain was gone."}, {"type": "paragraph", "text": "Afterwards, the crew landed on an island and held a funeral for Buggy. The three Funan Bros wept alongside the entire crew and, while wiping away tears, the leader of the three commented on how he had previously thought that Buggy was cold-hearted and a horrible person, but now realized he was a bold and open-hearted captain. Similarly, the dark-skinned Funan Bro reminisced about how they had only been able to rampage about because of Buggy."}, {"type": "paragraph", "text": "Later, during Mohji and Cabaji's fight for the position of captain, the orange-haired Funan Bro supported Mohji, whereas the other two supported Cabaji. The next day, due to both Cabaji and Mohji being knocked out by Richie, it was decided that the lion was the winner and, in response, the dark-skinned Funan Bro cheered for \"Captain Richie.\" However, the celebration was cut short when the Kumate Tribe appeared and confronted the crew. In fear, the three Funan Bros and the rest of the crew hid behind their new captain."}, {"type": "paragraph", "text": "However, Richie and the entire crew were easily beaten and were captured by the Kumate Tribe for their meal. But before they could be boiled alive, Buggy returned alongside Alvida, Mohji and Cabaji, and the Kumate Tribe were defeated. The Funan Bros cried in joy when they saw that their captain was still alive and fell to their knees saying that their hardships during Buggy's absence were nothing. The Funan Bros' leader then asked Buggy who the beautiful woman standing next to him was, to which Buggy revealed that she was the one that saved him."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/57/Tightrope_Walking_Funan_Bros_Support_Cabaji.png/revision/latest/scale-to-width-down/145?cb=20190117174322", "caption": "Two Funan Bros support Cabaji for captain."}]}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Buggy Pirates later arrived at Loguetown in search of the Straw Hat Pirates so that Buggy could exact revenge on Luffy."}, {"type": "paragraph", "text": "After Buggy recovers after failing to execute Luffy due to being hit by lightning, the Buggy Pirates had already been engulfed in a battle with the Marines. Buggy then stated that he did not care if the Marines were to stick their nose into their business. However, upon hearing something similar to a \"nose was sticking out,\" Buggy immediately questioned whose nose was being talked about and punched the Funan Bros' leader in the face, even though Buggy was the one that had said it. Before passing out, the Funan Bro exclaimed that he had not said anything. Later, when Buggy and Alvida prepared to chase after Luffy, the orange-haired Funan Bro cheered on Buggy as he transformed into his Bara Bara Car, while the dark-skinned Funan Bro helped Alvida set up her ramp for her Sube Sube Spur. Although they are subsequently easily captured by Smoker, they were eventually able to escape."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/36/Buggy_Punches_Tightrope_Walking_Funan_Bro.png/revision/latest/scale-to-width-down/180?cb=20190117053141", "caption": "Buggy punches a Funan Bro for something he said himself."}]}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Jaya Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Buggy, Mohji, and Cabaji returned without Captain John's treasure, the orange-haired Funan Bro and dark-skinned Funan Bro booed their captain for getting the location wrong. The two then cheered and celebrated alongside some other crewmates when Buggy revealed that the Straw Hats' bounty going up would be good because his own would go even higher once he defeated them."}, {"type": "paragraph", "text": "After Portgas D. Ace crashed their \"celebration\" party, the Funan Bros watched on as Ace seemed to disregard the fact that he appeared out of nowhere. When Cabaji revealed that the man before them was the second division commander of the Whitebeard Pirates, the whole crew fell into a state of shock, especially when he suddenly fell asleep. Right after Buggy finished talking about how they better not harm any of Whitebeard's men, Ace suddenly awoke, which scared the orange-haired Funan Bro who had been standing behind him. However, the crew eventually went back to partying alongside Ace."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Buggy_Meets_Ace.png/revision/latest/scale-to-width-down/165?cb=20130202183220", "caption": "Portgas D. Ace surprises the Buggy Pirates."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Impel Down Arc", "level": 4, "content": [{"type": "paragraph", "text": "When Mohji and Cabaji were begging Alvida to let them rescue Buggy from Impel Down, the orange-haired Funan Bro was part of the group of pirates that were crying and that wanted to go rescue Buggy. When Richie began crying for food, the Funan Bro and the rest of the group misinterpreted him and then hugged him, thinking that he was worried about Buggy as well. However, Alvida made it clear to them that the ones that wanted to go to Impel Down would have to fit into a small boat while she took the Big Top. After being told that they would probably die before getting there, the group called off their plans to save Buggy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ee/Rescue_Buggy_Squad.png/revision/latest/scale-to-width-down/159?cb=20190121035055", "caption": "The Rescue Buggy Squad."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the crew is reunited with Buggy, the Funan Bros and the rest of the Buggy Pirates cried tears of joy now that their captain was back."}], "images": []}, {"title": "During the Timeskip", "level": 3, "content": [], "images": []}, {"title": "3D2Y", "level": 4, "content": [{"type": "paragraph", "text": "After Buggy received the summons to fight the World Pirates as a Shichibukai, the crew coincidentally came upon Luffy and Boa Hancock fighting Gairam on the World Pirates' ship. Two of the Funan Bros watched alongside their crew as they tried to figure out what was happening. Buggy then told his crew to inform the Marines that Buggy was engaging in a fight with Byrnndi World so that he could take the credit."}, {"type": "paragraph", "text": "Aboard the Groseade, the Buggy Pirates watched as Luffy was defeated by World. After seeing Luffy unconscious, Buggy ordered his subordinates to revive him. Later, after Buggy successfully revived Luffy, the Buggy Pirates went about wandering around the enemy ship."}, {"type": "paragraph", "text": "While they wandered about, they eventually stumbled across Gairam, who then proceeded to attack them with his Cube Booster. While Buggy, Mr. 3, and Cabaji where stuck in the line of enemy fire, the Funan Bros successfully evaded the attack. Later, when a flattened Luffy drifted down from between the cubes created by Gairam, Buggy scolded the young pirate to hurry up and defeat World. However, although Buggy was only thinking about his plan of taking credit being ruined, two of the Funan Bros misinterpreted his scolding as words of encouragement. The leader of the Funan Bros even thought that Buggy had implied that he would take down Gairam in place of Luffy, to which the leader tearfully said that he was glad to be part of the crew. At the same time, the dark-skinned Funan Bro said that he would remain committed to Buggy while crying as well. All three of the Funan Bros then joined in a group chant, shouting out Buggy's name. However, in the midst of cheering, Gairam compressed the air around him and attacked them with his Air Cube Booster, but this is successfully fended off by Mr.3's Candle Wall, who then told them to all run."}, {"type": "paragraph", "text": "Before long, Gairam caught up to them and attacked Buggy. The Buggy Pirates then watched on as Gairam turned Buggy into a cube and fought with their captain. However, Buggy then used his Special Muggy Ball, which caused a cloud of smoke to blow everywhere. When the smoke cleared, the crew saw that Gairam had been defeated and started to cheer for Buggy, when, in reality, Boa Hancock had done the finishing blow in the confusion."}, {"type": "paragraph", "text": "Afterwards, the crew wandered out of the ship and saw a fleet of Marine battleships approaching. Buggy tried to alert the Marines that he was there, but he is ignored and they are forced to escape when the Marines began firing on the Groseade. While retreating back to their own ship, Buggy had the orange-haired Funan Bro carry his feet, while he and Mr. 3 flew through the air. Buggy then ordered his men to keep swimming before redirecting his attention to the orange-haired Funan Bro and scolding him to make sure that the Funan Bro did not get his feet wet."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f6/Tightrope_Walking_Funan_Bro_Carries_Buggy%27s_Feet.png/revision/latest/scale-to-width-down/180?cb=20190120031832", "caption": "One of the Funan Bros carries Buggy's feet as they escape."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tightrope Walking Funan Bros vs. Roronoa Zoro", "elements": []}, {"text": "Buggy Pirates vs. Kumate Tribe", "elements": []}, {"text": "Buggy Pirates vs. Roronoa Zoro and Sanji", "elements": []}]}], "images": []}, {"title": "Filler Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Buggy Pirates vs. Smoker and the Marines", "elements": []}, {"text": "Buggy Pirates vs. Gairam", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Orange Town Arc", "level": 3, "content": [{"type": "paragraph", "text": "In Episode 4, when Nami tricks the Tightrope Walking Funan Bros onto her ship, the treasure chest she had on it was a panda jack-in-the-box, which scared the Funan Bros when it sprung out. In Chapter 8, however, the treasure chest is simply empty and the Funan Bros were only mad."}, {"type": "paragraph", "text": "In Episode 5, when the Tightrope Walking Funan Bros and Zoro arrive in Orange Town, they witness an explosion caused by a firing of the Buggy Ball, rather than what happens in Chapter 9, in which the Funan Bros simply told Zoro that they occupied the town."}, {"type": "paragraph", "text": "In Episode 8, the Funan Bros are not seen swimming away in fear after seeing Zoro again, but instead, are only heard screaming. In Chapter 21, they are shown to have jumped into the sea."}], "images": []}, {"title": "Subsequent Appearances", "level": 3, "content": [{"type": "paragraph", "text": "In the manga, the Tightrope Walking Funan Bros' have only appeared in the Orange Town Arc, whereas, in the anime, they have appeared alongside the Buggy Pirates when the crew is shown. Although, it can be assumed that they would be alongside the crew during the events they experience in the manga, their visible presence during those events is only seen in the anime. As such, the only thing canon in subsequent \"implied\" appearances is their general participation in the events that occurred since they are not actually seen in the manga. Anything done or said in the anime that was specific to them would still be non-canon. As a matter of fact, the events that occur in the anime version of the Loguetown Arc, in which the Funan Bros' leader is punched by Buggy and a Funan Bro helped Alvida set up her Sube Sube Spur, are all inconsistent with the manga, as other random members of Buggy's crew are the ones that get punched by Buggy or the ones that helped Alvida."}], "images": []}, {"title": "Boss Luffy Historical Special", "level": 3, "content": [{"type": "paragraph", "text": "The Tightrope Walking Funan Bros also appear in the anime-only Boss Luffy Historical Special. Their characters are set in an alternate reality and in a land called Grand Jipangu."}], "images": []}, {"title": "The Detective Memoirs of Chief Straw Hat Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Around the end of the year, the Clown Family arrived in town and began wreaking havoc. After Buggy and his gang took over Ipponmatsu's money exchange and began robbing him of all his money, Boss Luffy arrived and easily defeated the gang. However, before he could apprehend them, the gang escaped using a smoke bomb."}, {"type": "paragraph", "text": "Later, Buggy ordered the Tightrope Walking Funan Bros to kidnap O-Nami as a hostage to lure Boss Luffy to them. They eventually succeeded in kidnapping her, but not without putting up a fight, as they ended up with bruises and scratches. The gang then went to the designated meeting place and confronted Boss Luffy and Usopp. When Usopp told them to release O-Nami, the leader of the Funan Bros dragged her out. They then watched as Boss Luffy clashed and easily defeated Hachi and Gedatsu, who were supposed to be strong backup. In the midst of the battle, Sanji snuck up behind the Funan Bro and knocked him out, freeing O-Nami. The gang then laid unconscious as Buggy was defeated."}, {"type": "paragraph", "text": "Sometime later, the Funan Bros were sent by Buggy to capture Vivi. The leader of the three went up to grab her, but was cut by her when she slashed at him with a knife. Angered, he then attacked her with his sword, which caused Vivi to fall backwards. The commotion led to Zoro being awakened from his sleep, who is then threatened by the Funan Bros. The orange-haired Funan Bro went up to him and grabbed him by his robe, which led to Zoro flipping him over into the river. The rest of the gang then charged the monk, but were easily defeated. At the same time, Boss Luffy was passing by and, after seeing him, the Funan Bros retreated."}, {"type": "paragraph", "text": "Afterwards, they ran back to Buggy and explained to him what had happened with Vivi and the monk. In response, Buggy scolded them for coming back empty-handed and then told them to find the monk."}, {"type": "paragraph", "text": "When they eventually find Zoro, Buggy and his Clown Family watched in shock as the monk ate all their food. To repay them for the food, however, Zoro agreed to help Buggy capture Vivi and the gang then surrounded Boss Luffy and Vivi while they were fishing. In reality, Zoro was tricking the Clown Family and knocked all of them out in his \"fight\" with Luffy. When Buggy tried to fire his Buggy Ball, an arm sprouted out from nowhere and grabbed the torch, lighting Buggy himself on fire. This led to Buggy jumping into the river, to which the Funan Bros' leader and the orange-haired Funan Bro then jumped into the river to save him. Afterwards, the Clown Family decided to call it a day and walked away."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f7/Boss_Luffy_Historical_Special_-_Sanji_Saves_Onami.png/revision/latest/scale-to-width-down/180?cb=20190121033351", "caption": "Sanji knocks out a Funan Bro to save O-Nami."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0a/Boss_Luffy_Historical_Special_-_Zoro_Attacks_the_Clown_Family.png/revision/latest/scale-to-width-down/180?cb=20190121034008", "caption": "Monk Zoro flips a Funan Bro into the river."}]}, {"title": "Boss Luffy Returns! A Dream or Reality Lottery Trouble", "level": 4, "content": [{"type": "paragraph", "text": "A year later, the Funan Bros ran into O-Nami and Sanji's restaurant in search of a certain person when they realized who the owners were. After noticing the two, the Funan Bros became worried because those two were friends with Boss Luffy. However, before they could leave, Boss Luffy got up from his seat and asked them what they were there. Seeing as how Boss Luffy was there, the Funan Bros quickly decided that it was best to leave, considering the person they were looking for wasn't there either."}, {"type": "paragraph", "text": "They then ran back to Buggy and reported to him what had happened. Buggy then complained about how they had been losing money ever since they arrived in the town, and leader of the Funan Bros suggested that they just move to some other time. Hearing this, Buggy whacked him on the head and scolded them about how he would never leave after getting his butt whipped. However, upon hearing himself say that he got his butt whipped, he threatened to kill the three Funan Bros for something he thought they had said."}, {"type": "paragraph", "text": "Afterwards, the Clown Family found out that the person they were looking for, Pops, was hiding at O-Rika's house and so they went there to get him. When they got there, O-Ririka tried to stop them, but the Funan Bros held her back as Cabaji and Mohji explained that he owed them a debt. However, before they could leave, Boss Luffy arrived and knocked Mohji out, to which the Funan Bros then ran out of the house and prepared to fight. Cabaji and the Funan Bros then tried to leave with Pops and O-Rika, but Boss Luffy easily sent them flying backwards with his Gomu Gomu no Jutte, causing them to retreat."}, {"type": "paragraph", "text": "Later, the Funan Bros escorted the Commissioner to meet with their boss. Afterwards, they went to inform Boss Luffy that O-Rika was about to be sold, so that he would rush into a trap set by Buggy and the Commissioner."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/3a/Boss_Luffy_Historical_Special_-_Luffy_Attacks_the_Clown_Family.png/revision/latest/scale-to-width-down/180?cb=20190121045555", "caption": "Boss Luffy sends the Clown Family flying."}]}, {"title": "The Great Mochimaki Race to the Castle! Conspiracy of the Red Nose", "level": 4, "content": [{"type": "paragraph", "text": "A week or so later, Buggy plotted to steal all the mochi before they arrived at the festival so that he would be able to find the one with the jackpot in it. The leader of the Funan Bros and the orange-haired Funan Bro joined in the attack of the mochi transport cart, but were easily thrown off the bridge by Sanji and Chopper. The leader of the Funan Bros then complained to Buggy, but Buggy simply said that he had a backup plan."}, {"type": "paragraph", "text": "Later, all three Funan Bros carried Buggy and his cannon up a slope. Buggy ordered them to attack, but they ended up wobbling the cannon because they had become tired after all the heavy lifting. The Funan Bro kept complaining, but Buggy ordered them to chase after Igaram, Chaka, and Pell, who had taken over the transportation of mochi. They kept carrying Buggy and the cannon as they chased the mochi to the castle, and then began firing the cannon onto the castle grounds. Eventually, Buggy captures Vivi and the Funan Bros held her hostage as Buggy negotiated with Shogun Cobra for the jackpot mochi. However, they are easily defeated by Chaka and Pell."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a6/Boss_Luffy_Historical_Special_-_Buggy%27s_Cannon.png/revision/latest/scale-to-width-down/180?cb=20190121052442", "caption": "The Funan Bros carry Buggy and his cannon."}]}, {"title": "The Criminal is Boss Luffy? Chase the Vanished Great Sakura Tree", "level": 4, "content": [{"type": "paragraph", "text": "A few months later, during the Spring, the Clown Family plotted with Foxy to steal the millennium sakura tree. After they dug it up and turned it over to Foxy, however, Foxy refused to pay them. Foxy revealed that he had no intention of ever paying them and, in response, the entire Clown Family became angered at being deceived and when Buggy ordered them to prepare the Buggy Ball, they had already been prepared to kill Foxy. However, Foxy then used his Noro Noro no Mi powers to slow them all down and placed Buggy in the way of cannonfire. Afterwards, Buggy ordered his men to attack and the Funan Bros armed themselves with swords, but before they could do anything, Boss Luffy flew in with a giant boulder. Eventually, they were are all defeated and tied up."}], "images": []}, {"title": "Early One Piece", "level": 2, "content": [{"type": "paragraph", "text": "It is shown in Color Walk 1 that one of the original designs for Buggy's crew included a pirate that eventually served as the basis for the orange-haired Funan Bro. In his early design, he looked nearly identical to his final appearance, with the same hairstyle, thick lips, and shirt pattern. However, what is clearly different is the face, in which the eyes and nose are drawn differently. Furthermore, he was originally intended to have the name of Top (トップ Toppu) and was partnered with a pirate named Big (ビッグ Biggu). In addition, it appears that the orange-haired Funan Bro's initial character was supposed to have something to do with pantomime."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/39/Early_Buggy_Pirates_Color_Walk_1.png/revision/latest/scale-to-width-down/300?cb=20190119055416", "caption": "An early design of the Buggy Pirates."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [{"type": "list", "elements": [{"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Tightrope Walking Funan Bros formed their group on February 25th.", "elements": []}, {"text": "In the flashback from Episode 19, there is a child seen sitting next to Kuina in Koushirou's dojo that resembles a younger version of the orange-haired Funan Bro.", "elements": []}, {"text": "The orange-haired Funan Bro's character design is also used for a member of the Banzai Pirates in the video game, Ocean's Dream! - Oceans of Dreams.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b1/Isshin_Dojo_Students.png/revision/latest/scale-to-width-down/180?cb=20190117032125", "caption": "A child resembling one of the Funan brothers in Kuina's dojo."}]}]}