{"sections": [{"title": "Otohime", "level": 1, "content": [{"type": "paragraph", "text": "Queen Otohime was a goldfish mermaid, the queen of the Ryugu Kingdom, the wife of king Neptune, and the mother of Fukaboshi, Ryuboshi, Manboshi and Shirahoshi. Eight years before the start of the series, she was assassinated by Hody Jones."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Unlike her husband and daughter, Otohime was a normal human-sized mermaid. Her golden blonde hair was partially held up in two loops, much like her daughter Shirahoshi only shorter, by an orange headpiece. She also had green eyes (blue in the anime), thick eyelashes, and wore pink lipstick."}, {"type": "paragraph", "text": "She was usually seen wearing a very long white kimono with a cream-colored carp-scale design along the hem and a sash around her shoulders that floated behind her head much like her children."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She was very open-minded as she tried to promote friendship between fish-men and humans. She stated how despite having different morphology, they share the same sun. She claimed that Fish-Men and merfolk shouldn't judge all humans by the few that come to Fish-Man Island, kidnap and sell them to slavery. Due to her Kenbunshoku Haki abilities, she believed that distance was the closure of a person's heart and so long as distance separates the person's heart from others there will always be a barrier between them and the humans. But this same barrier was not just between humans and themselves, but between their own people also. This is why she preferred to visit the people directly and speak to them face-to-face, rather than have a speech prepared ahead and have it relayed to the people on her behalf, to prevent a distance between the royal family and their subjects."}, {"type": "paragraph", "text": "Being extremely compassionate, Otohime was very devoted to the welfare of her people since she disregarded her own injuries (as she was weaker than normal Fish-Men/merfolk) while acting for the greater good, personally taking care of a simple matter of stopping a burglar, despite her subjects claiming that they had it under control. Her devotion made her popular with the Fish-Man Island citizens. She was also very encouraging and influential, as she told a burglar that she believed he could turn his life around, prompting him to turn over a new leaf and surrendering to the authorities. Despite all this, it was not enough to get many citizens to sign her petition for inter-species relationship improvement."}, {"type": "paragraph", "text": "Even though she hardly had any success, she remained persistent and would never stop believing in co-existence. She was also very bold and courageous, accompanying a World Noble to the surface in order to prove to her people that the surface shouldn't be feared, despite the Noble that showed extreme cruelty and ungratefulness."}, {"type": "paragraph", "text": "She appeared to be very moody, going from being angry, to sorrowful, to hopeful in just a matter of minutes. She was also somewhat compulsive and peculiar, as she thought that a child should never have snot hanging from one nostril, going as far as slapping the said child for it and then apologizing, but that it is perfectly acceptable if snot is hanging from both. However, this did not seem to apply to her own children, at least not Shirahoshi (though she was just a baby at the time). There was one occasion when she was emotionally stressed, she consumed vast amounts of alcohol in sorrow and berated the island over the broadcast radio, all while intoxicated."}, {"type": "paragraph", "text": "As part of her immense desire to strengthen the bonds between humanity and fish folks, Otohime was also very merciful and kind, and did not hate anyone despite whatever offense they have made. She further tried to have others to let go of their hatred, believing that it should not be passed onto the next generation; while she understood the Sun Pirates for hating Mjosgard, she tried to persuade them to forgive him and not let the children around inherit such hatred. Even when she was shot by Hody Jones, she did not hate him and pleaded her children to not hate him either."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Otohime loved her family. While her husband, Neptune, did not take an active role in her campaign for integration, he strongly supported her. All she had ever wanted was a bright future for her children and the rest of Fish-Man Island."}, {"type": "paragraph", "text": "Upon Otohime's assassination, Neptune was torn between his desires for revenge and to preserve his wife's ideals. After her death, her whole family worked hard to restart her campaign and gather the signatures all over again."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/27/Neptune_Family.png/revision/latest/scale-to-width-down/210?cb=20130425033019", "caption": "Otohime with her children."}]}, {"title": "Fish-Man Island", "level": 3, "content": [{"type": "paragraph", "text": "Otohime was very devoted to the welfare of Fish-Man Island and its citizens, personally stopping a simple burglar and preached to the burglar that what he did was wrong, and should turn over a new leaf. She tried to remove the barrier between the people by personally appearing to make her speeches, in order to improve interpersonal relationships. In turn, she was beloved and admired by all her citizens, and though they were reluctant to immigrate due to Tiger's actions, through her perseverance, she was able to gain their full support in the immigration plan."}, {"type": "paragraph", "text": "Even after death, her ideals continue to affect the people, and they refused to step on her fumi-e when the New Fish-Man Pirates forced them. When the citizens gave in to the New Fish-Man Pirates' demands, they felt great remorse and regret."}, {"type": "paragraph", "text": "Jinbe eventually follows in her footsteps and becomes the diplomats for the Sun Pirates where he accepts the World Government's offer to become a Shichibukai in order to raise the status of the Fish-Men."}], "images": []}, {"title": "Enemies", "level": 3, "content": [{"type": "paragraph", "text": "As a person who wishes for more integration between humans and Fish-Men, her enemies included those who believed otherwise. However, no matter how antagonistic any of her enemies act towards her or her ideals, she always stood up to them with sympathy and forgiveness, trying her best to help them."}], "images": []}, {"title": "Fisher Tiger", "level": 4, "content": [{"type": "paragraph", "text": "One such person would be Fisher Tiger, who wanted Fish-Men and humans to remain separate. His actions, as well as his reputation as a hero to the Fish-Men, made him a big obstacle for Otohime, as he discouraged everyone from integrating with humans. Despite their opposite perspectives, however, Otohime and Tiger did not consider each other as adversaries, as Otohime, with her Kenbunshoku Haki, was able to see and understand the pain and suffering inside his heart inflicted by the World Nobles, while Tiger, on the verge of death, admitted his guilt for getting in the way of Otohime's efforts to make peace between humans and Fish-Men."}], "images": []}, {"title": "Hody Jones", "level": 4, "content": [{"type": "paragraph", "text": "However, Otohime's greatest enemy was none other than her own assassin, Hody Jones, who despised her for her ideals and was the one who eventually murdered her without remorse and blamed it on a human pirate, nearly destroying everything she had worked hard for, and years later tried to murder her whole family. In fact, Hody and his crew are the embodiments of her very worst fear: hatred passing down into children without any experience, turning them into empty monsters who practically thrive on hate and are destined to destroy everything."}, {"type": "paragraph", "text": "Prior to her death, Otohime expressed her mercy by not hating her assailant and requested her children to share the same sympathy, to which Hody would ridicule when he heard Shirahoshi explaining it."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Donquixote Mjosgard", "level": 4, "content": [{"type": "paragraph", "text": "Donquixote Mjosgard, typical of a World Noble, once despised Fish-Men and merfolk, seeing them as little more than fishes. Even when Otohime saved his life and took a bullet from an angry fish-man for him, he refused to show any gratitude and held her at gunpoint unless his demands were met, believing that the queen of a country of fishes is just another commoner to him. However, in the aftermath of the event, he assisted Otohime by taking her to Mary Geoise to receive a recommendation to allow Fish-Men to migrate."}, {"type": "paragraph", "text": "Miraculously enough, Otohime was capable of turning around Mjosgard's worldviews, causing the World Noble to reform himself into a better person and consider himself a human, an unthinkable notion for any World Noble to possess."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the former queen of the Ryugu Kingdom, Otohime held authority over her country and its subjects."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Otohime appeared to have had incredible speed and reflexes since she was able to dodge gunshots and subdue a thief with ease, as well as mermaids being naturally the fastest swimmers. However, her body was weaker than an average person's body as her hand was badly bruised and suffered a complex fracture after slapping the thief. Despite this the thief was visibly harmed, and even with her hands severely injured she continued to slap the thief and defeat him, demonstrating relatively great will and pain tolerance."}], "images": []}, {"title": "Orator", "level": 3, "content": [{"type": "paragraph", "text": "Otohime was an extremely persuasive orator and diplomat, having frequently made speeches to the Ryugu Kingdom citizens about living in harmony with humans. She could even reform Mjsogard, a World Noble who possessed immense arrogance and cruelty, into becoming a humble and benevolent man."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Like Aisa, she was born with Kenbunshoku Haki. Otohime seemingly predicted the paths of bullets fired at her and dodged them (aided with her speed and reflexes) with her eyes closed. She also uses this ability to understand the feelings of others, and can use this to get her enemies to change their ways. However despite this she was killed by a gunshot in the confusion when her petition pages were being burned; she claimed that it was because she was caught off guard since she was so happy that everyone was signing her petitions, causing her to lose concentration."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "The Pirate and the Queen", "level": 4, "content": [{"type": "paragraph", "text": "In the past, she was one of the two people who took a stand against the discrimination towards Fish-Men, the other being Fisher Tiger. While Tiger believed that Fish-Men and humans should remain separate, Otohime wished for the coexistence of the two races."}, {"type": "paragraph", "text": "She was first seen charging at a thief and subduing him by slapping him, spraining her hand in the process. After knocking down the thief, she started to preach to him about the error of his ways. Her words convinced the thief to turn over a new leaf."}, {"type": "paragraph", "text": "During her time, she would descend to the island to preach to the people about forming a bond with humans. She would also ask the citizens to sign a petition to promote co-existence. When finished, she returned to the palace to be met with a warm greeting from her children."}, {"type": "paragraph", "text": "When Tiger had a meeting with the royal family after what seemed to be an adventure, Neptune asked Tiger about what he saw during his adventures. Tiger answered with one word, \"humans\". Otohime then began shedding tears. After news of Tiger's rampage in Mary Geoise reached the palace, Otohime told Neptune about the voice she heard from his heart, a voice raising a battle cry. While the Sun Pirates were roaming the Grand Line, Otohime continued asking for signatures only to be met with refusal."}, {"type": "paragraph", "text": "After Tiger's death, Otohime became more determined than ever. She continued preaching to her people only to be shunned. Day after day, Otohime rescued humans from shipwrecks, teaching the children of Fish-Man Island about the surface world, giving speeches in the streets, and asking for signatures."}, {"type": "paragraph", "text": "After five years, she managed to get a thousand signatures. However, over time, the people withdrew their signatures until there were none. One day, while intoxicated, she gave a heart-wrenching speech to the Fish-Man Island citizens through a broadcast radio."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Otohime%27s_Speech.png/revision/latest/scale-to-width-down/210?cb=20141206081829", "caption": "Otohime preaching to her people about integrating with humans."}]}, {"title": "The Hope of Fish-Man Island", "level": 4, "content": [{"type": "paragraph", "text": "After the Sun Pirates split into three factions, a giant wrecked ship carrying World Nobles arrived at the Fish-Man Island main entrance and the ship was in need of an emergency entrance. Otohime then rushed to the scene."}, {"type": "paragraph", "text": "She arrived just in time to keep some of the Sun Pirates from killing a World Noble named Mjosgard, who also happened to be their former owner. She saved the noble from a fired bullet, getting grazed in the arm in the process. When asked why she protected him, Otohime pointed out that the children are watching and while she understands how they felt, they shouldn't pass on their hatred for humans to the children. This managed to calm the crowd, but Mjosgard grabbed her and threatened to shoot her. Otohime was saved when her daughter, Shirahoshi, called out to her and cried, unknowingly summoning Sea Kings to the area, which causes Mjosgard to faint from shock. Otohime and everyone else present were stunned by this revelation. Regardless of the noble's action, she asked Aladine to heal him."}, {"type": "paragraph", "text": "Some weeks later, Mjosgard was healed and allowed to leave (albeit very ungrateful for their mercy). Otohime decided to go with him much to the shock and disapproval of her subjects and family. She asked them to trust her and humanity, which everyone reluctantly complied with. After one week, she returned to the island having somehow negotiated with the World Nobles and holding a paper said to be \"The Hope of Fish-Man Island\"."}, {"type": "paragraph", "text": "From the day she began her campaign to the day she returned with the World Nobles' support, it has been seven years of hard work, and Otohime has finally reached out the island and all the citizens start giving their signatures on her request. Otohime was deeply overjoyed. Back at Ryugu Palace, Otohime explained to her sons about Shirahoshi's ability which is related to a legend. Otohime told her sons to be strong warriors and protect Shirahoshi."}, {"type": "paragraph", "text": "One day in Gyoncorde Plaza, the box holding all the collected signatures suddenly caught fire. In the ensuing confusion, Otohime was shot. As she fell to the ground, her sons immediately came to her side. Fukaboshi swore revenge, but Otohime told him not to be angry for her. Otohime reminded her sons about their promise to protect Shirahoshi. As she passed away, she touched pinky fingers with her children for the last time. Her daylight assassination led to an uproar throughout Fish-Man Island."}, {"type": "paragraph", "text": "Shortly after the assassination, Hody Jones caught and killed a human pirate. Hody claimed that the pirate was the shooter and revealed it to the citizens despite Jinbe's request to keep it quiet to preserve Otohime's hard work. This demoralized the citizens' desire to integrate their society with humans, but during Otohime's funeral, her children mustered the strength to regain the citizens' confidence, and started to collect more signatures."}, {"type": "paragraph", "text": "Even after death, her ideals lived on as Jinbe carried on her legacy by becoming a Shichibukai in hopes of building better relations between Fish-Men and humans. She was given a burial in the Sea Forest. Her daughter missed her funeral due to being imprisoned in Hard-Shell Tower to protect her from Vander Decken IX. During her ten years in that tower, Shirahoshi desired to pay her respects, while she lived with the knowledge that there were so many unspoken words between them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ae/Otohime_Saves_Mjosgard.png/revision/latest/scale-to-width-down/210?cb=20130113235247", "caption": "Otohime saves Mjosgard."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Otohime_Hopes.png/revision/latest/scale-to-width-down/210?cb=20120514051815", "caption": "Otohime continues to hope."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Otohime%27s_Funeral.png/revision/latest/scale-to-width-down/210?cb=20130113235142", "caption": "Otohime's funeral."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Postmortem", "level": 4, "content": [{"type": "paragraph", "text": "Jinbe was visiting her grave at the Sea Forest two years after the Battle of Marineford. When Shirahoshi arrived at the Sea Forest with Luffy and his friends, she paid her respects to her deceased mother."}, {"type": "paragraph", "text": "To quash those who sympathize with her interspecies cooperation beliefs, the New Fish-Man Pirates forced the people of the kingdom to step on her fumi-e or face banishment or death. The citizens, fearing for their lives, stepped on it reluctantly while apologizing inside their minds."}, {"type": "paragraph", "text": "After the entire royal family along with Jinbe and Megalo were captured and brought to the plaza, Hody revealed to everyone that he was the one who truly assassinated Otohime and used the human pirate as a scapegoat. This stunned Neptune, the princes, Jinbe, the citizens, and the lower rank subordinates. The officers and Shirahoshi already knew about it, with the latter having been told by Megalo, who was the only witness to the truth."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/95/Stepping_on_Fumi-e.png/revision/latest/scale-to-width-down/210?cb=20130113231144", "caption": "A Fish-Man Island citizen being forced to step on Otohime's Fumi-e."}]}, {"title": "Rebirth of Hope", "level": 4, "content": [{"type": "paragraph", "text": "In the aftermath of the rebellion, the citizens of Fish-Man Island finally realized that not all humans are malicious and seeing the folly of their distrust to them, they now work together with the Neptune Family for a better future for everyone, humans and fish-men, such is Otohime's dream. Even though Jinbe is no longer a Shichibukai, he continued to carry on her legacy by forming better relationships with pirates such as the Big Mom Pirates. King Neptune also planned to attend the Levely after receiving enough signatures supporting relocation from his people."}], "images": []}, {"title": "Legacy", "level": 4, "content": [{"type": "paragraph", "text": "Otohime continued to have an immense influence over Ryugu Kingdom and her family even after her death. Shirahoshi, Fukaboshi, and the citizens of Fish-Man Island uphold her beliefs to not bear hatred and being forgiving towards others, even putting aside their history of discrimination by humans as the Neptune Family finally gathered enough signatures to support relocation. Her success in convincing Mjosgard to see the errors of his ways ten years ago and reforming the tyrannical World Noble into a humble and benevolent man would also save her daughter from being enslaved by the World Noble Charlos, which would have ruined Neptune's chance to realize Otohime's dream for interspecies harmony with humans as Mjosgard personally saved Shirahoshi from slavery by striking down Charlos out of respect for her mother."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Otohime vs. Papaneel", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "She shares her name with the goddess Otohime, daughter of the Japanese sea god Ryūjin. This is in line with her husband, who shares his name with Neptune, the Roman god of the sea.", "elements": []}]}], "images": []}]}