{"sections": [{"title": "Mr. Mellow", "level": 1, "content": [{"type": "paragraph", "text": "Mr. Mellow is one of the only identified members of the Baroque Works Billions."}, {"type": "paragraph", "text": "He is apparently the leader of at least some of the Billions, as he ordered an unsuccessful attack on Portgas D. Ace and oversaw the murder of Mr. 11."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Mellow is a average sized tan man with black hair. He wears a dark red shirt with kanji meaning \"Full-Ripe\" (完熟, Kanjuku) on it, along with a white fur scarf, a green cap with a melon stem on top, and plain black pants with a brown belt."}, {"type": "paragraph", "text": "In the flashback of him pulling the cart of Dance Powder, his shirt said \"Half-Ripe\" (半熟, Hanjuku) and he did not wear the fur scarf."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/84/Mr._Mellow_Two_Years_Before_Alabasta_Arc.png/revision/latest/scale-to-width-down/210?cb=20160813112622", "caption": "Mr. Mellow two years before the events of the Alabasta Arc."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Mellow seems to be a good leader and would do anything to be promoted, such as when he attempted to capture Portgas D. Ace and Monkey D. Luffy for a promotion. He even goes as far as killing his own comrades to get promoted, as shown when he ordered the murder of Mr. 11. However, he appears to be overconfident in his abilities, when he went after Ace and Luffy in vain."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a candidate for a Frontier Agent, he has some skills in fighting. He also appeared to possess some authority within the ranks of the Billions as he was seen leading the cause to kill Mr.11 and capture Portgas D. Ace."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Two years before the Straw Hat Pirates arrived in Alabasta with Princess Vivi, Mr. Mellow was seen struggling to pull a cart carrying two oversized sacks of Dance Powder. When the cart's axle broke, he was able to jump out of the way in time to avoid being crushed by the heavy load. He was worried when the load broke open, as he said that he had orders to deliver it to King Cobra. When people began examining the spilled powder, he and the other Billions panicked and ran away. Later on, this was revealed to be part of the plan, Operation Utopia, in order to turn the people against King Cobra."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Baroque_Works_Dance_Powder_Scheme.png/revision/latest/scale-to-width-down/180?cb=20160813112845", "caption": "Mr. Mellow and other Billions spill Dance Powder to frame the king."}]}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the Straw Hat Pirates' arrival in Alabasta, Mr. Mellow and two other Billions boarded the ship on which Mr. 11 was being held captive by the Marines. Being mistaken for Millions, the Numbered Agent ordered them to release him. However, Mr. Mellow immediately corrected Mr. 11 and told him that he was in no position to order around the Billions. Mr. 11 apologized to him and asked him again to untie him. He then told Mr. 11 not to be stupid and that he would rather have him dead to create an opening for the position of a Numbered Agent. Afterwards, he proceeded to shoot Mr. 11."}, {"type": "paragraph", "text": "Later, when Mr. Mellow spotted Portgas D. Ace and Monkey D. Luffy, he ordered the Billions to go after the two wanted pirates in hope of getting a promotion. However, Mr. Mellow and the Billions he commanded were easily defeated by Ace's Hiken attack."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fd/Mellow_Aims_Gun_At_11.png/revision/latest/scale-to-width-down/180?cb=20130404094330", "caption": "Mr. Mellow prepares to shoot Mr. 11."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, Mr. Mellow's role is slightly expanded and changed. Rather than displaying the amount of authority he had in the manga, Mr. Mellow and the two other Billions by his side appeared to be subordinates of Geronimo. Whereas he simply shot Mr. 11 in the manga, he is given the order to by Geronimo in the anime. Also, instead of heading to their ships after receiving news of Portgas D. Ace being in the vicinity, he and his gang confronted Ace and Luffy in an alleyway. It was only after Geronimo's defeat in the alleyway that he and his men chose to chase after Ace on their ships. Furthermore, although the Billion's ships are seen chasing Ace and orders can be seen being given, it is unknown who was giving orders. However, in the anime, Mr. Mellow and the other two Billions can be seen ordering the Billions' fleet to attack."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Aim! The King of Berry", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Between the two appearances of the character there is difference in the text written in his T-shirt. On Volume 18 page 117-118, in Vivi’s flashback, his T-shirt has the word \"Half-Ripe\" (半熟, Hanjuku) written on it, but when he makes his present time debut, the word \"Full-Ripe\" (完熟, Kanjuku) is now written on it. A fan asked Oda in the SBS about this and Oda answered that \"He has matured\".", "elements": []}, {"text": "Mr. Mellow appears to have a melon theme as his name is similar to \"Melon\" (メロン, Meron) and he wears a melon-like hat. This coincides with the words on his shirt as they talk about ripening.", "elements": []}, {"text": "Although not named, the two Billions alongside Mr. Mellow appear to have been his partners for some time, as they worked alongside him during his mission to frame Nefertari Cobra with the Dance Powder.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 18 Chapter 159 (p. 2-3) and Episode 95, Mr. Mellow debuts and kills Mr. 11.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 75), Mr. Mellow's name is revealed in the databook.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 18 Chapter 159 (p. 16-19) and Episode 95, Mr. Mellow and Billions try to attack Ace.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 18 Chapter 161 (p. 11-13) and Episode 96, Billions frame King Cobra of using Dance Powder.", "elements": []}, {"text": "↑  One Piece Anime — Episode 95, Mr. Mellow orders the Billions to chase after Geronimo is defeated.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 19 (p. 146), Fan question: Oda-sensei!! I found something rather surprising about the delivery man on pages 117-118 of Volume 18….", "elements": []}]}], "images": []}]}