{"sections": [{"title": "Aobire", "level": 1, "content": [{"type": "paragraph", "text": "Aobire was an anime-only Yagara Bull from Water 7. He was Abi's family pet before passing away."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Aobire was a very old Yagara Bull, at over 100 years of age. He had a small bushy beard and a pair of bushy eyebrows. Both of these had gone white through aging. His most distinguishable feature was his blue dorsal fin for which he was named. He also wore a blue scarf that was given to him by Abi."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Aobire was very caring, risking his life and eventually dying trying to help a young Yagara Bull."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Despite his advanced age, Aobire was able to successfully reach and protect a young Yagara Bull in a forgotten area of Water 7."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Aobire belonged to Abi's family, but during the Aqua Laguna, Aobire was left behind at their home while the family took refuge, as they had done every year. However, during this year's Aqua Laguna, Aobire wandered off and got lost."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "Later, while the Straw Hat Pirates were in Water 7, Abi asked Luffy for help in finding her pet Yagara. While searching for him, Chopper learned from another Yagara that he heard Aobire's voice on the night of the storm telling someone not to worry and that he was on the way to help."}, {"type": "paragraph", "text": "Abi, Luffy, and Chopper later discovered remnants of Aobire's scarf and followed the traces into the underground water passage. While searching in the passageways, the three nearly drown and were seemingly saved by Aobire's spirit. Later, after seeing Aobire, they realized that they had stumbled upon Tsui Village, where Yagaras go when they die. Aobire's soul then passed on after he bid farewell to Abi and thanked her for everything. Upon his passing, the Yagaras of Water 7 moaned in sorrow. However, immediately after his passing, the three heard the cries of a baby and discovered it to be a baby Yagara. Abi later realized that Aobire had gone down into the forgotten area of Water 7 in order to rescue the baby Yagara, and that he had appeared in her dreams to tell her to save the baby. In the end, Aobire's last wish was fulfilled when the baby was saved and adopted by Abi."}, {"type": "paragraph", "text": "Aobire was last seen floating around pleasantly in the Tsui Village as Abi, Luffy, and Chopper pondered whether they had truly entered Tsui Village."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/42/Aobire_in_the_Afterlife.png/revision/latest/scale-to-width-down/180?cb=20180903001412", "caption": "Aobire in his \"final resting place\"."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Anime — Episode 317, Abi, Luffy, and Chopper look for Aobire.", "elements": []}]}], "images": []}]}