{"sections": [{"title": "Den", "level": 1, "content": [{"type": "paragraph", "text": "Den is Tom's younger brother. He is a bering wolffish merman. He is also a shipwright and a Sea Forest researcher."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Den is a muscular merman with long, curly fair hair reaching down below his shoulders. His long and hooked nose points downward. He has a mustache and a dark, long, pointed goatee. He is almost always seen smiling."}, {"type": "paragraph", "text": "He has tattoos resembling four-leafed clovers on each of his arms; this symbol is also present on the dark, short-sleeved shirt he wears. He also wears a wide-brimmed hat on his head and what it appears to be glasses or safety goggles on his face. He has an earring on each of his ears and a beaded necklace around his neck. Much like his brother, Tom, he carries around a bag full of tools attached to a belt around his waist; just below it is tied a light cloth, somewhat similar to an apron."}, {"type": "paragraph", "text": "Though a more common feature amongst Fish-Men, and very rare amongst merfolk, Den has webbed hands."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/0f/Den_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20181106185940", "caption": "Den's Concept Art from the Anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "﻿Den is a cheerful individual, shown smiling in most of his appearances so far. He also appears to be very friendly. Just like his older brother, Den has a habit of saying \"don\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Den is a shipwright similar to his older brother, Tom. He has a keen perception for high quality ships, able to tell that the Thousand Sunny was made out of the Treasure Wood Adam. Being a Sea Forest researcher, he has some knowledge about the Sea Forest. He is also a highly skilled coating mechanic, able to coat the entire Thousand Sunny, which is an enormous ship, by himself within a short period of time where the coating procedure normally required several days."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "Den was first seen on the Thousand Sunny talking with Franky about Tom. Den complimented Franky on the ship that he built and agreed to coat it. He explained that he knew about Iceburg and Franky from the letters sent by Kokoro. When Franky asked Den about why he does not look alike like Tom, Den explained to Franky about how Fish-Men and merman genetics work when there is interspecies breeding. Fish-Men and merfolk still carry the genes of their ancestors, so the species is not determined only by the parents, but it can be any of the species of their ancestors. Den then asked Franky if one of his ancestors was a robot, and Franky told Den that he's human, just modified. When Franky noticed someone sitting in front of a grave in the distance, Den pointed out that the person was Jinbe, explaining that Jinbe was waiting for someone in the forest since he could not enter the island due to being a wanted criminal again."}, {"type": "paragraph", "text": "Luffy, Shirahoshi, Megalo, Sanji, Hatchan, and Chopper soon arrived at the Sea Forest. Den was surprised to see the Mermaid Princess outside of the palace. Luffy wondered who the merman was and what was he doing on the Thousand Sunny. Franky then introduced Den to Luffy."}, {"type": "paragraph", "text": "After Jinbe finished explaining about his connection to Arlong and the stories of Fisher Tiger and Otohime, a visual Den Den Mushi appeared. The group watched a visual broadcast by Hody Jones."}, {"type": "paragraph", "text": "Den, Hatchan, and Camie remained in the Sea Forest as Jinbe and the Straw Hats battled against the New Fish-Man Pirates. As the battle raged on in Gyoncorde Plaza, Den noted a strange occurrence going on at the island, as all the whales left. Hatchan told Den that there was no way to break Hody Jones and referred to him as the true terror of their late boss, Fisher Tiger."}, {"type": "paragraph", "text": "After the battle for Fish-Man Island ended, Den, Hatchan, and Camie were shocked to see Sea Kings bringing Noah to the Sea Forest."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 109), Den's birthday is given.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Information about Den is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 616 (p. 10-12).", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 616.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 619.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 64 Chapter 627.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 65 Chapter 642.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 66 Chapter 648.", "elements": []}]}], "images": []}]}