{"sections": [{"title": "Michael and Hoichael", "level": 1, "content": [{"type": "paragraph", "text": "Michael and Hoichael are two kids who are troublemakers in the backstreets of Water 7. They idolize Franky, and even dress like him and use his motto as their own: \"Mm, super!!\" They also idolize Paulie. However, their backstreet delinquency has earned them ire from at least Tilestone and Peepley Lulu."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Michael has short spiky hair. He wears a red vest with a green pattern that looks like grass. He also wears a yellow shirt underneath that has his name and a white circle. The middle of the circle has red and white."}, {"type": "paragraph", "text": "Hoichael has short brown hair which seems to be growing only on the top spot of his head. He is missing teeth. He wears a blue vest with pink flowers pattern, and underneath he wears a brown shirt with his name. In the middle of the shirt is a white circle that surrounds a red circle."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Since they idolize Franky, they tend to imitate him, going as far as using his motto."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "They were originally suspected by Tilestone and Peepley Lulu to be the assassins who were after Iceburg."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Vice Admiral Garp arrived at Water 7, Zoro was in the midst of returning to Galley-La Headquarters. On the way back, Michael and Hoichael attempted to mug him but were easily beaten by Zoro and forced to show him the way back."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Later, the two reappeared and asked Zoro to become their elder brother. Zoro refused but they followed him around and tried to use their expertise as kids from the backstreets to help him find a new sword. However, eventually Zoro tried to bid them farewell, to which they refused. In response, Zoro attempted to run away, but were found by them every time as they knew their way around the streets. As such, Zoro stopped running and rammed their heads together, the sight of which is seen by a woman. This woman attacked Zoro and later revealed herself to be their orphanage mother, who they call \"Mom\". Before she could land her attack however, Michael and Hoichael jumped out and explained the situation, and as a result Aunt hit them on the head for causing trouble. Aunt then explained that there was work to be done and so Michael and Hoichael dragged Zoro off alongside Aunt's other children."}, {"type": "paragraph", "text": "Back at their house, they treated Zoro to tea and explained that they sold junk to Galley-La and would work together like a big family to make things run smoothly. Although Zoro got up to leave, Hoichael passed him a milk bottle and he ended up feeding a baby instead of leaving."}, {"type": "paragraph", "text": "Later, the whole family, including Zoro, went shopping. Eventually Zoro was fed up with the babysitting and decided to leave. Although, Aunt let him go, she told Michael and Hoichael to go bring him back later. However, as the family turned around to leave, they were confronted by the loansharks. Michael quietly told Hoichael to go seek out their \"Big Bro\" Zoro to go rescue them later."}, {"type": "paragraph", "text": "Hoichael eventually found Zoro and asked for his help in saving their mom. Although Zoro had refused to help at first, once Hoichael explained that the loansharks had kidnapped the whole family, Zoro rushed to their aid. After Zoro defeated Mikazuki and the loansharks, they all went back to their home, where they bid their farewells. However, as Zoro had forgotten to take his shirt back, Michael and Hoichael, along with the rest of the family, ended up chasing Zoro through the streets once again."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, a scene is added with them where they attempted to mug Zoro while he was trying to return to Galley-La to warn the others of the Marines' arrival. This scene is not shown in the manga, but is simply referenced."}, {"type": "paragraph", "text": "Later, their roles are expanded when they are shown to be the \"children\" of Auntie and try to bring Zoro into their big family."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "According to SBS Volume 39, their criminal records involve vandalism (window-shattering), shoplifting, and Yagara Bull gang activity. They have also been caught at least 620 times in a span of 6 years.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 432 (p. 7-8) and Episode 314.", "elements": []}, {"text": "↑  One Piece Anime — Episode 313, Michael and Hoichael try to mug Zoro.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 39 (p. 86), Please show us the faces of \"Michael\" and \"Hoichael\" from the backstreets. I'm so curious I can't even get up in the morning.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 38 Chapter 366 (p. 12) and Episode 256.", "elements": []}, {"text": "↑  One Piece Anime — Episode 318.", "elements": []}]}], "images": []}]}