{"sections": [{"title": "Marine Headquarters Court", "level": 1, "content": [{"type": "paragraph", "text": "The Marine Headquarters Court consists of three judges and was seen in Jango's cover story."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The judge on the left has a wide nose, thick lips, long white colored hair, a widow’s peak, and a scar above the bridge of his nose. He wears the standard judge hat and robes but rolls up the sleeves to expose his forearms."}, {"type": "paragraph", "text": "The middle judge is elderly with a wider nose and face, a bushy beard, and long, bushy hair. He also wears the standard judge robes, but his judge hat is black and white instead of the typical black."}, {"type": "paragraph", "text": "The judge on the right has a long, thin nose, glasses, and a scar on his left cheek. He also wears the standard judge hat and robes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/71/Marine_Headquarters_Court_Digital_Colored_Manga.png/revision/latest/scale-to-width-down/225?cb=20140311154359", "caption": "The Marine Headquarters Court in the digitally colored chapters."}]}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "The judge on the left seems very stern, while the judge on the right seems more relaxed, drinking a bottled beverage. The middle one shows little emotion; however, all three danced with Jango and the rest of the court and let Jango go due to his friendship with Fullbody, though not without demoting Fullbody in return."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the judges of the court, the Marine Headquarters Court has the ability to make the final ruling on a case. They have the authority to remove a criminal status from an individual if they see fit."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Jango's Dance Paradise", "level": 3, "content": [{"type": "paragraph", "text": "The Marine Headquaters Court sentenced Jango to death for being a pirate. However, Jango hypnotized the entire courthouse and made them start dancing and when the judges saw the bond between him and Fullbody, they decided to let Jango go on the condition that Fullbody be demoted to the rank of Seaman Recruit."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 18 Chapter 164, cover story: Jango's Dance Paradise Vol. 30, The three judges are introduced.", "elements": []}]}], "images": []}]}