{"sections": [{"title": "Automata", "level": 1, "content": [{"type": "paragraph", "text": "Automata are a type of robot first seen in Enel's cover story who were deactivated in the ruins of an ancient city on Fairy Vearth."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Automata are robotic animal-like creatures, similar in appearance to each other, all with the same face and mustache. Despite being machines, there are no obvious signs of their robotic build on the outside, and they appear as flesh and blood. The Karakuri Island inhabitants are dressed in themed outfits and are a little bit bigger than their Fairy Vearth counterparts. The Fairy Vearth automata have the same wings that the Shandia and Skypieans wear on their backs."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Originally, Enel met a few more recent ones who came from the planet below to avenge their fallen creator on Karakuri Island. After defeating the Space Pirates and charging up the automata when he attacked them, Enel investigates some ruins the pirates were digging up and in turn then attacks the ruins. Inside, he finds they are full of ancient automata which he has now charged up."}, {"type": "paragraph", "text": "The story of the ancient automata is that they were created by the ancient inhabitants of the moon. When the inhabitants of the moon ran out of resources, they left behind their homes and the automata, heading off to the \"blue star\" leaving both sides saddened by their separation."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The storyline does not detail how the moon automata and the Karakuri Island automata came to share the same appearance.", "elements": []}, {"text": "Despite being machines, they are capable of eating.", "elements": []}, {"text": "They appear as attackable enemies in the game Unlimited Cruise.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7e/Automata_Eating_With_Tsukimi.png/revision/latest/scale-to-width-down/180?cb=20130301174630", "caption": "Automata eating with Tsukimi."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 48–49 Chapters 466–474, cover story: Enel's Great Space Operations Vol. 31-38.", "elements": []}]}], "images": []}]}