{"sections": [{"title": "Tsukimi", "level": 1, "content": [{"type": "paragraph", "text": "Dr. Tsukimi was an old man who appeared in Enel's cover story."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tsukimi was an old man, with a wrinkled face and long ovular head. He had white eyebrows, and was bald. He had a thick neck, but relatively thin limbs. His eyes were seen to be always closed, as in content and calm."}, {"type": "paragraph", "text": "He wore a light-gray colored robe, with a hood and buttoned collar, and dark colored sandals."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Tsukimi_Digital_Colored_Manga.png/revision/latest/scale-to-width-down/150?cb=20130811032543", "caption": "Tsukimi in the digital colored manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He was very kind, as his automata loved him dearly to the point of traveling to the moon to avenge his death. He had a passion for moon watching, as his name implies."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Tsukimi was an extremely skilled roboticist, having built automata friends with human-like personalities and mannerisms."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "He created the four wingless automata on Karakuri Island. One day, he saw a giant explosion on the moon, which led him to become shocked and died while choking on his dumpling. His automata put him in his coffin and cried. After his burial, his automata swore revenge on whatever caused the explosion on the moon that resulted in the death of their creator."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Tsukimi\" (月見, \"Tsukimi\") means \"moon-viewing\" in Japanese, which is a traditional festival.", "elements": []}, {"text": "So far, Tsukimi is the only character to have been shown dying during a cover story.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 46 Chapter 448, cover story: Enel's Great Space Operations Vol. 17, Tsukimi makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 105), Dr. Tsukimi's birthday is given.", "elements": []}]}], "images": []}]}