{"sections": [{"title": "Outlook III", "level": 1, "content": [{"type": "paragraph", "text": "Outlook III is a noble living in the Goa Kingdom on Dawn Island and is the husband of Didit, Sabo's biological father, and Sterry’s adoptive father."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He has black hair and much like his son, he wears a top hat with the only differences being the feathers, a flower, and what appears to be a silver-lined band on the hat. He has a thin black mustache and wears a suit with a flower on each lapel, with the one on the left having feathers similar to the ones seen on his hat. He also wears an ascot underneath his suit's jacket."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like all nobles shown from the Goa Kingdom, Outlook is an arrogant person who does not care for anyone that is of lesser status than himself, referring to them as trash. He strongly believes in the power of money, seen when he bribed the officer interrogating Sabo so that the family name would not be tarnished by Sabo telling the truth about why he ran away, threatening him to blame Ace and Luffy for \"tricking\" him into doing those actions. He does not seem to care about Sabo outside of matters involving the family name. He even told him, almost outright, that one of the reasons behind Sterry's adoption was so that the family could have another child in case Sabo failed the family in the future, as well as stated that a child's happiness should come from pleasing their parents."}, {"type": "paragraph", "text": "This shows that he does not have very much faith, if any, in his son's success. However, his constant attempts to reason with Sabo does indicate despite his actions, he wanted Sabo to succeed as a noble, although his ideals gave him the wrong reasons to care about his son's well being."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e0/Sabo%27s_Family_Symbol.png/revision/latest/scale-to-width-down/150?cb=20130327221837", "caption": "Sabo's family symbol in the anime."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a noble, he has some influence over the way things are run in the Goa Kingdom and has a considerable amount of wealth to bribe the authorities."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "He is a stereotypical noble, treating Ace and Luffy as trash, and panicking about being contaminated when Bluejam got their blood onto him during a beating, claiming that he needed to be decontaminated. He also desired for his son to become his heir, believing that a child must adhere to the parents' wishes, and threatened to kill Ace and Luffy if Sabo did not comply. He ordered Sabo to marry a princess when he grew up, which is one of the reasons he ran away. In essence, Sabo had no right to freedom of choice in Outlook's eyes. Worse still, Outlook had no confidence in him despite wanting him to return, going as far as to adopt a stepson of higher status in order to have a backup heir."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, after Sabo stole a small boat to escape and start his life as a pirate, Outlook and his wife witnessed this departure, much to their shock. To make matters worse, Sabo had accidentally cut in front of World Noble Jalmack's ship, which caused him to be shot down, and Outlook and his wife both seemed horrified at this, either at the presumed death of their heir or that he would dare to obstruct a Celestial Dragon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8c/Sabo%27s_Parents_Horrified.png/revision/latest/scale-to-width-down/210?cb=20160219064154", "caption": "Outlook and Didit horrified."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 60 Chapter 585 and Episode 496, Outlook III makes his debut.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 215), His name is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode 503, Outlook and his wife horrified as they witnessed their son shot down.", "elements": []}]}], "images": []}]}