{"sections": [{"title": "Laskey", "level": 1, "content": [{"type": "paragraph", "text": "Laskey is a former CP9 agent and is Kalifa's father."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Generally, he looks somewhat similar to Kalifa, which is what led to people correctly suspecting them to be father and daughter. He has flowing gray hair with an antenna jutting out the front, and a small goatee of the same color. Like his daughter, he has a serious and sharp looking face, wears thin-rimmed red sunglasses and blue earrings. He also wears a black suit, like all other World Government agents, a light blue shirt underneath with a matching handkerchief and black gloves."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b0/Laskey_Portrait.png/revision/latest/scale-to-width-down/150?cb=20180623042608", "caption": "A close up of Laskey's face."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He seemed to be loyal to the World Government, as he helped Spandine at Ohara. It is unknown what his relationship with Kalifa is like."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Laskey has been trained since birth to be a killer."}], "images": []}, {"title": "Rokushiki", "level": 3, "content": [{"type": "paragraph", "text": "As a CP9 agent, Laskey has training in the superhuman techniques, Rokushiki. His level of mastery and doriki are unknown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Ohara Incident", "level": 3, "content": [{"type": "paragraph", "text": "Twenty years before the start of the series, Laskey was shown alongside with the then-CP9 chief, Spandine, entering Ohara in the West Blue under the orders of the World Government. They were attempting to stop the Oharan Clan from the illegal study of the Poneglyph, and warranted an investigation. However, this was merely an excuse to launch a Buster Call against the entire island."}, {"type": "paragraph", "text": "On the island, when Nico Olvia shot Spandine's jacket sleeve, he was seen telling his leader that it did not pierce his body. After capturing the archeologists, Spandine then activated the Golden Den Den Mushi, and the Marine battleships immediately begun to attack. As the Buster Call's intensity increased, and the attack happened sooner than the CP9 expected, their chances of escape were drastically reduced. He has not appeared since and it is unknown what happened to him after the Ohara Incident."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8c/OharaCP9.png/revision/latest/scale-to-width-down/250?cb=20130212210810", "caption": "Spandine and his agents arrive at Ohara."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 41 Chapter 393 and Episode 276, Kalifa's father is shown alongside with Spandine.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 214), his name is revealed.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 54, fan question: Is the dude with glasses Kalifa's dad?", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0375), Laskey's family is revealed to be a family of assassins.", "elements": []}]}], "images": []}]}