{"sections": [{"title": "Wolf", "level": 1, "content": [{"type": "paragraph", "text": "Wolf is an inventor who lives on Swallow Island. He is also the father of the pirate Artur Bacca."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Wolf is described as being an elderly man. He has slicked back gray hair and wears a red sun visor. When Law first met him he was wearing an aloha shirt, shorts and sandals which make him look out of place in the heavy winter conditions of Swallow Island."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Wolf gives the impression that he values people for the work that they do, expecting anyone he helps to return the favor. He calls this his policy of \"Give and Take\". However, he is still a caring person and has a big soft side that he does not do well at hiding. He is very proud, referring to himself as a \"genius\" inventor despite his inventions mostly being flawed."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Despite being elderly, Wolf had the strength to give a blood transfusion to two boys in quick succession and remain conscious afterwards. He is also strong enough to be able to take on Law, Bepo, Shachi and Penguin at once and defeat them even three years later."}, {"type": "paragraph", "text": "Wolf prides himself on being a genius inventor, but his inventions are motly terrible as they each possess a big flaw that prevent them from working. Law usually addresses him as Mr. Junk Inventor(or garakuta-ya) due to this. However, few exceptions to this are his invention of a greenhouse that allows him to farm crops during the winter, and a submarine, which will be given to Law. He also has several impressive looking inventions and weapons in his secret laboratory where he had not allowed the four boys entry till the pirate attack on their town."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Wolf has shown great skill sniping with a rifle, and is an extremely effective hunter."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "One Piece novel Law", "level": 3, "content": [{"type": "paragraph", "text": "Wolf found a 13-year-old Trafalgar Law in a cave on Swallow Island, asleep and near death. He took Law to his house, and when Law woke up, Wolf offered him a place to stay as long as he worked for him. Law assisted Wolf with his inventing and farming work, and the two of them would go on occasional hunting trips."}, {"type": "paragraph", "text": "One day, Wolf went to town to sell his inventions and crops, and when he came back, he found that Law had brought a polar bear mink named Bepo home with him. He agreed to let Bepo stay with them as long as he worked. A month later, Law and Bepo brought two heavily injured boys named Shachi and Penguin to Wolf's house. The two boys had lost a lot of blood, and Wolf offered to donate his own blood to both of them since he had their blood type. The blood transfusion was successful, and Shachi and Penguin recovered. Law offered for them to stay with him, Wolf, and Bepo, and Wolf reluctantly agreed on the same conditions he gave to Law and Bepo."}, {"type": "paragraph", "text": "The five of them continued living together with Wolf giving the boys chores to do. He took them to Pleasure Town one day and got them work so they could earn for themselves. He also took the boys to Shachi and Penguin's uncle and aunt who offered to buy the boys back. Wolf then punched the uncle for using the boys as tools and handed the uncle and aunt over to the police with evidence he collected of their misdeeds."}, {"type": "paragraph", "text": "One day when Law, Bepo, Penguin, and Shachi were racing their bicycles home, they noticed smoke coming from a nearby field. There, they saw that Wolf had crashed while testing one of his flying machine inventions and was heavily injured. Law used the Ope Ope no Mi while operating on him with Bepo, Penguin, and Shachi assissting. Wolf regained conciousness in the morning and the boys were relieved and overjoyed."}, {"type": "paragraph", "text": "Later, Wolf confronted Law about having the Ope Ope no Mi. Wolf revealed that he traveled the world as a young man and read literature about the fruit, revealing that it has the ability to give someone eternal life in exchange for the user's own life. Wolf told Law to never reveal his powers to others and Law agreed, realizing that Doflamingo had likely intended to use him to become immortal. Wolf then said that he owed Law for saving his life and offered to serve the boy, but Law rejected this, and Wolf then offered to be his friend instead. Law realized that for someone like Wolf who believed in the policy of \"give and take\" and was not very emotional, the offer of an unconditional friendship was something very big and he gladly accepted."}, {"type": "paragraph", "text": "Three years passed with the five of them living together as friends. Wolf and the others noticed that Law had been troubled since the news of Doflamingo being crowned the king of Dressrosa but did not press him. One day when returning home from work, Law noticed a commotion in Pleasure Town. He had Penguin call and alert Wolf when he saw a pirate crew harassing the townspeople. Wolf then arrived and confronted the pirate captain himself. From their argument, it became apparent that the captain is Wolf's own biological son, Artur Bacca. In the ensuing fight, Wolf was knocked unconscious by Bacca who proceeded to use his Devil Fruit ability on the people of the town. Law and his group escaped with the unconscious Wolf to their house."}, {"type": "paragraph", "text": "There Wolf reveals his past to them. His son Bacca had always been a troublemaker and when he set out as a pirate 25 years ago, Wolf accompanied him as his crewmate to keep a check on him. Wolf had hoped that the harsh world of pirates would scare Bacca but Bacca became even more evil. After failing to reach the Grand Line 20 years ago, Bacca returned to Pleasure Town and destroyed it. Wolf cut off ties with Bacca at this point. Law realizes that Wolf has been living away from the town as he feels guilty about the incident. Law tells him that this means Wolf has to save the town this time and that he is no longer alone but has the four of them with him. "}, {"type": "paragraph", "text": "Wolf tells them about Bacca's Devil Fruit ability, the Dero Dero no Mi, and states that the people of Pleasure Town only have 24 hours to live unless they can knock Bacca out or kill him. He gives Law a telescope which turns out to be an invention of his from which they can clearly see every detail of the town even from this far away. They determine that the pirate crew have set up camp in the temple of the sea god in the middle of the town. The boys are unable to come up with a plan for how they can get to the pirates without hurting the townspeople but Wolf tells them his plan. Wolf then takes them to his laboratory which he has not let them see until then. The entrance opens up in the middle of wilderness and leads down to a lab full of many machines and weapons that Wolf has been working on. Wolf then takes them to a part of the lab which looks like a cave where they see a submarine which is revealed to be the legend of Swallow Island's giant underwater swallow. They board the submarine which confuses the boys but Wolf reveals that it can move through any surface, even land and they tunnel their way into the pirate's camp. "}, {"type": "paragraph", "text": "The five of them take the pirates by surprise and easily defeat the crew. However, the Captain, Bacca, and his second strongest crew member, Coney Volcano, were not among the defeated. Just as they are about to head out, they are ambushed by the sumo wrestler, Volcano. As Bepo, Penguin and Shachi offer to take care of him, Wolf and Law head out to confront Bacca. Bacca has been looking for the legendary treasure of Swallow Island left there by Captain Ladoga who died of an illness some 60 years ago. Wolf reveals to him that he had already found the treasure and used up the money in rebuilding Pleasure Town and for making his submarine. Bacca is enraged and hits Wolf knocking him out. Law then fight with Bacca and eventually defeats him using Countershock which renders him unconscious. Wolf is about to kill Bacca but is stopped by Law who tells him about Rosinante being killed by his own brother Doflamingo and states he does not want to see family kill each other which makes Wolf emotional. "}, {"type": "paragraph", "text": "After the incident, Law makes up his mind to head out as a pirate and complete Corazon's mission concerning Dressrosa in his stead. Bepo, Penguin and Shachi offer to come with him as his crew. He tells Wolf that while he will become a pirate, he will never become like Bacca. Wolf gives them his submarine which they rename the 'Polar Tang'. Law tells Wolf that he considers him his dear friend and decides to name his crew the Heart Pirates as the word heart embodies to him the love Corazon had for him, the kindness Wolf showed them and the trust he and his friends share. "}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece novel Law, Wolf makes his debut.", "elements": []}, {"text": "↑  One Piece novel Law", "elements": []}]}], "images": []}]}