{"sections": [{"title": "Vigaro", "level": 1, "content": [{"type": "paragraph", "text": "Vigaro was the first mate of the Phoenix Pirates. He died protecting his crew and captain in the New World."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Vigaro was a tall muscular man, with plaited long blue hair. He wore a short sleeved purple fur jacket."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Vigaro deeply cared about his crew, as he sacrificed his life so that they could leave the New World."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Vigaro was a strong minded individual, knowing that the best way to save his crew was to sacrifice himself."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Vigaro deeply believed that Puzzle would become the next Pirate King. For that, he sacrificed his life so that Puzzle could live."}, {"type": "paragraph", "text": "Because of what he did, most of the Phoenix Pirates decided to follow his example and fight vigorously for their captain. Vigaro's fellow crewmate, Guyle, stated that Vigaro would've wanted for them to use the Thousand Sunny to attack the Accino Family."}, {"type": "paragraph", "text": "Puzzle on the other hand, was deeply affected by Vigaro's sacrifice. Due to Vigaro's actions, Puzzle had since then lost the will to fight for fear that he'd lose more of his friends."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "When the Phoenix Pirates traveled to the New World, they were attacked. To save his captain and the rest of the crew, Vigaro sacrificed himself by charging into the enemy so that they could escape. His plan worked but he was killed in the battle."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Anime — Episode 326, Vigaro is introduced.", "elements": []}, {"text": "↑  One Piece Anime — Episode 326, Vigaro is seen going against some enemy fire.", "elements": []}]}], "images": []}]}