{"sections": [{"title": "Koala", "level": 1, "content": [{"type": "paragraph", "text": "Koala is a former slave who was set free by Fisher Tiger's rampage on Mary Geoise. She sailed along with the Sun Pirates to reach her home town."}, {"type": "paragraph", "text": "At some point later, she joined the Revolutionary Army, eventally becoming the Fish-Man Karate assistant instructor and high ranking officer. She now often works alongside both Sabo and Hack."}, {"type": "paragraph", "text": "She made her reappearance during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "When she appeared twelve years ago, Koala was a skinny girl with long, unkempt brown hair. She also had distinctively large and round eyes, similar to that of a koala, and was always smiling. She had on a dirty, short-sleeved collared shirt, which she wore under dark overalls and a smudge on her right cheek. As a slave of the World Nobles, she had the mark of the Celestial Dragons on her back, which was replaced by the mark of the Sun Pirates by Fisher Tiger."}, {"type": "paragraph", "text": "After a few weeks she had neat, shoulder-length hair, a light-colored dress, and a pair of loafers."}, {"type": "paragraph", "text": "At age 23, she became taller (though she is still rather short as an adult at 160 cm), slim, curvaceous, and has a pronounced hourglass figure. In the anime, her hair was changed from light brown to orange, now matching her depiction in the manga. She wears a crimson newsboy cap with gold goggles, a pink shirt with a frilly collar, a maroon short skirt, and black thigh-high stockings with brown high heeled boots."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Aladine described Koala as having the lifestyle of a slave ingrained in her blood. Even after being set free for three years, she was very apologetic and vowed to never cry or stop working. The pirate explained that if a slave ever cried or stopped cleaning, they would be killed. Koala seemed to consider the Sun Pirates her masters, as she asked them if she would be killed if she stopped cleaning. Aladine also said that slaves panicked constantly, even when alone, and that they couldn't trust anyone. It is unknown if Koala also became paranoid in that regard."}, {"type": "paragraph", "text": "When Fisher Tiger convinced her that his crew were not like the Celestial Dragons by throwing his gun into the ocean, she finally cried for the first time in years. She then began to regard the Sun Pirates as her family rather than her masters, though this did not stop her habit of cleaning even when she was not asked."}, {"type": "paragraph", "text": "By the time they reached her home town she genuinely liked the fish-men and mermen of the Sun Pirates, creating especially strong bonds with Hatchan and the future members of the Macro Pirates. She went as far as to actually hold Fisher Tiger's hands despite him trying to shake her off."}, {"type": "paragraph", "text": "At the age of 23 Koala has become much more mature, having shown sympathy towards Sabo for not being able to save Ace, telling him he should not let his guilt get to him. She has also become rather playful and cheery, having gleefully hugged Robin after meeting her and also teasing Sabo about him crying upon meeting Luffy again. She has also been shown to have a temper, as she got angry with Sabo for fighting Fujitora instead of staying at his post and comically pinched his cheeks for his disregard for his duties as a Revolutionary."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/81/Koala_Finally_Cries.png/revision/latest/scale-to-width-down/200?cb=20130125215436", "caption": "Koala cries for the first time since enslavement."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Koala_Gets_Angry.png/revision/latest/scale-to-width-down/180?cb=20150628180341", "caption": "Koala displays her temperamental side after getting frustrated with Sabo."}]}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Koala's only known family is her mother. It is clear she loves her mother very much, having hugged her after reuniting with her when Tiger brought her home. It is unknown if Koala ever discovered her mother and the other people on her home island betrayed Tiger by selling him out to the Marines."}], "images": []}, {"title": "Sun Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Koala was loved by much of the crew during her time with the Sun Pirates. As the crew included former slaves, they understood the plight that Koala had suffered and why she acted the way she did. They treated her and protected her while she traveled with them and were very sad to see her go. Out of all of them, she was especially fond of Hachi, Jinbe, and Macro."}], "images": []}, {"title": "Fisher Tiger", "level": 4, "content": [{"type": "paragraph", "text": "Koala was deeply thankful to Fisher Tiger for freeing her and returning her home. Though she grew fond of the fish-men, Fisher Tiger himself admitted on his deathbed that he was unable to love humans, and therefore was unable to return any affection towards her. He even refused to hold her hand, though he still smiled when she returned home."}], "images": []}, {"title": "Arlong", "level": 4, "content": [{"type": "paragraph", "text": "Arlong spent the entire time objecting to her presence on the Sun Pirates' ship, attempting to beat or kill her for being a human. Koala seemed to have left a long-term impression on Arlong. Notably, in the final moments of his fight with Luffy, Arlong stated that as long as Nami was fed and well-clothed, she was happy in his eyes. As a slave, Koala had little to her name and what made Koala happy were the things she had missed while being a slave such as nice clothes and suitable meals."}], "images": []}, {"title": "Nico Robin", "level": 3, "content": [{"type": "paragraph", "text": "Koala seems to have developed a very friendly relationship with Nico Robin, who was rescued by the revolutionaries just prior to the timeskip. In a conversation with Sabo on Dressrosa, she commented on how she had not seen Robin in a while. Later on, Koala hugs Robin when she does see her again."}], "images": []}, {"title": "Revolutionary Army", "level": 3, "content": [{"type": "paragraph", "text": "When she was only 14 years old, three years after Fisher Tiger's death, Koala joined the Revolutionary Army. Though her official role is assistant Fish-Man Karate instructor, Koala is shown to work closely under the army's top leadership."}], "images": []}, {"title": "Sabo", "level": 4, "content": [{"type": "paragraph", "text": "Koala is good friends with Sabo, having worked with him since she was a teenager. As such, she's come to know him personally quite well, being aware of Sabo's relationship with Ace and Luffy as well as his guilt for not being at Marineford to help save Ace. She consoled Sabo by telling him that it was impossible to know whether Sabo would have made a difference or not. Even though they are friendly to each other most of the time, Koala comically pinched Sabo's cheeks when he frustrated her for fighting Fujitora and neglecting his duties as a Revolutionary by leaving his post. Although she can get irritated with him from time to time, Koala cried when she believed him to be dying and was distressed when she thought he would leave the Revolutionaries after he regained his memories but was relieved when he stated he was not leaving."}, {"type": "paragraph", "text": "Koala was greatly concerned for Sabo's safety after a recent incident regarding him at Levely was revealed in the newspaper."}], "images": []}, {"title": "Hack", "level": 4, "content": [{"type": "paragraph", "text": "Hack is a fellow colleague and Fish-Man Karate practitioner in the Revolutionary Army. He intended to get into contact with her after losing the Corrida Colosseum tournament but was unable to as he was turned into a toy by Sugar and forced to work. He complained that Koala was waiting for him to report, unaware that she had forgotten him due to the effects of the Hobi Hobi no Mi. After Sugar was knocked out and Koala regained her memories of Hack, Koala was quick to inform him that Sabo was making his way to the basement. Both share a dislike for Sabo's tendency of leaving his post during missions. Hack was the one responsible for bringing Koala into the Revolutionary Army when she was 14. She studied Fish-Man Karate under his tutelage, eventually becoming a Master Assistant Fish-Man Karate Instructor."}], "images": []}, {"title": "Monkey D. Dragon", "level": 4, "content": [{"type": "paragraph", "text": "Dragon is the leader of the Revolutionary Army whom Koala serves faithfully. After Koala returned to Baltigo following the mission to Dressrosa, Dragon thanked her for helping them find Luffy and their lost comrades. He also appears to trust her well enough to carry out important tasks such as summoning the other Revolutionary leaders."}], "images": []}, {"title": "Belo Betty", "level": 4, "content": [{"type": "paragraph", "text": "Koala seems to have a casual relationship with Belo Betty despite the East Army Commander being one of her senior officers. Belo muses on the contradiction in Koala's reason for becoming a revolutionary. She notes Koala wants to depose the World Government to help fish-men but the Ryugu Kingdom is one of their affiliates. Despite this, Koala happily responds that she agrees with Dragon's crusade to dethrone the Celestial Dragons and not the World Government itself."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "World Nobles", "level": 4, "content": [{"type": "paragraph", "text": "Koala was originally terrified of the Celestial Dragons due to them enslaving her. She coped with this problem by smiling and blindly complying with their orders to avoid punishment. However, after being liberated by the Sun Pirates and joining the Revolutionary Army at a later age, she has grown to despise them for their depravity and continued practice of slavery. She tells Belo Betty that she fully supports Dragon's crusade to dethrone them."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "It is unknown if Koala discovered her hometown betrayed the Sun Pirates to the Marines to ensure she would not be returned to enslavement. She is cautious about the naval military as seen by her reprimanding Sabo for deliberately engaging one of their Admirals despite the possibility of attracting their notice."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "She has been shown to have certain skills like being able to take down larger enemies and great agility and can make a big jump from the stands to all the way down to an underground port while bringing Sabo clothes to wear."}, {"type": "paragraph", "text": "Her position indicates that in terms of combat, she is above simple revolutionary soldiers, as she seems to have a decent level within fish-men standards despite being human."}], "images": []}, {"title": "Fish-Man Karate", "level": 3, "content": [{"type": "paragraph", "text": "She is skilled enough at Fish-Man Karate to be able to teach it and was able to defeat an opponent much larger than her. Not being a fishwoman and still being able to learn the art makes her more impressive. In the anime, she is shown to be proficient enough to defeat a group of five armed men with only a single strike each."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in her childhood, Koala was kidnapped and sold into slavery to the World Nobles."}, {"type": "paragraph", "text": "When she was eight years old, Fisher Tiger attacked Mary Geoise and indiscriminately freed countless slaves. Koala managed to escape with a group of people and fled to an island. Unfortunately, the inhabitants there had no way of returning her to her homeland. When the Sun Pirates visited there three years after she was freed, the inhabitants asked them to take the little girl home. After Koala introduced herself and thanked Tiger for freeing her, she boarded the Sun Pirates' ship."}, {"type": "paragraph", "text": "Koala was instantly met with hostility by Arlong, who hit her for being human, but was restrained by Hatchan. Tiger gave the girl the Mark of the Sun to cover up her slave mark. He then told the girl that she was allowed to cry if she wished and made a vow to return the little girl to her home. Koala then began to cry."}, {"type": "paragraph", "text": "The Sun Pirates were able to find an Eternal Pose for her home island, Foolshout Island. When they arrive, she bid everyone farewell, and Tiger took her to her village. The whole town rejoiced, but everyone was still afraid of Tiger."}, {"type": "paragraph", "text": "Later, she heard some strange noises. When she asked if anyone else heard them, her mother replied no. The truth was that Fisher Tiger was attacked because people from a previous island informed the Marines about the Sun Pirates while the people on this island allowed it on the condition that the Marines overlook the fact that she was a released slave and not take her back."}, {"type": "paragraph", "text": "Three years after Fisher Tiger's death, at the age of fourteen, Koala joined the Revolutionary Army and she became a Fish-Man Karate assistant instructor. She became acquainted with Sabo and Hack."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Tiger_marks_Koala.png/revision/latest/scale-to-width-down/165?cb=20121001085129", "caption": "Tiger covers Koala's slave mark with his jolly roger."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/83/Koala_and_Tiger.png/revision/latest/scale-to-width-down/210?cb=20141206190921", "caption": "The last time Koala ever sees Tiger."}]}, {"title": "During the Timeskip", "level": 4, "content": [{"type": "paragraph", "text": "She was worried when Sabo had a mental breakdown after remembering his brother, Ace. When Sabo awoke from his three-day coma, Koala cried in relief."}, {"type": "paragraph", "text": "After Nico Robin agreed to meet Dragon, Koala became acquainted with her."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Koala, Sabo, and Hack arrived at Dressrosa in order to put a stop to a weapons trade that has been promoting wars throughout the world. Koala was first seen sitting on a pile of defeated enemies, talking to Sabo on the Den Den Mushi inquiring about his meeting with Monkey D. Luffy. She told him that Ace's death could not have been prevented by him. Then, when Sabo told her to inform him if anymore underground movements happened, Koala told him that she would."}, {"type": "paragraph", "text": "Later, Koala disguised herself as a member of the Donquixote Pirates and managed to get inside the Corrida Colosseum, relieved that she had arrived just in time to watch the next round. When the toys in the audience transformed back into their original forms, Koala informed Hack that Sabo was heading to the basement as he demolished the entire arena."}, {"type": "paragraph", "text": "After Sabo acquired the power of the Mera Mera no Mi, destroyed the arena, and exposed the underground, Koala returned his clothes to him. At the underground trade port, she returned Sabo's hat as the Revolutionary Army members revealed to Rebecca their objective in Dressrosa. After Koala and Sabo reunited with Robin and met Usopp, they later watched in shock as Doflamingo initiated his \"Birdcage\" plan and created a \"game\" which gives the citizens of Dressrosa a choice to either kill him or a list of people he offers to them."}, {"type": "paragraph", "text": "Doflamingo announced his hit list, which includes Sabo, Robin, Rebecca, and Usopp. With Usopp's new followers turned against them, Koala, Sabo, Hack, Robin, Rebecca, Usopp, Bartolomeo, and the Tontatta dwarves fled from the mob. Instead of going to the surface with the others, Koala remained in the underground trade port to continue her investigation. She discovered that the ships at the trade port were actually merchant ships disguised as pirate ships."}, {"type": "paragraph", "text": "She later met up with Sabo in front of the new King's Plateau after he fought Admiral Fujitora, and scolded Sabo for going off on his own and fighting the admiral on his own accord."}, {"type": "paragraph", "text": "Koala later infiltrated the palace and then contacted Sabo to come, saying that Luffy's life is in danger. She was spying on Jesus Burgess and wondered about what he was up to. When Luffy became exhausted, Burgess made a move and Koala quickly alerted Sabo."}, {"type": "paragraph", "text": "By the time Doflamingo was defeated, Koala, Hack, and some other revolutionaries took care of some business at the underground trade port, where they waited for Sabo. Koala tried to contact Sabo, but he did not respond until after he defeated Burgess. When Koala finally contacted Sabo, he asked her if she found a list. Soon after he hung up on her, Koala took her annoyance out on one of her comrades. The revolutionaries later left Dressrosa and they took all the weapons and evidence relating to the Donquixote Pirates's smuggling operation before CP-0 could recover them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cd/Revolutionaries_in_Dressrosa.png/revision/latest/scale-to-width-down/210?cb=20150125192049", "caption": "Koala, Sabo, and Hack reveal themselves."}]}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Silver Mine Arc", "level": 4, "content": [{"type": "paragraph", "text": "Koala and her fellow revolutionaries were seen on a ship stationed far away from Gran Tesoro."}], "images": []}, {"title": "One Piece Film: Gold", "level": 4, "content": [{"type": "paragraph", "text": "Koala received a call from someone and was told the man they were looking for was at Gran Tesoro. She then told Sabo, who was present, Luffy was there. The next night, after the battle against Gild Tesoro, Koala, Sabo, and the retrieved Raise Max, sailed away."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After returning to the revolutionary base at Baltigo, Koala informed Dragon that the weapons they retrieved from Dressrosa contained a special mineral known as Liquor Iron Ore, which could provide a clue on where the weapons were made. After a short conversation concerning Luffy, Sabo, and Robin, Dragon requested Koala to gather all the revolutionary leaders."}], "images": []}, {"title": "From the Decks of the World: the 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of the Straw Hats' accomplishment at Dressrosa spread throughout the world, Dragon, Sabo, and Koala read about the Straw Hats' new bounties."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime later, a newspaper explained about Blackbeard's attack on Baltigo. The island was destroyed by the time the Marines and Cipher Pol arrived."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Revolutionary Army escaped the destruction of Baltigo and they moved their base to Momoiro Island. When Ivankov asked about Sabo, Koala pointed out that he had been grinning ever since he read the newspaper about Luffy's exploits at Totto Land."}, {"type": "paragraph", "text": "After the meeting, Koala had a conversation with Belo Betty and some other revolutionaries. Koala explained that their goal was to only take down the World Nobles."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Levely, the revolutionaries read some distressing news concerning Sabo and Koala was distraught."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Revolutionary Army vs. Blackbeard Pirates (unseen)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Koala is the first non-fish-man individual known to use Fish-Man Karate as well as the first human to have their Celestial Dragon slave mark replaced with the symbol of the Sun Pirates.", "elements": []}, {"text": "Koala and Nami were both in fish-men crews, but draw contrasting parallels with each other:", "elements": [{"text": "While Nami was forced to join Arlong's crew against her will, Koala only traveled with the Sun Pirates because they were asked to take her.", "elements": []}, {"text": "While both were forced to wear their crew's mark, Koala's \"mark of the sun\" was put on to replace another mark. Nami's Arlong tattoo was removed and replaced with a tattoo of her own design.", "elements": [{"text": "Each girl ended up with a permanent mark replacing a former mark of enslavement as a result of affiliation with fish-men.", "elements": []}]}, {"text": "When Koala joined the Sun Pirates, she was finally allowed to cry, whereas with Nami, after she was forced to join Arlong she refused to cry.", "elements": []}, {"text": "Koala was never forced to do any work as she was freed from slavery. Nami was forced to draw maps and act as a slave to Arlong.", "elements": []}, {"text": "Koala's time in the crew was only meant to be temporary while Arlong intended to keep Nami in the crew forever.", "elements": []}, {"text": "In Koala's case, her hometown exchanged her freedom with the Marines for the lives of the fish-men. In the case of Nami's hometown, they fought against the fish-men for their freedom after the Marines betrayed them.", "elements": []}]}, {"text": "In the 5th fan poll, Koala ranked 30th, making her the second most popular of the Revolutionary Army behind Sabo.", "elements": [{"text": "She is also the eighth most popular female character after Nami, Boa Hancock, Nico Robin, Perona, Nefertari Vivi, Shirahoshi, and Rebecca.", "elements": []}]}, {"text": "In the 6th fan poll, Koala is ranked as the 35th most popular character and is the 11th most popular female character.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Koala – Wikipedia article about the animal she is named after and somewhat resembles.", "elements": []}]}], "images": []}]}