{"sections": [{"title": "Kadar", "level": 1, "content": [{"type": "paragraph", "text": "Rear Admiral Kadar is a Marine rear admiral at the G-2 Marine base from fifteen years ago. His current location and rank are unknown."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kadar is around average height. He wears a blue suit and black tie with the sleeves rolled up underneath a Marine coat that is draped over his shoulders. He has short, wavy, light-blond hair, what appears to be rectangular glasses over his eyes, and a short, dark beard on his chin. He also has a bracelet on his left wrist, and he is seen wielding a katana."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Kadar_as_a_Young_Marine.png/revision/latest?cb=20121205223232", "caption": "Kadar in his youth as a marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Not much about his personality is known, but it appears that he supports slavery (or at least the World Nobles' right to own them more than normal civilians), ordering the Sun Pirates to turn over the slaves they freed, but could have just been following orders and protocol. In the anime, he also seems to be cowardly, as he starts begging when Fisher Tiger held him over the water."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a rear admiral, Kadar has command over lower ranking Marines. He was seen carrying a katana, and is presumably efficient in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Kadar was given orders to locate the Sun Pirates and then report back on their position. Upon locating them, his ship was attacked. He told Fisher Tiger to return all the ex-slaves he liberated. Tiger then smashed his head against a wall, saying there was no way of identifying them as slaves. Kadar then noticed that the pirates were attacking from underwater. It was later reported to Vice Admiral Borsalino that Kadar's ship had been sunk."}, {"type": "paragraph", "text": "Since he did not appear during the G-2 officers' meeting after Ace's intrusion in the base, his current status is unknown."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Tiger%27s_strength.png/revision/latest/scale-to-width-down/210?cb=20170426110755", "caption": "Kadar is defeated by Fisher Tiger."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kadar vs. Fisher Tiger", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He was the first active rear admiral to be named in the manga.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 622 and Episode 541, Kadar debuts.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 45), Kadar's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 32 Chapter 303, cover story: Ace's Great Blackbeard Search Vol. 28, The officers of G-2 base have a meeting after Ace's intrusion and escape.", "elements": []}]}], "images": []}]}