{"sections": [{"title": "Miss Catherina", "level": 1, "content": [{"type": "paragraph", "text": "Miss Catherina was a Baroque Works Millions agent stationed at Whisky Peak alongside her partner, Mr. Beans. She worked under the Frontier Agents Mr. 8, Miss Monday, Mr. 9 and Miss Wednesday."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Miss Catherina is a young woman that dressed in a religious habit typical of a nun. She wears a long black dress with long sleeves and a veal that covers her hair. She also carries around a cross that she wears around her neck using a necklace."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/32/Miss_Catherina_Manga_Color_Scheme.png/revision/latest?cb=20190709225720", "caption": "Miss Catherina in the Colored Manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Miss Catherina is sly and deceitful as she pretended to be an average nun while welcoming the Straw Hat Pirates, whereas, in reality, she was actually a bounty hunter that was trying to trick them into letting off their guard. Furthermore, she also displayed her deceitful nature when she tried to trick Roronoa Zoro into believing that she was actually asking for mercy during their fight but was, instead, actually seeking to surprise attack him."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Baroque Works", "level": 3, "content": [{"type": "paragraph", "text": "As a Baroque Works agent, Miss Catherina swore to uphold the principle of secrecy, such that she was not allowed to pry into the true identities of any other members in the organization. Furthermore, as a Million, she was subordinate to the frontier agents, of which she directly worked under Mr. 8, Miss Monday, Mr. 9, and Miss Wednesday."}], "images": []}, {"title": "Mr. Beans", "level": 4, "content": [{"type": "paragraph", "text": "Miss Catherina's partner was Mr. Beans. Together, they deceived their enemies into believing that they were an innocent nun and child duo, and would then attack them while their enemies let their guard down."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Baroque Works bounty hunter, Miss Catherina has some fighting skills, in which she worked with her partner, Mr. Beans to corner their opponents. Their main style of fighting was to fool their opponents into thinking that they were a powerless duo and then catch them off guard with a surprise attack. However, she is not very resistant as she fainted easily after Zoro hit her with the back of his blade."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Miss Catherina uses a disguised cross which sprays can spray out a blinding smoke. She also wields a katana that she uses to slash her opponents after she has blinded them."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "\"Kami no Gokago Metsubushi\" (神のご加護目潰し, \"Kami no Gokago Metsubushi\" literally \"God's Blinding Protection\"; Gesundhit in the Viz manga, a portmanteau of \"Gesundheit\", meaning \"health\" in German and typically used as a form of \"bless you\", and \"Hit\".): Miss Catherina sprays out a blinding mist of smoke at her opponents from the cross.", "elements": []}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Whisky Peak Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the Straw Hat Pirates sailed into the harbor of Cactus Island, Miss Catherina and the rest of the bounty hunters pretended to be happy at their arrival. As they sailed through, she and Mr. Beans cheered and gave them a warm welcoming. The bounty hunters then prepared a party for their visitors, in which Miss Catherina and some other girls pretended to be lovestruck over Usopp's bragging."}, {"type": "paragraph", "text": "Later, when Roronoa Zoro escaped from the house and overheard Mr. 8 discussing their plot to capture the pirate crew, Miss Catherina and the other bounty hunters armed themselves in preparation to fight him. After Mr. Bean tried to attack Zoro but failed, Miss Catherina jumped out to his aid and pretended to ask for mercy. Suddenly, however, she took out her cross and tried to blind the pirate with a surprise attack from her cross. She then attempted to slash him with her katana but, to her surprise, Zoro had evaded her attack. Miss Catherina and her partner were then knocked out by Zoro using the back of his blade."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Miss_Catherina_and_Mr._Beans_Attack_Zoro.png/revision/latest/scale-to-width-down/150?cb=20190710045433", "caption": "Miss Catherina and Mr. Beans attempt to gas Zoro."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Miss Catherina and Mr. Beans vs. Roronoa Zoro", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 106 (p. 17) and Episode 64, Miss Catherina makes her debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 107 (p. 13-14) and Episode 64, Zoro reveals the name of the organization on Whisky Peak.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 155 (p. 16) and Episode 91, Vivi reveals that those working under Frontier Agents are the Millions.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Information about Miss Catherina is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 61), Miss Catherina's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 108 (p. 11) and Episode 65, Miss Catherina and Mr. Beans fight Roronoa Zoro.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 13 Chapter 110 (p. 11), Mr. 5 reveals that secrecy is the principle of Baroque Works.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 107 (p. 3) and Episode 64, Miss Catherina pretends to be lovestruck over Usopp.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 12 Chapter 107 (p. 13), Miss Catherina prepares to fight Roronoa Zoro.", "elements": []}]}], "images": []}]}