{"sections": [{"title": "Tsumegeri Guards", "level": 1, "content": [{"type": "paragraph", "text": "The Tsumegeri Guards were four men who drank the Hero Water and attempted to take down Crocodile, but failed and died from the water's side effects shortly after Crocodile refused to even fight them to give them an honorable death."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Tsumegeri Guards wore the armor similar to the regular Alabasta Royal Guards but with the addition of a turban with a duck headband and wings on each sides. They wear what appears to be war paint, with one line that goes down to the nose as their common mark."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "All members are seen carrying a large sword or axe, though it is unknown how skilled they actually are. Having drunk the Hero Water granted them immense strength, allowing them to break their bracelets simply by bracing their muscles. But in exchange, their lifespans were shortened to five minutes."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Tsumegeri Guards appeared in the court yard of Alubarna Palace shortly after Crocodile explained his plan of obtaining Pluton to Cobra, Vivi, and Chaka. They demanded that Crocodile released the king and refused to leave despite Cobra's order not to anger Crocodile and the latter's offer to let them leave in recognition of their spirit. Instead the Tsumegeri Guards unleashed the power of the fatal Hero Water, breaking their bracelets just by bracing their muscles."}, {"type": "paragraph", "text": "Stating that they must let Crocodile know the country's pain and anger, they charged at him all at once and even managed to hit him. Yet, Crocodile dissolved into sand and remained unaffected by the attack before leaping to the roof of the palace, refusing to give them an honorable death. It is then that the Hero Water's side effect kicks in, they all collapsed and died."}, {"type": "paragraph", "text": "When Crocodile started laughing and commented on the stupidity of their actions, Chaka got furious and attacked Crocodile himself."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece Grand Battle 3", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 22 Chapter 196 (p. 2-10) and Episode 120, The Tsumegari Guards make their debut and die against Crocodile.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, The Tsumegari Guards' members named.", "elements": []}]}], "images": []}]}