{"sections": [{"title": "Ho", "level": 1, "content": [{"type": "paragraph", "text": "Dr. Ho is the palace medic of Alabasta's royal family. He seems to hold Drum medicine in high regard."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dr. Ho is a rather aged man, who wears a long cyan robe which covers most of his body, as well as a lilac scarf/cloak. He also wears a tall circular hat, similar to a fez, although instead of tapering into the conventional fez shape, it seems to expand in a shape similar to the center of an hourglass. He has white facial hair, which takes the form of a medium-length full beard starting below his nose carrying on past his chin. He has full lips, which are shown through his beard. He also wears circular glasses similar to those worn by Kuro."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ho seems to be a very curious and well-mannered doctor, and shows great interest in other doctors, perhaps in an effort to gain more medical knowledge. He also seemed confused by Chopper's contradictory behavior when he praises him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the palace medic of Alabasta's royal family, he is skilled in the area of medical science. However, it is not known how skilled he is in the field of medical science."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "Dr. Ho was shown watching Chopper as he made medicine after Alabasta was saved, when the Straw Hats were recuperating in the palace. He asked Chopper if he could watch him work, to which Chopper reacted with his usual response to positive attention from humans, and berated him for asking, while happily dancing and pulling a chair out for the doctor. Dr. Ho proceeded to ask if he should sit down."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 213 and Episode 128, Ho makes his debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 81), Ho is named.", "elements": []}]}], "images": []}]}