{"sections": [{"title": "Penguin", "level": 1, "content": [{"type": "paragraph", "text": "Penguin is a member of the Heart Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Penguin is an average sized lean man. Like most of the Heart Pirates he wears a beige overall, with their Jolly Roger displayed on the back and the chest pocket, as well as brown boots. He wears a black cap with a yellow brim, a red pompon on top and his name displayed on the front."}, {"type": "paragraph", "text": "His appearance after the timeskip is pretty much the same as before except the red pompom has now been replaced with a decoration that looks like a young emperor penguin, probably as a reference to his name."}, {"type": "paragraph", "text": "In Wano, he wore a light blue yukata with the Heart Pirates' jolly roger on each side of the chest. He also carries a sword at his side."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like Shachi, he likes women and is loyal to his captain, Law. As a teenager, he was a bully who was prone to mocking people and picking fights."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He resisted the burst of Haki released by Silvers Rayleigh in the Human Auction House which shows that he has a strong will."}, {"type": "paragraph", "text": "He has not yet been seen fighting in the manga, but in the anime, he has been seen using martial arts next to Shachi and is quite proficient at it.                                     "}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was seen carrying a spear when defending Zou from Jack and his army."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Eleven years before the start of the series, Penguin and Shachi were on Swallow Island in the North Blue. They were orphaned at a young age after their parents were killed in a tsunami. They had been sent to live with Shachi's aunt and uncle, who treated them like slaves and made them do illegal activities. One day, they ran away and lived in a shack in the forest."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "At some point, they met the polar bear mink Bepo and beat him up. Law, who was out on a walk, found them and confronted them. Law knocked both of them out with his Devil Fruit powers."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Sometime later, they gathered fruits in the forest and encountered a boar that pierced Shachi in the stomach. Penguin tried throwing a bomb that they stole, but it exploded before he could, and the boar severed Penguin's right arm. Law and Bepo saw the explosion and brought them to Wolf's farm. Law had Bepo stop their bleeding, but the two had lost so much blood that they needed transfusions. Wolf offered to give his blood to both of them despite the risk. Law then went to work on reattaching Penguin's arm, and after several painstaking hours, he successfully completed the operation and collapsed. Penguin and Shachi recovered, and Wolf was fine. After waking up, Penguin discovered that he could use his severed arm again, and he and Shachi thanked Law."}, {"type": "paragraph", "text": "A week later, Penguin and Shachi recuperated, and they told Wolf and Law their names and history. Law then offered for Penguin and Shachi to become his subordinates and live with him and Wolf, to which Wolf reluctantly consented to, and they accepted."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "Penguin, Shachi and Bepo joined Law to form the Heart Pirates. They fought their way through Paradise and eventually reached the Sabaody Archipelago."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/SBS84_Heart.png/revision/latest/scale-to-width-down/210?cb=20170520162944", "caption": "Shachi and Penguin meeting Law after beating up Bepo."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "After a long voyage following one of the Log Pose routes of the Grand Line, Law and his crew came to the Sabaody Archipelago to prepare themselves for the New World. He was seen standing behind his captain as he talked to X Drake."}, {"type": "paragraph", "text": "He is later seen with his captain at the Human Auctioning House, to observe the auction taking place. After interruptions by Luffy, the Heart Pirates found themselves fighting to escape, alongside Eustass Kid's and Luffy's crews, in the face of a daunting Marine attack."}, {"type": "paragraph", "text": "Alongside the rest of his crew Penguin fought against one of the Pacifistas; though the outcome of this battle was not seen they eventually managed to escape."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Battle of Marineford, the Heart Pirates and Penguin were initially present on the Sabaody Archipelago where the broadcast of Ace's execution was being shown. He was presumably watching the events at Marineford unfold, along with the Supernovas and they set sail immediately after the broadcast was cut. He can be seen on the Heart Pirates submarine as they emerge towards the end of the war to pick up a critically injured Luffy and Jinbe."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Penguin lands on Amazon Lily alongside the rest of his crew and is seen trying to keep Luffy, maddened over the loss of his brother Ace, down so he does not injure himself further."}, {"type": "paragraph", "text": "After Rayleigh arrives, the Heart Pirates leave Amazon Lily. Penguin expresses his disappointment about not getting a chance to see inside the all-female kingdom."}, {"type": "paragraph", "text": "Later out in the open sea, Law explains about waiting for the right time to enter the New World. Law tells his crew to follow his orders so he can steal the proper throne. Penguin and his crewmates cheer for their captain."}], "images": []}, {"title": "Post Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "While Law was staying at Punk Hazard, Penguin and the rest of the Heart Pirates crew went to Zou."}, {"type": "paragraph", "text": "During the Beasts Pirates' invasion, the Heart Pirates assisted the Mink Tribe."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Right after Wanda and Carrot stopped a fight between Luffy and a guardian, the Heart Pirates got reacquainted with Luffy and were excited to hear that Law arrived at Zou as well."}, {"type": "paragraph", "text": "When Law arrived at their location, the Heart Pirates were overjoyed to be reunited with him."}, {"type": "paragraph", "text": "After the Straw Hats returned to the Whale Forest, the Heart Pirates greeted Luffy but were then furious when Luffy and Law went on having a private conversation. The Heart Pirates and Luffy's crew (except Franky, Robin, and Brook) then partied with Nekomamushi and his subjects."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d5/Law_Reunites_With_His_Crew.png/revision/latest/scale-to-width-down/210?cb=20160925124410", "caption": "The Heart Pirates reunite with Law."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After leaving Zou, the Heart Pirates infiltrated Wano Country. On top of a mountain, Bepo, Shachi, and Penguin spotted Luffy and Zoro through binoculars as the latter two entered Okobore Town. When Luffy and Zoro were heading to Bakura Town in pursuit of a Gifter that abducted a little girl, the trio informed Law about the situation."}, {"type": "paragraph", "text": "On the way to Bakura Town, Bepo ate a fish from the polluted river and got sick, causing some delay to Law's group. After Luffy and Zoro wreaked havoc at Bakura Town, Penguin and Shachi met up with Law and Luffy's group at the ruins of Oden Castle."}, {"type": "paragraph", "text": "Penguin was then seen sitting outside as Kin'emon told Luffy's group about Wano's past. He then witnessed Kaido's arrival to the Kuri region. After Luffy rushed off with Law following him and Kin'emon and Kiku left to rescue Tsuru, the rest tried to escape as Kaido approached the castle and destroyed it with a fire breath. Penguin and the other males in the group were saved by the kunoichi Shinobu's jutsu which sunk them into the ground."}, {"type": "paragraph", "text": "Sometime after this ordeal, Penguin worked to deliver Kin'emon's secret message to his allies. Penguin was later captured by the Beasts Pirates to be used as bait for Law. Penguin and the other captured Heart Pirates were incarcerated in the Rasetsu District Prison."}, {"type": "paragraph", "text": "Prior to Law's arrival, Hawkins linked himself with Penguin, Shachi, and Bepo before separating Bepo from them. Penguin became worried when Shachi received Hawkins' wound on his arm. Penguin, Shachi, and Bepo were released by Hawkins, who made a deal with Law for their freedom in exchange for his capture. Law ordered them not to tell Luffy about his capture. They later met up with Nami at Ebisu Town. After Nami left with the message Bepo gave to her, the Heart Pirates discussed about their captain's situation."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Penguin and Shachi vs. Trafalgar D. Water Law (unseen)", "elements": []}, {"text": "Heart Pirates vs. Marines", "elements": []}, {"text": "Heart Pirates and Kid Pirates vs. a Pacifista", "elements": []}, {"text": "Heart Pirates and Mink Tribe vs. Beasts Pirates", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Dance Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the 6th fan poll, Penguin ranked at 70th place.", "elements": []}, {"text": "After the timeskip, he became the second person in the series to wear a signature hat that features a decorative bird figure on top, after Sengoku.", "elements": []}, {"text": "Penguin's wanted poster in Wano Country writes his name with the kanji 人鳥 (, Jinchō, literally \"human bird\"), an archaic Japanese word for the penguin. His hat depicted on the illustration also uses the kanji instead of the English writing \"PENGUIN\".", "elements": []}]}], "images": []}]}