{"sections": [{"title": "Bogard", "level": 1, "content": [{"type": "paragraph", "text": "Bogard is a Marine Headquarters Marine and the right hand man of Vice Admiral Monkey D. Garp. His actual rank is currently unknown."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bogard is a tall man, roughly half a head higher than Monkey D. Garp who is just a bit shorter than Kuzan. He has a short hair. He wears a marine coat, which is draped over his shoulders. He wears a matching beige suit and hat, with the hat covering his eyes in a shadow."}, {"type": "paragraph", "text": "He has his katana on his left hip, attached to his belt with a brown strap. The sword has a grey-wrapped hilt, a golden rounded-cross shaped tsuba and a deep green sheath."}, {"type": "paragraph", "text": "Bogard seems to wear an apparently perpetual scowl on his face due to the corners of his mouth always pointing downwards, even as a young marine, emphasizing his air of seriousness. On the rare occasions he smiles, it appears more like a smirk."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appears to be loyal to Garp, as he has been seen multiple times throughout the series at the vice admiral's side, and is notably much quieter than his superior, only speaking when absolutely needed. Bogard seems to enjoy smoking the kiseru pipe, doing so during Garp's test of Koby and Helmeppo, underscoring his air of absolute calm."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He seems to be skilled in using a sword, as his first reaction to Morgan breaking free and attacking Garp was reaching for his katana, to strike immediately. Also he was able to cut up Koby's guns into small pieces without hurting him in mere seconds. Later, he was seen training Koby and Helmeppo, using only one hand (and his less dominant at that) to defend himself against a total of three swords. Given that his sword is carried on the left and, when Morgan attacked Garp, he used his right to reach for it, Bogard is presumably mostly right-handed."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/34/Bogard_Using_His_Sword.png/revision/latest/scale-to-width-down/180?cb=20140727194708", "caption": "Bogard using his sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Twenty seven years ago, Bogard was in Kong's office when Garp was asked again to accept the rank of admiral. When the Marines learned that the Roger Pirates and the Golden Lion Pirates were about to battle in the Edd War, Garp decided to end the reunion and turned down another promotion, even though Kong did not agree and ordered him to stay. Bogard then nodded at the Fleet-Admiral and left the office with Garp, who was willing to head for the New World in order to defeat Gol D. Roger."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/47/Bogard_and_Garp_25_years_ago.png/revision/latest/scale-to-width-down/180?cb=20170905122345", "caption": "Bogard and Garp in Kong's office during the battle of the Edd War."}]}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Diary of Koby-Meppo", "level": 4, "content": [{"type": "paragraph", "text": "Bogard accompanied Garp during his mission to transport a prisoner, the former Marine captain Morgan, to be prosecuted. When Morgan attacked Garp, Bogard reached for his sword, but stood down when Morgan took Helmeppo hostage. As Morgan was escaping with Helmeppo on a small boat, Bogard ordered Marine soldiers to fire a cannon at the vessel.Koby attempted to obstruct the attack by standing in front of the cannon while holding pistols in his hands, but Bogard quickly used his swordsmanship to slice the guns into pieces. When Garp announced his intention to take the Koby and Helmeppo with him to Marine Headquarters, Bogard and the other Marines were surprised."}, {"type": "paragraph", "text": "Later at Marine Headquarters, Bogard trained Koby and Helmeppo in swordsmanship under Garp's supervision."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Bogard was present at Water Seven alongside Koby and Helmeppo in the group of Marines led Garp, while they visited the Straw Hat Pirates. When Roronoa Zoro arrived and started attacking the Marines, Bogard recognized him as the \"Pirate Hunter\" with a bounty on his head. It is unknown how he reacted when Garp revealed that Luffy's father, and thus Garp's son, is the revolutionary Dragon."}, {"type": "paragraph", "text": "When Garp explained that he will not capture Luffy because he is his grandson, Bogard criticized his excuse and told him to just report that the Straw Hats \"got away\". He was on Garp's ship when the vice admiral complained about Sengoku forcing them to go after Luffy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Bogard_at_Water_Seven.png/revision/latest/scale-to-width-down/210?cb=20160817220821", "caption": "Bogard at Water Seven with Garp, Koby, and Helmeppo."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "His name was revealed in the Episode 68 credits and was never mentioned in the manga which makes the name non-canon. Also in the anime version of the Diary of Koby-Meppo, Bogard was never seen cutting Koby's guns as Koby did not carry any."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He resembles the actor, Humphrey Bogart, most notably in Casablanca in terms of appearance and name.", "elements": []}]}], "images": []}]}