{"sections": [{"title": "Ultraking", "level": 1, "content": [{"type": "paragraph", "text": "Ultraking was the assistant-manager of Rain Dinners in Rainbase during the Alabasta Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Ultraking is an average sized man, with wild white hair that resembles a crown. He has a tiny bit of hair on his upper lip and sports a black suit over a purple shirt and red bowtie."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Ultraking seems to be a relatively calm person, since he didn't freak out when the Straw Hat Pirates entered his casino and simply called for security. He does, however, get quite apologetic to Miss All Sunday, who is the manager of the casino, when Luffy defeats the Koala Mercenaries."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He was able to run a successful casino for a long while and had the authority to call on the Koala Mercenaries for help until it was shut down due to the Baroque Works incident."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point, Ultraking met and was trusted by Crocodile to take charge and run his Rainbase casino, Rain Dinners. He was given the position of assistant-manager, while the manager position was given to Miss All Sunday."}], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Luffy and his crew barged into his casino, Ultraking ordered the Koala Mercenaries, the casino's security, to apprehend the pirates. After they were defeated, he deeply apologized to Miss All Sunday. She told him to lead the pirates into the VIP Room, which confused Ultraking, but he did so when she said it was Crocodile's orders. He and his staff then led them, along with Smoker, to the VIP Room, where they were locked in a cage to drown."}, {"type": "paragraph", "text": "His fate after the casino closed is currently unknown."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 169 and Episode 106, Ultraking makes his debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 78), Ultraking's name is revealed.", "elements": []}]}], "images": []}]}