{"sections": [{"title": "Buhichuck", "level": 1, "content": [{"type": "paragraph", "text": "Buhichuck was the boss of the \"Surprise Zombies\" in the dining room."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "At first glance, he looks like an ordinary pig's head mounted on the wall. However, he can come to life. In fact, he actually has a whole body, with his head and front legs stuck in a frame which makes it look like he does not from the front."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/68/Buhichuck%27s_Back.png/revision/latest?cb=20150730100941", "caption": "Buhichuck's backside."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is always seen smiling. He is loyal to Moria, as shown when he played a trick on the Straw Hat Pirates, by guiding them in the room that was full of General Zombies."}, {"type": "paragraph", "text": "Buhichuck's unique laughter comes from the first part of his name, being a sequence of \"Buhi\"s."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He can wield a pair of swords mounted below him as throwing weapons. He does this by using his concealed hands."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Thriller Bark Arc", "level": 3, "content": [{"type": "paragraph", "text": "According to him, there were Surprise Zombies hidden in every room of doctor Hogback's mansion. After defeating the surprise zombies of the living room, Luffy, Franky, Robin, and Zoro forced Buhichuck to show them around the castle. They did not know that members of their crew were being picked off one by one for the zombie army. However, instead of helping them, the pig mount merely lead the team to a room that was controlled by an armored platoon of General Zombies and then ran away."}, {"type": "paragraph", "text": "In the end, his shadow was stolen by Gecko Moria's \"Shadow Asgard\" technique."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "An alternate translation of Buhichuck's name is \"Oinkchuck\", as \"Buhi\" is the Japanese equivalent of \"oink\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 46 Chapter 446 (p. 13) and Episode 340, Buhichuck is seen hanging on a wall in the Thriller Bark Dining Hall.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 47 Chapter 450 (p. 14).", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 46 Chapter 447 and Episodes 341–342.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 47 Chapter 450 and Episode 344.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 47 Chapter 451 and Episode 345.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 47 Chapter 452 and Episode 346.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 49 Chapter 481 and Episode 373, Moria takes away Buhichuck's shadow.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Trophy hunting – Wikipedia article about trophy hunting and hunting trophies like Buhichuck.", "elements": []}, {"text": "Taxidermy – Wikipedia article about the process used to make hunting trophies like Buhichuck.", "elements": []}]}], "images": []}]}