{"sections": [{"title": "Seto", "level": 1, "content": [{"type": "paragraph", "text": "Seto was one of the Shandia who lived on Jaya four hundred years ago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Seto was a thin, muscular boy with shaggy black hair and tan skin. He wore a brown skirt made out of leaves, and a tan loincloth. He wore a white cap, with black upside down U shapes. He has white wings on his back, like other Shandia."}, {"type": "paragraph", "text": "When he was older, he wore his hair in a pony tail, and he no longer wore his cap. He also had yellow bands around his upper arms."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f2/Younger_Seto.png/revision/latest/scale-to-width-down/180?cb=20180428215301", "caption": "Younger Seto."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Seto was a Shandia who desired to be like Kalgara, whom he admired. When he caught the plague, he became distraught that he was going to die, never seeing his dream come true. He became one of the first Shandia to trust Noland, who as a stranger cured his disease and earned his trust. He displayed noble traits by standing in front of the cages that held Noland's men when the villagers wanted to kill them, keeping their promise not to harm Noland's men until the time ran out. However, he was quick to shun Noland like any other Shandia once they discovered their sacred forest was cut down. When Mousse explained the misunderstanding, he lived hoping for the day Noland would return. Like Kalgara, he displayed a strong desire to protect his village and cared heavily for its people."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being a Shandia and training since he was child to be a warrior like Kalgara, Seto was presumably strong. After part of the island of Jaya was catapulted into the sky, Seto was able to fight against the invading Skypieans despite the accused shock and lack of oxygen in the atmosphere, thus denoting remarkable physical endurance."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Seto wielded a spear in combat."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Seto was affected by the plague that ravaged the Shandia on Jaya. However, Mont Blanc Noland managed to cure it in time. He knew from the start that Noland was a honest, wise and good man, and he defended Noland and his crew from the wrath of the Shandia. At some point after Noland's departure, he married Kalgara's daughter Mousse."}, {"type": "paragraph", "text": "Years later, he and Kalgara entered the ruins to ring the bell. While Kalgara went to ring the bell, Seto fed Nola (who had made itself at home in the ruins) an apple. Suddenly, there was an earthquake, and he and Kalgara fled to the village. The Knock Up Stream had shot their island into the sky, and Seto found himself living his childhood dream to defend his people when the Skypieans came to take their land away from them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b0/Seto_Feeding_Nola.png/revision/latest/scale-to-width-down/190?cb=20130502223226", "caption": "Seto feeding Nola at the ruins."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 31 Chapter 287 and Episode 187.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 97), Seto's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 31 Chapter 289 and Episode 188, Seto protects Noland's crew.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 31 Chapter 292 and Episode 189, fate of the Shandia.", "elements": []}]}], "images": []}]}