{"sections": [{"title": "Donquixote Mjosgard", "level": 1, "content": [{"type": "paragraph", "text": "Saint Donquixote Mjosgard is a World Noble who visited Fish-Man Island ten years before the start of the series. He is a member of the Donquixote Family."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mjosgard has his dark green hair styled in an updo, a hairstyle shared by most other World Nobles. He has a wide face with a bulbous nose that has snot hanging out from time to time, thick lips, and small slit-like eyes. Like all World Nobles, he wears a thick white protective suit adorned with medal-like knobs and an air bubble when out in public. When he arrived on Fish-Man Island, he was shown bloody and injured after his journey."}, {"type": "paragraph", "text": "In the present, his appearance remains mostly the same with only some minor changes. He appears slimmer and his hair appears more angular. His face has facial hair, and his eyes appears more blackish. He wears a simple, light purple collared shirt underneath his protective suit."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Formerly, Mjosgard was extremely conceited like most World Nobles, thinking of himself as superior to everyone else and being under the impression that he was well respected even when it was obvious that he was not. This is clearly shown when he wanted a helmet above medical attention, so he would not have to breathe the same air as commoners, and gasping in pain when his protective helmet was lost due to having to breathe the same air as Fish-Men. He further elaborated his belief in the anime by claiming that the queen of a fish-based country is no higher than any commoner, if not lower, when compared to himself."}, {"type": "paragraph", "text": "He was very possessive of what he considered his property, as he was traveling to Fish-Man Island to reclaim his fish-man slaves that escaped, calling them a treasured collection. He also justified his actions and his reason for others to save him simply because he was a noble, and showed extreme cowardice when his life was threatened due to lack of witnesses to report to an Admiral, though his arrogance prevented him from pleading."}, {"type": "paragraph", "text": "After his meeting with Otohime, he became a more humble and benevolent man, as seen by his coming into the defense of Neptune's family. He even struck a fellow World Noble Charlos after he tried to take Shirahoshi by force and apologized on the behalf of the World Nobles. Being reformed, Mjosgard is remorseful of his former depravity, as he referred to his former self as a foolish man. Another interesting fact is that Mjosgard referred to himself as a human and admitted he owed a debt to Neptune's family."}, {"type": "paragraph", "text": "According to Rosward, Mjosgard no longer buys and owns any slaves, even comparing him to Homing for his newfound benevolence."}, {"type": "paragraph", "text": "Like many other One Piece characters, he has his own unique laugh, which is \"susususususu\"."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [{"type": "paragraph", "text": "Despite his former arrogance, he was able to have civilized conversations with his father, speaking in what appeared to be affectionate tones with each other, showing that he respected only those of equal or higher status to his. Mjosgard addressed his father as \"my daddy\", while his father properly answered with \"my son\"."}], "images": []}, {"title": "Neptune Family", "level": 3, "content": [{"type": "paragraph", "text": "He originally thought little of the queen of Ryugu Kingdom. Even after she saved his life, he threatened her with his pistol and when she said she would accompany him back to the Holy Land, he was visibly annoyed, but somehow during her journey with him, she apparently made him a kindhearted man through currently unknown means. Ten years later, he even saved her daughter on her behalf and promised her family that he would help them in any way he can. He also took it upon himself to protect Shirahoshi during the duration of the Levely."}], "images": []}, {"title": "Charlos", "level": 3, "content": [{"type": "paragraph", "text": "When Charlos tried to make Shirahoshi his personal \"pet\", Mjosgard hit his fellow World Noble in the face with a spiked club for his appalling actions and set Shirahoshi free. Mjosgard then apologized for Charlos bringing fear into the socializing plaza."}], "images": []}, {"title": "Slaves", "level": 3, "content": [{"type": "paragraph", "text": "Like other World Nobles, Mjosgard used to own many slaves including fishmen. He treated these slaves as his property and subjected them to torture, such that, when he ran into his slaves again on Fishman Island, they were willing to kill him. However, after his encounter with Queen Otohime, he developed a new attitude towards slavery and eventually released all his slaves upon his return to Mary Geoise and currently does not own any slaves."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a8/Mjosgard%27s_Former_Slaves.png/revision/latest/scale-to-width-down/180?cb=20190516184711", "caption": "Mjosgard's former slaves"}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a World Noble, he has immense political authority to basically do as he pleases, with the ability to summon a Marine Admiral to attack anyone who he deems to threaten him. His authority is great enough that he can directly oppose and even punish a fellow World Noble without any consequences."}, {"type": "paragraph", "text": "Although he was spoiled with the greater wealth of his culture like the rest of his people, he was at least durable enough to survive the attack of sea creatures deep underwater, while the rest on his ship were all killed."}, {"type": "paragraph", "text": "He seems to be quite strong, as he was able to send Charlos flying a short distance away from him with a single hit of his club."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Like other World Nobles, he wields a pistol to shoot anyone who displeases him, which he used to threaten the citizens of Fish-Man Island to treat his wounds. While the manga depicts it as a regular flintlock, the anime shows a golden-yellow pipe-like pistol, similar to the one Charlos wielded. In the past, he was shown to use his flintlock to shoot his slaves solely for his amusement. He also wielded a spiked club when he stopped Charlos from taking Shirahoshi."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Mjosgard spent some time buying Fish-Men on the Slave Trade market assembling them into a \"Prized Fish-Man Collection\" all of which he treated poorly and were freed during Fisher Tiger's raid on Mary Geoise."}, {"type": "paragraph", "text": "Ten years ago, when Jinbe joined the Shichibukai, Mjosgard's father explained to him the current event and the likelihood of him finding his \"property\". Mjosgard and his father were both outraged at this so Mjosgard traveled to Fish-Man Island in order to reclaim his escaped slaves. However, his ship was attacked by what were believed to be beasts on the sea floor, leaving him the only survivor. When he arrived on Fish-Man Island, he was bloodied and injured, ordering the citizens to bring him a helmet and lamenting being the only survivor. He complained how the island stank of Fish-Men and ordered them to bring him a doctor."}, {"type": "paragraph", "text": "When he was met by some of the Sun Pirates members who settled as citizens, he recognized some of them as his former slaves that he abused and humiliated in the past, and told them to come home and be obedient, saying no one gave them permission to be free. He panicked when the fish-men pointed guns at him, trying to flaunt his status to discourage them. When he was told by the assailants that none of the Fish-Man Island citizens would act as witnesses and that Mjosgard's death can be written off as a shipwreck accident, he started to shout insults angrily. One of the Sun Pirates shot at him, but the bullet was intercepted by Otohime. As Otohime tried to reason with the angry fish-men, Mjosgard reached for his gun and tried to shoot her, only to be stopped by Shirahoshi. She summoned Sea Kings using her voice, and their arrival sent him into shock and Mjosgard passed out, foaming at the mouth."}, {"type": "paragraph", "text": "He was treated by Aladine and was fully recovered several weeks later. He left the island seemingly ungrateful to the people for the way he was treated, calling them cattle and saying they would regret it. He showed some reluctance and disdain when Otohime announced that she would be traveling with him, as he was angry that the queen would undermine his power and invite herself on board his ship."}, {"type": "paragraph", "text": "During Otohime's week long absence from Fish-Man island, she apparently reformed him, making him embrace his humanity and turning him into a much more benevolent and humble man. As a result, Mjosgard stopped owning any slaves altogether."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/56/Mjosgard%27s_Ship.png/revision/latest/scale-to-width-down/230?cb=20141206185414", "caption": "Mjosgard's damaged ship arriving on Fish-Man Island."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d4/Mjosgard_Injuries.png/revision/latest/scale-to-width-down/230?cb=20141206191919", "caption": "Mjosgard after disembarking from his ship."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "When Charlos tried to take Shirahoshi by force, Mjosgard intervened on the Neptune Family's behalf and knocked Charlos out with a spiked club and ordered for Shirahoshi to be set free. He then apologized for Charlos' actions and declared that he would help the people of Fish-Man Island."}, {"type": "paragraph", "text": "After Charlos was taken away, Mjosgard told Neptune that he would stand beside Shirahoshi throughout the Levely and would take full responsibility if a fight broke out."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b6/Charlos_Beaten_Up_Second_Time.png/revision/latest/scale-to-width-down/210?cb=20190526030331", "caption": "A reformed Mjosard rescues the Mermaid Princess by striking Charlos."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mjosgard believing he could reclaim his slaves after they were freed is similar to the fugitive slave laws enacted in the United States, allowing slave owners to reclaim escaped slaves as long as they could provide proof of ownership.", "elements": []}, {"text": "He is the only known member of the Donquixote Family who does not have blond hair.", "elements": []}, {"text": "He is the second member of the Donquixote Family to declare himself as a human. The first was Donquixote Homing.", "elements": []}, {"text": "His name may be a combination of two concepts of Norse mythology: Mjolnir, the hammer of Thor, and Asgard, one of the nine realms.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 625 and Episode 545, Mjosgard is the sole survivor in his journey to retrieve his slaves.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 91, http://one-piece.com/special/sbs/detail/13.html", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 907 (p. 16), Mjosgard's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 907 (p. 14-17) and Episode 886, Mjosgard meet the Ryugu Kingdom royal family.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 625 and Episode 545, Mjosgard arrives at Fishman Island to retrieve his slaves.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 (p. 6) and Episode 888, Rosward mentions that Mjosgard does not own any slaves.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 908 and Episode 888.", "elements": []}]}], "images": []}]}