{"sections": [{"title": "Pacifista", "level": 1, "content": [{"type": "paragraph", "text": "The Pacifista are human weapons (人間兵器, ningen-heiki) developed by Marine head scientist, Dr. Vegapunk. They are cyborgs built in the mold of the Shichibukai Bartholomew Kuma, who was the cyborg prototype for the project. As stated by Sentomaru, the funds required for the construction of just one Pacifista are roughly equal to that of a Marine-issued battleship."}, {"type": "paragraph", "text": "Sentomaru noted that after the timeskip period, PX-5 and PX-7 were outdated models from two years ago, meaning that the Pacifista project has been updated and modified."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "All the Pacifista replicas seen thus far have been identical in appearance to Bartholomew Kuma, even in his uncommon body proportion. The only distinguishing features between them and the genuine article are the lack of a Bible and Kuma's Nikyu Nikyu no Mi palm pads, though the latter is not initially apparent as they all wear similar gloves. Each Pacifista is considered to be a copy of Kuma, except for the original one who was gradually converted into a Pacifista. The Pacifista have the voice of Kuma, furthering their genuine replication to him. They are under complete control of the World Government."}, {"type": "paragraph", "text": "Their appearances are so convincing that pirates unfamiliar with the genuine article believe they are the real Kuma. The Straw Hat Pirates, having previously fought Kuma, were able to tell the difference eventually. Likewise, X Drake, a former rear admiral familiar with the project, was aware of its nature. Some New World pirates are aware of Vegapunk's experiments, and that he sent several prototypes to handle incidents in the past, but were surprised that they were all modeled after Kuma."}, {"type": "paragraph", "text": "All Pacifista are labeled by the letters \"PX\", then a hyphen and a number, presumably indicating the order in which they were constructed. The label is printed on the right side of their necks. There appears to be around twenty of them in service as of the Marineford War, though it is unknown how many have been destroyed and built since then."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Pacifista are straightforward and robotic in the execution of their duties. They can identify pirates with active bounties and will immediately attack. Pacifista will normally avoid attacking allies, such as the Shichibukai, though this directive can be ignored if they are ordered to attack. If they are not ordered to, they will not even attack when they are attacked themselves, as seen when Hancock destroyed several Pacifista in a row. It is not clear exactly what command structure the Pacifistas fall under. At the very least, they will obey Sentomaru and Kuma himself."}, {"type": "paragraph", "text": "Pacifista have the ability to speak, but rarely do so. Usually, they will speak to announce the presence of a pirate with an active bounty (Trafalgar Law, Scratchmen Apoo, and Monkey D. Luffy have all been referred to this way). During the Marineford War, one relayed orders to stand down when Boa Hancock moved into its path of fire. It then ordered her to step aside. Sentomaru was also able to order one to speak, having it identify a pirate to an assembled crowd."}, {"type": "paragraph", "text": "While Bartholomew Kuma was loyal to the World Government, he still had the free will to choose whether or not to obey orders. After the modifications were completed, he became practically as emotionless as any Pacifista. However, as his last act as a free man, Kuma had a special mission programmed into him by Vegapunk, instructing him to protect the Thousand Sunny until it was reclaimed by the Straw Hats. Following this, he presumably behaves as the others do."}, {"type": "paragraph", "text": "While they mostly mimic Kuma's stoic personality to a Tee, at least one has been shown to exhibit slight emotion via facial expression (such as during the raid on Sabaody when the first one to fight with the Straw Hats showed a look of mild-shock and then anger after Luffy dodged its laser sweep)."}, {"type": "paragraph", "text": "While they ordinarily attack with precision, a damaged Pacifista can potentially go berserk and fire wildly in every direction. As seen in the fight between PX-4 and the Straw Hats, Pacifista could panic if they suffered enough damage and will attack randomly, without aiming, to defeat the threat. This may be a malfunction or an emergency setting."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The Pacifista are cyborgs, similar to Franky of the Straw Hat Pirates. They are composed of a metal even stronger than steel, as demonstrated when Zoro's attempt to attack the partially-converted Kuma only resulted in a slight gash in the metal, whereas ordinary steel would have been cleaved in two. After striking PX-1 once, Sanji (using Diable Jambe) was forced to note that another kick would break his legs (this technique easily broke through Jabra's Tekkai) However, as Franky pointed out, despite all their strengths, they are still human beneath and are capable of bleeding."}, {"type": "paragraph", "text": "Pacifista can identify wanted pirates on sight using a electronic scope, thus the red glow in the pupils of the eye lenses, that works at a significant distance. It not only lets them know the name of the person in front of them but also their bounty. Their recognition ability is also extremely good, as one was able to identify Luffy while obscured by smoke, in addition to seeing through his heavy clothing and joke mustache disguise; it also distinguished the impostor Luffy's true identity. The real Kuma was also able to identify Franky after the two-year timeskip despite the extensive modifications that the fellow cyborg underwent."}, {"type": "paragraph", "text": "The Pacifista's main mode of combat is firing laser beams from their mouth and hands (with exception of the real Kuma, whose Nikyu Nikyu no Mi cover the palm of his hands and limit his laser to his mouth) which are based on Kizaru's light-based Devil Fruit. These beams are capable of causing massive explosions and piercing powers, causing tremendous damage to targets and the environment. Pacifista can also run slightly faster than most people and jump quite high, despite their size, although they are still slower than Kuma himself (this being ironic as Kuma himself never runs)."}, {"type": "paragraph", "text": "As cyborgs, the Pacifista are capable of taking staggering amounts of damage without being disabled. For example, despite being set on fire by Sanji, PX-1 continued operating. PX-4 also continued operating despite direct damage to its internal systems. The laser beams from their mouth can cause a severe backlash if the mouth is forced shut before firing, which causes the photon energy to explode inside the cyborg's body, damaging the internal systems; though even this would not be enough to force a shutdown. Only significant and irreversible trauma seems capable of stopping them, such as breaking their necks or cleaving them in two. They may explode if sufficiently damaged."}, {"type": "paragraph", "text": "As pointed out by the Straw Hats, the lack of the Devil Fruit ability does not make their defenses or built-in weaponry any weaker than those of the original. In fact, it took the entire Straw Hat forces just to bring down one of the replicas - an effort which left them winded and exhausted (though Zoro had previously been wounded from the fight on the Thriller Bark). However, Kuma's Devil Fruit still separates him from the other Pacifistas in terms of overall capabilities; Kuma himself easily dealt with PX-1 unit by \"teleporting\" him away."}, {"type": "paragraph", "text": "According to Sentomaru, the versions used against the Straw Hats were the prototypes, so there is presumably a production model which is stronger than the original."}, {"type": "paragraph", "text": "After the timeskip, the Pacifista appear to be considerably less formidable due to the newfound strength of the Straw Hats, as Luffy, Zoro and Sanji have proven to be powerful enough to take down Pacifista by themselves with little effort. However, they were still powerful enough to take down the likes of Lip Doughty with relative ease."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/18/Pacifista_Mouth_Beam.png/revision/latest/scale-to-width-down/250?cb=20110226005627", "caption": "Pacifista mouth beam."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/ba/Robin_Smashes_PX-4%27s_Head.png/revision/latest/scale-to-width-down/250?cb=20150802035043", "caption": "Robin forces PX-4 to swallow its own laser, causing it to go berserk."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Years before the current time, the Shichibukai who hated the World Government, Bartholomew Kuma, struck a deal with the Marines, and willingly became a human test subject for the Pacifista program developed by Dr. Vegapunk. Over time, the project began converting Kuma part by part, starting with his hands, then legs, though he retained his free will so long as his brain remained unmodified. Vegapunk also created many Pacifista units, all of whom had the same appearance as the real Kuma, and sent these prototypes to deal with incidents around the world. Few people outside the Marines actually knew about these prototypes, thinking they were the real Kuma, but several people did hear rumors about them, mostly pirates in the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/Bartholomew_Kuma_Undergoing_Pacifista_Modifications.png/revision/latest/scale-to-width-down/300?cb=20130623094322", "caption": "Kuma undergoing the Pacifista modification."}]}, {"title": "Thriller Bark Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Kuma witnessed Moria get beaten by Luffy, Kuma then reported this to the World Government. Fearful that the rumors of Moria's defeat will cause another global uproar like with Crocodile, they ordered Kuma to kill all witnesses on Thriller Bark including the Straw Hat Pirates. Accepting the order, he launched an attack on some of the members of the Thriller Bark Victim's Association before shifting his attention to Zoro. Kuma weakens Zoro, and uses his Devil Fruit ability to take down Franky and Sanji. He gives them an ultimatum: let him kill Luffy, and he will let them live. When they refuse him, Kuma calmly detonates the entire island."}, {"type": "paragraph", "text": "Though this does not succeed in killing the Straw Hats, it renders all of them incapacitated. Just when he is about to finish off an unconscious Luffy, Zoro, in a desperate move, strikes him with Ittoryu Iai: Shishi Sonson (Lion's Song) in an effort to kill him by cutting him in two but is only able to damage him on the left shoulder. The wound on Kuma's shoulder reveals that he is a Cyborg. He then reveals that he is different from Cyborg Franky. Kuma is an incomplete human weapon created by the World Government and Dr. Vegapunk, known as a Pacifista. Zoro offers to trade his life for Luffy's, seeing no other way. Kuma agrees and at that moment, Sanji decides to give his life up. Zoro promptly knocks him out, feeling necessary to sacrifice his own life rather than Sanji's. Kuma states that he would not harm Luffy, as his \"honor would be at stake\", in exchange for Zoro experiencing the pain Luffy endured throughout his fight against Moria. Kuma proceeds to literally extract Luffy's pain, and directs it to Zoro, which almost kills him. Kuma then teleports to the entrance to the ship. He is then seen at Thriller Bark musing about Dragon, having a good son with a loyal crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/77/Kuma%27s_Cybernetic_Enhancements.png/revision/latest/scale-to-width-down/270?cb=20160127232838", "caption": "Kuma's Pacifista modifications."}]}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "Soon after, many other Pacifista units made their way to the Sabaody Archipelago, where one of them was able to track down and find the escaping Kid Pirates, who were running from other Marine chaos due to the actions partially caused by captain Eustass Kid. The Heart Pirates soon joined in the battle to escape the island."}, {"type": "paragraph", "text": "Also, another Pacifista appeared in front of Urouge and a third in front of the Straw Hats. During the recent battle, they demonstrated none of the Devil Fruit abilities the original Bartholomew Kuma had previously, firing lasers from his hands instead of using his Devil Fruit, and failing to counter Franky's Coup de Vent, despite his previous fighting style being heavily focused on reflecting air. It was X Drake who revealed that these many Kumas are in fact Pacifistas, into which Vegapunk has copied Kuma's appearance and Kizaru's powers."}, {"type": "paragraph", "text": "Kuma himself arrives and, using his Nikyu Nikyu no Mi's repelling ability, separates the entire Straw Hat crew by repelling them, sending them, and PX-1 who was about to strike them, to different locations all over the world."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Heart_and_Kid_Pirates_vs._Pacifista.png/revision/latest/scale-to-width-down/210?cb=20141206070613", "caption": "Eustass Kid, Killer and Trafalgar Law vs. Pacifista."}]}, {"title": "Marineford Arc", "level": 3, "content": [{"type": "paragraph", "text": "During the war between the Whitebeard Pirates and the World Government, at Kuma's battle with Ivankov, Donquixote Doflamingo revealed that Kuma had been fully converted into a Pacifista, PX-0, losing his free will in the process. Later, near the final stretches of the war, where Portgas D. Ace's execution would occur earlier than planned, Sentomaru appeared from the bay of Marineford, backed up with an army of at least twenty Pacifista."}, {"type": "paragraph", "text": "Following Sengoku's plan, Sentomaru ordered the Pacifista to surround the New World pirates in a circular formation, and eliminate them while they were trapped, all the while killing anyone who tried to leave the circle. The pirates were outmatched by the Pacifista's superior firepower and armor, and Whitebeard noted that they were not above sacrificing allies to achieve results. However, Sengoku ordered them to avoid attacking the pirates of Whitebeard, as a way to create doubt and manipulate Whitebeard's allies to attack Whitebeard on the belief he was sacrificing them to save Ace."}, {"type": "paragraph", "text": "During the battle at the plaza, they destroyed many pirate and marine ships alike to ensure the fatalities of the enemy. The desperate New World Pirates attempted to damage some with rocket launchers and maces but they proved ineffective against their strong bodies. Eventually some of the New World pirates managed to take down a Pacifista by puncturing its neck with a lance and a combination of firepower to its body."}, {"type": "paragraph", "text": "Later, it seems that some Pacifista tried to attack Monkey D. Luffy but were interrupted by Boa Hancock, who crushed and petrified several of them until she was confronted by Sentomaru. When he confronted her, demanding to know why she was attacking the Pacifista, her response of, \"Love is always a Hurricane!\" left him rather confused."}, {"type": "paragraph", "text": "In the anime, there was additional scenes of them crushing the New World Pirates and Hancock continuing to stall their efforts to target Luffy by jumping in their way. She destroyed more Pacifistas under the excuse they may have hit Sengoku by accident. When the war reached its peak, they were seen standing back along with the Shichibukai witnessing the death of Whitebeard."}, {"type": "paragraph", "text": "Upon the Blackbeard Pirates declaring war on Marineford, they moved forward attacking the Whitebeard Pirates attempting to escape moving past the fissure gaps towards the ships. When Sengoku called off the war, they stood down, allowing the remaining Whitebeard Pirates to escape."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Sentomaru_Arrives_with_an_Army_of_Pacifista_at_Marineford.png/revision/latest/scale-to-width-down/260?cb=20141206162213", "caption": "Sentomaru arrives with an army of Pacifista."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c5/The_Pacifista_Launch_Their_Attack.png/revision/latest/scale-to-width-down/210?cb=20150308232227", "caption": "The Pacifista attack the New World Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4f/Pacifista_Pursue_the_Whitebeard_Pirates_and_Allies.png/revision/latest/scale-to-width-down/250?cb=20110226005651", "caption": "The Pacifista pursuing the Whitebeard Pirates."}]}, {"title": "Post-War Arc", "level": 3, "content": [{"type": "paragraph", "text": "Shortly after the end of the war, innumerable Pacifista units, accompanied by Donquixote Doflamingo, quickly surrounded Gecko Moria behind the street corner of Marineford and began firing off their lasers at him. Under an order higher than Sengoku's, it was deemed that Moria was too weak to continue as a Shichibukai and that it would be better off if he was eliminated and made it look like he died in the war instead. However, before they could deal a death blow to Moria, he disappeared with what Doflamingo speculated to be his Kage Kage no Mi powers. Regardless, the wounds that the Pacifista inflicted was deep, and Doflamingo said that Moria was doomed to die no matter what—a claim that was later disproven, as Moria was rumored to be seen in the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Moria_Attacked_by_Doflamingo_and_Pacifistas.png/revision/latest/scale-to-width-down/210?cb=20141206164554", "caption": "Doflamingo and a squad of Pacifistas attempting to kill Moria."}]}, {"title": "Return to Sabaody Arc", "level": 3, "content": [{"type": "paragraph", "text": "When news arrives that the Straw Hat Pirates, who are actually impostors, have reappeared on the Sabaody Archipelago, Sentomaru leaves with PX-5 and PX-7 to capture them, believing that the Straw Hats are too strong to warrant any less. Because of their public debut during the war, more people seem to be aware of the Pacifista's existences."}, {"type": "paragraph", "text": "This proved to be a wise precaution as the real Straw Hat Luffy was present on the island. Upon PX-5 identifying the fake Luffy's identity and then the real Luffy, it proceeded to fire a laser beam at Luffy's head, which was easily dodged and prompting Luffy to claim it was too slow. It was then defeated with a Second Gear Gomu Gomu no Jet Pistol that was enhanced with Busōshoku Haki, and due to extreme damage, it exploded. PX-7 was soon destroyed by Zoro and Sanji upon their reunion, which also exploded from extreme damage. Sentomaru later commented that they were the same prototypes that attacked the Eleven Supernovas two years ago."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a2/Pacifistas_Attack_Imposter_Straw_Hat_Pirates.png/revision/latest/scale-to-width-down/250?cb=20130512182212", "caption": "Pacifistas attacking the recruits of the Impostor Straw Hat crew."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "PX-4 vs. Straw Hat Pirates", "elements": []}, {"text": "An unknown Pacifista vs. Heart Pirates and Kid Pirates", "elements": []}, {"text": "An unknown Pacifista and Kizaru vs. X Drake, Urouge, Scratchmen Apoo and Basil Hawkins", "elements": []}, {"text": "PX-1, Sentomaru and Kizaru vs. Straw Hat Pirates and Silvers Rayleigh", "elements": []}, {"text": "Pacifista army and Marines vs. Whitebeard Pirates' allies", "elements": []}, {"text": "Pacifista army vs. Boa Hancock", "elements": []}, {"text": "Pacifista army and Marines vs. Whitebeard Pirates and allies", "elements": []}, {"text": "Pacifista group and Donquixote Doflamingo vs. Gecko Moria", "elements": []}, {"text": "PX-5 and PX-7 vs. Fake Straw Hat Crew recruits", "elements": []}, {"text": "PX-5 vs. Monkey D. Luffy", "elements": []}, {"text": "PX-7 vs. Roronoa Zoro and Sanji", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "\"Pacifista\" is the Portuguese, Italian, Spanish, Czech, Catalan, and Galician word for \"Pacifist\"."}, {"type": "paragraph", "text": "In the European version of \"One Piece Unlimited Cruise 2\", they are referred to as \"Combat Weapon\" in the Treasure Map menu, but have been referenced as \"PX-1\" by the Straw Hat crew."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Unlimited World Red", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the Sabaody Archipelago Arc, a Pacifista attacking Usopp had his bounty in its data banks. However, it attacked Usopp even though it had a picture of Sogeking on the poster.", "elements": []}, {"text": "PX-Z are the (anime-only) Pacifista that are not affiliated with the World Government.", "elements": []}, {"text": "All the Pacifista measured 689 cm.", "elements": []}]}], "images": []}]}