{"sections": [{"title": "Soro", "level": 1, "content": [{"type": "paragraph", "text": "Soro was Helmeppo's pet wolf and the main reason that Roronoa Zoro was arrested by the Marines at Shells Town. He is classified as a Type C creature, \"Big Savage\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Soro was a light brown wolf with yellow eyes. He had small pupils, a brown nose, and sharp teeth. He was also seen drooling."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Soro has a very wild temperament, since he was running loose in the town. In the anime, he is shown to be quite vicious, terrorizing townspeople and causing mayhem."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, it was only stated that Soro was killed by Zoro after Helmeppo let him run loose in town. Since Soro was scaring the townspeople and was about to attack Rika, Zoro killed him with a slash much to the shock of everyone watching. However, in the anime, this was expanded. Helmeppo came into the town with Soro and scared everyone. They then went into a bar owned by a little girl and her mother. Soro started to scare the customers away. The little girl named Rika then started hitting Soro with a broom but her attempt only succeeded in annoying him. When he attempted to retaliate, Zoro intervened and killed him by throwing a stool at him."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Soro's role in the anime is expanded. Instead of being killed outdoors, he is killed indoors; and instead of being slashed, he is killed when Zoro throws a stool at him."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  Vivre Card - One Piece Visual Dictionary, His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 3 (p. 19) and Episode 2, Soro's name is revealed by Rika.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 88-89), classification of animals by dangerousness.", "elements": []}, {"text": "↑  One Piece Anime — Episode 2, Soro's role is extended in the anime.", "elements": []}]}], "images": []}]}