{"sections": [{"title": "Yorki", "level": 1, "content": [{"type": "paragraph", "text": "\"Calico\" Yorki was the captain of the Rumbar Pirates who brought Laboon to Reverse Mountain fifty years ago from West Blue."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Yorki was a blond haired pirate with two tattoos on his face, one under his right eye and one under his lower lip. His tattoos resembled the katakana character, ヨ (yo)."}, {"type": "paragraph", "text": "He typically wore a white cowboy hat and a green captain's coat with gold epaulettes. However, when he was first seen, he did not have a tattoo on his face and he was wearing a pirate hat, instead of a cowboy hat. He also wore a gold and red pendant."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9f/Yorki_Anime_Concept_Art.png/revision/latest/scale-to-width-down/120?cb=20190624084217", "caption": "Yorki's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Yorki was shown to be very carefree and light-hearted. He was seen teasing his crew when they fought over a trivial matter. He was shown to be a selfless captain when he told the crew to leave him, worrying that the crew would catch his disease."}, {"type": "paragraph", "text": "Unlike a typical pirate captain, the only prerequisite Yorki had for being a member of his crew was that you must love music. He stated it was the objective of his crew to make children smile, and with the exception of his illness, was rarely seen not smiling himself."}, {"type": "paragraph", "text": "Like most characters in One Piece, Yorki has a distinct laugh. It was in Brook's flashback during the Thriller Bark Arc: \"Na ha ha ha ha\" in the manga and \"Puhpiiiipi\" in the anime."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Yorki was a fairly strong pirate, since he and his crew defeated many other pirates and he gained a bounty for himself after a short time of piracy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d4/Yorki%27s_Wanted_Poster.png/revision/latest/scale-to-width-down/200?cb=20130403003824", "caption": "Yorki's wanted poster."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Yorki was seen fighting with a sword, so it can be assumed that he was likely quite skilled in using it."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Yorki was shown to be very friendly with his crew, unlike most pirate captains who treat their crew badly. He was shown to sometimes tease them, as well as playing along with them."}], "images": []}, {"title": "Brook", "level": 4, "content": [{"type": "paragraph", "text": "Yorki seemed to be understanding towards Brook's feelings, and they both have a mutual friendship. He understood when Brook felt down about leaving Laboon, and frequently requested for Brook to play \"that song\", which is Binks' Sake, a song Yorki's crew always sang."}], "images": []}, {"title": "Laboon", "level": 4, "content": [{"type": "paragraph", "text": "Just like the rest of the crew, Yorki enjoyed the company of Laboon as well. He also got emotional when they were leaving Laboon behind, and would request to sing songs for Laboon to cheer him up."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Fifty-two years ago before the current timeline, as Yorki and his crew were sailing the West Blue, they came across a baby Island Whale that was lost. Seeing that the whale was crying, Brook, a member of Yorki's crew, suggested that they cheer the whale up with some music. Having cheered it up and naming it Laboon, the whale began following Yorki and the rest of the Rumbar Pirates through their adventures."}, {"type": "paragraph", "text": "As Yorki and his crew drew nearer to the Grand Line however, Yorki and some of the other Rumbar Pirates asked Brook to convince Laboon to stay in the West Blue since he was the closest to the whale. This was because they feared that Laboon was too young to face the dangers of the Grand Line. When Brook's attempt to convince Laboon failed, Yorki ordered his crew to ignore Laboon and not play any music in hopes that Laboon would stop following them."}], "images": []}, {"title": "Grand Line", "level": 3, "content": [{"type": "paragraph", "text": "Seemingly having convinced Laboon to stop following them, Yorki and his crew sailed into the Grand Line through Reverse Mountain. Upon arriving at the Grand Line, Yorki and his crew met up with Crocus and asked if they could stay to repair their ship. To their surprise, they found out that Laboon had followed them into the Grand Line. For the next three months, Yorki and his crew stayed to fix their ship whilst singing with Laboon all the while."}, {"type": "paragraph", "text": "Seeing that the Grand Line was just too dangerous for a young whale, Yorki asked Crocus to take care of Laboon while they ventured through the Grand Line. As Yorki and his crew left Laboon in Crocus's care, they promised to return someday in two to three years and take Laboon back with them."}, {"type": "paragraph", "text": "While in the Grand Line, Yorki and his crew experienced all the hardships that the sea had to offer. Along the way, Yorki and his crew fought against a Marine base. For this attack, Yorki's bounty went up. Despite the challenges they encountered, Yorki and his crew sailed onward."}], "images": []}, {"title": "Disease", "level": 3, "content": [{"type": "paragraph", "text": "However, after disembarking at a forest, Yorki and some of the other Rumbar Pirates contracted an incurable disease. In order to save the rest of the crew, Yorki decided to take himself and the other infected members, and escape the Grand Line through the Calm Belt. With much regret, Yorki told the crew that were still well to give his regards to Laboon. As he lay dying, he asked everyone to leave except for Brook, whom he wanted to play his favorite song to send him off."}, {"type": "paragraph", "text": "Yorki's attempt to escape was then written in a report. However, the report misinterpreted Yorki's escape as an act of cowardice rather than show his actual reason. Whether Yorki succeeded in crossing the Calm Belt is unknown."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime, prior to Yorki being properly shown in the manga, he was depicted as a typical tattooless pirate wearing a typical tricorne instead of the cowboy hat. His coat was also colored red instead of green. This depiction of him was due to the unclear image of him during Crocus' flashback then in the manga. The image depicted Yorki shaking hands with Crocus, however the captain's appearance was obscured along with the rest of the crew. The anime, however, changed this after he was fully revealed."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Yorki's nickname resembles that of the real life pirate, Calico Jack.", "elements": []}, {"text": "Yorki's favorite song is Binks' Sake.", "elements": []}, {"text": "Yorki's lethal disease, its symptoms (dark plot on the skin) and the way he contracted it (in a jungle), resembles the Tree Fever. However no links between the two diseases are confirmed.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Calico Jack – Wikipedia article about the real life pirate Calico Yorki is possibly named after.", "elements": []}]}], "images": []}]}