{"sections": [{"title": "Mashikaku", "level": 1, "content": [{"type": "paragraph", "text": "Chief Petty Officer Mashikaku is a subordinate of Smoker and Tashigi. However, it is unknown if he remained with the two after they transferred to G-5 as he is not seen with the G-5 Marines."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mashikaku's facial structure resembles that of a monkey, with bushy brown hair and sideburns, tanned skin, and a square jaw. His signature feature is that his sideburns are curved and pointed inwards towards his face. He wears the standard Marine shirt and cap. In the manga, he wears epaulettes which may serve to differentiate himself in rank as a Chief Petty Officer. In the anime, however, he lacks the epaulettes and so, in terms of uniform, looks no different from a common Marine sailor."}, {"type": "paragraph", "text": "During the Battle of Marineford, he wore a Marine officer's coat over his standard Marine shirt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Mashikaku_as_a_Young_Marine.png/revision/latest?cb=20130913204414", "caption": "Mashikaku in his youth as a Marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mashikaku is somewhat afraid of those with a higher authority than him, as shown when he was afraid of what the higher-ups would say if Smoker disobeyed them, but was also afraid of Smoker when he shouted at him that he did not care."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Mashikaku appears to be somewhat strong as he survived the battle against Whitebeard and his allies."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "During the Battle of Marineford, Mashikaku was seen armed with a large sword behind his back."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Loguetown Arc", "level": 4, "content": [{"type": "paragraph", "text": "While Smoker was stacking rocks and relaxing, Mashikaku barged into the steam room and told Smoker about an emergency involving pirates at the town square. Smoker then gave Mashikaku orders on where each unit should be placed. He then followed Smoker through town and when they encountered Tashigi, Mashikaku handed her her jacket. Later, when Smoker decided to head out into the Grand Line to chase after Luffy, he expressed concern over how the higher-ups would react if Smoker were to abandon his post."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "He later accompanied Smoker to Alabasta. In Nanohana, Smoker wondered what the commotion occurring in the restaurant in front of them was. Mashikaku then came running towards Smoker and Tashigi from that direction and told them that they would never have guessed who showed up in town. Later, after Smoker encountered Luffy in the restaurant, Mashikaku was seen wiping down his sweat as his captain yelled at Tashigi to chase down the pirate."}, {"type": "paragraph", "text": "After Ace helped Luffy escape, Smoker wondered how they would locate the Straw Hats in such a large country. Afterwards, Tashigi and Mashikaku came running back to Smoker, who then asked them where they were. Mashikaku told him that they were at the opposite side of town, to which Tashigi then tells him to shush. When Smoker started to discuss how he was having a bad feeling about a certain Shichibukai in Alabasta, Mashikaku asked him if he was talking about Crocodile."}, {"type": "paragraph", "text": "Later, in Alubarna, the Marines encountered Miss All-Sunday holding Nefertari Cobra hostage. Upon seeing her use her Treinta Fleur, Mashikaku immediately stated that he recognized the woman to be Nico Robin. He then warned his men that she had had a bounty since she was eight. Tashigi then ordered him to take the Marines to the city square to stop the bombing while she dealt with Nico Robin."}, {"type": "paragraph", "text": "After Crocodile was defeated at the hands of Luffy, Mashikaku wanted to capture the Straw Hats after they had all passed out from exhaustion fighting Baroque Works. However, Tashigi forbade him from arresting them."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Mashikaku was seen behind Smoker and Tashigi arriving at Marineford upon the summons to reinforce the headquarters ahead of the execution of Portgas D. Ace."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ed/Smoker_and_Subordinates_Arrive_at_Marineford.png/revision/latest/scale-to-width-down/180?cb=20190103001201", "caption": "Smoker, Tashigi, and Mashikaku arrive at Marineford as shown in the Digitally Colored Manga."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Before the war began, Mashikaku, Smoker, and Tashigi listened on as Sengoku revealed Portgas D. Ace's past to the Marines."}, {"type": "paragraph", "text": "Towards the end of the war, Mashikaku stood alongside Smoker, Tashigi, and Hina after Shanks arrived at Marineford and Sengoku declared the war to be over."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Whereas Mashikaku made his manga debut after the Buggy and Alvida Alliance were causing trouble in the town square, his anime debut was, instead, when he received the new bounty of Monkey D. Luffy and ran to report to Smoker of it. Furthermore, he was not shown with epaulettes in his anime debut."}, {"type": "paragraph", "text": "He was also replaced by a random Marine during Smoker's arrival at Marineford."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name means \"really square\", which is an accurate description of his features.", "elements": []}, {"text": "In Episode 52, the word \"Marine\" on his Marine cap is misspelled \"Marne.\"", "elements": []}, {"text": "For unknown reasons, his English name is Marney the Marine.", "elements": []}, {"text": "A support character in One Piece: Grand Adventure, Navy A, bears a striking resemblence to Mashikaku. Since he is an underling of Tashigi and Navy A is a support, it is possible that they are the same person. Mashikaku wasn't named in the United States at the time of the game's release.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/74/Mashikaku%27s_Marine_Cap_Misspelled.png/revision/latest/scale-to-width-down/140?cb=20160113144541", "caption": "Mashikaku's \"MARINE\" cap misspelled as \"MARNE\" in Episode 52."}]}]}