{"sections": [{"title": "Shine", "level": 1, "content": [{"type": "paragraph", "text": "Shine is a Marine Chief Petty Officer who works under the command of Hina."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Shine is a tall, tan-skinned man with broad shoulders who wears the standard Marine uniform of a white shirt with a blue ascot and a Marine cap. On his uniform, there are epaulettes that he wears on his shoulders to signify his rank. He has an unique, two-pronged, black goatee that ends in a point and also wears sunglasses. On his left arm, there is a tattoo of a ship."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/88/Shine_Youth.png/revision/latest/scale-to-width-down/100?cb=20130812203355", "caption": "Shine in his youth as a Marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shine is very serious about his work as a Marine. However, he breaks his composure when confused or confronted by authority."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Chief Petty Officer, Shine has some authority over lower Marine ranks."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Shine first reported to Hina that Fullbody and Jango have successfully captured an enemy ship after seeing them do a strange dance to impress her. Afterwards, he reported to her that the Alabasta coast had been surrounded, but that the Straw Hat Pirates's ship was not where they thought it would be in Erumalu. Hina asked if they escaped, and Shine nervously defended that their escape was impossible, as they completely blocked the mouth of the Sandora River. Hina ordered him to search for them more thoroughly."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Amazon Lily Arc", "level": 4, "content": [{"type": "paragraph", "text": "Shine was seen arriving with Hina behind Fullbody and Jango at Marineford upon the summons to reinforce the headquarters ahead of the execution of Portgas D. Ace."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 214 (p. 5-6) and Episode 128, Shine reports to Hina about the Straw Hat Pirates.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, His name was revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 54 Chapter 524 (p. 17), Shine stands behind Fullbody and Jango at Marineford.", "elements": []}]}], "images": []}]}