{"sections": [{"title": "Makko", "level": 1, "content": [{"type": "paragraph", "text": "Ensign Makko is a senior member of Hina's death squad who was on one of the ships that attacked the Straw Hat Pirates as they fled Alabasta."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Makko appears to be an average-sized man. He has a shaved head that has a hairline that creates a semicircle at the center of his head. He has been seen sporting this hairstyle since his days as a young Marine. He also has a thick scar on the right side of his forehead that did not exist before he enlisted in the Marines. In addition, he has what appear to be three lines at the bottom of each of his eyes, which may be his eyelashes. He sports a Marine coat and shirt that is standard amongst Marine officers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ab/Makko_Youth.png/revision/latest?cb=20190816085147", "caption": "Makko in his youth as a Marine."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a Marine, Makko has a strong sense of justice, and as such, has no patience for failure. This is shown when he got very angry at his subordinates for failing to make progress against the Straw Hat Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As an Ensign, it appears that Makko has had some fighting experience for him to have been able to obtain his rank. Furthermore, as an Ensign, he has authority over those subordinate to him."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "While the Straw Hats fought off the fleet he was leading, Makko bemoaned the lack of progress his troops had made against the pirates given that it was just one enemy ship. He scolded his subordinates, but was only met with the response that the Straw Hats were too strong and that their cannons were not working."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Makko has only appeared in the manga and has not made a debut in the anime."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 23 Chapter 216, Makko debuts.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Makko's name and rank are revealed.", "elements": []}]}], "images": []}]}