{"sections": [{"title": "Puppu", "level": 1, "content": [{"type": "paragraph", "text": "Puppu is the captain of a pirate crew who attempted to pillage Alabasta."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Puppu is an obese and round man, with a very round face, bulbous nose, a row of rounded teeth, and gray hair sticking unkempt on the sides and on top of his head. His arms and legs are very thin in proportion to his wide frame, and his fingers are very thick and short. All this made Puppu resemble a pig."}, {"type": "paragraph", "text": "He wears a simple white shirt that was untucked from his red pirate sash, blue pants, and simple shoes. Like most pirate captains, he wears a pirate's coat, but he wore the sleeves instead of letting the coat drape over his shoulders like a cape. His coat is brown in color and has five large buttons that resemble pig snouts. He also wears a tricorn with his Jolly Roger on it: a square pig's skull with a snout, rounded teeth, and a leaf on top of its head."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Puppu%27s_Jolly_Roger.png/revision/latest/scale-to-width-down/180?cb=20130226141410", "caption": "Puppu's Jolly Roger."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Puppu is prideful man, believing the Shichibukai to be pirates who sold their souls to the World Government, and are no more than their dogs. This made him believe that he and his crew were above Crocodile, a mistake that made him foolishly challenge the Shichibukai, which led to Puppu and his crew's defeat."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Puppu is more or less an average pirate by strength, as he managed to make it along the Grand Line to Alabasta. Being a common pirate, he stood no chance against the Shichbukai, Crocodile, who easily and swiftly decimated the entire crew."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Puppu was seen carrying a large cutlass, but it is unknown how proficient he is in using it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "Puppu made a mistake in attempting to steal from a port city in Alabasta which was under the direct protection of Crocodile. Puppu insulted Crocodile for being a \"government dog\", and then when the Shichibukai jumped off of the building to greet the crew, Puppu and his crew impaled Crocodile with all of their blades. Thinking that he had won, Puppu's mockery turned to horror when Crocodile created a sandstorm to drain the water content from Puppu and his crew's bodies. Later, Crocodile was seen carrying their bodies, stuffed into a large sack, out of town after the clash."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Puppu and his crew vs. Crocodile", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "His name roughly translates to \"Oink Oink\"."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 155 (p. 2-9) and Episode 92, Puppu and his crew decimated by Crocodile.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 72), Puppu's name is revealed.", "elements": []}]}], "images": []}]}