{"sections": [{"title": "Niphtal", "level": 1, "content": [{"type": "paragraph", "text": "Niphtal is a member of the Simon Pirates. He is the pirate officer, archaeologist, and scientist of the crew."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Niphtal is a short man with fair skin, beady eyes, thick lips, a large chin, and ears with large, round openings. He has short, curly black hair that had a large, upward-pointing curl on top. He wears a light blue jacket with two big pockets, a blue and black big striped scarf around his neck, a gold armband, white gloves, a black belt with two purses clinging at it, and a headband with microscope heads and a microphone on it. He also wears light blue shorts, black leggings, brown shoes, and a golden monocle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4c/Niphtal_Portrait.png/revision/latest?cb=20190102062121", "caption": "A closeup of Niphtal."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Niphtal is very cocky and overconfident in his inventions. He was greatly surprised when Hey beat his subordinates and ever more surprised when the Straw Hat Pirates defeated his robots."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Although Niphtal's abilities seem quite lacking, he lead a team of muscular archaeologists that fight for him with shovels. Even if he is not skilled in fighting, he is a skilled archaeologist and an even more skilled scientist, creating robots strong enough to defeat Hey, the man who defeated his subordinates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c0/Niphtal_and_his_team_of_archaeologists.png/revision/latest/scale-to-width-down/280?cb=20150220004538", "caption": "Niphtal and his team of archaeologists."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Big Secret Treasure of the Seven Phantom Islands", "level": 3, "content": [{"type": "paragraph", "text": "Niphtal and his subordinates invaded a small village that the Straw Hat Pirates had arrived at moments before. Niphtal threatened the citizens, but before he could hurt anyone, Hey and his gang arrived, scaring the pirate. Hey and two of his subordinates defeated Nipthal's subordinates with ease, causing Nipthal to summon his prized robots, Kau Ra Kau and Zau Ra Zau. Kau and Zau swiftly defeated Hey and his gang, leaving the pirate in power. The Straw Hat Pirates decided to fight against him. Niphtal ordered his robots to attack, but Zoro blocked the attack. The Straw Hat Pirates fought Kau and Zau and defeated them, leaving Niphtal scared. However, Simon suddenly appeared, to which Niphtal was glad to see his captain and asked him for help. He then told Simon that the Straw Hats ruined their research, and upon hearing this, Simon became angered. Niphtal was then killed by Simon."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bf/Simon_Kills_Niphtal.png/revision/latest/scale-to-width-down/280?cb=20190102063638", "caption": "Simon kills Niphtal."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Games — Big Secret Treasure of the Seven Phantom Islands, Otsu said that each bounty of Simon Pirates' four officers is 30,000,000 with Sanji, Usopp and Chopper.", "elements": []}]}], "images": []}]}