{"sections": [{"title": "Mousse", "level": 1, "content": [{"type": "paragraph", "text": "Mousse was the daughter of Kalgara and Herb and was considered the most beautiful of the Shandia women on the island of Jaya four hundred years ago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mousse is a normal sized woman with pale skin. She has black hair, braided in the back with two strands in the front. She has black eyes, and like other Shandia she has small white wings on her back. She wears a green tunic with orange and purple stripes near the neck, and the the bottom, where it stopped near her thighs, and white fringe on the sleeves. She also wore brown sandals, and a plaid purple and white hat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mousse did not share her father's hot blooded attitude and was very considerate of the well being of others. She went to the altar to protect her people, feeling comfort in knowing she would be joining their god. However upon sighting what they believed to be their god, she became very frightened, even freezing when Noland told her to run from the altar. His actions to save her life, and later talk between her and his men, made her become one of the first Shandia to believe Noland was a good man. She was also the only one wise enough to actually go and tell Noland's men why they were being shunned by the villagers, and in return rushed to tell her father their grave error of judgment towards Noland."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "After their dying priest had a 'vision', he declared that the only way to stop the \"curse\" that was plaguing their land was to sacrifice their most beautiful woman. Mousse went willingly to the altar to save all her people. Just before their God devoured her, Mont Blanc Noland appeared and killed the giant snake before trying to convince the Shandia that this plague was curable and not a divine curse."}, {"type": "paragraph", "text": "During the time Noland spent trying to find the cure, both her and his men were locked up in cages, in which she spoke to the men on who their captain was. After a struggle against time, Noland brought the cure back and the Shandia were saved. Mousse, now free and knowing the truth, was seen later sobbing in her father's arms over the events that had happened."}, {"type": "paragraph", "text": "After the people of Shandia were cured, Mousse is seen dancing with Noland and his crew and Kalgara even jokingly tells him to marry Mousse so he would stay on the island."}, {"type": "paragraph", "text": "However, her tribe found that their forest which they found sacred has been chopped down by Noland and his men, and they were once again ostracized by the tribe. She later explained to one of Noland's crew as to why the Shandia are treating him this way, and after she learned they cleared the forest because it originated the plague in the village, she quickly rushed to tell the villagers, and they rang the golden bell as hard as they could to inform Noland of their regret, and her father Kalgara rushed towards Noland before he and his men set sail to ask for his forgiveness."}, {"type": "paragraph", "text": "Years later, by the time the Knock Up Stream launched part of the island up into Skypeia, Mousse was married to Seto."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name means \"lather\" or \"foam\" and can refer to a French dessert. This goes with her family friend Noland's surname \"Mont Blanc\", which means 'white mountain', and can refer to another French dessert.", "elements": []}]}], "images": []}]}