{"sections": [{"title": "Macro", "level": 1, "content": [{"type": "paragraph", "text": "Macro is a Fish-Man pirate and the captain of the Macro Pirates. He first appeared in Hatchan's Sea-Floor Stroll cover story. He was also a member of the Sun Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Macro is a fish-man whose fish half is a fish called a macropharynx, a Japanese scientific name for gulper eels. His fish half is specifically the gulper eel classified as pelican eel. Macro has two large Popeye-like forearms complete with anchor tattoos. He generally wears a necklace of jewels and an open jacket. On his chest is the sun tattoo that symbolizes Macro's being once a part of the Sun Pirates. Macro is roughly larger than Hatchan in size. Macro's most distinguishing physical characteristic is his large lower lip and jaw. When he closes his mouth, his lower lip sticks out so prominently that Macro looks like he's always sticking his face up. When he opens his mouth, his lower jaw opens up so wide that the opening his mouth makes is extremely large in comparison to his head. Within his mouth, his upper jaw consists of molars while his lower jaw consists of fangs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d2/Macro_Sun_Pirates_Portrait.png/revision/latest/scale-to-width-down/180?cb=20190805170312", "caption": "Macro as a member of the Sun Pirates."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Compared to his crewmates, Macro is considered the \"brain\" of the crew. He has a distinct laugh, being \"Mohahahaha\". Even though Macro was part of the crew of Fisher Tiger, the fish-man who fought against slavery, Macro as well as his two companions do not have any qualms selling other fish-men and merfolk to slavery."}, {"type": "paragraph", "text": "However, he wasn't always so cruel. While he was with the Sun Pirates, he had a soft side to him as shown when he got attached to the former slave, Koala, and he greatly missed her when she returned to her homeland."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a fish-man, Macro possesses the abilities unique to his race. He is able to breath underwater and is several times stronger than the average human. However when matched up against the likes of Hatchan, he is relatively weak."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He appears to have some skills with guns, as he was seen fighting with two flintlocks against Marines."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "With the Sun Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Macro grew up as an orphan in the Fish-Man District before it became corrupt. He was considered the mean person of his fish-men comrades when and before he was with the Sun Pirates."}, {"type": "paragraph", "text": "Unlike the preachings of his captain, Macro, like Arlong, had no qualms at attacking or even killing humans as part of the crew of Fisher Tiger. Ironically, he seemed attached to the young human, Koala. He yelled at Arlong for his harassment of her and cried as his captain took Koala to her village, asking her to stay and sail with them saying that she's a good girl even if she's a human."}, {"type": "paragraph", "text": "After Koala returned to her family, the Sun Pirates were ambushed by the Marines. They lost their ship and Tiger was badly wounded during the battle. Tiger soon died from his wounds and Arlong was later captured. Macro was then under the command of Jinbe."}, {"type": "paragraph", "text": "After Jinbe's acceptance into the Shichibukai and Arlong's release, Macro, Gyaro, and Tansui left the Sun Pirates and became their own crew."}], "images": []}, {"title": "Hatchan's Sea-Floor Stroll", "level": 3, "content": [{"type": "paragraph", "text": "While going out for walk on the sea floor with his men, Macro met up with his old friend, Hatchan. Seeing that a mermaid was with him, Macro decided to trade a treasure map with Hatchan for the mermaid, Camie. Macro's offer was happily accepted as Macro explained to Hatchan that it would lead the octopus fish-man to the long sought after legendary Takoyaki sauce. While the map Macro gave him was legitimate, Macro's real intention for Camie was to sell her off as a slave."}, {"type": "paragraph", "text": "Having acquired the mermaid, Macro and his gang decided to sell her off. They unfortunately did not get very far when Hatchan suddenly attacked their ship and beat them up. Hatchan apparently came back to beat them because he thought that he was cheated upon by them. The map that they gave him appeared to be a fake: it lead him to a giant squid instead of the sauce he sought after. Macro however explained as he was beat up that they did not cheat him. While the map did lead to a giant squid, the legendary sauce was inside the giant squid. With that, Macro and his gang were spared from further injury. Unfortunately, their prized mermaid slave was freed in the midst of Hatchan's attack and decided to follow him."}, {"type": "paragraph", "text": "Having lost their prize, Macro and his gang decided to try to get Camie back in their clutches and get their revenge against Hatchan."}], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [], "images": []}, {"title": "Alliance with the Flying Fish Riders", "level": 4, "content": [{"type": "paragraph", "text": "Since their initial defeat at the hands of Hatchan, Macro and his crew had been trying to recapture Camie. They would succeed at capturing her at every attempt but every time they would also be foiled by Hatchan, who had since befriended Camie and would beat them up. Macro and his crew continued with these scenario until after the thirtieth time, they decided to get some help."}, {"type": "paragraph", "text": "Macro and his crew decided to ally themselves with the Flying Fish Riders. With kidnapping gang's help, they were able to beat up and capture Hatchan. With him in their clutches, Macro not only planned to capture Camie when she came to rescue him at the Flying Fish Riders' base, but also planned to sell off his former crewmate as a slave since octopus fish-men fetched a high price in the slave market. After letting Camie knew what had happened to her friend via Den Den Mushi, Macro and his crew found out that she was bringing along with her to base the Straw Hat Pirates. Amongst the Straw Hats was someone that Macro and his crew's new-found ally, Duval, was looking for. Upon telling Duval of the new turn of the events, he thanked them for their great contribution despite the disrespect Macro's men showed to him."}, {"type": "paragraph", "text": "With a plan to ambush the Straw Hats and Camie alongside the Flying Fish Riders, Macro and his crew hid deep underwater below the base. Sure enough, their plan to capture Camie once again work as she dove into their clutches in an attempt to save an imprisoned Hatchan. Unfortunately, she was once again rescued as Luffy grabbed her out of their hands. In the midst of the battle between the Straw Hats and the Flying Fish Riders that soon followed, Macro and his crew were once again defeated by Hatchan who was freed by the Straw Hats then. With a punch from one of Hatchan's hands, Macro was sent flying away from the base alongside his men, who themselves were also each punched away at the same time by one of Hatchan's other hands."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sun Pirates vs. Marines (numerous times at sea)", "elements": []}, {"text": "Sun Pirates vs. Marines (Foolshout Island)", "elements": []}, {"text": "Macro Pirates vs. Hatchan (several times)", "elements": []}, {"text": "Macro Pirates and Flying Fish Riders vs. Hatchan and Straw Hat Pirates", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Saccopharyngiformes — Wikipedia article about the group of fish that Macro comes from.", "elements": []}, {"text": "Pelican eel — Wikipedia article about the type of fish that Macro is.", "elements": []}]}], "images": []}]}