{"sections": [{"title": "Gyaro", "level": 1, "content": [{"type": "paragraph", "text": "Gyaro is a member of the Macro Pirates. He is a pop-eyed goldfish fish-man. He was also once a member of the Sun Pirates, before its disbandment."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As a pop-eyed goldfish fish-man, Gyaro has beige skin and black hair in ponytail. He has incredibly large eye sockets but incredibly small eyes. He has a long jaw with large lips and a small mouth. He wears a normal t-shirt and pants. He has his Sun Pirates tattoo on his left and right bicep."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Gyaro_Sun_Pirates_Portrait.png/revision/latest/scale-to-width-down/180?cb=20190805170623", "caption": "Gyaro as a member of the Sun Pirates."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Unlike Macro, Gyaro does not appear to be very bright. Also, unlike most other fish-men seen in the series, he and the rest of the Macro Pirates have no qualms selling other fish-men and merfolk to slavery."}, {"type": "paragraph", "text": "Like many characters in One Piece he has a distinct laugh: \"Ehehehe\"."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a fish-man he is ten times stronger than a human on dry land and twice that underwater. He can be considered rather weak as Hatchan defeated him as well as the other two Macro pirates easily."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Gyaro is a swordsman, he uses a regular katana and a fighting style named Goldfish Fencing (金魚剣術 Kingyo Kenjutsu)."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Gyaro was seen amongst the Sun Pirates. During their time roaming the seas, the Sun Pirates battled Marines numerous times. One day a former human slave named Koala boarded their ship to return to her home in Foolshout Island. During her time with the Sun Pirates, Gyaro, Macro, and Tansui got attached to the girl. When she finally returned to her home, the three fish-men emotionally cried during her farewell. After Koala returned to her family, the Sun Pirates were ambushed by the Marines. They lost their ship and Tiger was badly wounded during the battle. Tiger soon died from his wounds and Arlong was later captured. Gyaro was then under the command of Jinbe. After Jinbe's acceptance into the Shichibukai and Arlong's release, Macro, Gyaro, and Tansui left the Sun Pirates and became their own crew."}], "images": []}, {"title": "Hatchan's Sea-Floor Stroll", "level": 3, "content": [{"type": "paragraph", "text": "While going out for walk on the sea floor with his men, Gyaro and the crew met up with Hatchan. Seeing that a mermaid was with him, the Macro Pirates decided to trade a treasure map with Hatchan for the mermaid, Camie. The offer was happily accepted as Macro explained to Hatchan that it would lead the octopus fish-man to the long sought after legendary Takoyaki sauce. While the map Macro gave was legit, the crew's real intention for Camie was to sell her off as a slave."}, {"type": "paragraph", "text": "Having acquired the mermaid, the gang decided to sell her off. They unfortunately did not get very far when Hatchan suddenly attacked their ship and beat them up. Hatchan apparently came back to beat them because he thought that he was cheated upon by them. The map that they gave him appeared to be a fake to Hatchan since it lead him to a giant squid instead of the sauce he sought after. Macro however explained as he was beat up that they did not cheat him. While the map did lead to a giant squid, it did indeed lead to the sauce as the sauce was inside the giant squid. With that, the gang were spared from further injury. Unfortunately, their prized mermaid slave was freed in the midst of Hatchan's attack and decided to follow him."}, {"type": "paragraph", "text": "Having lost their prize, Gyaro and the other Macro Pirates decided to try to get Camie back in their clutches and get their revenge against Hatchan."}], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [], "images": []}, {"title": "Alliance with the Flying Fish Riders", "level": 4, "content": [{"type": "paragraph", "text": "Since their initial defeat at the hands of Hatchan, the crew had been trying to recapture Camie. They would succeed at capturing her at every attempt but every time they would also be foiled by Hatchan, who had since befriended Camie and would beat them up. Gyaro and the crew continued with these scenario until after the thirtieth time, they decided to get some help."}, {"type": "paragraph", "text": "The crew decided to ally themselves with the Flying Fish Riders. With kidnapping gang's help, they were able to beat up and capture Hatchan. With him in their clutches, the Macro Pirates not only planned to capture Camie when she came to rescue him at the Flying Fish Riders' base, but also planned to sell off his former crewmate as a slave since octopus fish-men fetched a high price in the slave market. After letting Camie knew what had happened to her friend via Den Den Mushi, Gyaro and the crew found out that she was bringing along with her to base the Straw Hat Pirates. Amongst the Straw Hats was someone that the Macro Pirates' new-found ally, Duval, was looking for. Upon telling Duval of the new turn of the events, he thanked them for their great contribution despite the disrespect Gyaro showed to him."}, {"type": "paragraph", "text": "With a plan to ambush the Straw Hats and Camie alongside the Flying Fish Riders, the Macro Pirates hid deep underwater below the base. Sure enough, their plan to capture Camie once again work as she dove into their clutches in an attempt to save an imprisoned Hatchan. Unfortunately, she was once again rescued as Luffy grabbed her out of their hands. In the midst of the battle between the Straw Hats and the Flying Fish Riders that soon followed, Gyaro and the crew were once again defeated by Hatchan, who punched the Macro Pirates, sending them flying away from the base."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 22 Chapter 197, cover story: Hatchan's Sea-Floor Stroll Vol. 14, Macro Pirates are introduced.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 63 Chapters 621–624 and Episodes 540–544, Gyaro's tenure in the Sun Pirates", "elements": []}, {"text": "↑  One Piece Manga — Vol. 51 Chapter 492, Gyaro's laughter is revealed.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Telescope eye – Wikipedia article about the type of fish Gyaro is.", "elements": []}]}], "images": []}]}