{"sections": [{"title": "Tansui", "level": 1, "content": [{"type": "paragraph", "text": "Tansui is a member of the Macro Pirates and a former member of the Sun Pirates. He is an arowana fish-man."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "As an arowana fish-man, Tansui has a very wide build. He has very pale pink skin and a large lower jaw. He has scales on the back of his head. He wears necklaces, a green fur cloak, a pair of swim briefs, and belt, which has written the word \"Alowana\" on it. As a former member of the Sun Pirates, he use to wear an striped and afterwards striped cloak."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Tansui_Sun_Pirates_Portrait.png/revision/latest/scale-to-width-down/180?cb=20180801045505", "caption": "Tansui as a Sun Pirate."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "His talk is very open-minded, to the ire of Macro, and even to Duval himself. Unlike most other fish-men seen in the series, Tansui and the other Macro Pirates have no qualms selling other fish-men and merfolk to slavery."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a fish-man he is ten times stronger than a human and twice that underwater. He can be considered rather weak as Hatchan defeated him as well as the other two Macro pirates easily."}], "images": []}, {"title": "Fish-Man Karate", "level": 3, "content": [{"type": "paragraph", "text": "He is apparently able to use Fish-Man Karate, much like Kuroobi and Capote; although his skills are never seen as he is beaten before he can use them."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was also seen wielding a dagger during the time when the Sun Pirates attacked the Marine ship."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Tansui was seen amongst the Sun Pirates. During their time roaming the seas, the Sun Pirates battled Marines numerous times. One day a former human slave named Koala boarded their ship to return to her home in Foolshout Island. During her time with the Sun Pirates, Tansui, Gyaro, and Macro got attached to the girl. When she finally returned to her home, the three fish-men emotionally cried during her farewell. After Koala returned to her family, the Sun Pirates were ambushed by the Marines. They lost their ship and Tiger was badly wounded during the battle. Tiger soon died from his wounds and Arlong was later captured. Tansui was then under the command of Jinbe. After Jinbe's acceptance into the Shichibukai and Arlong's release, Macro, Gyaro, and Tansui left the Sun Pirates and became their own crew."}], "images": []}, {"title": "Hatchan's Sea-Floor Stroll", "level": 3, "content": [{"type": "paragraph", "text": "Tansui accompanied his crew in capturing Camie and Pappag many times, and they gave Hatchan a treasure map in exchange for the Camie. However, due to Hatchan thinking the map was a fake, he returned to trash the crew's ship and rescue Camie, resulting in the crew holding a grudge against the octopus fish-man."}], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "After teaming up with the Flying Fish Riders, Tansui and his crew managed to capture Hatchan, but when the Straw Hat Pirates arrived to rescue Hatchan, he sent Tansui and the other two flying with one punch each."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 22 Chapter 197, cover story: Hatchan's Sea-Floor Stroll Vol. 14, Macro Pirates are introduced.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 63 Chapters 621–624 and Episodes 540–544, Tansui's tenure in the Sun Pirates", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Arowana – Wikipedia article about the type of fish Tansui is", "elements": []}]}], "images": []}]}