{"sections": [{"title": "Plesiosaur", "level": 1, "content": [{"type": "paragraph", "text": "The Plesiosaur was a powerful sea monster under Ganzack's command."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The Plesiosaur was built similarly to its real-life counterpart, with a humped body, four flippers, and a long, flexible neck; its jaws alone were large enough to swallow a human being whole."}, {"type": "paragraph", "text": "Its sole accessory was a plated kabuto helmet, emblazoned with the Ganzack Pirates' Jolly Roger and adorned with crab claws."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "While highly aggressive and savage, the Plesiosaur was also intelligent enough to understand and obey Ganzack's orders, and carry persons of interest (such as Nami) to him unharmed. It was also able to recognize and cringe in fear at dynamite."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "The Plesiosaur was a powerful swimmer, large enough to shatter small boats simply by breaching and strong enough to tow Ganzack's personal warship without visible strain. Its neck is also maneuverable enough for it to snap enemies out of midair with its sharp teeth, though its jaw muscles are not quite strong enough to hold down Monkey D. Luffy."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "It is unknown when (or how) Ganzack found and tamed the Plesiosaur, though it was presumably before or contemporaneous with the Ganzack Pirates' conquest of Medaka's homeland."}, {"type": "paragraph", "text": "After the conquest, the Plesiosaur mainly dwelt in a cave beneath the island, though Ganzack would periodically have it patrol the surrounding waters (and, presumably, forage for food). On one of these rounds, it encountered the starving Straw Hat Pirates, smashing their boat in the process. In turn, it was immediately attacked by Monkey D. Luffy and Roronoa Zoro, but easily shook them into the sea while taking Nami to Ganzack."}, {"type": "paragraph", "text": "In time, Nami talked her way into Ganzack's confidence, while Luffy and Zoro independently found their way to Medaka's village and agreed (on promises of food) to help fight the Ganzack Pirates. In response to the latter, Ganzack mobilized the Plesiosaur and tried to intimidate Luffy into surrendering; this failed, as did the Plesiosaur's subsequent attempt to eat Luffy, though Ganzack ultimately captured the rubber pirate by himself."}, {"type": "paragraph", "text": "Later, in response to the Straw Hats joining forces with the rebellious islanders, Ganzack ordered the Plesiosaur to tow out his main cannon and warship so he could bombard the island from afar. Though alarmed, the islanders - and Nami - retaliated by setting a small fireship of dynamite on the Plesiosaur, sending both it and the warship to the bottom of the sea."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The name \"Plesiosaur\" (首長竜, Kubinagaryū) was never used in the OVA itself; rather, it is derived from a notation on one of Eiichiro Oda's sketches in Volume 5, which may or may not be the creature's \"official\" name.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Plesiosaur – Wikipedia article about the real life animal.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece OVA — Defeat Him! The Pirate Ganzack, Ganzack unleashes the Plesiosaur upon the Straw Hat Pirates.", "elements": []}]}], "images": []}]}