{"sections": [{"title": "Tamachibi", "level": 1, "content": [{"type": "paragraph", "text": "Tamachibi is a child whom Dr. Kureha healed while she was in Cocoa Weed. He lives with his father, who is the owner of Stool, a restaurant in town."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tamachibi is a short boy with tan skin. He has brown slightly unkempt hair and big black eyes. He wears a white jacket with blue fur collar and cuffs. He also wears a pair of army green pants and a pair of brown boots."}, {"type": "paragraph", "text": "In the anime, he wears a gold coat, with white fur lining around the collar and on the cuffs."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As Tamachibi is a young child, he was unable to control his pain even when his father and the restaurants customers told him to stop crying. However, he is shown to be a thankful child as he was grateful to Kureha once she healed him."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Father", "level": 3, "content": [{"type": "paragraph", "text": "Tamachibi seems to have a good relationship with his father, as his father was willing to hand over fifty percent of his restaurant's assets after Kureha healed him."}], "images": []}, {"title": "Kureha", "level": 3, "content": [{"type": "paragraph", "text": "Tamachibi was really grateful to Kureha after she treated him and relieved him of his pain."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Drum Island Arc", "level": 3, "content": [{"type": "paragraph", "text": "While his father was busy tending to his restaurant's customers, Tamachibi was wailing excessively, which led to the customers complaining to his father about the noise. His father tried to ask him what was wrong, but Tamachibi could not respond due to the pain and only continued crying, causing his father to threaten to put him outside. Meanwhile, Dr. Kureha was passing by the restaurant and heard what Tamachibi's father had said. She then busted down the restaurant's door and decided to treat Tamachibi."}, {"type": "paragraph", "text": "Tamachibi was then laid down on a table where he explained that his hands were hurting, to which Kureha then pressed his legs, causing Tamachibi to wail in pain. Kureha then explained that, even though she only pressed lightly, it appeared that his limbs were infected and that he had a case of pyogenic inflammation of the bone. To the horror of his father, Tamachibi was then knocked unconscious by Chopper in lieu of anesthetics. After the surgery, Kureha made an unreasonable demand of fifty percent of the restaurant's assets, to which the restaurant's customers complained. However, Tamachibi then woke up and said that he felt much better, thanking Kureha for helping relieve his pain. Hearing this, his father decided to pay Kureha what she demanded."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/30/Tamachibi_Knocked_Unconscious.png/revision/latest/scale-to-width-down/180?cb=20190602044744", "caption": "Chopper knocks Tamachibi out."}]}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Tamachibi's color scheme in the anime is different from that of the manga, as shown in the Digitally Colored Manga, and then confirmed in the Vivre Card - One Piece Visual Dictionary."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 15 Chapter 134 and Episode 81, Tamachibi makes his debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 70), His father's restaurant is confirmed to be named \"Stool.\")", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #161), Information about Tamachibi is revealed.", "elements": []}]}], "images": []}]}