{"sections": [{"title": "Koze and Packy", "level": 1, "content": [{"type": "paragraph", "text": "Koze and Packy were members of the Yes Pirates."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Koze is the thin and tall man with short purple hair, a wide mouth and his tongue sticking out. He wore an A-shirt with various colored fruit-patterns on it, light-colored pants with a pirate sash, a gauntlet on his right forearm, and normal shoes."}, {"type": "paragraph", "text": "Packy is the bulky and muscular man with brown hair tied in braided pigtails. He wore a sleeveless brown shirt with blue pattern on the edges, light colored pants with a pirate sash, and normal shoes."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "Koze and Packy are very cocky and unintelligent, as they tried to defeat Tashigi and avenge their captain, Billy, and were easily defeated. They also had dreams of entering the Grand Line."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Both Koze and Packy are swordsmen, but their skills seem to be below average, as Tashigi easily defeated them."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Before becoming a pirate, Packy came from Loguetown. It is unknown which island Koze came from, but he is from the East Blue."}], "images": []}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "They tried to get their revenge on Tashigi for their captain being captured by Smoker, ruining their dreams of entering the Grand Line. Tashigi managed to beat them very easily and their fate afterward is unknown."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 11 Chapter 96 and Episode 48, Koze and Packy debut.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Koze and Packy's birthdays are revealed.", "elements": []}]}], "images": []}]}