{"sections": [{"title": "Anjo", "level": 1, "content": [{"type": "paragraph", "text": "Anjo is a pirate admirer. He witnessed Gol D. Roger's execution. He has a tattoo of a plain Jolly Roger on his right arm."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Anjo is an average looking man, with slicked back green hair, and a ponytail. He has a scar on the left side of his forehead, and a jolly roger tattoo on his right arm. He also wears a black shirt, which is light red in the anime."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Anjo is an avid fan of pirates, having a jolly roger tattooed on his arm and going as far as to witness Roger's execution in Loguetown. This can also be seen when he cheers as Roger tells the world about One Piece."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Anjo was present at Gol D. Roger's execution. He cheered when Roger announced that his treasure was somewhere in the Grand Line."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the anime, he only appeared in the first opening, We Are, and in the special, Episode of Luffy.", "elements": [{"text": "However, he did make an appearance in Episode 400, although with a different color scheme and without a tattoo.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 1 Chapter 1.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Anjo's name is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Anjo is said to be a pirate admirer.", "elements": []}, {"text": "↑  One Piece Anime — Episode 400, Anjo appears, but with a different color scheme and no tattoo.", "elements": []}]}], "images": []}]}