{"sections": [{"title": "Gyoru", "level": 1, "content": [{"type": "paragraph", "text": "Gyoru is a fishmonger in Foosha Village and the husband of Chicken. Luffy bought fish from him when he was a kid."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He is an average sized man with black hair, a rounded widows peak, and two hairs sticking out on the top of his head. He has pointy eyebrows, round eyes, and stubble on his chin. He wears a light beige shirt (yellow in the digital colored manga), with a green apron over it. He also wears a pink rope tied around his head."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/28/Gyoru_Digital_Colored_Manga.png/revision/latest/scale-to-width-down/200?cb=20130620051853", "caption": "Gyoru in the digital colored manga."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is kind, as he was nice to Luffy and supported him in his dream of becoming a pirate."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Chicken", "level": 3, "content": [{"type": "paragraph", "text": "Chicken is Gyoru's wife. They both run their fish shop together."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Luffy was still a kid and living at Foosha Village, he went to Gyoru and Chicken's fish shop to buy some fish. While Luffy was buying fish, Gyoru commented on how the kid was in such a good mood and then asked him if the Red Hair Pirates had left him behind again while they went on their journey. Then Gyoru mentioned how Luffy couldn't swim anymore, to which Luffy responded happily that he was enjoying the other effects of the Gomu Gomu no Mi."}], "images": []}, {"title": "Romance Dawn Arc", "level": 3, "content": [{"type": "paragraph", "text": "Ten years later, when Luffy had grown old enough to set sail, Gyoru laughed about how he had never expected Luffy to be serious about becoming a pirate. He then watched as Luffy took off on his journey."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "Loguetown Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Luffy obtained his first bounty, Gyoru was seen staring at his bounty poster and sharing the news with a fellow villager. He commented on how it would be great for a famous pirate to come from their village, only for Mayor Woop Slap to scold them about there being nothing great about that."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 1 Chapter 1, Gyoru debuts in the manga.", "elements": []}, {"text": "↑  One Piece Anime — Episode 45, Gyoru debuts in the anime.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Gyoru's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 1 and Episode 505, Gyoru sees Luffy off on his journey.", "elements": []}, {"text": "↑  One Piece Anime — Episode 45, Woop Slap is happy at Luffy's first bounty.", "elements": []}]}], "images": []}]}