{"sections": [{"title": "Pinky", "level": 1, "content": [{"type": "paragraph", "text": "Monstrous Bird Pinky is a giant bird that appeared in the Orange Town Arc. He is classified as a Type C creature, \"Big Savage\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Pinky is a large, pink bird with a downward-curved, beige beak. He has dark blue feathering on the edge of his wings and tail and on the top of his head. The feathers on the top of his head stick up in the anime. In the manga, he lacks the upward-pointing feathers and is one solid color."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e4/Pinky_Full_Body.png/revision/latest/scale-to-width-down/180?cb=20150320173309", "caption": "A full body view of Pinky."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Pinky's personality, but he seems fairly intelligent, defending himself against Luffy and dropping him before being hit by cannon fire."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Pinky is quite strong, as he is able to carry Luffy in his beak with ease."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Orange Town Arc", "level": 3, "content": [{"type": "paragraph", "text": "At the beginning of the arc, Luffy tried to capture Pinky to eat after being on the row boat without food for a few days. However, instead of Luffy catching the bird, he himself was caught instead and carried away. This caused Zoro to chase after Luffy and Pinky. Pinky was later shot at by Buggy around Orange Town, and he dropped Luffy there. He was not hit by the cannon fire, as it dropped the pirate before the cannonball's impact."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "A possible reference to Pinky is made in Chapter 823, as Igaram worries a \"monstrous bird\" might fly by and kidnap Vivi if she stands in the crow's nest of their ship.", "elements": []}, {"text": "The way Pinky caught Luffy and held him at his head with his beak while flying resembles a scene in Romance Dawn, Version 2, where another large bird, called Balloon, caught Luffy in a similar manner.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 1 Chapter 8 and Episode 4, Pinky catches Luffy and caries him to Orange Town.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Pinky's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 37), character entry for Monstrous Bird Pinky.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 88-89), classification of animals by dangerousness.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 82 Chapter 823 (p. 3), Igaram mentions a monstrous bird kidnapping as one of his worst-case scenarios.", "elements": []}]}], "images": []}]}