{"sections": [{"title": "Poro", "level": 1, "content": [{"type": "paragraph", "text": "Poro is a bookstore owner from Orange Town."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Poro is an elderly man with a wrinkled face. The top of his head is bald, while the sides have short white hair. He has thick eyebrows and a Fu Manchu-style mustache, which are also white. He wears a short-sleeved maroon dress shirt, grey shorts, and maroon shoes. In the anime, his hair is grey, his eyebrows and mustache are dark brown, his shirt is tan, and his shorts and shoes are brown."}, {"type": "paragraph", "text": "After the timeskip, his appearance is mostly the same. His mustache appears to be shorter, no longer going past his mouth, and he now wears a black dress shirt and sandals."}, {"type": "paragraph", "text": "42 years ago, his appearance was similar, although he was noticeably younger. He had no wrinkles, all of his hair was black, and he had hair on the top of his head. He wore a green T-shirt which said “HENKUTSU” on the front, grey pants, and black shoes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Poro is a serious and forthright man. He is able to take control of stressful situations, such as when he was able to calm down the anxious townspeople while the mayor was absent. He understands how Boodle thinks and trusts in him deeply. However, unlike Boodle, he does not necessarily treasure Orange Town itself. He believes that everyone surviving is the most important thing and that even if the town were to be destroyed, they can always rebuild it."}, {"type": "paragraph", "text": "Despite his strict demeanor, when the townspeople insisted on going into town, he gave in and smiled, seemingly respecting their words."}, {"type": "paragraph", "text": "Poro appears to have a habit of calling people fools/idiots."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Poro left the town that he was originally from with a group of refugees after it was destroyed by pirates."}, {"type": "paragraph", "text": "42 years ago, Poro and this group - led by their mayor, Boodle - arrived on the Organ Islands and decided to build a new town there, which eventually became a thriving port called Orange Town."}, {"type": "paragraph", "text": "At some point less than three months before the Straw Hat Pirates arrived in Orange Town, the Buggy Pirates appeared in the town and occupied it, forcing Poro and the other townspeople to evacuate to a nearby shelter outside of the town."}], "images": []}, {"title": "East Blue Saga", "level": 3, "content": [], "images": []}, {"title": "Orange Town Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the day that the Straw Hat Pirates arrived in Orange Town, Boodle went into town to feed Chouchou and Poro warned him to not take any risks, telling him that safety was the most important thing."}, {"type": "paragraph", "text": "Chouchou later showed up at the shelter injured and alone, causing Poro to question why Boodle had not returned yet. When the other townspeople began to become concerned, Poro relieved their anxieties by telling them that Boodle is too clever and knows the town too well to get captured. However, Poro worried that Boodle ignored his warnings because of how deeply he cares about the town."}, {"type": "paragraph", "text": "After a while, the townspeople became anxious again and Poro got irritated because Boodle was worrying all of them. He then volunteered to go into town to look for Boodle and told everyone else to wait at the shelter, but they all insisted on going with him. Poro argued that the Buggy Pirates were too dangerous, however the townspeople told him that they would not be able to call themselves citizens of Orange Town if they do not protect their mayor and that they were choosing to go of their own free will. Poro then smiled and sighed and told them to do whatever they want."}, {"type": "paragraph", "text": "The townspeople then went to Orange Town where they came across the Straw Hat Pirates and an unconscious Boodle. They initially accused the Buggy Pirates of attacking Boodle, but Luffy admitted that he was the one who did it. This angered the townspeople and they asked the Straw Hats to identify themselves. Luffy tells them that they are pirates, which causes the townspeople to attack the Straw Hats, who then ran away. Poro stayed behind with the unconscious mayor and angrily watched as the townspeople chased after the pirates."}, {"type": "paragraph", "text": "Unsuccessful, the townspeople returned to Poro and Boodle. Boodle then regained consciousness and Poro and the others told the mayor what they knew and attempted to ask him what happened, but he berated them for insulting the Straw Hats and ran off as the townspeople shouted at him."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Poro is seen standing next to Boodle and Chouchou at the grand opening of the new pet food store, smiling after learning the news about the Straw Hat Pirates."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "The anime does not include the scene of Chouchou going to the shelter, therefore the scene of Poro discussing how he warned Boodle to be safe is also not included. As such, Poro's introductions in the manga and anime are different."}, {"type": "paragraph", "text": "In the manga, the flashback of Orange Town being constructed shows younger versions of Boodle, Hocker, and Poro. However, none of them appear in the anime and instead the entire flashback just shows unnamed characters."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 2 Chapter 14 (p. 4-5), Poro debuts.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 19 (p. 5-6) and Episode 8, the townspeople decide to fight.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 41), Poro's name and occupation are revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0054 (Ex East Blue Saga Vol. 2)), Poro's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 619, cover story: From the Decks of the World Vol. 6, Poro is seen after the timeskip.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 2 Chapter 14 (p. 8-9), Boodle reveals Orange Town's history.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 2 Chapter 12 (p. 13) and Episode 6, Boodle reveals that Hocker died three months ago.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 2 Chapter 9 (p. 8) and Episode 5, Nami reveals that the townspeople evacuated.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 21 and Episode 8, the townspeople encounter the Straw Hats.", "elements": []}]}], "images": []}]}