{"sections": [{"title": "Mornin", "level": 1, "content": [{"type": "paragraph", "text": "Mornin is the mayor of Syrup Village. Whenever he hears Usopp's antics, he knows it is time to go to work."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mornin is an old man who is bald on the top with gray hair on the sides and back of his head. He has a curved pointed nose and a gray mustache. He also wears a collared shirt and round-shaped glasses."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Unlike many of his fellow villagers, he was not very annoyed by Usopp's lies. In fact, he used it as a sign to get ready for the day."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a mayor, it can be assumed that Mornin has some influence over village matters and is proficient at running a town."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Some time in the past, Mornin became the mayor of Syrup Village. Ever since Usopp began routinely yelling about pirates attacking, Mornin has used this as a sign to signal that it was time to get to work."}], "images": []}, {"title": "Syrup Village Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Usopp came running into town screaming about pirates attacking, Mornin had just finished eating breakfast. Upon hearing the troublemaker run past his house yelling, Mornin calmly continued to drink his coffee and commented on how it was time for him to get to work since Usopp was already up."}, {"type": "paragraph", "text": "The next day, Mornin's wife told him that he would be late for work, surprising him since Usopp had not come running into town yet."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "During the Syrup Village Arc of the anime, Mornin was not seen. It was only until the Episode of East Blue that Mornin was finally seen in the anime."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 3 Chapter 23, Mornin makes his first appearance.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Mornin's birthday is given.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Mornin's name and position is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 5 Chapter 40, Mornin is late for work.", "elements": []}]}], "images": []}]}