{"sections": [{"title": "Mr. Beans", "level": 1, "content": [{"type": "paragraph", "text": "Mr. Beans was a Baroque Works Millions agent stationed at Whisky Peak alongside his partner, Miss Catherina. He worked under the Frontier Agents Mr. 8, Miss Monday, Mr. 9 and Miss Wednesday."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Beans is a small boy with short blonde hair. He wears light green shorts, brown shoes, and a white short sleeve shirt with a \"Wanted\" picture of Pandaman."}, {"type": "paragraph", "text": "In the anime, he has dark gray hair and wears a gray-green short sleeve shirt which does not have the Pandaman image."}, {"type": "paragraph", "text": "In his debut appearance in the anime, he had brown hair, wore a blue short sleeve shirt with an image of Pandaman. He also wore beige shorts and a pirate hat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Beans is sly and deceitful as he pretended to be a harmless kid while welcoming the Straw Hat Pirates, whereas, in reality, he was actually a bounty hunter that was trying to trick them into letting off their guard. He is also very malicious as he tried to sneak up on Roronoa Zoro and stab him behind them back."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Baroque Works", "level": 3, "content": [{"type": "paragraph", "text": "As a Baroque Works agent, Mr. Beans swore to uphold the principle of secrecy, such that he was not allowed to pry into the true identities of any other members in the organization. Furthermore, as a Million, he was subordinate to the frontier agents, of which he directly worked under Mr. 8, Miss Monday, Mr. 9, and Miss Wednesday."}], "images": []}, {"title": "Miss Catherina", "level": 4, "content": [{"type": "paragraph", "text": "Mr. Beans's partner was Miss Catherina. Together, they deceived their enemies into believing that they were an innocent child and nun duo, and would then attack them while their enemies let their guards down."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Baroque Works bounty hunter, Mr Beans has some fighting skills, in which he worked with his partner, Miss Catherina to corner their opponents. Their main style of fighting was to fool their opponents into thinking that they were a powerless duo and then catch them off guard with a surprise attack. However, he is not very resistant as he fainted easily after Zoro hit him with the back of his blade."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Mr. Beans wields a small dagger, though he is not very skilled with it as Zoro easily knocked it out. He also wields a flintlock that he uses to shoot his opponents after Miss Catherina blinds them with her spray."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Whisky Peak Arc", "level": 4, "content": [{"type": "paragraph", "text": "When the Straw Hat Pirates sailed into the harbor of Cactus Island, Mr. Beans and the rest of the bounty hunters pretended to be happy at their arrival. As they sailed through, he and Miss Catherina cheered and gave them a warm welcoming."}, {"type": "paragraph", "text": "Later that night, after the organization's name had been discovered by Roronoa Zoro, Mr. Beans and the other bounty hunters fought him. While Zoro was admiring Sandai Kitetsu's sharpness after cutting down some bounty hunters, Mr. Beans tried sneak up from behind and stab him. However, Zoro easily noticed his presence and knocked the dagger out of his hand. Miss Catherina then rushed to Mr. Beans's side and pretended to comfort him while asking Zoro for mercy. After she created a blinding smoke cloud, Mr. Beans tried to fire a flintlock at Zoro. However, Zoro easily saw through their deception and knocked them out with the back of his sword."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Miss_Catherina_and_Mr._Beans_Attack_Zoro.png/revision/latest/scale-to-width-down/180?cb=20190710045433", "caption": "Miss Catherina and Mr. Beans' attempt to gas Zoro."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Mr. Beans and Miss Catherina vs. Roronoa Zoro", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Bean's color scheme in the anime is different from that of the manga, as shown in the Digitally Colored Manga and confirmed in the Vivre Card - One Piece Visual Dictionary. Furthermore, his design was also different in his most recent appearance as he did not have the Pandaman image on his shirt. Additionally, his initial anime appearance was also different from the manga as he was seen wearing a pirate hat and his dagger was shown to be made out of wood."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 106 (p. 17) and Episode 64, Mr. Beans makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 107 (p. 13-14) and Episode 64, Zoro reveals the name of the organization of the people on Whisky Peak.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 155 (p. 16) and Episode 91, Vivi reveals that those working under Frontier Agents are the Millions.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0134), Information about Mr. Beans is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 61), Mr. Beans's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 108 (p. 11) and Episode 65, Mr. Beans and Miss Catherina fight Roronoa Zoro.", "elements": []}, {"text": "↑  One Piece Anime — Episode 65, Mr. Beans is shown with a second color scheme.", "elements": []}, {"text": "↑  One Piece Anime — Episode 64, Mr. Beans's initial anime appearance is different from his final.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 13 Chapter 110 (p. 11), Mr. 5 reveals that secrecy is the principle of Baroque Works.", "elements": []}]}], "images": []}]}