{"sections": [{"title": "Mr. Shimizu", "level": 1, "content": [{"type": "paragraph", "text": "Mr. Shimizu was a Baroque Works Millions agent stationed at Whisky Peak. He worked under the Frontier Agents Mr. 8, Miss Monday, Mr. 9 and Miss Wednesday."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Shimizu a man with short black hair with a stubble on his upper lip and chin. He wears a white shirt and a rope around his forehead."}, {"type": "paragraph", "text": "In the anime, he wears a light blue shirt and his hair leans more towards a brown color."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Shimizu has no qualms about deceiving those he wishes to capture, as shown when he partied alongside the Straw Hat Pirates to get them to lower their guard."}, {"type": "paragraph", "text": "Furthermore, he is extremely addicted to alcohol and is always interested in drinking. No matter the circumstance, he will always wants to have a drink. It has been said that he would even go through hell and high water (火の中、水の中 Hi no naka, mizu no naka, literally meaning \"in fire, in water\") just to get to where there is a drinking party."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Baroque Works", "level": 3, "content": [{"type": "paragraph", "text": "As a Baroque Works agent, Mr. Shimizu swore to uphold the principle of secrecy, such that he was not allowed to pry into the true identities of any other members in the organization. Furthermore, as a Million, he was subordinate to the frontier agents, of which he directly worked under Mr. 8, Miss Monday, Mr. 9, and Miss Wednesday."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a bounty hunter, Mr. Shimizu has fighting skills that enable him to carry out his missions for Baroque Works."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Whisky Peak Arc", "level": 3, "content": [{"type": "paragraph", "text": "After the disguised bounty hunters of Whisky Peak welcomed the Straw Hat Pirates onto their island, they threw a party for their guests. At the party, Mr. Shimizu sat alongside a table of girls that were trying to intoxicate Sanji."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Shimizu's color scheme in the anime is different from that of the manga, as shown in the Digitally Colored Manga and confirmed in the Vivre Card - One Piece Visual Dictionary."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 107 (p. 5) and Episode 64, Mr. Shimizu makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 12 Chapter 107 (p. 13-14) and Episode 64, Zoro reveals the name of the organization on Whisky Peak.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 17 Chapter 155 (p. 16) and Episode 91, Vivi reveals that those working under Frontier Agents are the Millions.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #136), Information about Mr. Shimizu is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 61), Mr. Shimizu's name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 13 Chapter 110 (p. 11), Mr. 5 reveals that secrecy is the principle of Baroque Works.", "elements": []}]}], "images": []}]}