{"sections": [{"title": "Akumai", "level": 1, "content": [{"type": "paragraph", "text": "Akumai was a Billions agent who followed Mr. 2 Bon Kurei everywhere before he was captured by Hina when Mr. 2 and his crew sacrificed themselves to save the Straw Hat Pirates. His current fate is unknown."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "His hairstyle resembles the wings of the Baroque Works symbol. He wears a grey and black striped shirt and a white scarf with black spots around the neck area. He also has a sash tied around his waist like a belt. When his leader pretended to be Cobra, he was dressed like a member of the royal guard. When luring Hina form the Straw Hats, he was seen dressed as Chopper."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He seems to be loyal to Bentham, as he always followed him, and sacrificed himself along with the rest of his group. He also likes ballet dancing similar to Bentham."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Not much of Akumai's skills or power is ever shown. His only fights are unseen for the most part. He was among some of his other crew mates who were learning Okama Kenpo from Bon Kurei while dancing to Spiders Cafe. It is unknown how well he can perform it or use it in combat."}, {"type": "paragraph", "text": "Like Bentham and the many more serving under him, Akumai is a master of disguise."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Akumai has been shown to use a sword, though it is unknown how skilled he is with it."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Little Garden Arc", "level": 4, "content": [{"type": "paragraph", "text": "Aboard the Swanda Express, Mr. 2 Bon Kurei set out for Little Garden as Mr. 0 had ordered him to kill Mr. 3."}], "images": []}, {"title": "Drum Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "When they reached Little Garden and could not find Galdino, Bentham worried about being killed by Mr. 1 and ordered his men to sail back to Alabasta at top speed and intercept any ships they encounter."}], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the Swanda Express sailed through a hotspot, Bentham disappeared, much to his crewmen's shock. Bentham returned after his ship caught up to the Going Merry. His crew shouted his codename in joy, alarming the Straw Hat Pirates"}, {"type": "paragraph", "text": "On the way to Spiders Cafe, Bentham and his crew practiced Okama Kenpo. When Daz Bonez arrived, he knocked out Akumai and some other agents and threw them through the wall of the cafe."}, {"type": "paragraph", "text": "Later, Akumai accompanied Mr. 2 as they pretended to be Nefertari Cobra and the royal army to burn down Nanohana."}, {"type": "paragraph", "text": "Bentham, Akumai, and the rest of the crew were captured by Hina when they sacrificed themselves to save the Straw Hats. His current fate is unknown."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Akumai and other Billions of Mr. 2 Bon Kurei vs. Mr. 1 (unseen)", "elements": []}, {"text": "Akumai, Mr. 2 Bon Kurei and other Billions vs. Hina and Marines", "elements": []}]}], "images": []}]}