{"sections": [{"title": "Cocox", "level": 1, "content": [{"type": "paragraph", "text": "Cocox is an animal who lives on the Island of Rare Animals. Like all the animals on the island, he is protected by Gaimon. He is classified as a Type B creature, \"Small Friendly\"."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Cocox is a mixture of a fox and a rooster. He has whiteish grey fur that is light brown around the eyes. He also has a rooster's crown and wattle. He also has feathers on his backside, and red ears. In the anime, his legs are slightly longer."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little is known about Cocox’s personality, but he has a tendency to cry “cock-a-doodle-doo” like a rooster."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Syrup Village Arc", "level": 3, "content": [{"type": "paragraph", "text": "Cocox was the first animal Luffy and Nami encountered on the Island of Rare Animals. He was seen again with a group of animals when Gaimon waved goodbye to the departing Straw Hats."}], "images": []}, {"title": "Buggy's Crew Adventure Chronicles", "level": 3, "content": [{"type": "paragraph", "text": "Cocox, Lionbuta, and Usagihebi were there to witness Buggy's crash-landing on the Island of Rare Animals and the subsequent battle between him and Gaimon. After Buggy and Gaimon became friends, they had a party with the animals, during which Cocox was seen dancing and balancing a fruit on top of his nose. When Buggy left the island on a raft, Cocox was once again there to witness the departure with Gaimon and the other animals."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "Cocox was seen watching as the new inhabitant of the island, the barrel-woman Sarfunkel, fed Gaimon some food."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Treasure Wars 2 Welcome to Buggyland", "elements": []}, {"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Its name is an amalgamation between the words cockerel and fox. This also corresponds to its appearance as a fox with features of a cockerel.", "elements": []}, {"text": "In Chopper's Kingdom on the Island of Strange Animals, one of the animals on Crown Island resembles Cocox. Probably based on him because both live on islands with strange animals (next to him also appears a snake with rabbit ears, possibly based on Usagihebi).", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2e/Animal_resembling_Cocox_in_Third_Movie.png/revision/latest/scale-to-width-down/150?cb=20180510112128", "caption": "Animal resembling Cocox in the third movie."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 22 (p. 6) and Episode 18, Cocox debuts", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Cocox's birthday is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 41), His name is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 22 (p. 28) and Episode 18, Gaimon talks about being the Forest Guardian.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 88-89), Classification of animals by dangerousness.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 22 (p. 29) and Episode 18, Cocox witnesses the Straw Hats' departure.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 5 Chapter 43, cover story: Buggy's Crew Adventure Chronicles Vol. 7 and Episode 46, Cocox witnesses Buggy's crash-landing.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 6 Chapter 46, cover story: Buggy's Crew Adventure Chronicles Vol. 8 and Episode 46, Cocox witnesses the battle between Buggy and Gaimon.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 6 Chapter 47, cover story: Buggy's Crew Adventure Chronicles Vol. 9 and Episode 46, Cocox partying with Gaimon, Buggy and other animals.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 6 Chapter 48, cover story: Buggy's Crew Adventure Chronicles Vol. 10 and Episode 46, Cocox witnesses Buggy's departure.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 63 Chapter 620, cover story: From the Decks of the World Vol. 7, Cocox seen two years later.", "elements": []}]}], "images": []}]}