{"sections": [{"title": "Mummy Mee", "level": 1, "content": [{"type": "paragraph", "text": "Mummy Mee is one of the houseparents, alongside Daddy Dee, of a World Government-affiliated orphanage situated on the Conomi Islands."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mummy Mee is a fair-skinned woman with a long face, long eyelashes, and a pointed chin. She has puffed up purple hair and wears red lipstick and gold earrings. She also wears a fancy purple coat with a fluffy, white fur collar and a yellow-orange button-up shirt with a red dress underneath."}, {"type": "paragraph", "text": "In the anime, Mummy Mee has orange hair instead of purple hair, pearl earrings instead of gold earrings and, although the color of her coat was still purple, the fur collar was brown and not white. Her shirt was pink and her dress was yellow, as opposed to the yellow-orange and red colors in the manga, respectively. Furthermore, the anime shows her with two parts of her hair splitting from the center and also shows that she wears purple nail polish."}, {"type": "paragraph", "text": "Furthermore, in her initial anime appearance, she had brown hair and the collar of her coat was white and frilly."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mummy Mee is a caring woman as she tried to take care of Nojiko and Nami after finding out that the two little girls had lost their parents. Furthermore, she tried to convince Bell-mère that their orphanage was better suited for caring for the two, which shows that she truly did care for orphans, or otherwise, she would not have tried so hard to convince her."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Daddy Dee", "level": 3, "content": [{"type": "paragraph", "text": "Mummy Mee runs an orphanage with Daddy Dee. The two of them both dress pretty extravagantly, but both of them have displayed that they care about orphans as houseparents."}], "images": []}, {"title": "Genzo and Nako", "level": 3, "content": [{"type": "paragraph", "text": "Mummy Mee has earned the trust of Genzo and Nako, both of which maintain an important role in Cocoyasi Village as the sheriff and doctor, respectively. They both believed that Nojiko and Nami would have been better off in her and Daddy Dee's hands, showing that they acknowledged that Mummy Mee was a suitable houseparent."}], "images": []}, {"title": "World Goverment", "level": 3, "content": [{"type": "paragraph", "text": "Since Mummy Mee is a houseparent of an orphanage affiliated with the World Government, she has earned the trust of the World Government, such that they believe that she is suitable for the position."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Bell-mère brought back two orphans to Cocoyasi Village, Mummy Mee and Daddy Dee tried to convince her, along with the help of Genzo and Dr. Nako, to place the two little girls in the care of their orphanage. When Bell-mére opted to adopt and take care of them herself, Mummy Mee and Daddy Dee were very surprised and tried to get her to change her mind. However, after Bell-mére shouted at them and told them all to shut up, they gave up on trying to convince her, but not before Mummy Mee started crying after being scared by Bell-mére's anger."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Mummy Mee's color scheme in the anime is different from that of the manga, as shown in the Digitally Colored Manga and confirmed in the Vivre Card - One Piece Visual Dictionary. Furthermore, in her initial anime debut, her overall appearance was somewhat different from the final design shown in the anime. It was not until the Episode of Nami that her design looked more like that of the manga."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The One Piece Blue: Grand Data File databook mentions that Mummy Mee looks like a man.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 9 Chapter 79 (p. 1) and Episode 35, Mummy Mee makes her debut.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 55), Mummy Mee is named and introduced.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0109), Information about Mummy Mee is revealed.", "elements": []}, {"text": "↑  One Piece Anime — Episode of Nami, Mummy Mee's design is changed to match the manga better.", "elements": []}]}], "images": []}]}