{"sections": [{"title": "Kebi", "level": 1, "content": [{"type": "paragraph", "text": "Kebi was a member of the Suna Suna Clan along with Vivi, Koza and Okame."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kebi is a tanned man, with black hair put into a ponytail with a grey tie. He wears a navy blue sleevless shirt, and a dark red hat. He also has brown goggles, that he keeps on his hat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Kebi_as_a_Child.png/revision/latest/scale-to-width-down/100?cb=20171102181438", "caption": "Kebi as a child."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kebi was willing to risk his life for a cause he believed in. As a rebel member, he was willing to fight against the super strong Alabasta army, and only wanted what was best for the country."}, {"type": "paragraph", "text": "He also has a deep caring for others, rushing to both Koza and Kappa when they were hurt."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Kebi has been shown to be a fairly strong and skilled fighter, since he was able to clash with Alabasta army members with ease."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Kebi has been seen fighting with both a sword and a shotgun, and he seems to be fairly proficient in using both, since he was at, if not beyond, the fighting ability of the Alabasta army members."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "When Kebi was a child, he met Koza at some point and became good enough friends to join the Suna Suna Clan. He and the other children managed to protect Vivi from Agotogi and his gang of thugs."}], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "Years later, Kebi became a member of the Rebel Army led by Koza. Kappa, a child from Nanohana tried to join the rebels, but Koza, Kebi, and the others wouldn't let him. When Koza was shot by the imposter King Cobra, Kebi and Erik take on leadership positions and try to help Koza out. When the pirate ship is overturned and Kappa is attacked by Mr. 1 and Miss Doublefinger, he rushes to Kappa's side to get him medical treatment. He also believes the attack was an act by the royal army and wants to avenge the innocent injuries."}, {"type": "paragraph", "text": "Later on, he and the other rebels clash head on with the royal army as Vivi tries to stop the fighting. During the battle, Luffy defeats Crocodile and it begins to rain. Koza asks Kebi if he can feel it, and, at first, Kebi doesn't understand. However, the rain becomes stronger and Kebi is astonished that the rain finally arrived."}, {"type": "paragraph", "text": "After the fighting has stopped due to the rain and Crocodile's defeat, Kebi, Koza, and the other rebels ask for forgiveness, but King Cobra tells them the past can't be undo and that they must continue living."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/87/Koza%27s_Rebellion_and_Alabasta%27s_Royal_Guards_Clash.png/revision/latest/scale-to-width-down/230?cb=20130503122419", "caption": "Kebi and the other rebels clash with the royal army."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kebi and the Rebel Army vs. Royal Guards of Alabasta", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑ One Piece Blue: Grand Data File page 76, Kebi's name revealed.", "elements": []}]}], "images": []}]}