{"sections": [{"title": "Farafra", "level": 1, "content": [{"type": "paragraph", "text": "Farafra was a member of the Rebel Army led by Koza along with Erik. He lost his right arm and right shoulder while protecting Koza during an enemy attack."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Farafra is a large man with tan skin, and long unkempt hair, that is black in the anime. He wears a striped black and green military shirt, and a sash. He also sports a blueish-grey turban. He lost his right shoulder while fighting for the rebels. He also has a metallic prosthetic shoulder, most likely to hide the impairment. His character also resembles a hippo, having a flat nose and two teeth that stick out of his lower jaw."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He was a loyal member of the Rebel army in Alabasta, willing to lose part of his arm for the cause. He also seems to be good friends with Koza and Erik. After the timeskip, Farafra appears to still be close with Koza, who now works for the kingdom."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Due to fighting alongside Koza in the Rebel Army, Farafra can be assumed to be a capable soldier. He also possesses great endurance, as losing part of his arm and shoulder didn't seem to cause him much discomfort."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Farafra and the rest of the Suna Suna Clan fought to protect Vivi from Agotogi and his gang of thugs."}], "images": []}, {"title": "Alabasta Saga", "level": 3, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 4, "content": [{"type": "paragraph", "text": "Years later, Farafra became a member of the Rebel Army led by Koza. At some point during the war in Alabasta, he lost his right arm and a chunk of his shoulder protecting Koza."}, {"type": "paragraph", "text": "After the destruction of Nanohana, Farafra stood next to Koza as he called for an attack on Alubarna."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "He stood next to Koza, who had become the environmental minister of the kingdom of Alabasta."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name possibly comes from the Egyptian oasis Farafra.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 167 (p. 6-9) and Episode 105.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 65 Chapter 638, cover story: From the Decks of the World Vol. 22.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 18 Chapter 163 (p. 19) and Episode 100.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 18 Chapter 164 (p. 2-4) and Episode 100.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 19 Chapter 172 (p. 9) and Episode 107.", "elements": []}]}], "images": []}]}