{"sections": [{"title": "Maidy", "level": 1, "content": [{"type": "paragraph", "text": "Maidy is a servant in the castle of Vivi's family. She helped Terracotta make a dress for Vivi for the speech Vivi delivered to the people of Alabasta."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "She is a middle-aged woman with brown hair and dark eyes. She wears a purple maid dress with a frilly white border and a white hat with a light colored part in the front, with an intricate design."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "She seems to be helpful since she is often seen assisting Terracotta in her duties."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "She was first seen helping Vivi getting dressed and doing her hair on the morning of Princess Vivi's big speech for her Coming-of-Age ceremony. She commented on the fact that the speech was going to be broadcast around the whole country via Den Den Mushi and that the square was already packed hours before the official start of the broadcast."}], "images": []}, {"title": "From the Decks of the World", "level": 3, "content": [{"type": "paragraph", "text": "After the timeskip, Maidy was seen taking Pell's measurements so he could have new clothes in time for the upcoming Levely."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5b/RoyalPalace2YL.png/revision/latest/scale-to-width-down/200?cb=20130806233429", "caption": "Maidy fitting Pell for the Levely."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 215 and Episode 129, Maidy is introduced.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File (p. 81), Her name is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 65 Chapter 639, cover story: From the Decks of the World Vol. 23.", "elements": []}]}], "images": []}]}