{"sections": [{"title": "Mr. Love", "level": 1, "content": [{"type": "paragraph", "text": "Mr. Love was a Baroque Works Billions agent who posed as a member of the Rebel Army."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Love is an average-sized man with shaggy brown hair in the anime. In the digitally colored manga, he has shaggy brown hair. He wears a pair of tan gloves and a blueish-black coat with a hood. On the back of his coat are the words \"Baroque\" on the top, followed by \"I ❤️ Miss Valentine\" below. Most of the words are written in white letters, with \"Miss\" in purple letters and the heart in red. He also wears light purple shorts with purple-black oval shapes on them. In the anime, he has shaggy blonde hair instead of brown and does not wear gloves."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Love was an obedient agent, as he followed his orders without question in posing as a member of the Rebel Army. He is also a deceitful person as he tried to lie to the Marines about his true identity as a member of Baroque Works. Furthermore, Mr. Love is also obsessed with Miss Valentine, as he even made a jacket himself to declare his love for her."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "At some point in his life he joined Baroque Works. He then became member No. 31 of Miss Valentine's fan club."}], "images": []}, {"title": "Alabasta Arc", "level": 3, "content": [{"type": "paragraph", "text": "During Operation Utopia, he posed as a member of the Rebel Army."}, {"type": "paragraph", "text": "In the midst of the battle of Alubarna, he and some of his fellow Billions agents came across Tashigi and the Marines. One of his comrades tried to deceive Tashigi that they were ordinary Alabastan civilians, but before his comrade could finish his sentence, Tashigi cut him and Mr. Love down. Mr. Love is presumably subsequently arrested by the Marines upon Crocodile's defeat."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "Mr. Love's hair color in the anime is different from that of the manga, as shown in the Digitally Colored Manga and confirmed in the Vivre Card - One Piece Visual Dictionary. Furthermore, he is not seen wearing gloves in the anime."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In an SBS, Oda said that Mr. Love was a big fan of Miss Valentine.", "elements": [{"text": "Mr. Love's jacket was made by himself to support Miss Valentine.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 23 Chapter 206 and Episode 125, Mr. Love makes his debut.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 23, Mr. Love is named.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #223), Additional information on Mr. Love is revealed.", "elements": []}, {"text": "↑  One Piece Blue: Grand Data File, Mr. Love's background is revealed.", "elements": []}]}], "images": []}]}