{"sections": [{"title": "Mansion's Guards", "level": 1, "content": [{"type": "paragraph", "text": "The Mansion's Guards are employees of Tessle Company, hired by Klahadore the butler to act as security guards to keep the entryway of Kaya's mansion safe."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "The guards are composed of two men. The one on the left wears a black suit, white shirt, and green tie. He is rather skinny and has a mustache and beard. He has brown hair that is spiked up at the top."}, {"type": "paragraph", "text": "The guard on the right wears a black suit, white shirt and a red tie. He is not as skinny as his partner, and is clean-shaven. He has slicked back black hair, that is long in the back."}], "images": []}, {"title": "Personalities", "level": 2, "content": [{"type": "paragraph", "text": "They are quite serious about their job, and sincerely want to protect their mistress Kaya to the degree where they would risk their lives for her. However, they tend to neglect their duties while being on breaks."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As they are hired to guard the mansion's front gates, it is indicated that they are at least capable of repelling simplistic troublemakers and intruders, though their full capabilities are not known."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Klahadore complained when the guards were on a lunch break, neglecting their duties, although the neglect allowed Usopp to slip into the mansion. They went on vacation along with all other employees of the mansion (aside from Klahadore and Merry), thus not knowing of the Black Cat Pirates' attack, nor were they able to help Merry when he was injured by Klahadore, who is in truth the dreaded pirate captain Kuro. It is unknown if Kaya kept the guards after Kuro's defeat."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "Birth of Luffy's Dream Pirate Crew!", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The Mansion's Guards share the same birthday: July 1.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue: Grand Data File (p. 43), The Guards are \"named\" and given a brief description.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 3 Chapter 24 and Episode 9, Klahadore complains that the guards are on lunch.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 4 Chapter 31 and Episode 13, Merry claims that everyone else is on vacation.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, The Mansion's Guards' birthday are revealed.", "elements": []}]}], "images": []}]}