{"sections": [{"title": "Joy Boy", "level": 1, "content": [{"type": "paragraph", "text": "\"Joy Boy\" was a man from the surface world who played an important role in the history of Fish-Man Island. He was first mentioned on the Ryugu Poneglyph read by Nico Robin while at the Sea Forest."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Around 900 years ago, the residents of Fish-Man Island made a promise to a great man named Joy Boy. Joy Boy attempted to raise Noah with Poseidon's aid, but he broke his promise to Fish-Man Island. However, Fish-Man Island promised that they would keep Noah safe until a certain day came. On the poneglyph is a letter of apology from Joy Boy to Poseidon, apologizing for breaking his end of the bargain."}, {"type": "paragraph", "text": "Fish-Man Island's half of the promise was almost broken during the events of the Fish-Man Island Arc, when Monkey D. Luffy was asked to protect the island no matter what the cost, even if it meant that Noah had to be destroyed in the process."}, {"type": "paragraph", "text": "Before Luffy could destroy the ship completely, Noah was stopped by a group of Sea Kings that were summoned unknowingly by Shirahoshi, thus saving Fish-Man Island and maintaining the nation's promise to Joy Boy. However, the ship was still heavily damaged. The Sea Kings then took the ship to the Sea Forest, where they planned to fix it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b9/Ryugu_Poneglyph.png/revision/latest/scale-to-width-down/155?cb=20171105021918", "caption": "The poneglyph with the apology from Joy Boy."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 64 Chapter 628 and Episode 548, Nico Robin reads about Joy Boy on the Ryugu Poneglyph.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 66 Chapter 649 and Episode 569, Neptune explains to Robin who Joy Boy was.", "elements": []}]}], "images": []}]}