{"sections": [{"title": "Spacey", "level": 1, "content": [{"type": "paragraph", "text": "First Lieutenant Spacey is one of the automata created on Karakuri Island by Tsukimi."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Spacey is a short android in military gear. He has a bushy mustache, an army jacket, and an army helmet on his head. He carries a rifle and equipment on his back."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/98/Spacey%27s_Color_Scheme.png/revision/latest/scale-to-width-down/220?cb=20140915111815", "caption": "Spacey as colored in One Piece Green: Secret Pieces."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Spacey is very loyal, as shown by his loyalty towards his apparent savior, Enel, who defeated the Space Pirates."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Tsukimi", "level": 3, "content": [{"type": "paragraph", "text": "As his master and creator, Tsukimi loved and cared for Spacey and the other automata until Tsukimi choked to death."}], "images": []}, {"title": "Other Automata", "level": 3, "content": [{"type": "paragraph", "text": "He seems to get along with the other automata, and went along with them to the moon."}], "images": []}, {"title": "Enel", "level": 3, "content": [{"type": "paragraph", "text": "After the Space Pirates were defeated, Spacey along with the other automata and the ones on the moon become loyal soldiers to Enel."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He is presumably efficient in using the rifle he carries on his back."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Spacey was first introduced in mini cover-story of Enel's Great Space Operations. One day Spacey along with other automata and Dr. Tsukimi were watching the moon and eating snacks when suddenly a huge explosion happened on the moon. The explosion was of unknown origin. Professor Tsukimi, shocked, swallowed his dumpling without chewing, resulting in him suffocating to death. After burying the professor, the four automata traveled to the moon (each one with a balloon) to take revenge on the one who caused the explosion that resulted in the accidental death of their creator. Upon reaching the moon, they find the Space Pirates, and despite overwhelming odds, they fought the captain of the Space Pirates. In the end, however, Spacey, along with three other automata, were defeated. He was the first automaton that Enel encountered on the moon. He survived his encounter with the Space Pirates who came there to dig up the ancient city located on the moon. After meeting Enel, he considered him his savior."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 45 Chapter 433, cover story: Enel's Great Space Operations Vol. 4, Spacey makes his first appearance.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 95), his birthday is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 46–47 Chapters 448–450, cover story: Enel's Great Space Operations Vol. 17-18.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 47 Chapters 451 and 452, cover story: Enel's Great Space Operations Vol. 19-20.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 47 Chapter 453, cover story: Enel's Great Space Operations Vol. 21.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 48 Chapter 469, cover story: Enel's Great Space Operations Vol. 34.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 47 Chapter 455, cover story: Enel's Great Space Operations Vol. 22.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 47 Chapter 456, cover story: Enel's Great Space Operations Vol. 23.", "elements": []}]}], "images": []}]}