{"sections": [{"title": "Rosward", "level": 1, "content": [{"type": "paragraph", "text": "Saint Rosward is one of the World Nobles who reside in the Holy City of Mary Geoise. He is the father of Shalria and Charlos."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Saint Rosward is an older man with a hairstyle that curls upward, which is shared with his children. He has a curly black mustache and a fluffy gray beard, and wears black shades, which were shattered when Usopp fell on him."}, {"type": "paragraph", "text": "Like all other World Nobles, Rosward wears a thick white suit with medal-like knobs and a bubble over his head to prevent himself from breathing the same air as the commoners. He also wields a walking cane that is revealed to be a rifle."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Saint_Rosward_Anime_Concept_Art.png/revision/latest/scale-to-width-down/150?cb=20180909165414", "caption": "Rosward's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Rosward is noted to be the most-responsible of his family yet seen; as seen when he scolded his children for their behavior. Though he scolds his children and appears concerned, he is merely maintaining the appearance of their power and acts in a misanthropic, elitist manner almost even more so than his children. Although he has \"never hit his son\", he was livid at Luffy after he assaulted Charlos, for having the gall to directly affront their position. Like his daughter Shalria, he has deep pride in his ancestry. Of his family yet seen, he is the only one who has not been seen abusing anyone, citizen or slave, though he apparently has a \"Pirate Captain collection\" (which included Devil Dias and Jean Bart), and does nothing to stop or alter the treatment that his children give others. After the timeskip, Rosward has shown to be extremely cruel and brutal as shown when he enjoyed torturing an enslaved Bartholomew Kuma while referring to the latter as a top class slave due to his inability to scream or cry."}, {"type": "paragraph", "text": "Like his children, his belief in his untouchable status as a World Noble seems to render him incapable of realizing the danger around him, even when completely obvious. Despite the fact that Luffy brutally punched his son Charlos across the room, Rosward's only reaction is anger, rather than fear of someone who could and would cause him serious harm if provoked, as if he were somehow incapable of being harmed himself. He shot pointlessly at Luffy several times with his cane-rifle until disarmed by Sanji, at which point he apparently realized that the Straw Hats would not be cowed into submission, instead calling for a Marine admiral to deal with them. Regardless, he still took the threat head-on instead of acting out of cowardly self-preservation, although it's most likely due to his aforementioned belief in his untouchable nature."}], "images": []}, {"title": "Relationship", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlos", "level": 4, "content": [{"type": "paragraph", "text": "Rosward gets along well with his son, although he does reprimand him for spending so much money to the point of being considered a \"waste\". After Luffy punched him, Rosward became furious."}], "images": []}, {"title": "Shalria", "level": 4, "content": [{"type": "paragraph", "text": "Rosward gets along well with his daughter, although he does reprimand her for continuously depleting his \"Pirate Captain Collection\"."}], "images": []}, {"title": "Other World Nobles", "level": 3, "content": [{"type": "paragraph", "text": "Rosward, being proud of the title of Celestial Dragon, looks down on any fellow Celestial Dragons who do not honor the heritage. As such, he expresses disdain at the Donquixote Family, due to Homing's choice to relieve his own family of their statuses to live among the common masses. Mjosgard's newfound benevolence due to Otohime's influence further inclined Rosward to believe the Donquixote Family to be utter disgraces to the rest of the World Nobles."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After Luffy punched his son Charlos, Rosward became furious and attempted to shoot him with his rifle cane. As the Straw Hats fought back against his guards, Rosward summoned an admiral in retaliation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Being a World Noble, Rosward has the authority to act as he pleases without fear of legal repercussion. He also possesses tremendous wealth, having bought a \"Pirate Captain Collection\" of slaves that his daughter can manhandle callously, and his son spending 500,000,000 on a mermaid. He has tremendous political influence, more so than any royalty of the Levely, and the power to summon an Admiral of the Marines in the event he feels his authority alone would not inflict submission."}, {"type": "paragraph", "text": "Due to being spoiled by his heritage, Rosward has no fighting skills whatsoever, as he could not hit a stationary Luffy with his firearm even at moderate range, and Sanji easily disarmed him. His endurance and durability was very low, as he was taken out when Usopp fell on top of him."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He wields a gun built into his cane, but could not manage to hit Luffy from a mediocre distance, even though Luffy was stationary."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "He is first seen with his daughter, Saint Shalria, looking down on his runaway-blown up slave, Devil Dias, who was the Captain of the Acumate Pirates. After his dog urinates on the man, his daughter shoots him with a gun, displaying no remorse afterwards. A demon-like man is seen behind him, who is later revealed to be pirate captain Jean Bart."}, {"type": "paragraph", "text": "He is then seen at the Human Auctioning House, with his son Saint Charlos and daughter Saint Shalria. While claiming that he is merely visiting as an audience, Charlos bid 500,000,000 on Camie, which led Rosward to be displeased with his son."}, {"type": "paragraph", "text": "When his son was attacked by Luffy, he used his cane (which is a concealed rifle) and started shooting randomly around Luffy, then shouted out for someone to call for an Admiral. Sanji kicks the cane out of hand, followed by Usopp knocking him unconscious by accidentally falling down from the rooftop and smashing his face into the floor."}, {"type": "paragraph", "text": "He was later seen unconscious together with his son when Shalria scolds the marines for being unable to capture the Straw Hat Pirates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bc/Sanji_Disarms_Rosward.png/revision/latest/scale-to-width-down/220?cb=20130527141855", "caption": "Sanji disarms Rosward."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "Prior to the Levely, Charlos told Rosward that he spotted a large mermaid. Charlos went to take the mermaid, but Rosward later heard that Mjosgard had beat him up. Rosward rode Bartholomew Kuma, whom he had rented, to the Celestial Dragon Gate where he reunited with Charlos. He talked to Charlos about the abuses he could inflict on his \"invincible slave\"."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 203), Saint Rosward's birthday is given.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0505), Information about Rosward is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 908, Rosward's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 497 and Episode 391, Rosward is introduced.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 502 and Episode 396, Charlos is scolded by his father for wasting money.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 503 and Episode 397, Shalria states \"[Charlos] has never even been hit by his own father!\".", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 503 and Episode 397, Rosward arrogantly and angry rant on about his ancestry pride.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 503 and Episode 397, Rosward is disarmed by Sanji and knocked out by Usopp.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 53 Chapter 514 and Episode 408, Rosward and his son are shown after the incident.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 906.", "elements": []}]}], "images": []}]}