{"sections": [{"title": "Devil Dias", "level": 1, "content": [{"type": "paragraph", "text": "Devil Dias is a pirate and the former captain of the Acumate Pirates, but was captured and sold as a slave to the family of World Noble Saint Rosward."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Dias is a large and muscular man who is large enough to carry a normal-sized woman in one hand. His long black hair stands high, and is arranged into two split ends. He has a devil-looking pair of eyes tattooed on his torso, and a stitched scar right on his stomach. He wore a brown captain's jacket with a gray furred cape, light pants with a double brown belt to hold it up, boots, and a bomb collar. Like all slaves of the World Nobles, he has the Hoof of the Soaring Dragon burned onto his back to forever mark him as \"less than human\"."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "In his brief appearance, it is seen that he is desperate in trying to escape the World Nobles' abuse and claims that he wants to go home to see his family."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He was a prominent enough to be given a bounty of 60,000,000, though Sentomaru noted it was no where near enough to get him through the New World. He was resilient enough to survive the explosion of the bomb collar around his neck, though he was gravely injured."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "According to his own words, Dias has a wife and a son. He eventually formed the Acumate Pirates and became its captain, and earned a bounty of 60,000,000. Sometime later in the Grand Line, he was captured by slave traders and sold off to Saint Rosward's family, becoming a part of the Celestial Dragon's \"Pirate Captain collection\". Like all slaves owned by the Celestial Dragons, Dias was horribly abused and pumped with tranquilizers as a method of being \"tamed\". However, on one occasion that not enough was injected into him, he eventually attempted to escape."}], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "When on Sabaody Archipelago, he ran off and begged everyone he could find to give him something to break his collar and chains. He pleaded that he needed to see his family one more time and that his son was only a baby when he left. After no one gave him anything in time, the collar he had around his neck exploded. Every civilian in the vicinity feared the World Nobles, so they didn't want to do anything with him. Sentomaru witnessed the event and gave a brief description of his past, commenting that the pirate captain would never have survived in the New World. Monkey D. Luffy tried to help him but was restrained by Hatchan due to the rules of not offending the World Nobles. Dias was then urinated on by Roswald's family dog, Saru, shot by Saint Shalria, and then taken by the Marines."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Dias%27s_Collar_Explodes.png/revision/latest/scale-to-width-down/250?cb=20160131175547", "caption": "Devil Dias's collar explodes as he tries to escape slavery."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name may come from various Portuguese explorers: Dinis Dias, who was ironically, a slave-trader; and Bartolomeu Dias, the first person to round the Cape of Good Hope. This reference is further supported by the fact that he was introduced into the story at Sabaody Archipelago, which is a place all pirates have to go through to get to the New World.", "elements": [{"text": "He may also be named after Henrique Dias, a Brazilian military leader who was born to freed slaves and led freed slaves with distinction against Dutch forces.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 497 (p. 12-19) and Episode 391, Dias makes his escape from Roswald and Shalria, only to fail.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 108), Dias's birthday is given.", "elements": []}, {"text": "↑  Eternal Log, Devil Dias' wanted poster is revealed.", "elements": []}, {"text": "↑  One Piece Movie 14, Devil's wanted poster is shown.", "elements": []}]}], "images": []}]}