{"sections": [{"title": "Shalria", "level": 1, "content": [{"type": "paragraph", "text": "Saint Shalria is a World Noble, the younger sister of Saint Charlos, and the daughter of Saint Rosward."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Like other World Nobles she is dressed in a thick white suit with medal-like knobs which supplies her with oxygen to save her sharing the same air as commoners. The collar of her suit has a flower like pattern with lace at the top. The flower pattern on her suit repeats at the sides of her skirt. Her hair inside the bubble is styled upwards, forming a curl above her head. She wears a veil over the lower half of her face and light orange tinted shades over her eyes. She also wears heart-shaped earrings."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ca/Saint_Shalria_Anime_Concept_Art.png/revision/latest/scale-to-width-down/100?cb=20180909165435", "caption": "Shalria's concept art from the anime."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Like her fellow Celestial Dragons, she shows no concern for those whose statuses are beneath her and shows no pity, remorse, or regret about how she treats her slaves. In an incident where she lost her slave, she coldly commented on how her father would simply have to buy her another, viewing the slave's demise in such a lowly way she mocked him as barely being a human. She detests the weak more than anything (which is rather ironic considering she has no fighting skill of her own). She also has great pride in her family's ancestry, as she swore to make the Straw Hats suffer a living hell upon capture for what they did to her father and brother."}, {"type": "paragraph", "text": "While naïve to the length that Luffy and the other pirates would do everything to achieve their goals, she was not incapable of realizing their ultimate goal. Out of her family, she was the only one who went straight to the target of their rescue and attempted to murder Camie, even if it was just a display of her cruel mentality. She was also not above racism, referring to Camie as a \"fish\"."}, {"type": "paragraph", "text": "She has a strange habit of ending her sentences with \"amasu\" or just \"su\"."}], "images": []}, {"title": "Relationship", "level": 2, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After the Straw Hat Pirates escaped from Kizaru, Shalria angrily shouting insults at the Marines for not capturing the Straw Hats yet. In her anger she swore that upon their capture she would show the crew a true living hell until they begged for death on their knees."}], "images": []}, {"title": "Camie", "level": 4, "content": [{"type": "paragraph", "text": "Shalria attempted to kill Camie but failed and was easily knocked out by Rayleigh's Haki."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a World Noble she does as she pleases. She has the power to summon an Admiral, however she has no fighting skills and lacks a strong will, as shown as when she easily fainted due to Rayleigh's Haoshoku Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "She is shown using a gun, though how skilled she is with it is not known."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "She first appeared when her slave, Devil Dias escaped in the Sabaody Archipelago, making her father comment on her carelessness in ruining his captain collection. After Dias' collar exploded, she mocked his pitifulness, shot him and then casually walked away commenting on how next time she wants a giant as a slave."}, {"type": "paragraph", "text": "She later appeared at the Human Auctioning House with her father, waiting for her brother, Saint Charlos. She attempted to kill Camie while the Straw Hats were busy holding off the guards but was stopped by the timely intervention of Silvers Rayleigh who knocked her out with a burst of Haki."}, {"type": "paragraph", "text": "She was later seen outside of the auction house, beside her beaten and unconscious father and brother, angrily shouting insults at the Marines for not capturing the Straw Hats yet. In her anger she swore that upon their capture she would force the pirate crew to beg on the ground for forgiveness and then bring hell to them."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Shalria is currently the only named female World Noble.", "elements": []}, {"text": "Shalria's favorite food is caviar.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 497 and Episode 391, Shalria is introduced.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0504), Information about Shalria is revealed.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 77), Saint Shalria's birthday is given.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary (Card #0504), Shalria's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 496 and Episode 391, Shalria and her slave.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 53 Chapter 514 and Episode 408, Shalria mentions her ancestry pride.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 503 and Episode 397, Shalria knocked out by Rayleigh's Haki.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 53 Chapter 514 and Episode 408, Shalria expresses her anger at the Straw Hats.", "elements": []}]}], "images": []}]}