{"sections": [{"title": "X Drake", "level": 1, "content": [{"type": "paragraph", "text": "\"Red Flag\" X Drake (read as \"Diez Drake\"), is the Captain of the Marine Secret Special Unit SWORD, and the captain of the Drake Pirates, who defected from his position as rear admiral to go undercover as a pirate. He is one of twelve pirates referred to as the \"Worst Generation\", and prior to the two-year timeskip had a bounty of 222,000,000."}, {"type": "paragraph", "text": "Currently, he and his crew are affiliated with the Beasts Pirates, a major pirate crew led by Kaido, one of the Yonko. X Drake serves as one of the crew's Headliners and one of the Flying Six, six of the strongest Headliners."}, {"type": "paragraph", "text": "Drake is the son of the Marine-turned-pirate Diez Barrels, and as a young adult was called Dory (ドリィ, Dorii). He was physically abused by his father, and when the Donquixote Pirates invaded Barrels' hideout 13 years ago, he abandoned Barrels' crew as they were trapped and massacred."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Drake is a tall, lean, and muscular man who wears what appears to be a combination of a white-plumed cocked hat with his crew's Jolly Roger on the side and a mask over his eyes. Underneath this headgear, Drake's hair is reddish brown, with brush-like sideburns. On his broad chin he has an \"X\" (not confirmed to be either a scar or tattoo) and on his chest and upper body he also has another large \"X\". The \"X's\", as well as that in his name, represents the Roman Numeral X for 10, not the English letter. When seen from above, his bicorne greatly resembles the head of a Pterodactyl."}, {"type": "paragraph", "text": "He wears armor on his relatively thin legs and arms consisting of knee-high boots and gloves that go up past his elbows, respectively. The openings to both the gloves and the boots are also secured by the armor, which is rounded for the gloves and a sharp maple leaf pattern for the boots at the front of his knees. On the rest of his body he wears leather pants and a leather shirt. A belt with a large ornately designed circular belt buckle secures Drake's pants as well as his sword and axe to his waist. He also wears a black cape, which, from the inside, is crimson-colored, with a white fur lining around the neck."}, {"type": "paragraph", "text": "After the Summit War, he is seen wearing a scarf that is tied around his neck when he appeared on a winter island that was apparently under the protection of Kaido."}, {"type": "paragraph", "text": "In SBS Volume 64, Oda drew the Supernovas as children. Drake is shown wearing a small tattered Marine uniform, showing that he aspired to become a Marine since he was very young. He had a rounder face, shorter hair, and a wooden sword at his side. He did not have the \"X\" on his chin yet. He appears to have been a playful and cheerful boy, as opposed to the stern and serious man he grew up to be."}, {"type": "paragraph", "text": "As a young adult, Drake wore a tattered, bloodied shirt with pants and boots on the snowy Minion Island while with the Barrels Pirates, though later on during a supposed escape, he managed to acquire a somewhat tattered, thick winter coat with a hood as well as a pair of dark gloves. Due to the mental and physical abuse he suffered from his father, he was undersized for his age and easily mistaken as a child by the Donquixote Pirates.   "}, {"type": "paragraph", "text": "After the timeskip, Drake no longer has his bicorne, exposing his now light orange hair spiked into a fauxhawk. He also has a black headband with an eye-hole that is slanted so it only goes over his left eye."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a young man thirteen years ago, he appeared to be the type that is very reluctant to fight as Barrels stated he was \"always a no-show\" and reluctant to help (at least anyone in his crew) as instead of helping one of the pirates of the crew, he ran away instead (even though he was already stated to have \"power\" which he could have used to help)."}, {"type": "paragraph", "text": "Drake displays a stern, dead-serious disposition at all times. He is also observant and patient and appears to be a pirate who avoids needless violence, especially if he knows that it would cause too much attention. He has shown great bravery as he was willing to attract the attention of Kaido even though Kaido was able to strike fear into even Doflamingo. However, he gets flustered easily when he sees naked women, as he fainted after entering a bathhouse in search of Sanji, though he promptly tried to deny anything of the sort."}, {"type": "paragraph", "text": "However, when a situation calls for violence, he reveals a surprisingly ruthless and bloodthirsty streak. This can be first seen during his encounter with the Pacifista in Sabaody Archipelago where he grins after biting the cyborg on the head, causing it to bleed, and again when he deliberately attacks a subordinate of Kaido's on learning it would further his goal of attracting the attention of the Yonko."}, {"type": "paragraph", "text": "His goals appear atypical from the other pirates, as he intervened in the fight between Urouge and a Pacifista even though there was no apparent need for him to get involved."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Diez Barrels", "level": 4, "content": [{"type": "paragraph", "text": "Barrels was Drake's abusive father, and when he was a Marine Officer, Drake wanted to become just like him. However, when Barrels became a pirate, he physically abused his son. Drake remained with his father as he continued to see the past good of the man, but his loyalty started to waver. When Doflamingo attacked Barrels and his crew with the Birdcage, Drake fled and left them behind. Thirteen years later, Drake was seen acknowledging Doflamingo as his father's killer, but stated that he held no grudge."}], "images": []}, {"title": "Organizations", "level": 3, "content": [], "images": []}, {"title": "Barrels Pirates", "level": 4, "content": [{"type": "paragraph", "text": "13 years ago, he was a member of the Barrels Pirates. However, he was barely (if at all) loyal to the crew, considered \"always a no show\", and he simply ran for his own life instead of saving anyone when Doflamingo attacked."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "It appeared that as a child, he hoped to be a Marine, possibly because of his father's previous affiliation with them. Thirteen years ago, Drake fled the Barrel Pirates and was saved by the Marines."}, {"type": "paragraph", "text": "At some point in the past, he joined the Marines and became a rear admiral, but quit for unknown reasons. He seemed to be aware of the Pacifista project, but had only recently learned of its completion, while fighting one of them."}, {"type": "paragraph", "text": "In secret, he is still a member of the Marines, serving as the captain of the special forces unit SWORD."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "Prior to the timeskip, he seemed to be interested in meeting Kaido, having willingly provoked his subordinates in the New World in order to gain the Yonko's attention. He now appears to be subservient under Kaido, as he was standing with Kaido's subordinates. Drake squashed a rebellion led by Caribou (who was posing as Gaburu) on an island affiliated with the Yonko."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Because of Sanji's transgression against the Kyoshiro Family, Drake was one of two people sent to punish him. After Page One failed to kill Sanji, Drake continued with his mission to hunt down Sanji and was relentless in attacking him at Rasetsu Town. Drake recognized Sanji as O-Soba Mask and brought up on how he heard that Sanji is from the Vinsmoke Family, much to Sanji's irritation."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "When he was a member of the Barrels Pirates thirteen years ago, it was said he was the strongest member of the crew."}, {"type": "paragraph", "text": "As a former high-ranking Marine officer, Drake has a deep understanding of the workings of the World Government, and is able to use this knowledge to protect himself from danger and predict the movements of the Marines. He is also aware of the Pacifista and Vegapunk. His considerable knowledge may have contributed to his enormous bounty. He is also quite intelligent, interrupting Killer and Urouge's battle because he knew that it would only draw more unwanted attention."}, {"type": "paragraph", "text": "He is skilled enough that he was capable of interrupting the fight of two other Supernovas with just one move, and has demonstrated physical strength to the degree where he was able to knock aside a \"copy\" of the Shichibukai, Bartholomew Kuma. This is an amazing feat as both Bepo and Sanji nearly injured themselves when they kicked one of the Pacifistas. Despite the fact he was invoking the wrath of Kaido by attacking Scotch and his favorite island, he was able to live through the experience and made a greater name for himself."}, {"type": "paragraph", "text": "As a Headliner in the Beasts Pirates, Drake holds a high position in the crew and has authority over the lower-ranking members, and as a member of the Flying Six, he is among the strongest of the Headliners."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f9/X_Drake_Stops_Killer_and_Urouge%27s_Duel.png/revision/latest/scale-to-width-down/250?cb=20141009015513", "caption": "Drake stopping Killer and Urouge's duel."}]}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "X Drake has immense strength, being considered the strongest member of the Barrels Pirates during his youth, and was strong enough to become a Rear Admiral of the Marines prior to his defection. He could block simultaneous blows from Urouge and Killer, fellow members of the Worst Generation, with little effort and according to Hitetsu, Drake single-handedly defeated the five samurais who guarded Amigasa Village."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "X Drake wields a sword which looks like a rapier and was seen using it with a four-bladed axe. He has been seen to have the sword in his left hand and the axe in his right."}, {"type": "paragraph", "text": "Drake is extremely skilled in wielding his weapons, being able to interrupt Killer and Urouge's fight."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/44/X_Drake%27s_Axe_and_Saber.png/revision/latest/scale-to-width-down/215?cb=20190314195251", "caption": "Drake wielding his axe and saber."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Drake ate the Ryu Ryu no Mi, Model: Allosaurus, an Ancient Zoan-type Devil Fruit that gives Drake the ability to transform into an Allosaurus. In this form, he is strong enough to make a Pacifista bleed by biting its head, despite the cyborgs being made of a stronger material than steel."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Drake has shown that he is capable of using Busoshoku Haki when he easily defeated Caribou, a Logia user."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Early Life", "level": 4, "content": [{"type": "paragraph", "text": "Drake was born to Diez Barrels and an unknown woman. He aspired to be like his father and join the Marines. However, Barrels later became a pirate, and started physically abusing his son. However, Drake remained with his father as he continued to see the past good of the man."}, {"type": "paragraph", "text": "Thirteen years ago, Drake was on Minion Island with the Barrels Pirates waiting for a trade deal of 5,000,000,000 in exchange for the Ope Ope no Mi. During that time, he was said to be a \"brat\" by Barrels. While on Minion Island, he narrowly missed being captured by Doflamingo's Birdcage and ran away from it instead of helping the pirates from Barrels' crew escape. He was later found and taken in by the Marines, who reported it."}], "images": []}, {"title": "Marine and Piracy", "level": 4, "content": [{"type": "paragraph", "text": "After the incident on Minion Island, Drake became a Marine and rose to the rank of Rear Admiral. However, Drake later decided to become captain of a pirate crew. The reason for which he returned to piracy is unknown, although Kizaru did speculate in an off-hand comment that it might have been \"to see what the other side was like\"."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "After a long voyage following one of the Log Pose routes of the Grand Line, Drake and his crew came to the Sabaody Archipelago to prepare themselves for the New World. While there, he noticed two other pirates, Urouge and Killer, fighting each other. Knowing full well what would happen if they caused too much of a scene, Drake stopped their battle and told them to hold it off until they reach the New World. The two fortunately complied with Drake's request. As Drake and his crew walked away from the two pirates, he was momentarily egged on by Trafalgar Law to fight. However, Drake was not swayed by the latter's behavior."}, {"type": "paragraph", "text": "As Drake continued with the rest of his crew around Sabaody, he noticed that there were very few Marines on the mangrove. This puzzled Drake a bit since Sabaody was right next to the Marine Headquarters. However, it did not take long for Drake to figure things out as he received a newspaper with late-breaking news while traversing Grove 24. Written on it, as he told the rest of his crew, was news that Portgas D. Ace, the recently captured second division commander of Whitebeard's crew, was sentenced to public execution. Knowing that Whitebeard would definitely retaliate, Drake figured that the Marines would definitely need all the manpower they could get for the battle that would come hence the shortage of Marines in the mangrove. All these disturbed Drake as he was wondering if the World Government and the Marines were asking for war."}, {"type": "paragraph", "text": "When the news of Luffy's attack of a World Noble spread over the archipelago, Drake ordered his men to prepare the ship for departure immediately, but he also stated an interest as to which of the three admirals would be sent to deal with the situation. After Admiral Kizaru arrived on the island, Drake was forced to attack him to save fellow supernovas Basil Hawkins and Urouge in the midst of dealing with him and one of several Pacifistas invading the island. After Apoo made his surprise attack, he was quickly dispatched by Kizaru, who then took down Drake and Hawkins with little effort."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/90/X_Drake_vs._Pacifista.png/revision/latest/scale-to-width-down/240?cb=20141009015023", "caption": "Drake saving Urouge from a Pacifista."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Despite the confrontation with Kizaru, X Drake and his crew managed to escape capture. He later watched the war at Marineford televised at Sabaody. At the end of the war, the Drake Pirates approached Marineford and watched from a safe distance. Drake commented that with the conclusion of the war, the Marines must also change."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Drake and his crew successfully made it into the New World. They stopped at a winter island and encountered \"Iron Boy\" Scotch, a subordinate of Kaido. Scotch told Drake that the island is a favorite of the Yonko and is under his control. Drake questioned that if he were to attack Scotch, then he would get the attention of Kaido, in which Scotch replied \"yes\". With this confirmed, Drake gladly activated his Devil Fruit and began his attack."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c8/X_Drake_Confronts_Kaido%27s_Subordinates.png/revision/latest/scale-to-width-down/250?cb=20130223000607", "caption": "Drake and his crew confronting one of Kaido's subordinates, \"Iron Boy\" Scotch."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Sometime during the two-year timeskip, X Drake joined Kaido and the Beasts Pirates and became one of the crew's headliners and one of the Flying Six. He assisted in the destruction of Amigasa Village at Wano Country."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Caribou's Kehihihihi in the New World", "level": 4, "content": [{"type": "paragraph", "text": "After Caribou (who was posing as Gaburu) defeated Scotch and destroyed a factory on the same winter island under Kaido's control, Drake (in dinosaur form) appeared and attacked him, his crew, and Gaburu's revolutionaries while they were celebrating. After defeating Caribou, Drake then dragged him away. After Caribou received a meat pie from Gaburu's grandmother, Drake took Caribou away on his ship."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/51/X_Drake_Drags_Caribou_Away.png/revision/latest/scale-to-width-down/182?cb=20140605114326", "caption": "X. Drake dragging Caribou away."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat, Drake read about Luffy and Law's victory from a newspaper. He acknowledged that Doflamingo killed his father but did not hold a grudge."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo along with his pirate crew."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "At the Flower Capital, Drake and Page One were sent to punish a soba shop owner for beating up some of Kyoshiro's men. They were also accompanied by Hawkins as well."}, {"type": "paragraph", "text": "The next day, Drake and Hawkins led a group to raid a bathhouse and look for people with the Kozuki Family's crescent moon symbol on their ankles. Drake came into the bathhouse after hearing about Sanji's presence. Upon seeing Sanji in his Raid Suit, Hawkins and Drake recognized him as Stealth Black. After Sanji and his group escaped the bathhouse, Drake and Hawkins continued with their patrol in the capital."}, {"type": "paragraph", "text": "Drake and Hawkins later stood guard at the prison in the Rasetsu District where Shimotsuki Yasuie‎ was imprisoned and scheduled to be executed. As crowds of people gathered, Drake commented that all the attention and commotion from Komurasaki's funeral shifted to the execution."}, {"type": "paragraph", "text": "When Shogun Kurozumi Orochi tried to kill Toko after executing Yasuie, Drake and Hawkins witnessed Roronoa Zoro and Sanji saving the girl. With Sanji present, Drake transformed into his Zoan form and proceeded to attack him. After Sanji handed Toko to Usopp, Drake slammed Sanji into the ground with his tail when the chef tried to strike back. Drake continued with his attack with Sanji evading and dashing off."}, {"type": "paragraph", "text": "After Hawkins captured Law, Drake told Hawkins to get on with the interrogation."}, {"type": "paragraph", "text": "Later, in an abandoned residence somewhere on the outskirts of Ebisu, Drake spoke with Koby via Den Den Mushi in secret and informed him of the recent events in Wano such as Kaido and Big Mom's alliance and CP-0's arrival."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/SWORD_Infobox.png/revision/latest/scale-to-width-down/180?cb=20190926081807", "caption": "X.Drake informs his subordinate Koby about the events in Wano."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Interrupted the fight between Killer and Urouge", "elements": []}, {"text": "X Drake, Urouge, Scratchmen Apoo and Basil Hawkins vs. Kizaru and a Pacifista", "elements": []}, {"text": "X Drake vs. Scotch", "elements": []}, {"text": "X Drake vs. Caribou Pirates", "elements": []}, {"text": "X Drake vs. Sanji", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "While written as is, the X in his name is meant to be read as diez (as \"X\" is the Roman numeral for \"ten\"), which means \"ten\" in Spanish, and can also be used as a surname."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the line-up of the pirate ships owned by the Eleven Supernovas (excluding Luffy and Zoro's, as well as the Heart Pirate's Submarine) shown in the aftermath of the Battle of Marineford, there is what appears to be a Marine battleship with an inverted color scheme.", "elements": []}, {"text": "Drake shares his name, sideburns, and seiyū with another character. However, this character is non-canon.", "elements": []}, {"text": "The word drake is sometimes synonymous with dragon, especially in Middle English. This befits Drake's Devil Fruit.", "elements": []}, {"text": "Drake is the first person to be revealed to have eaten an Ancient Zoan Devil Fruit, when its concept is first introduced.", "elements": []}, {"text": "He is the only Super Rookie, and also the only member of the Worst Generation, with the powers of a Zoan Devil Fruit.", "elements": []}, {"text": "In One Piece Blue Deep: Characters World, Drake was given a birthday of October 10, when his birthday had already been given as October 24. This makes him one of two characters, along with Viola, to have been given two different birthdays.", "elements": []}, {"text": "X Drake has a revolution-theme. His birthday (October 24th) is a date of the beginning of the October Revolution according to the Julian calendar. His epithet may be a reference to a real-world red flag, an international symbol of socialism and communism.", "elements": []}, {"text": "In the 6th Japanese Fan Poll, X Drake is ranked the 90th most popular character in One Piece.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/bb/Drake_Pirates%27_Ship.png/revision/latest/scale-to-width-down/180?cb=20170121213955", "caption": "A Marine battleship with inverted colors, sailing among the Supernova ships."}]}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Drake's birthday, October 24, is a reference to his surname X, since it is 10 in roman numerals and the 24th letter in the English alphabet.", "elements": []}, {"text": "Drake's name was taken from 16th century English adventurer and privateer, Sir Francis Drake.", "elements": []}, {"text": "Drake's favorite food is rice with chicken, and his least favorite food is eggs.", "elements": []}, {"text": "Drake's hobbies are being a reptile maniac and studying astrophysics.", "elements": []}, {"text": "If Drake was not a pirate, then he would be a zookeeper.", "elements": []}, {"text": "If One Piece was set in the real world, then Drake would be from Turkey.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sir Francis Drake – Wikipedia article on the real life pirate X Drake is named after.", "elements": []}, {"text": "BBC Historic Figures - article about Sir Francis Drake.", "elements": []}]}], "images": []}]}