{"sections": [{"title": "Capone Bege", "level": 1, "content": [{"type": "paragraph", "text": "Capone \"Gang\" Bege is a mafia don-turned-pirate and the captain of the Fire Tank Pirates. He is also one of twelve pirates who are referred to as the \"Worst Generation\". He and his crew came from West Blue, where Bege was one of the heads of the Five Families of the West. During the timeskip, he became a subordinate of Charlotte Linlin and married Charlotte Chiffon. The two have a son named Capone Pez. While working under the Big Mom Pirates, he held a position of a rook-ranked combatant. Bege formed a temporary alliance with the Straw Hat Pirates in order to kill Big Mom. After his plan failed, Bege effectively became an enemy of the Yonko and her crew."}, {"type": "paragraph", "text": "Sometime during the timeskip, his bounty increased from 138,000,000 to 300,000,000. Due to his allegiance and actions, he is the secondary antagonist of the Zou Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bege is a short man with a stocky build whose appearance is somewhat similar to that of a Mafia boss. He sports an oiled-up and slicked-back hairstyle befitting that of a crime don. His facial features have a very stern look to them further accentuated by his rather sharp but hooking beak-like nose. He also has five o'clock stubble on his upper lip."}, {"type": "paragraph", "text": "He wears a black-and-white pinstriped attire, complete with a green scarf around his neck, with the excess tucked inside the suit (making it look like a cravat). Like Crocodile, Bege wears very expensive golden rings with precious stones mounted on them, but because Bege has two hands, all his fingers (including the thumbs) have them. As for his personal effects, he has a pirate captain's coat with red and gold trimming and a fedora hat, both of which he only seems to wear for traveling purposes. He is often seen smoking a cigar, except when eating."}, {"type": "paragraph", "text": "In an SBS Volume 64, Oda drew the Supernovas as children. Bege is shown as a kid with a curlier hair and a shorter and rounder head. He wore a shirt and tie. He was also depicted as playing with guns, knives, and a fortress made of blocks, referencing his Devil Fruit abilities."}, {"type": "paragraph", "text": "After the timeskip, he has a thick goatee and a darker hat. During the Zou Arc, he sported a pair of sunglasses resembling those worn by Pekoms. During the Whole Cake Island Arc, Bege wore a rose on the left breast of his suit. Curiously, in spite of being forty before the timeskip, he seems to have grown to at least Sanji's height as seen from their initial confrontation."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Despite being a notorious pirate, Bege is a refined gentleman of great sophistication. He dresses himself in fine suits, enjoys fine dining even on board his ship at sea, and also has an aesthetic hobby of looking at paintings. He is strongly appalled by things like bad table manners and rudeness. He usually maintains a reserved and calm demeanor. Due to his deep sophistication, Bege is very particular about cleanliness and hygiene as he ordered his men to tell the Straw Hat Pirates to take a bath to clean themselves and even gives them new clothes to dress in as he strongly refuses to even talk to people who are dirty despite having an urgent important meeting for an alliance to assassinate a Yonko. He even goes to the trouble of forcing two of his enemies, Brûlée and Diesel, to clean themselves up and dresses them in clean clothes."}, {"type": "paragraph", "text": "However, he can be very impatient and ill-tempered and is not at all above injuring others, even his own crew, should they provoke his ire even the slightest as shown when he struck a crew member with a fork without so much as an apology. For so long as he is not agitated, he appears to be a pirate who prefers to avoid making a scene whenever as possible in order to not confront enemies that he might view as troublesome, such as Admiral Kizaru,Sanji, Brook, and the Mink Tribe. An example of this is when he was perfectly willing to meet Monkey D. Luffy, but had no qualms with using violence against the latter if he became angered."}, {"type": "paragraph", "text": "Though he may not always be inclined to fight, Bege is a fearless man who will not hesitate to fight someone should it proves beneficial or necessary, regardless of how strong they are. His Devil Fruit plays a large role in that. When he does engage in battle, he tends to just walk into danger on his own, since he can easily summon numerous subordinates at any time and place to fight on his behalf. It also seems to be for this reason that he appears to view his crew as somewhat expendable, made apparent by the fact he did not seem bothered about smoking them out despite their protests."}, {"type": "paragraph", "text": "Bege is extremely sadistic and bloodthirsty. He does not crave power himself, but rather aims to destabilize the factions in power and watch the resulting struggle for power for his own entertainment. Everywhere he goes, he takes out the leaders of the groups opposing him in order to achieve this, only caring for his opponents' treasure and the bloodshed he will see from them later. He even decapitates animals simply to entertain himself. His enjoyment of chaos does not exclude that which is caused by someone other than himself, as seen when he grinned widely at the havoc caused by Luffy's duplicates during Big Mom's Tea Party. When the Whole Cake Chateau was collapsing, Bege hysterically laughed upon the destruction and the Big Mom Pirates falling. In terms of his assassination plans failing, Bege will settle with the chance of humiliating them as it will destabilize the factions in power by ruining their reputation, which succeeded with him, his crew, and the Straw Hat Pirates escaping Totto Land. Even Mont-d'Or wanted to prevent them from escaping as it would ruin the Big Mom Pirates' reputation."}, {"type": "paragraph", "text": "Despite his bloodthirsty nature, Bege does have some degree of mercy and self-control. According to Jinbe, while he slaughtered leaders of powerful organizations, he left their subordinates such as mafia members of the other Four of the Five Great Families or pirate crewmates of infamous pirate captains alone and only viciously retaliated when they attempted revenge. Despite his initial enmity towards Luffy for the trouble he caused at Sabaody Archipelago as well as Luffy attempting to punch him for trying to kill Pekoms, Bege readily forgave Luffy after forming their alliance. When his Big Mom assassination plan started to go wrong, Bege only feigned betraying Luffy to avoid suspicion while secretly whispering to Luffy how their plans have started to fail. In fact, when Katakuri ordered Bege to kill Luffy, Bege outright refused and attacked Katakuri without hesitation to stop him from attacking Luffy."}, {"type": "paragraph", "text": "Bege can be very cunning and pragmatic, not being above taking hostages, bluffing, or shooting people in the back in order to accomplish his goals. Whenever an enemy displays a potential weakness or opening, Bege has no qualms in exploiting it. His plan to assassinate Big Mom involved destroying a photo of Mother Carmel, a precious figure of her past, having observed that she lost her usual incredible toughness while suffering from a mental breakdown caused by the photo being slightly damaged. After he seemingly accepted Oven's demands to surrender for Chiffon's safety, he took a shot at Oven while the latter's guard was down. He also withheld information that his ship can travel on land with tank trends, enabling him to surprise the Big Mom Pirates while retrieving Chiffon and escape Cacao Island. While those moments may indicate that Bege is highly untrustworthy, he is noted by his wife, Chiffon, that he honors his deals and promises. As such, Bege promised to give Caesar's heart back after assassinating Big Mom, and even though the plan failed, Bege did kept his word and gave back the scientist's heart, showing his upholds his deals even if his plans fail."}, {"type": "paragraph", "text": "He is also shown to be an opportunist, as he insisted on putting poison or planting explosives inside the substitute wedding cake as a second chance to kill Big Mom until Sanji convinced him otherwise. Because of this, Bege seems to show a boastful side, bragging to the Straw Hats that he is also one of the pirates of the Worst Generation like Luffy. Also, in contrast of his disinterest in fame, Bege holds his strategic plans in high regards and has the upmost faith in his tactical wit, and although he never brags about the success in his assassination plots or how well-thought out he puts them, he was displeased upon reading an article that claims Luffy to be the mastermind behind Big Mom's failed assassination plot."}, {"type": "paragraph", "text": "After the timeskip, he and his crew became subordinates of the Big Mom Pirates. Rather than take on someone as powerful as Big Mom in direct combat, Bege submitted himself to her in order to gain opportunities to take her down. There, he sought to ensure that the wedding between Sanji and Pudding happened so that he could assassinate Big Mom. He was willing to silence members of the Big Mom Pirates such as Pekoms in order to ensure the success of his plot."}, {"type": "paragraph", "text": "When he became a father and husband, Bege seems to have lessened his cruel and ruthless behavior to some extent, as he became somewhat more kinder and caring towards those who work under him. He is also not above acting foolish for his son, as Bege displayed a silly side in front of Pez in order to make him laugh. Bege can also show appreciation towards his subordinates or outsiders that he has no hostile relationships with. Bege praised the Straw Hats for bringing Brûlée as her powers can be exploited to further improve their chances of escape after assassinating Big Mom. Still, he doesn't like to be thought as a good person, finding disgust at the idea of people feeling grateful to him."}, {"type": "paragraph", "text": "Bege outwardly considers empathy towards others to be weakness and cowardliness, unbefitting of pirates. This is most evident when he shot Pekoms in the back after the latter was willing to show mercy to the Straw Hat Pirates in thanks for saving the minks. However, he has shown to deeply care for his family and crew, being willing to risk his own life against Big Mom if it meant protecting the few people that are close to him. When Oven captured Chiffon and used her as a hostage, Bege went to rescue her without hesitation even when his ship was being surrounded by Big Mom's fleet and refused to abandon her when Chiffon begged him to."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Charlotte Chiffon", "level": 4, "content": [{"type": "paragraph", "text": "Bege married Charlotte Chiffon to seal his alliance with Big Mom. The two are happily married, and Chiffon cares about Bege as she prevented Gotti from harming Sanji in order to protect Bege from her mother's wrath. Chiffon supported Bege's plan to assassinate her mother, declaring that Bege and Pez are the only family she'll ever need. When Bege (while in his Big Father form) came under attack by a furious Big Mom, Chiffon worried greatly for her husband's well-being and quickly came to his defense by pleading for her mother to spare Bege, though this proved to be a useless gesture. As Big Mom was attacking him, Bege showed that he deeply cares about Chiffon as he called her his beloved wife whom he refuses to allow to die. When Chiffon agreed to go with Pudding in order to save the Straw Hats from the rampaging Big Mom, Bege showed objection to Chiffon's decision, worried for her safety. After Bege and his crew escaped Whole Cake Island, he ordered his crew to head toward Cacao Island to get his wife. When Oven was holding Chiffon hostage, Bege went to rescue her without a second thought and refused to abandon her when Chiffon told him to do so. Upon their reunion, Bege and Chiffon happily embraced each other."}, {"type": "paragraph", "text": "Bege is willing to obey Chiffon's request to deliver the substitute wedding cake to Funwari Island despite the danger of being chased by Big Mom."}], "images": []}, {"title": "Capone Pez", "level": 4, "content": [{"type": "paragraph", "text": "Pez is Bege and Chiffon's only son, and Bege loves him very much, being willing to make silly faces to make him laugh. He hopes for Pez to grow into a great leader like himself and hold up their family name. Bege is also very open in showing his love for his son as when Pez woke up crying during Bege's explanation of his assassination plans for Big Mom, Bege apologized to his son in a very silly and affectionate manner in front of the Straw Hats, to the point of even playfully mispronouncing his speech. Due to his fatherly love for Pez, Bege was silently angered and irritated when Caesar threatened to kill Pez if Bege goes back on his promise in setting the scientist free after assassinating Big Mom. While facing the threat of the Big Mom Pirates after his assassination attempt on Big Mom failed, Bege showed his resolve to protect his family, including his son."}], "images": []}, {"title": "Fire Tank Pirates", "level": 3, "content": [{"type": "paragraph", "text": "All the members of the Fire Tank Pirates were originally gangsters of an enormous mafia lead by Bege as one of the Five Families of the West. After Bege set sailed for the seas as a pirate, they followed him as his crew mates, showing strong loyalty to their leader. Bege's men generally address him as \"Father\" similarly to the way that Mafia members address their high ranking leader as \"Godfather\". However, despite their loyalty, Bege sees his crew mates as somewhat expendable, as he stabbed one with a fork for telling him \"No\", and continued to smoke heavily despite his subordinates being inside him. While he can be ruthless to his own men for disobedience, Bege does hold strong appreciation and gratitude towards his subordinates. When some of his crew mates went into disguise to block off communication and exits in preparation for his plans to assassinate Big Mom, Bege thanked them and praised them for the good job they have done."}, {"type": "paragraph", "text": "While Big Mom was attacking him in his Big Father form, Bege declared his absolute refusal to allow his precious crew to die as they broke out in tears, being touched by his words."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/62/Fire_Tank_Pirates_Charging.png/revision/latest/scale-to-width-down/180?cb=20170302090716", "caption": "The Fire Tank Pirates defending Bege."}]}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Jewelry Bonney", "level": 4, "content": [{"type": "paragraph", "text": "Although they only just met in a restaurant in Sabaody Archipelago, the two super rookies had a poor relationship, as Bege saw Bonney's poor table manners to be spoiling the food he was eating. He even asked one of his men to deal with her and then stabbed his subordinate when he refused to cause a scene."}], "images": []}, {"title": "Pekoms", "level": 4, "content": [{"type": "paragraph", "text": "Despite being allies, Bege had no problem in shooting Pekoms in the back for being willing to fail his mission due to his own personal feelings, something that Bege thought as pathetic coming from an infamous pirate such as Pekoms. Bege also did not hesitate to leave Pekoms behind after being confronted by Nekomamushi. After Pekoms returned to Totto Land, Bege abducted him and offered him to join the Fire Tank Pirates in their plot to assassinate Big Mom. Pekoms strongly refused and mocked Bege for his foolish intentions. To silence him, Bege ruthlessly shot Pekoms off a cliff into shark infested waters."}], "images": []}, {"title": "West Blue Underworld", "level": 4, "content": [{"type": "paragraph", "text": "Bege has countless enemies among the criminal underworld in the West Blue, thanks to his habit of murdering the leaders of rival mafias and other criminal organizations in order to enjoy the bloody power struggles that followed. When these enemies tried attacking Bege in revenge, Bege would mock their attempts by amusingly laughing out loud while attacking them with his fortress."}], "images": []}, {"title": "Big Mom Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After becoming a subordinate of Big Mom, Bege carried out her orders to the letter and would eliminate anyone, even a fellow member of the Big Mom Pirates, who prevent the orders from being executed to the fullest. Bege married the twenty-second daughter of the family and produced a son, making him a member of the Charlotte Family. However, his loyalties to Big Mom is in reality a ruse as Bege joined the Big Mom Pirates simply to find a chance to assassinate the Yonko herself. Brûlée was furious at Bege's plan especially when he voiced intentions to use her abilities in their plot while thinking of a way to inform Big Mom. At the ceremony, he took note of Katakuri's power and reputation before labeling him as one of the main threats to his plan."}, {"type": "paragraph", "text": "Due to needing time for his plan to be a success, Bege passed off pinning down Luffy as a way to maintain his cover. However, after he witnessed Katakuri becoming pale from seeing a terrible future, Bege refused to comply with his order to kill Luffy and revealed his true nature. Bege aided Luffy in showing Big Mom the destroyed portrait of Carmel and tried to keep Katakuri at bay as the latter and several members of the Big Mom Pirates realized his treachery. After Luffy showed Big Mom the portrait and she screamed, Bege prepared to assassinate the weakened Big Mom alongside Vito and Gotti."}, {"type": "paragraph", "text": "When his assassination attempt failed, the Big Mom Pirates were given earplugs by Katakuri and moved into surrounding Bege and his allies, forcing them to retreat into his giant fortress. While inside his castle, Bege tried to kill Big Mom while she was still weakened but Perospero and Katakuri foiled his efforts while preventing him from escaping. Surrounded with nowhere to run, Bege was soon attacked by Big Mom after she regained her senses and became enraged at his betrayal. While demanding that he show himself with his allies, Big Mom relentlessly damaged the castle and (by extension) Bege."}, {"type": "paragraph", "text": "While Bege attempted to flee with Caesar's help, the Big Mom Pirates continuously hindered their escape and successfully routed Bege and his allies before the Tamatebako caused the chateau to collapse. After Bege and his allies escaped the castle, the Big Mom Pirates immediately planned to pursue their enemies, including Bege and his crew. Bege for his part, was satisfied with the destruction of the chateau and the chance to humiliate the Big Mom Pirates despite the failure of his assassination plot."}, {"type": "paragraph", "text": "After Charlotte Oven captured his wife and used her as a hostage to force Bege to surrender, Bege shot Oven in the face for harming her and expressed pride in the act even though his ship was surrounded."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Bege despised Luffy and his crew for the trouble they caused him on the Sabaody Archipelago. During the Zou Arc, he took part in the mission to capture Caesar Clown and bring Sanji to Big Mom's Tea Party for him to be married. He ruthlessly executed his mission, despite Pekoms' differing opinions, and chained up the Straw Hats (minus Sanji, whom he had to treat with care) in his own body. Bege displayed his Devil Fruit superiority to the Straw Hats transforming the room into weapons and sank Nami in the floor to threaten Sanji into giving up any hope of escaping. When Sanji freed his crewmates, Bege was angered at this but was unable to go after them due to his mission of returning with Sanji and Nekomamushi's presence. Despite these past conflicts, Bege seems to be willing to ally with the Straw Hats in order to achieve their common goal of defeating Big Mom, if only because it was the most logical choice. However, he did promise to kill Luffy should the latter prove to be disagreeable in their negotiations."}, {"type": "paragraph", "text": "When Luffy and Bege met, their negotiations were a bit rocky as Luffy immediately wanted to punch Bege for hurting Pekoms and Bege dared him to try as Gotti and other members of the Fire Tank Pirates tried to stop Luffy. However, the two found common ground once Jinbe pointed out they both had something to gain from defeating Big Mom. They reluctantly formed an alliance and began making plans to overthrow their shared enemy. Luffy even agreed to be the bait in Bege's plan of assassinating Big Mom as he found the plan to be interesting. On the day of the wedding, Bege was annoyed to find them sleeping when they were supposed to be preparing for the plan and even threatened to leave them behind if they slow him down."}, {"type": "paragraph", "text": "Despite their multiple grievances with one another, and even in light of their assassination plan failing, the two still treated each other as allies. Bege refused to turn on Luffy despite receiving orders to do so and later provided a safe place for the Straw Hats inside of his Big Father form. Luffy in turn showed great concern for Bege as he endured Big Mom's onslaught, choosing to help back him up against Big Mom and defying orders not to engage the enemy."}, {"type": "paragraph", "text": "After successfully escaping the Whole Cake Chateau, Bege parted with the Straw Hats on good terms. After risking his life luring Big Mom away from the Straw Hats with the wedding cake, Bege commented that he would not forgive the Straw Hats if they died. After both of their crews escaped Totto Land, Bege was annoyed that Luffy was named as the mastermind of his assassination plan."}], "images": []}, {"title": "Sanji", "level": 4, "content": [{"type": "paragraph", "text": "Initially, Bege was antagonistic towards Sanji, forcing him to comply with Big Mom's invitation to the chef's arranged marriage to Charlotte Pudding. When meeting with the Straw Hats at his hideout to discuss forming an alliance, Bege mentioned that he contemplated on killing them only for Sanji to casually point out that Bege would ruin his chance to assassinate Big Mom if he did so. Thanks to Bege's assassination plot, Sanji was able to rescue his family from Big Mom's treachery. After he helped Sanji transport the substitute wedding cake out of Cacao Island, Bege stubbornly insisted on sabotaging the cake, which goes against Sanji's code as a chef. Bege was at first skeptical of Sanji's plan to use his special ingredient until the chef fed Bege the Simsim cream, causing him to relent. Bege has developed a strong respect for Sanji as he promised not to sabotage the wedding cake until Big Mom's cravings are satisfied."}], "images": []}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Bege seems to respect Jinbe enough to agree to the meeting he proposed between Bege's crew and the Straw Hat Pirates regarding his plans to take down Big Mom. He also believes that Jinbe is not the type of man who would joke about serious issues and would act by his words about Luffy coming to the meeting. At the negotiations, it was Jinbe who broke up the brawl between the Straw Hat and Fire Tank Pirates by reminding them that they share a common enemy in Big Mom. When Katakuri questioned Luffy on how he knew of the significance of Carmel's portrait, Jinbe protected Bege by claiming to be the one who told Luffy about the portrait."}], "images": []}, {"title": "Caesar Clown", "level": 4, "content": [{"type": "paragraph", "text": "Due to Bege and the Big Mom Pirates being tasked with retrieving him, Caesar was very afraid to see him on Zou. Bege forced Caesar into surrendering with a false threat and the scientist was very scared at the thought of being turned over to Big Mom. On Whole Cake Island, Bege was given Caesar's heart, which he used to place the scientist under his control in order to use his power to assassinate Big Mom. Though Caesar was reluctant over continued service, he took up the offer after Bege promised to let him go free following the plan's success. However, Caesar threatened the life of Bege's son if he went back on the deal while Bege considered the scientist as a nuisance and disrespectfully referred to Caesar as an \"idiot\" to the latter's annoyance."}, {"type": "paragraph", "text": "On the day of the plan, Bege made it clear to Caesar that there would be repercussions if he double-crosses him as Caesar vehemently stated he would not go back on his word since Bege had his heart. After the assassination attempt on Big Mom failed, Bege used Caesar as a means to escape, despite the latter's protests. After successfully escaping the Whole Cake Chateau, Bege gave Caesar his heart back and set him free."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As captain of his crew and leader of one of the Five Families of the West, Bege has authority over all those under him. He also had great influence and power over the Underworld operations in the West Blue. As a rook combatant within the Big Mom Pirates, he was given the responsibility of being in charge of the Tea Party's security."}, {"type": "paragraph", "text": "Bege has an excellent awareness of his surroundings. After taking Nami and Chopper hostage while bargaining with Sanji and Brook at Zou, he knew that Caesar was hiding nearby, while Sanji and Brook were completely unaware of the presence of the three."}, {"type": "paragraph", "text": "In addition, Bege has a strong will since he did not lose consciousness when Big Mom released a wave of Haoshoku Haki upon focusing on the broken picture of Mother Carmel, an event which caused many of the people present to faint."}], "images": []}, {"title": "Tactical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Bege is a masterful strategist who uses tactics and trickery, rather than direct physical force in battle. Contrary to his fellow pirates of the Worst Generation, who defeat their enemies with immense fighting power, Bege could defeat even infamous pirate captains of the Grand Line with his tactical genius alone. He is a deceptive master of bluffing, as he was able to easily coerce Caesar Clown, a highly crafty and manipulative expert liar in his own right, into surrendering himself with effective death threats. He's also very adept at planning and performing ambushes and surprise attacks, as well as assassinations. Even before he became a pirate; as a Mafia don, Bege could ruthlessly and effectively eliminate all his rival mafias from their leaders to their vengeful subordinates and hired assassins with tactical ingenuity. After becoming a pirate, his tactical skills and ruthlessness only helped further his pirate career and power his way through the dangerous seas of the Grand Line, to the point where he became infamously known for his success in planning and executing assassinations. In fact, he noted that his failure to assassinate Big Mom was the first plan that ever failed."}, {"type": "paragraph", "text": "To match his tactical prowess, Bege is extremely observant, able to detect potential weakness in powerful enemies and made strategies to exploit their specific weakness. During the Mother Carmel photo incident, Bege was able to perceive how Big Mom's body completely lost its tremendous resilience after someone accidentally dropped the photo of Mother Carmel. Bege even managed to estimate the time gap between dropping the photo and when Big Mom's tantrum started. Bege has incredible understanding of psychological warfare, as he could tell that his assassination plans could still succeed by seeing Katakuri's fearful expression, which Bege correctly deduced that he foresaw a horrifying future."}, {"type": "paragraph", "text": "Bege could also give code names to certain crucial objects such as ear plugs, which he referred to as the Invisible Symphonia System. This allows him to give commands to allies to use it without his plans being foreseen by enemies as shown when Bege immediately ordered the Straw Hat Pirates to put on ear plugs by calling it by the given code name while the surrounding Big Mom Pirates were utterly confused by his words. His main strategy is to use his Devil Fruit abilities to launch ambushes and surprise attacks, which allowed him to swiftly defeat an unsuspecting Pekoms."}, {"type": "paragraph", "text": "Bege can think extremely quickly even in dire times of extreme danger, allowing him to come up with improvised maneuvers and tactics should those he executed initially fail to meet the expected result, as seen when he was quick to devise a getaway tactic to his crew, family, and allies after his \"Big Father\" form was cornered by the Big Mom Pirates. He has a cunning talent for being well prepared in times of unexpected dangers, having kept the Nostra Castello's function to travel on land with tank treads a secret from the Big Mom Pirates, which later allowed the Fire Tank Pirates to rescue Chiffon and escape from Oven without much difficulty."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Bege is physically fit. After his plan to assassinate Big Mom failed, he could run at great speed to get away from the Big Mom Pirates who were after them. He also has a strong tolerance to pain, as he could withstand having his body in his Big Father Form being smashed apart by Big Mom while calmly thinking up of a getaway tactic. Shortly after escaping the Whole Cake Chateau, Bege recovered enough to quickly flee despite some bleeding."}, {"type": "paragraph", "text": "He has considerable strength for his stocky physique able to lift up and carry Chiffon a large woman in his arms without tiring."}], "images": []}, {"title": "Marksmanship", "level": 3, "content": [{"type": "paragraph", "text": "Bege is an extraordinary master in marksmanship. With a Tommy gun, Bege could land multiple accurate shots on Katakuri, which caught him off-guard, which is an extremely notable feat as the latter is an extremely skilled master of Kenbunshoku Haki who could see slightly ahead into the future. Due to his Devil Fruit and the cannons and various firearms he houses in his body, Bege's marksmanship skills are further enhanced, giving him and his crew the option and ability to fire cannons and other artillery from within his own body from mid to close ranges in the form of ambushes, as shown from his encounter with the marines at Sabaody, as well as his attack on Pekoms in Zou. From an extremely far distance, Bege managed to fire a shot at Charlotte Oven with pinpoint precision from his ship at sea without hurting Chiffon."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Bege ate the Shiro Shiro no Mi, a Paramecia-type Devil Fruit which allows him to create and maintain a dimensional fortress inside his body. He can house a massive force of subordinates within his body, as well as horses and cannons. He manifests these objects outside his body by first manifesting ports and drawbridges on his person through which his \"troops\" could come out."}, {"type": "paragraph", "text": "His insides also appear to that of a literal fortress, featuring stone brick rooms as well as drawbridges that can open and close, again putting into question whether Bege creates them at will or that his body truly does function like a fortress and has people run around his body at all times. When the objects and people within him reach a certain distance away from his body, shown by a pinkish (seemingly invisible) layer of an unknown aura centered on Bege's location, they revert to full size as well as their real speed, resulting in large cannon volleys and cavalry seemingly popping out of nowhere from one man."}, {"type": "paragraph", "text": "He could also transform into a gigantic fortress shaped golem with immense defensive power."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Capone_Bege%27s_Ability.gif/revision/latest?cb=20120815065746", "caption": "Bege reveals the fortress features of his body."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Bege's internal body contains several cannons which his subordinates can use in order to fire at nearby targets outside their captain's fortress body."}, {"type": "paragraph", "text": "Bege has a spear made of Seastone which he had one of his subordinates use in order to restrain Caesar Clown."}, {"type": "paragraph", "text": "When Bege shot Pekoms on Whole Cake Island, he wielded a flintlock. For use in assassinating the Vinsmoke Family, he and other members of the Big Mom Pirates were given Walkers. As he betrayed the Big Mom Pirates, Bege pulled out a Tommy gun."}, {"type": "paragraph", "text": "When Big Mom started her strange scream, Bege used a KX Launcher in his attempt to assassinate Big Mom."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Bege grew up in the West Blue, where he became the boss of one of its Five Families of the West. He quickly became infamous due to quickly bringing down rival mafias by going directly for their bosses. However, he only stole money and precious items from the mafias he brought down, being content to watch the struggle for power that would ensue afterwards without gaining any power of his own. Bege accumulated many enemies, but managed to repel all of them with his Devil Fruit powers. He finally grew bored with his dominance and sailed to the Grand Line as a pirate. However, his methods did not change, as he targeted renowned pirate captains while leaving their crews intact."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a9/Bege%27s_Younger_Days.png/revision/latest/scale-to-width-down/210?cb=20180218043654", "caption": "Bege taking out the boss of a rival mafia in West Blue."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Like the other Supernovas, he entered the Sabaody Archipelago after having traversed one of the Grand Line's seven initial paths. He entered a restaurant in Grove 24 and ate while watching Jewelry Bonney's gluttony, disgusted by her lack of manners. Because this was spoiling his meal, Bege ordered his men to shut her up. One of them objected, warning him that they should not cause an incident that would draw the attention of the Marine Headquarters. In response, Bege attacked him with his fork."}, {"type": "paragraph", "text": "He then witnessed Roronoa Zoro walking in the path of a World Noble, nearly causing the call for an Admiral to the archipelago, if not for the intervention of Bonney. He also noted that even if the Straw Hat Pirates were as crazy as rumors would have it, Zoro was truly insane for drawing his blade against a World Noble."}, {"type": "paragraph", "text": "He then read the latest news that Portgas D. Ace, Whitebeard's second division commander was to be executed in public, much to his shock as most other Supernovas did."}, {"type": "paragraph", "text": "When he heard how Luffy attacked a World Noble, he ordered his crew to set sail for Fish-Man Island immediately, saying he did not wish to deal with a Marine Admiral. However, he was later surrounded by a horde of Marine soldiers all by himself, but he calmly told them that they have already lost in sheer military force, backing it up by calling forth what was essentially a small army from his body, as well as firing small cannons (which expanded into regular sized cannonballs)."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He watched Ace's execution, which was being broadcasted at Sabaody, meaning that he managed to escape capture by the Marines. When people started to wonder if Whitebeard truly sold out his allies after the broadcast was cut off, Bege remarked that Whitebeard did not become a legend by doing such things."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war ended, he commented that, in an instant, Whitebeard's territorial waters were transformed into a sea of blood, implying that his territories lost their protection and it was only a matter of time before chaos ensues."}, {"type": "paragraph", "text": "Later, while in the New World, he was eating in his ship when it was apparently drawn toward an incredibly large, black object in the sky above him. As the ship shook violently, Bege complained to his crew to steer better. He and his crew screamed out in terror, but could do nothing as they drew nearer to the object."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/78/Capone_Bege_in_the_New_World.png/revision/latest/scale-to-width-down/200?cb=20130622014655", "caption": "Bege's ship is lifted upwards."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "At some point, Bege and his crew wandered into Big Mom's territory and were defeated. Unlike the other Supernova-led crews who had tried to challenge her authority, the Fire Tank Pirates chose to ally with her, and Bege decided to join her family by accepting one of her daughters as his wife. They then became subordinates of the Yonko. To officially seal the alliance, Bege married Big Mom's 22nd daughter, Charlotte Chiffon. The two later had a son named Capone Pez."}, {"type": "paragraph", "text": "During one of Big Mom's tea parties, the photo of Mother Carmel dropped on the floor. Big Mom responded by giving out a giant shriek that incapacitated everyone in her vicinity. During that moment, Bege noticed that Big Mom scraped her knees and bled."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Bege and his crew accompanied the Big Mom Pirates while they chased the Thousand Sunny in the pursuit of Caesar Clown. Much to his and the Big Mom Pirates' shock, the Thousand Sunny group was able to fight back and escape their clutches."}, {"type": "paragraph", "text": "After the downfall of the Donquixote Pirates, Bege acknowledged Doflamingo's defeat and stated his intention to capture Caesar."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Bege and Pekoms arrived on Zou eight days later with the intention of capturing Caesar and bringing Sanji to Big Mom's Tea Party. However, when Pekoms discovered that his homeland had been destroyed and the Straw Hats had saved it, he agreed to spare the Straw Hats in gratitude. However, Bege got annoyed that Pekoms was letting his emotions overrule their mission and used his Devil Fruit powers to shoot the mink in the back."}, {"type": "paragraph", "text": "Bege sent his men out of his body and they captured Sanji's group and Caesar. He took the chained pirates inside his body and gave them an invitation to Big Mom's wedding tea party, at which her 35th daughter, Pudding, would marry Sanji, the third son of the Vinsmoke Family."}, {"type": "paragraph", "text": "A shocked Sanji dropped his cigarette on the ground, and Bege quickly stamped it out. Sanji refused to attend the wedding, but Bege said he did not have a choice as he manipulated his fortress to threaten the Straw Hats, saying that Big Mom's will would be done as his real body moved away from Zou. Eventually, Sanji asked for a paper to write a note to his crew, but he used the opportunity to eject his crewmates from Bege's body. Before Bege and his men could act, Sanji held Caesar hostage, and Bege noticed Nekomamushi standing behind him. Nekomamushi asked what had happened to Pekoms, and Bege fled Zou with Sanji and Caesar in tow."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/59/Bege_Shoots_Pekoms.png/revision/latest/scale-to-width-down/210?cb=20161120004425", "caption": "Bege shoots Pekoms."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4e/Nekomamushi_Confronts_Bege.png/revision/latest/scale-to-width-down/210?cb=20161120010628", "caption": "Nekomamushi confronts Bege after discovering an injured Pekoms."}]}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "By this time, Bege had achieved the rank of \"Rook\" within the Big Mom Pirates and was put in charge of security for the upcoming Tea Party. Bege then plotted to take down Big Mom during the tea party, with no one standing in his way."}, {"type": "paragraph", "text": "The Fire Tank Pirates later abducted Pekoms while he was with the Sanji Retrieval Team. Bege offered Pekoms the chance to be an accomplice in his scheme, but Pekoms refused. To prevent him from talking, Bege took Pekoms to Whole Cake Island and tied him in chains, placing the lion mink on the edge of a cliff while he, his family, and his crew surrounded him. Bege's son Pez started crying, so he made him laugh with a silly face, voicing high hopes that he would grow up to be a splendid gang leader like him. When Pekoms responded by gagging, Bege savored the irony of a life about to end watching a life that just began. Bege also revealed he left him for dead on Zou to give him a way out of the crime world, and that the execution Pekoms now faced was his own fault for continuing to obstruct Big Mom. Noting those with compassion and empathy in their line of work were doomed to fail, Bege claimed that he was never cut out for this world and then asked him for any last words. Right after Pekoms warned him that underestimating Big Mom would be his downfall, Bege drew his gun while his son cried again and shot Pekoms, causing the mink to fall into the shark-infested waters below."}, {"type": "paragraph", "text": "Sometime later, Bege took over guarding Caesar's new laboratory, and offered the scientist freedom in exchange for his abilities. He then took Caesar to his crew's base."}, {"type": "paragraph", "text": "On the day of the tea party, at his crew's hideout, Bege received a call from Jinbe to set up a meeting between him and Luffy. Bege was willing to meet Luffy due to them sharing a common goal, but was willing to take out his fellow Supernova if he showed a bad attitude. The Sanji Retrieval Team came to the Fire Tank Pirates' base, and Bege forced them to clean themselves before they met. Three hours and twenty minutes before the wedding, the Fire Tank Pirates met with the Straw Hats, but Luffy immediately tried to punch Bege for shooting Pekoms. Bege's crew erupted, and Bege was fine with letting Gotti attack Luffy. However, Jinbe quickly stopped the conflict by reminding everyone that they shared a common enemy in Big Mom."}, {"type": "paragraph", "text": "While explaining his assassination plan, Bege also recounted on how he discovered a weakness they could exploit. Bege then went over the conditions that must be met in order for the plan to succeed. Once he finished going over the plan in detail, the meeting adjourned. Bege, Luffy, and Caesar agreed that their alliance would come to an end once Big Mom was dead and all groups had made their escape. After the meeting, Luffy asked Bege to place a mirror inside the wedding cake."}, {"type": "paragraph", "text": "As the guests arrived at the Whole Cake Chateau, Bege and his crew acted as security for the venue. When Jigra attempted to force his way into the venue, Bege witnessed his downfall at the hands of Charlotte Katakuri. Bege then became anxious, noting that Katakuri's mastery over Kenbunshoku Haki could pose a serious problem to his assassination plan. After the tea party began, Bege was informed by two of his men that all routes to the wedding venue were blocked and all communications were jammed. Bege then had Caesar exit his body and reviewed the escape plan with him. After having Gotti silence the door homie nearby, Bege checked on Luffy and his group hiding inside his body and was shocked to see them sleeping. Jinbe assured Bege that he would wake them up before the operation began. Bege then walked into the wedding hall himself, preparing to carry out his plan. When Sanji and Pudding made their entrance, Bege was surprised by Sanji's lovestruck expression on his face, thinking it was good acting."}, {"type": "paragraph", "text": "At the beginning of the ceremony, Katakuri had a brief vision of Pudding and noticed that something was wrong, and Bege began to sweat as he realized that Katakuri had seen slightly into the future. After duplicates of Luffy emerged from the wedding cake, Bege grinned at the chaos Luffy was causing. He was then utterly shocked when the real Luffy identified himself. As Luffy prepared to attack the photo of Carmel, Bege informed Vito and Gotti to prepare their KX Launchers. However, when Katakuri stopped Luffy from destroying the photo, Bege feared that the plan went awry. Bege then stood silent when Jinbe claimed to be the one who informed Luffy of the photo's significance."}, {"type": "paragraph", "text": "After Brook destroyed the picture of Carmel, Big Mom did not start screaming as Bege originally planned. He then pretended to pin Luffy down to avoid suspicion. When Brook's head rolled over to them, he whispered to Luffy that Big Mom was in a state of confusion on what to be mad about and their best chance was to show her the broken photo of Carmel again, Bege questioned if there is any point with the plan. When they were approached by Katakuri, Bege noticed that he foresaw a horrific future and became confident again that the plan will work out. He then told the alliance members to put on their earplugs. Katakuri ordered Bege to kill Luffy, but Bege refused before commenting that while Katakuri could see a bit into the future, everyone has the power to change it."}, {"type": "paragraph", "text": "As Luffy prepared to show Carmel's broken portrait to Big Mom again, Bege tried to hold Katakuri back by shooting him, but his shots had no effect due to his special Paramecia intangibility. However, despite Katakuri's efforts, Luffy successfully showed the broken picture to Big Mom, causing her to start screaming. When Bege saw that Big Mom scraped her knees like before, Vito and Gotti exited his body and they all aimed their KX Launchers at her."}, {"type": "paragraph", "text": "Bege and his two companions then fired their KX Launchers. However, Big Mom's scream caused the rockets to detonate before they reached her, shocking Bege and his allies. With the assassination attempt failed, Bege and his alliance tried to escape through the mirror Caesar brought into the venue only for Big Mom's scream to shatter it. With nowhere to run, Bege then transformed into a giant fortress and told the alliance members to enter."}, {"type": "paragraph", "text": "As his allies retreated into his fortress, Bege tried using his cannons to attack Big Mom, but Perospero shielded Big Mom from the attack with Candy Wall. Katakuri then clogged his cannons with mochi while Perospero immobilized Bege's fortress with candy. After all of his allies and the Vinsmoke Family were secured inside the fortress, Bege went on to explain to his allies about the dire situation they were in. He also explained that if his fortress was destroyed, he would die as well and all those inside would be thrown out. Big Mom then returned to her senses and began attacking the fortress, enraged at Bege's treachery. Bege bled as his fortress sustained damage."}, {"type": "paragraph", "text": "As Big Mom continued her onslaught, Bege decided to try turning back into human form and having Caesar fly him away from the venue. Caesar heavily disagreed, and the two argued, before the Vinsmoke Family decided to fight Big Mom in order to provide an opening for them to escape. Bege then squeezed Caesar's heart to get him to go with the plan, and he turned back into his human form as Caesar flew him away from the venue."}, {"type": "paragraph", "text": "As Caesar fled with Bege, Perospero blocked their path with a candy wall. Ichiji, Niji, and Yonji combined their attacks to destroy the candy wall, allowing Caesar and Bege to path through. When they were close to escaping the venue, Katakuri stood in their way, but Ichiji attacked the Sweet Commander, enabling them to continue. However, their escape was hindered once again by Brûlée, who was eager to pay the alliance back for using her. They then found themselves in a seemingly hopeless situation when they saw that Luffy, Sanji, and the Vinsmoke Family were overwhelmed. However, the Tamatebako dropped to the base of the Whole Cake Chateau and the bomb inside the chest exploded, causing the castle to topple over."}, {"type": "paragraph", "text": "In mid fall Bege watched with joy as the castle collapsed, believing that it would finish off the Big Mom Pirates. Having escaped Big Mom's clutches, Caesar carried Bege far away from the falling castle and rendezvous with the Sanji Retrieval Team at the northwestern part of Whole Cake Island. There, Bege decided to end his alliance with the Straw Hats and gave Caesar his heart back. After he was informed that the Big Mom Pirates survived because the castle turned into a cake, Bege knew that it was Streusen's doing, but was openly satisfied for at least humiliating the Big Mom Pirates despite the failure of their assassination plan. After telling the Straw Hats to leave as quickly as possible, Bege fled the scene with his crew."}, {"type": "paragraph", "text": "Bege and his crew were later pursued by Tart Tanks, but Bege was confident that they would not be captured since they were almost at the coast. He was then surprised when Pudding appeared. Bege then warned her that he would not show her any mercy, but Pudding requested to speak with Chiffon. After Pudding told Chiffon that she wanted to save Sanji and his friends, Chiffon willingly left with her. Bege objected to this, showing concern for his wife. Before departing with Pudding, Chiffon reminded Bege of how she felt obligated to help the Straw Hats. As she left, she asked Bege to take care of Pez if anything should happen to her. The Fire Tank Pirates returned to their ship and fled Whole Cake Island. Out at sea, Bege commented on how convenient it was to have no pursuers before ordering his crew to head for Cacao Island so he could pick up Chiffon."}, {"type": "paragraph", "text": "As the crew reached the front of the harbor of Cacao Island, they were besieged by Tarteships. Bege was then contacted by Oven, who was holding Chiffon as a hostage to force Bege to surrender. Despite Chiffon's protests, Bege said that he would agree to Oven's demands. However, upon nearing the harbor, Bege shot Oven in the face and freed Chiffon. Bege then surprised Oven and his forces when he piloted the Nostra Castello onto Cacao Island, revealing that the ship can travel across land with tank treads. Sanji then used a kick to lift the carriage holding Chiffon's group and the cake onto the deck of Bege's ship. Having Chiffon back, the Fire Tank Pirates returned to the sea. Oven tried preventing their escape by boiling the sea, but he was thwarted by Pound, enabling the Nostra Castello to sail away from Cacao Island."}, {"type": "paragraph", "text": "On the way to the Thousand Sunny, Bege and Sanji had an argument about what to do with the cake with Bege insisting that they poison it or add explosives. Sanji then fed Bege his special ingredient, causing him to briefly faint with bliss. After Bege regained consciousness, Sanji told him that he may attempt to assassinate Big Mom after she ate the cake. When the chefs finally completed the cake, Bege cheered for their success. As they approached the Thousand Sunny, Bege promised Sanji that he would not tamper with the cake before feeding it to Big Mom. After Sanji and Pudding left the ship and head for the Sunny, Bege contacted Perospero via Den Den Mushi and informed him that he would feed the cake to Big Mom. With Big Mom's attention drawn towards them, Bege and his crew headed for Liqueur Island."}, {"type": "paragraph", "text": "As they were getting close to Liqueur Island, they planned on dropping the cake there. However, Chiffon insisted that they change course to Funwari Island to give Nami and her friends more time to escape. As the Fire Tank Pirates struggled to evade Prometheus, Bege encouraged them to stick together even in the face of death."}, {"type": "paragraph", "text": "They managed to reach Funwari Island though their ship was destroyed in the process. After dropping off the cake, Bege ran off carrying Chiffon with him. Bege and his crew then stole a tarteship and sailed away from Funwari Island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/eb/Bege_Shoots_Pekoms_Off_a_Cliff.png/revision/latest/scale-to-width-down/210?cb=20170702022533", "caption": "Bege shoots Pekoms into the ocean."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Straw_Hat_Pirates_Meet_Fire_Tank_Pirates.png/revision/latest/scale-to-width-down/210?cb=20180304023006", "caption": "Bege and his crew meet with the Straw Hat Pirates."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ef/Bege_and_Caesar_Strategize.png/revision/latest/scale-to-width-down/210?cb=20180408041628", "caption": "Bege goes over the plan with Caesar before entering the wedding."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/49/Bege_shoots_Katakuri.png/revision/latest/scale-to-width-down/210?cb=20180506042612", "caption": "Bege shoots Katakuri."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e0/Big_Father.png/revision/latest/scale-to-width-down/210?cb=20180603031056", "caption": "Bege transforming into a fortress."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7b/Vinsmoke_Family_Confronts_Big_Mom.png/revision/latest/scale-to-width-down/210?cb=20180610030011", "caption": "Caesar flies Bege away while the Vinsmoke Family covers for them."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6e/Straw_Hats_and_Fire_Tanks_Part_Ways.png/revision/latest/scale-to-width-down/210?cb=20180701033041", "caption": "Bege parts ways with the Straw Hats after they escape the venue."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a3/Chiffon%27s_Honor.png/revision/latest/scale-to-width-down/210?cb=20170825101431", "caption": "Bege watches as Chiffon departs to help the Straw Hats."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/Nostra_Castello_on_Land.png/revision/latest/scale-to-width-down/210?cb=20181104031055", "caption": "Bege pilots the Nostra Castello onto Cacao Island to rescue Chiffon."}]}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "After escaping Totto Land, Bege read the newspaper detailing Luffy's exploits and was displeased with how the newspaper glorified Luffy."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "Bege and his crew traveled to Delta Island and took part in the Pirates Expo."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "\"Gang\" Bege's Oh My Family", "level": 4, "content": [{"type": "paragraph", "text": "Chiffon declared to Bege and the other Fire Tank Pirates that she wanted to locate and reunite with her sister Lola. Bege agreed to help Chiffon, saying that his wife's wish was his wish. The Fire Tank Pirates later took over a pirate ship before planning to go to Thriller Bark. The crew later reached the Red Line, but they could not pass over it because of the Levely. They later went to Dressrosa to gather supplies. After disembarking, Bege and Chiffon encountered a man who was familiar with Lola. They then learned that Lola arrived at Dressrosa a few days before. Bege then went into Dressrosa with Chiffon to begin the search for Lola. When the Germs Pirates arrived and attacked Dressrosa, Bege and his crew fought and subdued them."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Fire Tank Pirates vs. Marines", "elements": []}, {"text": "Fire Tank Pirates vs. Big Mom Pirates (unseen)", "elements": []}, {"text": "Capone Bege, Jinbe, and Pedro vs. Charlotte Katakuri", "elements": []}, {"text": "Bege vs. Charlotte Linlin, Charlotte Perospero, and Katakuri", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bege is the only Super Rookie from the West Blue and one of the two (along with X Drake) whose birthday was not revealed in SBS Volume 60 (it was revealed later on in SBS Volume 64).", "elements": []}, {"text": "He was the shortest Super Rookie with a height of 166 cm (5'5½\") prior to the timeskip. In chapter 812, he is shown to now be slightly taller than Sanji, who stands 180 cm (5'11½\") tall.", "elements": []}, {"text": "In the 6th popularity poll, Bage ranked 51st.", "elements": []}, {"text": "He is the only member of the Worst Generation known to be married and be a parent.", "elements": []}, {"text": "Bege's rank as \"Rook\" as part of the Big Mom Pirates is a reference to the chess piece \"Rook\", which is also referred to as \"Castle\", matching his Devil Fruit abilities and general castle motif.", "elements": []}, {"text": "Bege being stated to cut off animals' heads may be a reference to The Godfather, in which Tom Hagen, the consigliere of the Corleone family coerced a target into doing what the eponymous Godfather wanted by having the head of the target's prized stallion decapitated.", "elements": []}, {"text": "Bege's blood type is S.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bege's surname and name was taken from two criminals. His surname Capone was taken from the 1920's American gangster, Alphonse \"Al\" Capone, and his name Bege from the English privateer, William le Sauvage.", "elements": [{"text": "Bege shares his birthday with Al Capone, with them both being born on January 17th.", "elements": []}]}, {"text": "Bege's favorite foods are meatballs and tomatoes, and his least favorite food is tomato juice.", "elements": []}, {"text": "If One Piece was set in the real world, then Bege would be from Italy.", "elements": []}, {"text": "If Bege was not a pirate, then he would be a shoe shop owner.", "elements": []}, {"text": "Bege's hobbies are looking at paintings and playing board games.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Al Capone – Wikipedia article on the real life mobster Capone Bege is named after.", "elements": []}]}], "images": []}]}