{"sections": [{"title": "Jewelry Bonney", "level": 1, "content": [{"type": "paragraph", "text": "Jewelry Bonney, also known as the \"Big Eater\", is a pirate and the captain of the Bonney Pirates. She and her crew originated from South Blue. She is one of twelve pirates who are referred to as the Worst Generation, and prior to the two-year timeskip had a bounty of 140,000,000."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bonney typically appears to be a slim, curvaceous young woman (despite the enormous amount of food she consumes regularly), with long light pink hair and brown eyes (dark-pink in the anime). However, due to her Devil Fruit ability, she can alter her age and thus change her appearance at will. When taking the form of a child, she has similar, although obviously more childish, facial features, and is not as tall nor as buxom as in her adult form."}, {"type": "paragraph", "text": "Her outfit consists of a white low-cut tank top that exposes both her midriff and cleavage, along with a pair of orange-and-black striped buckled shorts with long, thin suspenders. She also wears black high-heeled boots which reach up to her calves, with large laces coming from the openings, and a pair of hot pink and dark red stockings with a yellow sun-like motif on them (a pattern seen other times in the One Piece world). The hat she wears is a green Furażerka with a light-green lining. She has an anti-eyebrow below her right eye, bright red lipstick on her lips, and is sometimes seen wearing a brown furred jacket."}, {"type": "paragraph", "text": "In SBS Volume 64, Oda drew the Supernovas as children. Bonney is shown with shoulder-length hair as opposed to her current back-length hair and a rounder face. Her clothes and face are somewhat dirty showing that since childhood she had a huge appetite."}, {"type": "paragraph", "text": "After timeskip, Bonney is shown wearing a black hat (possibly a sunhat similar to Usopp's, judging by the rim) with a brown furred coat or cloak. She also uses pink lipstick as opposed to the red one before the timeskip."}, {"type": "paragraph", "text": "During the Levely Arc, she shows to have the same clothes she wore before the timeskip, but replacing her previous hat with one with earmuffs, in addition to wearing her coat."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bonney is an extremely gluttonous person with very poor table manners. She will, for instance, demand more food even though she has not finished her current meal. Her favorite food is pizza, specifically pizza Margherita, and she is shown eating pizza during her first appearance in the series and in two later appearances."}, {"type": "paragraph", "text": "While she may have bad manners, she has some common sense. She knows when to fight and when to prevent trouble, particularly in dangerous territories such as the Sabaody Archipelago. When she saw Zoro attempting to attack a World Noble, she orchestrated a scene where in her \"older brother\" got \"killed\" from the Noble's initial shot in order to prevent an Admiral from coming to the island."}, {"type": "paragraph", "text": "Bonney also believes in the stereotypical view of what a pirate should be. While she saved Zoro from attacking a World Noble, it was to protect her own skin. She, however, refused to help an innocent man who was shot earlier by the same noble. Her reason for doing this was that the man was a stranger and she was a pirate, and while Zoro was also a stranger to her, he himself is a pirate."}, {"type": "paragraph", "text": "Several instances suggest that she has an unforgiving disposition towards those who wrong her. While she kept Zoro from attacking Saint Charlos, Luffy later attacked him, so an admiral was sent to the island anyway. She has since built a grudge against the Straw Hat crew. She swears that she would wipe the crew out if they met again in the New World for the incident at the Sabaody Archipelago. She also appears to have a grudge against Blackbeard or the Marines and World Government as seen when Akainu captured her, saying that she will never forgive them."}, {"type": "paragraph", "text": "Bonney has shown to be compassionate as she shed tears of anger upon seeing Kuma's brutal enslavement by the World Nobles."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Bonney seems to command utter respect from her crew, who will fulfill any need she may require, from her dietary needs to hunting down the one she deems responsible for the calamity during the Whitebeard War. Despite this loyalty, Bonney seems to prioritize her own safety as she managed to escape Marine detainment but chose not to rescue her subordinates."}], "images": []}, {"title": "Rivals and Enemies", "level": 3, "content": [{"type": "paragraph", "text": "Being one of the Eleven Supernovas, Bonney can be counted on as a potential rival to any of the other 10 for the top position of the sea. She also stated that she will hunt down a certain person in the New World whom she blames as the one responsible for Whitebeard's death."}], "images": []}, {"title": "Roronoa Zoro", "level": 4, "content": [{"type": "paragraph", "text": "Bonney first encounters Zoro when he stumbles into town and casually addresses Saint Charlos, prompting the latter to shoot. Being unaware of what was happening, Zoro almost killed him in retaliation. Fortunately, Bonney was able to restrain him and diffuse the situation by faking his death. While exasperated at how clueless Zoro could be for not knowing who Charlos is and the repercussions of killing him would be, she became even more confused when he picked up a man who had previously been shot by Charlos and carried him to a nearby hospital."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Though she and Luffy have yet to actually meet face-to-face, Luffy's actions during the Celestial Dragon incident have unintentionally garnered him Bonney's fury, a fury that even extended to the rest of the Straw Hats (though this may simply be due to her earlier interactions with Zoro, whose ignorance she had to put up with)."}, {"type": "paragraph", "text": "However, when she was reading the newspaper about Doflamingo's defeat, she praised Luffy and Law for it."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "Though she and Law have not encountered one another, she does admire him for his alliance's victory over the Donquixote Pirates."}], "images": []}, {"title": "Marshall D. Teach", "level": 4, "content": [{"type": "paragraph", "text": "Bonney also seems to bear some grudge against Marshall D. Teach, otherwise known as Blackbeard, for his role at triggering the Whitebeard War by defeating and handing over Portgas D. Ace to the World Government for the vacant Shichibukai position. This hatred seemingly became more intensified after he and his crew dealt the final killing blows to Whitebeard, whom Bonney admired. She does not seem to fear him, even going so far as bad-mouthing him at point-blank range."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Bonney, for some unexplained reason, seems to be able to consume large amounts of food without any adverse effects on her body. No matter how much she eats, she is somehow able to metabolize all the food she ate without becoming full or even remotely fat, quite possibly due to her Devil Fruit powers giving her the metabolism of a child."}, {"type": "paragraph", "text": "Bonney has shown little in the way of physical abilities. She was shown to be quite fast however, as she managed to tackle Zoro before he was able to attack Saint Charlos. She and her crew were overpowered and captured by the Blackbeard Pirates, though she did manage to injure Marshall D. Teach by kicking him in the head."}, {"type": "paragraph", "text": "Bonney appears to be a very skilled escape artist, as she has managed to escape from the World Government's possession twice. Likewise, she is skilled at infiltration, stealth, thievery, acting, and mindgames thanks to her Devil Fruit. She proved this when she successfully managed to infiltrate Mary Geoise by posing as one of the Levely attendees, a noteworthy feat considering that for most pirates, entering through Mary Geoise without being invited or enslaved is practically considered an impossible and unthinkable feat."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Bonney exhibits abilities that come from an unknown type Devil Fruit that involves age manipulation. She can alter the ages of herself and others, rapidly aging her intended targets into their senior years or regressing them into small children. As a result of this ability, accurately determining her true age is difficult."}, {"type": "paragraph", "text": "It is rare in that it does not affect the clothing of those she uses it on, though it is natural as clothes do not change in size even as they age. Bonney apparently wears skimpy clothing and suspenders so that her clothes will fit when she becomes a child, while a group of Marines affected by it became too small for their own clothing once aged down to children."}, {"type": "paragraph", "text": "She may need her hands to use her power, as Blackbeard kept her in line simply by chaining her hands to a post, though it is also possible that the chains were lined with seastone, preventing her from accessing her powers."}, {"type": "paragraph", "text": "In the anime, one of these transformations is seen showing that her powers work through a process, rather than in a flash. She also briefly speaks a line in her adult voice while in child form after saving Saint Charlos from Zoro. She also glows pink while using her powers."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Bonney%27s_Devil_Fruit_Power.png/revision/latest/scale-to-width-down/210?cb=20130209040154", "caption": "Bonney's power on a group of Marines."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Not much is known at this point about her past, but she seems to have some sort of past history with the World Government, though this is unknown and somewhat unclear at the moment."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "After a long voyage following one of the Log Pose routes of the Grand Line, Bonney and her crew came to the Sabaody Archipelago to prepare themselves for the New World. While there, she and her crew decided to eat in a restaurant located in Grove 24 of the mangrove. There, she ordered a big meal and disgusted the other customers with her appetite and bad table manners. She, in particular, disgusted Capone Bege and almost got into a fight with him and his crew if not for the temporary truce that they had to observe between them."}, {"type": "paragraph", "text": "After her meal and leaving the restaurant, she saw Roronoa Zoro about to attack a World Noble (Charlos) who shot at him. As Zoro evaded the shot and prepared to retaliate, Bonney leaped at Zoro and threw him down to the ground. While doing so, she subsequently called Zoro \"her brother\" and stated that he \"died\" (slapping some tomato juice onto Zoro's forehead to make it look so) at that moment from the shot fired from the World Noble in order to prevent an incident from happening, which could potentially cause an Admiral to be dispatched by the Marines to the archipelago. After the noble left, Bonney scolded Zoro for the stunt he pulled. As Zoro carried a man whom the noble shot to a hospital, Bonney wondered why a pirate would help people."}, {"type": "paragraph", "text": "Upon hearing of Monkey D. Luffy's attack on a World Noble, she became angry and said that if she ever sees the Straw Hats again in the New World, she would crush them there. In the midst of her escape, she used her Devil Fruit abilities to turn any attacking Marines into children and old men."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7d/Bonney_Stops_Zoro.png/revision/latest/scale-to-width-down/200?cb=20130523012232", "caption": "Bonney becomes younger to prevent Zoro's attack on Saint Charlos."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Having successfully escaped the Marines' assault, Bonney remained on Sabaody and watched Portgas D. Ace's televised execution. She seemed to have been affected by the execution and war rather heavily, as she was seen crying while watching. She and her crew then left Sabaody and set sail."}, {"type": "paragraph", "text": "After the war ends, she was on board of her ship with her crew, on the outskirts of Marineford, having watched the war from afar with other Supernovas. She was heard remarking that the events of the war were all someone's fault, telling her crew to head to the New World to go after this person."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a1/Jewelry_Bonney_Crying.png/revision/latest/scale-to-width-down/200?cb=20160118194414", "caption": "Bonney crying over the Whitebeard War."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Almost immediately after entering the New World, Bonney's crew was defeated and she was taken hostage by the Blackbeard Pirates and was offered to the Marines to be traded for a battleship as replacement. Blackbeard told Bonney that she is too weak to survive and that she is the first to be eliminated."}, {"type": "paragraph", "text": "He did offer her the chance to stay if she became his woman. Refusing to be further shamed, she angrily turned him down and kicked him (due only to having her hands restrained). Van Augur soon alerted Teach that the battleship arrived, but it was not there for a trade because Akainu was on board. Knowing that the trade would not happen, the Blackbeard Pirates fled, leaving Bonney and her crew behind to be arrested."}, {"type": "paragraph", "text": "Akainu reached the shackled pirate and her crew and coldly informed Bonney that he was truly frightened when she escaped from the World Government but was glad she was back under their control. Bonney cried shouting that she will never forgive them. Afterwards, she was taken to the Marine Headquarters, where she was lucky enough to make her escape unlike her crewmates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/dc/Akainu_Captures_Bonney.png/revision/latest/scale-to-width-down/200?cb=20140801104743", "caption": "Akainu arrests Bonney."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "She was shown reading the news concerning Donquixote Doflamingo's supposed resignation from the Shichibukai and the newly formed pirate alliances while eating a slice of pizza. She appeared to be in a place with a cold climate due to the snow and her heavy coat."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Bonney turned into an old woman, stole some pizza from a shop, ran away, and turned into a young child to avoid capture. While eating the pizza, she read about Luffy and Law's victory in the newspaper and praised their actions, stating how happy she was to be from the same generation as them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fa/Bonney_Reading_the_News.png/revision/latest/scale-to-width-down/200?cb=20160410041804", "caption": "Bonney reading about Doflamingo \"resigning\" from the Shichibukai."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Bonney entered Mary Geoise by posing as the Queen Dowager Conney of the Sorbet Kingdom, one of the Levely attendees. She later went to the Celestial Dragon gate at the Pangaea Castle and snuck into the Domain of the Gods when the gate opened for an injured Charlos. While hiding from the Celestial Dragons, she saw how Rosward mistreated his slave, Bartholomew Kuma, and was extremely disgusted from seeing it."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "She is one of the attendees at the Pirates Expo."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Bonney Pirates vs. Marines", "elements": []}, {"text": "Bonney Pirates vs. Blackbeard Pirates (unseen)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the 6th fan poll, Bonney ranked 68th.", "elements": []}, {"text": "Bonney is the only known female with the title of Super Rookie, and the only female in the Worst Generation.", "elements": []}, {"text": "She shares some similarities with Charlotte Linlin, as:", "elements": [{"text": "They are the only females within a certain league of famous and powerful pirates (Bonney with the Worst Generation and Linlin with the Yonko).", "elements": []}, {"text": "Both have pink hair and same lipstick.", "elements": []}, {"text": "Both are voracious eaters.", "elements": []}, {"text": "Both have Devil Fruit powers that affect others' lifespans.", "elements": []}, {"text": "Both have ships that have a sweets theme.", "elements": []}]}, {"text": "Bonney's blood type is F.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Bonney's birthday, September 1, comes from her epithet since 9-1 can be derived from Oo-gurai.", "elements": []}, {"text": "Bonney's name was taken from the 18th century Irish woman Anne Bonny, a noble turned pirate who operated in the Caribbean.", "elements": []}, {"text": "Bonney's favorite food is pizza Margherita, and her least favorite food is carrots.", "elements": []}, {"text": "If One Piece was set in the real world, then Bonney would be from Australia.", "elements": []}, {"text": "If Bonney was not a pirate, then she would be a pizza shop owner.", "elements": []}, {"text": "Bonney's hobbies are eating food and playing Jenga.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Anne Bonny – Wikipedia article on the real life pirate Bonney is named after.", "elements": []}, {"text": "Anne Bonny - Article about Anne Bonny.", "elements": []}]}], "images": []}, {"title": "Site Navigation", "level": 2, "content": [{"type": "paragraph", "text": " "}], "images": []}]}