{"sections": [{"title": "Eustass Kid", "level": 1, "content": [{"type": "paragraph", "text": "Eustass \"Captain\" Kid is a notorious pirate from South Blue and the captain of the Kid Pirates."}, {"type": "paragraph", "text": "He is one of twelve pirates who are referred to as the \"Worst Generation\". One of the reasons his bounty was higher than Luffy's when they arrived at the Archipelago was a result of him and his crew causing huge numbers of civilian casualties in the course of their activities."}, {"type": "paragraph", "text": "Sometime during the timeskip, his bounty was raised from 315,000,000 to 470,000,000."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kid is a tall, muscular man with light skin and bright red hair, resembling flames. His nose has a particular shape, being quite pointed and having little protrusions on both sides. He has dark reddish purple colored lips and fingernails, red/orange eyes and no eyebrows."}, {"type": "paragraph", "text": "He dresses in an extravagant attire consisting of black and yellow lizard-print pants with a red fringe, motorcycle boots, and a blue sash under a green belt fastened by a large circular buckle with a four-leaf clover-like pattern in the middle. He also has a slim bandolier, also with minuscule bolts that go diagonally over his right shoulder then ties to his waist, where he keeps a dagger with a Japanese-style hilt and what appears to be a flintlock gun. He also has gold bangles around both wrists."}, {"type": "paragraph", "text": "He wears a pair of studded, square shaped goggles on his forehead, and a large fur captain's coat over his bare muscular torso. The dark brown coat is adorned with spikes on its shoulders lined in maroon. The collar of the coat is extremely flared and wide. He typically wears this coat with his right arm in its sleeve and his left arm under the coat itself."}, {"type": "paragraph", "text": "In SBS Volume 64, Oda drew the Supernovas as children. Kid is shown with spikier and more spread out hair, similar to a lion's mane. He also wore larger and rounder goggles and did not have dark lips. He was depicted tinkering with a toy robot with a wrench. His blue sleeveless shirt has a sewn patch, like his pants which are striped yellow, and has a patch."}, {"type": "paragraph", "text": "After the timeskip, he is shown with slightly longer hair that appears to be pushed back. He also has a large scar that drags from the left side of his forehead, goes down his neck and another smaller one that goes through his left eye. There are two parallel scars on his lower right arm also. He lost his left arm to just above the elbow during the two year timeskip in a battle against the Red Hair Pirates, and until his imprisonment by the Beasts Pirates, he replaced it with a mechanical one that is somehow connected to his nervous system, shown by the presence of several metallic wires embedded directly into his skin. The mechanical arm was damaged in his fight against Kaido, and later stripped from him to disarm him and put him at further disadvantage if he rebelled against his captor. His attire consists of his trademark spotted pants, a black opened vest, held down by a belted war kilt. He also has a long dark red coat, worn over his shoulders. He appears to have become more muscular and also has scars on his right forearm, left pectoral, and on the left side of his abdomen. He no longer wears any impractical jewelry."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Eustass Kid is notorious for causing huge amounts of civilian casualties. He is generally either angry or making sarcastic jokes. When he feels that he is being insulted, he is quick to resort to violence, as shown when he attacks Scratchmen Apoo, for apparently staring at him. He is quite sensitive to being mocked, insulted or glanced at. He also seems to be cruel even when not provoked, as he crucified another defeated pirate crew just because he deemed them too weak to roam around in the New World. Kid also seems to be quite vindictive, as he swore to make Kaido pay after the latter defeated and imprisoned him."}, {"type": "paragraph", "text": "Kid is fearless and has a penchant for violence. According to Baron Tamago, after the timeskip when Kid was roaming around in the New World, he destroyed two ships belonging to Yonko Big Mom's allies. This shows how fearless he is and does not hesitate to challenge a Yonko who is at the same level as Whitebeard. Despite his violent nature, he knows how to restrain himself when in a precarious situation."}, {"type": "paragraph", "text": "Kid is also shown to be quite cynical about the World Government. He is not blind to the way the World Nobles act, remarking that compared to them pirates are almost humane in nature and that they at least have charming sides and do not hesitate to be honest about their faults, unlike the Nobles, who justify their abuses with their heritages granted by their ancestors. He decides to leave the auction house after Camie is bought for 500,000,000 by a World Noble, commenting that it was like a metaphor for this screwed up world and calling the whole affair a farce. He similarly notes that the charade was over when the broadcast of Portgas D. Ace's execution was cut off."}, {"type": "paragraph", "text": "Kid has the same dream as Luffy: to find One Piece and become the new Pirate King. Because of this, and Luffy's recklessness, he seems to have a great deal of respect for him. However, while they often encounter the same problems, Kid deals with them in his own way, apparently slaughtering anyone and everyone who ever laughed at his ambition, in some ways being an antithesis to Luffy. He also seems to believe that possessing the determination to achieve the impossible is necessary to survive in the New World, and that anyone who doesn't is as good as dead."}, {"type": "paragraph", "text": "Kid wants to keep up-to-date with the events of the New World. Despite not being a broker, he watched the broadcast of Caesar Clown's experiment just to be informed. He seems to be rather prideful as he doesn't want to be the subject of false rumors. When he overheard Caribou talking to Luffy about the rumor how Kid's arm was cut off, he corrected him. He also developed a competitive rivalry with anyone who possess the same goals as he and Luffy argue that either one of them would take Kaido down."}, {"type": "paragraph", "text": "Kid is also as gluttonous as Luffy. While working in Udon, Kid went all out in his labor in order to get enormous amount of Kibi Dango rations to feed his appetite and ended up eating the prison's entire supply of rations. When Kid was dragged back to Udon by the Beasts Pirates who captured him with Killer, he was more concerned about how his comrade ended up laughing uncontrollably. After he was rescued by Luffy and his allies, he was grateful at the moment, but when Luffy offered him an alliance to take down Kaido, he rejected the offer due to Killer's current state of mind along with Apoo and Hawkins' betrayal. As he left Udon with Killer, he started to have a huge distrust towards other pirates except his own crew."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Kid seems to have a good relationship with his crewmembers that have been revealed. Killer keeps his captain calm when he gets angered and also informs him about historical events. Wire and Heat hold high respect for their captain, as shown when he was attacked by a Pacifista. After being Kaido's prisoner, Kid was noticeably worried about what had happen to his crew and was also enraged after seeing Killer's current state."}, {"type": "paragraph", "text": "After Kid was freed from the prison at Udon, he prioritized finding his crew and would only trust his crewmates after Apoo and Hawkins' betrayal."}], "images": []}, {"title": "Former Allies", "level": 3, "content": [], "images": []}, {"title": "Scratchmen Apoo", "level": 4, "content": [{"type": "paragraph", "text": "Kid once got into a fight with Apoo at Sabaody Archipelago, but they both agreed to postpone their fight until after they entered the New World. During their meeting in the New World, Apoo wrecked Kid's hideout and beat up one of his crew members because of the possibility that Kid was hiding a sniper, enraging Kid and resulting in a scuffle. However, it is revealed shortly after that they in fact planned to form an alliance. Despite their differences, they came into an agreement."}, {"type": "paragraph", "text": "Kid and Apoo seemed to have gotten on more amiable terms with each other as they and their crews were able to dine together. However, after the encounter with Kaido, it was revealed that Apoo already joined Kaido beforehand, which lead to Kid’s distrust to other pirates."}], "images": []}, {"title": "Basil Hawkins", "level": 4, "content": [{"type": "paragraph", "text": "Not much is known about their relationship, but Kid seems to trust Hawkins enough to invite him to make an alliance in order to take down one of the Yonko. This also shows that he recognizes him as a strong individual. Like Apoo, Hawkins appears to have betrayed Kid after encountering Kaido and allying with the Yonko."}], "images": []}, {"title": "Rivals", "level": 3, "content": [{"type": "paragraph", "text": "As a Supernova, he sees the other 100,000,000+ bounty rookies he encountered in the Sabaody Archipelago as his rivals, though he seems to be focused more on Law and especially Luffy. He, Law, and Luffy have all agreed to meet again in the New World."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Kid sees Luffy as a prominent rival for the mantle of the next Pirate King. After the Whitebeard War, he stated that he is not generous enough to let Luffy run around as he pleases. Regardless, Luffy has earned Kid's interest with his actions against the World Government prior to their first meeting, and Kid came to respect Luffy for assaulting a World Noble and being the only Supernova to join the war. After the timeskip, he expressed amusement when he watched Luffy's capture on Punk Hazard. After they met again in a prison at Wano Country, they became competitive with each other and would argue on who did more work. Despite this rivalry, they cooperated to defeat the deputy warden Dobon after he confronted them and tried to punish them for taking most of the prison's rations. Luffy also showed some concern for Kid when Queen threatened to drown him. After he was freed, Luffy offered an alliance to take down Kaido, but Kid rejected the offer as he still felt bitter about being betrayed with his previous alliance with Apoo and Hawkins."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "In the manga, Law gave Kid the finger when he (presumably) overheard Kid talking behind his back regarding rumors of how Law's manners appear to be rather lacking. Later on, when Kid volunteered to deal with the Marines amassing outside of the Auctioning House as a farewell gift to Rayleigh as well as the Straw Hats and the Heart Pirates, both Law and Luffy took Kid's cockiness as an insult and opted to follow him outside in order to compete with the fellow super rookie. When Kid insisted that he alone is sufficient enough for the task and orders the other two to step down, Law was the first to retaliate by stating he will take Kid out first should he order him about one more time. Nevertheless, he sided once again with Kid after the two crews were confronted by a Pacifista."}, {"type": "paragraph", "text": "Kid seems to have retained an interest in Law in the New World and was pleased to see he was planning something and was not just a \"Government Dog.\""}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "As a pirate with a tremendously high bounty, he is an enemy of the Marines. Before the timeskip, his strict behavior against innocent civilians earned him a high bounty. He, along with Trafalgar Law and Monkey D. Luffy, fought against many marine units at Sabaody Archipelago. Kid also despises the World Nobles and their actions."}], "images": []}, {"title": "Shanks", "level": 4, "content": [{"type": "paragraph", "text": "No direct interaction has been shown between the two, but Kid has formed an alliance with fellow captains Basil Hawkins and Scratchmen Apoo to overthrow the Yonko, Red Haired Shanks. Kid also confirms that he lost his arm in an encounter with the Red Hair Pirates."}], "images": []}, {"title": "Charlotte Linlin", "level": 4, "content": [{"type": "paragraph", "text": "No interaction has been shown but during the time-skip, Kid attempted to invade Totto Land and injured one of Big Mom's Sweet Commanders but was forcibly \"escorted\" from her territory. He later sunk two of the Yonko's ships while having no concern if she retaliated. Despite this hostility, Kid stated that he has no interest in going after Big Mom."}], "images": []}, {"title": "Kaido", "level": 4, "content": [{"type": "paragraph", "text": "Kid encountered Kaido when the latter fell out of the sky and landed at the Kid Pirates' hideout before coming face to face with the rookie pirate. It is unknown what happened in their encounter but Kid was later seen heavily wounded and held prisoner on Kaido's winter island as the latter mocked him for being part of the Worst Generation. However, Kaido appears to recognize Kid's talent in spite of his mockery and seems to want Kid as a follower. During his imprisonment, Kid is shown to hold a strong grudge against Kaido and firmly told Luffy that he will be the one to defeat the Yonko. However, after seeing what happened to Killer, Kid decided to prioritize finding the rest of his crew and rejected Luffy's offer for an alliance."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the captain of the Kid Pirates, Eustass Kid has complete authority over the crew. During the timeskip the Kid Pirates continued to rise in infamy, as evidenced by Kid and Killer's bounties increasing, and their willingness to attack Big Mom's ships."}, {"type": "paragraph", "text": "Prior to the timeskip, Kid and his crew were known for dealing major destruction and civilian casualties along their route through the Grand Line and towards the New World. Kid is a fearsome pirate who, along with the rest of his crew, showed flawless resistance to the Haki pulse emitted by Silvers Rayleigh at the Human Auctioning House and effortlessly defeated a large group of marines alongside Luffy and Law. He along with his crew also managed to escape from Admiral Kizaru's attack."}, {"type": "paragraph", "text": "After the timeskip, he seems to have become much more bold, if not more powerful, as he destroyed two ships belonging to Big Mom's allies and claims to have injured one of her Sweet Commanders. His bounty also rose to 470,000,000."}, {"type": "paragraph", "text": "Kid also appears well connected, as he is aware of dealings within the underworld."}, {"type": "paragraph", "text": "He has a strong will, remaining defiant towards Kaido despite the torture he had to endure for so long during his imprisonment."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Kid has immense strength and resilience. While being cuffed with Seastone, which depletes the energy of Devil Fruit users, he was able to match Luffy's speed in carrying and delivering large stone blocks bigger than him even with only one arm. He was also able to endure the torture of his imprisonment by the Beasts Pirates. He also has an incredible recovery rate as one of the prison guards said that his body can heal in a few days. Similar to Luffy, Kid has an incredible metabolism where he can eat large amounts of food, to the point where he becomes fat and round and instantly burn all the calories to replenish his stamina."}, {"type": "paragraph", "text": "Kid is also an extremely powerful hand to hand combatant. While bound by Seastone cuffs and with only one arm, he managed to defeat Dobon, a Headliner of the Beast Pirates, alongside Luffy. Kid also managed to escape the Udon Prison, while still cuffed in Seastone shackles."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Kid possesses a Devil Fruit power connected to magnetism. This manifests in two different abilities, both depicting repulsion and attraction of metals within his vicinity to be used as weapons. The first allows him to repel metallic objects away from himself, such as reflecting a Marine cannonball back towards its shooter. The second ability allows him to draw metallic objects towards him and form them into objects, his most frequent use of this being to form a giant arm made of hundreds of metallic weapons and objects and connecting it to his right hand. When forming this metallic arm, he can use it to punch his opponents, or as a makeshift shield to block even a Pacifista's laser beams. It is unknown if the firearms connected to his metal arm can fire at his will or not. In the anime and Unlimited Cruise game, Kid can also launch compressed bullets of scrap metal at his opponent at high speed."}, {"type": "paragraph", "text": "When using his Devil Fruit ability, purple electrical sparks emit from his hands, so his ability may resemble an electromagnet."}, {"type": "paragraph", "text": "The main weakness of the fruit seems to be its dependence from the surrounding environment, which must contain metal in order for the fruit's powers to be used (though this weakness has yet to be exploited). Other than that, it is also weak against the standard Devil Fruit weaknesses."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/20/Magnetic_Iron_Claw.png/revision/latest/scale-to-width-down/210?cb=20110925181329", "caption": "Kid using his magnetism to form a giant hand out of scrap metal."}]}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Repel (, Riperu, literally \"Repulsion\"): Kid's only named attack, he repels any metallic material in his vicinity in a chosen direction. In effect, it works like a catapult. This attack was first seen at the Human Auction House, where he repelled a Marine cannonball at high speed back towards the attackers. This attack retains its original name in the Viz Manga.", "elements": []}]}], "images": []}, {"title": "Video Game-Only Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Genocide Raid (ジェノサイド・レイド, Jenosaido Reido): A technique in the video game One Piece: Gigant Battle! 2 New World, Kid creates a vortex of metal pieces around the enemies that seem to both shock and pummel them at the same time, knocking them off their feet.", "elements": []}]}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "According to Kaido, Kid can use Haoshoku Haki. He can also use all 3 types like Luffy. Him and Luffy are the only members of the Worst Generation that can use all 3 types of Haki."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He carries around a flintlock pistol and a dagger. While he was on the verge of unsheathing the latter in various occasions, he never actually used it in combat, rendering his skills with both the weapons as of yet unknown."}, {"type": "paragraph", "text": "Sometime during the timeskip his left arm was replaced with a mechanical one, making him a partial cyborg. However, whatever capabilities that his new arm now grant him are currently unknown."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Not much is known about Kid's early life, other than he is orginally from the South Blue and has known Killer since childhood."}, {"type": "paragraph", "text": "When Kid and Killer were young, they ate curry udon with their first love, Shiruton Doruyanaika. They laughed when she spilled curry broth all over herself while eating it, causing her to beat them up. This caused curry udon to become their least favorite food."}, {"type": "paragraph", "text": "Kid formed his own crew in the the Kid Pirates in the South Blue and were noted to have been responsible for a great deal of damage and had caused many civilian casualties along their journey."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "After a long voyage following one of the Log Pose routes of the Grand Line, Kid and his crew arrived at the Sabaody Archipelago to prepare themselves for the New World. While there, he had a little squabble with Scratchmen Apoo in Grove 24. Before their battle could escalate further, Apoo asked Kid to postpone it until they went to the New World. Knowing what would happen if an incident were to happen, Kid agreed to Apoo's terms."}, {"type": "paragraph", "text": "Kid and his crew then ventured deeper into the mangrove and entered the Human Auctioning House. As Kid waited for the auction to begin, he made a number of remarks to his crew, claiming that the World Nobles make pirates seem humane by comparison and bemoaning the twisted nature of the world order, before noting that he might actually join in on the slave auction. Kid later caught a glimpse of Trafalgar Law, who was already sitting for the auction, and was flipped off by the pirate doctor. As the auction began, Kid noticed some members of the Straw Hat Pirates coming in and was disappointed to find the captain was not with them at the time, noting that he wished to see just how big an idiot and how crazy Luffy is supposed to be, as depicted in the newspapers."}, {"type": "paragraph", "text": "Kid watched through most of the auction, until the World Noble Saint Charlos made an outrageously high 500,000,000 bid for the mermaid, Camie, which completely shut out the other participants in the auction. Seeing the noble went unchallenged, Kid decided to leave the Auction House, considering it another example of what's wrong with the world. However before he and his crew left the building, Luffy and Zoro crashed through the wall right next to them. What followed next then was a ruckus caused by Luffy that caught Kid's eye. As the events unraveled, Kid, along with the rest of the crowd, watched in shock as Luffy punched the World Noble, Charlos, out of anger for shooting his fish-man ally, Hatchan. While most of everyone in the auction house started panicking at this turn of events, Kid, as well as Trafalgar Law, simply smiled approvingly at what happened."}, {"type": "paragraph", "text": "Just as Kid was watching the ensuing chaos, he noticed that someone suddenly came out of the back of the auction house's stage along with a giant. He then witnessed the person knocking out nearly everyone in the place except for the Straw Hats and their allies with a \"Rush of Spirit\", otherwise known as \"Haki\". Having taken the blast and survived through it, Kid realized that this person was none other than Gol D. Roger's first mate, Silvers Rayleigh. As the situation continued, Kid and those still conscious realized that a bunch of a Marines were surrounding the auction house for what Luffy did."}, {"type": "paragraph", "text": "Though happy at seeing how crazy Luffy is as the rumors stated, Kid decided not to stick around to fight a Marine Admiral. Seeing as how the Marines were treating Kid and Law's crews as if they were accomplices to the Straw Hats, Kid told Luffy and Law that he would go on ahead and clear a way for them so that they would not have to worry themselves. However, Luffy and Law were insulted by Kid's remarks, and instead decided to go face the Marines along with him. Together, the three captains began to fight the Marines outside the auction house with their respective Devil Fruit powers. Luffy noted that both Kid and Law have crazy powers, with Kid responding that Luffy had the weirdest."}, {"type": "paragraph", "text": "After beating back the first wave of Marine attacks and scattering them, Kid noted that their plan of attack was utterly demolished. He bid Luffy farewell and stated that it was nice meeting him, but promised that the next time they meet, he would not be so merciful. Luffy unconcernedly replied that he would be the one to find One Piece. Both Kid and Law stared at Luffy and were even distracted from the attacking Marines. Killer defended Kid and scolded him for not paying attention. Kid acknowledged Killer but reflected to Luffy that on the paths they'd traveled up to now, saying something like that would have gotten them laughed at. He mentioned that he killed anyone who dared laugh at him. He also stated that from this point, anyone without the nerve to say that would die on the seas. He invited both Luffy and Law to meet up with him in the New World before departing with his crew."}, {"type": "paragraph", "text": "After defeating the Marines, the Kid Pirates were on their way to leave the island when moments later, Kid and his crew were confronted by what they believed to be Shichibukai Bartholomew Kuma (later revealed to be a Pacifista). It surprised both Kid and the pirates when it fired a laser from its mouth which hit Kid's left leg. Law and his crew happened to encounter them while escaping as well and, despite Kid telling Law to stay back (which is met once again by Law's earlier threat), they both prepared to fight against the Pacifista."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b8/Luffy%2C_Kid_and_Law_vs._the_Marines_at_Sabaody_Auction_House.png/revision/latest/scale-to-width-down/210?cb=20150905203958", "caption": "Kid, Luffy and Law confront the Marines."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d8/Heart_and_Kid_Pirates_vs._Pacifista.png/revision/latest/scale-to-width-down/210?cb=20141206070613", "caption": "Kid and Law confronting a Pacifista."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Eustass Kid and his crew managed to escape capture by the Pacifista and later returned to Sabaody Archipelago. They watched the live broadcast of the execution of Portgas D. Ace up until it was cut off by the Marines. After this, Kid told his men they were departing."}, {"type": "paragraph", "text": "The Kid Pirates then approached Marineford and watched the war unfold from a safe distance on board of their ship."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war was declared over by Sengoku, Kid commented that since Whitebeard died, the balance of the Three Great Powers was shifted with the New World under the control of Shanks, Kaido, and Big Mom. Kid went on saying that the New Age, the likes of which no one has ever seen before, has begun."}, {"type": "paragraph", "text": "Kid and his crew later arrived in the New World. He was reading aloud from the newspaper article about Luffy going to Marineford a second time. He then asked Killer what the Ox Bell is."}, {"type": "paragraph", "text": "After Killer's explanation, Kid thought Luffy's message meant that he (Luffy) was going to create the new age himself. Kid found this amusing and then stated that Luffy really knows how to get on people's nerves, and even though he gave the Straw Hat captain credit for being the only Supernova brave enough to participate in the Marineford War, thereby putting him a step way ahead of the other infamous rookies, he (Kid) was not generous enough to let Luffy go around and do as he pleases."}, {"type": "paragraph", "text": "He then took Haritsu Kendiyo's pirate crew captive. After the crew begged him to let them go back to Paradise, he crucified them using his Devil Fruit powers, saying that people with that little amount of resolve have no business in the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6c/Eustass_Kid_in_the_New_World.png/revision/latest/scale-to-width-down/210?cb=20141206070009", "caption": "Eustass Kid crucifying a defeated pirate crew."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Sometime during the two-year timeskip, as Kid got very involved in many conflicts, he lost his left forearm in battle against the Red Hair Pirates. He later replaced it with a large metal one."}, {"type": "paragraph", "text": "At some point after this, Kid and his crew went to Big Mom's territory and injured one of Big Mom's Sweet Commanders, as well as plundering something. However, they were quickly forced to flee afterwards."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "A few days after sinking two of Big Mom Pirates' ships, he watched Caesar Clown's broadcast of his new weapon of mass destruction via a video Den Den Mushi. When asked by Killer if he was interested, he stated that he was not interested in owning the weapon but merely wanted to know about it."}, {"type": "paragraph", "text": "After seeing his fellow Supernovas Luffy and Law captured, Kid then left the broadcast at the urging of Killer to meet up with some apparent guests. He then told Killer that watching was meaningless, and how he did not think Killer ought to work as a broker anyway. Kid also mentioned that he was surprised about how Law was really planning something all along, having believed he had become a government dog. Asking if the guests had arrived yet, Killer told him that they have and that he was surprised they came at all. Before entering the room, Killer reminded Kid to be friendly, causing the captain to become irritated and told Killer to shut up. Opening the door, it was revealed his guests were Scratchmen Apoo and Basil Hawkins."}, {"type": "paragraph", "text": "Apoo, standing amongst a wrecked room and over one of Kid's badly beaten subordinates, told Kid that it felt nostalgic for him to see his ugly face. Kid instantly became enraged, asking what gave him the right to trash someone's hideout. Apoo replied that when he received an invitation from an enemy, he came expecting a fight and that he had suspected there might be a sniper somewhere. As the two challenged each other, Hawkins declared how foolish the meeting was and that he was leaving. Killer asked him to wait as he stepped between Kid and Apoo, reminding them that the three crews came together to try and form an alliance and asked that they at least try to discuss it."}, {"type": "paragraph", "text": "A newspaper later revealed that the three captains came to an agreement and formed an alliance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Kid%2C_Apoo%2C_and_Hawkins_Alliance.png/revision/latest/scale-to-width-down/210?cb=20160414151632", "caption": "Kid, Apoo and Hawkins meeting in the New World."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After reading the newspaper, he saw that Luffy and Law had formed their own alliance and wondered which Yonko they were targeting."}, {"type": "paragraph", "text": "Kid, Hawkins, and Apoo were dining together when they heard the news of Doflamingo's defeat. They figured that Luffy and Law were after Kaido since Doflamingo was connected to him. They were pleased that Luffy and Law were not after the same Yonko as them, Shanks."}, {"type": "paragraph", "text": "Some time later, Kid and the others were alerted by what seemed to be an earthquake. Kid instructed his men to have their weapons drawn and drew closer to investigate. The source of the commotion was a large crater on the ground in the shape of a human. Kid was enraged and demanded an answer as to what person was behind this occurrence. He was answered by another explosion in the direction of the crater. It was then revealed that the man who had caused the explosion was Kaido. At that time, Kid, Killer, and Hawkins discovered that Apoo was already working for Kaido with the intention of setting them up to join him as his subordinates. While Hawkins joined Kaido, Kid and Killer refused to submit to the Yonko and tried to fight him only to be defeated."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Kid_Alliance_facing_Kaido.png/revision/latest/scale-to-width-down/200?cb=20160501075538", "caption": "The allied pirates find themselves facing Kaido."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the confrontation with Kaido, Kid was severely beaten and imprisoned by the Yonko and his crew."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/58/Kid_Defeated.png/revision/latest/scale-to-width-down/150?cb=20170305181402", "caption": "Kid defeated and imprisoned."}]}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo along with his crew."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kid was sitting in a cell at Udon when Luffy was thrown in a cell next to his. Both Kid and Luffy swore payback against Kaido before Luffy noticed Kid was next to him. A few days later, both of them were competing over who could do more work at the prisoner mine. Dobon then confronted the two over the amount of kibi dango rations they acquired. He prepared to discipline them as he had his hippo put them into its mouth. However, Kid and Luffy quickly knocked out Dobon and his hippo."}, {"type": "paragraph", "text": "Later, Kid overheard Caribou telling Luffy a rumor about how his arm got cut off, and he interjected to correct the story. Kid and Luffy then argued over which one of them would take down Kaido. At a later point, Kid somehow escaped from the prisoner mine."}, {"type": "paragraph", "text": "Kid later spotted Killer being escorted to the Prisoner Mines. He attempted to attack the escort only to be subdued and recaptured. After returning to the prison, Kid questioned Killer on what Kaido had done to him and the fate of their crew, but Killer could not answer through his laughter and tears. Queen then subjugated them both to water torture and threatened to keep them submerged until Luffy and Hyogoro die. When Big Mom was swinging Queen around, Kid and Killer were saved from drowning when Queen crashed into the contraption holding them and knocked them out of the water."}, {"type": "paragraph", "text": "As Luffy and his allies from the Ninja-Pirate-Mink-Samurai Alliance were fighting against the Beasts Pirates, Raizo tossed some keys to Kid and Killer. Kid sat there and watched as the chaos unfolded."}, {"type": "paragraph", "text": "After the prison takeover was complete, Luffy offered Kid an alliance to defeat Kaido. Kid rejected Luffy's offer, feeling betrayed by Apoo and Hawkins. He then took Killer with him and left the Prisoner Mines to find his other crewmates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2c/Kid_and_Kamazo_Undergo_Water_Torture.png/revision/latest/scale-to-width-down/180?cb=20190603133651", "caption": "Kid and Kamazo undergo water torture."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kid vs. Scratchmen Apoo (postponed)", "elements": []}, {"text": "Kid, Trafalgar Law, and Monkey D. Luffy vs. Marines", "elements": []}, {"text": "Kid Pirates and Heart Pirates vs. a Pacifista", "elements": []}, {"text": "Kid Pirates vs. Haritsu Kendiyo and his crew", "elements": []}, {"text": "Kid Pirates vs Red Hair Pirates (unseen)", "elements": []}, {"text": "Kid Pirates vs. Big Mom Pirates allies (unseen)", "elements": []}, {"text": "Kid Pirates vs. Big Mom Pirates (unseen)", "elements": []}, {"text": "Kid vs. Kaido (unseen)", "elements": []}, {"text": "Kid and Luffy vs. Dobon", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "When Kid, Law, and their respective crews encountered a Pacifista, it is currently not specified whether this one was Kuma or not in the manga and are left with a cliffhanger. In the anime, this one was a regular Pacifista and the pirates were given some scenes fighting it. When it seemed that they defeated the Pacifista, it got back up and resumed its attack, essentially leaving the same cliffhanger as in the manga."}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Even though the correct romanization for his name was shown in his introduction, the \"d\" in \"Kid\" was cut off, leading many people to believe that there was more of his name, and used \"Kidd\" for his name, basing it on the pirate William Kidd, the confirmed basis for the name. Eventually, in Chapter 594, it was confirmed to be \"Kid\"."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/82/Kid%27s_Name_Romanization.png/revision/latest/scale-to-width-down/210?cb=20110106123821", "caption": "Kid's name as romanized in his introduction."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Unlimited Cruise", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece: Treasure Cruise", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Like Luffy, he has another member of the Worst Generation in his crew.", "elements": []}, {"text": "Unlike Luffy, when Kid speaks of his experiences in the Grand Line, he mentions killing everyone who dared to laugh at him and his dream to find the One Piece and become the next Pirate King. In contrast, when the Bellamy Pirates started laughing at the Straw Hat Pirates for being \"dreamers\", instead of responding to Bellamy's mockery, Luffy claimed that it was not a battle worth fighting, following the example taught to him by Shanks.", "elements": [{"text": "Similarly, while Luffy idolizes Shanks, Kid targets him with his allies.", "elements": []}]}, {"text": "After suffering wounds post-timeskip, Kid's appearance resembles that of Shanks in that both of them have scars running down the left side of their face over their left eye and have both lost their left arms, in addition to both having red hair as well. However, unlike Shanks, Kid's scars are more extreme, stretching down his chest, and he has also obtained a prosthetic replacement for his missing arm, while Shanks appears to have done nothing to fix his handicap. Fittingly, it was in battle with the Red Hair Pirates that Kid sustained his injuries.", "elements": []}, {"text": "In the 6th Japanese fan poll, Kid ranked 37th, which makes him the second most popular non-Straw Hat Supernova, behind Law. He managed to retain this distinction despite falling 19 places after ranking 18th in the 5th fan poll.", "elements": []}, {"text": "The water torture that Kid and Killer were subjected to in the Wano Country Arc is a version of the old Japanese torture and execution method known as tsurushi or \"reverse hanging\".", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Kid's birthday, January 10, comes from his name since 1-10 can be derived from Kid-do.", "elements": []}, {"text": "Kid's surname and name was taken from two real-life pirates. The surname Eustass was taken from 13th century French pirate and mercenary, Eustace the Monk, and the name Kid from 17th century Scottish pirate and privateer, William Kidd, who was also nicknamed \"Captain\".", "elements": []}, {"text": "Kid's favorite food is cabbage rolls, and his least favorite food is curry udon.", "elements": []}, {"text": "If One Piece was set in the real world, then Kid would be from Scotland.", "elements": [{"text": "He shares his dislike of curry udon and real-world nationalities with Killer, whom he grew up with.", "elements": []}]}, {"text": "If Kid was not a pirate, then he would be a weapons merchant.", "elements": []}, {"text": "Kid's hobbies are listening to music and collecting weapons.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "William Kidd – Wikipedia article on the real-life pirate Kid is named after.", "elements": []}, {"text": "Eustace the Monk – Wikipedia article about real-life pirate Eustace the Monk.", "elements": []}, {"text": "William Kidd - History UK - Article about real-life pirate William Kidd.", "elements": []}, {"text": "William Kidd - Article about real-life pirate William Kidd.", "elements": []}, {"text": "Real-life pirate Eustace the Monk - Biographical details on William Kidd.", "elements": []}]}], "images": []}]}