{"sections": [{"title": "Scratchmen Apoo", "level": 1, "content": [{"type": "paragraph", "text": "Scratchmen Apoo, also known as \"Roar of the Sea\", is a longarm and an infamous music-themed pirate and captain of the On Air Pirates. He and his crew originated from the Grand Line. He is one of twelve pirates who are referred to as the \"Worst Generation\". After the timeskip, his bounty has been raised from 198,000,000 to 350,000,000. Some time during the timeskip, he became a subordinate to the Yonko Kaido."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Being of the Longarm Tribe from the Grand Line, one of Apoo's distinguishing traits is his incredibly long arms. Each of these long arms possesses two elbow joints instead of just one, making them much longer than a normal person's. These arms make it possible for him to utilize his Devil Fruit powers without the need to contort the said limbs, whenever he converts them into makeshift instruments."}, {"type": "paragraph", "text": "Apoo also has a rather broad chest cavity, which may aid him in producing deep and bellowing drum-like sounds. Apoo's lower jaw is also somewhat wider than the upper half of his face, similar to Itomimizu of the Foxy Pirates. Besides these, his most distinguishing attributes are his unique physical characteristics and the objects adorned on him, all of which are music themed or related. His teeth have a unique look to them as they resemble piano keys. His fighting stance is also music themed as he appears like he's moving his hands in the same way a DJ would move theirs when mixing music on turntables."}, {"type": "paragraph", "text": "He wears a set of orange headphones with his name on either side over his ears and hairstyle similar to Jabra's, where the hair on his scalp has been pulled tightly so that his roots resemble lightning patterns. A red Chinese garb with crew's Jolly Roger 音 (, oto, \"sound\" or \"music\"), at the center of a large flower-like print splayed across the chest area, as well as on his back. Apoo also has a yellow scarf around his waist. He also has what seems to be the design of a green rose sewed on front of his left shoulder."}, {"type": "paragraph", "text": "In SBS Volume 64, Oda drew the Supernovas as children. Apoo is shown with significantly shorter hair and a rounder face. His hair was also combed into a pompadour in the front, with his braid in the back. His attire was a less elaborate shirt and bow tie. His teeth also lacked the dark markings that make them resemble piano keys."}, {"type": "paragraph", "text": "After the timeskip, he wears a set of black headphones, and changed to a different garb that has the kanji moved to the right side of his pants, ropes as buttons for the shirt, and epaulets on his shoulders."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Apoo seems to be a passive individual who would not seek to harm others without a good reason. As a result, he is normally defensive during confrontations as seen in his postponed brawl with Eustass Kid at a Sabaody Archipelago bar. Despite this, Apoo can be very ambiguous at times, meaning he cannot deny himself as audience to a good brawl should the opportunity presents itself. When facing an opponent that's too strong for him, he prefers to run away. However, he enjoys provoking and taunting his enemies before leaving."}, {"type": "paragraph", "text": "He also proved to be quite perceptive, since he claimed to have sensed an immense murderous intent momentarily emitted by Roronoa Zoro, shortly before Zoro attempted to attack the World Noble Saint Charlos after the latter attempted to shoot the former."}, {"type": "paragraph", "text": "He appears to be reckless and overconfident, as shown when he believed that he could attack Kizaru at Sabaody Archipelago and run away, only to be pummeled to the ground by the Marine admiral."}, {"type": "paragraph", "text": "He hates it when someone tells him the obvious, such as when a crew member stated that the crew was running in the air, while they were running away from a pack of savage boars in the New World."}, {"type": "paragraph", "text": "After the timeskip, Apoo seems to have become very cautious, believing that when summoned by an enemy he should be ready to fight, and when Killer invited him to discuss the possibility of an alliance, Apoo believed Kid to be hiding a sniper, which resulted the On Air Pirates captain to wreak havoc on Kid's base and attacking one of his crew members."}, {"type": "paragraph", "text": "Apoo also proved to be deceitful and treacherous, as it was revealed that he already joined the Beasts Pirates before agreeing to meet Kid about joining his alliance, and he feigned cooperation with Kid and Hawkins as part of a plan to force them and their crews to become subordinates of Kaido."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Eustass Kid", "level": 4, "content": [{"type": "paragraph", "text": "Kid once got into a fight with Apoo at Sabaody Archipelago, but they both agreed to postpone their fight until after they entered the New World. During their meeting in the New World, Apoo wrecked Kid's hideout and beat up one of his crew members because of the possibility that Kid was hiding a sniper, enraging Kid and resulting in a scuffle. However, it is revealed shortly after that they in fact planned to form an alliance. Despite their differences, they came into an agreement."}, {"type": "paragraph", "text": "Kid and Apoo seemed to have gotten on more amiable terms with each other as they and their crews were able to dine together. However, after the encounter with Kaido, and Apoo's ties with the Beasts Pirates revealed, he broke off his allegiance with Kid. Kid felt betrayed and declared that the alliance was over."}], "images": []}, {"title": "Beasts Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Sometime before meeting Kid and Hawkins, Apoo joined the Beasts Pirates. He then set them up to force them to join Kaido."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Scratchmen Apoo is a member of the Worst Generation, a group of prominent pirate rookies who survived the dangers of the Grand Line."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "His fighting stance generally consists of him waving his hands in front of him like a DJ. Not much is currently known about his abilities, as he has not demonstrated any fighting skill to the extent of the other Supernovas, save for his brief brawl with Eustass Kid, where the two caused a building to tumble down and his attack on Admiral Kizaru. Apoo displayed incredible agility and acrobatic jumping skills on both occasions."}], "images": []}, {"title": "Musical Skills", "level": 3, "content": [{"type": "paragraph", "text": "Apoo has shown an extremely high level of skill in music. He could play instruments such as a piano, saxophone, drum, or cymbal with great versatility. He used these skills in conjunction with his musical based Devil Fruit powers for combat."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Apoo appears to have a Devil Fruit connected with music. This ability, which he refers to as Tatakau Music (戦う, Tatakau Myūjikku, literally meaning \"Fighting Music\"), allows him to transform his body into various musical instruments (such as piano keys on his teeth or turning his arm into a saxophone) which he can play. By playing specific notes and tunes, he can release music that causes damaging effects to his opponents, the type of damage being determined by what he plays, and seems to have hypnotic effects. Apoo can turn into instruments in seconds."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1e/Apoo_Using_Musical_Powers.png/revision/latest/scale-to-width-down/210?cb=20130209042848", "caption": "Apoo using his Devil Fruit power."}]}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Tatakau Music: Scratch Shan Don (戦う スクラッチ・・, Tatakau Myūjikku: Sukuracchi Shān Dōn, literally meaning \"Fighting Music: Scratch Shan Don\"): Apoo morphs his limbs into various instruments, and emits a dance-like musical number which he raps over. This was first seen being used against Admiral Kizaru.", "elements": [{"text": "Shan (, Shān, literally meaning \"Beheading\"): Apoo releases a sound wave that can slice his opponents. In the anime it is the sound of a cymbal. This was first seen being used against Admiral Kizaru. \"Shan\" is an onomatopoeia that symbolizes quick and silent sounds, like a slash. In the Viz Manga, this is called Scratch.", "elements": []}, {"text": "Don (, Dōn, literally meaning \"Explosion\"): Apoo releases a sound wave that can cause an explosion near his enemy with devastating effects. In the anime, it was the sound of a drum. This was first seen being used against Admiral Kizaru. \"Don\" is a Japanese onomatopoeia that symbolizes a strong noise, like an explosion. In the Viz Manga, this is called Boom.", "elements": []}]}]}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "After a long voyage following one of the Log Pose routes of the Grand Line, Apoo and his crew came to the Sabaody Archipelago to prepare themselves for the New World. While there, he had a little squabble with Eustass Kid in Grove 24. Knowing full well what would happen if they caused an incident in Sabaody, Apoo asked Kid to postpone their battle until they met in the New World, to which Kid agreed."}, {"type": "paragraph", "text": "As Apoo continued his stay in Sabaody, he and his crew witnessed some of the cruelty imposed on the inhabitants by the World Nobles. While witnessing Saint Charlos abuse a citizen, Apoo was suddenly shocked when a newly-arrived Roronoa Zoro tried to defend the man. Fortunately for Apoo and his crew, Jewelry Bonney stopped Zoro and faked the swordsman's death in order to prevent an incident from occurring. Though danger was averted, Apoo sensed a strong killing intent from Zoro as he witnessed the scene."}, {"type": "paragraph", "text": "Upon hearing of Luffy's attack on a World Noble, he seemed reluctant to leave, asking if only the Straw Hat Pirates will be targeted by the coming Marines. Also, like X Drake, he seemed eager to find out which Admiral would be dispatched to deal with the Straw Hat crew's actions. Despite the best efforts of his crew to get him off the island, Apoo insisted on seeing the Admiral in action and felt that he should anger Kizaru before he runs away."}, {"type": "paragraph", "text": "Later on, a brawl erupted between Kizaru, a Pacifista, Basil Hawkins, Drake, and Urouge, which Apoo excitedly began to watch. As the battle unfurled, Apoo witnessed the three captains' true powers, including Drake's dinosaur Zoan Devil Fruit ability, which he stated he had never seen before."}, {"type": "paragraph", "text": "After Kizaru felled Urouge and blinded Hawkins, he prepared to kill Hawkins, but Apoo intervenes and saved the pirate by emitting sounds played on various body parts, which were being used as instruments as he rapped over the music. His ability not only stunned and mesmerized Kizaru, the other captains, and possibly the Pacifista, but also badly damaged the Admiral. Apoo released a sound wave likening to the cutting tone of a cymbal, which traveled down and cleanly sliced Kizaru's right arm off. After this attack, Apoo pounded on his chest, releasing a loud booming drum-like sound which also produced a visible sonic wave. This caused an explosion around Kizaru's midsection and he collapsed on the ground in two parts."}, {"type": "paragraph", "text": "While Kizaru is incapacitated, Apoo attempted to flee the scene; however, the Admiral reanimated himself using his Devil Fruit ability, caught up to the pirate by teleporting with his powers, and then kicked him through a building. Apoo was left on the ground, defeated and badly hurt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/de/Apoo_vs._Kid.png/revision/latest/scale-to-width-down/210?cb=20130224090239", "caption": "Apoo and Kid conflict on the Sabaody Archipelago."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a5/Apoo_Defeated_by_Borsalino.png/revision/latest/scale-to-width-down/210?cb=20130209043154", "caption": "Apoo is struck down by Kizaru."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Apoo watched Ace's execution televised at Sabaody, meaning that he managed to escape capture by the Marines. It is made apparent at the very least that Apoo's crew sailed away from Sabaody and came back because one of his crew mates was complaining how they came back to see Ace's execution only for the broadcast to be cut off. Apoo correctly assumed that the Marines stopped the broadcast because there was something that the Marines did not want society to see."}, {"type": "paragraph", "text": "Apoo was among the Supernova crews that gathered some distance from Marineford to witness the end of the war between the Marines and Whitebeard's forces. After the war ended, Apoo angrily wondered why Trafalgar Law would go save Luffy, mentioning that Law had a vicious reputation and that Luffy was a rival."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "Weeks later, Apoo and his crew had made it into the New World and stopped at a spring island. They are seen running in fear from a stampede of monstrous boars, running toward the end of a cliff. Apoo commanded his crew to jump off the cliff, but much to everyone's surprise, they ran off the cliff and seemingly on thin air while the boars continued to chase after them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1a/Scratchmen_Apoo_at_the_New_World.png/revision/latest/scale-to-width-down/210?cb=20130223000920", "caption": "The On Air Pirates running literally \"on air\" in the New World."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Sometime during the two-year timeskip, Apoo and his crew wandered into Big Mom's territory and were forced to flee. At some point, he joined the Beasts Pirates."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the events surrounding Punk Hazard, Apoo arrived (on invitation) at Kid's base in the New World. In one of the main rooms, he tore the place apart, claiming to believe there was a sniper hiding, while Basil Hawkins sat at a nearby table patiently. Once Kid arrived and objected to his treatment of the base, the two captains quickly began fighting, leaving Killer taken aback and trying to calm them down. Hawkins stood to leave, but Killer stopped him. After doing so, Killer then revealed their intention to create an alliance with the On Air and Hawkins pirates."}, {"type": "paragraph", "text": "A newspaper later revealed that the three captains had come to an agreement and formed an alliance. The group was confused on how the information got out, but put that topic to the side. They then started plans to take down a Yonko."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Kid%2C_Apoo%2C_and_Hawkins_Alliance.png/revision/latest/scale-to-width-down/210?cb=20160414151632", "caption": "Kid, Apoo and Hawkins meeting in the New World."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Doflamingo's defeat, Kid, Hawkins, and Apoo were dining together when they heard the news of what happened at Dressrosa. They figured that Luffy and Law were after Kaido since Doflamingo was connected to him. They were pleased that Luffy and Law were not after the same Yonko."}, {"type": "paragraph", "text": "Some time later, Apoo and the others were alerted by what seemed to be an earthquake. They quickly investigated the source of the commotion, which was a large human-shaped crater in the ground. A gigantic man emerged from the hole, having jumped and fallen 10,000 meters from Ballon Terminal, a Sky Island. The alliance then came face-to-face with the Yonko, Kaido. At that time, Hawkins, Kid, and Killer discovered that Apoo was already working for Kaido with the intention of setting them up to join him as his subordinates."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Kid_Alliance_facing_Kaido.png/revision/latest/scale-to-width-down/200?cb=20160501075538", "caption": "The allied pirates find themselves facing Kaido."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Jack's defeat, Apoo contacted Kaido and informed him that communications with Jack had been lost."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo along with his crew."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After sailing outside, Apoo arrived at Wano and contacted Kaido to inform him of his arrival to attend the Fire Festival along with the Numbers."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Apoo vs. Eustass Kid (postponed)", "elements": []}, {"text": "Apoo, X Drake, Basil Hawkins, and Urouge vs. Kizaru and a Pacifista", "elements": []}, {"text": "On Air Pirates vs. Big Mom Pirates (unseen)", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "He has only appeared in the Anichara Heroes, One Piece Amazing Log Collection, One Piece Super Deformed Figures and World Collectable series. He has not appeared in any other merchandise yet."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Apoofigure.png/revision/latest?cb=20130223205905", "caption": "Apoo in World Collectible."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Apoo's surname, Scratchmen, might be a reference to the act of scratching, a DJ technique in which sounds are manipulated by moving a vinyl record upon a turntable.", "elements": []}, {"text": "Like many One Piece characters, Apoo has his own unique laugh, which is \"Apapapapapapa\". His laughter also sounds like scratching a record on a turntable, fitting his character motifs.", "elements": [{"text": "Said laugh is also used by Apachai Hopachai from the History's Strongest Disciple Kenichi series. Although his usage of the sound isn't actually a laugh so much as it is a noise that he makes at times for comic relief.", "elements": []}]}, {"text": "Apoo appears as a Support Character in One Piece: Gigant Battle! 2 New World.", "elements": []}, {"text": "He is the first member of the Longarm Tribe to appear in the series. He is also the only known member of the Longarm Tribe to have eaten a Devil Fruit.", "elements": []}]}, {"type": "list", "elements": [{"text": "In both episodes 628 and 629 of the anime, Apoo's name is misspelled as \"Scratcimen Apoo\". This contradicts the manga's romanization of his name.", "elements": []}, {"text": "In the 5th fan poll, Apoo ranked 75th.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d9/Scratchmen_Apoo%27s_Misspelled_Name_in_the_Anime.png/revision/latest/scale-to-width-down/150?cb=20140621040542", "caption": "\"Scratcimen Apoo\"."}]}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Apoo's name was taken with 19th century real-life Chinese pirate Chui A-poo.", "elements": []}, {"text": "Apoo's favorite food is tom yam soup, and his least favorite food is mayonnaise.", "elements": []}, {"text": "If One Piece was set in the real world, then Apoo would be from China.", "elements": []}, {"text": "If Apoo was not a pirate, then he would be a DJ (disc jockey).", "elements": []}, {"text": "Apoo's hobbies are disk jockeying and surfing.", "elements": [{"text": "The latter hobby is somewhat ironic, as Apoo is a Devil Fruit user and surfing can be considered dangerous as Apoo would be at great risk of drowning.", "elements": []}]}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Disc jockey – Wikipedia article about the type of person Apoo resembles.", "elements": []}, {"text": "Chui-Apoo – Wikipedia article on the pirate who Apoo is named after.", "elements": []}]}], "images": []}]}