{"sections": [{"title": "Urouge", "level": 1, "content": [{"type": "paragraph", "text": "Urouge, also known as Mad Monk, is a pirate from a sky island and is the captain of the Fallen Monk Pirates. He is one of twelve pirates who are referred to as the \"Worst Generation\", and prior to the two-year timeskip had a bounty of 108,000,000."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Urouge is abundant in both height and width. His face somewhat resembles a smiling totem mask as he is nearly always seen grinning, even when he is unhappy; the only moments he is not seen smiling was when he was approaching Raijin Island, when he was confounded by the island spewing lightning nonstop, and again when he gives final benedictions to Kaido's jumping off a sky island. Apart from his smile, he also has what appears to be a stitched-up scar vertically descending over, and falling short just above his left eye. On his chin he has a prominent, jet-black, and scruffy beard that extends upwards to the sides of his jaw and then converges with his equally-dark side-burns. He seems to sport the short and clean-cut sort of hairstyle generally sported by monks. He also has black tattoos going down his shoulders that somewhat resemble fire."}, {"type": "paragraph", "text": "He dresses in similar robes to Divine Soldiers underneath the khaki robes he wears (which is also worn by the rest of his crew), which includes the white full-bodied garment with severed sleeves, that exposes tattoos patterned like flames on both biceps. He wears a pair of gold earrings, black gloves and a rather large red bead necklace. He also has a pair of large wings growing out from the middle of his back."}, {"type": "paragraph", "text": "In SBS Volume 64, Oda drew the Supernovas as children. Urouge is shown with the hairstyle and wings of the Skypieans', but as an adult his wings are more like the Birka natives."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Urouge's most prominent personality trait is that he is almost always smiling. Even when defeated or when believing himself to be near death he will still have a smile on his face, such as when he was he was heavily wounded by a Pacifista. The only times he has not been seen smiling are when his crew approached Raijin Island and when he prayed for Kaido."}, {"type": "paragraph", "text": "From what has been shown of Urouge so far he can be considered a brave man, as he was not afraid of fighting people with higher bounties than him, such as Killer. However, it is possible that he did not know his bounty or he knew that Killer had a high bounty because he notoriously attacks civilians. In spite of this though, he quit the battle when X Drake jumped in to halt the fight. Despite being brave he is not blind to danger either, for when he faced a Pacifista (who he believed was the real Kuma) and Kizaru at the same time, he frustratingly wondered if that was his end. However, even when facing death, he could still laugh at what he believed was a joke, made by Basil Hawkins, about his fate."}, {"type": "paragraph", "text": "Urouge seems to be respectful toward people's plights, as he did not stop Kaido when the Yonko attempted to commit suicide and instead prayed."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As one of the Worst Generation, Urouge is a powerful pirate, having managed to traverse and survive the dangers of the Grand Line."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Befitting his physique, Urouge has enormous strength, able to wield a large and heavy pillar as a makeshift mace, despite his size, he is deceptively fast with extremely sharp reflexes, able to keep up with Killer's tremendous agility and also hold his own against his fellow Supernova who has a significantly higher bounty in a fight before having their fight interrupted by X Drake."}, {"type": "paragraph", "text": "After the timeskip, Urouge was strong enough to defeat Charlotte Snack, one of Big Mom's Four Sweet Commanders with a bounty of 600,000,000 and one of the strongest members of the Yonko's crew, although he was later defeated by Charlotte Cracker, another Sweet Commander in the Big Mom Pirates. However despite his defeat, Urouge managed to survive and retreat."}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Urouge ate a Devil Fruit that allows him to convert some damage inflicted onto him into strength, which results in expanding muscles and body size. Using this ability he was able to exceed a Pacifista's body size and actually damage it with punches, although he was still vulnerable to its lasers and a kick from Admiral Kizaru."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8e/Muscular_Urouge.png/revision/latest/scale-to-width-down/210?cb=20130209040816", "caption": "Urouge increasing his muscle mass."}]}, {"title": "Attacks", "level": 4, "content": [{"type": "list", "elements": [{"text": "Inga Zarashi (因果晒し, Inga Zarashi, literally meaning \"Karma Exposure\"): After transforming to his gigantic, muscular size, Urouge punches his target multiple times with immense force. This was first seen used against a Pacifista. This is called Karmic Punishment in the Viz Manga, Retribution in the Funimation dub and Karma Exposure in the FUNimation subs.", "elements": []}]}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Urouge's choice of weapon appears to be a large piece of a pillar with a hexagonal base which he uses as a makeshift mace to pummel opponents. When not in use, it is mostly seen being carried on his shoulder."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was first seen having a brief brawl with Killer, of the Kid Pirates; and both were stopped by the former-marine-turned-pirate X Drake before either could do further damage."}, {"type": "paragraph", "text": "Urouge was next seen being told by his crew that a World Noble was coming their way. Though he refers to the nobles as \"nasty little things,\" he consents along with the other pirates and civilians to lower themselves to their knees to avoid any trouble. He respected Zoro for standing up and almost trying to kill one of them, while he himself preferred to \"sit it off\". He also pondered the strength of the Straw Hat Captain, to have such an incredible person as Zoro with such a high bounty serve under him."}, {"type": "paragraph", "text": "When reading of Ace's planned execution, he did not lose his eternal smile but seemed disturbed. When the news of Luffy attacking a World Noble spread, he called the Straw Hats \"troublesome\" but seemed impressed by their actions."}, {"type": "paragraph", "text": "He tried to sneak off to avoid confronting Admiral Kizaru but was attacked by a Pacifista. His strength seemed to prove no match for the cyborg and was thrown into the fight between Kizaru and Basil Hawkins. Upon noticing the Admiral, he began to panic but Hawkins assured him that he does not see death in Urouge's future. X Drake then rushed in to help him, knocking the Pacifista back with a strong kick. Using his devil fruit abilities, Urouge's muscle mass expanded, growing large enough to match the Pacifista in height and muscle mass."}, {"type": "paragraph", "text": "He began to fight back. With his new strength he was able to land powerful blows to the Pacifista causing it enough damage to hold it off. However, just as he began to gain the upper hand it shot a laser beam through his shoulder. With him down, the Pacifista turned its attention towards X Drake to fight. As Urouge rose to get his second wind, Kizaru attacked him from behind, kicking him at the speed of light through three buildings. Urouge was knocked out cold from this attack, severely wounded and bloodied. He was able to escape from the Admiral due to the Straw Hats distracting Kizaru."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b7/Urouge_Wields_His_Pillar.png/revision/latest/scale-to-width-down/210?cb=20170218235347", "caption": "Urouge wielding his pillar weapon."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/54/Urouge_vs._Pacifista.png/revision/latest/scale-to-width-down/210?cb=20130209042300", "caption": "Urouge fighting off a Pacifista."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was seen watching Ace's execution televised at Sabaody Archipelago, meaning that he managed to escape capture by the Marines."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the aftermath of the war, he is seen again commenting about Blackbeard."}, {"type": "paragraph", "text": "After the war at Marineford, he and his crew went to the New World. They followed their Log Pose to a dark and stormy island that was spewing lightning, with no way to have a ship docking there. A small boat approached his ship and an old woman appeared and offered the Fallen Monk Pirates some umbrellas."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4a/Urouge_in_the_New_World.png/revision/latest/scale-to-width-down/210?cb=20160801230003", "caption": "Urouge in the New World."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Sometime during the two-year timeskip, Urouge and his crew wandered into Big Mom's territory. Even though Urouge defeated one of the former Four Sweet Commanders named Snack, he was later sought after by Charlotte Cracker while Big Mom called a storm in a fit of rage. Urouge was swiftly defeated by Cracker and forced to flee like the other members of the Worst Generation."}], "images": []}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "After Luffy and Law's alliance defeated Doflamingo, Urouge was seen on a certain sky island with his crew, resting after getting injured. His crew then noticed that a mysterious stranger, the Yonko Kaido, had arrived on the island and was about to jump to his death."}, {"type": "paragraph", "text": "Urouge questioned Kaido's motives for suicide. He then told him that he would not stop him if he was serious about the suicide, beginning to pray as Kaido jumped."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/55/Urouge_Witnesses_Kaido%27s_Suicide_Attempt.png/revision/latest/scale-to-width-down/210?cb=20160801224851", "caption": "Urouge witnesses Kaido's suicide attempt."}]}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo along with his crew."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Urouge vs. Killer (interrupted by X Drake)", "elements": []}, {"text": "Urouge, X Drake, Basil Hawkins, and Scratchmen Apoo vs. Kizaru and a Pacifista", "elements": []}, {"text": "Urouge vs. Charlotte Snack (unseen)", "elements": []}, {"text": "Urouge vs. Charlotte Cracker (unseen in the manga, seen in the anime)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "A flashback of Urouge's attempted invasion of Totto Land is added in the anime. The flashback started with Urouge emerging victorious from his fight against Snack. Cracker confronted Urouge shortly afterwards and gave him a brutal beating."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Urouge is likely based off Grigori Rasputin, a Russian monk and healer who was known for his frequent love affairs with women. The epithet \"Mad Monk\" may be based off the film Rasputin the Mad Monk.", "elements": []}, {"text": "Urouge is the only Supernova to originate from a Sky Island instead of one of the Blue Seas.", "elements": []}, {"text": "Urouge has the lowest bounty of the Supernovas. However, his number of \"108\" is seen as a mystical number in Eastern religion (similar to Zoro's 108 Pound Cannon attack). In particular, the Japanese Buddhist believe that all men must resist 108 temptations before achieving Nirvana. In contrast, he is the oldest and tallest of the Supernovas and member of the Worst Generation, at age 47 and 388 cm.", "elements": []}, {"text": "In the 6th Japanese Fan Poll, Urouge ranked as the 50th most popular character in One Piece.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Urouge's birthday, August 1, comes from his pirate crew's name 'Fallen Monk Pirates' (破戒僧海賊団, Hakaisō Kaizokudan) since 8-1 can be derived from Ha-i.", "elements": []}, {"text": "Urouge's name was taken with 16th century real-life Ottoman pirate, Oruç Reis.", "elements": []}, {"text": "Oda said that Urouge's weapon is an oversized pencil.", "elements": []}, {"text": "Urouge's favorite foods are Adzuki beans and pork, and his least favorite food is vegetables.", "elements": []}, {"text": "If One Piece was set in the real world, then Urouge would be from India.", "elements": []}, {"text": "If Urouge was not a pirate, then he would be a cabaret club manager.", "elements": []}, {"text": "Urouge's hobbies are drinking alcohol, engaging in lovemaking, and travel.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oruç Reis – Wikipedia article on the real-life pirate Oruç Reis.", "elements": []}]}], "images": []}]}