{"sections": [{"title": "Trafalgar D. Water Law", "level": 1, "content": [{"type": "paragraph", "text": "Trafalgar D. Water Law, more commonly known as just Trafalgar Law (トラファルガー・ロー, Torafarugā Rō) and by his epithet as the \"Surgeon of Death\", is a pirate from North Blue and the captain and doctor of the Heart Pirates. He is one of twelve pirates who are referred to as the \"Worst Generation\". He became one of the Shichibukai during the timeskip, but his position was revoked for allying with the Straw Hat Pirates and bringing down Donquixote Doflamingo. Law, like many other pirates, dreams of finding the One Piece."}, {"type": "paragraph", "text": "During the timeskip, his bounty increased from 200,000,000 to 440,000,000, before it was frozen. After he was expelled from the Shichibukai, Law's bounty was raised to 500,000,000."}, {"type": "paragraph", "text": "He is one of the central allies of the Straw Hat Pirates during the Dressrosa and Yonko Sagas."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Law is a slim man of a relatively tall height. He has faint shadows right under his yellow eyes (grey in the anime), and his mouth is usually seen in a smile. He wears a northern-style fur hat, which is white and has a spotted pattern along the bottom and the bill. He has short dark hair, a majority of which is obscured by his hat, save for his sideburns and small goatee. His hair color is depicted as black in both the anime and manga, though sometimes the manga depicts it as blue."}, {"type": "paragraph", "text": "He has many tribal-style tattoos on his arms; on both of his hands are letters spelled as D E A T H tattooed in black on each of the back of his fingers. Originally in the manga, his left thumb was not tattooed, with the letter A missing. Later on, all of his fingers were tattooed complete with all five letters. He also has a black cross on the back of both of his hands. On his chest, he has a tribal-style heart tattoo with his Jolly Roger on it. He has simpler heart tattoo on his shoulders and his Jolly Roger tattooed on his back."}], "images": []}, {"title": "Before the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "He is seen wearing a yellow hoodie, with black sleeves and black hood. The hoodie has his Jolly Roger printed on the front of the chest area in dark ink, and he keeps the sleeves rolled up. Law wears a northern-style fur hat that has a rim running all around it. It is white in color, and has a black dot pattern along the rim and lower areas of the hat. Law also sports a pair of jeans with odd dots on both the knee and ankle areas, similar to the ones on his hat, but darker in color. He sports a pair of dark, pointed shoes. He has a pair of small earrings on each ear."}, {"type": "paragraph", "text": "In SBS Volume 64, Oda drew the Supernovas as children. Law is shown with his fur hat and his faint shadows right under his eyes, but wore the uniform for the medical academy he was attending: a blue lab coat with a red tie, dark blue shorts and green shoes. He was also holding a scalpel on his right hand and a frog on his left hand, since he was already in training to become a surgeon with his father being his teacher. After escaping Flevance, Law lost his tie and lab coat, and his shirt underneath became more raggedy, and his shorts have white spots on them. Because of his heritage, he inherited the Amber Lead Syndrome that accumulated throughout the generations of Flevance, which left his skin white and pallid until he obtained his cure."}], "images": []}, {"title": "After the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "In Oda's depiction of the Supernovas post-timeskip, he seems to have lost the fur rim of his hat, and replaced it with a thick bill, turning it into a rather spherical hat resembling a Wool Skipper. His goatee has become somewhat scruffier, and his right hand now also has the fingers tattooed. He now wears a yellow t-shirt similar in appearance to his old hoodie. He wears a black hoodie over the t-shirt, which features his Jolly Roger on the chest area in yellowish-orange ink. The sleeves of the hoodie are no longer rolled up, and it now has a fluffy fur collar."}, {"type": "paragraph", "text": "During the Punk Hazard Arc, Law wears a long black coat with his crew's jolly roger along the hem and on the sleeve."}, {"type": "paragraph", "text": "During the Dressrosa Arc, he wears an open black coat with a hood which features the word Corazon on the back. During his second confrontation with Doflamingo, Law's right arm was cut off. It is later reattached by Leo and healed by Mansherry."}, {"type": "paragraph", "text": "During the Zou Arc, Law changed into a dark, short-sleeved shirt with a light-colored heart pattern on the lower left side. He also bears stitch marks on his right arm after it being reattached by Leo."}, {"type": "paragraph", "text": "During the Wano Country Arc, Law wears a black and white yukata with his two Jolly Roger, an orange sash, a brown jittoku with yellow five-petal flower patterns and spots, and zōri. He briefly wears a tengai to hide his identity from his enemies such as Hawkins."}], "images": []}]}