{"sections": [{"title": "Basil Hawkins", "level": 1, "content": [{"type": "paragraph", "text": "Basil Hawkins is an infamous pirate from North Blue known as the \"Magician\" and the captain of the Hawkins Pirates. He is one of twelve pirates who are referred to as the \"Worst Generation\". His previous known bounty amounted to 249,000,000, but after the timeskip, it was raised to 320,000,000. After encountering Kaido, he joined the Beasts Pirates and became one of the crew's Headliners."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Hawkins is a tall man, with black triangle symbols on his eyebrows, red eyes, and golden hair that reaches down to his hips. He also has a black cross tattooed at the base of his throat that is at the front of his neck."}, {"type": "paragraph", "text": "His attire includes a pure white coat with a ruffled neckline and sleeves. He also wears purple trousers tucked inside black boots with white laces on them and a dark ornament made of fur circling the lower part of his torso, with a lighter shade in the middle of it. He also has a pink sash tied around his waist, with a piece of jewelry hanging from it. Hawkins also wears dark gloves similar to those worn by Blueno of CP9, and an armor-like armlet can be seen on his left arm around his left biceps, which also extends to cover his left shoulder. On his right hip he carries a sword with an elaborate pommel that resembles a voodoo doll."}, {"type": "paragraph", "text": "In SBS Volume 64, Oda drew the Supernovas as children. Hawkins is shown with much shorter hair and wore a similar coat to the one he wears now but in pink. He wore light and dark green striped pants. He is also shown with his trademark stoic expression, possibly partaking in a tarot card reading."}, {"type": "paragraph", "text": "After the timeskip, he changed the white cloak to a dark blue, green and black checkered pattern, reminiscent of a Scottish kilt, a pink sash on an orange, on which hangs the same ornament. Also, he wears the same black fur belt, but already with blue ornament instead of red, the same black and purple armor, but at the same time stopped wearing gloves. In addition, his hair and skin became lighter."}, {"type": "paragraph", "text": "During the Wano Country Arc, he wore a long black cape, a dark shirt with a ruffled collar (white in the anime) low enough to show his tattoo, a brown glove on his left hand, purple trousers with a checkered pattern with ruffles from the hems, a cream-colored cravat fastened by a dark cross-shaped pendant, and brown boots. He also wore a black and red violet armor-like armlet."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Hawkins portrays himself in a noble and enigmatic manner. In particular, he has a notion about foretelling the fate of everything that he sees. He notes the potential of death and fate in things from a person's clothing to other pirates."}, {"type": "paragraph", "text": "He almost always remains completely calm regardless of the situation, showing no emotional response after Roronoa Zoro nearly attacked a World Noble or after learning the news of Portgas D. Ace's upcoming execution, events which drove many other members of his crew and other Captains to panic. When approached by Kizaru, he calmly used his cards to calculate all the probabilities of the battle, and upon foretelling that he would not die, remained calm even when subsequently attacked. He seems to be always serious, and before the battle with Brownbeard, coldly commented that he hates jokes. However, he has been seen expressing outward shock, as seen when Urouge increased in size while battling against a Pacifista. He is not weak toward women's bodies, and so was able to carry out a raid in a mixed-gender bathhouse without issue, unlike his fellow Supernova X Drake."}, {"type": "paragraph", "text": "He appears to be against the idea of needless violence in social situations, as seen when he stopped his crewmate from attacking a waiter after the latter accidentally spilled spaghetti all over his clothes, even apologizing to the waiter himself. Hawkins even surmised the possibility that Luffy and Zoro were at Wano on vacation when he encountered them there, and even politely suggested to the two Straw Hats that they should just take their leave before trouble brews. This hints that Hawkins would have simply allowed them to leave without risk of confrontation had the Straw Hats complied. However, despite this, in battle, he is very cruel and ruthless, having slain almost all of Brownbeard's crew and left Brownbeard on the verge of death and left him without the use of his legs. His voodoo-power itself implies cruelty and apathy, as he lets other people suffer the damage that he would otherwise sustain and apparently has no problem with it. He also had no problems using Law's crewmates as avatars for his dolls to prevent Law from attacking him, even slicing his own arm to injure Shachi's, and to force Law to surrender. However, he seems to have an honorable side as he agreed to release Law's men after Law offered to surrender himself in exchange for his crew's freedom."}, {"type": "paragraph", "text": "Hawkins appears to be confident in his foretelling abilities and Devil Fruit. When Admiral Borsalino came to Sabaody Archipelago after Luffy punched a World Noble, he stayed when he predicted he will not die. True to his prediction, even after being defeated by Borsalino, Hawkins wasn't killed as Borsalino went after the Straw Hat Pirates. When hearing about a ship arriving at Wano, Hawkins went to Kuri Beach to take care of the commotion himself, where he briefly clashed with Luffy and Zoro, two infamous pirates from the Worst Generation. When hearing about the trouble Luffy was causing in Bakura Town, Hawkins headed there himself where he briefly clashed with Law, another infamous pirate of the Worst Generation. Hawkins doesn't underestimate his opponents, as he advised his subordinates not to fight Luffy head on and noted that he and Law are troublesome, even acknowledging Law's Devil Fruit when he clashed with him in Bakura Town."}, {"type": "paragraph", "text": "Although confident in his own abilities, he is pragmatic to choose submission over death for the sake of his pride. When Kaido confronted the alliance that Apoo betrayed, Hawkins chose to join Kaido over fighting him, knowing full well he has no chance of survival for being defiant, even if it means betraying his alliance with Kid."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Crew", "level": 3, "content": [{"type": "paragraph", "text": "Hawkins' crew appears to be quite loyal to him and will, without fail, follow his every imperative to the last word. In the anime, they were even willing to attempt to hold Kizaru at bay to buy their captain some time to escape when the Admiral suddenly appeared, confronting Hawkins' entourage."}], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Eustass Kid and Scratchmen Apoo", "level": 4, "content": [{"type": "paragraph", "text": "After the time skip, he had formed an alliance with Eustass Kid and Scratchmen Apoo. Not much is known about his relationship with them, but Hawkins was willing to cooperate with them in order to defeat Shanks of the Yonko."}, {"type": "paragraph", "text": "They seem to have gotten on more amicable terms with each other as the three captains and their crews were able to dine together. However, after encountering Kaido, and Apoo's allegiance revealed, Hawkins chose to be the Yonko's subordinate instead of his enemy, while Kid was imprisoned after being defeated. After Kid was freed, he declared that the alliance was over, due to being betrayed."}], "images": []}, {"title": "Beasts Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Hawkins and his crew allied with Kaido after their confrontation with him. He has no regard using the Pleasures as dummies for his Devil Fruit."}], "images": []}, {"title": "Wano Military", "level": 4, "content": [{"type": "paragraph", "text": "Since Hawkins allied himself with Kaido, he also became allies with Kurozumi Orochi. Hawkins seems to hold a very high position, as Orochi's men call him \"Master\" and he is allowed to use them as dummies for his Devil Fruit."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "As a member of the Worst Generation, Hawkins is a major enemy of the Marines. He was nearly killed by Kizaru at Sabaody Archipelago before Apoo intervened."}], "images": []}, {"title": "Brownbeard", "level": 4, "content": [{"type": "paragraph", "text": "During his encounter with Brownbeard on Foodvalten, Brownbeard attempted to deter Hawkins by boasting about his bounty, but Hawkins responded to Brownbeard's threats by mocking him and then taking away the use of his legs, effectively ending Brownbeard's career as a pirate. This confrontation caused Brownbeard to develop a grudge against him."}], "images": []}, {"title": "Trafalgar Law", "level": 4, "content": [{"type": "paragraph", "text": "Hawkins appeared to have no enmity towards Law while at Sabaody Archipelago. However, during their confrontation in Bakura Town, they engage in a brief skirmish. Hawkins notes their alliance has infiltrated Wano Country which was surprising and muses that Law wants to kill him to prevent him from informing Jack. After Law retreats from the battle, Hawkins notes that Law is troublesome."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Hawkins appeared to have no enmity towards Luffy despite the fiasco he caused at Sabaody Archipelago. Surprisingly, he became interested enough in the Straw Hat captain to perform a fortune telling on his chances of surviving the Battle of Marineford but it never reached zero. During their confrontation in Kuri, Hawkins briefly fought Luffy and his companions, but allowed them to retreat after a poor tarot reading in Luffy's favor. Despite this, Hawkins notes that Luffy is troublesome and resumed pursuing him until the latter was defeated and captured by Kaido."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Hawkins is a fearsome pirate who, along with his crew, managed to survive the first half of the Grand Line and to enter the New World. His reputation granted him an astonishing bounty of 320,000,000, the fifth highest amongst the Supernovas, the same as Roronoa Zoro, and was strong enough to deal a crippling defeat to the entire Brownbeard Pirates. Another testament to his strength is the fact that he was able to injure Zoro, a person who barely got himself injured after his timeskip training, a feat only a few were able to do. As a Headliner, he holds a high position in the Beasts Pirates, had authority over lower-ranking members, and was one of the top authorities in Bakura Town along with Holdem and Speed."}], "images": []}, {"title": "Fortune Telling and Tarotology", "level": 3, "content": [{"type": "paragraph", "text": "Hawkins often speaks like a fortune teller and has been noted to mention reading \"signs\". He can use tarot cards to apparently assist him in determining the outcome of any event, as well as the likelihood of his own success. This proves to be very helpful in many situations, as it allows him to determine the outcome of a battle and act accordingly."}, {"type": "paragraph", "text": "His cards allow him to work out to a percentage of the chances of something happening. His predictions seem to be accurate quite often, as he was able to predict that he and his crew as well as the other Supernovas, would not perish at the hands of Kizaru. He also predicted that Luffy had a chance of surviving his injuries sustained in the war. It is yet to be explained how he is able to do this. He was wrong about his prediction concerning Brownbeard's fate though, as Hawkins said he saw the shadow of death in Brownbeard's face. Brownbeard however, survived. It is possible though that Hawkins was simply trying to scare Brownbeard. It is also possible he said this to mean that Brownbeard would come close to death (which he did) or be surrounded by his dead crewmates."}], "images": []}, {"title": "Tarot Cards", "level": 4, "content": [{"type": "paragraph", "text": "Hawkins is shown using a deck of 72 Tarot Cards. Originally used blue cards with a dark gray border and a yellow four-pointed star in the middle over a dark blue burst. After the timeskip, his cards are red with a yellow border and a dark red star over a black burst. In the anime, he went back to using blue cards during the Wano Country Arc."}, {"type": "paragraph", "text": "When using his cards, he is initially seen attaching them to straw capable of housing a card on each stalk. After the timeskip, he is somehow capable of making his cards levitate in the air while he reads them. The anime shows him still using the straw at first before correcting this later. In the anime, starting in the Wano Country Arc, the cards seem to glow either bluish white or pinkish purple when he uses them."}, {"type": "paragraph", "text": "Hawkins also uses his cards in combat by drawing them and whatever effect they have on them. However, doing so is a double-edged sword, with the results as likely to be detrimental to him and his forces as being beneficial to them. He claims that the more risk he bears, he'll have a greater chance of being granted a good card. The effects of a card can change depending on whether it is drawn reversed or not."}, {"type": "paragraph", "text": "The card effects revealed are:"}, {"type": "list", "elements": [{"text": "The Fool:", "elements": [{"text": "Reversed: Hawkins described it as the most unfortunate card to draw since it's the card of internal discord. It caused some of his men to attack each other.", "elements": []}]}, {"text": "The Hierophant:", "elements": [{"text": "Reversed: Hawkins described it as the card of retribution. While its exact effects are unknown, it seemingly made Hawkins' Strawman technique bigger and stronger.", "elements": []}, {"text": "Upright: Hawkins described it as a support card and it allowed him to predict that someone would help his enemies escape.", "elements": []}]}]}], "images": []}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Hawkins ate the Wara Wara no Mi, a Paramecia-type Devil Fruit that allows him to create and manipulate straw. He can cover himself in straw and make scarecrow-like straw avatars to aid his offense, and these creations also gain nail-based weapons."}, {"type": "paragraph", "text": "By using the straw to create straw voodoo dolls, he is able to redirect any instances of physical damage inflicted upon him to another person, leaving him unharmed but forcing his victim to take the damage amounting to what he would have. He was able to consecutively withstand a kick and a laser blast from Kizaru, the former having knocked him through a building. After bodily damage is taken, voodoo dolls that represent the people who took the damage are shed from his body, showing the effects of the attack. However, attacks on Hawkins' straw creations will harm him as well."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Basil_Hawkins%27_Voodoo_Dolls.gif/revision/latest?cb=20180807211518", "caption": "Hawkins' voodoo doll ability."}]}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Hawkins has great skill in swordsmanship supplemented with his Devil Fruit powers. He wields a sword created out of the straws produced by his power, allowing him to form a flexible yet sharp whip-like single-edged blade. He used it to pierce a steed that was thrown at his direction, stopping the creature from crashing into him. Hawkins can also use the pommel as a medium to produce his \"Straw Man's Card\" puppet, and to guide the puppet's movements."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d1/Basil_Hawkins_Faces_Brownbeard.png/revision/latest/scale-to-width-down/210?cb=20141206174909", "caption": "Hawkins draws his sword on Brownbeard."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Hawkins was born in North Blue on September 9, 31 years prior to the current storyline. Growing up, he became familiar with the characters from the popular comic strip Sora, Warrior of the Sea."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Hawkins was in a restaurant along with fellow Supernova Capone Bege and Jewelry Bonney with their crews. A waiter accidentally spilled food on one of his crew members. His crewmate complained only to be told by Hawkins it was a very unlucky day for him."}, {"type": "paragraph", "text": "Upon hearing of Monkey D. Luffy's attack of a World Noble, he was the only one whose position as to leaving or staying was unclear - all he said was that \"There is no need to rush. Our destiny has already been decided.\""}, {"type": "paragraph", "text": "Kizaru came across Basil Hawkins sitting down, surrounded by his entourage of crewmen while he simply stated that he would not die today. After sitting down and working out his chances against the Admiral, Kizaru attempted to take out Hawkins, only to find that his attacks did not have an effect and Hawkins remained unhurt. He released two straw dolls from his right arm, then stated that ten men would not suffice against Kizaru. The battle is joined by Urouge and X Drake, as well as one of the Pacifista on the archipelago."}, {"type": "paragraph", "text": "After Kizaru sent Urouge flying, Hawkins activated his \"Goma no So\" and transformed into a giant scarecrow in liking of a large voodoo doll baring Hawkins' semblance in order to defeat the admiral. He is blinded by the latter who then deduced that Hawkins' ability is not a Logia type as he fired multiple blasts into Hawkins, eliminating the remaining eight voodoo dolls in him. Hawkins would have been killed, had it not been for the intervention of Scratchmen Apoo."}, {"type": "paragraph", "text": "However, Kizaru reformed himself, dispatched Apoo easily, and then turned his attention to the two remaining Supernovas. After defeating Drake with a light speed powerful kick, Kizaru defeated Hawkins by firing a light-based arrow into his abdomen. The admiral was about to finish him off, when he was suddenly interrupted by his Den Den Mushi, which saves the Magician from death."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e3/Basil_Hawkins_Attacks_Borsalino.png/revision/latest/scale-to-width-down/210?cb=20130521022045", "caption": "Hawkins attacking Kizaru in his \"Goma no So\" transformation."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Hawkins watched Portgas D. Ace's execution televised at Sabaody Archipelago, meaning that he managed to escape capture by the Marines. Hawkins was also predicting the chances of survival for Whitebeard's crew, but his outcome was never seen."}, {"type": "paragraph", "text": "Hawkins sailed to Marineford and watched the battle from a safe distance. He predicted the survival rate for Luffy and found it strange that no matter how many times he tried, it never hit zero."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war at Marineford, he and his crew entered the New World and reached Foodvalten, which was under Brownbeard's control. Hawkins casually angered Brownbeard by asking his name, twice, and then simply ignored the other mumblings of his glory and commented that his name is ridiculous. Brownbeard asked if he was joking. Hawkins then proceeded to tell Brownbeard two things: first, he hates jokes and second, he sees the shadow of death upon Brownbeard. He then unsheathed his sword and activated his \"Goma no So\", preparing to attack Brownbeard and his crew. In the ensuing conflict, Hawkins defeated Brownbeard and his crew. Brownbeard lost the use of his legs in the process."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f2/Basil_Hawkins_at_the_New_World.png/revision/latest/scale-to-width-down/210?cb=20120816025706", "caption": "Hawkins making a prediction and scoffing at Brownbeard's."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Punk Hazard Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the events surrounding Punk Hazard, Hawkins is revealed to have arrived (on invitation) at Eustass Kid's base in the New World. In one of the main rooms, he was shown waiting patiently at the table while Scratchmen Apoo was tearing the place apart. Appearing indifferent to the fight that quickly broke out between the two other captains, Hawkins wearily commented on wanting to leave before Killer was able to calm the others down, and revealing their intention to create an alliance with the On Air and Kid Pirates."}, {"type": "paragraph", "text": "A newspaper later revealed that the three captains came to an agreement and formed an alliance. The trio began plans to overthrow one of the Yonko."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Kid%2C_Apoo%2C_and_Hawkins_Alliance.png/revision/latest/scale-to-width-down/210?cb=20160414151632", "caption": "Kid, Apoo and Hawkins meeting in the New World."}]}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "While dining together, Kid, Hawkins, and Apoo heard the news of Donquixote Doflamingo's defeat. They figured that Luffy and Law were after Kaido since Doflamingo was connected to him. They were pleased that Luffy and Law were not after the same Yonko as them, whom they revealed to be Shanks."}, {"type": "paragraph", "text": "Sometime later, Hawkins and the others were alerted by what seemed to be an earthquake. They quickly investigated the source of the commotion, which was a large crater on the ground in the shape of a human. The alliance then came face-to-face with the Yonko, Kaido. Since there was no chance of victory nor escape, Hawkins willingly submitted to Kaido."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f8/Kid_Alliance_facing_Kaido.png/revision/latest/scale-to-width-down/200?cb=20160501075538", "caption": "The allied pirates find themselves facing Kaido."}]}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "He is one of the attendees at the Pirates Expo along with his crew."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "Hawkins and his crew became Kaido's subordinates. After hearing that a ship arrived at Wano and that they lost communication with the scouts, Hawkins told his men not to report to Kaido yet, as he would take care of it. On the way to Kuri Beach, Hawkins found Luffy and Zoro in a wasteland and confronted them."}, {"type": "paragraph", "text": "Hawkins then read Luffy and Zoro's fortune, saying that they had a 19% chance of surviving at the end of the month. As Hawkins' men attacked Luffy and Zoro, Luffy threw one of their giant lizards at Hawkins, but the latter stopped it with his straw sword. Zoro attacked Hawkins with a flying slash to the face, but the damage was redirected to one of his men. After explaining about his Wara Wara no Mi ability, Hawkins conjured a giant straw entity and drew the Fool card in reverse position, which made his men attack each other. Komachiyo then dragged Luffy and Zoro away from the battle, but Hawkins drew another card, the Hierophant in reverse position, which prompted him to make the straw entity pursue the Straw Hats. After Zoro sliced the straw figure in two, Hawkins drew the Hierophant again, signifying that someone would help them escape."}, {"type": "paragraph", "text": "Later, after receiving a report that Straw Hat Luffy was causing a commotion in Bakura Town, Hawkins advised them not to take him on and quickly headed there himself. After entering the town, Hawkins was confronted by Law, who was wearing a tengai to disguise himself."}, {"type": "paragraph", "text": "Law then activated his \"Room\" and attacked Hawkins, who used his own power to avoid a hit. However, Law's transferred attack did not kill Hawkins' subordinate, and allowed Hawkins to uncover his attacker's identity. Hawkins then removed Law's mask, but not before Law took out all of Hawkins' subordinates around them. Law then blocked Hawkins' attack with his sword and told Hawkins he only wanted to scare him off. Their conversation was abruptly interrupted when Zoro and Kiku arrived on the stolen food cart, heading toward Okobore Town. While surveying the aftermath of Holdem's confrontation with Luffy, Hawkins reported Holdem's defeat."}, {"type": "paragraph", "text": "After Kaido appeared at Okobore Town in a drunken state, Hawkins quickly went there and told Kaido that Luffy and Law were hiding in the ruins of Oden Castle to prevent a rampage, though Hawkins did not know that Luffy and Law were actually hiding in the ruins in the first place. Hawkins explained to Jack that there were rumors that suspicious lights were coming from the mountain and the destruction of the castle would ease the shogun's fears. After Kaido destroyed Oden Castle, Hawkins commented that it was not enough to get him sober. He then witnessed Luffy's futile attempt to defeat Kaido. After Luffy was overwhelmed, Hawkins pierced Law with a seastone nail before he could retrieve Luffy. Though Law escaped, Hawkins swore to capture him."}, {"type": "paragraph", "text": "At the Flower Capital, Hawkins accompanied Drake and Page One while they were on their way to punish a soba shop owner for beating up some of Kyoshiro's henchmen."}, {"type": "paragraph", "text": "The next day, Hawkins and Drake led a group to raid a bathhouse and look for people with the Kozuki Family's crescent moon symbol on their ankles. Hawkins noticed Nami hiding behind Shinobu and tried to fish her out, causing her to disrobe and expose Sanji's presence, prompting Drake to come into the bathhouse. Upon seeing Sanji in his Raid Suit, Hawkins and Drake recognized him as Stealth Black. After Sanji and his group escaped the bathhouse, Hawkins and Drake continued with their patrol in the capital."}, {"type": "paragraph", "text": "Hawkins and Drake later stood guard at the prison in the Rasetsu District where Shimotsuki Yasuie‎ was imprisoned and scheduled to be executed. When they heard that the residents of Ebisu Town had intruded in the capital, Hawkins commented that Yasuie was a more important figure than they thought. When Orochi later tried to kill Toko after executing Yasuie, Hawkins and Drake witnessed Zoro and Sanji saving the girl. In the chaos that ensued when the Straw Hat Pirates raided the plaza, Hawkins stood guard beside the prisoners. He soon confronted Law when he came to rescue his crewmates. After Law noticed the absence of Bepo, Hawkins stated that only a fool would keep all hostages in the same place, before maliciously revealing that he had linked himself to Law's subordinates. He then inflicted a wound on his arm, which caused Shachi's arm to be cut, thus warning Law that he would not be defeated unless Law killed his three subordinates. However, Law offered to surrender himself in exchange for the freedom of his crewmates, to which Hawkins agreed. Hawkins then freed the three of them from his powers and released them from prison, putting Law in their place."}, {"type": "paragraph", "text": "Sometime later, while Law was locked in a cell in the Flower Capital, Hawkins prepared to interrogate him about his alliance's plans in Wano. However, after receiving help from an unknown figure, Law subdued Hawkins and cut him into pieces. Law then forced Hawkins at blade point to tell him about what had occurred with his alliance with Kid and Apoo, to which a bloodied Hawkins explained Apoo's deception and his forced submission to Kaido. Hawkins then asked Law if he had changed his mind concerning his alliance with Luffy after hearing his story, but before he could get an answer, Law slashed Hawkins before commenting that was none of his business."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/7a/Hawkins_Vs._Straw_Hats.png/revision/latest/scale-to-width-down/200?cb=20190818025822", "caption": "Hawkins facing Luffy and Zoro."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/77/Law_Attacks_Hawkins.png/revision/latest/scale-to-width-down/210?cb=20191013030701", "caption": "Law cuts Hawkins."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/12/Law_Interrogates_Hawkins.png/revision/latest/scale-to-width-down/200?cb=20190902182229", "caption": "Hawkins being interrogated by Law."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Basil Hawkins, X Drake, Urouge, and Scratchmen Apoo vs. Kizaru and a Pacifista", "elements": []}, {"text": "Basil Hawkins vs. Brownbeard and his crew (unseen)", "elements": []}, {"text": "Basil Hawkins and his men vs. Monkey D. Luffy and Roronoa Zoro", "elements": []}, {"text": "Basil Hawkins vs. Trafalgar D. Water Law (Bakura Town)", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "For a long time, it was unknown what type of cards Hawkins uses for his cartomancy since only the back was shown."}, {"type": "paragraph", "text": "The cards were shown to be tarot cards in the anime when the Death card was seen in Episode 474 during the Marineford Arc, but this was non-canon. They were not canonically confirmed to be tarot cards in the manga until almost eight years later in Chapter 913 during the Wano Country Arc when Hawkins drew the Fool and then the Hierophant cards. Their designs were also more simplistic than the Death card shown in the anime earlier."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e7/Hawkins_Card_Anime.png/revision/latest/scale-to-width-down/155?cb=20190907030053", "caption": "The Death card in the anime."}]}, {"title": "Merchandise", "level": 2, "content": [{"type": "paragraph", "text": "So far he has only appeared in the Anichara Heroes, One Piece Amazing Log Collection, One Piece Super Deformed Figures, One Piece Full Face Jr. and World Collectable series."}, {"type": "paragraph", "text": "He is also set to be released in Super Modeling Soul One Piece."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/df/Hawkins_World_Collectable.png/revision/latest?cb=20130215205312", "caption": "Hawkins in World Collectable."}]}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece Treasure Cruise", "elements": []}, {"text": "One Piece Bounty Rush", "elements": []}, {"text": "One Piece: Pirate Warriors 4", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Oda revealed in One Piece Color Walk 7 Tyrannosaurus that Hawkins was originally going to join the Shichibukai.", "elements": []}, {"text": "Hawkins is the name of the protagonist of the famous pirate novel Treasure Island.", "elements": []}, {"text": "In the 6th fan poll, Hawkins ranked 75th.", "elements": []}, {"text": "Hawkins' epithet may be a reference to the first Major Arcanum in most traditional tarot decks, The Magician (\"Majutsushi\" in Japanese).", "elements": []}, {"text": "He follows the Beasts Pirates' card theme by referencing the fact that magicians commonly use cards to do their tricks.", "elements": [{"text": "His usage of Tarot cards also follow this theme.", "elements": []}]}, {"text": "While a standard real world Tarot deck has 78 cards, the anime showed Hawkins using one with only 72 cards.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "Hawkins' birthday, September 9, in Japan is known as 'Fortune-telling Day' (占いの日, Uranai no Hi), a reference to his fortune-telling abilities. He shares his birthday with Shyarly, a fellow fortuneteller.", "elements": []}, {"text": "Hawkins' name is derived from a real life pirate and a privateer. His surname comes from Basil Ringrose, while his given name comes from John Hawkins.", "elements": []}, {"text": "Hawkins' favorite food is fortune cookies, and his least favorite food is meat.", "elements": []}, {"text": "If One Piece was set in the real world, then Hawkins would be from Egypt.", "elements": []}, {"text": "If Hawkins was not a pirate, then he would be an interior designer.", "elements": []}, {"text": "Hawkins' hobbies are interior designing and taking baths.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Cartomancy – Wikipedia article about the method of divination Hawkins uses.", "elements": []}, {"text": "Hoodoo – Wikipedia article about the folk-magic Hawkins' Devil Fruit power is based on.", "elements": []}]}], "images": []}]}