{"sections": [{"title": "Shakuyaku", "level": 1, "content": [{"type": "paragraph", "text": "Shakuyaku, most commonly known by her nickname Shakky, is the bartender of Shakky's Rip-off Bar on the Sabaody Archipelago. She is a former pirate, the wife of Silvers Rayleigh, and is also known for once being chased by the legendary Marine, Monkey D. Garp."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Shakky is a relatively slim and tall woman with short black hair, with two tufts pointing upwards and is always seen smoking a cigarette. She looks very young despite her old age."}, {"type": "paragraph", "text": "She typically wears a pink, v-neck t-shirt that exposes her stomach with a black spider on it beneath a black jacket with pink lines running down the sleeves that has a collar with wing-like cuffs. She also wears a yellow beaded necklace, pants that have a giraffe-like pattern, and a belt with a white cardigan tied around it. She also wears white shoes and has painted fingernails."}, {"type": "paragraph", "text": "Twenty-two years ago, her physical features looked exactly as it does now, but with certain subtle clothing differences. She had a more revealing A-shirt with the same color and spider-motif she sports in the current storyline, but paired with short pants. She also did not wear her necklace of beads, nor her jacket."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Shakky is very knowledgeable and seems to constantly seek information - particularly on other pirates. She also reads the newspapers in what one could assume to be an obsessive manner, as she believes strongly that knowledge is power. She was the one who informed Luffy of all of the nine other pirates whose bounties exceed 100,000,000. She is rarely seen without a cigarette. Shakky is also highly intuitive, being able to guess Hancock's and Luffy's Impel Down penetration plan, even knowing that Hancock had fallen in love with Luffy."}, {"type": "paragraph", "text": "She also seems intent on keeping her age a secret; Luffy asked her how old she was when he heard that she had quit being a pirate forty years ago, but she immediately changed the subject, though she mentioned that she had been chased by Luffy's grandfather. After meeting Luffy for a short time, she is impressed by him, and states that she's rooting for him to become the Pirate King, particularly since she is aware that Silvers Rayleigh was the first mate of Gol D. Roger and is aware that Roger and Luffy are similar."}, {"type": "paragraph", "text": "Shakky is also fond of teasing people, like teasing Chopper into believing he had to pay 100,000 for cotton candy. She is infamous for charging exorbitant prices for her goods, but she made an exception for Hatchan and the Straw Hats."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Rayleigh", "level": 4, "content": [{"type": "paragraph", "text": "Rayleigh is Shakky’s business partner and husband. When he had gone missing for the previous six months before her introduction, she was not worried because she knew what Rayleigh is capable of. Shakky guessed that the Straw Hats might be able to find Rayleigh at Sabaody Park. After the Straw Hat Pirates returned from the Human Auctioning House, where they found Rayleigh, he and the entire Straw Hat crew gathered at Shakky's bar. Rayleigh trusts her implicitly and he knows her qualities. With her deductions, Rayleigh managed to find Luffy after the war."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Hatchan", "level": 4, "content": [{"type": "paragraph", "text": "Hatchan is well acquainted with Shakky, and is one of the handfuls of people who she made an exception for when it comes to paying exorbitant prices for goods at her rip-off bar."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Shakky is a supporter of the crew. She let them stay at her bar when they arrived on Sabaody Archipelago and told them about Rayleigh."}, {"type": "paragraph", "text": "Shakky took a great interest in them, as she told Luffy of her past with his grandfather and later stated she was a supporter after learning of his views on being Pirate King."}], "images": []}, {"title": "Gorgon Sisters", "level": 4, "content": [{"type": "paragraph", "text": "Shakky helped shelter the Gorgon Sisters after their escape from the World Nobles along with Gloriosa and Rayleigh."}], "images": []}, {"title": "Gloriosa (Elder Nyon)", "level": 4, "content": [{"type": "paragraph", "text": "Gloriosa is good friends with Shakky and Rayleigh. Before her return to Amazon Lily, Gloriosa lived with Rayleigh and Shakky on Sabaody Archipelago while sheltering the Gorgon Sisters after their escape from the World Nobles."}], "images": []}, {"title": "Rosy Life Riders", "level": 4, "content": [{"type": "paragraph", "text": "After the timeskip, Duval is seen bandaged up and hooked up to an IV on a bed in Shakky's Rip-off Bar along with his crew."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "It is known that Shakky was once chased by the legendary marine when she was a pirate, over 42 years ago. Despite their enmity, she doesn't seem to hold a grudge against him, as seen when she showed no ill will to his grandson and told him of their past encounters."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "At her first appearance, she easily beat up three large sized pirates who are larger than her to a bloody pulp before throwing them out, and she claims to have survived being chased by Garp, who is legendary for his strength as one of the strongest Marines."}], "images": []}, {"title": "Intelligence Gathering", "level": 3, "content": [{"type": "paragraph", "text": "Shakky is always well-informed and always up to date. She can give any information that the Straw Hats may need such as information about the Eleven Supernovas. She always follows the information from the daily newspaper and she is always able to make the assessment based on how the news react to the movements of pirates."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "She gave up the life of a pirate 42 years ago to open a bar. At some point she formed a partnership with and married Silvers Rayleigh. She also protected the Gorgon Sisters, with the help of a younger Rayleigh and a younger Nyon, when the sisters escaped from the World Nobles."}, {"type": "paragraph", "text": "Sometime after Gold Lion Shiki's escape, Hatchan visited Shakky's bar. Shakky offered Hatchan a drink when he wanted to meet Rayleigh."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Her husband, Rayleigh, had gone missing for the previous six months before her introduction. Upon meeting Luffy, she informed him of the other major pirates (the Eleven Supernovas) that have arrived on the island around the same time as him. She then told them that they might find Rayleigh at Sabaody Park. After the Straw Hats returned from the Human Auctioning House, where they found Rayleigh, he and the entire Straw Hat crew gathered at Shakky's bar. When Luffy declined easy information to One Piece, Shakky stated that she is a fan of Luffy. She took care of the wounded Hatchan as well as Camie and Pappag as the Straw Hats depart. Unknown to her, Camie, Pappag, and Hatchan; Bartholomew Kuma teleported the Straw Hats away from Sabaody Archipelago to different locations. As time passed and Straw Hats had not been heard from since they were last seen, Camie began to worry about their safety. While Pappag and Hatchan were convinced they would be be fine, Shakuyaku on the contrary, pointed out that their chances of facing a Marine Admiral and escaping are slim, and noted that the current era is slowly changing, so the Straw Hats must catch and hold on to \"the waves\" that will inevitably wash it away to survive."}], "images": []}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "When she learns about Luffy's situation after the Battle of Marineford, she tells Rayleigh that if she were Boa Hancock, she would hide Luffy from the Marines on Amazon Lily. She is seen again on the Thousand Sunny with Hatchan, Camie, Pappag, and the Rosy Life Riders. Camie asks Shakky if the Straw Hats are going to reunite using the vivre cards. Shakky replies that it will take time and assumes that Rayleigh has found Luffy. She then speaks about the need to protect the Thousand Sunny until the Straw Hats return. When Kuma arrives, Shakky tells everyone not to worry, unaware that the Shichibukai lost his free will and became a weapon of the World Government."}], "images": []}, {"title": "Two Years Later", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "She reveals to Sanji which of the Straw Hats have already come to the island. She informs Brook through Den-Den Mushi about the situation with the Marines and the Imposter Straw Hats. She then goes to the Thousand Sunny with Rayleigh. There, she informs the Straw Hats about the Marines' activities on the archipelago. She also said that she had just talked with Brook on a Den Den Mushi, saying that he should be coming to the ship soon. She then said that everyone needed to hurry since the Marines are closing in on them and that the only one they were not in contact with was Luffy. She then gave them Rayleigh's Vivre Card, saying that Luffy would be following the card and was \"counting on it.\""}, {"type": "paragraph", "text": "After the Straw Hats finally gather, Shakky sees them sail off to Fish-Man Island."}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the anime only, she briefly flirts with Brook. When he asks about the color of her panties, she indifferently is about to tell him, but is interrupted by Camie and Pappag, though later she does tell him off screen."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Her name (芍薬, shakuyaku) means \"peony\", a type of flower.", "elements": []}, {"text": "In the One Piece Blue Deep: Characters World databook, her relationship with Silvers Rayleigh is written as that of friends, rather than husband and wife. As he was referred to as her \"Uchi no hito\" (うちの人; lit. person of my household) in the manga, their relationship as stated in the databook may be an oversight by Oda.", "elements": []}]}], "images": []}]}