{"sections": [{"title": "Kashigami", "level": 1, "content": [{"type": "paragraph", "text": "Not to be confused with Kashi, one of the two giant gatekeepers for Enies Lobby."}, {"type": "paragraph", "text": "Kashigami was the grandparent of Nola. It was thought to be a god by the Shandia."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "It looked almost exactly the same as Nola, but was a bit smaller. All other traits are exactly the same as its grandchild."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Little was known about Kashigami’s personality, but it seemed to have an instinctual mindset, accepting people as sacrifices, or, in its mind, food."}], "images": []}, {"title": "Child", "level": 2, "content": [{"type": "paragraph", "text": "Kashigami had a child whose name is unknown before its death. It first appeared in Chapter 289 and Episode 188."}, {"type": "paragraph", "text": "When it was first seen, it was smaller than its parent. It approached a trapped Noland, after finishing off a leopard it had just killed. Kalgara declared this was Noland's punishment for killing their god. After a speech on the cure for Tree Fever, Kalgara took it upon himself to kill it to protect Noland. Before this child was killed, however, it sired a child of its own, Nola."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/50/Child_of_Kashigami.png/revision/latest/scale-to-width-down/220?cb=20130514212734", "caption": "The child of Kashigami."}]}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "When it first appeared in the story, Kalgara's daughter was about to be sacrificed to it, when Mont Blanc Noland defeated it."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Although the serpent was labeled \"Kashigami\", some Shandorians themselves did not know what their God looked like until it appeared. This indicates that the ritual was not a common occurrence amongst their people and was something they reserved only for dire situations.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Blue Deep: Characters World (p. 44), Kashigami's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 31 Chapter 289 and Episode 188, The snake is killed by Kalgara.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 31 Chapter 287 and Episode 187, Kashigami approaches to kill and then is killed itself by Noland.", "elements": []}]}], "images": []}]}