{"sections": [{"title": "Tamagon", "level": 1, "content": [{"type": "paragraph", "text": "Tamagon is a member of the Franky Family."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Tamagon has a rounded body shape and is usually seen wearing goggles. He also wears a waistcoat as well as a red bowtie to match. Like the other members of the Franky Family, his lower body part is covered in bandages."}, {"type": "paragraph", "text": "After the timeskip, he retains his signature bowtie and goggles, but now wears a Galley-La shirt and his hair is seen having slightly grown."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "When he met Franky, Tamagon came to deeply respect him and called him \"Aniki\" just like the other Franky Family members. Though he has respect for Franky, he is quite mischievous, since he stole Franky’s swim briefs."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "During the raid of Enies Lobby he is shown wielding a sword and a bazooka. It is unknown how skilled he is. Like all of the Franky Family, he wears armor strong enough to block cannon fire."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He joined Zambai's group during some point of his life. Afterwards, Tamagon, along with the rest of Zambai's gang, was given a job by Franky and the whole gang was assimilated into the Franky Family."}], "images": []}, {"title": "Water 7 Saga", "level": 3, "content": [], "images": []}, {"title": "Water 7 Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Straw Hat Pirates arrived at Water 7, the Franky Family mugged Usopp and stole 200,000,000 from him. When Usopp entered their house to take the money back, the Franky Family beat him up and threw him out."}, {"type": "paragraph", "text": "Moments later, they fought against Luffy, Zoro, Sanji and Chopper. Tamagon and the other Franky Family members were badly beaten. After Franky abducts Usopp later that night, the Franky Family tried to lure out the Straw Hat Pirates but caught the attention of CP9."}, {"type": "paragraph", "text": "CP9 then beat up Tamagon and the others before heading to Franky's hideout where they abducted Franky and Usopp. After CP9 left Water 7, Tamagon and the others turn to the Straw Hats for help."}], "images": []}, {"title": "Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "Upon arriving at Enies Lobby, the Franky Family along with the Straw Hats and the Galley-La workers laid down their plan of attack. The Franky Family were supposed to move in and open the main gate. Once they reached the main gate, they were faced against the two giants who guarded it, Oimo and Kashi. Tamagon was on Zambai's team, which entered a fierce combat against the giants, and with the aid of Galley-La, they managed to bring them down, opened the gate and led the way for the incoming Straw Hat pirates. The team, riding the giant King Bulls, advanced towards the inner section of the island defeating foe after foe, until they reached the courthouse. There, they split into two groups in order to find the two separate switches that lower the bridge to the Tower of Justice. Zambai, Paulie and a handful of Franky Family members, including Tamagon, engaged the Three-Headed Chief Justice Baskerville in combat but were eventually subdued and apparently defeated."}, {"type": "paragraph", "text": "Upon the news of the Buster Call's issue reaching them, Tamagon and his comrades are already freed by Paulie and desperately tried to make a move and escape the island. When they reached the coast, the Franky Family come across the warship led by Vice Admiral Strawberry, who ordered his men to attack the criminals. The group got bombed and thrown off a cliff but were all saved at the last minute by Paulie's ropes. With the Straw Hat Pirates drawing the attention of the Marines, Zambai and Paulie lead their men aboard the sea train, thus escaping the burning island."}], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 4, "content": [{"type": "paragraph", "text": "During the Straw Hats party, Tamagon joined in alongside everyone else that participated in the Enies Lobby fight."}, {"type": "paragraph", "text": "Later, after discovering that Franky became a wanted man, the Franky Family tried to convince him to join the Straw Hat Pirates. Tamagon stole Franky's swim briefs and started the chase throughout Water 7. When Franky found them, he managed to defeat them easily, including Tamagon."}], "images": []}, {"title": "Two Years Later", "level": 3, "content": [{"type": "paragraph", "text": "Tamagon is seen with Zambai and the other Franky Family members now a part of Galley-La."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Franky Family vs. Usopp", "elements": []}, {"text": "Franky Family vs. Monkey D. Luffy, Roronoa Zoro, Sanji, and Tony Tony Chopper", "elements": []}, {"text": "Franky Family vs. Marines", "elements": []}, {"text": "Tamagon and Franky Family vs. Franky", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Tamagon's name may come from tamago (卵, tamago), which means \"egg,\" and may refer to his round body.", "elements": []}, {"text": "Tamagon's name was made up out of nowhere after Oda received a postcard asking what the character's name was.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 34 Chapter 325 and Episode 231, Tamagon makes his debut.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 67 Chapter 657, cover story: From the Decks of the World Vol. 39, Tamagon is seen two years later.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 45, Oda makes up Tamagon's name.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 45 Chapter 433 and Episode 315, The Straw Hats, Franky Family, and Galley-La celebrate by having a pool party.", "elements": []}]}], "images": []}]}