{"sections": [{"title": "Happa Yamao", "level": 1, "content": [{"type": "paragraph", "text": "Happa Yamao is a civilian of Water 7 whom Usopp bought wood and supplies from in order to repair the Going Merry. Happa also gave Usopp some rice balls. He is an old bandit turned carpenter who moved to Water 7 from the \"Gourmet City\", Pucci."}, {"type": "paragraph", "text": "He was initially identified by Oda as \"Happa\", then given the name \"Yamao\" in Blue Deep. When questioned about the inconsistency, Oda simply responded that the man's name is Happa Yamao."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Happa is a tall fat man, easily towering over Usopp, with spiky dark hair and a beard of the same shape. He has a scar under his right eye. He also wears an unbuttoned blue collared shirt with a brown leaf design on it, with a white shirt beneath it."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2b/Happa_Full_Body.png/revision/latest/scale-to-width-down/210?cb=20130922174958", "caption": "A full body view of Happa."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appears to be a kind man, as he gave Usopp some rice balls when he realized that Usopp was hungry and he was willing to take what little money Usopp had for him despite it not being enough to pay for what he bought."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a carpenter, he has at least some skill in carpentry."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He used to be a bandit, but for unknown reasons, he gave it up and became a carpenter in Water 7. He also lived in Pucci at one point of his life."}], "images": []}, {"title": "Water 7 Arc", "level": 3, "content": [{"type": "paragraph", "text": "Usopp bought wood and supplies from Happa in order to repair the Going Merry. Happa also gave Usopp some rice balls when he realized that Usopp was hungry. Usopp didn't have enough to pay for all the wood, so he tried to trade it for some of his tools, making Happa wonder if Usopp was a rustic trader. He let Usopp have the extra wood."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  SBS One Piece Manga — Vol. 76 (p. 134), Oda confirms the full name as Happa Yamao.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 43 (p. 48), fan question: I want to know the name of the guy who gave Usopp the rice balls in Volume 36.", "elements": []}]}], "images": []}]}