{"sections": [{"title": "Antonio", "level": 1, "content": [{"type": "paragraph", "text": "Antonio is the owner of \"Antonio's Graman\" in Sabaody Archipelago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Antonio is a pudgy man with a small mouth, long curly mustache, and long puffy black hair. His face is rather pointed on top, but square-ish around his chin, and he also has a thick neck. He wears a light pink short-sleeved shirt under a dark green apron, which has \"グラマン\" (Graman) written on it."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Antonio seems to be quite kind, letting the Straw Hats sample his food. However, as generous as he may be, he did feel a little distressed when he saw that they were continuing to eat his samples without buying anything yet."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "After leaving the Bon Chari rental store, the Straw Hat Pirates explored Sabaody more before finding a small store, Antonion's Graman. Chopper rode up on a Bon Chari and asked Antonio himself what \"graman\" was. After a brief explanation, he offered the pirates free samples. Chopper, Luffy, and Brook \"sampled\" multiple boxes his food, causing him to ask if they would actually buy anything. However, they ended up buying a number of boxes along with some souvenirs."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/de/Antonio%27s_Graman_Infobox.png/revision/latest/scale-to-width-down/120?cb=20130517230740", "caption": "Antonio meets the Straw Hat Pirates."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 497 and Episode 391, Antonio offers free samples to the Straw Hat Pirates.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Antonio's birthday is revealed.", "elements": []}, {"text": "↑  Note: Antonio's name was originally only known thanks to the name of his shop; however, it was subsequently confirmed in the Vivre Card - One Piece Visual Dictionary.", "elements": []}]}], "images": []}]}