{"sections": [{"title": "Silvers Rayleigh", "level": 1, "content": [{"type": "paragraph", "text": "Silvers Rayleigh, also known as the \"Dark King\", is an extremely powerful and famous retired pirate who formerly served as the first mate of the legendary Roger Pirates, known as the \"Right Hand of the Pirate King\". Rayleigh is one of the major figures, along with Whitebeard, Shiki, Monkey D. Garp, Sengoku, and Kong from the times when the \"Pirate King\" was alive."}, {"type": "paragraph", "text": "After the execution of Gol D. Roger and the disbandment of the Roger Pirates, Rayleigh became a coating mechanic at the Sabaody Archipelago. Also at some point after this he became the husband of Shakuyaku.​​​​​​ He served as Monkey D. Luffy's mentor in the use of Haki during the two-year timeskip. ​​​​​​"}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Rayleigh is an elderly man of relatively tall height with a very strong and defined build. Two of his most distinguishing traits are his round glasses and facial hair, which is arranged embattled across his lower jaw. He also has a scar over his right eye, which he has had for many years."}, {"type": "paragraph", "text": "The Dark King chooses to dress quite simply, usually just in a nearly plain t-shirt, shorts, and sandals. When out in public, he also seems to enjoy the cover of a large silver hooded cloak, though the hood is often down. Underneath these clothes, the old man's body is surprisingly built and very well-toned, a testament to his incredible strength."}, {"type": "paragraph", "text": "When he was younger, Rayleigh had strawberry blonde hair (black when first seen in the anime) clean cut and had a moderate amount of facial hair. Over the years, as his hair whitened, he grew it out. He also grew a beard from his initial striped facial hair. Regardless of his age, Rayleigh is a muscular man with a broad chest and well-built body."}, {"type": "paragraph", "text": "During his first appearance in Buggy's flashback, he was seen wearing a t-shirt with an ornately decorated collar, a motif that appeared even in the long coat he wore during the Edd War. He wore an orange shirt, light-brown spotted bermudas, and simple sandals. He also has a silver-colored coat hanging from his shoulders."}, {"type": "paragraph", "text": "After the two year timeskip, he now wears a black T-shirt as well as his silver hooded cloak."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Rayleigh is light-hearted, casual, and fun loving, much like his captain Roger was. In the past, he was shown to have been impatient with the antics of the younger crew members and took the position of crew disciplinarian very seriously. However, he has changed his personality in his older years, becoming much more relaxed even when training Luffy."}, {"type": "paragraph", "text": "Though he often has a serious air, Rayleigh enjoys going with the flow and appearing in unexpected places and in unexpected ways, especially given his status and age. He often comments on his age and how his body \"does not work the way it used to\", much like Garp."}, {"type": "paragraph", "text": "Rayleigh is not often headstrong, looking before he leaps and taking time to plan ahead before taking action, although he does not hesitate to act if needs be. Even when entering into an unfortunate or unplanned situation such as engaging a Marine admiral in combat or having his ship sink in the Sea King infested waters of the Grand Line, Rayleigh remains completely calm, pushing forward through adversity with no hesitation."}, {"type": "paragraph", "text": "He, like Whitebeard, seems to enjoy talking about the past and its great times, as well as the good old days of their near bygone era. In spite of this, he appeared reluctant to get into the darker topic of the Void Century. He is typically open and talkative, such as when it came to the mysterious Void Century. He was willing to divulge the whole truth to Nico Robin if she wished, but she declined his offer."}, {"type": "paragraph", "text": "As stated by Shakky, he loves alcohol and women, which he proved when he is first introduced saving Camie from being mistreated by Disco while holding a hip flask. He prefers to be called \"Ray-San\". Despite once being enemies with the Whitebeard Pirates, Rayleigh seems to have great respect for their captain, like Roger, and shed a tear for Whitebeard's passing."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Roger Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Rayleigh's relationship with most of the Roger Pirates is unknown. However, he had a close relationship with his captain Gol D. Roger. He later became the first mate of the Oro Jackson, the ship of the man who would conquer the Grand Line and be crowned by the world as the Pirate King. "}], "images": []}, {"title": "Gol D. Roger", "level": 4, "content": [{"type": "paragraph", "text": "Rayleigh had an incredibly close relationship with Roger, to the point where he was called 'partner' by the Pirate King. After the man gave himself to the Marines, Rayleigh was unable to bring himself to directly witness the execution of his closest friend. He toasted a drink to the man with both tears and laughter as the blades passed, and downed a glass as his first act in the Great Age of Piracy, the Age of Dreams. "}], "images": []}, {"title": "Buggy and Shanks", "level": 4, "content": [{"type": "paragraph", "text": "During their times as pirates apprentices on the ship, their repeated bickering with each other often led to them being punished by Rayleigh."}, {"type": "paragraph", "text": "Despite that, Buggy still has much respect for the former first mate of the crew. Rayleigh was aware that Buggy was a pirate in the East Blue, which means he kept tabs on him. Twelve years ago, after Shanks saved Luffy from being eaten by the Lord of the Coast, Shanks reunited with Rayleigh at Sabaody Archipelago and told him about a boy he met in East Blue, and after their conversation, Rayleigh became curious to meet Luffy."}], "images": []}, {"title": "Crocus", "level": 4, "content": [{"type": "paragraph", "text": "He seems to appreciate Crocus for maintaining the Pirate King's health during their voyage in the New World. Despite the doctor's brief time with them, he considers him a valued crewmate and expressed a desire to see him again."}], "images": []}, {"title": "Kozuki Oden", "level": 4, "content": [{"type": "paragraph", "text": "Like the rest of the crew, he held Oden in high regard. Rayleigh wanted to help him make Wano Country open to the rest of the world though Oden declined the offer."}], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Shakuyaku", "level": 4, "content": [{"type": "paragraph", "text": "Shakuyaku is Rayleigh’s business partner and wife. When he had gone missing for the previous six months before her introduction, she was not worried because she knew what Rayleigh is capable of. Upon meeting Luffy, she informed him of the other major pirates (the Eleven Supernovas) that have arrived on the island around the same time as him. She then told them that they might find Rayleigh at Sabaody Park. After the Straw Hat Pirates returned from the Human Auctioning House, where they found Rayleigh, he and the entire Straw Hat crew gathered at Shakky's bar. Rayleigh trusts her implicitly and he knows her qualities. With her deductions, Rayleigh managed to find Luffy after the war."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Hatchan", "level": 4, "content": [{"type": "paragraph", "text": "Hatchan is friends with Silvers Rayleigh, after saving the pirate from a shipwreck as a child. Since then, the two were on good terms, but Rayleigh disapproved of Hatchan joining Fisher Tiger's Sun Pirates."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "After meeting them during the Human Auctioning House incident, Rayleigh assisted the Straw Hat Pirates on several occasions. He coated the Thousand Sunny for free and he also defended the crew from Kizaru. After the Straw Hats got back together two years after the Battle of Marineford, he taught Nami the technicalities of sailing a coated ship. When the Marines pursued the crew, Rayleigh helped the Straw Hats escaped."}], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Ever since Rayleigh had heard about Luffy from Shanks, he had wanted to meet him face to face. When Luffy found him on the Sabaody Archipelago, he was excited about hearing stories about Gol D. Roger. The more they talked, the more amused Rayleigh felt as he compared Luffy's demeanor to his old captain just as Shanks had. He, like Shakky, has great expectations for him after Luffy stated his belief that the Pirate King has the most freedom on the sea. After the war at Marineford, he swam across the Calm Belt to reach Amazon Lily, where Luffy had been recuperating from his injuries and from the loss of Ace. From there, he helped Luffy break into Marineford with Jinbe in order for him to send the secret message to his crew. Rayleigh also mentored Luffy on how to master all three different forms of Haki over the course of a year and a half. Luffy strongly respected Rayleigh as a teacher as he was even willing to endure hunger as punishment."}, {"type": "paragraph", "text": "After the two year timeskip, it is apparent that both of them became close from their training together. As he headed towards Thousand Sunny, Luffy shouted to Rayleigh that he would become the Pirate King, leaving Rayleigh with a smile and tears in his eyes. Rayleigh himself later proudly proclaimed Luffy as his pupil to the Marines. When Luffy set sail, Rayleigh compared his late captain to Luffy, claiming that destiny is slowly but surely taking shape, and that Luffy has become a man well fit to wear that Straw Hat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e9/Rayleigh_and_Luffy_Bonding.png/revision/latest/scale-to-width-down/230?cb=20120815060522", "caption": "Rayleigh and Luffy bonding during the timeskip."}]}, {"title": "Jinbe", "level": 4, "content": [{"type": "paragraph", "text": "Rayleigh also seems to have developed a friendship with the former Shichibukai, Jinbe. At first, Jinbe could not believe his eyes when he saw Rayleigh in Amazon Lily. He took part in stealing a marine ship, circling around Marineford, and the ringing of the Ox Bell."}], "images": []}, {"title": "Boa Hancock", "level": 4, "content": [{"type": "paragraph", "text": "Due to her hellish experience with the first man she ever saw, the one who painfully burned the Hoof of the Soaring Dragon onto her back, Hancock has a bitter hatred towards all men. Rayleigh, who helped Hancock and her sisters return to Amazon Lily after escaping, is one of the only two known exceptions to this hatred (the other being Luffy). While her sisters were shocked to see Silvers Rayleigh on Amazon Lily, Hancock remained single-minded about Luffy, only realizing later that Rayleigh was there. Hancock also permitted him to stay in Amazon Lily. Later, after parting ways with Jinbe, Hancock took Luffy and Rayleigh to Rusukaina Island for Luffy's special training. She said she would bring food for Luffy every day from Amazon Lily. When Rayleigh told her that no women would be allowed on the island during Luffy's training, she was furious but calmed down when Rayleigh told her that it was all for Luffy's own good."}], "images": []}, {"title": "Gloriosa", "level": 4, "content": [{"type": "paragraph", "text": "Gloriosa is good friends with Rayleigh and Shakky. Rayleigh is one of the few (if not only) people who refer to her with her birth name, Gloriosa. Before her return to Amazon Lily, Gloriosa lived with Rayleigh and Shakky on Sabaody Archipelago while sheltering the Gorgon Sisters after their escape from the World Nobles."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "World Government", "level": 4, "content": [{"type": "paragraph", "text": "Rayleigh is an enemy of the World Government. He is one of the few people who know the true history. He was willing to tell Robin about the Void Century, but he was interrupted by her. The Government considers such people as a great threat."}], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "In the past Rayleigh along with the other Roger Pirates encountered several Marines, especially Monkey D. Garp. The fact that he was a member of one of the strongest pirate crew made him a formidable enemy of the Marines. When Rayleigh fought Kizaru, he told him that if he were to get rid of his wanted poster, he could go into peaceful retirement. This means that Rayleigh still has an active bounty, though the amount has yet to be revealed. Kizaru replied that Rayleigh's bounty cannot simply be forgotten, as being a pirate carries the crimes throughout their entire life, especially a Roger Pirate."}], "images": []}, {"title": "Whitebeard Pirates", "level": 4, "content": [{"type": "paragraph", "text": "As a member of the Roger Pirates, Rayleigh made a rivalry with the Whitebeard Pirates. Nevertheless, as with his captain, Rayleigh has great respect for Edward Newgate and even shed a tear for the man's death at the pinnacle of the Battle of Marineford."}], "images": []}, {"title": "Chinjao", "level": 4, "content": [{"type": "paragraph", "text": "Chinjao fought against the Roger Pirates and was familiar with Rayleigh. He apparently holds a grudge against Rayleigh, as when Luffy reveals Rayleigh is the one who taught him Haki, Chinjao expressed displeasure at knowing that the Pirate King's right hand still lives."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "Despite the brief meeting between the two, it appears they have a neutral relationship with each other. He politely greets him and thanks to Law for treating Luffy. The Surgeon of Death appears to have deduced Rayleigh's motive to find Luffy on Amazon Lily."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [], "images": []}, {"title": "Overview", "level": 3, "content": [{"type": "paragraph", "text": "Rayleigh is extremely powerful, easily one of the strongest characters introduced. Shakuyaku vouches for his strength by saying that he is \"100 times stronger\" than all of the Eleven Supernovas."}, {"type": "paragraph", "text": "In his younger days with Gol D. Roger, Rayleigh commanded the rest of Roger's crew as his first mate. He would do several duties while supervising the rest of the crew. Amongst these duties was disciplining the young apprentices Buggy and Shanks over their constant arguing about pointless things, such as which of the two polar regions is the colder one. After Gol D. Roger's crew disbanded, Rayleigh became a coating mechanic in Sabaody. He specializes in coating ships with Yarukiman resin, a process which enables ships to travel to Fish-Man Island."}, {"type": "paragraph", "text": "In terms of raw power, when Vice Admiral Garp was informed Rayleigh may be on Sabaody Archipelago, he told his men not to confront him nor should Fleet Admiral Sengoku be informed. Garp reasoned that the Marines should not confront two legends, Whitebeard and Rayleigh at the same time. Admiral Kizaru even admitted that if the Marines were to make an honest attempt at capturing Rayleigh, they would need to do serious preparation, further explaining his great strength."}, {"type": "paragraph", "text": "Due to his phenomenal strength, he was able to fight Admiral Kizaru equally and he even managed to scratch the admiral. However, Rayleigh himself has admitted that he is not as young as he used to be, and as a result can tire in battle, meaning when he was in the prime of his strength, he may have been even stronger than when he fought Kizaru, a true testament to his strength. Eustass Kid himself even states that Rayleigh was \"a legend\". Another glimpse of his strength is seen when he seemingly snatches off Camie's exploding slave collar and tosses it into the air before it could self destruct."}], "images": []}, {"title": "Intelligence", "level": 3, "content": [{"type": "paragraph", "text": "Rayleigh is well known for his crafty and cunning mentality: he has managed to evade the grasp of the expansive World Government for over 20 years now, and had quickly learned to exploit the slave-trading business on Sabaody Archipelago for personal gain (getting himself caught and sold to a wealthy bidder, before escaping and robbing his \"master\"). Calm and level-headed at virtually all times, he was the individual to break up arguments and disputes aboard the \"Oro Jackson\", as first mate and the right-hand man to Gol D. Roger himself."}, {"type": "paragraph", "text": "Rayleigh knows the \"True History\" of the world from his time with Roger. However, he has also stated that, as a pirate crew lacking the archaeological knowledge of scholars of Ohara's caliber, they could have interpreted that information differently than the Ohara scholars."}, {"type": "paragraph", "text": "Another noticeable trait of Rayleigh's is his incredible perceptive and deduction capability. This is shown when he was (within a matter of moments) easily able to deduce what had happened after ending up at the slave auction stage on the Sabaody Archipelago."}], "images": []}, {"title": "Mechanics", "level": 3, "content": [{"type": "paragraph", "text": "Rayleigh is an expert in the coating business, as he performs such operations for various pirate ships heading down to Fish-Man Island, as well as understanding the mechanics of the deep-sea currents. Rayleigh is also highly knowledgeable in locksmithing, able to remove the slave collars that was placed on him and the giant he was enslaved with without using any keys at all. He also demonstrated being able to remove Camie's exploding collar without the keys, albeit in a more dangerous method as it does not stop the collar from exploding."}], "images": []}, {"title": "Culinary Expertise", "level": 3, "content": [{"type": "paragraph", "text": "Rayleigh is a highly skilled chef as according to Luffy. The stew Rayleigh prepared for dinner smelled very delicious."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Rayleigh has tremendous physical strength despite his elderly age. He is powerful enough to kill several Sea Kings with his bare hands while swimming in the Calm Belt. In the anime, he could throw bullets with extreme force and accuracy, able to destroy cannonballs fired at him."}, {"type": "paragraph", "text": "Rayleigh has shown to be extremely fast with extraordinary reflexes. When removing Camie's exploding collar, he patiently calculated the time when the collar released itself and quickly tossed it away before it detonated. He could intercept Kizaru's attack when the Admiral was about to kill Roronoa Zoro without Kizaru noticing, and also managed to keep up with his light enhanced speed."}, {"type": "paragraph", "text": "Though tarnished by age, Rayleigh still has an enormous amount of stamina, as he was able to swim to Amazon Lily from another ocean and was also still able to kill a number of Sea Kings despite swimming such a long distance."}], "images": []}, {"title": "Swordsmanship", "level": 3, "content": [{"type": "paragraph", "text": "Rayleigh is a tremendously powerful and skilled swordsman, though he claims to have degraded in skill somewhat from his younger and healthier days. Like Zoro, he can create extremely powerful compressed air slashes as shown when he cut the ground with ease to prevent the Marines from chasing after Luffy. He can combine Busoshoku Haki with his swordsmanship, allowing him to fight equivalently with Kizaru, who himself is a highly skilled swordsman wielding his Ama no Murakumo light energy sword and also managed to cut and draw blood from Kizaru's face, who is a Logia user."}], "images": []}, {"title": "Haki", "level": 3, "content": [{"type": "paragraph", "text": "Rayleigh is one of the very small number of people in the world who can use all three types of Haki. Rayleigh is also shown to possess great mastery of Haki and made use of all three types while teaching Luffy about them, and training him in the basics."}], "images": []}, {"title": "Haoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Rayleigh has mastered Haoshoku Haki to the extent that he can render a specific target completely unconscious. He is able to do this without adversely affecting anybody else near the initial target. He disabled an entire hall room of hostiles with this power, save for the Kid Pirates and Heart Pirates. Rayleigh later commented that the pirates still standing were no ordinary rookies. Only very strong and determined individuals can resist from being knocked unconscious. One of Trafalgar Law's crewmen was very close to being knocked out, and even Law and Eustass Kid were sweating slightly after enduring the blast."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c7/Rayleigh_Using_Haoshoku_Haki.gif/revision/latest?cb=20120815061647", "caption": "Rayleigh using Haoshoku Haki."}]}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Rayleigh has an extremely high level of skill in Busoshoku Haki, allowing him to effectively bypass the powers of a Devil Fruit user and touching the \"substantial body\" beneath whatever protection the fruit provides as seen when he used Busoshoku Haki to kick and redirect an attack from Admiral Kizaru. While teaching Luffy the basics of Haki, Rayleigh could deflect a giant elephant's stomp and cause significant damage to the elephant with only the sheer force of his Busoshoku Haki, whereas Luffy's Gear Second Enhanced attack could not deal any damage at all, and also hurting Luffy with a Haki-imbued flick to demonstrate his the capabilities of Haki. Overall, Rayleigh's immense proficiency in Busoushoku Haki allows him to use it for devastating offense. He is also able to harden certain parts of his body or objects, as shown during his training with Luffy."}, {"type": "paragraph", "text": "Rayleigh can utilize an advanced application of Busoshoku which enables him to emit his Haki a short distance without a medium. He is also able to use a high-grade version of this technique, where Rayleigh can channel his Haki into his opponent, letting him destroy them from the inside out, which he first used to destroy Camie's collar."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Rayleigh is highly proficient in Kenbunshoku Haki, able to sense the emotions and nature of others. He could also use it to sense the strength of others on a wide scale. This was shown when Rayleigh utilized this Haki to sense that there were five hundred creatures on Rusukaina who were stronger than Luffy at that time. Rayleigh also used Kenbunshoku Haki to expertly dodge an elephant's attack with his eyes closed."}, {"type": "paragraph", "text": "The incredible mastery Rayleigh has over this kind of Haki is also shown by the fact that he can sense people all over the island he is currently on while most people can sense only in their immediate vicinity."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Rayleigh possesses a double-edged straight sword, with a cross hilt and a large round pommel, roughly half as long as his body height. Combined with his Busoshoku Haki and sword skills, he can fight evenly with a Logia-enhanced Kizaru."}, {"type": "paragraph", "text": "During his attack against the Marines who tried to chase down Luffy after the time skip, he switched to using a katana."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fe/Rayleigh%27s_Sword.png/revision/latest/scale-to-width-down/180?cb=20111008141116", "caption": "Rayleigh's sword."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Before Roger formed his crew, Rayleigh met Roger after he stole a ship due to his house burning down and needing a place to live. Roger said that it was a fated meeting and asked Rayleigh to join him. At first, Rayleigh declined, but some time later, he formed a bond with Roger and became his first mate."}, {"type": "paragraph", "text": "In the New World, at Edd War, Buggy panicked at the potential conflict between two infamous pirate crews: the Roger Pirates and the Golden Lion Pirates. Rayleigh was present, and he held Buggy back, telling him not to worry. When Roger rejected Shiki's offer to become his right-hand man, Rayleigh was seen preparing for battle along with the other Roger Pirates. A battle between the two crews ensued, and a change in the weather allowed the Roger Pirates to sink half of Shiki's ships."}, {"type": "paragraph", "text": "Twenty-six years before the start of the story, Roger fell ill from an incurable disease, leading the Roger Pirates to take one final journey together. They ventured into the Grand Line together and conquered it. A year before his death, Roger disbanded the crew in secret and one by one the crew disappeared. Before he handed himself over to the Marines, Roger told Rayleigh that \"He would not die\". Unwilling to watch the execution of his closest friend, Rayleigh toasted a drink to the man with a laugh as the blades passed, and downed a glass as his first act in the Great Age of Piracy, the Age of Dreams. Rayleigh stated that he laughed (and cried, and drank) nonetheless upon hearing the message Roger had left the world."}, {"type": "paragraph", "text": "Sometime later, Rayleigh was saved by a young Hatchan from drowning in a shipwreck. Since then, Rayleigh has been on good terms with Hachi. He, along with Shakuyaku and Nyon, also helped protect the Gorgon Sisters after their escape from slavery from the World Nobles. Eventually, Rayleigh became a coating mechanic on Sabaody Archipelago and at some point married with Shakuyaku."}, {"type": "paragraph", "text": "Twelve years prior to the series, Rayleigh met his former apprentice Shanks again and noticed the latter lost his arm and his hat. Rayleigh asked him what occurred as he told him of a boy that he met in the East Blue who had the same passion as his former captain. Intrigued, Rayleigh desired to meet this boy some day."}, {"type": "paragraph", "text": "He had been missing for six months prior to Luffy's arrival on the archipelago."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/cc/Rayleigh_and_Roger_Meet.png/revision/latest/scale-to-width-down/230?cb=20140727103201", "caption": "Rayleigh and Roger's first meeting."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Rayleigh let himself be captured to be sold as a slave, and when the mermaid Camie was brought into the Human Auctioning House, Rayleigh discreetly used Haoshoku Haki to knock out Disco, although his fellow slave Stansen recognized what he did. As an auction took place, Rayleigh broke out of his cell and stole the money that people had bid for their slaves before making his way to the auction stage. There, he saw Hatchan and ascertained that he and his allies, the Straw Hat Pirates, had attacked a World Noble to save Camie. Rayleigh then unleashed Haoshoku Haki, knocking out most of the people in the auction hall, and he recognized the Straw Hat captain Monkey D. Luffy, saying he had wanted to meet him."}, {"type": "paragraph", "text": "Rayleigh then grabbed Camie's exploding collar and ripped it off, tossing it aside before it could explode. He surveyed the room and saw that the Kid Pirates and Heart Pirates, along with the Straw Hats, had survived his Haki blast, and he then turned his attention to Hatchan, thanking the Straw Hats for protecting him. The pirates then headed out of the action hall, and Rayleigh told the Straw Hats to meet him at Grove 13 later. After the three pirate crews had fought through the Marines laying siege to the auction house, Rayleigh was able to run off with Hatchan."}, {"type": "paragraph", "text": "Rayleigh and the Straw Hats made it to Shakky's Rip-off Bar with Hatchan, Camie, and Pappag, and Rayleigh revealed to Luffy who he was and how he knew Hatchan. He then revealed to the Straw Hats what had really happened to Roger, and they talked about Crocus and Shanks.Nico Robin then asked Rayleigh about the Void Century and Roger's writing on the Poneglyph in Skypiea, but opted to continue researching for herself after Rayleigh warned about how she might use the information. Usopp then asked if the One Piece existed, but was stopped by Luffy, who wanted to discover the One Piece for himself and become the freest man on the sea; Rayleigh was impressed by his ideology. Rayleigh then went to coat the Straw Hats' ship, not charging them anything in return for them helping Hatchan, and gave them his Vivre Card, telling them to find him in three days."}, {"type": "paragraph", "text": "A short time later, Marine Admiral Kizaru came and attacked the Straw Hats, but before he could kill Zoro, Rayleigh came in and intercepted him. Rayleigh tried to see if Kizaru would leave the Straw Hats alone, but Kizaru would not abandon his mission. The Straw Hats immediately started running away, and Kizaru attempted to go after them, but Rayleigh stopped him with a sword. As Rayleigh sparred with Kizaru, he witnessed the Shichibukai Bartholomew Kuma joining some Pacifistas who were attacking the Straw Hats, and saw as Kuma made the Straw Hats disappear. Kuma then went to Rayleigh and revealed that he was an officer of the Revolutionary Army and was acting to help the Straw Hats escape. Rayleigh watched as Kuma then transported the remaining Straw Hats off the island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Rayleigh_Helping_Hatchi.png/revision/latest/scale-to-width-down/230?cb=20120815053804", "caption": "Rayleigh thanking Luffy for protecting Hatchan."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/5d/RayleighVoidCentury.png/revision/latest/scale-to-width-down/230?cb=20120815055210", "caption": "Robin asks Rayleigh about the Void Century."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/41/Rayleigh_Stopping_Kizaru.png/revision/latest/scale-to-width-down/230?cb=20121130035002", "caption": "Rayleigh redirecting Kizaru's attack."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "While Whitebeard's death was aired at Sabaody, Rayleigh, who had escaped Kizaru's arrest, watched from afar while drinking. He remarked that Whitebeard was finally dead with a smile on his face and tears in his eyes."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c3/Rayleigh_Cries_for_Whitebeard.png/revision/latest/scale-to-width-down/230?cb=20150802005838", "caption": "Rayleigh shedding a tear for Whitebeard's death."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the war, Rayleigh set off on a ship to Amazon Lily. However before he could even reach the Calm Belt, his ship sank in a storm and thus forced him to swim the rest of the way to the island. He killed several Sea Kings when he was getting closer to the shore of the island, something which surprised and almost frightened the Heart Pirates who were watching from the shore. When he got to the shore, he remembered Trafalgar Law from the Sabaody Archipelago and told them he thought Luffy was on the island."}, {"type": "paragraph", "text": "He saw Luffy and Jinbe coming toward him. When Luffy asked about his crew, Rayleigh said he doubted they were all back yet. After telling Luffy that Law said to take it easy for another two weeks, he proceeded to greet Nyon, Boa Hancock, and her sisters, whom he had met 13 years ago; he had protected them when they had escaped from the Celestial Dragons. Elder Nyon is an old friend of his, and Rayleigh passed on a message from Shakky. He reassured them that the Marines would not even think to look for Luffy on Amazon Lily and that he was completely safe there."}, {"type": "paragraph", "text": "Rayleigh recalled what Kuma whispered to him back on the archipelago. He explained that Kuma told him the general direction in which he sent Luffy, which happened to lead right to Amazon Lily. After going back through the events of the war with Shakky, she was able to surmise (correctly on all three accounts) that Boa Hancock was hiding Luffy on her home island, that she was doing so out of love for Luffy, and also as a means of hiding him from the Marines. Rayleigh commented that a woman's intuition was a truly frightening thing. He said he would get to the main reason he came to find Luffy. Rayleigh asked him if he wanted to return to Sabaody, and Luffy replied yes. Rayleigh reminded him of what happened there before, saying that gathering his crew there again would lead to the same result as before. He started to propose an idea he has to Luffy, giving him the choice of rejecting it if he so chooses."}, {"type": "paragraph", "text": "He infiltrated Marineford with Luffy and Jinbe and took part in stealing a Marine ship and circling Marineford once with it. He was seen on the Kuja Pirates' ship with two Kuja pirates pulling on his cheek. He told Luffy that his crew most likely got the meaning of his message, due to its abnormal nature, and said that he had a hunch that the others would understand the message."}, {"type": "paragraph", "text": "He and Luffy went to Rusukaina for special training. Rayleigh told Hancock that none of the Kujas are allowed on the island during the training and tells her that if she is worried then she should pray for Luffy. Once the Kuja Pirates are gone, Rayleigh began Luffy's training by mentioning that the island was once inhabited, but the chaotic climate changes and the ferocious nature of the wildlife eventually killed all the natives. As a wild elephant came charging at them, Rayleigh explained the basic concepts of Haki, using the elephant as a demonstration for them."}, {"type": "paragraph", "text": "Rayleigh told Luffy that there are three kinds of Haki: Kenbunshoku Haki, Busoshoku Haki, and Haoshoku Haki. He used Kenbunshoku Haki to dodge the elephant's attack and used Busoshoku Haki to repel the elephant. When Luffy started to understand Haki, Rayleigh subdued the elephant using the Haoshoku Haki. The two began training on the island. Luffy realized that he has seen these techniques before in some form or another during his adventures. Rayleigh hoped to use those two years to teach him the basics of controlling the different types of Haki, as it would take longer with a normal person. The two began training on the island."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/5/52/Rayleigh-gorgon_sisters.png/revision/latest/scale-to-width-down/230?cb=20110717033645", "caption": "Rayleigh reunites with Sandersonia, Marigold, and Nyon."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/86/Rayleigh%27s_Busoshoku_Haki.png/revision/latest/scale-to-width-down/210?cb=20130625192822", "caption": "Rayleigh demonstrating Busoshoku Haki to Luffy on an attacking elephant."}]}, {"title": "During the Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "During Luffy's training, he developed Gear Fourth. Luffy asked Rayleigh on how to improve its attack power, and Rayleigh warned him about the consequences of using this technique."}, {"type": "paragraph", "text": "While teaching Kenbunshoku Haki to Luffy, he challenged Luffy to dodge 100 times while blindfolded or he would not be allowed to eat. When Luffy was attacking blindly, he accidentally hit Rayleigh's dinner, causing him to hit Luffy out of anger and annoyance as Luffy sensed his emotions. During a later conversation, Rayleigh remarked on how Luffy was proficient in sensing the feelings of living things. He also mentioned that there are people who can see a glimpse into the future with Kenbunshoku Haki and asked Luffy what would he do if he met one of these people."}, {"type": "paragraph", "text": "After teaching Luffy the basics of Haki, Rayleigh informed him that Haki can grow stronger when facing stronger foes."}], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "Rayleigh returned to Sabaody Archipelago half a year before Luffy. He was seen again in Shakky's bar commenting on how strong the Straw Hat pirates have become. He also finished coating the Thousand Sunny."}, {"type": "paragraph", "text": "Rayleigh met Nami, Robin, Franky, Chopper, and Usopp on the Thousand Sunny. He informed them that Luffy had arrived on the island and is about to teach Nami on how to operate a coated ship. He told her to move the ship to Grove 42 and to wait until everyone assembled, saying it was finally time to restart. Rayleigh went to Grove 46 to check up on Luffy. He also commented on how Luffy strengthened his haki."}, {"type": "paragraph", "text": "After Luffy had declared that he would be the Pirate King, Rayleigh was shown smiling with tears in his eyes. As the Marines begin their pursuit, Rayleigh drew a line on the ground with his sword and warned the Marines not to cross it, declaring that Luffy is his student. By doing so, he bought some extra time for the Straw Hat Pirates to escape to Fish-Man Island."}, {"type": "paragraph", "text": "Once the Straw Hats left, he revealed in a conversation with Shakky that a previous owner of Luffy's straw hat was in fact, Roger. After reminiscing about the day he first met Roger, Rayleigh started tearing up and commented that Luffy is a man worthy of that hat. Rayleigh added that it is not a bad idea to live a little longer."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/df/Rayleigh_Two_Years_Later.png/revision/latest/scale-to-width-down/210?cb=20140720180507", "caption": "Rayleigh at Shakky's bar two years later."}]}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "While reading the news of the Straw Hats' new bounties after the events at Dressrosa, Rayleigh was seen gambling."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Roger Pirates vs. Whitebeard Pirates (several off-screen)", "elements": []}, {"text": "Roger Pirates vs. Golden Lion Pirates", "elements": []}, {"text": "Silvers Rayleigh vs. Admiral Kizaru", "elements": []}, {"text": "Silvers Rayleigh vs. numerous Sea Kings", "elements": []}, {"text": "Silvers Rayleigh vs. a giant elephant", "elements": []}, {"text": "Silvers Rayleigh vs. Marines", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, when a younger Rayleigh's glasses were briefly seen, they had a circular shape. In the anime initially, they had an oblong shape. In the same flashback in the anime, his scar is missing, presumably because the scar is difficult to see in the manga. Also, Rayleigh's hair was black instead of the strawberry blonde seen in later flashbacks. This changing of a character's design to a more generic one occurs several times in the series, notably with Marco."}, {"type": "paragraph", "text": "Rayleigh mentioning his second suggestion to Luffy was not in the manga. In the manga, Rayleigh is the only one who fights the elephant. It was never shown in the manga how Luffy, Jinbe and Rayleigh got back into Marineford. In the anime Luffy's actions in Marineford are seen, though in the manga they were only explained later."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His name is similar to John Silver from Treasure Island and Sir Walter Raleigh, an English 16th-century explorer and privateer. It should be noted that Sir Walter Raleigh's name has been spelled in over forty different ways, in which also includes the spelling \"Rayleigh\" (note; the \"y\" would actually be pronounced as \"i\").", "elements": []}, {"text": "It is possible that his name is related to the phenomenon known as \"Rayleigh Scattering\". In particular, when fighting Kizaru, Rayleigh was shown to be able to 'scatter' Kizaru's light attacks, which is a visual pun on Rayleigh Scattering, which involves the scattering of light.", "elements": []}, {"text": "When Rayleigh fought Kizaru, he told him that if he were to get rid of his wanted poster, he could go into a peaceful retirement. This means that Rayleigh has an active bounty; the amount has yet to be revealed.", "elements": []}, {"text": "Silver is traditionally considered the next most valuable metal after gold, and as the first mate, Silvers Rayleigh was the second highest ranked man in the crew after the captain, Gol D. Roger also known as Gold Roger.", "elements": [{"text": "There is a theme of rare metals among the senior members of the Roger Pirates, as another member is named Scopper Gaban, as in \"copper\".", "elements": []}]}, {"text": "He is the first former pirate known to still have an active bounty.", "elements": []}, {"text": "In the 6th fan poll, Rayleigh ranked 38th.", "elements": []}, {"text": "In the One Piece Blue Deep: Characters World databook, his relationship with Shakuyaku is written as that of friends, rather than husband and wife. As he was referred to as her \"Uchi no hito\" (うちの人; lit. person of my household) in the manga, their relationship as stated in the databook may be an oversight by Oda.", "elements": []}, {"text": "Rayleigh's blood type is XF.", "elements": []}]}], "images": []}, {"title": "SBS-Based Trivia", "level": 3, "content": [{"type": "list", "elements": [{"text": "When Shanks and Buggy were first revealed to be part of Roger's crew, a fan asked Oda in a SBS question if the man that scolded them was a subordinate captain under Roger that commanded the ship they were sailing on, or even a high ranking officer. Without giving away Rayleigh's name at the time, Oda responded that this man was none other than the first mate of Roger's crew. Oda also stated in his response that since he had set this fact in stone from the very start, he told Toei Animation that when they adapt Buggy's flashback for the anime, Buggy and Shanks should not refer to Rayleigh as captain in the anime.", "elements": []}]}], "images": []}]}