{"sections": [{"title": "Marumieta", "level": 1, "content": [{"type": "paragraph", "text": "Marumieta is the daughter of Bimine, the mayor of Pucci."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Marumieta has long light-colored hair tied in a curling ponytail. She wears a semi-formal dress and a tiara. She had binoculars in both of her appearances."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Marumieta is a person who is \"ignorant of the ways of the world\", thus she is a curious one. She appears to be benevolent, as she went to Water 7 in order to deliver supplies after the Aqua Laguna."}, {"type": "paragraph", "text": "She used her binoculars to look at a catalog her father was holding despite standing right next to him. It is unknown if it is because using binoculars is a habit or if she is extremely nearsighted."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Post-Enies Lobby Arc", "level": 3, "content": [{"type": "paragraph", "text": "She was seen in the background during Franky's naked run through Water 7 and spied on him with binoculars, being named in SBS Volume 47. She came to Water 7 to deliver emergency supplies after the Aqua Laguna, and was accompanied by her manservant, Yamenahare."}], "images": []}, {"title": "Two Years Later", "level": 3, "content": [{"type": "paragraph", "text": "She and Yamenahare were seen again when her father came to Galley-La Company as a client. Both she and Bimine were looking into buying ships from Zambai, a member of the Galley-La Company. He was giving them a deal of two ships and cola while Yamenahare was trying to convince Marumieta not to decide too quickly."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Marumie (丸見え, Marumie) means \"completely exposed to view\", possibly referring to Franky's condition during her first appearance.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga — Vol. 45 Chapter 436, Marumieta sees Franky without his underwear.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 47, Chapter 451, Marumieta's name is given.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 67 Chapter 657, cover story: From the Decks of the World Vol. 39, Marumieta and Bimine look into buying ships from Zambai and the Galley-La Company.", "elements": []}]}], "images": []}]}