{"sections": [{"title": "Loki", "level": 1, "content": [{"type": "paragraph", "text": "Loki is the prince of Elbaf, who was once Lola's arranged fiance before she ran away."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Loki has only been shown in silhouette, but he is a large giant who has seemingly long hair. He appears to wear a tall crown on his head, a tunic, boots and a cape."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Elbaf Giants", "level": 3, "content": [{"type": "paragraph", "text": "As the prince of Elbaf, Loki is a deeply respected individual within the kingdom of giants. His birth was toasted for during the Winter Solstice Festival. He had the privilege to propose to the 23rd daughter of Charlotte Linlin, a person most hated by the entire race of giants. His subjects certainly seemed to support him full-heartedly when he confessed his love to Lola. Had the marriage been successful, the giants' hatred for Linlin would have ceased, showing their respect for Loki is stronger than their universal hatred for Linlin. Consequently, when Lola escaped and Linlin attempted to pass off her twin Chiffon as a replacement, the giants discovered the deception and came to detest Linlin further for offending their prince."}], "images": []}, {"title": "Lola", "level": 3, "content": [{"type": "paragraph", "text": "Loki fell in love with Lola at first sight even though she is the 23rd daughter of the giants' mortal enemy, Charlotte Linlin. Disregarding his people's long-time hatred for Linlin, Loki swiftly proposed to Lola, and a political marriage was arranged. However, Lola did not reciprocate the prince's feelings, and ran away in order to find her own true love. Loki was able to discover Linlin's attempt to deceive him with Lola's twin sister, Chiffon, whom he refused to marry, indicating his love for Lola was more than simply shallow appearance."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/91/Loki_Meets_Lola.png/revision/latest/scale-to-width-down/210?cb=20170313075645", "caption": "Loki proposing to Lola."}]}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a giant, Loki is considerably more powerful than the average person. As prince of Elbaf, he commands an entire military of giants, which is said to be the strongest in the entire world;Big Mom was confident that, had she taken over that military, she could have defeated the other Yonko and become the Pirate King. Being the prince, he also had the privilege of proposing to the 23rd daughter of Big Mom, who was deeply hated by the giants, and had the marriage been successful, Loki's political influence would have allowed the giants' grudge against Big Mom to cease. Since Big Mom attempted to deceive Loki after failing to deliver Lola as an arranged bride, the giants as a whole came to detest her even further for offending their prince."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Loki was born around ten months after a five-year old Charlotte Linlin was left at Elbaf by her parents."}, {"type": "paragraph", "text": "Years later, Loki once encountered the 23rd daughter of the Charlotte Family, Lola, whom he fell in love with at first sight. Lola's mother Linlin then arranged a marriage between him and Lola in hopes to fix her strained relationship with the giants and gain access to Elbaf's army. However, Lola ran away due to wanting to marry someone she truly loved, and Big Mom tried replacing her with her twin Chiffon. However, the giants realized the trick and the wedding was annulled, with the enmity between the two sides increasing from what it was before."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Loki shares his name with the Norse god Loki. Aside from being a god, Loki was also said to be a Jötunn, which are a race of giants.", "elements": [{"text": "On the other hand, it is also likely that his name is a reference to Utgard-Loki, a Jotunn whom, unlike the Norse god of mischief, is the ruler of Utgard in Jotunheim, the homeland of the giants.", "elements": []}]}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 85 Chapter 858 (p. 9-10) and Episode 827, Loki is first mentioned.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 86 Chapter 866 (p. 14) and Episode 836, The giants celebrate Loki's birth.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 84 Chapter 847 (p. 6, 13-16) and Episodes 812–813, Big Mom speaks of the failed marriage.", "elements": []}]}], "images": []}]}