{"sections": [{"title": "Daidalos", "level": 1, "content": [{"type": "paragraph", "text": "Daidalos was a giant squid that was close friends with Ikaros Much. He was first shown when Ikaros was thinking of him."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He was a small pale yellow squid, with fin-like appendages on the top of his head. He had six tentacles, unlike the regular squid that has ten. His tentacles were brown on the underside, with suction cups underneath them. He had a tiny mouth, and black and yellow colored eyes."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Daidalos was extremely close with Ikaros Much, who was his best friend. He is also somewhat curious, as he went towards the sun. It is unknown whether Daidalos had the same opinion of humans that Ikaros Much did."}], "images": []}, {"title": "History", "level": 2, "content": [{"type": "paragraph", "text": "Daidalos was with Ikaros and the other New Fish-Man Pirates' officers during their childhood."}, {"type": "paragraph", "text": "Some time before Fisher Tiger founded the Sun Pirates, Daidalos went too close to the sun, which caused him to dry out and die. The trauma from losing him was so big, that every time Ikaros sees fire, he becomes nervous and angry."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/9e/Squid_Youth.png/revision/latest?cb=20130116031022", "caption": "Daidalos and Ikaros listening to grown-ups celebrate human bloodshed."}]}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Daidalos' story comes from the myth of Daedalus and Icarus: a father and son who tried to fly with wings made of feathers and wax. Daedalus warned Icarus not to fly too high, because the heat of the sun would melt the wax. Icarus, forgetting himself, began to soar upwards towards the sun. The blazing sun softened the wax which held the feathers together and they came off. Icarus fell into the sea and drowned. Ironically, here Daidalos is the one that died, which is the opposite of the myth.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 64 Chapter 630 and Episode 550, Ikaros remembers his friend.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 65 Chapter 644 and Episode 564, Daidalos is seen next to Ikaros while listening to Arlong.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 622 and Episode 541, Daidalos is not with Ikaros any longer when the news about the Sun Pirates' success arrives Fish-Man Island.", "elements": []}]}], "images": []}]}