{"sections": [{"title": "Charlos", "level": 1, "content": [{"type": "paragraph", "text": "Saint Charlos is a World Noble, the son of Saint Rosward, and the older brother of Saint Shalria."}, {"type": "paragraph", "text": "Due to his actions, he can be considered the main antagonist in the Sabaody Archipelago Arc, and a minor antagonist during the Levely Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Charlos has the same hairstyle as his father and sister. He has a wide, obese face and what appears to be stubble around his thick-lipped mouth. He always has snot hanging from one of his nostrils, which he regularly picks at."}, {"type": "paragraph", "text": "As a Celestial Dragon, he wears the typical full-body, thick white suit of obese frame that resembles a spacesuit with medals or buttons on it, with a green collar, and a resin bubble that grants him a supply of oxygen separate from the ones commoners breathe."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Charlos is more of a spoiled brat in comparison to his sister and lacks a sense of responsibility. His personality can be compared to Helmeppo's when Luffy first met him, although seemingly worse. While he shares the same disregard for commoners as his father and sister, he is more prone to acting immature or violent than they are. He also has a habit of picking his nose all the time. While his family shows commoners where their place is whenever they pass by, Charlos purposely goes out of his way to make it clear. He made his slave suffer like his sister did, but his sister simply shot her slave whereas he pushed his slave to the limits until he collapsed, and then sold him off to ensure the man's continued suffering. He also seems to have a very strong need for confirmation from his father, as he constantly wants him to see and acknowledge his actions."}, {"type": "paragraph", "text": "Due to his completely spoiled nature and arrogance as a World Noble, Charlos is extremely selfish and unreasonable. Considering himself a god, he believes he has the right to cruelly enslave anyone including royalty and will ruthlessly murder anyone who refuses to comply with his demands as is shown when he ordered Lucci to kill Neptune when he attempted to save his own daughter from him."}, {"type": "paragraph", "text": "Like any World Noble, Charlos demands absolute respect and obedience from commoners and will not tolerate anyone who dares to defy him. This was shown when he was aghast when he saw that Zoro wasn't bowing to him like the others and immediatley shot at him when Zoro spoke to him. He also shot at Luffy when he walked right up to him in order to punch him. He won't even accept defiance from a fellow Celestial Dragon, like when he swore revenge on Saint Mjosgard for hitting him with a club to prevent him from taking Shirahoshi."}, {"type": "paragraph", "text": "He also wastes money, as seen by his committing to spend an absurd amount of money on Camie while just intending to put her in a tank full of piranhas and watch her swim for her life. He generally does not bother much with details and leaves his escorts to handle the issues of things like paperwork."}, {"type": "paragraph", "text": "Charlos is obsessed with mermaids, having spent a massive amount of money just to buy Camie. After taking an interest in Shirahoshi, Charlos went as far as to openly attempt to enslave her during the Levely."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "After Charlos shot and mocked Hatchan, he earned Luffy's wrath. Charlos tried to shoot Luffy for his defiant stance towards him but Luffy was unfazed by his actions, much to Charlos' fear. In retaliation for his actions, Luffy punched him in the face so hard that the World Noble was sent crashing through many rows of seats and was left unconscious. Luffy knew that an admiral would be sent after him due to this, but he did not care as he hated the World Noble so much."}], "images": []}, {"title": "Donquixote Mjosgard", "level": 4, "content": [{"type": "paragraph", "text": "When Charlos openly tried to enslave Shirahoshi, Mjosgard did not approve of his actions and went as far as striking Charlos with a mace before apologizing for his heinous actions, which could have nearly ruined the Levely, and calling his fellow Celestial Dragon an \"idiot\". Charlos developed an intense hatred towards Mjosgard for thwarting his attempt to enslave Shirahoshi and also bashing him in the face, swearing he would never let Mjosgard get away with his actions."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a World Noble, Charlos has immense political power to do as he pleases and can summon an admiral if he is harmed in any way. His authority allows him to enslave anyone, even royalty, and he can order CP-0 to assassinate people or protect him."}, {"type": "paragraph", "text": "He seems to have good eyesight as he could see Zoro moving at a fast speed, though he is not very bright as he believed that Zoro was killed by the bullet that he dodged, when Bonney actually acted by pushing Zoro down. Physically, Charlos is very weak, as he would rather be carried around by a slave than walk, and was easily knocked out with one punch by Luffy and struck by Mjosgard with a mace."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Charlos wields a golden pistol, but it is unclear how skilled he is at using it, since Luffy and Zoro were able to dodge his shots with ease. He basically uses it to shoot anyone who displeases him at point blank range. He did manage to shoot Hatchan, something that made him overly excited and proud."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b8/St._Charlos_Flintlock.png/revision/latest/scale-to-width-down/180?cb=20130122193104", "caption": "Charlos' pistol."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "Charlos rode on a slave through Grove 24, looking for his father and sister. He kicked the slave carrying him for going too slow before noticing two doctors and a nurse carrying a badly injured person in front of him. Angered at their movement, he kicked the injured man onto the ground before deciding to take Marie, the nurse, as his wife; he told his attendant to send away his first through fifth wives since he was tired of them. Judy, Marie's fiance, attempted to step in, but Charlos shot him as he ordered Marie to be taken to the port. Right then, Roronoa Zoro came walking in front of Charlos. Charlos shot at him, and Zoro was about to pull out his blade on the World Noble when he was suddenly pulled away by Jewelry Bonney. Bonney acted as though Charlos had shot Zoro, and so Charlos continued on."}, {"type": "paragraph", "text": "Charlos made it to the Human Auctioning House, but half of the auction had already been finished. He kicked the slave that had carried him in anger and ordered him to be sold. As he came in, he expressed his desire to buy a mermaid as he reunited with his family. Charlos became stunned when the mermaid Camie was unveiled onstage, and he immediately bid 500,000,000 on her. Nobody could offer a larger amount, but as the bidding ended, Monkey D. Luffy and some of his crewmates broke into the Auctioning House. The fish-man Hatchan tried unsuccessfully to stop Luffy from going after Camie, and as Luffy ran on ahead, Charlos shot Hatchan, planning to take him as a slave as well. Hatchan talked to Luffy, and an annoyed Charlos prepared to shoot him again, only to have Luffy walk up to him. Luffy then punched Charlos in the face, sending him flying through several benches and knocking him out."}, {"type": "paragraph", "text": "The unconscious Charlos was later seen with his father, who had also been knocked out, outside of the Auctioning House while Shalria scolded the Marines for failing to capture the Straw Hats."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/ce/Zoro_Encounters_Charloss.png/revision/latest/scale-to-width-down/150?cb=20170702183223", "caption": "Zoro unknowingly meets Charlos."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/db/Luffy_Punches_Charlos.png/revision/latest/scale-to-width-down/180?cb=20130520233546", "caption": "Charlos is sent flying by Luffy."}]}, {"title": "Levely Arc", "level": 3, "content": [{"type": "paragraph", "text": "After Neptune and his family arrived at Mary Geoise for the Levely, Charlos spotted Shirahoshi from his estate. He later attempted to make her his slave and was protected by CP-0 while doing so. As he ordered Rob Lucci to kill Neptune for opposing him, he was stopped and struck in the face with a spiked club by his fellow World Noble, Donquixote Mjosgard. As Charlos laid on the ground unconscious, Mjosgard ordered for Shirahoshi to be set free and apologized for Charlos' reprehensible behavior."}, {"type": "paragraph", "text": "Charlos was then taken away and carried to the Domain of the Gods. At the Celestial Dragon gate, his father went to see him after hearing about the incident at the socializing plaza."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b6/Charlos_Beaten_Up_Second_Time.png/revision/latest/scale-to-width-down/210?cb=20190526030331", "caption": "Charlos being attacked by Mjosgard."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Charlos vs. Roronoa Zoro (interrupted by Jewelry Bonney)", "elements": []}, {"text": "Charlos vs. Monkey D. Luffy", "elements": []}, {"text": "Charlos vs. Donquixote Mjosgard", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "He currently has a total of eight wives; he previously had 13 but dismissed five of them.", "elements": []}, {"text": "Charlos has a habit of constantly picking his nose through his bubble. This is due to the fact the bubble is made with Sabaody Archipelago Yarukiman resin instead of glass, making them penetrable. This also explains how Luffy was able to punch him despite the bubble not shattering, but rather popping.", "elements": []}, {"text": "The scene in which Mjosgard strikes him with a mace during the Levely Arc is an exact mirror of the scene where Luffy punched him during the Sabaody Archipelago Arc.", "elements": []}]}], "images": []}]}