{"sections": [{"title": "Peterman", "level": 1, "content": [{"type": "paragraph", "text": "Peterman is the head of a kidnapping gang called the Hound Pets, located in Sabaody Archipelago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Peterman is a large man with a muscular torso and proportionally thin limbs. He has fuzzy black hair, a flat nose, sharp lips, and his shoulders seem to have studs sticking onto them. He wears a brown shirt with a green vest over it, black pants, a yellow coned hat with a white feather that has a red tip on it, and boots with frills."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Peterman is a selfish individual, intending to sell Camie into slavery and give only a measly 10% of the profit to the bounty hunters who gave him the information. His willingness to enter the slave trade reveals his indifference towards moralities."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the head of the Hound Pets, he has total control over the gang, and the fact that bounty hunters would go to him for assistance signifies his strength. His weapon of choice is a bow and arrows. However, Duval easily defeated Peterman."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "Peterman was informed by some bounty hunters, Kairiken and Minoruba, that had attacked the Straw Hat Pirates previously that Camie, a mermaid, was at Sabaody Park. He then arranged a deal to give them 10% of her final selling price to the bounty hunters and went to kidnap her."}, {"type": "paragraph", "text": "Peterman went to Sabaody Park and watched the Straw Hat Pirates and their friends enjoy themselves for a while in disguise as a mascot before revealing himself and capturing Camie."}, {"type": "paragraph", "text": "He later took her to the Human Auctioning House, and planned to come back after she was sold in order to get his share of the profit. He never got the chance however, as the Straw Hats managed to rescue her with Duval and the Rosy Life Riders. Duval later gave him a deserved beating for his actions and took Camie's bag back for her."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Peterman vs. Duval", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Peterman's design may be a reference to Robin Hood, though ironically he steals others to be slaves to the rich rather than rob from the rich as in the legends.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 499 and Episode 393.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 141), His birthday is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 499 and Episode 393, Peterman disguises himself and kidnaps Camie.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 506 and Episode 400.", "elements": []}]}], "images": []}]}