{"sections": [{"title": "Disco", "level": 1, "content": [{"type": "paragraph", "text": "Disco is the owner of the now-bankrupt Human Auctioning House at Grove 1 in Sabaody Archipelago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Before the timeskip, Disco was a thin, eccentric man who had long silver hair, a cleft chin, stubble beard and mustache. He wore a purple coat, pink scarf, a tall yellow hat with flower patterns around the bottom, and his trademark star-shaped glasses."}, {"type": "paragraph", "text": "After the timeskip, Disco has lost his business and has become ragged-looking, with torn clothes and a scruffy beard and hairstyle. He now wears torn black boots and a ripped shirt and shorts. However, he still maintains his hat and glasses, the former which crumpled inward."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He is a sadistic person, who abused and kicked Camie when she was first brought to him. He is extremly easy to anger, as he fell into a fit of absolute rage from a harmless gesture like Camie sticking her tongue out at him."}, {"type": "paragraph", "text": "After the fall of the human shop, he seems to have fallen to ruin and become unable to move on, resorting to alcohol. He also seems to have developed a grudge towards the Worst Generation who were present at the day of the Human Shop's end, as he stabbed the wanted posters of Luffy, Kid, Law, and Rayleigh with knives."}], "images": []}, {"title": "Relationship", "level": 2, "content": [], "images": []}, {"title": "Allies", "level": 3, "content": [], "images": []}, {"title": "Donquixote Doflamingo", "level": 4, "content": [{"type": "paragraph", "text": "Doflamingo left Disco in charge of the Human Auctioning House. After Luffy punched a Celestial Dragon, Disco contacted Doflamingo to beg him to resolve the problem. However, Doflamingo lost interest in the slave-trade and told him to never call him again due to the age of SMILES and he would attend the war against the Whitebeard Pirates leaving Disco in shock."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "Because of all the trouble Luffy caused after punching a Celestial Dragon, Disco holds a grudge on him for ruining his business and losing his job and dignity."}], "images": []}, {"title": "Eustass Kid", "level": 4, "content": [{"type": "paragraph", "text": "Because Kid was part of the incident that Luffy caused, Disco despises him and stabs his wanted poster."}], "images": []}, {"title": "Trafalgar D. Water Law", "level": 4, "content": [{"type": "paragraph", "text": "Disco also holds a grudge against Law for the incident where Luffy punched a World Noble. Disco expresses his hatred for him by stabbing his wanted poster."}], "images": []}, {"title": "Silvers Rayleigh", "level": 4, "content": [{"type": "paragraph", "text": "Disco hates Rayleigh for pretending to be a slave to steal money, causing the customers to cancel their orders and demand refunds. Two years later, he expresses his grudge by stabbing his wanted poster."}], "images": []}, {"title": "Camie", "level": 4, "content": [{"type": "paragraph", "text": "After the mermaid Camie was captured, he attempted to sell her as a slave to the World Nobles for 500,000,000 but failed due to the intervention by the Straw Hat Pirates."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Disco was the owner of the Human Auctioning House, so he had authority over his employees. However, after Doflamingo abandoned the shop, his business fell into ruin."}, {"type": "paragraph", "text": "Disco possessed a weak will, having been knocked out by Rayleigh's Haoshoku Haki."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "He was responsible for the human auction where the Straw Hat Pirates went to save Camie. He was the one who presented the slaves to the buyers. After all the mess that Luffy and the Straw Hat Pirates made he was seen furious."}, {"type": "paragraph", "text": "When Silvers Rayleigh broke his chains with Haki, he used Haki to knock out the rest of the soldiers in the auction, including Disco."}, {"type": "paragraph", "text": "He was later seen injured (the anime showing it was Shalria that caused it when Disco was inquiring about payment for Camie during the chaos), calling the shop's owner, Shichibukai Donquixote Doflamingo for help. However, the Shichibukai told Disco that he could have the shop and never to call again, as Doflamingo wasn't interested in it anymore, and that the future was in Smiles; he also mentioned that the government was calling the Shichibukai to battle against the Whitebeard Pirates, much to Disco's horror."}], "images": []}, {"title": "From the Decks of The World", "level": 3, "content": [{"type": "paragraph", "text": "Two years later, Disco is seen in complete disgrace, living as a vagrant outside of the ruins of the Auction House, stabbing the wanted posters of Luffy, Eustass Kid, Trafalgar Law, and Silvers Rayleigh."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 500 (p. 16-18) and Episode 394, Disco makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 504 (p. 6-7) and Episode 398, Disco's connection with Doflamingo is revealed.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 67 Chapter 659, cover story: From the Decks of the World Vol. 41, Disco living in poverty.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 107), Disco's birthday is given.", "elements": []}]}], "images": []}]}