{"sections": [{"title": "Marie", "level": 1, "content": [{"type": "paragraph", "text": "Marie is a nurse on Sabaody Archipelago."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Marie is a young woman with short black hair and dark brown eyes. She wears a light pink dress that goes down to the middle of her thigh, and has a red medical cross on the left side of her chest. She also wears a small light pink nurse hat, and a pair of matching shoes. Due to being enslaved by Saint Charlos, Marie was slated to have the Hoof of the Soaring Dragon burned onto her back, signifying her as “less than human”. However, as she was soon liberated, it is unclear if she actually received the mark."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Marie likes to help her patients, as a nurse, since she was helping a wounded man. It is also heavily implied that she loved Judy, since they were revealed to be engaged."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "She was helping transport a wounded man to a nearby hospital, when they encountered Saint Charlos, a Celestial Dragon. Saint Charlos refuses to let Marie pass with the wounded man, kicking the heavily-wounded man to the ground and saying that he will help him die. While Marie was kneeling beside the victim, shocked at Charlos' cruel behavior, Charlos noticed her beauty and forced her to come with him in order to become his thirteenth wife against her will. When her fiancé, who was also helping to transport the wounded man, got up and pleaded with Charlos not to take Marie away, he shot him for daring to stand in his presence."}, {"type": "paragraph", "text": "She was set free along with the other slaves of Saint Charlos's family after Luffy's attack on the Celestial Dragons."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 499 (p. 11) and Episode 393, Marie the nurse helps transport a wounded man.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Marie's birthday is given.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 499 (p. 13) and Episode 393, Marie is revealed by Judy to be his fiancee.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 499 (p. 11-13) and Episode 393, Marie makes her debut.", "elements": []}]}], "images": []}]}