{"sections": [{"title": "Byron", "level": 1, "content": [{"type": "paragraph", "text": "Byron is one of the slaves who was sold at the Human Auctioning House and was the first in the queue for sale."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "He has long blond, unkempt hair and long and big eyebrows. He has a small beard and a scar on his face which goes down from the forehead to his eye. He wears a dark coat and a red vest with a white scarf-like garment under it. He also wears an orange strip over his brown pants."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "He appeared to be angry and at the same time ashamed with the fact he was captured and enslaved. But he had no reaction over this, staying quiet during the bid for him."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "He is able to play many instruments and he apparently could also make good wine."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "He is from the town of Toroa in the West Blue and descended from a long line of musicians."}], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "At some point in his life, he was captured and taken to the Human Auctioning House. His starting bid was a mere 480,000, while his final selling price was not revealed in the manga; he was sold for at least 550,000, in the anime he was sold for 600,000. It is unknown what happened to him after the Straw Hat Pirates freed the slaves but it can be assumed that he escaped with all the other slaves."}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 501 and Episode 395, Byron's biography revealed by Disco while he is being sold.", "elements": []}, {"text": "↑ One Piece Manga and Anime — Vol. 61 Chapter 598 and Episode 517, two years pass in the storyline.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Byron's birthday is given.", "elements": []}]}], "images": []}]}