{"sections": [{"title": "Mink Tribe", "level": 1, "content": [{"type": "paragraph", "text": "The Mink Tribe is a race in the world. They were first mentioned in the list of slave prices that Duval showed to Sanji. The vast majority of them live in the Mokomo Dukedom on top of Zou, and has largely remained isolated from other human civilizations for 1000 years."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Minks are humanoids with animal features. Similar to fish-men and merfolk, each individual takes after a specific animal. So far, the animalistic traits of the minks have all been fur-covered mammalian. As such, fur, which they also refer to as \"mink\", covers most of their bodies and is considered their pride and joy. Females tend to look more like humans while males tend to look more bestial. They possess humanoid hands and feet, but those based on animals with paws will also possess paw pads on their palm and up to their first knuckle."}], "images": []}, {"title": "Biology", "level": 2, "content": [{"type": "paragraph", "text": "The species that individual minks take after are not directly hereditary. When Pekoms reunited with his parents, none of the minks in the crowd were lion minks. Also similar to fish-men and merfolk, minks can give birth to any species of mammals, depending on their heritage."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/a1/Mink_Individual_Species_Family.png/revision/latest/scale-to-width-down/210?cb=20180518214519", "caption": "A panda mink and a fox mink marriage with fox and panda mink children."}]}, {"title": "Minks and Their Species", "level": 3, "content": [{"type": "list", "elements": [{"text": "Inuarashi, Wanda: Dog", "elements": []}, {"text": "Nekomamushi, Faust, Lindbergh, Noir (Show): Cat", "elements": []}, {"text": "Bepo, Zepo: Polar bear", "elements": []}, {"text": "Pekoms, Shishilian: Lion", "elements": []}, {"text": "Giovanni: Zebra", "elements": []}, {"text": "Concelot: Fox", "elements": []}, {"text": "Tristan: Squirrel", "elements": []}, {"text": "Bariete, Monjii, Keith: Monkey", "elements": []}, {"text": "Carrot: Rabbit", "elements": []}, {"text": "Roddy: Bull", "elements": []}, {"text": "Blackback: Gorilla", "elements": []}, {"text": "Pedro: Jaguar", "elements": []}, {"text": "Yomo: Sheep", "elements": []}, {"text": "Miyagi: Goat", "elements": []}, {"text": "Milky: Reindeer", "elements": []}, {"text": "Musatobi (filler): Flying squirrel", "elements": []}]}], "images": []}, {"title": "Overall Strength", "level": 2, "content": [{"type": "paragraph", "text": "All minks have formidable physical abilities, far superior to normal humans. Some are highly agile and can leap incredible distances while others are incredibly burly and strong. They also possess considerable stealth capabilities, having completely surrounded Monkey D. Luffy, a proficient user of Kenbunshoku Haki, without him even realizing it. All minks are powerful warriors from birth who retained their strength in old age."}, {"type": "paragraph", "text": "They also possess extremely quick recovery rates and a strong metabolism. Their overall combat abilities are great enough that Capone Bege, a member of the Worst Generation with a bounty of 300,000,000 and a large amount of men and firepower at his disposal, was wary of confronting the minks even though they were still recovering from Jack's assault."}, {"type": "paragraph", "text": "Despite their great combat strength, the minks are left weakened by heat due to their thick fur coats."}], "images": []}, {"title": "Electro", "level": 3, "content": [{"type": "paragraph", "text": "Through unknown means, they can produce electric shocks known as Electro (エレクトロ, Erekutoro) from their bodies. Some of them are trained in weaponry such as swords and spears through which they can channel Electro."}], "images": []}, {"title": "Sulong", "level": 3, "content": [{"type": "paragraph", "text": "Sulong (, Sūron, literally meaning \"Moon Lion\") is a form a mink takes upon looking directly at a full moon. This form unleashes their primal animal instincts. It is thought to be something only the minks of Zou train in and is considered to be the \"true form\" of the Mink Tribe."}, {"type": "paragraph", "text": "In order to transform, a mink would need to look at the full moon for a period of time until the transformation is complete. During transformation, the mink's hair grows exponentially as well as their body becoming significantly larger, and they emit an electric charge. Along with their altered appearances, their strength and speed also vastly increase. This form is strong enough, that when a single mink transformed, it caused panic among the members of the Big Mom Pirates."}, {"type": "paragraph", "text": "Without proper training to suppress their feral urges, minks will lose their minds and rampage indiscriminately. Also, using this form for too long can cause severe exhaustion or even death. A mink can return to their original form if the moonlight is blocked from their eyesight."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c8/Carrot%27s_Sulong_Transformation.png/revision/latest/scale-to-width-down/210?cb=20171211211019", "caption": "Carrot shifting into her Sulong form."}]}, {"title": "Inter-species Relationships", "level": 2, "content": [{"type": "paragraph", "text": "Minks are valued as slaves by humans, and the standard price for a Mink Tribe member is 700,000."}, {"type": "paragraph", "text": "They frequently refer to humans as lesser minks (, ressā minku, literally meaning \"fewer hairs\") because they believe humans are ordinary monkey minks with fewer hairs and thus assume both races are the same. Despite the rumors surrounding them, they do not have a grudge against humans, with some minks even admiring them or at times being attracted to them."}, {"type": "paragraph", "text": "The Mink Tribe is widely believed to have a closed door policy, isolating themselves from humans for over a millennium. However, they are actually quite welcoming of guests visiting their country, for whom they ring their Bell of Welcome upon arrival. They also have access to newspapers and are thus informed on events occurring around the world. There are even some minks who have left the island to live outside, as evidenced by Bepo, who left at a young age and joined the Heart Pirates, and Pekoms of the Big Mom Pirates. This practice is so common that Zou's two current rulers, Inuarashi and Nekomamushi, are former members of both the Whitebeard Pirates and the Roger Pirates. Also, unlike other isolationist countries such as Amazon Lily and Wano Country, minks are very knowledgeable of Devil Fruit powers, as Nekomamushi knew down to detail that Jack ate an Ancient Zoan variant of the Zou Zou no Mi after witnessing his transformation, although it is possible he gained this knowledge after leaving Zou and sailing the seas with Inuarashi."}, {"type": "paragraph", "text": "The minks of Zou are extremely loyal to their friends, to the point of lying to enemies and sacrificing themselves and their country in order to protect them. This is prominently displayed by their strong bond with the members of the Kozuki Family from Wano Country, long-time friends who they consider family."}, {"type": "paragraph", "text": "Minks are one of the races known to inhabit Totto Land, where they live in harmony with other races."}], "images": []}, {"title": "Beliefs", "level": 2, "content": [{"type": "paragraph", "text": "Minks take great pride in their fur, which they refer to as \"mink\", and it seems to be an important aspect of their race's identity. The Whale Forest is a sacred place that the minks of Zou have revered for generations, and because of this, it is constantly under the protection of one of the rulers of the Mokomo Dukedom, Master Nekomamushi. Duke Inuarashi has also indicated that the minks of Zou revere several deities, though the details of their spiritual traditions remain unknown. Minks tend to share a unique speech pattern, with females occasionally adding \"-teia\" and males adding \"-gara\", mid-sentence, usually attached to a pronoun (e.g.: you-teia, or you-gara). However, minks who have spent much of their lives away from Zou, such as Bepo and Pekoms, seem to abandon this speech pattern. Even Carrot once shared this speech pattern, but she gradually grew out of it after she began traveling with the Sanji Retrieval Team during the Whole Cake Island Arc."}, {"type": "paragraph", "text": "The minks do not eat meat from anything with fur due to their own mammalian appearances, but they do not have a problem with eating non-furry mammals like hippos. Their diet also includes amphibians, reptiles, and fish."}, {"type": "paragraph", "text": "While the minks do not seem to differ among themselves, they recognize the different species among their race, as demonstrated when Wanda referred to several members and herself as \"Canine Minks\" (犬のミンク, Inu no Minku)."}, {"type": "paragraph", "text": "The minks are very honest with their desires and naturally pursue things that their animal traits stereotypically like, such as bananas for primate minks, fluttery cloth for bull minks, or bones for canine minks. They tend to show affection to others in the form of \"minkship\" (pun on \"skinship\"), which includes cuddling, nibbling, licking, or exchanging clothes, an act they consider to be a sign of friendship."}, {"type": "paragraph", "text": "When offering greetings or expressing gratitude, the minks use \"Garchu\" in place of thanks or hello. Sanji frequently uses \"Garchu\" as a way of getting the female minks to acknowledge his greeting while ignoring \"Garchu\" as thanks from the male minks. When Zoro resisted the cuddling of \"minkship\", several younger minks protested against Zoro's refusal."}, {"type": "paragraph", "text": "The minks that live on Zou had divided their day between day and night and after 12 hours, exactly at six o'clock, fell asleep immediately where they stood. This was done to prevent the two leaders from encountering each other and fighting. However, several exceptions have been shown, like the \"Ruler's Aides\", the Guardians, during intense fights, and during a nation wide event. After Inuarashi and Nekomamushi were asked to make peace with each other by Momonosuke, this segmentation has been nulled."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "In the real world, a mink is a type of animal that was at one point bred in fur farms for its highly prized fur.", "elements": []}, {"text": "Some humans can have mink-like physical features, such as Masira and Shoujou, but they are still just regular humans.", "elements": []}, {"text": "The minks' Sulong transformation is similar to the myth about werewolfs, who would also transform from humans into ferocious bipedal animals (wolves) under the light of a full moon.", "elements": [{"text": "The minks being a race of natural born fighters who can undergo a powerful transformation under a full moon and rampage if they had no training is also similar to the Saiyans from the Dragon Ball franchise.", "elements": []}]}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Anthropomorphism — Wikipedia article about anthropomorphism.", "elements": []}, {"text": "Talking Animals — Wikipedia article about Talking animals.", "elements": []}, {"text": "Animals — Wikipedia article about Animals.", "elements": []}]}], "images": []}]}