{"sections": [{"title": "Lacuba", "level": 1, "content": [{"type": "paragraph", "text": "Lacuba is a pirate famed as a devious tactician, with a bounty of 17,000,000."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Lacuba is a tall man with a brown coat and hat. He has long black hair and a beard, and has his crew's jolly roger tattooed on his chest. After his attempted to suicide, the tip of his tongue was flat from biting it off."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Lacuba is a prideful man, as he would rather attempt suicide than spend the rest of his life being humiliated as a slave."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Lacuba became famous for his tactics, so he is a skilled strategist. Being a captain, he has command over his crew."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 3, "content": [{"type": "paragraph", "text": "At some point in his life he was captured and taken to the Auction House."}, {"type": "paragraph", "text": "After protesting over becoming a slave, he choose death over slavery and attempted suicide on stage by biting his tongue which led to his collapse."}, {"type": "paragraph", "text": "He was later seen alongside the other slaves when Franky threw the keys to them, though his tongue was flat due to biting it earlier."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/03/Sabaody_Slaves_Celebrate_Their_Freedom.png/revision/latest/scale-to-width-down/210?cb=20131127223029", "caption": "Lacuba and the other slaves celebrate their freedom."}]}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 501 and Episode 395, Lacuba is introduced.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 198), His birthday is revealed.", "elements": []}, {"text": "↑  Eternal Log, Lacuba's wanted poster is revealed.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 501 and Episode 395, Lacuba protesting at being a slave.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 502 and Episode 396, Lacuba attempts to take his life on stage at the Auction House.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 504 and Episode 398, Lacuba is seen alive.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 53, Fan question: \"Right in the middle of the celebrating former slaves is Lacuba, the pirate who bit his tongue and fell unconscious in Volume 51!!...And on top of that, his tongue is flat on the end!!!\"", "elements": []}]}], "images": []}]}