{"sections": [{"title": "Kinderella", "level": 1, "content": [{"type": "paragraph", "text": "Kinderella, also known as Miss Universe, is a woman who married Wapol after he became the head of his own corporation. Two years after that, she became the queen of Black Drum Kingdom when Wapol became its king."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Kinderella is a slim woman with purple hair whose mouth is often seen open. She wore long purple dresses, and was seen by others as beautiful. After becoming the queen, she added a dark cape with bat wings on the shoulders, a hood with a crow design, long light-colored gloves, and an eye-mask."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Kinderella enjoys listening to her husband insulting other people and laughs profusely when he does so, indicating that she is as rude as he is. She sometimes adds \"-universe\" as a suffix at the end of her sentences."}, {"type": "paragraph", "text": "Like many other people, Kinderella has a unique laugh: \"Koshi koshi koshi\" (コシコシコシ, \"Koshi koshi koshi\")"}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As queen of the Black Drum Kingdom, Kinderella has control over its citizens and is able to attend the Levely."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Sky Island Saga", "level": 3, "content": [], "images": []}, {"title": "Wapol's Omnivorous Hurrah", "level": 4, "content": [{"type": "paragraph", "text": "After Wapol became successful in his toy making business and opened his own company, Kinderella married him and they lived a luxurious life."}], "images": []}, {"title": "Fishman Island Saga", "level": 3, "content": [], "images": []}, {"title": "From the Decks of the World", "level": 4, "content": [{"type": "paragraph", "text": "Two years later, she was still married to Wapol and they were now the king and queen of the new Evil Black Drum Kingdom, due to being rewarded by the World Nobles for their company's enormous success."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the time for Levely approached, Kinderella prepared to accompany Wapol to Mary Geoise."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "Kinderella and Wapol later arrived at Mary Geoise. At the castle, she laughed when Wapol approached Vivi and insulted her until Dalton drove Wapol away."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "Kinderella's name is likely based off of the fairy tale character Cinderella. This is ironic, given that it was her husband who rose from a life of poverty and tedious work, while she already possessed the title of \"Miss Universe\".", "elements": []}, {"text": "Her name may also be based off of Kinder Surprise, which are chocolate eggs with toys inside them, which fits with Wapol's job as a toy maker.", "elements": []}, {"text": "\"Miss Universe\" is an annual international beauty contest that is run by the Miss Universe organization.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 28 Chapter 261, cover story: Wapol's Omnivorous Hurrah Vol. 22 and Episode 778.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 64 Chapter 635, cover story: From the Decks of the World Vol. 19, Kinderella and Wapol rule over their new kingdom.", "elements": []}, {"text": "↑  SBS One Piece Manga — Vol. 90, https://one-piece.com/special/sbs/detail/9.html", "elements": []}, {"text": "↑  One Piece Manga — Vol. 90 Chapter 906, Kinderella's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 90 Chapter 906 (p. 12-13) and Episode 885.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 28 Chapters 261 and 262, cover story: Wapol's Omnivorous Hurrah Vol. 22-23 and Episode 778.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 82 Chapter 823 (p. 8) and Episode 778, Kinderella prepares to travel to the Levely.", "elements": []}]}], "images": []}]}