{"sections": [{"title": "Jean Bart", "level": 1, "content": [{"type": "paragraph", "text": "Jean Bart is a pirate who was originally introduced as Saint Rosward's slave, being part of his Pirate Captain Collection. He currently serves under Trafalgar Law after being freed from the World Noble."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Jean Bart is a large man with a fierce looking face comparable to a guard animal. His size surpasses that of Jinbe by roughly two to three times, being able to catch him and carry him easily. He has flame-shaped tattoos on his forehead and a scar running above his right eye. He often bares his teeth. He has large sideburns that line the sides of his face as well as a long mane that runs down his back."}, {"type": "paragraph", "text": "Like all slaves of the World Nobles, Bart has the \"Hoof of the Soaring Dragon\" mark burnt onto him, which would forever signify him as \"less than human\"."}, {"type": "paragraph", "text": "When he was a slave, he wore rags and was often forced by his owners to walk on all fours like a lumbering beast. After his liberation and joining the Heart Pirates, he started walking normally again and switched to a black A-shirt."}, {"type": "paragraph", "text": "After the timeskip, he now wears a boiler suit with the crew's Jolly Roger imprinted on it, similar to the other members of the Heart Pirates, and has a full beard in addition to his sideburns."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Most of his personality has not been revealed yet, but he seems to be a man of honor and repays his debts as he joined Law's crew, the Heart Pirates, after he was freed from the World Noble. He also seems to be patient and calm as seen at Amazon Lily, the opposite of his usual behavior at the Archipelago or the battlefield of Marineford."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Jean Bart is an immensely strong man capable of breaking a bridge with a single punch. In fact, prior to his enslavement, he was a well known pirate captain. Even suffering abuse from the Rosward family did not deter him, thus demonstrating great resilience and willpower (whereas fellow captain slave Devil Dias fled in cowardice, only to get blown up later)."}, {"type": "paragraph", "text": "In the anime, Jean Bart has been shown to be a competent helmsman and demonstrates good navigational skills, steering the crew's submarine to outrun Aokiji's massive ice wave and evading Kizaru's widespread torrent of light, escaping without a single scratch."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/6d/Jean_Bart_Destroys_A_Bridge.png/revision/latest/scale-to-width-down/230?cb=20150730025835", "caption": "Jean Bart shows his great strength as he breaks a bridge with one punch."}]}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "He was seen wielding a huge Flintlock pistol when defending Zou from Jack and his army."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Jean Bart was once a renowned pirate captain before he was captured and sold as a slave to the World Nobles."}], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was first seen as a slave walking on all fours, accompanying Saint Rosward and his daughter, after Devil Dias' collar exploded. After Rosward's daughter cruelly shot Devil Dias several times, Jean Bart left with the World Noble family."}, {"type": "paragraph", "text": "After Luffy's assault on Saint Charlos, Jean Bart was later freed by Trafalgar Law, after everyone was fleeing the Human Auctioning House building as an Admiral would be arriving. Law recognized Jean Bart by name, which Bart replied with \"I have not been called by that name in years.\" Jean Bart then gladly accepted Law's offer to join the Heart Pirates, thanking him in return. Law responded that half of his thanks should go to Mister Straw Hat. He was later seen with Eustass Kid and Law, preparing to fight a Pacifista."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Jean Bart was next seen with the Heart Pirates when they were watching the war at Marineford. When the broadcast was cut off, Law informed Jean Bart that they were setting sail."}, {"type": "paragraph", "text": "He later appeared at the Whitebeard War on the Heart Pirates submarine with Trafalgar Law, Bepo, Shachi, and Penguin. He caught Luffy and Jinbe as Buggy threw them to the ship, and successfully got them inside as the ship dove into the sea."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Heart_Pirates_Arrive_at_Marineford.png/revision/latest/scale-to-width-down/235?cb=20141206070314", "caption": "The Heart Pirates arrive at Marineford."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "After the Heart Pirates docked on the shore of Amazon Lily, he was seen with the rest of the crew, watching Bepo's scolding from a distance. Shortly after Silvers Rayleigh swam to the island, Bart left with Law and the rest of the crew. When Law said that he would wait to go to the New World, Jean Bart was seen with the rest of the crew looking pleased."}], "images": []}, {"title": "Post Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "While Law was staying at Punk Hazard, Jean Bart and the rest of the Heart Pirate crew went to an island called Zou. During the Beasts Pirates' invasion, the Heart Pirates assisted the Mink Tribe."}], "images": []}, {"title": "Zou Arc", "level": 3, "content": [{"type": "paragraph", "text": "Jean Bart first appeared after the timeskip when Luffy unknowingly trespassed at the Whales Forest and got into a fight with Roddy. Bart tried to stop the fight, but he was knocked down by Blackback. After Wanda and Carrot arrived and stopped the fight, the Heart Pirates got reacquainted with Luffy and were excited to hear that Law was on Zou as well."}, {"type": "paragraph", "text": "When Law arrived at their location, the Heart Pirates were overjoyed to be reunited with him. After the Straw Hats returned to the Whale Forest, the Heart Pirates greeted Luffy but were then furious when Luffy and Law went on having a private conversation. The Heart Pirates and Luffy's crew (except Franky, Robin, and Brook) then partied with Nekomamushi and his subjects."}], "images": []}, {"title": "Wano Country Arc", "level": 3, "content": [{"type": "paragraph", "text": "The Heart Pirates later infiltrated Wano Country. After Law was captured to free Bepo, Shachi, and Penguin, the Heart Pirates gathered in Ebisu Town and discussed about their captain's situation."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jean Bart, Heart Pirates, Kid Pirates, and Straw Hat Pirates vs. Marines", "elements": []}, {"text": "Jean Bart and fellow Heart Pirates, and Kid Pirates vs. Pacifista", "elements": []}, {"text": "Heart Pirates and Mink Tribe vs. Beasts Pirates", "elements": []}, {"text": "Jean Bart vs. Blackback", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Non-Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "When naming characters after real-life pirates, Oda usually gives them either just the first name or the surname. This one has the full name of French privateer Jean Bart.", "elements": []}, {"text": "Jean Bart's situation of being captured, enslaved, and then freed by a band of pirates that he joined is similar to the titular character of a poem by Lord Byron, whose name is similar to Jean Bart's crewmate Bepo.", "elements": []}, {"text": "During the real world Golden Age of Piracy, slavery was a common occurrence. When slave ships were raided by pirates the slaves were often given the chance to join their crew or remain a slave. Considering the conditions on board the slave ships and the cruelty many slaves faced, many accepted because life as a pirate was usually better than life as a slave.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Jean Bart – Wikipedia article on the real life pirate Jean is named after.", "elements": []}]}], "images": []}]}