{"sections": [{"title": "Bepo", "level": 1, "content": [{"type": "paragraph", "text": "Bepo is a polar bear mink and the navigator of the Heart Pirates under Captain Trafalgar Law. He is the younger brother of the late Nox Pirate Zepo."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Bepo is a white bear (possibly a polar bear as noted by the Marines) mink. He wears an orange jumpsuit that bears the Heart Pirates' jolly roger. He also wears small brown boots and has sharp teeth and claws. He is as tall as a normal bear, considerably taller than common humans."}, {"type": "paragraph", "text": "In Wano Country, he had a topknot despite having short fur and no hair. He also wore a yukata with the Heart Pirates' jolly roger surrounded by fish."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Bepo tends to get depressed easily and apologizes whenever people point out that he is a talking bear. An example of his sensitivity is when Hancock called him a beast and scolded him for attempting to change the subject. His crewmates also scolded him when he wondered aloud whether Amazon Lily had female bears, much to their annoyance. Overall, members of the Heart Pirates accuse Bepo of having a weak will. Ironically, he was able to remain conscious after taking a blast of Conqueror's Haki from Rayleigh, a feat only the exceptionally strong-willed can accomplish. Those who do not know him call him meek."}, {"type": "paragraph", "text": "He has been shown to order Jean Bart around (albeit unsuccessfully), seemingly delighted to have seniority over him. At the same time, he does not want Jean Bart to order him around. In the anime, he is shown to dislike hot environments (possibly due to his thick fur and the jumpsuit he wears), as he complained when the Heart Pirates' submarine was near an underwater volcanic region."}, {"type": "paragraph", "text": "Sometimes, he can do foolish things like eating a fish from a toxic river."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the navigator of the Hearts Pirates, it can be assumed that Bepo has the knowledge required to navigate the seas. The level of his skills is as yet unknown, though it is expected that he is reasonably capable of navigating through the Grand Line. Interestingly enough, despite his occupation, he is not seen wearing a Log Pose, which is essential for Grand Line navigation. He also has some skill in cartography, as he was the one who drew the map of Dressrosa and Green Bit that Law shared with the Straw Hats. However, he appears to be a bit messy, as the map had his paw print on it, and Nami stated that his map-drawing and navigation skills are far from her own."}, {"type": "paragraph", "text": "Bepo is fairly strong-willed, being able to withstand a blast of Silvers Rayleigh's Haki."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "As a member of the Mink Tribe, Bepo, like all other minks, is a born warrior. It can be presumed he is able to use Electro and transform into his Sulong form when gazing at the full moon like every other mink."}, {"type": "paragraph", "text": "He is also a skilled martial artist combining his fighting skills with his superior physical abilities as a mink, allowing him to take out several Marines with ease but he is not strong enough to break a Pacifista as when he attempted to kick a Pacifista, he wounded his leg, similar to Sanji's attack on Bartholomew Kuma."}, {"type": "paragraph", "text": "After the timeskip, Bepo's fighting skills and physical prowess significantly improved. In the anime, he could hold his own against the Artificial Zoan Devil Fruit users of the Beast Pirates for twelve consecutive hours before Nekomamushi forced him to retreat."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d0/Bepo_Attacks_Marines.png/revision/latest/scale-to-width-down/220?cb=20130727090508", "caption": "Bepo attacking a group of Marines."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [{"type": "paragraph", "text": "Bepo was born on Zou. At age eight, Bepo wanted to chase after his older brother, Zepo, and climbed down Zunesha's leg to get a better view of the sea, but he got swept away. He later boarded a ship heading for the North Blue, and a year later, he wandered through Swallow Island. On that island, he was bullied by two boys named Shachi and Penguin, but another boy named Trafalgar Law came and knocked out Shachi and Penguin with his Devil Fruit powers."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}, {"type": "paragraph", "text": "Bepo followed Law back to Wolf's house, and Law became acquainted with him. He decided to let Bepo stay with him and Wolf, who agreed to it. A month later, Bepo and Law saw an explosion in the forest, and they found Shachi and Penguin, who had been severely injured in a boar attack. Law and Bepo brought them to Wolf's house, where Law gave orders to treat them. After Shachi and Penguin recovered, they thanked Law's group and revealed that they had no place to go after being orphaned and abused. Law offered for them to become his subordinates, to which they agreed, and Wolf agreed to let them stay in his house."}, {"type": "paragraph", "text": "Concludes non-canon section."}, {"type": "paragraph", "text": "Bepo, Shachi, and Penguin joined Law to form the Heart Pirates. Bepo studied navigation since he wanted to find the way back to Zou, and became the crew's navigator."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fc/SBS84_Heart.png/revision/latest/scale-to-width-down/180?cb=20170520162944", "caption": "Law protecting Bepo from being bullied by Shachi and Penguin."}]}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "On Sabaody Archipelago, Bepo stood behind Law as they watched X Drake stop the fight between Killer and Urouge. Bepo later sat beside Law in the Human Auctioning House. After the Straw Hat Pirates attacked the World Nobles and their guards, the audience fled except for the Heart and Kid Pirates, who withstood Silvers Rayleigh's burst of Haoshoku Haki. The three pirate captains went outside to fight the Marines, and afterwards, Bepo defended Law from some other Marines. The Heart Pirates then escaped after freeing Jean Bart, a slave of Saint Rosward's. However, their path was blocked by a Pacifista so they joined the Kid Pirates in fighting it. Both crews managed to escape the Pacifista."}], "images": []}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Still on Sabaody, the Heart Pirates watched the broadcast of Battle of Marineford. When the broadcast was cut off, Law told his crew that they were setting sail."}, {"type": "paragraph", "text": "Toward the end of the battle, the Heart Pirates' Polar Tang surfaced outside Marineford. After Kizaru threatened him, Buggy dropped the injured Jinbe and Luffy down to Law. Bepo carried Luffy, noting that the Straw Hat captain was severely wounded, and wondered if the boy was still alive. Once inside the ship, Bepo called for Law to close the door so that they could submerge. Law caught Luffy's straw hat from Buggy, and the Heart Pirates then began treating Luffy and Jinbe. The ship managed to escape Aokiji's Ice Age and Kizaru's Yasakani no Magatama and was pursued by Boa Hancock."}, {"type": "paragraph", "text": "Out in the open sea, the crew encountered the Shichibukai. When Hancock asked the crew about Luffy's condition, Bepo complimented Hancock for being able to track the submarine. Hancock then scolded Bepo for changing the subject and referred to him as \"beast\", which caused the bear to apologize and sink into a depression. Hancock then demanded a Den Den Mushi and Bepo quickly complied."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/35/Heart_Pirates_Arrive_at_Marineford.png/revision/latest/scale-to-width-down/235?cb=20141206070314", "caption": "The Heart Pirates arrive at Marineford."}]}, {"title": "Post-War Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Heart Pirates soon reached Amazon Lily and arrived at the port. While Bepo's crew mates were anxious to see into the isle of women, Bepo asked if there were female bears too and his crew mates snapped back reminding him Amazon Lily is a country of human women, causing Bepo to be depressed again."}, {"type": "paragraph", "text": "After the arrival of Rayleigh, the Heart Pirates left Amazon Lily. Bepo's crew mates were depressed that they did not get a chance to peek into the women kingdom. Bepo stated that it would be better if they were bears, only to be told to shut up."}, {"type": "paragraph", "text": "Once again near Sabaody Archipelago, Law used the sleeping Bepo as a back rest while he discussed with his crew about his decision not to enter the New World yet."}], "images": []}, {"title": "Post-Timeskip", "level": 3, "content": [{"type": "paragraph", "text": "Before arriving at Dressrosa, Law revealed that Bepo and the other Heart Pirates went to Zou. After their arrival, Nekomamushi took them under his care."}, {"type": "paragraph", "text": "During the Beasts Pirates' invasion, the Heart Pirates assisted the Mink Tribe and fought alongside the Guardians. They fought until Jack used one of Caesar Clown's poison gas weapons. After Jack left, Sanji's group arrived and tended to the injured."}], "images": []}, {"title": "Yonko Saga", "level": 3, "content": [], "images": []}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "Right after the arrival of Luffy's group and Law, Bepo tried to stop a fight between Luffy and Roddy. Bepo explained that Luffy is an acquaintance, but Roddy ignored him, saying that Luffy was an intruder. After Wanda and Carrot arrived and stopped the fight, Bepo and the rest of the Heart Pirates got reacquainted with Luffy. At first, Bepo and the crew were confused about who \"Tra-guy\" was until Luffy clarified that it was Law. Bepo and the rest of the crew were excited to hear that Law was on Zou. They then climbed up into the trees to escape the Eruption Rain. As Wanda took Luffy to see his friends, Bepo explained that he could not leave the Whale Forest and asked Luffy to inform Law of his whereabouts."}, {"type": "paragraph", "text": "When Law went off to meet his crew, the Heart Pirates were overjoyed to be reunited with him. After the Straw Hats returned to the Whale Forest, the Heart Pirates greeted Luffy but were then furious when Luffy and Law went on having a private conversation. The Heart Pirates and Luffy's crew (except Franky, Robin, and Brook) then partied with Nekomamushi and his subjects."}, {"type": "paragraph", "text": "Zou was later thrown into chaos when Jack returned and began attacking Zunesha. However, Zunesha retaliated and sank Jack's fleet. As the Sanji Retrieval Team departed from Zou, everyone, except for the Straw Hat members left behind, was shocked when Luffy jumped off Zunesha with his party."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d5/Law_Reunites_With_His_Crew.png/revision/latest/scale-to-width-down/210?cb=20160925124410", "caption": "The Heart Pirates reunite with Law."}]}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "After leaving Zou, the Heart Pirates infiltrated Wano Country. On top of a mountain, Bepo, Shachi, and Penguin spotted Luffy and Roronoa Zoro through binoculars as the two entered Okobore Town. The trio later informed Law about Luffy and Zoro heading to Bakura Town in pursuit of a Gifter who had abducted a little girl."}, {"type": "paragraph", "text": "On the way to Bakura Town, Bepo ate a fish from the polluted river and got sick, delaying Law from reaching the town. Suffering from diarrhea, Bepo hid in the bushes near the ruins of Oden Castle. While Kin'emon told Luffy's group about Wano's past, the Heart Pirates waited outside and witnessed Kaido's arrival over Okobore Town."}, {"type": "paragraph", "text": "After Luffy rushed off with Law following him and Kin'emon and Kiku left to rescue Tsuru, the rest tried to escape as Kaido approached the castle and destroyed it with a blast of heat. Bepo and the other males in the group were saved by the kunoichi Shinobu's jutsu which sunk them into the ground."}, {"type": "paragraph", "text": "Sometime after this ordeal, Bepo worked to deliver Kin'emon's secret message to his allies. Bepo was later captured by the Beasts Pirates to be used as bait for Law. The captured Heart Pirates were incarcerated in the Rasetsu District Prison. Prior to Law's arrival, Bepo was linked to Basil Hawkins before being moved to another location."}, {"type": "paragraph", "text": "Bepo, Shachi, and Penguin were released by Hawkins, who made a deal with Law for their freedom in exchange for his capture. Law ordered them not to tell Luffy about his capture. They later met up with Nami at Ebisu Town. Bepo gave her Kin'emon's secret message now drawn with two lines on the snake as Shimotsuki Yasuie's last message. After Nami left, the Heart Pirates discussed their captain's situation."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Heart Pirates, Kid Pirates, and Straw Hat Pirates vs. Marines", "elements": []}, {"text": "Heart Pirates and Kid Pirates vs. Pacifista", "elements": []}, {"text": "Heart Pirates and Mink Tribe vs. Beasts Pirates", "elements": []}]}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Dance Battle", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "The back of Bepo's head can be seen in the lower left-hand corner of Law's wanted poster, similar to how Usopp can be seen on Luffy's.", "elements": []}, {"text": "He has the second lowest known bounty in the series, following Chopper's.", "elements": []}, {"text": "In the 6th fan poll, Bepo ranked 41st.", "elements": []}, {"text": "He is the first member of the Mink Tribe to be seen in the series. His species, however, was only confirmed 307 chapters after his debut.", "elements": []}, {"text": "He shares the same voice actor with his late brother, Zepo.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/d/d4/Law%27s_Wanted_Poster.png/revision/latest/scale-to-width-down/155?cb=20180803051122", "caption": "Bepo in the background of Law's wanted poster."}]}]}