{"sections": [{"title": "Sabo", "level": 1, "content": [{"type": "paragraph", "text": "Sabo is the Revolutionary Army's chief of staff, recognized as the \"No. 2\" of the entire organization, ranking directly under Monkey D. Dragon himself."}, {"type": "paragraph", "text": "Next to being the sworn brother of Monkey D. Luffy and Portgas D. Ace, he is of noble descent, the son of Outlook III and Didit, as well as via his parents the adoptive brother of Sterry, the current king of the Goa Kingdom, whom Sabo has never recognized as such."}, {"type": "paragraph", "text": "At a very young age, Sabo ran away from his noble parents in the Goa Kingdom to live alone in the kingdom's Gray Terminal, and he met and befriended Ace not long after. Five years later (12 before the present storyline), the two became friends with Luffy as well, and the three came to consider themselves \"brothers\", swearing an oath of brotherhood over sake. They also shared the dream to set out to sea as pirates and achieve freedom, Sabo initially planning to do so at age 17."}, {"type": "paragraph", "text": "However, after having escaped his parents once more not long after they had caught him and taken him away from his adoptive brothers, Sabo had then already set sail on his own, but his boat was destroyed by a Celestial Dragon moments later."}, {"type": "paragraph", "text": "Having been believed to have died during this incident, Sabo had in truth survived due to Dragon saving him, and he thus joined the Revolutionaries. He had lost most of his memories from that point forward but regained them upon learning of Ace's death at Marineford. He currently has a bounty of 602,000,000."}, {"type": "paragraph", "text": "He acts as an ally of Luffy during the Dressrosa Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sabo was a ten year old boy at the time of Luffy's flashback, the same age as Ace at that time. He had round eyes, a missing tooth, and short curly blond hair. He wore a large black top hat with a pair of blue goggles wrapped around it, a blue jacket with the sleeves rolled up, a cravat and a pair of light blue cyan shorts held up by a belt with an elaborate flower-design buckle."}, {"type": "paragraph", "text": "Before he entered into the Gray Terminal, he was seen with a gentle outfit with a white colored short-sleeved shirt and wearing blue colored shorts as usual."}, {"type": "paragraph", "text": "As an adult, Sabo became taller and more muscular. He has matured greatly, with more pronounced facial symmetry and a scar he acquired over his left eye. This scar was inflicted when Saint Jalmack selfishly blew up the fishing boat Sabo used to set out to sea, leaving him with serious burns and critical injuries. He resembles Luffy enough to allow him to easily deceive opponents as perceptive as Diamante into thinking he was \"Lucy\" by simply wearing the same outfit, although Sabo is still taller than his younger brother. His hair has also grown noticeably longer since his youth, which he styled deliberately to cover up his eye scar."}, {"type": "paragraph", "text": "While participating in the final round at the Corrida Colosseum in Luffy's place, he wore Luffy's cape, fake beard, and viking style helmet. In addition, he wore shades to conceal his eyes. He also drew an X-shaped mark on his chest."}, {"type": "paragraph", "text": "Later, after the round, he returned to his original outfit, which resembles his old outfit from twelve years ago: a long black jacket with a buckle on the left sleeve, with a blue shirt and vest, a frilled cravat, and a simple belt holding a pair of loosen light-blue pants with black boots (said boots are shown in greater detail in Pirate Warriors 3, to be wrapped with buckles and with cloth bracings). He also wears a pair of brown gloves and the same top hat with goggles over the band."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Sabo is devoted to his dreams to the point that he agreed with Ace that the two of them had to kill Luffy so that he could not tell anyone about their treasure, though neither Ace nor Sabo knew how to kill a person nor had any experience, implying some degree of innocence despite their profession. He is very ashamed of being a noble, and even stated that he wished that he had not been born as one."}, {"type": "paragraph", "text": "According to Luffy, Sabo is a nicer older brother than Ace. He acknowledged Luffy's powers, and even encouraged his improvement. He helped Ace and Luffy get along when they were fighting, thus being the nice, diplomatic one of the trio."}, {"type": "paragraph", "text": "Sabo's dream involves traveling around the world as a pirate. This is in order to write a book containing the story of everything he would see and every place he would visit during his journey. One of the reasons behind all this could be the \"segregation\" that envelopes so much of the Goa Kingdom, a thing that could easily stir a freedom-loving spirit like Sabo's to ask himself what the world was really like outside the walls of High Town, and outside the island itself. However, he was ready to cast aside his dream for the sake of his loved ones. Sabo was loyal to his friends and, in this case his two \"brothers\", to the point that he would give in to the demands of his father, becoming miserable and \"alone\" in order to save both Luffy and Ace. After reawakening his memories, Sabo did not leave the Revolutionary Army to resume his dream as a free-sailing pirate, as he seems to remain convicted to the Army's causes."}, {"type": "paragraph", "text": "Despite being the son of a noble, Sabo does not act like a stereotypical noble would act, nor does he consider himself to be a noble. He does not look down on the less fortunate nor does he put on airs about his status. This is in stark contrast to the rest of the citizens of noble birth in Goa Kingdom including his family, who see their status as more important than anything else and will do whatever it takes to raise their social standing or maintain their current status, as well as look down on anyone they consider to be inferior. Sabo rejects these values completely, and even went as far as to say that he feels ashamed of his status as a noble. This can be seen as the reason why he ran away from home and went to live in the Gray Terminal, forfeiting his noble heritage. Since a child becomes a full-fledged noble at the age of eighteen, Sabo intended to leave the Goa Kingdom at the age of seventeen, to escape the idea of being recognized as the thing he hated the most. He even refers to the nobles as \"smelling worse than Trash Mountain, as they are people rotten to the core\"."}, {"type": "paragraph", "text": "At age 22, Sabo has retained much of his old personality, although he appears to have adapted many mannerisms from Luffy, including his brother's tendency to mispronounce the names of others. Moreover, his tendency to hang up the Den Den Mushi in the middle of a call rather annoys his comrades. He has also displayed an immensely fierce protective streak towards Luffy, to the point where he will disregard everything he is currently doing if he feels that Luffy is in any sort of danger, including his duties in the Revolutionary Army. This is largely contributed by Sabo's inability to save Ace from death before the timeskip, a fact that Sabo still regrets to this very day. This is ironic considering that Ace himself had gained a very similar protective-streak after Sabo's presumed death."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Family", "level": 3, "content": [], "images": []}, {"title": "Outlook III", "level": 4, "content": [{"type": "paragraph", "text": "Outlook III, Sabo's father is a stereotypical noble, treating Ace and Luffy as trash, and panicking about being contaminated when Bluejam got their blood onto him during a beating, claiming that he needed to be decontaminated. He also desired for his son to become his heir, believing that a child must adhere to the parents' wishes, and threatened to kill Ace and Luffy if Sabo did not comply. He ordered Sabo to marry a princess when he grew up, which is one of the reasons he ran away. In essence, Sabo had no right to freedom of choice in his father's eyes. What is worse, Outlook had no confidence in him, despite wanting him to return, going as far as to adopt a stepson of higher status in order to have a backup heir."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2d/Outlook_III_calls_out_to_Sabo.png/revision/latest/scale-to-width-down/210?cb=20151026031536", "caption": "Outlook III, Sabo's father."}]}, {"title": "Didit", "level": 4, "content": [{"type": "paragraph", "text": "Didit is Sabo's biological mother. She has the stereotypical personality of a Noble, and only seeks to further her family's status. This was clearly seen when her son got into a fight with a noble boy of a higher status who used a weapon on him, she apologized to the family while comforting the other boy, completely ignoring her own son's injuries. She also acted in a rather insensitive manner when Sabo was dragged back from his runaway, giving her son a somewhat rude welcome back."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fa/Sabo%27s_Mother.png/revision/latest/scale-to-width-down/120?cb=20141206214425", "caption": "Sabo's mother (left), along with Sterry (right)."}]}, {"title": "Sterry", "level": 4, "content": [{"type": "paragraph", "text": "While Sabo cared greatly for Luffy and Ace, he absolutely did not care for his adopted brother, Sterry, who came from a higher nobility than Sabo's family and is arrogant and cowardly. Sterry is, in short, a complete opposite to Sabo. To this end, Sabo was willing to assault Sterry in order to learn about the plan to burn down the Gray Terminal."}, {"type": "paragraph", "text": "Twelve years later, Sabo posed as a guard at the Levely and reunited with his adopted brother while the latter was unaware of his identity. Sabo was silently amused by Sterry's fear of the outside world and assured him to maintain his cover."}], "images": []}, {"title": "Sworn Brothers", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Luffy", "level": 4, "content": [{"type": "paragraph", "text": "At first, Sabo worried that Luffy would reveal the secret stash that he and Ace had hidden, they suggested that they would kill him. However, after seeing Luffy resist Porchemy and refusing to tell the secret, they inducted him into the group and treated him like a brother. Luffy also thought of Sabo as a kinder elder brother than Ace. Prior to his departure from Goa, Sabo sent a letter to Ace, telling him to take care of Luffy as their younger brother."}, {"type": "paragraph", "text": "Although he had amnesia for ten years and forgot Luffy and Ace, Sabo regained his memories after Ace’s death. Sabo resolved to protect his remaining brother at all costs."}, {"type": "paragraph", "text": "After twelve years of separation, when Sabo meets Luffy, the latter does not recognize him at first even challenging him after he stated he won't let him have Ace's power. However, when Sabo reveals his identity and mentions the day they became brothers, this greatly shocked and surprised Luffy. After he realized that Sabo was still alive, he starts crying out of joy, thinking that he had died a decade ago. Luffy quickly embraced Sabo, happy that his remaining brother was alive and well, while Sabo thanked Luffy for surviving the Battle of Marineford. He also let Sabo take up his disguise as Lucy to enter the finale in the Corrida Colosseum, allowing Sabo to take claim of the Mera Mera no Mi after Luffy gave him permission. Sabo later told Rebecca and Bartolomeo that Luffy will be the future Pirate King showing that he, like his deceased brother Ace, supports Luffy's dream."}, {"type": "paragraph", "text": "It is shown that Sabo has gained an overprotective attitude towards Luffy as he held off Admiral Fujitora and told him that should Luffy ever need help, he would be there for him, having refused to ever lose another loved one ever again. He also came to Luffy's aid when Jesus Burgess attempted to kill Luffy firmly telling the Blackbeard pirate that Luffy is his brother and he has to go through him to get to Luffy. In return, Luffy was very happy to see his brother again and was pleased to see that Sabo had inherited Ace's power."}, {"type": "paragraph", "text": "Upon his departure from Dressrosa, Sabo visited Luffy again and gave the Straw Hats Luffy's Vivre Card, of which he took a piece, and entrusted Luffy's well-being into their care similar to what Ace had done. After Dressrosa, Sabo happily updated Dragon on Luffy’s progress. Later, Sabo was very proud to see Luffy's new bounty poster."}, {"type": "paragraph", "text": "After he read the newspaper detailing the Straw Hats' activities in Totto Land, Sabo was so proud of his brother's achievements that he fell to ground in joy."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/Luffy_reunites_with_Sabo.png/revision/latest/scale-to-width-down/210?cb=20150823151710", "caption": "After twelve years of assumed death, Luffy tearfully embraces Sabo upon their reunion in Dressrosa."}]}, {"title": "Portgas D. Ace", "level": 4, "content": [{"type": "paragraph", "text": "Ace, being a fellow child who wants to be a pirate, was a good friend of Sabo's. In fact, they were like brothers, and Sabo was willing to forsake his dreams to save Ace and Luffy from his father's wrath."}, {"type": "paragraph", "text": "Although Sabo had amnesia for half of his current life and forgot about Ace and Luffy, after reading about Ace's death in a newspaper article, Sabo regained his memories of Ace and the rest of the memories he had lost. This event, combined with the fact that he discovered that Ace had died all at the same time, put him into a coma for three days. Two years after Ace's death, Sabo deeply regrets that he was not there to try and save his brother's life, and not a day went by where he did not agonize over what Ace's final thoughts might have been. He visited Ace's grave and left three cups of sake next to Ace's gravestone in the memory of their brotherhood, and pinned a newspaper article to the gravestone to indicate that Luffy is doing fine. Despite his regret, Sabo still remains determined to inherit Ace's power by obtaining the Mera Mera no Mi. He later looked to his late brother to watch over him as he entered the arena. Sabo obtained and ate the Mera Mera no Mi, and the first attack he used with his new abilities was Ace's signature move, Hiken. Despite Sabo's grief, he took it upon himself to protect his remaining brother Luffy in Ace's stead, and vowed to never live with any regrets ever again - as he believed Ace would never have forgiven him for it. Like Luffy, Sabo does not take too kindly to people insulting Ace as shown when Burgess insulted and mock his deceased brother, with Sabo unleashing a brutal fire attack on him despite him never intending to kill 'the Champion' in the first place."}], "images": []}, {"title": "Revolutionaries", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Dragon", "level": 4, "content": [{"type": "paragraph", "text": "In the past, Dragon spared his time to listen to Sabo's story. He was openly affected by Sabo's morality and sympathized with the noble child for his refusal of his heritage."}, {"type": "paragraph", "text": "He later rescued Sabo, who had his boat blown up by a World Noble named Jalmack, and brought him to the revolutionaries to treat his wounds. Because Sabo lost his memories of Luffy and Ace after this incident, Dragon was not aware that Sabo was a sworn brother to his son. He permitted him to join the Revolutionary Army after the boy begged them not to send him back to his parents. After Sabo joined the revolutionaries, Dragon personally trained him, enabling him to rise through the ranks until he became the Revolutionary Army's chief of staff. Because of Sabo regaining his memories during the aftermath of the Marineford War and the revelation of Luffy's heritage, it can be presumed Dragon was made aware of the relationship between Sabo and his son while Sabo learned of Dragon's relation to Luffy."}, {"type": "paragraph", "text": "Sabo refers to Dragon as \"Dragon-san\" and is loyal to him and is trusted enough to lead the Revolutionary Army's investigation of the Doflamingo Family's weapons trade. Even after regaining his memories, Sabo did not leave the revolutionaries to resume his dream of being a free-sailing pirate, showing a firm conviction to Dragon's cause."}, {"type": "paragraph", "text": "After Doflamingo's defeat, Sabo personally told Dragon how Luffy was doing when giving his report."}], "images": []}, {"title": "Koala", "level": 4, "content": [{"type": "paragraph", "text": "Sabo is on friendly terms with his colleague Koala, having worked with her since they were both young teenagers. As a result, she became very upset and cried over the thought of Sabo leaving the revolutionaries after regaining his memories, and knows about his history with Luffy and Ace and his regret about not being able to be at the Battle of Marineford. Koala is happy for him when he finally reunites with his remaining brother, and also attempted to comfort him over any lingering feelings of regret he may feel over his inability to protect Ace - showing some closeness between the two. She also attends his battle at the Corrida Colosseum. However, she is constantly frustrated with his selfish attitude in regards to disobeying orders as seen when she berates him for potentially drawing the ire of the Marines by fighting one of their Admirals."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e8/Koala_Gets_Angry.png/revision/latest/scale-to-width-down/180?cb=20150628180341", "caption": "Koala scolds Sabo for disregarding his duties to fight Fujitora."}]}, {"title": "Hack", "level": 4, "content": [{"type": "paragraph", "text": "Sabo also works closely with Hack in the Revolutionary Army. However, he along with Koala, are occasionally at odds with Sabo over his tendency to leave his post during missions. After being rescued by Dragon, Hack briefly trained amnesiac Sabo in martial arts. However due to Sabo already being a skilled fighter due to his training alongside Ace and Luffy, there was little Hack could teach him, so Dragon took over Sabo's training personally."}], "images": []}, {"title": "Revolutionary Army Commanders", "level": 4, "content": [{"type": "paragraph", "text": "Sabo seems to have a casual relationship with the commanders despite being their senior officer. When Lindbergh informed Sabo that he and the other commanders would be late for Dragon's mobilization conference, Sabo was not worried and was only concerned they are safe."}], "images": []}, {"title": "Bartholomew Kuma", "level": 4, "content": [{"type": "paragraph", "text": "Sabo appears to be close to Kuma as he referred to him as gentle. He was enraged at the news of Kuma’s enslavement and torture by the Celestial Dragons. Sabo insists on amending the Revolutionary Army's mission of infiltrating the Levely to rescue Kuma despite the risks."}], "images": []}, {"title": "Friends", "level": 3, "content": [], "images": []}, {"title": "Curly Dadan", "level": 4, "content": [{"type": "paragraph", "text": "When Sabo was introduced to Dadan at first, she seemed annoyed of him. She even said that she had heard bad things about him. Sabo responded by saying that he had also heard bad things about her too. However, she was content with Sabo living with Ace and Luffy. Dadan was also stricken by Sabo's presumed death."}], "images": []}, {"title": "Bartolomeo", "level": 4, "content": [{"type": "paragraph", "text": "Initially, Bartolomeo was hostile towards Sabo when the latter told Luffy he would not allow him to have the Mera Mera no Mi only to be pushed aside. When Sabo revealed himself as a brother to Luffy, Bartolomeo started to treat Sabo with great respect, referring to him as 'great senpai'. Though Sabo respects Bartolomeo enough because of him aiding them, he found Bartolomeo's obsession with the Straw Hats to be irritating."}, {"type": "paragraph", "text": "Even after Doflamingo put a price on Sabo's head during his survival game, Bartolomeo did not betray the revolutionary and continued to assist him."}], "images": []}, {"title": "Rebecca", "level": 4, "content": [{"type": "paragraph", "text": "Sabo seemed to sympathize with Rebecca and her family after seeing Doflamingo's actions on Dressrosa. However, he wouldn't allow her to have the fruit of his late brother while she noticed he wasn't the same \"Lucy\" that she met."}, {"type": "paragraph", "text": "However, Sabo ordered Bartolomeo to protect Rebecca from Diamante in the final match and saved her after he destroyed the arena. Sabo later introduced himself and revealed his connection to the Lucy from before, as she was surprised by these facts."}], "images": []}, {"title": "Nico Robin", "level": 4, "content": [{"type": "paragraph", "text": "Sabo appears to have developed a very friendly relationship with Nico Robin, who was rescued by the revolutionaries just prior to the timeskip. He and Robin exchanged warm greetings with each other upon reuniting in Dressrosa."}], "images": []}, {"title": "Straw Hat Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Following Doflamingo's defeat, Sabo met some of the Straw Hats and they were shocked to learn that Luffy had another brother before listening to Sabo's story of losing his memories. Before his departure, Sabo entrusted Luffy's care into the crew's hands to which they accepted with Zoro even remarking that Sabo's words were similar to what Ace said. Though a portion of the crew had not met him yet due to being forced to depart for Zou, it was later established that they (with the exception of Sanji) are aware of his existence and his connection to Luffy."}], "images": []}, {"title": "Enemies", "level": 3, "content": [], "images": []}, {"title": "Marines", "level": 4, "content": [{"type": "paragraph", "text": "Due to Sabo being a part of the Revolutionaries, he is an enemy of the Marines, but more specifically, the World Government. As such he stopped Admiral Fujitora and his forces from advancing after Luffy. A majority of them were surprised to learn that Sabo, Ace, and Luffy were brothers before they watched Sabo clashing with Issho."}, {"type": "paragraph", "text": "Despite this enmity, Sabo wished Issho good luck with his dangerous gamble to leave Doflamingo's defeat in the hands of pirates. However, they later have another confrontation at the Levely when Sabo and his comrades attempt to rescue Bartholomew Kuma from his enslavement by the World Nobles."}, {"type": "paragraph", "text": "After the chaos in Big Mom's territory, the Marines became aware of Sabo's connection to Luffy."}], "images": []}, {"title": "Nobles", "level": 4, "content": [{"type": "paragraph", "text": "Having personally witnessed the cruelty of the nobles from his home in the Goa kingdom, Sabo bears deep hatred towards them. Having learned of their attempt to kill all the people in the Gray Terminal, Sabo was the only person in the whole kingdom to try to save the people living there and was shocked and disgusted to see that the nobles in the kingdom knew what was happening but did nothing to help. He himself even told Dragon how he was ashamed of ever been born as a noble. Sabo left his home to make sure he never become like them."}], "images": []}, {"title": "World Nobles", "level": 4, "content": [{"type": "paragraph", "text": "His loathing of nobles seems to extend to the World Nobles as well, as during his departure twelve years ago, Saint Jalmack tried to kill Sabo solely because he crossed paths with his ship."}, {"type": "paragraph", "text": "Sabo fully supported Dragon's intent to declare war on the World Nobles during the Levely, showing that he is not afraid to openly oppose them despite their privilege of summoning a Marine admiral for protection."}], "images": []}, {"title": "Jesus Burgess", "level": 4, "content": [{"type": "paragraph", "text": "As Jesus Burgess is a member of the Blackbeard Pirates, who turned Ace over to the World Government, Sabo holds him accountable for his death and the Marineford War 2 years ago. Despite this, he claims that he would not bear a personal grudge against him or his crew for this, but made it perfectly clear that he will protect Luffy to the end when Burgess attempted to kill him and take his power. Burgess in turn desired to kill Sabo and obtain the Mera Mera no Mi. However, he fails to kill him and is horribly injured by Sabo's Fire Fist, though he manages to survive and stowaway on board a ship that takes him to the Revolutionary Army's base at Baltigo, informing Laffitte and Shiryu he had discovered the Revolutionary Army's base. As a result, the Blackbeard Pirates later attacked Baltigo, presumably in retaliation for Sabo's actions and his possession of the Mera Mera no Mi."}], "images": []}, {"title": "Donquixote Pirates", "level": 4, "content": [{"type": "paragraph", "text": "Sabo despised their rule on Dressrosa as he viewed it as similar to the injustice in his hometown. Sabo also sought to obtain the Mera Mera no Mi from them and took up Luffy's disguise as Lucy to do so and fought against Diamante for the fruit. Sabo infuriated the crew by actually consuming the fruit that they did not plan to give away. In response to his actions and other things, Doflamingo included Sabo in his list of \"criminals\" that he wanted the citizens to hunt down during his Birdcage game. Sabo was shocked to see he was included in this list."}], "images": []}, {"title": "Other", "level": 3, "content": [], "images": []}, {"title": "Monkey D. Garp", "level": 4, "content": [{"type": "paragraph", "text": "It is unknown how Garp and Sabo thought of each other, but Garp was once shown \"training\" him like Ace and Luffy. Sabo also mentioned to the Straw Hats that Garp kept him, Luffy, and Ace on a short leash and said so in a fond way, suggesting he did not mind Garp."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As the Chief of Staff of the Revolutionary Army, Sabo has command over all lower ranking members and answers only to the leader himself. His bounty of 602,000,000 proves that the World Government views him as an extremely dangerous threat. According to Ace, who initally planned for Sabo to become his navigator, Sabo also has some experience in navigation."}], "images": []}, {"title": "Physical Abilities", "level": 3, "content": [{"type": "paragraph", "text": "Even as a child, Sabo already exhibited very high levels of physical capabilities from the very intense training he endured in the harsh environment of Mt. Colubo. He and Ace together were able to topple Porchemy when the two of them arrived to save Luffy. Sabo was able to beat Luffy in sparring matches fifty times in one day, as well as defeat Ace twenty four times and lose twenty six times."}, {"type": "paragraph", "text": "Sabo was fast enough to grab a knife from a pirate without the pirate being able to stop Sabo. He was good at thieving as well, since he and Ace were able to rob numerous people to get their money and valuables. He also was exceptionally skilled in stealth and could jump out of a window several stories up without injuring himself."}, {"type": "paragraph", "text": "After joining the Revolutionary Army, Sabo was personally trained by Hack and Monkey D. Dragon and attained tremendous physical prowess by adulthood. Sabo is shown to have extraordinary agility as he easily dodged an attack from a Fighting Fish, as well as tremendous physical strength, clashing with Jesus Burgess, a pirate known for his titanic strength and a captain of the Blackbeard Pirates first ship, who is also a personal bodyguard to the Yonko Blackbeard, with little effort. He later destroys the entire arena of the Corrida Colosseum, which was tough enough to resist all the previous battles between the New World gladiators with Haki enhanced physical strikes. A simple grip allowed him to crush Vice Admiral Bastille's skull and helmet."}, {"type": "paragraph", "text": "Sabo also has tremendous skills in hand-to-hand combat, which were honed since childhood from sparring matches with Ace and Luffy. As a child, Sabo was already skilled enough to completely overwhelm Luffy, a Devil Fruit user, and fight on equal footing with Ace. Even after losing his memories from amnesia, Sabo still retained his fighting skills as shown in the anime. Out of all the children Revolutionaries who were soldiers-in-training, Sabo alone excelled in the rigorous combat training regimen of the Revolutionary Army, being capable of keeping up with Hack, a powerful expert in Fish-Man Karate and eventually defeat Hack while still a child. In addition to basic hand-to-hand combat skills, Sabo also gained mastery of the Ryusoken martial arts. By adulthood, Sabo could knock away Burgess, an enormous man with a single kick when Burgess attempted to kill an exhausted Luffy to steal the Gomu Gomu no Mi. He could fight on equal level with Fujitora, a Marine Admiral and an immensely powerful swordsman, and emerged with only a few bruises (though Sabo suspected that he was holding back). Later, Sabo single-handedly defeat Burgess, an immensely powerful wrestler who is one of the most powerful members of the Blackbeard Pirates with only minimal effort."}], "images": []}, {"title": "Ryusoken", "level": 3, "content": [{"type": "paragraph", "text": "In his adulthood, Sabo has become a master of the Ryusoken fighting style, which revolves around the use of grips, which he refers to as \"claws\". His grips are strong enough to break armor, great swords, artillery, and even skulls with ease and remaining unharmed. He claims that his fingers are like the claws of a dragon. He also uses Haki to increase the strength of his fingers. In contrast to Luffy, who readily chooses to target his adversary, Sabo seems to prefer destroying his opponent's weapon first before going head to head against them. This difference in battle approach was what allowed Diamante to notice that Lucy was not actually Luffy when Sabo came to fight in Luffy's place in the coliseum."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1e/Sabo_crushes_Bastille%27s_helmet.png/revision/latest/scale-to-width-down/210?cb=20150405233132", "caption": "Sabo showcases the immense destructive power of his \"claws\" by crushing Bastille's metal mask."}]}, {"title": "Devil Fruit", "level": 3, "content": [{"type": "paragraph", "text": "Sabo is the current user of the Mera Mera no Mi, a Logia-type Devil Fruit which originally belonged to his brother Ace before his death. With it, Sabo is able to become the element of fire and control the flames from his body at will."}, {"type": "paragraph", "text": "After eating the fruit, Sabo was instantly able to utilize it to the point of using Ace's signature technique, the \"Hiken\", which was strong enough to shatter the bottom floor of the Corrida Colosseum, exposing the underground facility. He did later show difficulty of controlling his fruit however, which is typically displayed by new Devil Fruit users. While facing against Issho's Marine platoon, Sabo has been shown imbuing his weapon with fire, showcasing that he quickly attained control of his Devil Fruit power. He also mentions that he still has not grown fully accustomed to his new ability just yet, since he still has a habit of dodging attacks, despite now being a Logia-user."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1f/Sabo_Using_The_Mera_Mera_no_Mi.png/revision/latest/scale-to-width-down/210?cb=20160403060754", "caption": "Sabo utilizing the Mera Mera no Mi powers."}]}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Sabo has shown incredible mastery of Busoshoku Haki, which he can imbue into his arm or his pipe. His Busoshoku Haki is strong enough to shatter Burgess's Haki infused right arm armor, as well as Diamante's sword. His mastery of Busoushoku Haki is superior to Bastille's, as shown when the Vice Admiral attempted to cut him down with Haki enhanced sword strikes; not only did Sabo manage to block his Same-kiri Bocho, he even managed to destroy the entire blade with relative ease. "}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Sabo possesses the ability to use Kenbunshoku Haki. He is highly skilled in the use of Kenbunshoku Haki, as shown in the anime where he dodged multiple bullets that are fired at him."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "As a child, Sabo's preferred method of combat was stick fighting using metal pipes (as well as having slight traces of bo-staff styles). After the timeskip he continues to use a similar metal pipe, effectively battling against and defending himself from attacks by opponents as strong as Diamante, a top executive of the Donquixote Pirates, and Burgess, the captain of the Blackbeard Pirates first ship. When used in conjunction with Busoshoku Haki, Sabo was able to easily break Diamante's weapon. After obtaining the Mera Mera no Mi, Sabo can ignite the two ends of his pipe."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Past", "level": 3, "content": [], "images": []}, {"title": "Bound as Brothers", "level": 4, "content": [{"type": "paragraph", "text": "Sabo was born in Goa Kingdom to noble parents who aspired for him to marry a royal princess to keep their family name secure, but did not seem to care for Sabo as an individual. His father Outlook III, tired from work, was shown tearing apart a picture Sabo drew and ordering him to go to his room and study. One day, he got hurt in a fight with a boy from the royal family who used a knife, but Sabo's mother immediately began fretting over and apologizing in tears to the royal boy and his mother, being more concerned with repairing relations with the family and maintaining their status rather than tending her own son's injuries. Realizing he was nothing more than a way for his parents to secure wealth and status, Sabo fled to the Gray Terminal, leaving his parents to think he was dead. He would later meet Ace, and the two bonded over a shared dream to become pirates. They robbed people around Gray Terminal in order to collect treasure for their future pirating careers."}, {"type": "paragraph", "text": "During their get-togethers, Ace told Sabo about a boy named Luffy who had been following him unsuccessfully. Sabo recommended for Ace to live with him in Gray Terminal to avoid Luffy, but Ace had declined, and one day as they were counting money, Luffy reached Gray Terminal and overheard the boys talking about becoming pirates. They decided to kill him to keep their secret safe, but were unable to, and freed him once they heard pirates coming. A group of Bluejam Pirates, led by Porchemy, was searching for Ace to get back the money he had stolen from them, and they spotted and captured Luffy. Worried that the pirates would find their treasure, Sabo and Ace watched in shock as Porchemy carried Luffy away to interrogate him for Ace's location. Sabo and Ace worked until evening to move their treasure somewhere else, and Sabo went to check on Luffy. He saw that Luffy had not told Porchemy anything yet and told Ace, and the duo broke into the pirates' hideout. Porchemy grabbed Ace, but Sabo hit the pirate with his staff before stealing another pirate's knife to cut Luffy free. Ace stayed behind to confront Porchemy, so Sabo joined him, and together the two defeated the pirate."}, {"type": "paragraph", "text": "Afterwards, after Ace talked to Luffy about his actions, Sabo told them that they would become infamous among the pirates in Gray Terminal, so he went to stay with Ace's and Luffy's guardian Curly Dadan. The three of them adventured throughout the island, fighting with animals, hoodlums, pirates, and each other as their reputation grew to reach the center of the kingdom. One day, they snuck into the Goa Kingdom, ate at a restaurant, and broke out without paying. While they were running, Sabo's father noticed him and called out to him to come back, but Sabo tried to ignore him. He told Luffy and Ace that his father's call must have been a mistake, but they did not believe him and he confessed his past once they returned to Gray Terminal. Sabo proclaimed that he wanted to sail the world and write a book about everything he found, and Ace and Luffy proclaimed their dreams as well. While they were discussing their future pirating lives, Ace poured them cups of sake, which they exchanged to become sworn brothers. The three brothers continued their lives of adventure for the next few months, and at one point moved out of Dadan's hideout to live in a treehouse."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/8/8b/Sabo_Counting_Ace%27s_Stolen_Loot.png/revision/latest/scale-to-width-down/210?cb=20141206164237", "caption": "Sabo counting Ace's stolen loot."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/93/Ace%2C_Sabo%2C_and_Luffy_Sworn_Brothers.png/revision/latest/scale-to-width-down/210?cb=20141206164121", "caption": "Sabo, Luffy, and Ace become sworn brothers."}]}, {"title": "Running from a Disgusting City", "level": 4, "content": [{"type": "paragraph", "text": "One day, Sabo was apprehended by his father and the Bluejam Pirates. Outlook III gave Bluejam permission to do what they wanted with Ace and Luffy, but Sabo agreed to return to his old life without a fuss if his brothers were spared, and he was taken back to Goa's Elite District. At a checkpoint, Sabo was coerced into claiming that Ace and Luffy implicated him in their crimes in order to maintain his family's status. He refused, forcing his father to bribe the official. He then returned to his old house, where he reunited with his mother and met his adopted brother Sterry for the first time. After being bathed, he was introduced to Sterry, who revealed to him that the nobles had arranged for Gray Terminal to be burned down the next night. Sabo became enraged as he realized that the \"trash\" the nobles wanted burned included the people on Gray Terminal, and he jumped out of the window. After sneaking up to a building, he confirmed what Sterry said as he heard about the detailed plans to burn down Gray Terminal."}, {"type": "paragraph", "text": "The next morning, Sabo met with his private tutor, but was distracted by the realization that everyone else was carrying on as normal despite the planned genocide. He escaped from his house again, and talked to two men on the street who, to his shock, knew perfectly well what was going to happen. He was then spotted by some police officers looking for him, forcing him to run away. As night fell, Sabo came to the gate leading to Gray Terminal. With the area already set ablaze, Sabo tried shouting to Ace and Luffy across the wall for them to get to safety, causing him to be spotted by some guards who were evacuating the city near the Terminal. He ended up falling onto the road, in front of Monkey D. Dragon. Sabo told Dragon that the nobles' hearts were more rotten than the trash on Gray Terminal and said that he was ashamed to have been born as one, and Dragon took his words to heart."}, {"type": "paragraph", "text": "Sabo decided to leave Goa and its stench, and wrote a letter to Ace and Luffy explaining his actions and hoping to meet again as pirates. The next morning, he went and set sail on a stolen fishing boat, intending to never return. He immediately encountered the massive ship of the World Noble Saint Jalmack, who was coming to Goa. He sailed out of its way, but Jalmack was offended that he had crossed his path and so shot his vessel with a bazooka. Sabo desperately tried fanning the flames of the explosion caused by the first shot, but was caught in the second shot as it destroyed the ship entirely."}, {"type": "paragraph", "text": "Heavily injured by the explosion and on the verge of drowning, Sabo was rescued from the wreckage by Dragon. Dragon carried the unconscious boy to the Revolutionary Army's ship at Shimotsuki Village during the night, where his injuries were immediately treated by the crew."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/04/Sabo%27s_Explosion_Wreckage.png/revision/latest/scale-to-width-down/210?cb=20141206163948", "caption": "Sabo's signature hat floating beside the flaming wreck of his boat."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/48/Dragon_Saves_Sabo.png/revision/latest/scale-to-width-down/210?cb=20161221122501", "caption": "Dragon saves Sabo."}]}, {"title": "Joining the Revolutionary Army", "level": 4, "content": [{"type": "paragraph", "text": "When he woke up, he was diagnosed with amnesia as he could not even remember his own name. Dragon mentioned that Sabo was the son of a noble and thus a member of the Army suggested returning him to his family. Sabo immediately refused, still having the feeling that he must not return to his parents no matter what. Although he survived, everybody who knew him (including Ace and Luffy) believed he was dead."}, {"type": "paragraph", "text": "Sabo remained with the Revolutionaries from that point on, where he eventually became committed to their ideologies. Sabo was trained along with many other orphans by the fish-man Hack, but was already so strong that Hack had nothing to teach him. At age thirteen, Sabo trained under Dragon. One year later, Koala joined the Revolutionary Army and she, Sabo, and Hack went on missions together. Eventually, in time, Sabo rose to ranks and became the Chief of Staff - the No. 2 of the entire organization."}, {"type": "paragraph", "text": "Because he forgot who Ace and Luffy were, Sabo did not participate in the Battle of Marineford to attempt to save Ace's life. However, after discovering the news that Ace was killed in the war from a newspaper article, Sabo's memories of Ace quickly returned to him after seeing his photo, which in turn brought back the rest of his lost memories. Finally remembering their brotherhood, Sabo became grief-stricken from the loss of his brother and his powerlessness to save him. This grief and the shock of his memories returning caused Sabo to come down with a high fever and was unconscious for three days."}, {"type": "paragraph", "text": "However, all was not lost - as Sabo would eventually discover that Luffy had survived the battle. At that point, Sabo resolved to protect his remaining brother at all costs, and that he would come to Luffy's aid wherever and whenever he needed him, and that would not feel the grief of losing a brother ever again, having refused to live life with any more regrets - something he believed Ace would have never forgiven him for. Since Ace died, not a day went by where Sabo did not agonize over what his final thoughts were."}, {"type": "paragraph", "text": "Afterwards, some time before his arrival in Dressrosa, Sabo visited Ace's grave and left a bottle of sake with three cups on a small crate as a tribute to the day they became brothers, as well as pinning a newspaper article about the Straw Hats' return to the gravestone."}, {"type": "paragraph", "text": "Sabo eventually requested permission for him to obtain the Mera Mera no Mi, as he wished to eat it in order to inherit Ace's power."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/45/Sabo_learns_about_Ace%27s_death.png/revision/latest/scale-to-width-down/210?cb=20161221123817", "caption": "After learning that Ace was killed, Sabo's memories return to him as he cries out in anguish."}]}, {"title": "Episode of Sabo", "level": 3, "content": [{"type": "paragraph", "text": "Finally arriving at Ace and Whitebeard's gravesite, Sabo pinned a newspaper article about the Straw Hats to Ace's tomb stone and told his late brother that Luffy was well on his way to becoming King of the Pirates. After recalling his childhood with Ace and Luffy, Sabo tearfully broke down and apologized for not being able to save him. Sabo then drank from one of the three cups of sake he left in front of the grave and told Ace that he would inherit his power."}, {"type": "paragraph", "text": "Later on, Sabo arrived in Dressrosa incognito, ordering a plentiful amount of food from the restaurant as Koala (who was sitting directly behind him, facing the opposite side) informed him on the situation in Dressrosa. After finishing eating, Koala told him that the only places they have not looked for the underground weapons' trade was the Royal Palace and Corrida Colosseum. Deciding to check the Colosseum first, Sabo disguised himself in a large brown cloak and went to sign up for the tournament. To Sabo's shock - Doflamingo revealed to the city that the prize for the tournament was the Mera Mera no Mi, the Devil Fruit of his late brother Ace."}, {"type": "paragraph", "text": "After meeting up with Hack momentarily, Sabo observed the mistreatment of a toy slave being beaten and abused by its overseer, causing Sabo to declare to himself that he would expose the darkness of Dressrosa. As Sabo observed the fighting, he immediately recognized the fighter \"Lucy\" as Luffy, as his thoughts drifted to his childhood."}, {"type": "paragraph", "text": "Deciding that he would need to win the Mera Mera no Mi himself - as Hack had lost early into the competition, Sabo finally decided to reveal himself to Luffy, telling his brother that he would not let him eat the Mera Mera no Mi. As an angered Luffy challenged him to a fight, Sabo reminded Luffy that he had another brother besides Ace. As Luffy continuously told Sabo that his \"other brother\" was dead, he quickly realized that the man standing before him was Sabo - who happily noted how long it had been since they last met. Luffy later gave Sabo his \"Lucy\" disguise to allow him to fight for the fruit. As Sabo entered the waiting room, he was confronted by Rebecca - who noticed that he was not the same Lucy as before. Sabo told Rebecca that even though things would get rough, he would not do wrong by her - and noted the similarities between Dressrosa and his childhood country. After entering the arena to engage in the final round, Sabo clashed with Jesus Burgess using his Dragon Claw."}, {"type": "paragraph", "text": "After all the toys in Dressrosa turned back to normal, Sabo took advantage of the chaos to destroy the arena and claim the Mera Mera no Mi while everyone else was struggling in the whirlpool he created. After eating the fruit, Sabo saved a falling Rebecca and told her of his identity. Declaring to Ace that they would continue to seek freedom together - Sabo activated his fruit's powers and used \"Hiken\" to blow a hole in the floor of the stadium."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/34/Sabo_talks_to_Ace%27s_Gravestone.png/revision/latest/scale-to-width-down/210?cb=20150904225149", "caption": "Sabo promises to inherit Ace's power."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/0/09/Sabo_reveals_himself_to_Luffy.png/revision/latest/scale-to-width-down/210?cb=20150904225842", "caption": "Sabo reveals himself to Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/2c/Sabo_uses_Hiken_Episode_of_Sabo.png/revision/latest/scale-to-width-down/210?cb=20150904230023", "caption": "Sabo uses \"Hiken\" to blow a hole in the floor of the colosseum."}]}, {"title": "Dressrosa Saga", "level": 3, "content": [], "images": []}, {"title": "Dressrosa Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sabo, Koala, and Hack arrived at Dressrosa in order to put a stop to a weapons trade that the Donquixote Family managed."}, {"type": "paragraph", "text": "During the Block D fight, he somehow managed to get inside the Corrida Colosseum. He interrupted Bartolomeo and Luffy's conversation and stated that the Mera Mera no Mi could not be given to Luffy. Bartolomeo responded with anger, explaining that Sabo had no right to speak to the brother of \"Fire-Fist Ace\" and the future Pirate King in such a manner. Sabo responded that he knew these things about Luffy already. After pushing Bartolomeo aside, Sabo revealed himself to Luffy."}, {"type": "paragraph", "text": "After questioning Sabo on who he was, and how he came to the conclusion that he was Luffy - given the disguise he was wearing, Sabo informed Luffy that he could never forget his little brother's face. Upon realizing his identity, Luffy began to cry and screamed out in surprise, clinging to Sabo with joy. Sabo expressed his relief that Luffy was alive and asked for Luffy's permission to eat the Mera Mera no Mi, which Luffy gladly granted."}, {"type": "paragraph", "text": "After Luffy escaped the colosseum, Sabo talked to Koala via Den Den Mushi, telling her of his meeting with Luffy. Koala told him that even if he had been at the Battle of Marineford, he could not have changed anything. It was then revealed that Sabo had put on Luffy's former gladiator clothing and had taken on the identity of Lucy. Sabo then told Koala to inform him if any more news about the underground is found, and then said that he is going to get Ace's fruit back. Sabo then states that he must inherit Ace's power as he walks towards the arena."}, {"type": "paragraph", "text": "He was then seen standing next to Bartolomeo at the observation deck. After every big-name fighter in Block D was struck down rather quickly, Sabo commented that he heard rumors of a certain individual, referring to Cavendish's alter-ego, Hakuba."}, {"type": "paragraph", "text": "When Rebecca was the only one who stood back up and declared the winner of Block D, Sabo praised her for being able to avoid Hakuba's attack. However, Sabo also stated that he would still not let her win the Mera Mera no Mi."}, {"type": "paragraph", "text": "He later met Rebecca after she left the arena. She waved to him but then noticed that he was not the same Lucy she knew. Sabo briefly spoke to her and then walked by noting to himself how similar Dressrosa was to the country he and Luffy grew up in. When the finals was about to start, Sabo was the first to enter the arena, cheerfully asking Ace to watch over him."}, {"type": "paragraph", "text": "Once the other block winners and Diamante were present in the arena, Sabo took a mental note of Burgess. After Diamante explained the rules of this round, a five-person battle royale commenced. Sabo was later seen easily dodging an attack from a Fighting Fish."}, {"type": "paragraph", "text": "When the fighting fish holding the Mera Mera no Mi came close to the arena, Sabo jumped on to it. Diamante attempted to attack him, but Sabo was able to break his weapon. Burgess attempted to take out both of them with his Surge Elbow but Sabo took him head-on with his Busoshoku Haki infused Dragon Talon and managed to break the armor surrounding his right arm. He commented that getting the fruit would not be easy."}, {"type": "paragraph", "text": "Later, when Rebecca took a blow from Diamante, Sabo asked Bartolomeo to protect her. Sabo continued to engage Burgess in heated combat with their clash causing more damage to the colosseum."}, {"type": "paragraph", "text": "When all the toys in the audience transformed back into their original forms, Sabo proceeded to demolish the entire arena. As the ring collapsed into the underground, Sabo quickly jumped on the Fighting Fish holding the Mera Mera no Mi. He ripped open the chest and after landing back in the core of the ring and telling the announcer that he had won, took a bite out of the fruit, expressing how disgusting it tasted immediately afterwards. He then grabbed Rebecca and jumped into the air as his helmet and fake beard fell off. While in midair, he used Hiken and completely destroyed the arena and exposed the underground."}, {"type": "paragraph", "text": "After saving Rebecca and getting to safety, Koala returned his clothes to him, as Sabo continued to have a hard time controlling the fruit's power. After Rebecca noticed that he was not the original Lucy, Sabo confirmed this and told her that the old Lucy was his younger brother, Luffy, and that they were from the Revolutionary Army. He also informed Rebecca that they were there to stop the production of weapons that were promoting wars all over the world, and the place where they were produced was located somewhere else, declaring that it would be a nice souvenir for Dragon if they found it. After he and Koala reunited with Robin and met Usopp, they later watched in shock as Doflamingo initiated his \"bird cage\" plan and created a \"game\" which gives the citizens of Dressrosa a choice to either kill him or a list of people he offers to them."}, {"type": "paragraph", "text": "After Doflamingo announced his hit list, Sabo was surprised to see that he was included in the list alongside Rebecca, Robin, and Usopp. When the former toys who swore their loyalty to Usopp became their enemies, Sabo, Koala, Hack, Usopp, Robin, Rebecca, Bartolomeo, and the Tontatta dwarves fled from the mob. Sabo separated from the group while escaping."}, {"type": "paragraph", "text": "While Luffy and his allies from the colosseum charged up the New King's Plateau to reach Doflamingo, Sabo was shown preventing Issho and the Marines from going after them. Issho asked Sabo if that was his duty as a revolutionary. Sabo replied that he was doing his duty as a brother."}, {"type": "paragraph", "text": "Sabo then overwhelmed several Marines. When Bastille charged at him, he effortlessly destroyed Bastille's sword right before dealing the finishing blow to the vice admiral. After crushing Bastille's mask, Sabo revealed his relation to Luffy and Ace before clashing against Fujitora."}, {"type": "paragraph", "text": "As the battle raged on, Sabo asked Issho why he was acting oblivious. Issho admitted his bluff and jokingly asked Sabo to show mercy towards him due to his blindness. Sabo then told the admiral that he does not discriminate against anyone. Issho noted that Sabo was not all talk after all, but asserted that he also had a title and reputation to maintain and used Ferocious Tiger to make gravity go horizontally with enormous pressure, destroying several buildings in the process as the sheer force made Sabo burst into flames as he charged forward, clashing with Issho once more, causing Sabo to ponder just what the admiral was plotting. Issho then told the young revolutionary that he was willing to bet his life on their fight."}, {"type": "paragraph", "text": "Fujitora ultimately decided to end their battle after revealing his views on how it was impossible for even the Marines to become heroes. When Sabo asked him about what would happen if someone discovered how he feels, Issho called it a gamble and wished Sabo good luck. After resting for awhile after the fight, Sabo received a scolding from Koala, who reprimanded him for not maintaining his position and potentially risking the Revolutionaries being forced into war by fighting with an admiral. Dismissing his duties because of Luffy being in danger, Koala violently pinched his cheeks and scolded him for his selfishness."}, {"type": "paragraph", "text": "Sabo was later seen helping the Dressrosa citizens, saving the last of which from a falling stone wall."}, {"type": "paragraph", "text": "Afterwards, he went back to the colosseum and freed the prisoners there. Koala then contacted him, telling him to come to the palace. While reluctant, Sabo quickly changed his tune when she told him Luffy's life would be in danger, and he quickly made his way to the palace."}, {"type": "paragraph", "text": "On the way to the palace, Sabo noticed that the Birdcage is shrinking."}, {"type": "paragraph", "text": "When Burgess entered the fray in an attempt to kill Luffy and take his Devil Fruit for himself, Koala quickly alerted Sabo, but Sabo did not reply. When Burgess finally made his move and attacked, Sabo intervened and kicked him away, smiling at a relieved Luffy afterwards."}, {"type": "paragraph", "text": "Sabo then informed Burgess of his relationship to Luffy and Burgess realized that Sabo was the Lucy who fought in the colosseum finals. After Luffy promised to defeat Doflamingo once he recovered, Sabo entrusted Gatz to him. Burgess then decided to take Sabo's Devil Fruit power and the two subsequently clashed. Sabo attacked Burgess with Flame: Dragon King, sending Burgess crashing through several buildings."}, {"type": "paragraph", "text": "Sabo later defeated Burgess by the time Luffy defeated Doflamingo. Burgess asked Sabo if he was going to kill him, but Sabo replied that he had no need to. Burgess then taunted Sabo by telling him what Ace said after Blackbeard captured him. In anguish, Sabo then grabbed Burgess on the face. Burgess grabbed his knife and went in for the kill, but Sabo blew him away with Fire Fist. Sabo was then contacted by Koala, who was waiting for him at the underground trade port. Sabo asked Koala if she found a list before hanging up on her."}, {"type": "paragraph", "text": "After things had settled down and Luffy and his friends went to Kyros' house to rest, Sabo went there during the night to see Luffy's face one last time. He told Robin that he would be leaving Dressrosa because CP-0 was coming back for the revolutionaries. After Zoro expressed his surprise at discovering that Luffy had another brother besides Ace, Sabo noted that it was probably most surprising for Luffy, as he had thought he was dead. He then went on to explain his past to Zoro, Franky, and Robin."}, {"type": "paragraph", "text": "Before departing, he gave Zoro a Vivre Card for Luffy and kept a piece for himself. He then entrusted Luffy's safety to the Straw Hats before leaving the house, something Zoro found amusing, since Ace had done the same thing two years prior when they met in Alabasta. Sabo then contacted Hack before heading for the harbor on a flock of birds."}, {"type": "paragraph", "text": "The revolutionaries later left Dressrosa and they apparently took all the weapons and evidence relating to the Donquixote Family's smuggling operation before CP-0 could recover them."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/e1/Luffy_reunites_with_Sabo.png/revision/latest/scale-to-width-down/210?cb=20150823151710", "caption": "Sabo reunites with Luffy after 12 years."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/1/1e/Sabo_Enters_the_Colosseum.png/revision/latest/scale-to-width-down/210?cb=20150823143847", "caption": "Sabo enters the arena."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/b/b5/Sabo_vs._Burgess.png/revision/latest/scale-to-width-down/210?cb=20150823143352", "caption": "Sabo and Burgess clash"}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/3/31/Sabo_Eating_the_Mera_Mera_no_Mi.png/revision/latest/scale-to-width-down/210?cb=20150823144306", "caption": "Sabo eats the Mera Mera no Mi."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/75/Doflamingo%27s_Hit_List.png/revision/latest/scale-to-width-down/180?cb=20150601013423", "caption": "Sabo included in Doflamingo's list of targets."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/7/72/Sabo_vs._Fujitora.png/revision/latest/scale-to-width-down/210?cb=20160201060349", "caption": "Sabo clashes with Issho."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/61/Sabo_Kicks_Burgess.png/revision/latest/scale-to-width-down/210?cb=20160214044112", "caption": "Sabo kicks Burgess away from Luffy."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/23/Sabo_defeats_Burgess.png/revision/latest/scale-to-width-down/210?cb=20160818232158", "caption": "Enraged after being taunted about Ace's death, Sabo uses Hiken against Burgess."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/62/Fighters_Resting_at_Kyros%27s_House.png/revision/latest/scale-to-width-down/180?cb=20160424225243", "caption": "Sabo reveals his past to the Straw Hats."}, {"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ad/Sabo_leaves_Dressrosa.png/revision/latest/scale-to-width-down/210?cb=20160424083404", "caption": "Sabo departs for the harbor to rendezvous with Koala and Hack."}]}, {"title": "Yonko Saga", "level": 3, "content": [{"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece Film: Gold", "level": 4, "content": [{"type": "paragraph", "text": "Sabo and Koala were on a Revolutionary ship heading to Gran Tesoro in order to rescue the lost Raise Max. The next night, when the Marines attacked Gran Tesoro, Sabo appeared on the lead Marine ship in order to stop Rob Lucci from attacking Luffy. The two had a brief battle until Gild Tesoro's defeated body fell between them, and Lucci took his leave. Sabo returned to the Revolutionary ship, and he, Koala, and the liberated Raise Max sailed away."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/4/4d/Sabo_Fights_Lucci.png/revision/latest/scale-to-width-down/210?cb=20170122224647", "caption": "Sabo fights Rob Lucci to prevent the agent from attacking Luffy."}]}, {"title": "Zou Arc", "level": 4, "content": [{"type": "paragraph", "text": "After returning to the Revolutionaries' base at Baltigo with the weapons and reporting to Dragon, Sabo went outside to train with his new flame powers."}], "images": []}, {"title": "From the Decks of the World: The 500,000,000 Man Arc", "level": 4, "content": [{"type": "paragraph", "text": "As the news of the Straw Hats' accomplishment at Dressrosa spread throughout the world, Dragon, Sabo, and Koala read about the Straw Hat Pirates' new bounties."}], "images": []}, {"title": "Whole Cake Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sometime later, a newspaper explained about Blackbeard's attack on Baltigo. The island was destroyed by the time the Marines and Cipher Pol arrived."}], "images": []}, {"title": "Levely Arc", "level": 4, "content": [{"type": "paragraph", "text": "The Revolutionary Army escaped the destruction of Baltigo and they moved their base to Momoiro Island. Sabo read the newspaper talking about Luffy's exploits at Totto Land and was proud of him. One of the revolutionary commanders, Lindbergh, contacted Sabo through a Den Den Mushi and informed him that he and three other commanders would be arriving late for Dragon's meeting. While waiting for all the revolutionary commanders to arrive, Dragon spoke to Sabo and discussed their plan to declare war on the World Nobles during the Levely."}, {"type": "paragraph", "text": "Sabo later infiltrated Mary Geoise along with Lindbergh, Morley, and Karasu. Sabo disguised himself as one of the guards. While riding the bondola with Sterry and the Neptune Family, Sabo assured Sterry when the latter was terrified after seeing a group of crows."}, {"type": "paragraph", "text": "While hiding underground with the revolutionary executives, Sabo resolved to save Kuma from his enslavement to the World Nobles."}, {"type": "paragraph", "text": "The following events are Non-Canon and therefore not considered part of the Canon story."}], "images": []}, {"title": "One Piece: Stampede", "level": 4, "content": [{"type": "paragraph", "text": "Sabo came to Delta Island where Buena Festa was hosting the Pirates Expo. As the pirate Douglas Bullet rampaged through the island in a massive colossus, Sabo encountered Smoker and the two briefly battled to a draw. They and Boa Hancock were then approached by Trafalgar Law, who told them and Luffy his plan for destroying Bullet's colossus. Luffy, Hancock, and Crocodile attacked Bullet, allowing Law to cut through his Haki. Sabo and Smoker then attacked the opening with a combination attack, blowing the colossus' right arm off. Luffy then overwhelmed Bullet with a powerful attack, allowing the group to destroy the colossus with a second series of attacks, and Luffy proceeded to defeat Bullet."}, {"type": "paragraph", "text": "Sabo then went to apprehend Buena Festa, who mourned Bullet's failure to create a new era. Festa attempted to shoot Sabo by surprise, but Sabo defeated him first with Hiken and captured him. As the pirates on Delta Island attempted to escape through a fleet of Marine Buster Call ships, Sabo talked to the rescued Expo announcer Ann and asked if she could create an illusion of Ace. Sabo then unleashed fire to protect the pirates from Kizaru's light beams and created a fire wall to give the pirates safe passage, allowing Luffy to see him and the Ace illusion do this in tandem."}, {"type": "paragraph", "text": "Concludes non-canon section."}], "images": []}, {"title": "Wano Country Arc", "level": 4, "content": [{"type": "paragraph", "text": "On the fourth day of the Levely, Sabo and his group battled Fujitora and Ryokugyu to rescue Kuma."}, {"type": "paragraph", "text": "At some point, Sabo became the focus of some distressing news."}], "images": []}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sabo and Portgas D. Ace vs. Porchemy", "elements": []}, {"text": "Sabo vs. Portgas D. Ace (multiple times)", "elements": []}, {"text": "Sabo vs. Monkey D. Luffy (multiple times)", "elements": []}, {"text": "Corrida Colosseum Finale", "elements": [{"text": "Lucy (Sabo) vs. Fighting Fish", "elements": []}, {"text": "Lucy (Sabo) vs. Diamante", "elements": []}, {"text": "Lucy (Sabo) vs. Jesus Burgess", "elements": []}]}, {"text": "Sabo vs. Marines", "elements": []}, {"text": "Sabo vs. Bastille", "elements": []}, {"text": "Sabo vs. Issho", "elements": []}, {"text": "Sabo vs. Jesus Burgess", "elements": []}, {"text": "Revolutionary Army vs. Blackbeard Pirates (unseen)", "elements": []}, {"text": "Sabo, Morley, Lindbergh, and Karasu vs. Issho and Ryokugyu (unseen)", "elements": []}]}], "images": []}, {"title": "Filler and Movie Battles", "level": 3, "content": [{"type": "list", "elements": [{"text": "Sabo, Portgas D. Ace, and Monkey D. Luffy vs. a giant tiger", "elements": []}, {"text": "Sabo, Portgas D. Ace, Monkey D. Luffy, and Naguri vs. a giant bear", "elements": []}, {"text": "Sabo, Portgas D. Ace, and Monkey D. Luffy vs. Bluejam Pirates members", "elements": []}, {"text": "Sabo vs. Hack", "elements": []}, {"text": "Sabo vs. Bartholomew Kuma and Monkey D. Dragon", "elements": []}, {"text": "Sabo vs. an army of an unknown country", "elements": []}, {"text": "Sabo vs. Rob Lucci", "elements": []}, {"text": "Sabo vs. Smoker", "elements": []}, {"text": "Sabo, Luffy, Law, Smoker, Boa Hancock, Buggy, and Rob Lucci vs. Douglas Bullet", "elements": []}, {"text": "Sabo vs. Buena Festa", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [], "images": []}, {"title": "Knowledge of Ace's Heritage", "level": 3, "content": [{"type": "paragraph", "text": "In the manga, it is unknown whether or not Sabo was aware of Ace being Gol D. Roger's son. In the anime, he was fully aware of this fact, as well as the one who informed Luffy of it."}], "images": []}, {"title": "2Y", "level": 3, "content": [{"type": "paragraph", "text": "In the ending credit of 3D2Y, Sabo was shown placing the sake cups in front of Ace's grave. Although he did so in the manga as well, the actual action was not seen there. This may serve as a major spoiler as the special was shown before the episode in which Sabo was revealed to be alive, even though his actual face was not shown in the at this instance. Also, the conversation between Luffy and Sabo during their reunion was slightly different, due to the special being produced before their conversation was revealed in Chapter 794."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/2/24/Sabo_Visits_Ace_and_Whitebeard%27s_Grave.png/revision/latest/scale-to-width-down/210?cb=20141206205312", "caption": "Sabo visiting Ace's grave."}]}, {"title": "Dressrosa Arc", "level": 3, "content": [{"type": "paragraph", "text": "The anime reintroduces Sabo an episode before he meets Luffy and Bartolomeo, where he is seen briefly looking at the entrance to the arena inside the colosseum before setting off to find Luffy. Additionally, the anime also adds dialogue to their reunion, contrary to the manga chapter it was based off of. As a result, this dialogue ultimately ended up contradicting the manga - as Sabo's reunion with Luffy was fully revealed in a later chapter - dialogue included. As a result, the improvised greeting Sabo gives to Luffy in the anime is omitted in Episode 738, which adapts the full reunion from the manga."}, {"type": "paragraph", "text": "During the flashback of Sabo's past - the anime showcases his time with the revolutionaries up until the present timeline, even though his training with Hack and subsequent missions as a Revolutionary have not been shown in the manga chapter the episodes were based on. These non-canon scenes also depict how he started utilizing a pipe as his weapon of choice again. Additionally, the scene of Sabo visiting Ace's grave from Episode of Sabo was used in the following episode."}, {"type": "paragraph", "text": "During a revolutionary mission in Episode 737, Sabo was shown using Kenbunshoku Haki to dodge gunfire, even though he has not shown any usage of it in the manga"}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "paragraph", "text": "Although Sabo's rank of Sanbō sōchō (参謀総長) is commonly translated as Chief of Staff, it differs from the actual translation of Chief of Staff, which would be Sanbō-chō (参謀長), as used by Cabaji. However, this difference is lost in common translation. On the other hand, Chief of the General Staff would be a more proper translation as it reflects the usage of sō (総) and is commonly translated as such for real-world military positions."}], "images": []}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Super Grand Battle! X", "elements": []}, {"text": "One Py Berry Match", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Pirate Warriors 4", "elements": []}, {"text": "One Piece Thousand Storm", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}, {"text": "One Piece: Great Pirate Colosseum", "elements": []}, {"text": "Jump Force", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle! 2 New World", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "On the cover of Chapter 596, Sabo was shown as a young man. He was portrayed as tall and muscular like Ace, and was still wearing the same attire he wore as a child but made bigger to fit his size, and was carrying a bo staff. He was bare chested like his brothers. He seemed to have longer hair, and his eyes were hidden by his hat's brim. Ace's tattoo is written as \"ACE\" instead of the original \"ACE\". This suggests that the  was a tribute to Sabo, as the cover is a \"what if\" image of Ace, Luffy, and Sabo together as adults.", "elements": [{"text": "When Sabo made his first full appearance as an adult, however, he was wearing a shirt, long pants, gloves and his hair was longer than this reimagination.", "elements": []}]}, {"text": "Sabo's character is first hinted at in Chapter 558 where a third sake cup can slightly be seen in a flashback of the boys' brotherhood initiation.", "elements": []}, {"text": "Sabo's appearance is similar to that of the character Artful Dodger from Charles Dickens' Oliver Twist. He too was part of a gang of child thieves. His signature appearance included a top hat and an adult's waistcoat with the sleeves rolled up.", "elements": []}, {"text": "Sabo's fate was hinted at twice. Once during a conversation between Ivankov and Dragon during Episode 504, and again on the cover page of Chapter 668 as three cups of sake were placed before the grave of Ace with a newspaper article about Luffy pinned to the grave. It was later revealed that Sabo was the one who placed it there.", "elements": []}, {"text": "Sabo makes his animated debut in the present storyline in the 3D2Y special, rather than the anime.", "elements": []}, {"text": "In the 6th Japanese fan poll, Sabo ranked as the ninth most popular character in One Piece, making him the most popular of the Revolutionary Army.", "elements": []}, {"text": "Compared to Luffy and Ace, Sabo is the tallest out of the three brothers, measuring in at 187 cm (6'1½\"), making him 2 cm (½\") taller than Ace, who stood at 185 cm (6'1\") before his death.", "elements": []}, {"text": "Sabo's role in the story thus far has mirrored that of Ace's during the first half of the series to a certain extent.", "elements": [{"text": "Both characters are introduced in the present timeline during an arc that features a Shichibukai as the main antagonist, and both of whom were deceiving a kingdom, in regards to Alabasta and Dressrosa respectively.", "elements": []}, {"text": "Both Ace and Sabo protected Luffy from an antagonist (or antagonists in Sabo's case) that he could not fight at the time (Smoker, Fujitora and Burgess respectively)", "elements": []}, {"text": "Before departing, both Ace and Sabo left Vivre Cards and entrusted Luffy's safety to his crew. Although these events are slightly different, as Ace had given a Vivre Card to Luffy in order for him to find him in the future - and Sabo gave Luffy's crew a Vivre Card to help them find Luffy, and kept one for himself.", "elements": []}]}, {"text": "Sabo also shares some similarities to the Straw Hat Pirates' chef, Sanji.", "elements": [{"text": "Both have fire powers, Mera Mera no Mi for Sabo and Diable Jambe for Sanji. ", "elements": []}, {"text": "Both were born into families of the high society (Sabo a Noble and Sanji a Prince) before leaving that life behind.", "elements": []}, {"text": "Both of their own fathers (Outlook III and Vinsmoke Judge) view them as disappointments.", "elements": []}, {"text": "Both escaped from their families to have a different life.", "elements": []}, {"text": "Both returned to their family to prevent their loved ones from getting killed and were threatened by their fathers if they did not cooperate (Luffy and Ace for Sabo, Zeff for Sanji).", "elements": []}, {"text": "Both had pirates involved in their return to their families (the Bluejam Pirates in Sabo's, and the Big Mom Pirates in Sanji's).", "elements": []}]}, {"text": "He is the only known revolutionary to use Haki.", "elements": []}, {"text": "Sabo shares his birthday, March 20th with Shiki.", "elements": []}, {"text": "Sabo's favorite food is ramen.", "elements": [{"text": "The voice actress for 10-year-old Sabo, Junko Takeuchi, is well-known for voicing the character Uzumaki Naruto (protagonist of manga franchise Naruto) whose favorite food is also ramen.", "elements": []}]}, {"text": "Sabo’s new English voice actor Johnny Young Bosch is also known for voicing Lelouch Vi Britiania, another aristocrat turned revolutionary.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/6/69/Adult_Sabo.png/revision/latest/scale-to-width-down/200?cb=20140409085546", "caption": "Sabo portrayed as a 20 year old adult, alongside Ace and Luffy."}]}]}