{"sections": [{"title": "Sentomaru", "level": 1, "content": [{"type": "paragraph", "text": "Sentomaru is the bodyguard of Vegapunk and is in command of the Marines' Science Unit (科学部隊, Kagaku Butai) as its Captain (隊長 Taichō). After the timeskip, he has become a full-fledged Marine officer. Due to his actions, he can be considered the secondary antagonist of the Return to Sabaody Arc."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Sentomaru is a large man with light skin and a stocky build similar to that of a sumo wrestler. He has a large scar extending from his left eye to the left corner of his mouth. His outfit consists of a shirt that resembles a giant brown bib or apron with an emblem meaning \"heaven\" on the front, and a large red and white rope or \"tsuna\" (traditionally worn by yokozunas). Sentomaru also has bandages wrapped around his right fist and elbows, along with the Kanji Sen (戦, battle) tattooed on his left shoulder. Sentomaru carries around a huge, two-edged axe, as tall as himself, and just as large."}, {"type": "paragraph", "text": "Following the timeskip, he is shown wearing a Marine coat over his shoulders due to his acceptance into the Marines. He has also removed the bandages around his arms. On his coat, the middle design's outline changed from a light green to white and the white tomoe around that became thicker."}], "images": []}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "Since he asserts to having the tightest defense, Sentomaru also claims to have the tightest mouth and refuses to reply to any questions. However, despite his claim, he is willing to tell everyone about himself whenever something related to a question or an event occurs. Whenever he gives away information, he claims he is giving it away freely and not because the person he is talking to asked or was curious about something."}, {"type": "paragraph", "text": "Sentomaru is confident in his abilities. He took it upon himself to deal with the Straw Hat Pirates with only PX-1 to accompany him. He remains unfazed even in the most serious events, as he was surprised to see Chopper in his monster form while keeping his composure. He was visibly shocked when Luffy easily defeated a Pacifista two years later."}, {"type": "paragraph", "text": "He appears to be perceptive as well, having quickly observed that Luffy enforced the impact of a Jet Pistol with Busoshoku Haki after striking down a Pacifista."}, {"type": "paragraph", "text": "He is very loyal to the Marines and although he does not have anything against pirates, he still takes his duty to apprehend them, as he went after the Straw Hat Pirates. After the two year timeskip where Sentomaru was officially inducted into the Marine ranks, he takes the position bestowed upon him very seriously, having opted to partake in the attempted arrest of the Straw Hat Pirates after they were reported to have once again appeared in Sabaody Archipelago, with two Pacifista units to back him up."}, {"type": "paragraph", "text": "Sentomaru seems to have a sense of respect for worthy opponents, as when confronting and questioning the fake Luffy, who boasted that he was the real felon, Sentomaru notes that Luffy was not a piece of filth like he was. He seems to show disinterest when someone does not meet his expectations, as he pointed out that Devil Dias could not possibly have survived in the New World after he attempted to escape from the World Nobles. He even called the pirates who joined the Fake Straw Hat Crew \"idiots\" because he felt that they were dumb enough to be fooled in the first place."}], "images": []}, {"title": "Relationships", "level": 2, "content": [], "images": []}, {"title": "Marines", "level": 3, "content": [{"type": "paragraph", "text": "Sentomaru refers to Kizaru as \"Uncle\" (黄猿のオジキ, Kizaru no Ojiki, a Japanese word commonly used to refer to a yakuza family \"father\" boss). The Japanese term used does not mean they are family. It truly means that the pair are on a high level of respect (despite Sentomaru shouting at Kizaru for using the wrong Den Den Mushi). He has the rank of science captain, implying some degree of authority, and becomes an enlisted Marine following the timeskip."}], "images": []}, {"title": "Dr. Vegapunk", "level": 3, "content": [{"type": "paragraph", "text": "Little is known of Sentomaru's relationship with Vegapunk other than his professional relationship as Vegapunk's bodyguard and captain within the Marine Science Unit."}], "images": []}, {"title": "Pacifista", "level": 3, "content": [{"type": "paragraph", "text": "Sentomaru is able to command Pacifistas and is one of the few people they are shown to obey besides Kuma. Presumably his ability to command them is due to him being a Captain in the Marine Science Unit and is shown to be somewhat knowledgeable of their capabilities. He also seems to be able to identify individual PX units by their serial number."}], "images": []}, {"title": "Pirates", "level": 3, "content": [{"type": "paragraph", "text": "Sentomaru claims that he does not \"particularly have anything against pirates\". Nevertheless, he still fights against the Straw Hat Pirates with PX-1 and Kizaru. He was also anxious for Kizaru to contact him, as he was afraid that the rookies would all be killed if he did not. This was when Sentomaru was just a bodyguard for Vegapunk. Following the timeskip, Sentomaru has joined the Marines and his attitude does not seem to have changed much, though he does seem to take pride in the fact that he can now arrest pirates officially. He planned to arrest all the pirates who joined the Fake Straw Hat Crew, despite them being tricked by a group he considered to be \"idiots\", because he felt that they were dumb enough to be fooled in the first place."}, {"type": "paragraph", "text": "He has shown a certain level of respect for Monkey D. Luffy, having fought him personally. When he defeated Demaro Black, he dismissed him as someone worthless and an insult to Luffy's name."}, {"type": "paragraph", "text": "When he confronted the real Luffy, he swore to capture him but was shocked as Luffy not only evaded the laser beams of a Pacifista but also destroyed it with one punch. He deduced that Luffy used Haki and could not stop him from leaving as the latter met up with Zoro and Sanji. He tried to have the other Pacifista attack them though he was shocked to see them destroy it easily as well. While arresting the recruits of the Impostor Straw Hats, Sentomaru reported to his superiors that the real Straw Hats were alive and on a dangerous level."}], "images": []}, {"title": "Bartholomew Kuma", "level": 4, "content": [{"type": "paragraph", "text": "Not much is known about their relationship, but Sentomaru did address the Shichibukai as \"Kuma-ko\" (くま公, Kuma-kō), an honorific meant as a sarcastic and insulting way of addressing someone. Any possible relationship may stem from Dr. Vegapunk's research facility (as Sentomaru is the bodyguard, while Kuma is the weapon)."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "Sentomaru claims to be a world-class guard. His fighting style is similar that of Bartholomew Kuma's, standing like a sumo-wrestler and striking with open-palm thrusts which are enhanced through the use of Haki. This allows him to injure even Devil Fruit users as easily as normal people. He is faster than his size and build would suggest, being able to outpace Luffy's normal running speed. In addition, he appeared unfazed by Usopp's giant smokescreen shortly beforehand. The fact that he was in charge of the Marine's Science Unit suggests that he has great insight in that field of expertise."}], "images": []}, {"title": "Weapons", "level": 3, "content": [{"type": "paragraph", "text": "Sentomaru carries a massive broadaxe, but only uses it against tougher opponents such as Chopper in his monster form. He used the broad side to flatten Demaro Black."}], "images": []}, {"title": "Haki", "level": 3, "content": [], "images": []}, {"title": "Busoshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Sentomaru can use Busoshoku Haki to enhance his attacks. His control is such that he can not only strike Devil Fruit users and cause them harm by bypassing their defenses, but do so without actually making physical contact. He claims to have the \"world's greatest defense\", shown when Luffy could not land even a single punch on him."}, {"type": "paragraph", "text": "Sentomaru can use Busoshoku Haki at an advanced level that allows him to emit his armament a short distance without a medium."}], "images": []}, {"title": "Kenbunshoku Haki", "level": 4, "content": [{"type": "paragraph", "text": "Sentomaru possesses the ability to use Kenbunshoku Haki."}], "images": []}, {"title": "Attacks", "level": 3, "content": [{"type": "list", "elements": [{"text": "Ashigara Dokkoi (, Ashigara Dokkoi, literally meaning \"Leg-Locked Heave-Ho\"): Sentomaru smashes his opponents with an open-palm using Busoshoku Haki. It does not actually need to connect to cause damage; the force of his Haki alone is enough to send his opponents flying and cause damage. This was first seen used against Luffy. The name of this attack is a pun as \"Ashigara\" (Japanese for \"Leg-Locked\") sounds the same as Ashigara, the name of the mountain where Kintaro (the character on whom Sentomaru is based) was raised. This is called Sumo Strike in the Viz Manga and Ashigara Dokkoi Shove in the FUNimation sub and dub.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/fa/Ashigara_Dokkoi.png/revision/latest/scale-to-width-down/230?cb=20130209044000", "caption": "Sentomaru using Ashigara Dokkoi against Luffy."}]}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Summit War Saga", "level": 3, "content": [], "images": []}, {"title": "Sabaody Archipelago Arc", "level": 4, "content": [{"type": "paragraph", "text": "Sentomaru was first seen on top of a building when Devil Dias attempted to escape his slavery from his World Noble enslavers. Sentomaru had been disappointed that Dias could not possibly have survived in the New World."}, {"type": "paragraph", "text": "When Kizaru arrived on the island, he attempted to look for his subordinate but was unsuccessful. Later, Sentomaru was seen on top of a building wondering why Kizaru had not contacted him, since the fight had already started. When Sentomaru finally contacted Kizaru, he scolded him for trying to use a Black Den Den Mushi instead of his Baby Den Den Mushi."}, {"type": "paragraph", "text": "After the Straw Hats defeated PX-4, Sentomaru arrived, revealing only his name in passing, and attacked the Straw Hats with PX-1. Luffy attempted to split up the Straw Hats, but Sentomaru went after him, Robin, and Chopper while PX-1 pursued Nami, Franky, and Sanji. Luffy tried to attack Sentomaru, but without effect, and Sentomaru knocked his opponent back, claiming to have the strongest defense in the world."}, {"type": "paragraph", "text": "He managed to best the weakened Luffy physically even without using his broad axe. During the fight, despite his claim of being the \"most silent man in the world\", he revealed many things about Kuma and his powers. He was last seen looking surprised at Chopper's \"Monster\" form before being attacked."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/c/c4/Sentoumaru-fight.png/revision/latest/scale-to-width-down/230?cb=20101022022008", "caption": "Sentomaru and Luffy meet each other."}]}, {"title": "Marineford Arc", "level": 4, "content": [{"type": "paragraph", "text": "Near the final stretches of the Battle of Marineford, Sentomaru arrived from the back of the bay with an army of at least twenty Pacifista. This was the master stroke of the Marines' strategy, which would change the battle and enforce it to its final phase. Sentomaru claimed that they have waited long enough, and it was their turn to strike."}, {"type": "paragraph", "text": "Sentomaru was seen later in the battle, complaining to Boa Hancock for destroying some of the Pacifistas. When Hancock, being asked why she acted that way, replied that \"love strikes like a hurricane\", Sentomaru remained quite confused about the sense of the answer."}, {"type": "paragraph", "text": "After Shanks' arrival, he stood down along with the Pacifistas he commanded."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/f/f3/Sentomaru_Arrives_with_an_Army_of_Pacifista_at_Marineford.png/revision/latest/scale-to-width-down/230?cb=20141206162213", "caption": "Sentomaru arrives with an army of Pacifistas."}]}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Return to Sabaody Arc", "level": 4, "content": [{"type": "paragraph", "text": "After confirmation had been made that the Straw Hat Pirates had returned, Sentomaru, now officially a member of the marines, was eager to head out and fight Luffy once again, commenting that he was on a different level from the rookies who arrive on the Archipelago every now and then. He also mobilized PX-5 and PX-7, knowing that Luffy must have got stronger after two years. Sentomaru then stated that the strange actions that Kuma started two years prior suddenly ended without any explanation and he figured that the Straw Hats would return to the island one day."}, {"type": "paragraph", "text": "He later arrived to Saboady Archipelago Grove 46 with the Marines, surrounding the pirates and blocking all entrances and exits. As the Pacifistas were decimating the assembled pirates, Sentomaru confronted the Luffy impostor, questioning why was he being called \"Straw Hat\". All the impostor could do was try to intimidate Sentomaru with Luffy's reputation and heritage."}, {"type": "paragraph", "text": "Unfazed by the impostor's empty threats, Sentomaru proceeded to smash him into the ground with the broad side of his axe. Disgusted by the fake trying to pretend to be the real Luffy, he then ordered PX-5 to identify him: \"Three-Tongued\" Demaro Black, bounty 26,000,000. Sentomaru realized that the pirates had been fooled, but decided that the fact that they allowed themselves to be fooled was reason enough to arrest them. Having been made aware of the real Luffy's presence by the Pacifista, he ordered PX-5 to target him. Luffy dodged PX-5's laser, but the blast made him lose his disguise. Sentomaru once again ordered PX-5 to attack Luffy, but Luffy dodged the second attack with ease and destroyed PX-5 with a single, Haki-imbued Gomu Gomu no Jet Pistol. Sentomaru was shocked by Luffy's ability to wield Haki. Luffy then left the scene, despite Sentomaru's ineffectual pleas for him to wait."}, {"type": "paragraph", "text": "When Zoro and Sanji showed up, Sentomaru ordered PX-7 to attack them. The two managed to defeat the Pacifista with ease, shocking Sentomaru, who realized the Straw Hats had got stronger in the last two years and were now on a more dangerous level. He was then left to watch as the Monster Trio fled the area back to their ship as Marine soldiers chased them unsuccessfully."}, {"type": "paragraph", "text": "After the Straw Hats escaped, Sentomaru informed his superiors about the events that transpired on the Archipelago, with Black tied up and unconscious in front of him, while having the rest of his men arrest the allies who were deceived, all while warning the marines through a Den Den Mushi that the real Straw Hat crew had not only returned, but have grown greatly in the past two years and were heading to the New World."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/a/ac/Demaro_Black_Easily_Defeated_by_Sentomaru.png/revision/latest/scale-to-width-down/250?cb=20130829040120", "caption": "Sentomaru smashes Black into the ground."}]}, {"title": "Major Battles", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sentomaru, Kizaru and PX-1 vs. Straw Hat Pirates", "elements": []}, {"text": "Sentomaru and Pacifistas vs. Whitebeard Pirates and their allies", "elements": []}, {"text": "Sentomaru vs. Boa Hancock", "elements": []}, {"text": "Sentomaru, PX-5 and PX-7 vs. subordinates of the Fake Straw Hat Crew", "elements": []}, {"text": "Sentomaru vs. Demaro Black", "elements": []}]}], "images": []}, {"title": "Translation and Dub Issues", "level": 2, "content": [{"type": "list", "elements": [{"text": "Sentomaru's name contains the kanji for \"peach\" (桃) in reference to the Japanese story Momotarō, from which the admiral names are also derived. He is also seen eating peaches while waiting for Kizaru to call him.", "elements": []}, {"text": "Each kanji in Sentomaru's name, when broken up, is read as Sen (戦, battle), to (桃, peach) and maru (丸, ring, also a suffix for male names). Put together, it means \"Battle Peach Ring\". When roughly translated, it means \"Little Fighting Peach\".", "elements": []}]}], "images": []}, {"title": "Anime and Manga Differences", "level": 2, "content": [{"type": "paragraph", "text": "In the manga, Sentomaru was seen looking through bounty posters after Dias was shot and named his name and bounty. In the anime this never happened, leaving Dias' name unknown to the audience."}], "images": []}, {"title": "Other Appearances", "level": 2, "content": [], "images": []}, {"title": "Other Media", "level": 3, "content": [{"type": "list", "elements": [{"text": "Sentomaru is shown during the One Piece Premier Show 2012 as a member of the Marines against the New World pirate, Chameleone.", "elements": []}]}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/9/92/Sento_Drip_Premiere_Show.png/revision/latest/scale-to-width-down/210?cb=20130128003248", "caption": "Sentomaru and Drip as they appear in the show."}]}, {"title": "Merchandise", "level": 2, "content": [], "images": []}, {"title": "Video Games", "level": 3, "content": [], "images": []}, {"title": "Playable Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Py Berry Match", "elements": []}]}], "images": []}, {"title": "Enemy Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Pirate Warriors", "elements": []}]}], "images": []}, {"title": "Support Appearances", "level": 4, "content": [{"type": "list", "elements": [{"text": "One Piece: Gigant Battle", "elements": []}, {"text": "One Piece: Gigant Battle! 2 New World", "elements": []}, {"text": "One Piece: Pirate Warriors 2", "elements": []}, {"text": "One Piece: Pirate Warriors 3", "elements": []}, {"text": "One Piece: Burning Blood", "elements": []}]}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "His design is heavily based on that of the Japanese folklore hero Kintarō (also known as samurai Sakata no Kintoki), who was notable for wearing nothing but a bib, carrying a massive axe, and sumo wrestling with bears. Additionally, his attack, Ashigara Dokkoi, is a pun on Mt. Ashigara, the place where Kintaro was raised. However, his name, Sentomaru (戦桃丸 - literally \"Battle Peach Boy\") is most likely derived from another popular Japanese folklore hero, Momotaro.", "elements": []}, {"text": "Sentomaru, like Enel, is seen with the tomoe symbol; in his case, on the \"heaven\" emblem on his outfit.", "elements": []}, {"text": "He is the first character in the series to have his name written in kanji, rather than katakana or hiragana (barring aliased people like the three admirals). This characteristic is later shared with those from Wano Country.", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 511 and Episode 403, Sentomaru's occupation is revealed in his introduction box.", "elements": []}, {"text": "↑  One Piece Blue Deep: Characters World (p. 100), Sentomaru's birthday is given.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Sentomaru's information is revealed.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Sentomaru's name is romanized.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 61 Chapter 597 and Episode 516, Luffy recognizes Sentomaru's Ashigara Dokkoi being imbued with Busoshoku Haki.", "elements": []}, {"text": "↑  One Piece Manga — Vol. 52 Chapter 511, Sentomaru hurts Luffy with Busoshoku Haki without touching him.", "elements": []}, {"text": "↑  Vivre Card - One Piece Visual Dictionary, Sentomaru is revealed to be a Kenbunshoku Haki user.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 51 Chapter 497 and Episode 391, Sentomaru's shadowy appearance when he commented on Dias' failed attempt escape.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 508 and Episode 401, Sentomaru wonders where Kizaru went to.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 52 Chapter 510 and Episode 402, Sentomaru scolds Kizaru over his error with the Den Den Mushi.", "elements": []}]}], "images": []}, {"title": "External Links", "level": 2, "content": [{"type": "list", "elements": [{"text": "Masakari – Wikipedia article on the type of axe Sentomaru uses.", "elements": []}, {"text": "Tsuna - A Wikipedia article about Sentomaru's dressing style.", "elements": []}]}], "images": []}]}