{"sections": [{"title": "Harisenbon", "level": 1, "content": [{"type": "paragraph", "text": "Harisenbon is a porcupinefish Fish-Man and a member of the now disbanded New Fish-Man Pirates. He was the commander of the Sea Urchin Armor Spine Squad."}], "images": []}, {"title": "Appearance", "level": 2, "content": [{"type": "paragraph", "text": "Harisenbon is a slim Fish-Man with lanky dark hair, a sharp face, tiny ears, and spikes jutting out of his arms and chest. He also has a dark outlined eyes. He wears an open light-colored shirt."}], "images": [{"src": "https://vignette.wikia.nocookie.net/onepiece/images/e/ef/Harisenbon%27s_Spikes.png/revision/latest/scale-to-width-down/200?cb=20150308230848", "caption": "Harisenbon showing his spikes."}]}, {"title": "Personality", "level": 2, "content": [{"type": "paragraph", "text": "As a member of the New Fish-Man Pirates, he hates humans. His voice also becomes much deeper when he swells up to reveal his needles."}], "images": []}, {"title": "Abilities and Powers", "level": 2, "content": [{"type": "paragraph", "text": "As a Fish-Man, he was born with the natural strength ten times that of an average human, and twice that underwater. The spikes on his body make it difficult for him to be harmed by unarmored melee attacks. He can inflate his body like a pufferfish, extending his spikes outwards in an attempt to stab the enemy. His powers and leadership skills apparently were enough for him to be the commander of the squadron."}], "images": []}, {"title": "History", "level": 2, "content": [], "images": []}, {"title": "Fish-Man Island Saga", "level": 3, "content": [], "images": []}, {"title": "Fish-Man Island Arc", "level": 4, "content": [{"type": "paragraph", "text": "He was present when Hody Jones and Vander Decken IX raided the palace and took over. When Hody went over to Gyoncorde Plaza, he was seen behind him on the sea animal. Harisenbon led the Sea Urchin Armor Spine Squad to attack Sanji with their spikes, but he simply jumped up and let the Fish-Men crash into each other."}], "images": []}, {"title": "Trivia", "level": 2, "content": [{"type": "list", "elements": [{"text": "\"Harisenbon\" (針千本, Harisenbon) means \"porcupinefish\" in Japanese. More literally, however, the three kanji that make it up literally mean \"a thousand long cylindrical needles\".", "elements": []}]}], "images": []}, {"title": "References", "level": 2, "content": [{"type": "list", "elements": [{"text": "↑  One Piece Manga and Anime — Vol. 63 Chapter 617 and Episode 555, Harisenbon makes his debut.", "elements": []}, {"text": "↑  One Piece Manga and Anime — Vol. 64 Chapter 635 and Episode 555, Harisenbon and his squadron attack Sanji.", "elements": []}]}], "images": []}]}